{"organizations": [], "uuid": "94a46f9cc433e72eb55eef8ac0281f94329b9604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/01/100607345-toys-r-us-shopper-getty.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/the-road-ahead-for-toys-r-us-likely-includes-even-more-store-closures.html", "country": "US", "domain_rank": 767, "title": "The road ahead for Toys R Us likely includes even more store closures", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T21:14:00.000+02:00", "replies_count": 0, "uuid": "94a46f9cc433e72eb55eef8ac0281f94329b9604"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/the-road-ahead-for-toys-r-us-likely-includes-even-more-store-closures.html", "ord_in_thread": 0, "title": "The road ahead for Toys R Us likely includes even more store closures", "locations": [], "entities": {"persons": [{"name": "stephanie wissink", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toys R Us is moving ahead with plans to shut roughly 20 percent of its U.S. stores, or 180 locations, and some say this is just the beginning.\n\"We see this as the first phase of a more robust real estate clean up effort at TRU,\" Jefferies analyst Stephanie Wissink said. \"The move has been anticipated, but the size of the closure and the timing was heavily debated.\"\nToys R Us filed for Chapter 11 bankruptcy protection last September, where management laid out plans to, in effect, open more stores — just in a smaller format. But a weaker-than-expected holiday season thwarted that strategy, and Toys R Us increasingly risks lagging behind the likes of Walmart , Target and Amazon as its sales wane.\nToday, in the U.S. alone, Toys R Us operates roughly 880 stores, including those under the Babies R Us brand.\nMany of these stores are leased back to a separate entity created by the company known as Toys R Us Property Co., or Propco. A handful of the retailer's locations are owned by real estate investment trusts including Kimco , Brixmor and DDR , and a smaller portion of stores are directly owned by the chain.\n\"The open question in the Toys case is what the impact will be on the two Propco loans that will be impacted by such real estate rationalization,\" Moody's retail analyst Charlie O'Shea said.\nAs Toys R Us has borrowed money and secured loans with its physical assets, many of its stores today are still tied up in financing, O'Shea explained, resulting in a somewhat-conflicting situation as those stores go dark.\nAs for the remainder of Toys R Us' real estate not serving as collateral, similar to Wissink, O'Shea said he expects more closures to come as leases are terminated and negotiations with landlords progress.\n\"There is no doubt that shuttering loss-making shops will allow the company to save money and focus its efforts on other channels and locations,\" Neil Saunders managing director at GlobalData Retail, told CNBC.\n\"Unless Toys R Us finds a way to become relevant to consumers, these store closures will do very little to ensure the future viability of the company,\" Saunders said.\nMoving forward, Toys R Us has said it plans to invest more heavily in its website, loyalty program and Babies R Us registry offering.\nWith more store closures potentially on the horizon, certain competitors could reap more benefits from Toys R Us' downsizing than others (i.e. mom and pop shops).\nTarget is a top candidate to win customers' dollars, according to UBS analysts Arpine Kocharyan and Michael Lasser. Walmart also sits in close proximity to many of Toys R Us' stores, and Amazon continues to expand and promote its toy assortment online, as it did this past holiday season.\nThrough the first half of 2018, though, as Toys R Us closes this first round of stores and liquidation sales persist, other toy retailers are going to have to adjust their inventories in order to \"minimize risk,\" Jefferies' Wissink said. But demand should balance back out in the second half of the year and ahead of the 2018 holiday season.\n\"Clearance events during February, March, and April will coincide with holiday inventory exits and Easter, but generally reflect a three-month period of relatively small sales volume within the year,\" she added. Thus, \"the overall impact to the industry is likely to be less meaningful than events of this nature at other points in the year.\"", "external_links": [], "published": "2018-01-24T21:14:00.000+02:00", "crawled": "2018-01-24T21:27:38.133+02:00", "highlightTitle": ""}