{"organizations": [], "uuid": "d8bc1c72b5aac31e493f8d1188f5fadee4c3efb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Trump-Bannon Feud Is the Death of Truth: CEO Daily for January 5, 2018 – Fortune", "url": "http://fortune.com/2018/01/05/ceo-daily-for-january-5-2018/", "country": "US", "domain_rank": 1196, "title": "Trump-Bannon Feud Is the Death of Truth: CEO Daily for January 5, 2018", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T14:17:00.000+02:00", "replies_count": 0, "uuid": "d8bc1c72b5aac31e493f8d1188f5fadee4c3efb1"}, "author": "Alan Murray, Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/05/ceo-daily-for-january-5-2018/", "ord_in_thread": 0, "title": "Trump-Bannon Feud Is the Death of Truth: CEO Daily for January 5, 2018", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "none"}, {"name": "roger ailes", "sentiment": "none"}, {"name": "john podhoretz", "sentiment": "none"}, {"name": "podhoretz", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top News \nTravis Kalanick reportedly plans to sell 29% of his Uber stake. \nUber’s co-founder and former CEO plans to sell roughly 29% of his stake in the company, sources told Bloomberg on Thursday. Kalanick, who was ousted from his role as CEO amid a series of scandals, could earn roughly $1.4 billion from the sale to a group of investors led by SoftBank Group, in a deal that would value Uber at $48 billion. Bloomberg \nZuckerberg’s New Year’s resolution: fix Facebook. \nThe Facebook CEO’s year personal challenge is more business-oriented than ever this year. Zuckerberg, who in the past has aspired to learn Mandarin and visit every U.S. state, said Thursday that his goal for 2018 is to tackle a handful of major issues facing his company, including online harassment on the social network as well as the ceaseless spread of misinformation and “fake news.” Fortune \nThe Dow Jones tops 25,000. \nIt was another record day for the Dow Jones Industrial Average. Estimates of strong private job growth in December helped boost the Dow, which gained about 0.6% to close above the 25,000-point milestone for the first time ever on Thursday. The blue-chip index has spiked more than 6,000 points since the 2016 election, with companies like Boeing and Caterpillar among those seeing the biggest stock gains in that period. Fortune \nComing soon: Apple’s fix for flawed chips. \nApple said this week that all Mac and iOS devices are affected by the two major security flaws (called Meltdown and Spectre) that are affecting many of the world’s computer chips. On Thursday, Apple promised to release a patch for its Safari web browser for iPhones, iPads, and Mac devices within a matter of days to guard against the flawed chips. The security flaws affecting computer chips made by Intel and other companies could allow hackers to get access to users’ confidential information. Reuters Around the Water Cooler \nJ.C. Penney CEO takes aim at Sears as rival closes more stores. \nJ.C. Penney CEO Marvin Ellison was clear on Thursday that his company has Sears in its sights after its struggling rival’s latest store closures. Sears said it is closing more than 100 stores after several previous rounds of closures in recent years. Meanwhile, Ellison’s Penney has been ramping up its home appliance sales in recent years and plans to continue taking advantage of Sears’ decline. Fortune \nSessions’ marijuana moves threaten multi-billion-dollar industry. \nAttorney General Jeff Sessions rescinded Obama Era policies that pushed federal non-interference with individual state laws legalizing marijuana. The move takes federal policy from a hands-off approach to one where federal prosecutors in each state can decide how to use government resources to crack down on marijuana sales, potentially becoming a looming threat to a burgeoning industry that already sees several billions of dollars of legal sales per year. Fortune \nWeinstein Co. close to selling for under $500 million. \nThe embattled movie studio is reportedly near the end of a sales process that kicked off in the wake of its board’s ouster of disgraced Hollywood mogul (and company co-founder) Harvey Weinstein over numerous sexual harassment and assault allegations (all of which he’s denied). The company is considering half a dozen bids, none of which top $500 million, with nearly half that amounting to assumed debt. The Wall Street Journal \nSouthwest to pay $15 million in airline antitrust suit. \nSouthwest Airlines has agreed to pay a $15 million settlement in a nationwide antitrust lawsuit brought against the four biggest U.S. air carriers. A group of passengers are accusing the airlines (which also include American Airlines, Delta Air Lines, and United Continental Holdings) of conspiring to cut down on seating in order to charge more for fares. Southwest would deny any wrongdoing as part of the settlement. Reuters ", "external_links": [], "published": "2018-01-05T14:17:00.000+02:00", "crawled": "2018-01-05T14:17:16.016+02:00", "highlightTitle": ""}