{"organizations": [], "uuid": "c6d17636d3bb94864397d41881419037ba722117", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/12/104161849-GettyImages-628553250.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/amazon-hq2-washington-dc-area-has-the-most-cities.html", "country": "US", "domain_rank": 767, "title": "Three of the finalists for Amazon's second headquarters are in or near Washington DC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:23:00.000+02:00", "replies_count": 0, "uuid": "c6d17636d3bb94864397d41881419037ba722117"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/amazon-hq2-washington-dc-area-has-the-most-cities.html", "ord_in_thread": 0, "title": "Three of the finalists for Amazon's second headquarters are in or near Washington DC", "locations": [], "entities": {"persons": [{"name": "wes", "sentiment": "negative"}, {"name": "tom williams", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "montgomery county", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "amazon university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Williams | CQ Roll Call | Getty Images Preparations for the presidential inauguration on the West Front of the Capitol, December 08, 2016. \nThe chances of Amazon 's second headquarters coming near the nation's capital just got a lot higher. \nThree bids from the D.C. area made the final list for Amazon's second headquarters , which was announced Thursday. That's the highest representation for any other region that bid for Amazon's \"HQ2.\" \nThe three regions — Washington, northern Virginia and Maryland's Montgomery County — are among the 20 finalists for HQ2, which Amazon promises will bring 50,000 high-paying jobs and $5 billion in additional investments. Other cities on the final list include New York, Los Angeles and Boston. \nAmazon didn't share many details about its criteria for narrowing the list from 238 bids. The company previously said it was looking at metropolitan areas with 1 million people and a stable, business-friendly environment. 'Amazon University' \nThere are many reasons for Amazon to choose the Washington, D.C., area over others. \nAmazon CEO Jeff Bezos already owns The Washington Post, and he recently purchased the largest home in D.C. Amazon's cloud service AWS also has a huge data center presence in the northern Virginia region. \nIt's unclear exactly what type of incentives the region has offered to Amazon for HQ2. But public records of the District of Columbia's proposal, discovered by WAMU , give some hints of what to expect. \nAlthough heavily redacted, the proposal offers relocation reimbursements of up to $5,000 for each employee relocating to D.C. and wage reimbursements of up to $10,000 for each new hire. It also promises a zero percent corporate tax rate for five years and a reduction in the corporate tax rate from 9 percent to 6 percent \"for the life of the company.\" It also offered several property- and sales-tax exemptions. \nPerhaps the more unique offering is a new education and training center called \"Amazon University.\" The proposal says the new facility will offer \"customized educational curriculum for bachelors, masters, and executive education\" for Amazon at \"DC government's expense.\" It also offered to partner with local universities for a new program tailored for Amazon's workforce. \nIn response to making the final list, Washington D.C. mayor Muriel Bowser said in a statement, \"When asked what's the best city for one of the fastest-growing companies, we answered: #ObviouslyDC. Making this list reaffirms what we already knew going into the bid process – Washington, DC is no longer a one-company government town, we are a leader in innovation and tech, brimming with top talent and endless opportunity.\" D.C. has a slight advantage \nA recent analysis by CNBC picked the D.C. region as one of the top three picks, largely due to the business-friendly regulations in Virginia and a deep pool of talent. Coding bootcamp Thinkful also picked Washington, D.C., as the most likely choice for HQ2 based on its own analysis . \nAnd in a note published in October , Baird Equity Research's Colin Sebastian mentioned the nation's capital as a leading candidate, pointing out how Amazon had the largest number of job openings in Washington, D.C., outside Seattle and San Francisco. \n\"With a fairly large airport hub (Dulles), geographic diversity (East Coast/Southeast), a large number of employees (in particular Amazon Web Services), and perhaps the side-benefit for Jeff Bezos given the nearby Washington Post, we would give a slight advantage to the DC metropolitan area,\" Sebastian wrote in the note. \nAmazon expects to make a final decision this year. You can see the full list for the 20 finalists here .", "external_links": [], "published": "2018-01-18T20:23:00.000+02:00", "crawled": "2018-01-18T20:28:04.009+02:00", "highlightTitle": ""}