{"organizations": [], "uuid": "22409d93c6f36ab5b5f03afc6f2f51f8fee7979c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948275-bmw-i8-coupe.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/the-winners-and-losers-of-the-detroit-auto-show.html", "country": "US", "domain_rank": 767, "title": "The winners and losers of the Detroit Auto Show", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T19:30:00.000+02:00", "replies_count": 0, "uuid": "22409d93c6f36ab5b5f03afc6f2f51f8fee7979c"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/the-winners-and-losers-of-the-detroit-auto-show.html", "ord_in_thread": 0, "title": "The winners and losers of the Detroit Auto Show", "locations": [], "entities": {"persons": [{"name": "mack hogan", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "detroit auto show", "sentiment": "negative"}, {"name": "detroit auto show shares cnbc", "sentiment": "negative"}, {"name": "fiat chrysler", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The winners and losers of the Detroit Auto Show SHARES CNBC breaks down the winning and losing cars of the Detroit Auto Show. We saw new trucks, concepts and sedans, and then picked the ones we like most. Here's what has the most potential in 2018, and here's what doesn't. \nI'm here at the Detroit Auto Show scouring the show floor for the big winners and losers this year. There have been plenty of announcements, ranging from new sedans to pick-up trucks. Here's what I think are the most, and least, compelling of the show. Winner: Ram 1500 Mack Hogan | CNBC The Ram 1500 \nFiat Chrysler took the wraps off of an all-new version of the company's high-volume, high-profit Ram 1500 early Monday in Detroit. The truck boasts a variety of improvements over the outgoing model, including a new 48-volt mild hybrid assist. \nThe mild hybrid system allows the Ram to recapture kinetic energy during braking and use it to assist the engine during acceleration, just like the regenerative brakes in traditional hybrid cars. The electric assist not only boosts fuel economy figures by 10 percent, according to Ram, but also contributes to a 20-percent increase in towing capacity. \nLuxury trims of the Ram are also offered with a 12-inch, tablet style center display reminiscent of the ones you would find in a Tesla, but flanked by physical controls for mission-critical functions like climate controls. Loser: Chevy Silverado Mack Hogan | CNBC The Chevy Silverado 1500 \nThe 2019 Silverado is by no means a bad or even unimpressive truck; on the contrary, it's easily one of the most exciting new half-ton trucks we've seen in some time. So why's it on the losers list? What happened? \nRam happened. The Ram 1500 debuted just two days after the Silverado, but its mild hybrid system was more exciting and innovative than the Silverado's new and improved cylinder deactivation. The Ram also upstaged the Silverado in the interior department, and the exterior design is fresher. \nEven the Chevy's power tailgate, which was called \"class-exclusive,\" only held onto that distinction for two days. I'm sure the Silverado will make a great truck, but poor press conference timing and the Ram's sucker-punch means that the Silverado has to be on the loser's list for Detroit. Winner: BMW X2 Mack Hogan | CNBC The BMW X2 \nThe BMW X2 is the perfect car for 2018. People want crossovers. But more than that, they want raked-back crossovers that sacrifice a lot of the utility of a conventional SUV. And of course, people want those raked-back crossovers to be made by a luxury marque and more expensive than the traditional crossover on which the raked-coupe one is based. I truly don't know why, but cars that meet these criteria fly off of dealer lot and sell near sticker price every time. \nThe X2 checks all of those boxes and more. It looks great, it's efficient and it manages to keep enough practicality that it won't be unusable in the real world. It also shares a significant amount of its underpinnings with the X1 but is expected to cost more, so it'll drive high profits for the Bavarian brand. Loser: Mini Cooper Hardtop Mack Hogan | CNBC The Mini Cooper Hardtop \nIf the X2 is everything consumers demand in 2018, the new Mini Cooper Hardtop is everything they don't care about. It's a small car from a non-premium brand, for starters. If history is our lesson, it'll also cost more than its competitors when similarly equipped and won't come with standard features people are looking for. \nSure, it's cute and comes with LED taillights in the shape of the British flag, but I'm not sure that's enough to get people to care about Minis again. Winner: Mercedes G-Class Mack Hogan | CNBC The Mercedes G Class \nThe iconic G-Class, which survived 39 years without a full overhaul, finally got its makeover in time for the Detroit show. A few parts carry over from the old model, but it's larger and more luxurious to accommodate the truck's increasing favor among the Beverly Hills elite. \nMercedes improved a lot of things that people have hated about the G-Class without ruining the things people love. It still has off-road credo, it still sports a V8 engine and it still has the refrigerator-box shape that has defined the G-Class. But also has an improved better interior, a more refined ride and more space for passengers than its predecessor. Loser: BMW i8 coupe Mack Hogan | CNBC The BMW i8 Coupe \nBMW also rolled out the updated 2019 i8 coupe. Like the new convertible that debuted at the Los Angeles Show, the 2019 i8 coupe has increased electric range and more power on tap. It's an improvement in every way. \nIt's not enough. Mercedes was able to make small improvements because the G-Class is still posting massive sales and bringing in lots of money. The i8, on the other hand, was exciting when it first came out but the hype quickly faded. The 2019 model doesn't change enough to bring the hype back. Winner: Hyundai Veloster Mack Hogan | CNBC The Hyundai Veloster \nModern cars are so capable and high-quality across the board that consumers are focusing on style more than ever. The Veloster looks great, is offered with a high-performance model, and is priced well to court younger buyers. Loser: Kia Forte Mack Hogan | CNBC The Kia Forte \nThe Forte doesn't move the needle enough. It's a safe play and a nice looking vehicle, but in a crowded segment with less sales to go around every year, it's not exciting enough to do much good for Kia. \nIt's a safe play and a nice-looking vehicle, but in a crowded segment. If you want a small vehicle from Kia, it's hard to imagine why you'd get a Forte over something a bit more fun like the Soul. Winner: Lexus LF-1 Limitless Concept Mack Hogan | CNBC The Lexus F-1 Limitless \nLexus needs two things: more crossovers, and a truly inspirational flagship. The LF-1 is the first thing Lexus has that can solve both problems. \nUnlike BMW, which offers five crossovers with two more on the way in 2018, Lexus currently offers just two. A three-row edition of the RX is a great start, but a Range Rover-fighting two-row SUV is a fantastic choice to elevate the brand's image. Loser: Toyota Avalon Mack Hogan | CNBC The Toyota Avalon \nPeople who want a lot of space want SUVs. The 2019 Avalon is a valiant effort towards reversing trends in a shrinking segment, but the biggest advantage sedans have over SUVs is dynamics. Typically, this is not where the Avalon shines. \nFor a select group of people, the Avalon will be a great choice. But Toyota failed to address the bigger problem: no one's going to get excited about an Avalon. The most anyone is saying about the revised model is that it'll be the first Toyota to offer Apple CarPlay, but that's less of an exciting development and more of a \"gee, it sure took you long enough\" moment.", "external_links": [], "published": "2018-01-16T19:30:00.000+02:00", "crawled": "2018-01-16T19:48:27.060+02:00", "highlightTitle": ""}