{"organizations": [], "uuid": "60c30dbafa5a11b238093f96abffd250bc77b148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 20}, "facebook": {"likes": 131, "shares": 131, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/05/104262799-RTX2ZQMK.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/what-the-tom-brady-indicator-means-for-the-stock-market-rally.html", "country": "US", "domain_rank": 767, "title": "The Tom Brady indicator: What the Super Bowl-bound QB's performance means for the stock rally", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:34:00.000+02:00", "replies_count": 0, "uuid": "60c30dbafa5a11b238093f96abffd250bc77b148"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/what-the-tom-brady-indicator-means-for-the-stock-market-rally.html", "ord_in_thread": 0, "title": "The Tom Brady indicator: What the Super Bowl-bound QB's performance means for the stock rally", "locations": [], "entities": {"persons": [{"name": "tom brady", "sentiment": "negative"}, {"name": "brady", "sentiment": "none"}, {"name": "tom brady.that", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "national football league", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES show chapters 22 Hours Ago | 01:35 \nWhen considering the markets' fundamentals, investors need not look at earnings, interest rates, the economy or central banks' liquidity any longer. In fact, these are factors we haven't needed to focus on since the beginning of the millennium. Over the past 18 years, there has only been one fool-proof indicator of the markets' direction, and that is Tom Brady.That's right — even those who root against the New England Patriots should be rooting for the team's quarterback, as his performance has directly coincided with the markets' movement. Here are some factors to consider.Since Brady entered the National Football League, there have only been two years in which he played in one game only: 2000 and 2008, which of course stand out as two of the worst years for the U.S. stock market in decades. The S&P 500 declined 10 percent in 2000 and 36 percent in 2008.On top of this, he missed one game in 2001, which was another terrible year for stocks; the S&P 500 declined 13 percent that year. Even in 2016, the stock market began a 3 percent decline when Brady began a four-game suspension. However, ever since that suspension ended, we have not had a pullback of any kind! Suffice to say, the market has been on a pretty steady — and at this point, historic — upward climb.In fact, we'd point out that since Brady began his career, near the top of the market in 2000, the S&P 500 has rallied nearly 100 percent. However, if you sold the S&P 500 when he was on the bench or at home, and then bought it back when he played, you made a whopping 425 percent.Needless to say, my tongue is firmly planted in my cheek when I say all of this. However, there's no question that the so-called Tom Brady indicator has worked a lot better than the so-called Super Bowl indicator over the past 18 years. Therefore, if investors want to simplify their decision-making process, all they really have to do is follow who I consider to be the greatest quarterback of all time. \nWe'll see how he performs in the Feb. 4 Super Bowl against the Philadelphia Eagles.", "external_links": [], "published": "2018-01-25T14:34:00.000+02:00", "crawled": "2018-01-25T14:54:48.009+02:00", "highlightTitle": ""}