{"organizations": [], "uuid": "cdb1e6208273a9cac52ec452818464f7caa952eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/28/104369530-GettyImages-632300012.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/20/womens-march-takes-to-the-streets-for-the-2nd-year-protesting-trump-and-sexism.html", "country": "US", "domain_rank": 767, "title": "Women march across the US for the 2nd year, marking Trump's first anniversary in the Oval Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T22:47:00.000+02:00", "replies_count": 0, "uuid": "cdb1e6208273a9cac52ec452818464f7caa952eb"}, "author": "", "url": "https://www.cnbc.com/2018/01/20/womens-march-takes-to-the-streets-for-the-2nd-year-protesting-trump-and-sexism.html", "ord_in_thread": 0, "title": "Women march across the US for the 2nd year, marking Trump's first anniversary in the Oval Office", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "michael newberg", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "emily patton", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "national mall", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Women's March takes to the streets for the 2nd year, protesting Trump and sexism Published 2 Mins Ago Michael Newberg | CNBC Thousands of protesters take part in the Women's March in downtown Los Angeles. \nThousands of protesters turned out across the nation for the second Women's March on Saturday, marking the first anniversary of President Donald Trump's inauguration with rallies aimed at channeling female activism into political gains in elections this year. \nThe coordinated rallies in Washington, New York, Los Angeles, Chicago and about 250 other cities are a reprise of the mass protests that marked the beginning of Trump's presidency. Sister rallies were also planned in Britain, Japan and other countries. \n\"We will make our message heard at the polls this fall,\" Emily Patton, a rally organizer, told thousands of demonstrators at the Reflecting Pool on Washington's National Mall. \"That is why we are urging people to register to vote today.\" \nThe rallies also come during what has been seen as a pivotal year for women's rights with the #MeToo and #TimesUp social media effort against sexual harassment and abuse that was born out of a string of scandals in Hollywood, Washington and elsewhere. \nThe Washington rally featured Democratic politicians from neighboring Virginia, including Senator Tim Kaine, who blamed Trump and Republicans for the shutdown of the government on Saturday. \n\"The Trump shutdown is due to the inability of the Republican Party to do basic governing, like making a budget,\" he said to cheers. \nMany of the protesters wore pink knit \"pussy hats,\" which were created for last year's march as a reference to a comment made by Trump about female genitalia. The caps quickly became a symbol of women's empowerment and opposition to the new president in the early days of his administration. \n\"We want to continue the fight to resist this president and the policies we're against,\" said Sara Piper, 59, a geologist from Reston, Virginia. \nSome critics said this year's march lacked a focus. Targeting an issue such as immigration would have greater impact, said Shikha Dalmia, a senior analyst at the Reason Foundation, a libertarian think tank. \n\"Beating the feminist drum just seems to me beside the point. Maybe they are trying to cast as wide a net as possible,\" Dalmia said by telephone. \nOne of the biggest marches is expected in New York, where 37,000 people had signed up on the march's Facebook page. But the number of participants in this year's rallies is likely to fall well short of the estimated 5 million who marched on Jan. 21, 2017, and made that one of the largest mass protests in U.S. history. \nIn Chicago, thousands of mostly female marchers gathered ahead of a rally in Grant Park, carrying signs that read \"Strong women raising strong women\" and \"You can't cure stupid but you can vote it out.\" \nMichelle Saunders, 41, a software saleswoman from Des Plaines, Illinois, came to the rally with her 14-year-old daughter Bailey. They attended last year's march and anticipated that the crowd this year would not match the 250,000 that attended last year, but for them the message is just as strong. \n\"A smaller crowd will not mean people are any less angry,\" Michelle Saunders said. \"We are unhappy with the current administration and what it stands for and want our voices to be heard.\" \nSince last year's march, women have become more vocal and that is a positive sign, said Cathy Mutz, 63, a retired nurse from Chanahan, Illinois. \n\"I think change will come from the midterm elections,\" she said. \nOrganizers hope to build on the energy felt by Trump opponents after his surprise election victory in 2016 and channel it into gains for progressive candidates in November's midterm elections, using the theme \"Power to the Polls.\" \nOrganizers want to register 1 million new voters and get more strong advocates for women's rights into office. \nActivists say Trump's policies rolling back birth control and equal pay protections have propelled many women into activism for the first time. In Virginia state legislative polls, 11 of the 15 Democrats elected were women. \nA White House spokesman did not respond to a request for comment on the marches. \nThe marches will be followed by more events on Sunday, including in Las Vegas, a key battleground state in the 2018 midterm congressional elections. \nThe voter registration campaign will target swing states held by Republicans, such as Nevada, and in districts considered a toss-up ahead of November's midterm elections.", "external_links": [], "published": "2018-01-20T22:47:00.000+02:00", "crawled": "2018-01-20T22:52:23.062+02:00", "highlightTitle": ""}