{"organizations": [], "uuid": "26d5921789b39aa1caee6c3bd53daac98c24112f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/27/102541709-netflix.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/netflix-dvd-business-still-alive-what-is-it-like-to-work-there.html", "country": "US", "domain_rank": 767, "title": "What it's like to work at Netflix's dying DVD business", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T16:48:00.000+02:00", "replies_count": 0, "uuid": "26d5921789b39aa1caee6c3bd53daac98c24112f"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/netflix-dvd-business-still-alive-what-is-it-like-to-work-there.html", "ord_in_thread": 0, "title": "What it's like to work at Netflix's dying DVD business", "locations": [], "entities": {"persons": [{"name": "mar", "sentiment": "neutral"}, {"name": "michael", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}], "organizations": [{"name": "shares getty images red netflix", "sentiment": "neutral"}, {"name": "u.s. post office", "sentiment": "neutral"}, {"name": "netflix", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Michael Scalise, a 32-year-old from Missouri, wants to settle down and watch something on Netflix, he doesn't start by opening his computer or firing up his smart TV. Instead, he checks his mailbox.\n\"I still tend to think of DVDs as the core service and streaming as an add-on, even though I know that's not what it is to most people,\" he tells CNBC. \"I still watch far more content on DVD than I do streaming.\"\nScalise, who first signed up for Netflix in 2000, is one of the several million people who still wait expectantly for those once-iconic red envelopes. On Monday, Netflix reported 3.4 million remaining DVD subscribers in its fourth-quarter earnings release , down 186,000 since Q3, 731,000 year over year and 16.6 million from 2010's peak of about 20 million subscribers .\nBut even as the service sheds members, Netflix has no motivation to formally phase out the DVD business. After all, it still pumps out profit — $62.7 million last quarter — which the company can inject into its fast-growing streaming business.\nNetflix just announced a whopping 117.6 million digital subscribers worldwide and plans to spend $7.5 billion to $8 billion on content this year. The company also surpassed $100 billion in market cap for the first time after its earnings announcement Monday.\nAlthough there's only one \"Netflix\" that reports earnings, the business really does think of itself as two separate companies: one for the ambitious streaming service and one for the waning DVD business.\nThat business, DVD.com, has its own website, management team, benefits package and headquarters located near the main Netflix headquarters in the Silicon Valley town of Los Gatos, California. If you visit the office of each business \"you won't believe it's same company,\" one current employee tells CNBC.\nWhile the streaming business continues to swell, DVD.com is basically just trying to stay afloat as long as the business remains tenable. As that same employee describes it, the experience of working on the DVD side during these twilight years is \"quite exciting, interesting, and a little sad altogether.\"\nNetflix still does DVDs?! Although Netflix has no incentive to kill off the business yet, it also doesn't want to spend any more money than is necessary to keep operations running smoothly. It has managed to keep an impressive profit margin by steadily making the business more efficient .\nFor example, one of the big recurring costs for the business is buying new DVDs. The current Netflix employee describes how the company has recently cut costs by tweaking the algorithm that determines which customers receive new releases first. DVD.com traditionally gave higher priority to the customers who rented the least number of discs in a given period, with the rationale that because they paid the same price for the DVD service but used it less, they should have high priority to get the disc they wanted. However, these customers tended to return new release discs much slower than more active customers, so DVD.com adjusted the algorithm \"to find the right balance\" that allowed it to give customers fair service but also take better advantage of its new releases. The result? DVD.com can buy fewer new release discs.\nIt pairs technology changes like this with more drastic measures like shutting down inefficient DVD distribution hubs.\n\"They're just trying to slow the bleeding and allow it to die off naturally,\" explains a former employee who left the company after 8½ years last fall. This person worked at one of the company's distribution hubs in the Midwest and says that he left his job because he'd watched several hubs close in the last year and didn't see any career growth in his future. He requested anonymity because he was not authorized by the company to discuss details of his time there.\nNetflix confirmed that there are only 17 distribution centers left across the United States, with recent closures in Arkansas, Hawaii and New Mexico. That's down from 33 in mid-2015 and 50 at its peak.\nThis former employee says that before he left the company, the DVD.com team had been blunt about its future but was projecting based on its current trajectory that the business would continue into at least 2025. Netflix declined to comment on the validity of that projection.\n\"We knew it wouldn't last forever,\" he says.\nOver the years, this employee collected a wide range of Netflix swag, including a pizza cutter, a duffel bag, a beer mug and a whole heap of T-shirts. In recent years, he'd get surprised looks when he wore the tees emblazoned with the slogan: \"DVD.com, a Netflix company.\"\n\"I'd wear those shirts, and people would ask, 'They still do DVDs?'\" he says. \"They would have no clue that it was still around.\"\nHe didn't feel particularly connected with his co-workers at Netflix proper, who generally have higher salaries and better benefits .\nMeanwhile, employees at Netflix proper could be forgiven for forgetting their DVD.com co-workers, too.\n\"My whole two years there I didn't interact with them at all,\" says another former Netflix employee who left last summer after two years at the company. \"No joint all-hands, no real interaction via email, nothing.\"\nAlthough DVD.com employees may have to figuratively stare the death of their company in the face on a regular basis, they still want to make sure that existing customers are happy.\nLike customer Scalise, many people still use the DVD service because the streaming service often gets newer movies and TV shows much later, if at all, and DVD.com has a much larger collection of titles (more than 100,000 according to the current employee, versus 5,606 streaming titles that Netflix has in the U.S. right now, according to estimates from uNoGS.com ).\nThe DVD service is also a boon for people who live in places with spotty internet service. Also, the former DVD.com employee admits, some of its 3.4 million subscribers likely don't realize that they're still paying for the service because they never actually order DVDs.\n(The current employee even jokes about how the people dishing out the fees and never ordering discs are actually the ideal customers.)\nAs for Scalise, he still loves the service, even though he says that he's noticed the selection of old or more obscure movies degrading -- presumably because the company is less likely to replace DVDs that break. Even so, Netflix still has more options than any other service he's found.\n\"As much as I complain about the library shrinking over time, I suspect that I will be one of the final subscribers when they finally do shut it down,\" Scalise says. \"I have 453 movies on my DVD queue now and I don't think there's any chance I'm finishing that many before they end the service.\"", "external_links": [], "published": "2018-01-23T16:48:00.000+02:00", "crawled": "2018-01-23T16:53:16.015+02:00", "highlightTitle": ""}