{"organizations": [], "uuid": "b0f565e29a234687d042b37c500de64804a02224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970240-GettyImages-910452264.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/dollars-terrible-week-warning-of-what-could-with-trumps-on-trade.html", "country": "US", "domain_rank": 767, "title": "The dollar's terrible week is a warning of what could come if Trump's team missteps on trade", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T20:55:00.000+02:00", "replies_count": 0, "uuid": "b0f565e29a234687d042b37c500de64804a02224"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/dollars-terrible-week-warning-of-what-could-with-trumps-on-trade.html", "ord_in_thread": 0, "title": "The dollar's terrible week is a warning of what could come if Trump's team missteps on trade", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "nicholas kamm", "sentiment": "negative"}, {"name": "rex tillerson", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. officials created a small firestorm with their dollar comments in the chilly air of Davos this week, but a much more important factor for the future of the currency will be what they say and do about trade when they leave Switzerland.\nStrategists say the dollar could consolidate now after its latest bout of weakness, and the focus will now be on whether the Trump administration can pursue its goal of new, fair trade agreements without sparking trade wars and new currency volatility.\nThe dollar index has been in a year-long decline, defying forecasts that it should strengthen from the fact that the Federal Reserve is raising interest rates and normalizing monetary policy faster than its counterparts. But the opposite has happened, and the dollar weakened as flows increased into the euro and yen, as those economies improved, and central bankers in Europe and Japan look closer to removing their own heavy handed accommodation.\nThen this week, U.S. Treasury Secretary Steven Mnuchin stirred the pot, with a possibly innocuous comment to journalists at the annual World Economic Forum about dollar weakness being good for U.S. trade. To markets, that sounded like a not very subtle endorsement of the falling dollar and a step away from the long-running U.S. policy of verbally supporting a strong dollar. The comment also took on more significance since it was made at the Davos confab, dubbed the 'epicenter of globalization' by one strategist.\n\"The dollar had a terrible start to the year way before Mnuchin came in and made those comments. The trend didn't come from that, so we obviously had some volatility down and up this week on the back and forth from that. I don't think the trend is about that. It's about global growth, about the shift in some capital flows, such as Chinese capital flows, and that's separate from whatever that one sentence comment was that was made by Mnuchin and others,\" said Jens Nordvig, CEO of Exante Data.\nMnuchin's comments also came just as the U.S. launched trade sanctions against Chinese solar panels and South Korean washing machines . Crucial trade talks were also underway this week in Canada, as the U.S., Mexico and Canada try to reshape the 24-year-old NAFTA agreement. The Treasury secretary's comments triggered not so subtle criticism from Europe's central bank head Mario Draghi about unnamed officials talking down their currency.\nMnuchin and later President Donald Trump tried to walk back the weak dollar comments. Trump triggered a temporary rally in the dollar Thursday, when he said on CNBC that Mnuchin's comment was taken out of context and the dollar should get stronger with the U.S. economy. On Friday, Mnuchin, also on CNBC, used some of the exact language of his predecessors—that a strong dollar was in the \"best interests\" of the country.\nBut the market continues to sell the dollar, and some strategists expect that to continue this year, even after a period of possible consolidation. The dollar index touched a new three-year low Friday.\nIt could accelerate if Trump takes broader trade actions that are seen as protectionist.\nAdam Galica | CNBC Steven Mnuchin interviewed by CNBC at Davos, Switzerland, January 26, 2018 \"The next focus for markets is whether Trump pivots to a much more protectionist, isolationist policy, or he tries to play a little bit better in the global game,\" said Mark McCormick, North America head of foreign exchange strategy at TD Securities.\nTrump, in the past, has kicked off his own dollar selloff. Just before his inauguration, he discussed how he liked a weaker dollar, and the dollar index has lost more than 11 percent since then. A weak dollar is a double-edged sword— good for multinational profits and selling U.S. goods abroad but bad for U.S. dollar assets, like Treasurys.\n\"The tone we got this week was the dollar was front and center for Davos. You've had back and forth on Mnuchin and Trump and Mnuchin again on what actual dollar policy is. I think everyone's fully aware Trump has had a preference for a weaker dollar, whether there's anything they can do or not to accelerate it,\" said McCormick. \"It's clear they have a focus on bilateral trade deficits.\"\nTrump did promote his 'America first' policies at Davos, and in a speech said that does not mean America goes it alone. He also said the U.S. was looking for fair trade, as he touted the growth of the U.S. economy, the stock market's performance, the new GOP tax law and the fact that the U.S. is 'open for business.'\n\"It's the most important thing to watch,\" said Nordvig of evolving U.S. trade policy. He said if NAFTA is dissolved, it would be an immediate negative for the peso but the dollar would lose flows to Europe and Japan. It would also be negative for the record setting stock market.\n\"We saw the solar stuff this week. It was expected. The next thing to watch is the next installment. It's pretty unpredictable,\" said Nordvig. U.S. officials have warned other actions are coming.\nAlan Ruskin, Deutsche Bank head of G-10 currency strategy, sees some consolidation after the dollar's fall and the sharp increase in the euro, up 1.7 percent this week. But he too says the markets are keeping a close eye on trade, and whether the Trump administration makes moves beyond the actions its already taken on specific products.\n\"What we've been looking for is a shift back to the point where rates matter and carry matters. So far, we haven't seen that for quite some time. There are a lot of different balls in the air, as far as currencies are concerned,\" said Ruskin. \"There's trade related issues coming to the fore now, particularly as they relate to the U.S. and China. This is an opening gambit. There's a bigger story in the background.\" Ruskin said the market is watching the U.S. trade relationship with China, and the fact the U.S. has significant issues with China, including on intellectual property rights.\nNordvig said the currency market has been making some interesting moves when it comes to China. \"\n\"What's really remarkable, in the last month we've had a big move in the dollar. We had a big move in the dollar against a lot of crosses. China had a big move, and we track the invention and thers' no intervention whatsoever. This is alike a historic thing because they used to always intervene when the currency was getting stronger. The fact they are not doing anything is a very big deal,\" he said, noting countries are very careful now about being interventionalist. \"I think they realize if they want to have a reserve currency over time, they want to have a flexible currency. If they stop their appreciation, there's one way risk. It can only go down. I think they want to have two-way risk.\"\nAs the dollar flounders, the market has focused on the fact that other currencies, like the euro and yen are becoming more attractive as reserve currencies, though the U.S. is so important it is not expected to lose its reserve status.\nBut the concern has been that dollar assets could lose their appeal if the dollar becomes too weak, if the Trump administration really does want to talk down the green back. McCormick said there was some speculation that the Trump administration weak dollar comments were a response to the reports earlier this month that China was considering cutting back on Treasury purchases because they are no longer as attractive and because of Trump trade policies. China is the largest holder of Treasurys, but it's not expected to back out of the Treasury markets in a significant way.\n\"I think if they started to pick a trade war with China that would be super dollar negative against euro and yen. But high beta currencies, like emerging market currencies , would also not perform well in that environment,\" McCormick said.\nHe said NAFTA is a test case for how the U.S. may behave on the broader world stage. \"It will be interesting to see how Trump goes back home to a different audience, how he talks on trade whether he is more bellicose,\" said McCormick, adding the upcoming Congressional midterm elections may shape how Trump talks about trading partners.\nTrump gave a surprise nod to the possibility of U.S. joining a multilateral trade deal when he has pushed the idea of bilateral deals when he said he reconsidering joining the Trans Pacific Partnership. Trump withdrew from the multilateral trade pact last year and says he'd reconsider if the U.S. could get a better deal, but analysts were skeptical anything would come of that.", "external_links": [], "published": "2018-01-26T20:55:00.000+02:00", "crawled": "2018-01-26T21:09:27.004+02:00", "highlightTitle": ""}