{"organizations": [], "uuid": "f5910f3603a88ed8ebe7698fbd94a6325de37cea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 38, "shares": 38, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://richinwriters.com/feed", "section_title": "RichInWriters.com", "url": "https://www.cnbc.com/2018/01/04/global-battle-of-tax-codes-the-us-and-china-just-upped-the-arms-race.html", "country": "US", "domain_rank": 767, "title": "There’s a battle of tax codes raging — the US and China just upped the arms race", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T06:32:00.000+02:00", "replies_count": 0, "uuid": "f5910f3603a88ed8ebe7698fbd94a6325de37cea"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/04/global-battle-of-tax-codes-the-us-and-china-just-upped-the-arms-race.html", "ord_in_thread": 0, "title": "There’s a battle of tax codes raging — the US and China just upped the arms race", "locations": [], "entities": {"persons": [{"name": "chiu wu hong", "sentiment": "none"}, {"name": "chester wee", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The high profile move by the United States to drastically cut corporate taxes has increased the pressure on other economies to hand out similar incentives to keep investors on their shores.\nJust days after President Donald Trump signed the new bill that lowered the corporate tax rate from 35 percent to 21 percent, China announced it would grant certain tax exemptions to local and foreign companies operating in the country.\nChina's move signaled its \"determination to gain an edge in global competitiveness\" at a time when the U.S. made its biggest tax reform in three decades, the South China Morning Post reported — a conclusion shared by many in the business circle.\nGetty Images Countries, both developed and developing ones, hope that lowering taxes could help them gain an edge amid an uncertain global environment. Governments also want to prevent companies from artificially shifting profits across borders to keep overall tax exposure low. That practice is known as base erosion and profit shifting and typically sees businesses favoring jurisdictions offering low taxes and tax havens.\n\"These efforts [by the U.S. and China] may prompt other countries to also review the competitiveness of their own tax regimes,\" said Chiu Wu Hong, head of tax at KPMG in Singapore.\nIndeed, the two largest economies in the world are not alone in a battle of tax codes — commonly deemed a race to the bottom.\nEven before the U.S. passed its latest tax bill, countries including the United Kingdom , France , Norway and Argentina have cut, or announced plans to cut, the amount they levy on companies.\n\"Countries still want to win more investments and jobs,\" said Chester Wee, partner and international tax services leader at EY. \"Assuming all other factors being equal, a more attractive tax regime and treaty network may swing a company's investment decision from one country to the other.\"\nAre lower taxes effective? Even as more countries throw their hats into the low-tax ring, experts said such policies are merely one of many factors contributing to an economy's competitiveness. In the case of the U.S. and China, some said lowering taxes may not make them more attractive than they already are.\nshow chapters Rep. Rob Portman: Businesses can now be competitive after GOP tax reform 9:05 AM ET Thu, 4 Jan 2018 | 03:14 \"Ask any CEO why it invests in the two largest economies in the world and it's likely that they will talk about non-tax reasons such as market opportunities or a hub of innovation,\" said Chris Woo, tax leader at PwC Singapore.\nCiting Singapore as an example, Woo said the Southeast Asian city-state is attractive for more than its tax incentives, pointing to its political stability, rule of law, talent pool and its location in a region with growth potential.\nFor companies, taxes alone should not be the main consideration in business decisions, said Chiu.\n\"Ultimately, any investment decision should have to make business sense for the company based on its intended growth strategy,\" he said. \"Companies also consider non-tax factors, such as political stability, legal, operational, and financial concerns, as well as the general business environment of a country.\"", "external_links": [], "published": "2018-01-05T06:32:00.000+02:00", "crawled": "2018-01-05T06:47:44.010+02:00", "highlightTitle": ""}