{"organizations": [], "uuid": "c10979ae95e02c8e77150519ef9b528455bbd217", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/10/104763927-GettyImages-855377332-elon-musk.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/musk-tesla-could-be-trillion-dollar-company-and-other-predictions.html", "country": "US", "domain_rank": 767, "title": "Elon Musk thinks Tesla will be a trillion-dollar company — plus 5 other wild predictions", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T20:01:00.000+02:00", "replies_count": 0, "uuid": "c10979ae95e02c8e77150519ef9b528455bbd217"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/musk-tesla-could-be-trillion-dollar-company-and-other-predictions.html", "ord_in_thread": 0, "title": "Elon Musk thinks Tesla will be a trillion-dollar company — plus 5 other wild predictions", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "elon musk", "sentiment": "negative"}, {"name": "peter parks", "sentiment": "negative"}, {"name": "andrew ross sorkin", "sentiment": "none"}, {"name": "musk", "sentiment": "none"}, {"name": "sorkin", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "afp | getty images elon musk", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire and maverick entrepreneur Elon Musk is known for making what seem like wild predictions.\nThe Tesla boss's latest prophecy came Tuesday as part of the announcement of a new negotiated payment deal for the electric car company — Musk will be paid only if Tesla hits aggressive market capitalization and operations targets.\nSaid Musk: \"I actually see the potential for Tesla to become a trillion-dollar company within a 10-year period.\" He made the prediction to Andrew Ross Sorkin of CNBC and The New York Times.\nAs Sorkin points out, Tesla is worth $59 billion today. If Musk were to grow Tesla to the $650 billion market cap target delineated in his payment plan — $350 billion shy of the prediction Musk himself has made — that would make the electric vehicle company one of the five largest companies in the United States, according to current valuations, says Sorkin. Even the $650 billion market capitalization is \"a figure many experts would contend is laughably impossible,\" Sorkin writes. Especially as Tesla , plagued by production delays, is frustrating investors .\nBut on the back of Musk's trillion-dollar Tesla bet, here is a look at some of the other extreme predictions he has made in recent years.\nshow chapters Tesla ties Elon Musk's compensation to company performance 9 Hours Ago | 03:01 The government will have to pay us to live With the automation that is coming thanks to robots and AI, job displacement for low-skilled workers will be rapid, according to Musk, and the economy won't be prepared. He predicts a solution.\n\"There is a pretty good chance we end up with a universal basic income, or something like that, due to automation,\" says Musk to CNBC in Nov. 2016, referring to programs through which governments pay their citizens a monthly stipend, regardless of employment. \"Yeah, I am not sure what else one would do. I think that is what would happen.\"\nThe upside to all this? \"People will have time to do other things, more complex things, more interesting things,\" says Musk. \"Certainly more leisure time.\"\nshow chapters Elon Musk: Robots will take your jobs, government will have to pay your wage 10:57 AM ET Mon, 13 Feb 2017 | 01:44 Robots will be able to do everything better than humans \"Robots will be able to do everything better than us. ... I mean all of us,\" says Musk, speaking to the National Governors Association in July. \"I am not sure exactly what to do about this. This is really the scariest problem to me, I will tell you.\"\nAdds Musk, \"Transport will be one of the first [industries] to go fully autonomous,\" but it won't stop there. \"When I say everything — the robots will be able to do everything, bar nothing.\"\nshow chapters Elon Musk issues yet another warning against runaway artificial intelligence 1:37 PM ET Mon, 17 July 2017 | 01:03 AI will be a threat to civilization Musk has consistently voiced concern over the potential of artificial intelligence to become dangerous if left unchecked.\n\"I have exposure to the most cutting-edge AI, and I think people should be really concerned by it,\" says Musk, speaking to the National Governors Association in July. \"AI is a fundamental risk to the existence of human civilization in a way that car accidents, airplane crashes, faulty drugs or bad food were not — they were harmful to a set of individuals within society, of course, but they were not harmful to society as a whole.\"\nMusk is a proponent of proactive regulation of artificial intelligence. In August, he tweeted a warning that AI is \"vastly more risk than North Korea.\"\nIf you're not concerned about AI safety, you should be. Vastly more risk than North Korea.\nshow chapters Elon Musk issues a stark warning about A.I., calls it a bigger threat than North Korea 11:40 AM ET Mon, 14 Aug 2017 | 00:49 Inter-planetary living will be a reality and Musk will build a colony on Mars Musk says SpaceX will send its first rocket to Mars in 2022. Though Musk admits that is an aspirational date, \"I feel fairly confident we can build the ship and be prepared for launch in about five years,\" Musk says, speaking at the 2017 International Astronautical Congress in Adelaide, Australia, in September. \"Five years seems like a long time for me,\" he says.\nThe first rockets will go with cargo only, then when Mars' and the Earth's orbits sync up again in 2024, Musk says a rocket with a crew will go.\nEventually, with further missions, crews will build cities on Mars: \"Over time, terraforming Mars and making it a nice place to be,\" says Musk.\nshow chapters Here's what it will be like to travel to Mars in Elon Musk's spaceship 9:41 AM ET Wed, 29 Nov 2017 | 01:26 People will be able to fly anywhere on earth in under 30 minutes Also during his IAC talk in Australia, Musk presented an alternative use for his Mars rockets: Ultra-fast commercial flights on Earth.\n\"If you build a ship that is capable of going to Mars, well, what if you take that same ship and go from one place to another on Earth,\" Musk says. \"We looked at that. And the results are quite interesting.\"\nThe rocket could go from New York to Paris in 30 minutes and Honolulu to Tokyo in 30 minutes, says Musk. Sydney to Singapore would take 31 minutes.\n\"Most of what people consider to be long-distance trips would be completed in less than half an hour,\" says Musk. \"And if we are building this thing to go to the moon and Mars, then why not go to other places on Earth as well?\"\nshow chapters Elon Musk reveals his plan to send passengers anywhere on Earth in under 60 minutes, for the price of a plane ticket 12:57 PM ET Fri, 29 Sept 2017 | 01:05 Don't miss:\nTesla's Pay Deal to Keep Elon Musk: All or Nothing\nElon Musk: Robots will take your jobs, government will have to pay your wage\nElon Musk issues a stark warning about A.I., calls it a bigger threat than North Korea\nshow chapters Billionaire Elon Musk responds to unhappy Tesla customer 1:59 PM ET Mon, 18 Sept 2017 | 00:50 Like this story? Like CNBC Make It on Facebook", "external_links": [], "published": "2018-01-23T20:01:00.000+02:00", "crawled": "2018-01-23T20:28:13.030+02:00", "highlightTitle": ""}