{"organizations": [], "uuid": "e65c4909a6459bb5b65425f07d7cee90c068502f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/09/104642518-GettyImages-699394842.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/republicans-call-house-intel-committee-to-releasethememo-on-fisa-fbi.html", "country": "US", "domain_rank": 767, "title": "An allegedly damning memo about the FBI and DoJ is electrifying Republicans—online and in Congress", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T23:50:00.000+02:00", "replies_count": 0, "uuid": "e65c4909a6459bb5b65425f07d7cee90c068502f"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/republicans-call-house-intel-committee-to-releasethememo-on-fisa-fbi.html", "ord_in_thread": 0, "title": "An allegedly damning memo about the FBI and DoJ is electrifying Republicans—online and in Congress", "locations": [], "entities": {"persons": [{"name": "robert mueller", "sentiment": "negative"}, {"name": "matt gaetz", "sentiment": "none"}, {"name": "mark meadow", "sentiment": "none"}], "locations": [{"name": "capitol", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "congress shares getty images special", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "intelligence committee", "sentiment": "none"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images Special counsel Robert Mueller (2nd L) leaves after a closed meeting with members of the Senate Judiciary Committee June 21, 2017 at the Capitol in Washington, DC. \nRepublicans are clamoring for the public release of a memo detailing alleged abuses of the Foreign Intelligence Surveillance Act (FISA) related to the special counsel's investigation of potential Russian influence in the 2016 presidential election. \n\"The House must immediately make public the memo prepared by the Intelligence Committee regarding the FBI and the Department of Justice,\" Rep. Matt Gaetz, R-Fl., said . \"The facts contained in this memo are jaw-dropping and demand full transparency.\" \nThe rallying cry to \"release the memo\" has exploded both online and in Congress. The hashtag #releasethememo went viral on Twitter and other social media sites on Thursday, and Republican members of Congress issued statements of alarm about its contents. \n\"I am shocked to read exactly what has taken place. I would think that it would never happen in a country that loves democracy and freedom,\" Rep. Mark Meadows , R-N.C., said Thursday on the House floor. \"It is time that we become transparent in all of this.\" \nWhile still classified to the public, the four-page memo has become an instant fixation online — thanks in part to Russian propaganda accounts, according to a website claiming to track Russian influence in real time. \nThe website Hamilton 68 , named after one of the Federalist papers authored by founding father Alexander Hamilton, claims to track 600 Twitter accounts \"linked to Russian influence operations.\" \nThe site's analytics show activity for #releasethememo increased in frequency among the tracked accounts by 265,100 percent in the last 48 hours. \nThe push from some Republicans follows the release of intelligence-gathering firm Fusion GPS co-founder Glenn Simpson's testimony to the House Intelligence Committee . The prior week, Simpson's testimony to the Senate Judiciary Committee was released by Democratic Sen. Dianne Feinstein . \nThe memo was disclosed for House members following a party line vote within the House Intelligence Committee. It is currently only available to House members in a classified briefing room called the Congressional Sensitive Compartmented Information Facility. \nPresident Donald Trump on Friday signed a reauthorization of the Foreign Intelligence Surveillance Act, assuring Americans in a tweet that this version of the bill was \"NOT the same FISA law that was so wrongly abused during the election.\"", "external_links": [], "published": "2018-01-19T23:50:00.000+02:00", "crawled": "2018-01-19T23:56:53.012+02:00", "highlightTitle": ""}