{"organizations": [], "uuid": "312da1483a0f26f6f2552eb8ac6a9442a8ca5fc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/15/103718126-GettyImages-538407770.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/31/fed-got-whiff-of-inflation-in-yellens-final-days-but-so-far-market-not-changing-rate-hike-view.html", "country": "US", "domain_rank": 767, "title": "Fed got whiff of inflation in Yellen's final days but so far market not changing rate hike view", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T23:35:00.000+02:00", "replies_count": 0, "uuid": "312da1483a0f26f6f2552eb8ac6a9442a8ca5fc6"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/fed-got-whiff-of-inflation-in-yellens-final-days-but-so-far-market-not-changing-rate-hike-view.html", "ord_in_thread": 0, "title": "Fed got whiff of inflation in Yellen's final days but so far market not changing rate hike view", "locations": [], "entities": {"persons": [{"name": "yellen", "sentiment": "neutral"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "neutral"}, {"name": "market insider fed", "sentiment": "neutral"}, {"name": "getty images janet yellen  fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider Fed got whiff of inflation in Yellen's final days but so far market not changing rate hike view Fed chair Janet Yellen leaves her post, with the Fed seemingly less worried about inflation and ready to raise interest rates at least three times this year. Sluggish inflation has been a persistent concern for the Fed, and Yellen and incoming chair Jerome Powell have described the lack of pricing power as a mystery. Besides the economic data, the next real clarity on the Fed's view of inflation will be when the Fed issues new forecasts after its March meeting and incoming chair Jerome Powell holds his first post-meeting briefing. Getty Images Janet Yellen \nFed Chair Janet Yellen ends her tenure with the Fed seemingly less worried about the lack of inflation and ready to raise interest rates three or more times this year. \nThe Fed's statement, released after Yellen's final meeting Wednesday, removed some of its prior pessimism about inflation. It dropped language about inflation having declined, and noted that inflation expectations have been rising. The Fed also included that it expects to see inflation move up this year and stabilize around its 2 percent target. \nSluggish inflation has been a persistent concern for the Fed, and both Yellen and incoming chair Jerome Powell have described the lack of pricing power as inexplicable, or a mystery. \n\"There are modest tweaks in the statement, They are all leaning slightly hawkish,\" said Mark Cabana, head of U.S. short rate strategy at Bank of America Merrill Lynch. Cabana said the expectations in the fed funds futures market remain for just under three rate hikes this year, with the first one in March. \nThe Fed also upgraded its view on the economy, dropping references to the impact of hurricanes and noting strength in household spending. \nJ.P. Morgan economists, who are forecasting four rate hikes this year, saw another hawkish change in the statement. \n\"The final, and most curious, change to the statement was in the forward guidance, where the prior references to the expectation for 'gradual adjustments' in monetary policy and 'gradual increases' in the funds rate were changed to 'further gradual adjustments' in monetary policy and 'further gradual increases' in the funds rate,\" wrote J.P. Morgan chief U.S. economist Michael Feroli. \"Perhaps we're a bit biased, given our hawkish expectations for this year, but we tend to see the addition of 'further' as underscoring the Committee's sense that they're not yet close to being finished.\" \nFeroli also noted that the phrase could be seen as intentional, given the more hawkish makeup of the Fed members who are on the Federal Open Market Committee and wrote the statement. \nThe Fed may have given a nod to the potential for more inflation, but strategists say the only clarity will be when it shows up in the data, and that's when the market could shift to expect more Fed rate hikes. The Fed's preferred inflation measure, the core PCE deflator, showed just an annual 1.5 percent increase in December, about the same as when Yellen took over as chair. But Treasury Inflation Protected Securities, a hedge against inflation, are at their highest since 2014. \nThe next place markets are watching for signs of inflation is in the wages data released with Friday's January employment report. But the Fed's next major pronouncement on inflation may not come until after its March meeting, when it issues its latest forecasts and Powell holds his first briefing with the press. Powell is expected to testify before Congress on the economy in February, but strategists don't expect a real change in tone until the Fed forecasts are updated. \n\"We think they upgraded their view slightly on inflation, but the last time they voted there were two dissenters, and it will be interesting to see when we come around to March, when the Fed is expected to raise rates, if there are dissenters on inflation,\" said Charlie Ripley, senior investment strategist for Allianz Investment Management. \"It will be interesting to see if, as the new chairman takes the helm, the inflation story changes. I don't think it will change that much.\" \nStocks initially gained after the 2 p.m. ET Fed statement, but then sold off, before rising sharply again. Treasury yields were higher on the day, and the 2-year, which most reflects Fed policy moves, was at 2.16 percent, its highest level since 2008. \nRipley said the move higher in Treasury yields Wednesday was partly the result of an announcement from the Treasury on the expected increase in the size of its auctions. \"They're adding supply on the long end, another $1 billion in [10-years] and another billion in 30s. This is all coming in an environment where the Fed, as the biggest buyer is paring back its purchases in the Treasury market,\" said Ripley. \nThe Fed has proceeded on a course to reduce its balance sheet by no longer replacing all of the securities maturing on its balance sheet. \"The challenge for Chair Powell will be to wade further into the uncharted waters of unwinding the crisis-era measures of near-zero interest rates and large asset purchases without creating waves in the financial markets,\" wrote Diane Swonk, the chief economist at Grant Thornton. Patti Domm CNBC Markets Editor Related Securities", "external_links": [], "published": "2018-01-31T23:35:00.000+02:00", "crawled": "2018-01-31T23:51:19.002+02:00", "highlightTitle": ""}