{"organizations": [], "uuid": "360534657a6aaf6e3d9970fd147f232a6c59e0ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/05/103523351-GettyImages-518261622.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/explosive-allegations-from-the-latest-trump-dossier-testimony.html", "country": "US", "domain_rank": 767, "title": "Here are some explosive allegations from the latest testimony on the Trump dossier", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T09:29:00.000+02:00", "replies_count": 0, "uuid": "360534657a6aaf6e3d9970fd147f232a6c59e0ea"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/explosive-allegations-from-the-latest-trump-dossier-testimony.html", "ord_in_thread": 0, "title": "Here are some explosive allegations from the latest testimony on the Trump dossier", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "dianne feinstein", "sentiment": "none"}, {"name": "christopher steele", "sentiment": "none"}, {"name": "glenn simpson", "sentiment": "none"}, {"name": "feinstein", "sentiment": "none"}, {"name": "simpson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "wisconsin", "sentiment": "none"}, {"name": "appleton", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "national rifle association", "sentiment": "none"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The latest congressional testimony about an infamous opposition-research dossier on Donald Trump is full of explosive allegations and suggestions about the real estate magnate-turned-president's potential dealings with organized crime figures, the sources of his often-bragged-about wealth and potential entanglement between Russia and the National Rifle Association.\nIn the November testimony that was released Thursday , Glenn Simpson, a former Wall Street Journal reporter and a co-founder of Fusion GPS, talks at length about his firm's research into Trump's dealings and background.\nFusion GPS commissioned the dossier compiled by former British spy Christopher Steele,\nThe release of the testimony comes more than a week after Sen. Dianne Feinstein released Simpson's testimony from a closed-door interview session with the Senate Judiciary Committee . That move drew harsh condemnation from Trump, who referred to Feinstein as \"Sneaky Dianne.\"\nGetty Images Donald Trump at a campaign rally in Appleton, Wisconsin on March 30th, 2016. The release of the House panel testimony couldn't come at a more dramatic time for Trump, either, as the president marks his first full year in office and the government barrels toward a shutdown this weekend. Trump is also a central figure in a probe led by special counsel Robert Mueller, who is investigating Russian meddling in the 2016 election and potential ties between Trump's campaign and the Kremlin.\nBoth transcripts also hit the news in the middle of the furor over Michael Wolff's tell-all book, \"Fire and Fury: Inside the Trump White House,\" which cited former chief Trump strategist Steve Bannon disparaging the president's son Donald Trump Jr., daughter Ivanka Trump and son-in-law Jared Kushner.\nTrump has denied collusion with Russia and has extensively criticized Wolff's book and Bannon — the latter of whom has reached an agreement to talk to Mueller .\nSimpson's testimony to the House Intelligence Committee is fueling already heated speculation about whether Trump is somehow indebted to Russian business and government figures. The president, for his part, has repeatedly called allegations of improper ties to Russia a \"hoax\" and often dismissed the dossier.\nPablo Martinez Monsivais | AP Glenn R. Simpson, co-founder of the research firm Fusion GPS, arrives for a scheduled appearance before a closed House Intelligence Committee hearing on Capitol Hill in Washington, Tuesday, Nov. 14, 2017. Here are some of the highlights of Simpson's testimony in November:\nSimpson said it was hard to track down \"reliable information\" about Trump's financial situation, but he said he thinks Trump's wealthy father, Fred, set him up rather nicely. \"I also think that, you know, a lot of his income comes from trusts and things that his father set up, and that he doesn't actually make that much money, you know, in terms of profits from his own activities,\" Simpson said. \"He still funds much of his — from, you know, assets that were acquired by his father.\" Trump, Simpson said, used to be mixed up with Italian mobsters before he became entangled with Russian organized crime types. \"We also had sort of more broadly learned that Mr. Trump had long time associations with Italian organized crime figures,\" Simpson testified. \"And as we pieced together the early years of his biography, it seemed as if during the early part of his career he had connections to a lot of Italian mafia figures, and then gradually during the '90s became associated with Russian mafia figures.\" Many Trump businesses were not that profitable, according to Simpson, but the 2013 Miss Universe contest in Russia turned a profit for the mogul. But, Simpson added, \"I don't think we have a full accounting you know, how much he got paid and where the money came from for putting that on in Russia.\" Trump properties in various locations around the globe received Russian money, Simpson said. \"Ultimately, you know, what we came to realize was that the money was actually coming out of Russia and going into his properties in Florida and New York and Panama and Toronto and these other places.\" The Fusion GPS co-founder told the committee that he was told, although he couldn't confirm, that Nigel Farage, the leader of the Brexit movement in the U.K. and a Trump supporter, had made trips to the Ecuadorian Embassy in London to give data to Wikileaks founder Julian Assange. \"What kind of data?\" asked ranking committee Democrat Rep. Adam Schiff. \"A thumb drive,\" Simpson replied. Assange, for his part, has denied that he worked on Russia's behalf during the campaign, and Farage's Leave.EU group, likewise, has laughed off suggestions that Russia influenced the 2016 Brexit vote and the U.S. presidential campaign. Simpson also referred to purported ties between the National Rifle Association and Russian bankers and organized crime leaders. \"It appears the Russians, you know, infiltrated the NRA,\" the Fusion GPS co-founder testified. \"And there is more than one explanation for why. But I would say broadly speaking, it appears that the Russian operation was designed to infiltrate conservative organizations. And they targeted various conservative organizations, religious and otherwise, and they seem to have made a very concerted effort to get in with the NRA.\" On Thursday, McClatchy reported that the FBI was investigating Russian donations to the NRA , which was one of Trump's biggest supporters during the 2016 election. You can read the full transcript of the testimony here.\nWATCH: Trump's doctor says he aced his mental fitness test. Here's how hard it really was show chapters Trump's doctor says he aced his mental fitness test. Here's how hard it really was. 11:21 PM ET Tue, 16 Jan 2018 | 01:10", "external_links": [], "published": "2018-01-19T09:29:00.000+02:00", "crawled": "2018-01-19T09:41:06.005+02:00", "highlightTitle": ""}