{"organizations": [], "uuid": "59437512ccbe4575b15996971648ebeab93ccec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968933-GettyImages-910080652.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/these-stocks-are-reaping-the-rewards-of-the-dollar-sell-off.html", "country": "US", "domain_rank": 767, "title": "These stocks are reaping the rewards of the dollar selloff", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T14:30:00.000+02:00", "replies_count": 0, "uuid": "59437512ccbe4575b15996971648ebeab93ccec9"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/these-stocks-are-reaping-the-rewards-of-the-dollar-sell-off.html", "ord_in_thread": 0, "title": "These stocks are reaping the rewards of the dollar selloff", "locations": [], "entities": {"persons": [{"name": "steven mnuchin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "michael binger", "sentiment": "none"}, {"name": "binger", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "gradient investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar sell-off sparked by Treasury Secretary Steven Mnuchin 's surpise comments about a weak greenback creates an opportunity for equities investors, one market watcher says.\nThe weaker U.S. dollar has benefited large multinational companies that derive a large chunk of revenue abroad, said Michael Binger, senior portfolio manager at Gradient Investments.\n\"It's a tailwind for companies and I think that's going to be a common theme throughout the whole year in 2018,\" Binger told CNBC's \" Trading Nation \" on Thursday. \"A weak dollar really does help corporate America.\"\nThe U.S. dollar index plummeted 1 percent on Wednesday and settled at its lowest level since late 2014 after Mnuchin appeared to welcome a weaker U.S. dollar as an advantage on trade. His remarks were seen as a play to talk down the dollar and support the Trump White House's protectionist agenda.\nMnuchin walked back those comments on Thursday, saying he was not concerned with where the U.S. dollar was in the short term.\nPresident Donald Trump told CNBC on Thursday that Mnuchin's comments were taken out of context. In an interview, he said: \"I don't like talking about [the U.S. dollar] because frankly nobody should be talking about it. It should be what it is. It should also be based on the strength of the country — we are doing so well.\"\nTrump also said the dollar would get \"stronger and stronger\" as the U.S. economy improves and that ultimately he would like to \"see a strong dollar.\" That was a shift from his previous remarks — Trump had told The Wall Street Journal last April that the U.S. dollar was \"getting too strong\" and that it was hindering the country's ability to compete.\nA softer U.S. dollar benefits U.S. companies in two ways, said Binger. First, it makes their products more competitive overseas by reducing their cost to foreign buyers. Second, when the companies transfer their profits back into the U.S. dollar, it produces a tailwind to sales growth. \nCompanies including United Technologies , 3M , and Johnson & Johnson have reported a rise in quarterly sales that were partially fueled by favorable currency exchange. United Technologies said foreign currency translation increased total fourth-quarter sales by 200 basis points, 3M by 270 bps, and Johnson by 450 bps.\nPiperJaffray's Craig Johnson sees the metals sector getting a boost from weakness in the U.S. dollar. The S&P Metals and Mining SPDR ETF is up 6 percent in the year to date, moving in the opposite direction of the U.S. dollar index this month as of Thursday. A depressed greenback makes domestically produced metals cheaper for foreign buyers.\nJohnson named mining company Freeport-McMoRan as his pick for the metals stock for reaping the rewards of a lower U.S. dollar.\n\"I like this stock specifically because you're just now breaking out of a meaningful base that you've been in for multiple years,\" Johnson told \"Trading Nation.\" \"Nice risk-reward and setup on this.\"\n\nFreeport-McMoRan generates 60 percent of its revenue outside the country. Its stock is up 4.5 percent in the year to date, falling behind the materials sector's 5 percent gains in 2018.\nLosses in the U.S. dollar index have picked up in January after a steady decline through 2017. The index, which measures the U.S. dollar against a basket of foreign currencies, has fallen 3 percent in January and is on track for its worst month since March 2016.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-26T14:30:00.000+02:00", "crawled": "2018-01-26T15:05:26.016+02:00", "highlightTitle": ""}