{"organizations": [], "uuid": "e7942e2a20a218906c0a124976375ed08328ade2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://search.cnbc.com/rs/search/all/view.rss?partnerId=2000&keywords=agriculture&sort=date&minimumrelevance=0.2&pubtime=30&pubfreq=d&categories=exclude", "section_title": "CNBC.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-grains-wheat-hits-four-month-high-as-u-s-winter-crop-ratings-fall.html", "country": "US", "domain_rank": 767, "title": "GRAINS-Wheat hits four-month high as U.S. winter crop ratings fall", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T13:35:00.000+02:00", "replies_count": 0, "uuid": "e7942e2a20a218906c0a124976375ed08328ade2"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/reuters-america-grains-wheat-hits-four-month-high-as-u-s-winter-crop-ratings-fall.html", "ord_in_thread": 0, "title": "GRAINS-Wheat hits four-month high as U.S. winter crop ratings fall", "locations": [], "entities": {"persons": [{"name": "michael hogan", "sentiment": "negative"}, {"name": "graydon chong", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s. plains", "sentiment": "none"}], "organizations": [{"name": "chicago board of trade march", "sentiment": "none"}, {"name": "rabobank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAINS-Wheat hits four-month high as U.S. winter crop ratings fall Michael Hogan \n* Wheat up for fifth session, hits highest since October \n* Prices supported by concern over U.S. crop condition \n* South American weather underpins corn, soybeans \n(Recasts with European trade, adds comment, changes dateline) HAMBURG, Jan 30 (Reuters) - Chicago wheat rose for a fifth session on Tuesday to touch a four-month high on concern that dry conditions in parts of the U.S. Plains are damaging crops. Chicago Board of Trade March wheat was up 1.3 percent at $4.55-1/4 a bushel by 1120 GMT, having risen by 1.8 percent on Monday. Chicago's most-active wheat contract on Tuesday hit its highest since Sept. 29 at $4.55-1/4 a bushel. March soybeans were up 0.1 percent at $9.93 a bushel and March corn rose 0.3 percent to $3.60 a bushel. We are certainly now in a weather market, with wheat focusing on conditions in the United States, while soybeans and corn are influenced by conditions in South America, said Graydon Chong, senior commodity analyst with Rabobank. Condition ratings of U.S. winter wheat declined in January in several southern U.S. Plains states hit by drought, including top U.S. producer Kansas, the U.S. Department of Agriculture (USDA) said on Monday. The USDA rated 14 percent of the Kansas winter wheat crop in good-to-excellent condition, sharply down from 37 percent at the end of December. There is close market attention on the state of U.S. winter wheat, with concern about dryness and cool temperatures in parts of the U.S. Plains in the past few weeks,\" Chong said. \"The market seems to expect the dryness in the U.S. Plains to cause a further deterioration of winter wheat crop ratings and this is reflected in firm prices today. However, the actual impact will not be visible for some time yet. There is also concern that lack of rain in Argentina's soybean belt could reduce the crop in the world's biggest exporter of soymeal. \"Soybeans have been supported recently by fear drought could stress Argentine soybean crops, with soymeal leading the rally, Chong said. Thunderstorms and rainfall in key soy producing regions could hamper harvesting and delay planting of winter corn in some areas of Brazil, one weather forecaster said on Monday. \"There is concern about rain delaying the soybean harvest in Brazil,\" Chong said. \"But conditions in Brazil have been mixed and I think the crop picture overall is pretty good. \"I am expecting a large soybean harvest there of over 110 million tonnes for a second consecutive year. Corn is receiving some spillover support from the strength in wheat, Chong said, adding that there is also attention on the speed of Brazils soybean harvest, with any substantial delays raising the possibility that less corn could be planted after soybeans. \nGrains prices at 1120 GMT \nContract Last Change Pct chg Two-day chg MA 30 RSI CBOT wheat 455.25 6.00 +1.34% +10.97% 412.06 80 CBOT corn 359.75 1.00 +0.28% +2.86% 349.12 76 CBOT soy 993.25 1.75 +0.18% -2.65% 995.82 72 CBOT rice $12.41 -$0.03 -0.24% +26.45% $10.10 75 WTI crude $65.04 -$0.52 -0.79% +36.96% $47.97 62 \nCurrencies \nMost active contracts Wheat, corn and soy US cents/bushel. Rice: USD per hundredweight \nRSI 14, exponential", "external_links": [], "published": "2018-01-30T13:35:00.000+02:00", "crawled": "2018-01-30T20:54:10.032+02:00", "highlightTitle": ""}