{"organizations": [], "uuid": "fc25dab3a681b6ed1c882696cf00ce13ac1fb06c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/22/103408149-GettyImages-502924680.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/december-existing-home-sales.html", "country": "US", "domain_rank": 767, "title": "Existing home sales sink in December, market housing supply drops to record low", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "fc25dab3a681b6ed1c882696cf00ce13ac1fb06c"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/december-existing-home-sales.html", "ord_in_thread": 0, "title": "Existing home sales sink in December, market housing supply drops to record low", "locations": [], "entities": {"persons": [{"name": "david paul morris", "sentiment": "none"}], "locations": [{"name": "u.s", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "national association of realtors", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. home sales fell more than expected in December as the supply of houses on the market dropped to a record low, pushing up prices and likely sidelining some first-time buyers.\nThe National Association of Realtors said on Wednesday that existing home sales declined 3.6 percent to a seasonally adjusted annual rate of 5.57 million units last month amid decreases in all four regions.\nNovember's sales pace was revised down to 5.78 million units, still the highest level since February 2007. Economists polled by Reuters had forecast home sales falling 2.2 percent to a 5.70 million-unit rate in December from a previously reported 5.81 million-unit pace in November.\nExisting home sales, which account for about 90 percent of U.S. home sales, rose 1.1 percent on a year-on-year basis in December. They increased 1.1 percent to 5.51 million units in 2017, the highest level since 2006.\nThe NAR attributed the sales decline in December, which followed three straight months of gains, to a perennial shortage of houses at the lower end of the market.\nThe number of previously owned homes on the market tumbled 11.4 percent to 1.48 million units in December, the lowest since January 1999 when the Realtors group started tracking the series. Housing inventory was down 10.3. percent from a year ago. It has declined for 31 straight months on a year-on-year basis.\nAt December's sales pace, it would take a record low 3.2 months to exhaust the current inventory, down from 3.5 months in November. A six-month supply is viewed as a healthy balance between supply and demand.\nWith supply still tight, the median house price increased 5.8 percent from a year ago to $246,800 in December. That was the 70th straight month of year-on-year price gains. House prices increased 5.8 percent in 2017, rising for the sixth straight year.", "external_links": [], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T17:17:22.007+02:00", "highlightTitle": ""}