{"organizations": [], "uuid": "a41e9bb55b2438b95d5370c5127d53cb18f0fcb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Citigroup Promises to Bridge the Pay Gap in Three Countries – Fortune", "url": "http://fortune.com/2018/01/15/citi-group-raise-pay-gap-women-minorities/", "country": "US", "domain_rank": 1196, "title": "Citigroup Promises to Bridge the Pay Gap in Three Countries", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T04:30:00.000+02:00", "replies_count": 0, "uuid": "a41e9bb55b2438b95d5370c5127d53cb18f0fcb6"}, "author": "Reuters", "url": "http://fortune.com/2018/01/15/citi-group-raise-pay-gap-women-minorities/", "ord_in_thread": 0, "title": "Citigroup Promises to Bridge the Pay Gap in Three Countries", "locations": [], "entities": {"persons": [{"name": "jennifer lowney", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "citigroup", "sentiment": "negative"}, {"name": "citigroup promises", "sentiment": "negative"}, {"name": "citi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 9:30 PM EST \nCitigroup (c) will increase compensation for women and minorities to bridge pay gaps in the U.S., the U.K. and Germany, as part of its annual pay process this year, the Wall Street bank said on Monday. \nAs part of the move, Citi also becomes the first big U.S. bank to respond to a shareholder push to analyze and disclose its gender pay gap. \nCiti said it had conducted a survey in the three countries, where it found that women and minorities are paid only slightly less than their male and non-minority counterparts. \nOn average, Citi found, women and minorities are paid 99% of what men and non-minorities are paid, respectively. \nCompensation would be raised based on the pay gaps identified in the survey, Citi spokeswoman Jennifer Lowney said. \n“Our continuing focus on pay equity furthers our goal of being the employer of choice for employees of diverse backgrounds,” Citi said in a statement on its website. \nThe company also said it would adjust compensation for other individuals , where the analysis determined increases were necessary. \nCiti, along with other U.S. banks and credit card companies, has been under investor pressure to disclose how much less it pays women than men. \nFor more on the gender wage gap, watch Fortune’s video: \nEmployers in the UK will be required to publish gender pay gaps by April. Banks have been among the largest offenders, with median pay gaps averaging 24 percent, according to a joint statement by Citi and activist investor Arjuna Capital on Monday. \nArjuna asked Citi’s shareholders last year to vote in favor of a proposal requiring the bank to address the gender pay gap. \nBut on Monday, Arjuna withdrew that proposal, saying that Citi’s announcement represented a major shift for U.S. banks and credit card companies. \n“Citigroup is stepping into a leadership role on the gender pay gap that we have not seen from any of its U.S. financial peers,” said Arjuna Capital Managing Partner Natasha Lamb. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T04:30:00.000+02:00", "crawled": "2018-01-16T04:30:21.000+02:00", "highlightTitle": ""}