{"organizations": [], "uuid": "c58254411a065333ddf677bc84d1e55ef7229afe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "http://www.bostonherald.com/sites/default/files/styles/full/public/media/2018/01/20/fortune-logo.jpg?itok=okhzCssa", "site_section": "http://www.bostonherald.com/feed", "section_title": "Boston Herald - Boston Herald", "url": "http://fortune.com/2018/01/20/us-china-relations-the-gathering-storm/", "country": "US", "domain_rank": 1196, "title": "US-China relations: The gathering storm?", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "c58254411a065333ddf677bc84d1e55ef7229afe"}, "author": "Clay Chandler", "url": "http://fortune.com/2018/01/20/us-china-relations-the-gathering-storm/", "ord_in_thread": 0, "title": "US-China relations: The gathering storm?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "clay chandler", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "south china sea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "u.s. defense department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Clay Chandler, FORTUNE   Fortune comments \nIn the first year of his presidency Donald Trump took a soft line on China, belying his strident “ China, China, China ” rhetoric on the campaign trail. A flurry of recent reports suggest that in 2018 Trump’s bromance with Chinese leader Xi Jinping is finally over. \nAt long last, we’re told, Trump has had enough. He’s ready to seize the Chinese dragon by its whiskers on a host of issues ranging from North Korea and the South China Sea, to intellectual property rights and immigration. Some signs of a shift: \nOn Friday, the U.S. Defense Department released an 11 page unclassified summary of its 2018 National Defense Strategy identifying competition with China and Russia as “principal priorities” for the US military. The report, a summary of a more detailed classified document submitted to Congress last year, warned that the two U.S. rivals are actively seeking to “co-opt or replace the free and open order that has enabled global security and prosperity in since World War II.” Henceforth, “great-power competition,” not terrorism, must be the primary focus of U.S. national security, the report declared: “The central challenge to U.S. prosperity and security is the reemergence of long-term strategic competition,” primarily from China and Russia. \nThat same day my old Wall Street Journal colleague Jake Schlesinger reported that the Trump administration intends to be “more focused in the coming year on countering China” than it was last year, when it sparred with a broad range of allies in North America, Europe and Asia. From here on, Jake reported, quoting unnamed officials “designated by the White House to speak about coming trade enforcement decisions and negotiations,” the Trump administration will emphasize “enforcement over negotiations” when dealing with China, and give up on trying to resolve disputes through the World Trade Organization. \nJournal columnist Andrew Browne, similarly, says the White House is readying “a mix of tariffs and quotas” to deter Chinese imports of “everything from steel to solar panels and washing machines.” Last year’s record Chinese annual trade surplus with the US , Browne notes, is a “potential catalyst for hostilities after a year of bluster.” \nThere are plenty of other ominous portents. On Monday, the FBI arrested Jerry Chun Shing Lee , a prime suspect in a high stakes espionage battle with China, as he stepped off a Cathay Pacific flight at Kennedy International Airport. US official allege that Lee, a former CIA agent employed by Christie’s in Hong Kong , was a mole who ratted out U.S. intelligence operatives in China, many of whom were imprisoned or executed . \nAlso this week, the Wall Street Journal reported that U.S. counterintelligence officials in early 2017 warned Trump son-in-law and senior adviser Jared Kushner that Wendi Deng Murdoch, the ex-wife of Journal owner Rupert Murdoch, might be using her friendship with Kushner and his wife, Ivanka Trump , to “further the interests of the Chinese government.” In this week’s New Yorker, Adam Entous and Evan Osnos suggest Jared and Ivanka naively allowed themselves to be manipulated by China’s ambassador the US, Cui Tiankai. \nAll that intrigue swirls in the wake of US congressional moves against attempted US investments by two high-profile Chinese companies. In early January, Ant Financial, the electronics payment affiliate of China’s Alibaba Group, and MoneyGram, a Texas-based money transfer company, announced that they had been forced to abandon a proposed deal after failing to win approval from the Committee on Foreign Investment in the United States (CFIUS), a congressional panel that reviews foreign purchases of American companies. Last week, a proposed alliance between China telecom manufacturer Huawei Technologies and U.S. carrier AT&T collapsed after members of the U.S. Senate and House intelligence committees dispatched a letter to the Federal Communications Commission citing concerns about “Chinese espionage in general, and Huawei’s role in that espionage in particular.” \nAre the world’s two largest economies finally headed for a showdown? It’s impossible to know. As always, the wild card in the Age of Trump is Trump himself, who remains as inconsistent, contradictory and unpredictable as ever. \nMore China news below. Technology and Investment \nFacebook’s new look: made in China? Did Mark Zuckerberg deemphasize media content on Facebook’s newsfeed to boost his chances of getting into the China? Wired \nFacebook’s China whisperer bows out Wang-Li Moser, Facebook’s lead liaison with Beijing has left the company in December, complicating the social network’s long-running effort to gain greater access to the China market. New York Times \nGoogle drops a pin in Shenzhen A month after announcing plans to launch an artificial intelligence lab in China, Google has opened an office in Shenzhen. Google’s search engine service remains banned in China, but the firm has a joint investment in Chinese live-streaming mobile game platform and mobile apps with map functions based on Google data can now be accessed in the country. TechNode \nBlacklisted again The US Trade Representative has added Alibaba’s Taobao to its annual blacklist of the world’s most “notorious markets” for sales of pirated and counterfeit goods for the second year. Alibaba says the blacklisting doesn’t reflect its IP-protection efforts. Reuters \nNew funding for JD Logistics Ahead of a possible overseas IPO, Chinese e-commerce firm JD.com has started a US$2 billion fundraising round for its logistics spin-off, JD Logistics. The minimum investment for the round is reportedly set at US$100 million and the funding round will value JD Logistics at around US$10 billion. Hillhouse Capital and Sequoia Capital China will likely be lead investors in the funding round. China Money Network \nPining for Chinese scientists Chinese venture capital firm Shenzhen Green Pine Capital Partners has launched a RMB1 billion (US$155 million) fund to lure overseas Chinese scientists to launch businesses in the southern city of Shenzhen. The firm has also set up a start-up incubator for returnees, which will provide free office space, business partner matchmaking, and business consulting in areas like equity structuring, corporate finance and property rights. China Money Network \nCrypto crackdown China, home to the world’s biggest community of Bitcoin miners, is cracking down on cryptocurrency activity, haling trade of virtual currencies on domestic exchanges and banning initial currency offerings. Fortune Trade and Economy \nGDP growth gains Beijing said China’s economic grow 6.9% in 2017, the first uptick the world’s second-largest economy has seen since 2010. South China Morning Post \nBirths decline China’s national statistics bureau said the number of births in fell to 17.23 million in 2017, down from 17.86 million the previous year. The decline came despite a policy change that took effect last year allowing Chinese families to have two children rather than just one. Financial Times \nPunishing China bigly Trump and his administration are about to impose a “big fine” on China for the alleged theft of intellectual property, according to Trump economic adviser Gary Cohn. Reuters \nTrump vs Trumpchi Washington has blocked Guangzhou Automobile Group’s plan to export cars to the US. ", "external_links": [], "published": "2018-01-20T02:00:00.000+02:00", "crawled": "2018-01-21T09:22:53.008+02:00", "highlightTitle": ""}