{"organizations": [], "uuid": "3affcfac01aa8d55af7bcc06a7f0409e5fe53eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/20/104540974-GettyImages-656253978-ginni-rometty.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/ibm-shares-jump-2-percent-after-barclays-upgrade-the-worst-may-finally-be-over.html", "country": "US", "domain_rank": 767, "title": "IBM shares jump 2% after Barclays upgrade: 'The worst may finally be over'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T15:21:00.000+02:00", "replies_count": 0, "uuid": "3affcfac01aa8d55af7bcc06a7f0409e5fe53eab"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/ibm-shares-jump-2-percent-after-barclays-upgrade-the-worst-may-finally-be-over.html", "ord_in_thread": 0, "title": "IBM shares jump 2% after Barclays upgrade: 'The worst may finally be over'", "locations": [], "entities": {"persons": [{"name": "mark moskowitz", "sentiment": "none"}, {"name": "david becker", "sentiment": "none"}, {"name": "ginni rometty", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "ibm", "sentiment": "negative"}, {"name": "venture capital ibm", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "international business machines corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares of IBM rose 2 percent in premarket trading Wednesday after a top Wall Street bank upgraded shares, saying \"a new dawn emerges.\"\nBarclays raised its rating on IBM stock to overweight all the way from underweight on Wednesday, advising investors that the company could come to rival Amazon and Microsoft 's Azure in the cloud technology business.\n\"We think that IBM could emerge as the next important cloud vendor after Amazon and Azure over time as customers seek a multi-cloud strategy to avoid vendor lock-in or technology complacency,\" wrote Barclays analyst Mark Moskowitz. \"As a result, IBM's strategic revenue should surpass legacy revenue – implying the worst may be over.\"\nThe analyst raised his price target to $192 from $133, representing 17 percent upside from Tuesday's close.\nIBM has struggled to keep its top line steady over the past several years as competition in technology has grown fiercer; the company's revenue has declined for 22 quarters in a row as of its October earnings report. But the company has tended to beat expectations as of late and now expects to finish the 2017 calendar year with at least $13.80 in earnings per share, 5 cents higher than consensus.\nIBM reports fourth-quarter earnings Thursday afternoon. The shares are down 2.4 percent in the last 12 months, compared with a 35 percent surge in the Technology Select SPDR ETF.\nDevelopments in analytics, cloud, mobile and security technologies are all being considered as a way to offset revenue shortfalls in the company's legacy products, according to the Moskowitz. Roughly 46 percent of revenue in the third quarter came from these new strategic imperatives, while cloud revenue for the quarter was $4.1 billion, up 20 percent from the previous year.\nAs one of the technologies highlighted by Moskowitz, blockchain may also be an area in which IBM could capitalize. It currently has 1,500 employees assigned to developing blockchain, hoping to leverage the popular technology with Walmart to address food safety.\n\"Eighty-four percent of chief investment officers plan to use multiple cloud vendors and IBM's initiatives with both blockchain and analytics could help the company become a more competitive vendor for certain cloud workloads,\" Moskowitz said. \"Uptake of these solutions would benefit IBM revenue and help scale the company's cloud segment margin.\"\n—CNBC's Michael Bloom contributed to this report.\nDisclaimer", "external_links": [], "published": "2018-01-17T15:21:00.000+02:00", "crawled": "2018-01-17T15:51:12.013+02:00", "highlightTitle": ""}