{"organizations": [], "uuid": "04361ae4845bf4d1ec0d4f351d16c034c1264702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://richinwriters.com/feed", "section_title": "RichInWriters.com", "url": "https://www.cnbc.com/2018/01/12/10-misused-words-that-make-smart-people-look-stupid.html", "country": "US", "domain_rank": 767, "title": "10 misused words that make smart people look stupid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T19:39:00.000+02:00", "replies_count": 0, "uuid": "04361ae4845bf4d1ec0d4f351d16c034c1264702"}, "author": "anonymous Hipster", "url": "https://www.cnbc.com/2018/01/12/10-misused-words-that-make-smart-people-look-stupid.html", "ord_in_thread": 0, "title": "10 misused words that make smart people look stupid", "locations": [], "entities": {"persons": [{"name": "o. henry", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We're all tempted to use words that we're not too familiar with. We throw them around in meetings, e-mails and important documents (such as resumes and client proposals), and they land, like fingernails across a chalkboard, on everyone who has to hear or read them.\nNo matter how talented you are or what you've accomplished, using words incorrectly can change the way people see you and forever cast you in a negative light. You may not think it's a big deal, but if your language is driving people up the wall you need to do something about it.\nMore from Travis Bradberry:\n7 things deeply intuitive people do differently\n6 things great leaders do differently\n6 toxic thoughts successful people quarantine\nIt's the words that we think we're using correctly that wreak the most havoc, because we don't even realize how poorly we're coming across. After all, TalentSmart has tested the emotional intelligence of more than a million people and found that self-awareness is the area where most people score the lowest.\nWe're all guilty of this from time to time, myself included.\nshow chapters The smartest and dumbest things to do with your end-of-year bonus 11:32 AM ET Fri, 15 Dec 2017 | 01:07 When I write, I hire an editor to review my articles before I post them online. It's bad enough to have a roomful of people witness your blunder and something else entirely to stumble in front of 100,000!\nOften, it's the words we perceive as being more \"correct\" or sophisticated that catch us by surprise when they don't really mean what we think they do. These words have a tendency to make even really smart people stumble.\nIronic vs. Coincidental A lot of people get this wrong. If you break your leg the day before a ski trip, that's not ironic — it's coincidental (and bad luck).\nIronic has several meanings, all of which include some type of reversal of what was expected. Verbal irony is when a person says one thing but clearly means another. Situational irony is when a result is the opposite of what was expected. O. Henry was a master of situational irony. In \"The Gift of the Magi,\" Jim sells his watch to buy combs for his wife's hair, and she sells her hair to buy a chain for Jim's watch. Each character sold something precious to buy a gift for the other, but those gifts were intended for what the other person sold. That is true irony.\nIf you break your leg the day before a ski trip, that's coincidental. If you drive up to the mountains to ski, and there was more snow back at your house, that's ironic.\nAffect vs. Effect To make these words even more confusing than they already are, both can be used as either a noun or a verb.\nLet's start with the verbs. Affect means to influence something or someone; effect means to accomplish something. \"Your job was affected by the organizational restructuring\" but \"These changes will be effected on Monday.\"\nAs a noun, an effect is the result of something: \"The sunny weather had a huge effect on sales.\" It's almost always the right choice because the noun affect refers to an emotional state and is rarely used outside of psychological circles: \"The patient's affect was flat.\"\nLie vs. Lay We're all pretty clear on the lie that means an untruth. It's the other usage that trips us up. Lie also means to recline: \"Why don't you lie down and rest?\" Lay requires an object: \" Lay the book on the table.\" Lie is something you can do by yourself, but you need an object to lay .\nIt's more confusing in the past tense. The past tense of lie is — you guessed it — lay : \"I lay down for an hour last night.\" And the past tense of lay is laid: \"I laid the book on the table.\"\nshow chapters Make your family more savvy around money with these fun ideas 11:35 AM ET Wed, 22 Feb 2017 | 01:28 Accept vs. Except These two words sound similar but have very different meanings. Accept means to receive something willingly: \"His mom accepted his explanation\" or \"She accepted the gift graciously.\" Except signifies exclusion: \"I can attend every meeting except the one next week.\"\nTo help you remember, note that both except and exclusion begin with ex .\nBring vs. Take Bring and take both describe transporting something or someone from one place to another, but the correct usage depends on the speaker's point of view. Somebody brings something to you, but you take it to somewhere else: \" Bring me the mail, then take your shoes to your room.\"\nJust remember, if the movement is toward you, use bring; if the movement is away from you, use take .\nBringing it all together English grammar can be tricky, and, a lot of times, the words that sound right are actually wrong. With words such as those above, you just have to memorize the rules so that when you are about to use them, you'll catch yourself in the act and know for certain that you've written or said the right one.\nDr. Travis Bradberry is the award-winning co-author of the No. 1 bestselling book, \"Emotional Intelligence 2.0\" and the co-founder of TalentSmart, the world's leading provider of emotional intelligence tests and training, serving more than 75 percent of Fortune 500 companies.\nLike this story? Like CNBC Make It on Facebook .\nDon't miss: Barack Obama's advice to Hillary Clinton: 'Work smart, not just hard'\nThis article originally appeared on LinkedIn.\nFollow CNBC Make It on show chapters The most important things to do with your money before 30 7:13 PM ET Tue, 15 Nov 2016 | 01:13", "external_links": [], "published": "2018-01-12T19:39:00.000+02:00", "crawled": "2018-01-12T20:04:43.000+02:00", "highlightTitle": ""}