{"organizations": [], "uuid": "751b2e3f33a2ee89de1f9d9864c4caacf8c9110f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/09/103618609-GettyImages-75257071.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/stocks-have-not-been-this-overbought-in-22-years-says-technician.html", "country": "US", "domain_rank": 767, "title": "The last time the market was this overbought stocks rallied nearly another 130%, says technician", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T22:48:00.000+02:00", "replies_count": 0, "uuid": "751b2e3f33a2ee89de1f9d9864c4caacf8c9110f"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/stocks-have-not-been-this-overbought-in-22-years-says-technician.html", "ord_in_thread": 0, "title": "The last time the market was this overbought stocks rallied nearly another 130%, says technician", "locations": [], "entities": {"persons": [{"name": "bill clinton", "sentiment": "negative"}, {"name": "ari wald", "sentiment": "none"}, {"name": "wald", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "oppenheimer", "sentiment": "none"}, {"name": "rsi", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "21 Hours Ago | 04:34 \nThe stock market is its most overbought since Bill Clinton was president, but that may actually be a good thing. \nThe S&P 500 's 14-month relative strength index (RSI) surpassed the 87 level for the first time in nearly 22 years, Ari Wald, head of technical analysis at Oppenheimer, told CNBC's \" Trading Nation \" on Monday. That's a level it has reached only 1 percent of the time since 1930 – the other periods in which the measure moved that high were in 1996, 1986 and 1955, three of the strongest bull markets in history. \n\"There's really two key takeaways,\" said Wald. \"One, even when you got to those high RSI readings, it was still followed by above-average returns. Two, that RSI indicator peaked at least a year ahead of the market on all those occasions.\" \nThe RSI is a momentum indicator technicians use to measure whether a stock or asset is overbought or oversold during a specific period of time. \nWald dusted off the history books. In 1996, the RSI hit 87 in June – from there to the market peak, the S&P 500 rose 128 percent. A decade earlier, the RSI reached similar levels and the S&P 500 proceeded to gain roughly 50 percent through to the bull market's high. \nGoing further back, in 1955, the RSI peaked at 88 in July and gained around 15 percent through to the top of its bullish stretch. \nThe current bull market has run for nearly nine years and most analysts do not see an end in sight. It is the second-longest bull market in history, beaten only by the stretch from 1990 to 2000. Since a bottom in 2009, the S&P 500 has climbed roughly 320 percent. The 1990-2000 bull market rose 417 percent. \n\"Add it up using history as a guide, how we see it is these overbought conditions are arguing against the top and instead for a continuation of the bull market,\" said Wald. He credits \"broad-based internal breadth, cyclical leadership, and strong credit\" as the main contributors to the markets' strength. \nBill Baruch , president of Blue Line Futures, is also bullish on the S&P 500 even as the equities market trades at its highest level in history. \n\"The market is not correcting. The question is, where's the next 1 percent to 2 percent? I believe the next 1 percent to 2 percent is higher,\" Baruch told \"Trading Nation\" on Monday. \"I don't imagine getting any sort of correction until after March.\" \nBaruch targets 2,847 for the S&P 500 for 2018, roughly flat with Tuesday's trading levels. Counting from the beginning of the year, Baruch's target suggests a more than 6 percent gain for the S&P 500 in 2018. \nWall Street has already had a remarkable run to begin the year. The S&P 500 is up 6 percent, the Dow also 6 percent and the Nasdaq nearly 9 percent for the year to date. The consumer discretionary sector is the best performer of the S&P 500 so far this year, led by a more than 30 percent gain in Netflix shares, while the telecom and utilities sectors are the worst performers.", "external_links": [], "published": "2018-01-23T22:48:00.000+02:00", "crawled": "2018-01-23T22:59:12.014+02:00", "highlightTitle": ""}