{"organizations": [], "uuid": "66ae7535524a4ab40cf91872f9a1f2be9a2bacb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948355-GettyImages-905565968-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/former-trump-aide-bannon-refuses-to-comply-with-house-subpoena.html", "country": "US", "domain_rank": 767, "title": "Former Trump aide Bannon refuses to comply with House subpoena", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T13:08:00.000+02:00", "replies_count": 0, "uuid": "66ae7535524a4ab40cf91872f9a1f2be9a2bacb8"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/former-trump-aide-bannon-refuses-to-comply-with-house-subpoena.html", "ord_in_thread": 0, "title": "Former Trump aide Bannon refuses to comply with House subpoena", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "devin nunes", "sentiment": "none"}, {"name": "mark wilson", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "negative"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump's former chief strategist Steve Bannon declined on Tuesday to comply with a subpoena ordering him to answer questions from a U.S. House intelligence panel about his time at the White House as part of its investigation into allegations of Russian interference in the U.S. election.\nAfter Bannon initially refused to answer questions about the matter, Devin Nunes, the committee's Republican party chairman, authorized a subpoena during the meeting to press Bannon to respond.\nEven then, Bannon refused to answer questions after his lawyer had conferred with the White House and was told again to refuse to answer questions about the transition period immediately after Trump was elected, or Bannon's time in the administration, according to Representative Adam Schiff , the top Democrat on the committee.\nSeparately, the New York Times reported that Bannon had been subpoenaed by Special Counsel Robert Mueller to testify before a grand jury in a probe of alleged ties between Russia and Trump's 2016 presidential campaign, on Tuesday.\nIt was the first time Mueller is known to have used a subpoena against a member of Trump's inner circle, the Times said. It cited a person with direct knowledge of the matter.\nA spokesman for Mueller's office declined comment. Bill Burck, a lawyer for Bannon, could not immediately be reached for comment on the subpoena or his testimony before the House panel.\nThe reported subpoena of Bannon does not mean he is a target of Mueller's criminal investigation.\nGetty Images Steve Bannon, former advisor to President Trump, arrives at a House Intelligence Committee closed door meeting, on January 16, 2018 in Washington, DC. Bannon, a champion of Trump's \"America First\" agenda, was among the Republican's closest aides during the 2016 election campaign, the presidential transition and his first months in office.\nBut the pair had a bitter public falling out over comments Bannon made to author Michael Wolff for his recent book \"Fire and Fury: Inside the Trump White House.\"\nIn the book, Bannon is Quote: d as describing a June 2016 meeting between Trump associates, including the president's son Donald Trump Jr., his son-in-law, Jared Kushner , and a Russian lawyer, as \"treasonous\" and \"unpatriotic.\"\nRussia has denied meddling in the election and Trump has denied any collusion between his campaign and Moscow.\nBannon was fired by the White House in August, though he continued to speak with Trump and tried to promote the president's agenda.\nPressure tactic?\nBannon spent hours on Tuesday meeting behind closed doors with members of the House of Representatives Intelligence Committee. He was the latest high-profile figure to appear before the panel as part of its investigation into allegations of Russian interference in the U.S. election.\nBannon refused to speak not only about his time at the White House, but also any conversations he had with President Trump after he had left the administration \"that might be for the purpose of the President seeking his advice on anything,\" Schiff said.\n\"We expect to have Mr. Bannon back in, we hope very soon, with a different position by the White House,\" Schiff said.\nAsked if the White House had told Bannon not to answer certain questions, spokeswoman Sarah Sanders said: \"As with all congressional activities touching upon the White House, Congress must consult with the White House prior to obtaining confidential material.\"\n\"We've been cooperating fully with these ongoing investigations and encourage the committees to work with us to find an appropriate accommodation in order to ensure Congress obtains information necessary to its legitimate interests,\" she said.\nMueller's subpoena, which was issued last week, could be a pressure tactic to induce Bannon to cooperate fully with his investigation.\nAttorney Renato Mariotti, a former federal prosecutor, said the most likely reason for a Mueller subpoena of Bannon was that \"he thought having an attorney present and giving Bannon a more relaxed setting would not yield the same testimony as if he got him in the grand jury room with no attorney there and a more adversarial style of questioning.\"\nA witness is not permitted to bring an attorney into a federal grand jury proceeding, but can step outside to consult with counsel.", "external_links": [], "published": "2018-01-17T13:08:00.000+02:00", "crawled": "2018-01-17T13:21:40.021+02:00", "highlightTitle": ""}