{"organizations": [], "uuid": "48ce1c746e00e9b1dcd9e7bc7808f4fae67220bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/11/104766841-IMG_9442r-jim-cramer.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/cramer-remix-my-advice-for-goldman-sachs-ceo-lloyd-blankfein.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: My advice for Lloyd Blankfein on cryptocurrencies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T01:59:00.000+02:00", "replies_count": 0, "uuid": "48ce1c746e00e9b1dcd9e7bc7808f4fae67220bf"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/cramer-remix-my-advice-for-goldman-sachs-ceo-lloyd-blankfein.html", "ord_in_thread": 0, "title": "Cramer Remix: My advice for Lloyd Blankfein on cryptocurrencies", "locations": [], "entities": {"persons": [{"name": "lloyd blankfein", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "michael nagle", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "19 Hours Ago | 01:06 \nAfter a mixed earnings report from Goldman Sachs sparked a debate among Wall Street's bulls and bears, CNBC's Jim Cramer offered a piece of advice to the bank's well-known CEO. \n\"Whenever Goldman's results hit an air pocket, it always finds a new way to make money. My suggestion to CEO Lloyd Blankfein ? Let's accept that cryptocurrencies are here to stay and own that market, offering worldwide hedges on the most volatile commodity trading since the tulip craze,\" the \" Mad Money \" host said. \nCramer argued that after this quarter, Goldman's stock is cheap, selling for only 10 times next year's earnings estimates after reporting a 50 percent drop in trading revenues. \n\"Wall Street may be confused about how Goldman Sachs did this quarter. I'm not,\" he said. \"Many of the worries, to me, seem totally overblown, which is why I recommend picking up some shares right at the opening Monday and then waiting for a further pullback to buy more on the way down.\" Cramer's game plan: A guessing game Michael Nagle | Bloomberg | Getty Images A trader wearing a 'Dow 26,000' hat works on the floor of the New York Stock Exchange (NYSE) in New York. \nEven with a government shutdown looming , Cramer expected good things for the next leg of earnings season. \n\"Earnings season is upon us and it is always a guessing game, but this time around the rules have changed,\" he said. \"Rather than worrying about whether companies will beat or miss their forecasts, now we're guessing how much money those companies will return to you, the shareholders, in the form of dividends and buybacks.\" \nCalling the shutdown news less than meaningful for the market, Cramer said it was unlikely to crush equities. Instead, it will probably push stocks down to buyable levels, he said. \n\"If a shutdown does cause delays in when the IRS sends its tax rebates, we might get a temporary decline in consumer spending,\" Cramer said. \"Again, though, another buying opportunity: Home Depot , Amazon , Kohl's , Walmart . Why? The problem is temporary.\" \nWith that in mind, Cramer turned to the stocks and events he'll be watching with or without a shutdown. Why you should consider buying Amazon Getty Images Amazon.com founder and CEO Jeff Bezos. \nWhen a company like Amazon raises the prices for its service and nobody cares, Jim Cramer sees a clear next move. \n\"When you see something like that, it's about as clear a buy signal as you are ever, ever, ever going to get,\" the \"Mad Money\" host said on Friday after Amazon upped the price of its monthly Prime membership rate by 18 percent. \nThe price boost — from $10.99 to $12.99 for full-paying members — will total $156 a year, a \"smart\" move considering Amazon's yearly membership rate of $99 will remain the same, Cramer said. \n\"It's basically a tax on people who only pay month-to-month,\" he said. \nBetter yet, Cramer expected no resistance \"whatsoever\" to the price increase thanks to the quality and value that Amazon's Prime service provides. WWE CFO on becoming a 'data powerhouse' Lukas Schulze | Bongarts | Getty Images Sin Cara jumps during to the WWE Live Duesseldorf event at ISS Dome on February 22, 2017 in Duesseldorf, Germany. \nWith nearly $800 million in revenues, a $2.6 billion market cap and 850 million social media followers, World Wrestling Entertainment isn't the tiny ticketing business it was 35 years ago. \nA massive overhaul of the wrestling network in 2013 and 2014 drove the \"wave of growth\" that made it a central player in digital media despite its seemingly niche content, CFO George Barrios told CNBC. \n\"Content, continued global growth and the direct-to-consumer digital has turned us into a data powerhouse,\" Barrios told Cramer in a Friday interview . \"We've seen about 70 percent growth since 2008, and we think there's a lot more runway.\" Lightning round: The way to play Japan \nIn Cramer's lightning round , he shared his take on some callers' favorite stocks: \nMitsubishi Financial Group : \"You know what, you actually should [add Mitsubishi to your portfolio]. I've been working on Japan and that is a great way to play Japan. I'm going to endorse that.\" \nJetBlue : \"JetBlue is OK. I'm actually talking about Southwest . My charitable trust should not have sold it. It had a gain. If LUV comes back when it reports [on Jan. 25], that's the one to be in.\" \nQuestions for Cramer? ", "external_links": [], "published": "2018-01-20T01:59:00.000+02:00", "crawled": "2018-01-20T02:07:57.019+02:00", "highlightTitle": ""}