{"organizations": [], "uuid": "5966041604788483fc3d67e3256a815ed4230b72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104847675-GettyImages-875012992-ryan-tax-vote2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/as-a-government-shutdown-looms-gop-party-leaders-lose-touch-with-their-base.html", "country": "US", "domain_rank": 767, "title": "As shutdown looms, GOP party leaders lose touch with their base", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T17:15:00.000+02:00", "replies_count": 0, "uuid": "5966041604788483fc3d67e3256a815ed4230b72"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/as-a-government-shutdown-looms-gop-party-leaders-lose-touch-with-their-base.html", "ord_in_thread": 0, "title": "As shutdown looms, GOP party leaders lose touch with their base", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kevin brady", "sentiment": "none"}, {"name": "kevin mccarthy", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "rayburn room", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "house ways and means committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As a government shutdown looms, GOP party leaders lose touch with their base In recent years, the GOP has repeatedly struggled to reach deals that will avoid a government shutdown. There's an increasing mismatch between what GOP party leaders believe and what the rank-and-file \"base\" believes . House Speaker Paul Ryan and other top Republicans aim to convince Trump to break his campaign promises, not keep them. SHARES Getty Images (L-R) House Majority Leader Kevin McCarthy (R-CA), Speaker of the House Paul Ryan (R-WI) and House Ways and Means Committee Chairman Kevin Brady (R-TX) applaud with their fellow House Republicans during a news conference following the passage of the Tax Cuts and Jobs Act in the Rayburn Room at the U.S. Capitol November 16, 2017 in Washington, DC. \nQuestions about Donald Trump 's fitness for the presidency turn next week to a broader question — about his party's fitness to run the government. \nIt arises, once again, as the Republican-controlled Congress faces a January 19 deadline for providing the money necessary to keep federal agencies open for business. In recent years, the GOP has repeatedly struggled to meet this basic responsibility. \nThat difficulty reflects the zeal of a staunchly conservative minority fueled by decades of Republican attacks on government. It has led, in turn, to a debilitating mismatch between what party leaders believe and what the rank-and-file \"base\" believes, with voluble encouragement lately from President Trump. \nThus the president's campaign pledge to build \"The Wall\" along America's Southern border, financed by Mexico, still looms as an obstacle to a spending deal that keeps the government open. show chapters 12:05 PM ET Wed, 10 Jan 2018 | 04:29 \nHouse Speaker Paul Ryan (R-Wis.) openly mocked Trump's pledge before the 2016 election. Senate Republican Whip John Cornyn of Texas says \"it makes no sense.\" White House chief of staff John Kelly has conceded a wall \"from sea to shining sea\" probably will never happen. \nYet Trump told reporters this week that any spending deal \"has got to include The Wall.\" If conservative pressure impels him to insist on a massive concrete barrier — instead of the window-dressing border security measures his aides have suggested — the government will shut down. \nEven if he doesn't, Republicans lack the internal consensus to sustain government funding. They'll need help from Democrats — as they did a few months ago to avert a crisis by raising the federal debt limit. \nThe president's first budget sought $50 billion more for the Pentagon, financed by deep cuts in domestic spending. That approach has surface appeal for the majority of Republican voters who tell pollsters most government spending is wasted on useless projects, undeserving recipients, foreign aid, and the like. show chapters 3 Hours Ago | 04:39 \nSenior congressional Republicans don't believe that, however. \"We don't pay attention\" to Trump's requested cuts, veteran GOP Sen. Lamar Alexander of Tennessee told me recently, and instead have moved to increase spending on key domestic priorities, such as scientific research. \nInstead, Republicans want to curb spending on Social Security, Medicare and Medicaid benefits, which consume half the federal budget. The problem: Those benefits are popular and Trump promised not to touch them. \nSo Speaker Ryan and other top Republicans aim to convince Trump to break his campaign promises, not keep them. They've had some success; Trump's failed attempt to repeal Obamacare would have slashed Medicaid. show chapters 9:02 AM ET Tue, 9 Jan 2018 | 23:00 \nOn taxes, Republican leaders persuaded Trump to abandon his vow that the wealthy would not benefit. In fact, economic forecasters say they'll benefit most, in large part through lower rates on businesses they own. As Tennessee Republican Sen. Bob Corker said before backing the plan, lower corporate tax rates were the point to begin with. \nTreasury Secretary Steven Mnuchin has reverse-engineered the justification that it was designed for middle-class families. Polls show most voters don't buy it. \nThe same gap between GOP leadership and rank-and-file hobbles the party on other economic issues. In 2016, Trump told beleaguered blue-collar whites their problems stemmed from governmental incompetence, lax immigration policies, and bad trade deals such as the North American Free Trade Agreement, or NAFTA — not irreversible economic trends such as technological change and mobility of global capital. \nRepublican leaders, who back continued trade expansion, don't believe that. They want Trump to abandon his threat to leave NAFTA to avoid what Robert Zoellick, President George W. Bush 's former trade representative, warned would be \"economic mayhem.\" \nThese mismatched Republican views reflect how Trump's crude populist messages twisted the 2016 electorate into a historically unprecedented shape. Most of his votes came from Americans without college degrees, the people most vulnerable to economic and cultural changes. Republicans playing key roles in politics and business come from the ranks of college-credentialed winners — just as most of Hillary Clinton 's voters did. \nAs advocates of smaller government, Republican leaders have mostly stood by while Trump erodes the executive branch administratively. The White House has failed to nominate anyone for 40 percent of top posts requiring Senate confirmation. GOP Sen. John McCain of Arizona has expressed alarm over the number of U.S. diplomats who have left under pressure from Secretary of State Rex Tillerson , who himself is repeatedly undercut by the president. \nBeyond his disdain for expertise, Trump has strong personal motivation to hobble the government he heads. He fired FBI Director James Comey over what he calls the Russia \"witch hunt\" probing the president's 2016 campaign. He keeps it up even though special counsel Robert Mueller holds such a sterling reputation that Trump himself considered appointing Mueller to lead the FBI. \nHis party increasingly amplifies those attacks. As much as they disagree with rank-and-file Trump supporters, GOP leaders in government fear them. \nCorrection: This article was updated to reflect Sen. Bob Corker's home state. WATCH: Big money lines up to sell GOP tax plan in hopes it translates into political victory show chapters", "external_links": [], "published": "2018-01-12T17:15:00.000+02:00", "crawled": "2018-01-12T17:26:42.025+02:00", "highlightTitle": ""}