{"organizations": [], "uuid": "9a68944a50fdf1955aeadd74474b667a6beb1737", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/19/104229007-GettyImages-506092136.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/soros-trump-has-us-set-on-a-course-towards-nuclear-war.html", "country": "US", "domain_rank": 767, "title": "Soros: Trump has US 'set on a course towards nuclear war'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T21:47:00.000+02:00", "replies_count": 0, "uuid": "9a68944a50fdf1955aeadd74474b667a6beb1737"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/soros-trump-has-us-set-on-a-course-towards-nuclear-war.html", "ord_in_thread": 0, "title": "Soros: Trump has US 'set on a course towards nuclear war'", "locations": [], "entities": {"persons": [{"name": "soros", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "george soros", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "soros fund management", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump has the U.S. on course for a nuclear war with North Korea, billionaire investor and progressive political activist George Soros said Thursday.\nIn a blistering critique of the country under Trump's leadership, the head of Soros Fund Management and the Open Society Foundations painted a bleak picture.\n\"The fact of nuclear war is so horrendous that we are trying to ignore it, but it is real,\" Soros said during a speech at the World Economic Forum in Davos. \"Indeed, the United States is set on a course towards nuclear war by refusing to accept that [North] Korea has become a nuclear power.\"\n\"This creates a strong incentive for North Korea to develop its nuclear capacity with all possible speed, which in turn may induce the United States to use its nuclear superiority pre-emptively, in effect to start a nuclear war to prevent a nuclear war, obviously a self-contradictory strategy.\"\nshow chapters If President Trump were to order a nuclear strike, here’s what would happen      2 Hours Ago | 01:33 That wasn't the only place Soros attacked Trump.\nHe compared the president to Russian strongman Vladimir Putin, saying Trump also would like to create a \"mafia state\" that suppresses individual rights. He can't \"because the Constitution and the institutions and a vibrant society won't allow it.\"\nSoros said he is using his foundation and the billions at his disposal to \"protect the democratic achievements of the past.\" Soros was an active supporter of Hillary Clinton during her unsuccessful campaign against Trump in 2016. He reportedly had lost about $1 billion when the market surged higher after Trump's victory.\n\"Not only the survival of open society but the survival of our entire civilization is at stake,\" he added. \"The rise of leadership such as Kim Jong Un in North Korea and Donald Trump in the United States have much to do with this.\"\nTo head off a nuclear crisis, Soros recommended a \"carrot and stick\" approach in which North Korea is rewarded for \"suspending further development of nuclear weapons.\"\nAs for the U.S., Soros said he will be mobilizing his own political forces to try to defeat Trump.\n\"Clearly I consider the Trump administration a danger to the world,\" he said. \"But I regard it as a purely temporary phenomenon that will disappear in 2020 or even sooner.\"\nSoros said he sees trouble all over the world and even in cyberspace, where social networks are invading people's lives and in some cases ruining them as well.\n\"The distinguishing feature of internet platforms is that they are networks and they enjoy rising marginal returns,\" he said. \"They deliberately engineer addiction to the services they provide. This can be very harmful, particularly to adolescents.\"\nAnd he expressed worry about the European Union's future, saying that the region is \"in a revolutionary period\" where Russia again has arisen and the EU is in disarrary.\nWATCH: These fallout shelters won't save you if there's a nuclear attack show chapters These fallout shelters won't save you if there's a nuclear attack      2:29 PM ET Fri, 6 Oct 2017 | 02:58", "external_links": [], "published": "2018-01-25T21:47:00.000+02:00", "crawled": "2018-01-25T22:12:35.000+02:00", "highlightTitle": ""}