{"organizations": [], "uuid": "fa2d4fce95a0015372342ef7af4dacb5de1a9406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 165, "shares": 165, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/05/104879933-Unknown-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/02/ant-financial-moneygram-deal-off-mgi-stock-falls.html", "country": "US", "domain_rank": 767, "title": "MoneyGram plunges after US denies a proposed merger with a bank controlled by Alibaba", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-02T23:46:00.000+02:00", "replies_count": 0, "uuid": "fa2d4fce95a0015372342ef7af4dacb5de1a9406"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/ant-financial-moneygram-deal-off-mgi-stock-falls.html", "ord_in_thread": 0, "title": "MoneyGram plunges after US denies a proposed merger with a bank controlled by Alibaba", "locations": [], "entities": {"persons": [{"name": "justin solomon", "sentiment": "neutral"}, {"name": "jack ma", "sentiment": "neutral"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "alibaba group", "sentiment": "neutral"}, {"name": "alibaba", "sentiment": "neutral"}, {"name": "moneygram", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "neutral"}, {"name": "ant financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares of MoneyGram tumbled Tuesday after the U.S. government failed to approve a multimillion-dollar merger with Ant Financial, an affiliate of Alibaba controlled by its founder, Jack Ma.\nAnt Financial will pay a $30 million termination fee for the breakup of the deal, in which Ant Financial agreed to buy MoneyGram for $18 a share. MoneyGram shares were trading at around $12 after hours Tuesday, down nearly 9 percent.\n\"The geopolitical environment has changed considerably since we first announced the proposed transaction with Ant Financial nearly a year ago,\" MoneyGram CEO Alex Holmes said in a statement. \"Despite our best efforts to work cooperatively with the U.S. government, it has now become clear that [the Committee on Foreign Investment in the United States] will not approve this merger.\" \nAlibaba and MoneyGram will instead form a \"new strategic business cooperation\" to expand their remittance and digital payments services internationally.\n\n\"Establishing this new strategic cooperation with MoneyGram will add a partner with global remittance capabilities to our ecosystem,\" Doug Feagin, president of Ant Financial International, said in a statement. \"While Ant Financial won't have a direct ownership relationship with MoneyGram, we look forward to working closely with the MoneyGram team to make our platform even more accessible.\"\nIt's a major blow for the Chinese e-commerce giant, which has global ambitions but faces a U.S. government that has taken a hard line on trade with China. For example, President Donald Trump is expected to release harsher penalties this month on companies that depend on trade with China, according to The Washington Post.\nAnt Financial is best known for Alipay, a dominant online payments service, similar to PayPal, that had been part of Alibaba but separated after when Alibaba went public in 2014. Ant Financial itself is considered a top IPO candidate — thought in October 2017, the company reportedly decided to put its offering on hold as it expanded investments in start-ups.\nMoneyGram, the second-largest money transfer company in the world, has a long history of dealing with multinational money transfers, dating back to the 1940s , and could have helped Ant Financial's prospects. But according to Reuters, the protection of personal data raised concerns for U.S. regulators.", "external_links": [], "published": "2018-01-02T23:46:00.000+02:00", "crawled": "2018-01-03T00:02:29.003+02:00", "highlightTitle": ""}