{"organizations": [], "uuid": "cba2cb3ba81d8cecdf77e447d81febcaf6207eef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/07/104885262-GettyImages-886626124-steve-bannon.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/former-top-trump-advisor-steve-bannon-to-leave-breitbart-news-nyt-reports.html", "country": "US", "domain_rank": 767, "title": "Former top Trump advisor Steve Bannon to leave Breitbart News", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T23:06:00.000+02:00", "replies_count": 0, "uuid": "cba2cb3ba81d8cecdf77e447d81febcaf6207eef"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/former-top-trump-advisor-steve-bannon-to-leave-breitbart-news-nyt-reports.html", "ord_in_thread": 0, "title": "Former top Trump advisor Steve Bannon to leave Breitbart News", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "ivanka trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "breitbart news cnbc.com", "sentiment": "negative"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former top Trump advisor Steve Bannon to leave Breitbart News Steve Bannon is stepping down from Breitbart News, where he was executive chairman. Bannon's comments about the Trump family to author Michael Wolff sparked backlash from both President Donald Trump and his top financial backer, Rebekah Mercer. Bannon was Trump's White House chief strategist and his campaign chief executive. CNBC.com SHARES \nSteve Bannon, the former chief strategist to President Donald Trump , is stepping down from Breitbart News, the news outlet confirmed Tuesday. \nBannon, who was Breitbart's executive chairman, exits after comments he made about the president's family brought a stinging rebuke from the White House and partly led to his top financial backers abandoning him . On Sunday, Bannon said he \"regrets\" the fiery comments about the president's two eldest children , Donald Trump Jr. and Ivanka Trump. He again pledged his support for President Trump's policies. \nBreitbart, a generally pro-Trump site, said it will work with Bannon on a \"smooth and orderly transition.\" \n\"I'm proud of what the Breitbart team has accomplished in so short a period of time in building out a world-class news platform,\" Bannon said in a statement. Getty Images Steve Bannon speaks before introducing Republican Senatorial candidate Roy Moore during a campaign event at Oak Hollow Farm on December 5, 2017 in Fairhope, Alabama. \nThe wealthy GOP donor Rebekah Mercer, who last week said she would no longer fund Bannon's initiatives, forced his exit, according to The New York Times, which first reported on Bannon's departure. She is a member of Breitbart's board and last week pledged support for Trump \"and the platform upon which he was elected.\" \nBannon helped to drive Trump's nationalist messaging in the final months of the 2016 election, contributing to the then-candidate's harsh criticisms of free trade and China. He then was one of Trump's top White House advisors before he left in August. \nWhen he returned to Breitbart from the White House, Bannon pledged to use the outlet as a tool against so-called establishment Republican figures and enemies of Trump's agenda. He planned to champion numerous upstart GOP candidates. He backed Republican ex-Judge Roy Moore in Alabama's Senate special election primary over then-Sen. Luther Strange, only to see Moore lose to Democrat Doug Jones in the general election in December. \nExcerpts of a tell-all book, \"Fire and Fury: Inside the Trump White House,\" were released last week and featured numerous quotes from Bannon. Among other statements, he called a June 2016 meeting at Trump Tower that included Donald Trump Jr., former Trump campaign chairman Paul Manafort and a Russian lawyer \"treasonous\" and said special counsel Robert Mueller's Russia investigation would \"crack Don Junior like an egg.\" He also called Ivanka Trump \"dumb as a brick.\" \nThose statements prompted the president to declare that Bannon had \"lost his mind.\" \nIn apologizing Sunday, Bannon said media reports misinterpreted his comment about the younger Trump. He instead meant it about Manafort, he said.", "external_links": [], "published": "2018-01-09T23:06:00.000+02:00", "crawled": "2018-01-09T23:33:51.033+02:00", "highlightTitle": ""}