{"organizations": [], "uuid": "a8ba819a2d20c9fa98b72b674f00209d7ec2c848", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/03/14/100555127-couch-potato-male-gettyp.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/shoppers-struggle-with-weight-gain-debt-after-the-holidays.html", "country": "US", "domain_rank": 767, "title": "Wallet versus waistline: Here's what consumers packed on this holiday season", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T20:41:00.000+02:00", "replies_count": 0, "uuid": "a8ba819a2d20c9fa98b72b674f00209d7ec2c848"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/shoppers-struggle-with-weight-gain-debt-after-the-holidays.html", "ord_in_thread": 0, "title": "Wallet versus waistline: Here's what consumers packed on this holiday season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "credit karma", "sentiment": "none"}, {"name": "cornell university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the post-holiday haze, most Americans are struggling to shed pounds and/or debt.\nWhich is worse? It depends on who you ask.\nAmericans racked up more than $1,000 of debt over the winter season, estimates one post-holiday spending survey . And they also gained just over a pound , on average, according to research from Cornell University. \nBoth accumulations can dog you. Given a choice, nearly 2 in 5 Americans (38 percent) would rather pack on debt than pounds, according to a report by website Credit Karma. The site polled over 2,100 adults in December.\nAbout half of those surveyed are actively taking steps to eat healthier in the New Year. Somewhat fewer have committed to financial goals, with 44 percent planning to spend less or save more, and 38 percent committed to paying down debt in 2018. \nshow chapters Credit card debt      5:13 PM ET Fri, 5 Jan 2018 | 01:24 Meanwhile, adults are diving deeper and deeper into the red. Consumer credit card balances rose 13 percent in November to a new all-time high of $1.0227 trillion, according to the Federal Reserve's most recent data.\n\"This record should serve as a wake-up call,\" Matt Schulz, the senior industry analyst at CreditCards.com, said in an email.\n\"There's only so much credit card debt Americans can absorb without it causing real problems. Right now, delinquencies are still fairly low, but they're climbing,\" Schulz said. \"That could mean big trouble for many Americans.\"\nIn fact, the delinquency picture is mixed, according to results from the latest American Bankers Association Consumer Credit Delinquency Bulletin. Delinquencies in closed-end loans, like personal, auto or home equity loans, rose while delinquencies in open-end loans, like credit cards, were lower.\nCredit card delinquencies fell to 2.62 percent of all accounts in last year's third quarter, the ABA said, well below the 15-year average of 3.62 percent. The ABA report defines a delinquency as a late payment that is 30 days or more overdue.\nFor those that are committed to reining in their wallet, here's how to make the most out of those 2018 financial resolutions . \nAs for getting physically in shape, check out these workouts burning up the fitness industry . \nMore from Your Money, Your Future:\nHoliday hangover: Shoppers racked up more than $1,000 each in debt \n10 moves to boost your wealth in 2018 \nSingle ladies: Here's how to take charge of your money", "external_links": [], "published": "2018-01-09T20:41:00.000+02:00", "crawled": "2018-01-09T21:17:19.005+02:00", "highlightTitle": ""}