{"organizations": [], "uuid": "017379f5bebead5003c016bd820b97c5f004fde4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/20/104598564-RTX3C7VL-draghi.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/the-ecb-is-edging-toward-taper-talk-as-europes-economy-sees-its-best-growth-in-a-decade.html", "country": "US", "domain_rank": 767, "title": "Europe’s in its best shape for a decade — and its huge stimulus program is looking a little dated", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T07:40:00.000+02:00", "replies_count": 0, "uuid": "017379f5bebead5003c016bd820b97c5f004fde4"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/the-ecb-is-edging-toward-taper-talk-as-europes-economy-sees-its-best-growth-in-a-decade.html", "ord_in_thread": 0, "title": "Europe’s in its best shape for a decade — and its huge stimulus program is looking a little dated", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "ralph orlowski", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "reuters european central bank", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "governing council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GDP outlook The ECB is edging toward 'taper' talk as Europe's economy sees its best growth in a decade The ECB is unlikely to announce a clear timeline for its exit strategy in January, but many now expect it to come in the first six months of the year. The latest accounts from December's meeting of the ECB's Governing Council, released January 11, took investors by surprise as there was a clear hint that the central bank could recalibrate its message to markets in \"early 2018\". SHARES Ralph Orlowski | Reuters European Central Bank (ECB) President Mario Draghi addresses a news conference at the ECB headquarters in Frankfurt, Germany July 20, 2017. \nThe European Central Bank (ECB) is slowly moving toward an exit to its massive bond-buying program as the economy is doing far better than expected, and more and more members of its Governing Council seem convinced that extra stimulus should be withdrawn sooner rather than later. \nThe ECB is unlikely to announce a clear timeline for its exit strategy in January, but many now expect it to come in the first six months of the year. \n\"The key thing to watch: Whether Draghi confirms the October statement that there will be no sudden end to QE (quantitative easing),\" Carsten Brzeski, the chief economist of Germany and Austria at ING Diba, said in a research note. \"We expect him to do so as this would be the only way – at least temporarily – to get the genie back in the bottle.\" The latest accounts from December's meeting of the ECB's Governing Council, released January 11, took investors by surprise as there was a clear hint that the central bank could recalibrate its message to markets in \"early 2018\" – nothing Mario Draghi had mentioned in the December press conference. The understanding now is that the ECB should gradually shift its stance to avoid a more disruptive move later and should look at a broader revision of its policy guidance to reduce the focus on bond purchases and raise the emphasis on interest rates. \"While many observers have taken the latest account as proof that the more hawkish views are now dominating, also coming against the backdrop of more hawkish comments, it remains unclear whether this would also imply a more aggressive view on policy normalization,\" said Anatoli Annenkov, an ECB watcher at Societe Generale. \"We expect the redrafting of APP (the asset purchase program) forward guidance, softening the link between developments in inflation and asset purchases, to take place at the March meeting.\" show chapters 2:25 AM ET Fri, 19 Jan 2018 | 01:46 Inflation is still stubbornly low \nThat's also the meeting when the ECB will present new staff projections on economic growth and inflation which might add more meat to the argument to end QE by September. The euro zone economy is now in its best shape for a decade. It is expected to grow on average 2.2 percent this year, according to a Reuters poll. While the economy is doing great, inflation is still stubbornly low with only small signs of a pickup. That's the main reason why the ECB is insisting that its ultra-loose monetary policy stance is appropriate and why a majority of the Governing Council is concerned about an unwanted tightening of financial conditions. \n\"We see two possibilities: The first one is to make the QE easing bias more symmetric, by saying that the ECB stands ready to increase the horizon of the asset purchases if needed, but dropping any reference to a potential increase of their monthly size once again,\" said Daniele Antonucci, senior European economist at Morgan Stanley, in a note. \"A second way, perhaps after this step, is to make the program closed-ended, by no longer saying that it could buy beyond September.\" Who replaces Draghi? \nWhile the messaging is in flux, 2019 will also be a year of major personal changes at the ECB. The terms of Draghi, Chief Economist Peter Praet and Executive Board Member Benoit Coeure are all coming to an end and the debate on who will succeed Draghi at the helm of the institution has started. \"I think the question as to who will succeed (Vice President) Vitor Constancio, who retires in June this year, is most important, because usually the pick of the deputy has an implication for the president's seat as well,\" Martin Lueck, chief investment strategist for Germany, Austria and Eastern Europe, said in an email to CNBC. \"If the Spanish government manages to push through Luis de Guindos for the vice president's job, it could mean that Draghi's post goes to a northern European.\" \nThe decision will be taken by European national leaders. Analysts expect a \"political horse trading\" process that will influence Draghi's succession. This could lead to Germany supporting the Spanish candidate for the deputy position with the understanding that Spain would later support Bundesbank President Jens Weidmann for the top ECB job.", "external_links": [], "published": "2018-01-24T07:40:00.000+02:00", "crawled": "2018-01-24T07:51:53.028+02:00", "highlightTitle": ""}