{"organizations": [], "uuid": "b82b789b4dc51c3fd021fc27390312360b7aea54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/28/104617474-GettyImages-813883120-bezos.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/amazon-insists-on-new-factor-for-cities-still-in-hq2-race-secrecy.html", "country": "US", "domain_rank": 767, "title": "Amazon insists on a new factor for cities still in HQ2 headquarters race: Secrecy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T23:55:00.000+02:00", "replies_count": 0, "uuid": "b82b789b4dc51c3fd021fc27390312360b7aea54"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/amazon-insists-on-new-factor-for-cities-still-in-hq2-race-secrecy.html", "ord_in_thread": 0, "title": "Amazon insists on a new factor for cities still in HQ2 headquarters race: Secrecy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "18 Hours Ago › \nThe already heated battle for the coveted Amazon HQ2 project has been a public relations win for the tech giant. But now Amazon is asking the North American cities among the finalists to use a tactic more often associated with Amazon founder and CEO Jeff Bezos: Secrecy. CNBC's Scott Cohn confirmed on Thursday that Amazon has insisted cities shift to a confidential pitch mode as the second round progresses. \nAt stake: a $5 billion facility that will employ 50,000 and boost state coffers by adding billions of dollars in additional investment in the surrounding community over the next 10 to 15 years. \nMayors across North America are choosing their words carefully. \n\"It's like a poker game,\" Dallas Mayor Mike Rawlings told CNBC at the United States Conference of Mayors on Thursday, explaining that it's time for cities to play their cards close to the vest. \"Bring the bidding war on,\" he said. \nJust not in public. \nThe full list of 20 finalists includes some of the most competitive cities in the world and data compiled by CNBC bears that out. \n\"We aren't gonna really talk about what's on the table,\" said Washington D.C. Mayor Muriel Browser. \n\"It's a very secretive process. We're obviously bound by confidentiality,\" said Miami Mayor Francis Suarez. \n\"If I were to lay out out now what we'll offer it would be criticized and looked at, and determined whether it's good or bad,\" said Philadelphia Mayor Jim Kenney. But Philly's mayor did provide a little color. \"We have people saying we don't want Amazon because housing prices will go up or it will be too crowded. These are problems we'd love to manage.\" Getty Images Jeff Bezos \nThe trash talking may be over, but some of the incentives already offered are eye-opening: $7 billion from New Jersey (where Newark is a finalist), and potentially $5 billion from Maryland. \nBoston Mayor Marty Walsh said it was too early to discuss incentives because Amazon has not yet made clear its expectations. \nSome mayors were more willing than others to give limited pitches in response to CNBC questions at the annual mayors conference. \nDallas Mayor Rawlings was one. Among his points: \nDallas has been growing faster than any city in the country and fast growth is a factor that both it and Amazon share. \"Nobody has grown faster or created more jobs than us,\" he said. \nRawlings also attempted to dispel a few myths. While Austin gets all the tech credit, Dallas has more tech employees — almost as many as in Seattle. And while Rawlings acknowledged the broader Texas \"red state\" reputation is an issue, especially given the tech industry's focus on social tolerance, he stressed that Dallas is \"a blue city in a red state,\" which has scored 100 on the LGBT Index for the past three years. \"There are concerns at the state level, but we are working through that,\" he said. \nDallas seems to think a factor that has often helped its state in CNBC's Annual Top States for Business ranking will help here too: it will be less expensive for Amazon on multiple fronts. Cheaper to build, lower cost of business, and lower cost of living, Rawlings said. And he made that pitch to Amazon shareholders. \n\"Shareholders will win,\" Rawlings said. \nHe also highlighted Dallas central placement in the country allowing roundtrip flights to both coasts. And the real winner is ... \nSome outside observers insist that whether shouting from the hills or keeping as quiet as possible, cities aren't going to end up as the real winner. \n\"Amazon has algorithms and crawlers that go out and find the lowest prices and create this giant sucking sound, and they've taken it offline and effectively created a transfer in value from taxpayers to Amazon,\" said Scott Galloway, professor of marketing at New York University's Stern School of Business told CNBC on Thursday. \"It's a 'Hunger Games' environment to mature the best term sheet possible and ask a mayor to match, which will be irresistible,\" Galloway said. He added, \"Amazon is genius in occupying the front page, but this is, simply put, an incredibly deft calculation to extract several pounds of flesh.\" \nMany of the finalists were thought to be contenders from the start. They include cities CNBC has already visited as we evaluate the bids: Chicago, Columbus, Ohio; Raleigh, North Carolina; and Denver. But three dark horse candidates joined the list: Los Angeles, Indianapolis, and Toronto. The list includes three locations in and around the nation's capital: Washington, D.C.; the Northern Virginia suburbs, and Montgomery County, Maryland. The area was already receiving buzz based on Amazon CEO Jeff Bezos' ownership of the Washington Post. \nOne important aspect of the secretive process that not even any of the mayors seem to understand: How long the decision will take for Amazon to make, and whether there will be another round of cuts before the winner is named. Mayors told CNBC's Scott Cohn at the conference that the decision could come by spring or not before next year. And while there are some expectations the list will get whittled down further, mayors don't know if that will be another round in the public process, or if the next words from Amazon will be, \"And the winner is ...\" CNBC ratings on the cities City, State ", "external_links": [], "published": "2018-01-25T23:55:00.000+02:00", "crawled": "2018-01-26T00:23:47.026+02:00", "highlightTitle": ""}