{"organizations": [], "uuid": "db582dfb451dca1ea1f8daff2cf9170850957e64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/27/104431981-GettyImages-672980840.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/trump-administrations-infrastructure-plan-takes-shape-focusing-on-state-local-and-private-financing.html", "country": "US", "domain_rank": 767, "title": "Trump administration's infrastructure plan takes shape, focusing on state, local, and private financing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:03:00.000+02:00", "replies_count": 0, "uuid": "db582dfb451dca1ea1f8daff2cf9170850957e64"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/trump-administrations-infrastructure-plan-takes-shape-focusing-on-state-local-and-private-financing.html", "ord_in_thread": 0, "title": "Trump administration's infrastructure plan takes shape, focusing on state, local, and private financing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "broadway street", "sentiment": "none"}], "organizations": [{"name": "mins ago getty images construction", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration is finalizing its long-awaited infrastructure plan, which would push most of the financing of projects to private investment and state and local taxpayers, according to sources familiar with the proposal taking shape.\nPresident Donald Trump, who spoke frequently of improving U.S. infrastructure during his 2016 campaign, may preview the plan in his Jan. 30 State of the Union address, but details are not expected until afterward, the sources said.\nTwo people briefed on it said it would likely recommend dividing $200 billion in federal funding over 10 years into four pools of funds. The administration is structuring the plan in hopes of encouraging more than $1 trillion in state, local and private financing to build and repair the nation's bridges, highways, waterworks and other infrastructure.\nThe total investment that could be generated could reach as much as $1.85 trillion, a White House official said, depending on how much private investment is leveraged.\nThe U.S. Chamber of Commerce, the largest business lobbying group in Washington, is even backing a 25 cent increase in the federal gasoline tax to make that happen.\nIt is unusual for a business group to call for a tax increase, but the Chamber argues that it is necessary to fund critical infrastructure projects.\n\"Its time to invest in a 21st century infrastructure, a system of infrastructures to support and grow a 21st century economy,\" said Tom Donohue, the Chamber's president, in a speech on Thursday as part of the organizations renewed public push for action.\n\"Its time to make up for decades of underinvestment that today is evident in everything from bone-rattling potholes and endless traffic gridlock, to deadly train derailments and destructive water main breaks,\" he said.\nThe numbers in the Trump plan are still in flux and could change before he unveils it. The prospects of winning approval in Congress are uncertain given that Republicans have only a 51-49 majority in the Senate.\nMany Republicans want to use private-sector investment to finance infrastructure projects to avoid increasing the national debt. Democrats believe that government money is necessary to produce such a large package.\nCost-sharing Under the Trump plan being shaped, the largest share of the federal money — $100 billion — is expected to go toward cost-sharing projects with local governments, similar to grants, a senior administration official said.\nThe goal would be to reduce the ratio of federal funding, which often now is 80 percent, by awarding funds only to projects that are able to provide more local funding or leverage private investment, said a business lobbyist familiar with the discussion.\nSome $50 billion would be earmarked for rural projects, the lobbyist and an administration official said. Those funds would help governors on projects like roads, broadband access and replacing aging lead pipes. Including a pool for rural infrastructure could also reduce concerns among some Republican senators who fear rural areas may be unable to attract private investments.\nTwenty-five billion dollars would go toward existing federal infrastructure loan programs that seek to spur private investment, the lobbyist said.\nThe final $25 billion would be designated for so-called transformative projects — an effort being dubbed \"American Spirit\" projects. They could include high-speed trains or the Gateway Tunnel, the stalled proposal to build a new rail connection between New York City and New Jersey. The smallest two funding levels could shift slightly in the final proposal, the administration official said.\nThe plan may not deliver any additional federal money than in years past. The proposal could take $200 billion from existing spending plans although the administration has not yet committed to whether it would come from existing programs or whether the money would be found elsewhere. The White House is expected to unveil its budget proposal next month.\nThe administration is unlikely to rule out any forms of funding — including increasing the federal gas tax or creating a vehicle mileage tax, which would put battery electric and plug-in hybrid electric cars that now use the roads but do not consume much gasoline on the same footing as cars with internal combustion engines, sources said.\nDonohue made four recommendations for the infrastructure package including raising the gas tax and also recommended expanding the ability of states to access private investment funds to complete projects, reducing the federal permitting process and addressing state and local permitting rules.\nHe also called for more federally backed workforce training — including more apprenticeship programs. As part of that, Donohue reiterated the Chamber's call for passing comprehensive immigration reform, a proposal where business has been at odds with the Trump administration.", "external_links": [], "published": "2018-01-18T15:03:00.000+02:00", "crawled": "2018-01-18T15:12:47.004+02:00", "highlightTitle": ""}