{"organizations": [], "uuid": "f162cdfb5a6f1ab22d22e64cf22152ff20f15808", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/02/09/102409627-88659243.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/cramer-gets-bullish-on-casino-stocks-as-macau-prospects-improve.html", "country": "US", "domain_rank": 767, "title": "Cramer gets bullish on casino stocks like Wynn Resorts as Macau prospects improve", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-13T01:32:00.000+02:00", "replies_count": 0, "uuid": "f162cdfb5a6f1ab22d22e64cf22152ff20f15808"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/cramer-gets-bullish-on-casino-stocks-as-macau-prospects-improve.html", "ord_in_thread": 0, "title": "Cramer gets bullish on casino stocks like Wynn Resorts as Macau prospects improve", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "wynn resor", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "wynn", "sentiment": "none"}, {"name": "mac", "sentiment": "none"}], "locations": [{"name": "macau", "sentiment": "none"}, {"name": "las vegas sands", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "wynn resorts", "sentiment": "negative"}, {"name": "s&p 500", "sentiment": "none"}, {"name": "lvs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In February of 2016, CNBC's Jim Cramer started recommending the stock of Wynn Resorts , which was then trading at about $79 a share.\nSince then, Wynn's share price has nearly doubled — making it one of S&P 500's best-performing stocks for 2017 — so Cramer thought it was worth revisiting some of the casino names.\n\"Remember, the two big worldwide casino stocks, Wynn and Las Vegas Sands , LVS, are very much plays not on the Nevada casinos, not on Vegas, but on Macau, the Chinese gambling haven,\" the \" Mad Money \" host said.\nDoing business in Macau has been a rocky road for the casino operators. The Chinese government's 2015 crackdowns on corruption sent the territory's revenues into tailspin, and its 2016 ruling to place limits on ATM withdrawals in Macau weighed heavily on the casino stocks.\nBut after two years of double-digit declines, Macau's gambling numbers have finally started to improve, Cramer said.\nTotal gaming revenues in Macau were only down by 3.3 percent for 2016, a strong outcome after double-digit declines in the first half of the year.\nAlthough Macau's total casino revenues for 2017 haven't been released, Cramer found that after adding them up month by month, the results were up 19 percent versus 2016 in Macanese pataca, the local currency.\n\"More importantly, the cadence of these numbers ... was exactly what you want to see,\" Cramer said. \"Last January they were up 3 percent . [In] April and May they were up 18 percent. [From] May through November they were up more than 20 percent nearly every month, a very nice acceleration.\"\nBetter yet, Wynn and Las Vegas Sands both just opened new casinos in Macau. Wynn's Macau revenue grew by over 70 percent in the first nine months of 2017; Las Vegas Sands' grew by 16 percent.\nCramer argued that the growth won't cease even in the face of new overseas ATM withdrawal limits by the Chinese government.\n\"While we need to keep an eye on Macau to make sure last month's deceleration was only a one-time blip, Wynn simply is just not that expensive, even after its monster run,\" he said. \"For those of you who already listened to me on Wynn and bought a position in this one, let it ride. If you own Las Vegas Sands, sell. Swap into Wynn.\"\nFor investors who want less international exposure, Cramer recommended domestic play MGM Resorts , which has exposure to Las Vegas, Washington, D.C. and Atlantic City.\nShares of MGM have gained 37 percent since Cramer recommended it in September of 2016, and its domestic businesses was up 23 percent in the first nine months of 2017.\nThe \"Mad Money\" host added that MGM's stock could get a major lift if the Supreme Court decides to legalize sports gambling outside of Las Vegas.\n\"Here's the bottom line: I believe that Macau can keep rebounding courtesy of this phenomenal global economic expansion, which means that Wynn Resorts might have room to run — and I'd always pick Wynn over Las Vegas Sands,\" Cramer concluded. \"But if you want a domestic casino play with some overseas exposure, MGM has a lot going for it. You know what, though? I'm hard-pressed to pick between MGM and Wynn. They're both that good.\"\nWATCH: Cramer revisits the casino comeback show chapters Cramer gets bullish on casino stocks like Wynn Resorts as Macau prospects improve 20 Hours Ago | 09:40 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-13T01:32:00.000+02:00", "crawled": "2018-01-13T01:50:30.000+02:00", "highlightTitle": ""}