{"organizations": [], "uuid": "d28bc0847401b47455101f5d6afceebb6e8e7e91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936303-GettyImages-891810938.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/bernie-sanders-is-still-all-talk-commentary.html", "country": "US", "domain_rank": 767, "title": "How Bernie Sanders is wasting his political capital", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T22:10:00.000+02:00", "replies_count": 0, "uuid": "d28bc0847401b47455101f5d6afceebb6e8e7e91"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/bernie-sanders-is-still-all-talk-commentary.html", "ord_in_thread": 0, "title": "How Bernie Sanders is wasting his political capital", "locations": [], "entities": {"persons": [{"name": "bernie sanders", "sentiment": "negative"}, {"name": "aaron p. bernstein", "sentiment": "negative"}, {"name": "sanders", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senator Bernie Sanders has never been the silent type.\nHe's making noise again with a series of TV appearances and an Op/Ed this week preemptively blaming the Republicans for a potential government shutdown.\nMore than a year after his stunningly impressive Democratic presidential primary run, this is just the latest example of Sanders engaging in fiery rhetoric.\nBut that's the problem. Democrats need Sanders to do more than rant. And he needs to more than that as well, if he wants a legitimate political future.\nWith passage of the tax reform bill, Republicans have proved they are a real threat, and Democrats can see verbal attacks alone aren't going to stop the Trump/GOP legislative agenda. But unlike the tax bill, the current budget and immigration issues will require at least some Democratic votes to resolve, handing them a golden opportunity.\nIf there ever was time for Bernie to get involved and push for some real compromise, this is it.\nBut so far, he's still all talk. Sanders was a no-show at that big publicly televised meeting at the White House Tuesday on the budget and immigration issues.\n\"The Democrat establishment may still be angry with Sanders for whatever real or imagined damage he may have done to Hillary Clinton's campaign. But it's past time for Sanders to push his way into the center of the game.\" It must be disappointing for all those \"Berniac\" fans who supported him for president against all odds in 2016. More than a year later he's still polling as America's most popular politician.\nBut Sanders doesn't seem the least bit interested in getting into actual governing. In fact, he still isn't even officially a member of the Democratic Party.\nJust take a minute to consider that for a second. The man who earned the fifth most total presidential primary votes in U.S. history isn't even a member of the party whose nomination he was seeking in 2016.\nThat doesn't mean Sanders isn't a frequent critic of President Donald Trump when he appears on TV. And his Twitter feed and official Senate website are chock full of positions and biting comments.\nBut America is filled with people verbally attacking President Trump and making political statements. It's become a national cottage industry. There are only a few people who actually have the power to make policy or at least forge political compromises in Washington.\nThere are even fewer people who have shown an ability to attract previously apathetic or disillusioned Americans and encourage them to vote and even work for a campaign.\nSanders is one of those people. Yet he's been sitting on the sidelines since the 2016 election ended. The one official job the Democrats have given him is \"chairman of outreach,\" a newly created post designed to engage working class and young voters. Sanders hasn't publicly asked for anything more.\nSanders did craft a bill calling for the federal government to negotiate prescription drug prices for the entire country like it currently does for Medicare. But the bill went nowhere and there's no evidence that Sanders made any effort to negotiate the plan with the White House.\nHe has another bill to provide single-payer style health coverage for all Americans that has more than a dozen Democrat co-signers, but that bill isn't going anywhere.\nProposing bills that have no chance of passing in a majority Republican Congress isn't the best way Bernie can use whatever political capital he earned from the election.\nPerhaps we shouldn't be surprised. Sanders has been in Congress since 1991, but has barely had a legislative impact in Washington during that 27 year period. Other than going through the grueling effort of running for president, it's a fair argument to say that Bernie remains a lot more bark than bite.\nMaybe he has renewed reasons not to get more involved like his advancing age; he is 76 after all. There's also a potential headache brewing at home, as wife Jane Sanders may be the focus of a federal probe into her role in Burlington College's financial collapse and closure.\nMrs. Sanders was president of the school when it took out major loans to fund an expansion and could not pay off those loans. Investigators are looking into if the college deliberately gave the bank false financial data in the loan application process.\nBut whatever his reasons, the Democrats need him to change his mind and get more involved. That's because the party and the left in general don't have any other clear leaders at the moment.\nHouse Minority Leader Nancy Pelosi's unfavorable ratings are very high . Senate Minority Leader Chuck Schumer's \"unfavorables\" outweigh his approval numbers by almost 12 percentage points . Supposed up-and-comer Democrats like Senators Kamala Harris, Kirsten Gillibrand, and Corey Booker are still relative unknowns.\nThe Democrat establishment may still be angry with Sanders for whatever real or imagined damage he may have done to Hillary Clinton's campaign. But it's past time for Sanders to push his way into the center of the game.\nIt's not about introducing bills, but taking a lead negotiating role on these budget and immigration issues. In his latest op-ed he's demanding no increased military spending, no end to DACA protections for \"Dreamers,\" no new tax breaks for billionaires, and better protections for Social Security and Medicare.\nThose are more like demands than opening offers, but perhaps Sanders is willing to trade one of those goals for concessions elsewhere. That's where years of just shouting and insulting the opposition have to end and leadership begins.\nReal political leaders have to make compromises. That stinks sometimes, but otherwise nothing gets done. What will Bernie choose?\nWith the 2016 election now 14 months in the past, it sure looks like Sanders is choosing to just keep talking. At some point, he may realize that making deals is the better choice if he wants to carve out a real legacy for himself.\nOtherwise, Bernie Sanders will more likely be remembered for being the guy with the Brooklyn accent and messy hair who almost beat Hillary Clinton, but otherwise made no lasting impact.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-10T22:10:00.000+02:00", "crawled": "2018-01-10T22:19:39.014+02:00", "highlightTitle": ""}