{"organizations": [], "uuid": "b6eeca10f86e4494820da9b62ad279882a542763", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-media-highsnobiety/sneakerhead-blog-turned-streetwear-site-gets-first-backing-idUSKBN1F81M4", "country": "US", "domain_rank": 408, "title": "'Sneakerhead' blog-turned-streetwear site gets first backing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "b6eeca10f86e4494820da9b62ad279882a542763"}, "author": "", "url": "https://www.reuters.com/article/us-media-highsnobiety/sneakerhead-blog-turned-streetwear-site-gets-first-backing-idUSKBN1F81M4", "ord_in_thread": 0, "title": "'Sneakerhead' blog-turned-streetwear site gets first backing", "locations": [], "entities": {"persons": [{"name": "douglas", "sentiment": "negative"}, {"name": "fischer", "sentiment": "none"}, {"name": "david fischer", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "busvine", "sentiment": "none"}, {"name": "felix capital", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "frederic court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - It started 12 years ago as a one-man blog written by a self-confessed “sneakerhead.” Fashion website Highsnobiety went on to become a top destination for young men buying the latest streetwear - and has now attracted its first outside investment.\nHighsnobiety, founded in Berlin by David Fischer, said on Friday it had secured $8.5 million in funding, becoming the latest lifestyle startup to win backing from investors led by Frederic Court’s Felix Capital.\nIts main site attracts 9 million unique monthly visitors, while online audience management website SimilarWeb ranks Highsnobiety among the top four fashion sites in most major European countries, the United States and Brazil.\n“The topics that we covered - menswear, streetwear and sneakers - have just exploded over the last decade,” Fischer told Reuters in an interview.\nWith the investment, Court is again tapping into a digital marketing revolution that is disrupting traditional retailers and fashion publishing by getting ahead of trends and attracting aspirational online readers with music and celebrity news.\nWhereas a generation ago youth culture was driven by music, today’s young millennials and high-spending “Generation Z” consumers identify more strongly with designer labels. “Brands are the new bands,” said Fischer.\nThe 35-year-old German has built up a team of 100 people at offices in New York, Berlin and London that runs Highsnobiety’s main site, produces a twice-yearly print magazine, and runs a content production arm geared towards brand marketers.\nFischer, who retains control of the business, said he plans to use the proceeds to explore new retail formats, develop technology for affiliate marketing, and expand video production after airing a first short documentary on YouTube last year.\nThe backing for Highsnobiety follows digital lifestyle bets by Felix Capital including Farfetch, an online marketplace; blog-turned-industry insider news site The Business of Fashion; and Goop, actress Gwyneth Paltrow’s lifestyle marketing brand.\nFelix, set up in 2015 by London-based French native Court, has raised around $300 million for its funds. [nL8N1JX2DE]\n“Their platform has become a critical hub for emerging trends in art, fashion and culture, and through their content production arm, they’re helping brands connect with today’s youth in ways that drive culture forward,” Court said.\nReporting by Douglas Busvine; Editing by Mark Potter\n ", "external_links": [], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T16:31:55.004+02:00", "highlightTitle": ""}