{"organizations": [], "uuid": "10c39b5654ff97ce4f1c631cf46be38f494ab0ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cigarbox.net/feed", "section_title": "The Cigarbox", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-1-retail-gloom-helps-to-end-six-weeks-of-ftse-gains.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Retail gloom helps to end six weeks of FTSE gains", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T18:57:00.000+02:00", "replies_count": 0, "uuid": "10c39b5654ff97ce4f1c631cf46be38f494ab0ad"}, "author": "Google", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-1-retail-gloom-helps-to-end-six-weeks-of-ftse-gains.html", "ord_in_thread": 0, "title": "UPDATE 1-Retail gloom helps to end six weeks of FTSE gains", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "unilever", "sentiment": "none"}, {"name": "carpetright", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UPDATE 1-Retail gloom helps to end six weeks of FTSE gains Helen Reid \n* FTSE 100 up 0.4 pct \n* Carpetright collapses after profit warning \n* Dignity drops 50 pct (Recasts after afternoon rally) \nLONDON, Jan 19 (Reuters) - Britain's major share index rallied to a higher close on Friday as strong metals prices boosted miners and investors sought out makers of consumer staples following fresh evidence of a slowdown in consumer spending. \nProfit warnings in the morning from retailer Carpetright and funeral services provider Dignity reverberated across the retail sector and underscored the challenges facing British companies that suffer most when household finances are tight. \nThe FTSE 100 rose 0.4 percent. It was down 0.8 percent on the week, its first week of losses in seven, after a stellar start to the year riding the wave of rising global equities. \nConsumer staples companies whose profits are seen as less volatile to swings in consumer demand such as Unilever and cigarette maker BAT helped pull the index to a higher close. \nA report showed British shop sales slid by much more than expected in December. That capped the weakest year for retail since 2013 as consumers squeezed by high inflation continued to keep a tight grip on spending. \n\"This certainly ties in to much of what we have seen this year,\" said Colin McLean, managing director at SVM Asset Management. \"In the past, demand has been quite stable and now it's just a bit more fluid.\" \nConsumers' changing tastes and disruption by online businesses were putting pressure on the high street retailers, McLean said. \nBritain's biggest flooring retailer, Carpetright sank to a record low, slumping 39 percent after warning that profits would miss expectations. Sales in the core flooring category fell 7.1 percent in the post-Christmas period . \nCrematorium operator Dignity sank 50 percent after warning on 2018 profit. A price battle forced it to cut funeral prices by about a quarter to preserve market share. \nHome improvement retailer Kingfisher fell 2.3 as traders read across to other retail names. Dixons Carphone fell 3.6 percent and small-cap DFS Furniture fell 4 percent. \nThe UK's general retail index fell 2 percent. \n\"Lots of the retailers are quite high risk -- businesses which used to be quite solid are finding customer activity going down,\" said SVM's McLean. \n\"Quite a few, even if they are not showing high debt, have lots of leases and other rigidities in their balance sheet that make it difficult to unscramble,\" he added. \nAmong other notable movers, EasyJet rose to the top of the blue-chip index, up 4.7 percent, after an upgrade from Morgan Stanley analysts, citing consolidation in the short-haul airline industry and a strong euro-sterling exchange rate as supportive factors. \n(Reporting by Helen Reid; editing by Tom Pfeiffer)", "external_links": [], "published": "2018-01-19T18:57:00.000+02:00", "crawled": "2018-01-20T03:51:24.002+02:00", "highlightTitle": ""}