{"organizations": [], "uuid": "9beddc6f604bad479724a7fd3fd9abd1ea5f13a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936784-GettyImages-903030208.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/trump-wont-bend-on-daca-because-of-latest-racist-charges-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump can't be shamed into a DACA deal, even with a government shutdown looming", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T20:03:00.000+02:00", "replies_count": 0, "uuid": "9beddc6f604bad479724a7fd3fd9abd1ea5f13a5"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/trump-wont-bend-on-daca-because-of-latest-racist-charges-commentary.html", "ord_in_thread": 0, "title": "Trump can't be shamed into a DACA deal, even with a government shutdown looming", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "durbin", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Once again, President Donald Trump 's opponents and his constant critics in the news media are calling him a racist. It's been the go-to response to him from Democrats and even several Republicans who have thought this is a foolproof weapon against him since he first announced his candidacy for president in 2015.\nHow's that working out for them?\nThe fact is the charge of racism doesn't work very well on Trump. But folks keep trying it anyway.\nIt still seems to be the strategy right now in the battle over the budget and the special DACA protections for the children of illegal immigrants. That's how it's playing out after Illinois Democrat Sen. Dick Durbin accused Trump of making the now-infamous \"s---hole\" comment about Haiti and African countries last week. Frantic depictions of those comments as definitive proof of Trump's racism have dominated the news cycle ever since.\nThe goal now seems to be to use this racism-branding tactic in order to shame Trump into bending to the Democrats' will. On Monday, Durbin revealed he's pursuing that shaming strategy, telling the Chicago Sun-Times that, \"if President Trump is not a racist, he can prove it\" by making a deal on the DACA legislation.\nGood luck with that.\nThe reason the shaming strategy is a long shot this time and has failed in the past is because it's nearly impossible to shame or even scare Trump at all. It's even harder to shame him into doing anything.\nLook at the president's tweets and public statements every time he is criticized. Does he ever sound or act like a guy who even considers contrition? Donald Trump is a man who almost never chooses to stay above the fray no matter who is attacking him and how they do it. This was his well-documented behavior before he was a candidate, when he was a candidate, and even as president.\nThe shaming game has its own special hall of shame when it comes to its ineffectiveness. The highlights are:\nIt not only failed to get then-candidate Trump to stop talking about Mexican illegal immigration after his first speech as a candidate, the issue became the hallmark of his campaign. Calling Trump anti-Muslim because of his immigration ban on several predominantly Muslim countries produced only the slightest tweaks to the policy and no real backing down. Legal challenges to the ban have only enraged and hardened Trump's resolve even more as they continue to be upheld by the Supreme Court. Even when racism isn't a factor, shaming Trump doesn't work. The many critics of the GOP tax reform bill found that out the hard way when he continued to push for the bill and eventually got it across the finish line. That was despite the constant depiction of the bill by its opponents as a shameful boon to the rich. Former Treasury Secretary Larry Summers even said 10,000 people will die per year in America because of the tax bill. That didn't deter the president at all. So, predictably, Trump is responding the opposite way to this latest shaming attempt. He's now toggling back and forth between taking a harder line on immigration policy and insisting he's no racist in his public comments and tweets.\nTrump tweet\nTrump tweet 2\nThat's a far cry from Trump's statement before the \"s---hole\" controversy when he said he'd sign any DACA compromise bipartisan congressional leaders came up with.\nIf the Democrats really are concerned about protecting the so-called \"Dreamer\" immigrants, there's really no excuse for them to be surprised by what's occurred over the last few days. Now, the chances are much greater that the Democrats will have to move to shut down the government when the budget deadline passes on Friday. Worse for them, their bargaining position on behalf of the DACA recipients is weakened now that the focus on the vulgar comments in a closed door meeting has flipped the president from compliant to defiant.\nGovernment shutdowns are a tricky matter. Politicians usually run for the hills at the mere chance that they may be blamed for a shutdown. That's a good thing for people who like government compromise because shutdowns are always the result of a failed budget vote and it takes a 60 votes in the Senate to pass a budget.\nWith that in mind, congressional Republicans began placing a bet that the Democrats wouldn't want to be seen as causing a shutdown over the DACA issue last year. They were right to the point that the Democrats did agree to push off the matter for a month with a temporary spending bill.\nBut now, the Democrats are close to proudly promising to shut the government down over this issue. Yes, polls frequently show clear majorities of Americans support allowing \"Dreamers\" to stay in the U.S. provided they meet certain requirements. But there are also polls that show just as many voters support tougher immigration laws. And most damning of all for Democrats, the overall immigration issue actually remains a relatively low priority for most voters. A Morning Consult/Politico poll released just two months ago showed that only 29 percent of respondents thought extending the DACA protections should be a priority for Congress.\nBut based on the uproar over Trump's comments alone, the Democrats are willing to play with government shutdown fire.\nSo America's political scene is dominated by two enduring spectacles at the moment. First, we have a president who says politically incorrect and vulgar things with regularity and has no shame or remorse about it. Second, we have the Democratic Party and most of Trump's opponents clinging to and doubling down on a demonstrably failed strategy.\nIt's not clear who \"wins\" in this remarkable exchange. But we do know that the losers are millions of Americans who rely on a functioning government, clear immigration status, and politicians with some grip on reality.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-16T20:03:00.000+02:00", "crawled": "2018-01-16T20:17:30.036+02:00", "highlightTitle": ""}