{"organizations": [], "uuid": "c456345bfd7d226b487033831cffa30cb6332254", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953829-Buffett_lions.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/warren-buffett-could-buy-every-team-in-the-nfl.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett's $92.1 billion fortune could buy him every team in the NFL", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T18:00:00.000+02:00", "replies_count": 0, "uuid": "c456345bfd7d226b487033831cffa30cb6332254"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/warren-buffett-could-buy-every-team-in-the-nfl.html", "ord_in_thread": 0, "title": "Warren Buffett's $92.1 billion fortune could buy him every team in the NFL", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "ndamukong suh", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "stanley kroenke", "sentiment": "none"}, {"name": "david liam kyle", "sentiment": "none"}, {"name": "lebron james", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "paul allen", "sentiment": "none"}], "locations": [{"name": "omaha", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "cleveland cavaliers", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "national football league", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "miami dolphins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nThough he chooses to live frugally , Warren Buffett's multibillion-dollar fortune could afford him any number of luxuries. \nBuffett's wealth is enough that he could easily snatch up his favorite sports franchise, as his ultra-rich counterparts Paul Allen and Stanley Kroenke have done. However, as explored on a previous episode of CNBC's \" The Filthy Rich Guide ,\" Buffett could purchase a whole lot more than that. \nForget buying his favorite team — the Oracle of Omaha can afford to own every team in the entire National Football League. In total, that would set him back around $80.7 billion . As of January 18, Bloomberg estimates Buffett's net worth at $92.1 billion , which would leave him plenty to spare. David Liam Kyle | Contributor | Getty Images \nBuffett's a longtime sports fan, and not just of the NFL. He's known to show up to games wearing the jerseys of players he likes, including Ndamukong Suh of the Miami Dolphins and LeBron James of the Cleveland Cavaliers. (If Buffett chose to shop around the NBA, James' team would cost him a mere $1.2 billion .) \nBuffett is also a big supporter of the Creighton University Bluejays and University of Nebraska Cornhuskers, both hometown favorites in Omaha. \nNot only does Buffett support those teams, he's somewhat of a good luck charm. In multiple instances — including with James and Suh — when Buffett has donned their numbers, the players' teams have gone home with wins. Coincidence? Leon Halip | Getty Images Warren Buffett attends the football game between the Minnesota Vikings and the Detroit Lions at Ford Field on December 14, 2014 in Detroit, Michigan. The Lions defeated the Vikings 16-14. \nHowever, just because Buffett can afford his pick of sports teams, doesn't mean he's buying. \nBack in 2014, when asked if sports teams are a good investment on Dan Patrick's radio show, Buffett explained : \n\"They're kind of like art. I mean, they go up in value because there's just a lot of rich people that want to own one, and there's more rich people than there are teams. So they compete for 'em. Some of them don't make much money, as you know, but if you've got a lot of money, what are you gonna do with it? Some people buy art, some people buy houses, some people buy boats. I invest, but I'm different.\" \nDuring a more recent interview with Patrick , Buffett stuck to his guns, saying that he might be more inclined to purchase a professional team if he lived a city, such as Washington, where there were big names. But Omaha is a college town, and he's happy rooting for those teams from the sidelines. \nWatch a special marathon of CNBC's \" The Filthy Rich Guide \" on Saturday, January 20, from 5 p.m. to 1 a.m. EST. \nThis is an updated version of a previously published article .", "external_links": [], "published": "2018-01-20T18:00:00.000+02:00", "crawled": "2018-01-20T18:25:46.002+02:00", "highlightTitle": ""}