{"organizations": [], "uuid": "0bcd4e2f7e3659f4b95cda07323d3d61d98b2df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Big Tech Sends Nasdaq to New Record High: CEO Daily for January 3, 2018 – Fortune", "url": "http://fortune.com/2018/01/03/ceo-daily-january-3-2018/", "country": "US", "domain_rank": 1196, "title": "Big Tech Sends Nasdaq to New Record High: CEO Daily for January 3, 2018", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T14:12:00.000+02:00", "replies_count": 0, "uuid": "0bcd4e2f7e3659f4b95cda07323d3d61d98b2df0"}, "author": "Alan Murray, Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/03/ceo-daily-january-3-2018/", "ord_in_thread": 0, "title": "Big Tech Sends Nasdaq to New Record High: CEO Daily for January 3, 2018", "locations": [], "entities": {"persons": [{"name": "targ", "sentiment": "none"}, {"name": "market", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "nvidia", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "micron technology", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Good morning.\nU.S. stock markets reached new highs yesterday, with big tech driving the NASDAQ composite over 7,000 for the first time ever. You may have thought last year's soaring FANG valuations (Facebook +53%, Amazon +56%, Netflix +55%, and Google +33%) meant they were headed for an inevitable fall in 2018. But Mr. Market disagrees.\nNetflix saw the biggest rise yesterday--up 4.7%--fueled partly by an analyst report saying it was “far ahead of peers” in building subscription video services, and also by unsubstantiated rumors that it could be bought by Apple , which could use it's stash of overseas earnings that have been liberated by the new tax bill. Chipmakers also had a big day, with Advanced Micro Devices up 6.8%, Micron Technology up 6.2%, and Nvidia up 3%.\nThe markets seem to believe the FANG companies will continue their march toward world domination. Amazon, in particular, seems unstoppable. The company said in a press release yesterday that it shipped over 5 billion items from its Prime membership service to subscribers in 2017. One analyst predicted Amazon would buy Target Corp. this year--following its purchase of Whole Foods last year.\nMeanwhile, betting markets are saying Atlanta and Austin lead the odds of becoming Amazon's new, second headquarters--an honor that could bring as many as 50,000 high paying jobs with it.\nSeparately, I noted yesterday that the putatively strong economy had an impressive number of black swans circling it. Ian Bremmer did a nice job highlighting the top ten foreign-policy-related risks in this post for TIME .\nMore news below.\nAlan Murray @alansmurray alan.murray@fortune.com \nTop News When it comes to regulation, no news is good news. \nTKTKTK At least for U.S. business leaders, who are growing confident in a Trump administration that has pulled back on regulation. Though the link between regulation and positive economic effects is murky at best, a stable business environment is beginning to translate into corporate spending. The New York Times \nPeter Thiel is betting big on Bitcoin. \nThe billionaire Silicon Valley investor's Founders Fund venture capital firm reportedly bought anywhere from $15 million to $20 million worth of the cryptocurrency, and Bitcoin's recent surge has pushed the value of that investment into the \"hundreds of millions.\" Of course, cryptocurrency's volatile nature has many investors concerned about a Bitcoin bubble, but Thiel said earlier this year that people are \"underestimating\" the cryptocurrency. The Wall Street Journal \nNasdaq tops 7,000 as stocks start 2018 on a strong note. \nTKTKTKIt didn't take long for Wall Street's first record-setting day of the year. The tech-heavy Nasdaq Composite closed above 7,000 points for the first time ever, gaining almost 1.5%, on the first day of trading in 2018. Big tech stocks like Apple and Netflix pushed the Nasdaq to its personal best finish, while the S&P 500 also closed at an all-time high on Tuesday. Financial Times \nCourt asks for hearing on Valeant, Pershing Square insider trading settlement. \nA U.S. District Court in California has \"substantial questions\" related to the $290 million that Valeant Pharmaceuticals International and Bill Ackman's activist firm Pershing Square agreed to pay last week to settle an insider trading lawsuit brought by former Allergan investors. The federal court has asked Valeant and Pershing Square to appear for a hearing later this month to discuss whether or not the proposed settlement is \"reasonable and fair.\" Reuters \nAround the Water Cooler Apple has a new buddy. \nApple acquired Buddybuild, a Canadian startup that builds software development tools for coders. Buddybuild's staff of about 40 employees will bolster Apple's Xcode team, the group of engineers behind the tech giant's suite of software development tools for third-party coders who build apps for Apple products. Fortune \nNow, Bitcoin is boosting Hooters' investor. \nThe latest company to jump on the blockchain craze is Chanticleer Holdings, an investor in Hooters Restaurants and other food chains. Chanticleer saw a stock bump of more than 40% on Tuesday after unveiling a cryptocurrency-based loyalty program where people can accrue a cryptocurrency called Merit by dining at any of Chanticleer's restaurants. Fortune \nLawsuit looks to change Spotify's tune. \nA company that owns licenses for songs by Tom Petty and the Doors, among others, is suing streaming giant Spotify. Wixen Music Publishing is seeking $1.6 billion in damages after alleging in a lawsuit that Spotify streamed thousands of songs, including Petty's \"Free Fallin'\" without obtaining the proper licenses and providing compensation to the music publisher. Reuters \nTKTKAmazon: Everything store, or everything company? \nTKTKTKTKAre there limits to the number and kind of businesses that Amazon could enter? At its heart the company is a marketplace--a platform for commerce--with a \"one size fits all\" approach that serves most people. It won't specialize in a given market, and that's a hint as to where Amazon might go next. The Wall Street Journal \nThis edition of CEO Daily was edited by Tom Huddleston Jr . Find previous editions here , and sign up for other Fortune newsletters here . \n", "external_links": [], "published": "2018-01-03T14:12:00.000+02:00", "crawled": "2018-01-03T14:13:08.003+02:00", "highlightTitle": ""}