{"organizations": [], "uuid": "d19ad085c070e69f7f8514711e41c4a042f78660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 72}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/28/104617949-bracken-darrell_r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001135/device/rss/rss.html", "section_title": "Stock Picks", "url": "https://www.cnbc.com/2018/01/24/logitech-ceo-top-3-drivers-are-location-innovation-diversification.html", "country": "US", "domain_rank": 767, "title": "Top consumer tech CEO shares top 3 growth drivers: Location, innovation and diversification", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T01:23:00.000+02:00", "replies_count": 0, "uuid": "d19ad085c070e69f7f8514711e41c4a042f78660"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/logitech-ceo-top-3-drivers-are-location-innovation-diversification.html", "ord_in_thread": 0, "title": "Top consumer tech CEO shares top 3 growth drivers: Location, innovation and diversification", "locations": [], "entities": {"persons": [{"name": "bracken darrell", "sentiment": "negative"}, {"name": "cramer", "sentiment": "none"}, {"name": "darrell", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "logitech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As Logitech International gains market share around the world, CEO Bracken Darrell told CNBC on Wednesday that he sees three central growth drivers for the company going forward.\n\"We have three ways to grow: the markets we're in are generally growing, some of them strongly. We can gain share if we innovate well, and we're innovating well. We're winning lots of design awards. And then we can enter new categories. That's exactly what we're doing,\" Darrell told \" Mad Money \" host Jim Cramer.\nLogitech, a consumer technology colossus that makes personal computer accessories, mobile phone products and a host of other devices, reported earnings on Tuesday, posting strong sales and a raised full-year outlook.\nEven though it was the company's best quarter ever, Darrell admitted that he thought the company could have done even better.\n\"You know, I'm mad at myself. I'm wearing this tie because my CFO said, 'The day that we don't execute as well as we should, you and I are wearing ties,'\" Darrell told Cramer. \"We didn't get as much as we could've because we didn't transition as well as we could've one of our [distribution centers], and we could've had better profit.\"\nNevertheless, Wall Street cheered the quarter, sending shares of Logitech up 8 percent on Tuesday and to a 52-week high on Wednesday.\nOne of the company's top-performing segments was video collaboration, up 25 percent in the fourth quarter with an annual run rate, or yearly earnings projection, of $200 million.\nDarrell explained this phenomenon simply: as office layouts change, the nature of conferencing changes along with them.\n\"It used to be you'd go into a room in an office and you might have a conference call if there was a phone,\" he said. \"Now, those offices are no longer offices, they're enclosed rooms; the office is an open office, so you need more enclosed rooms so people can get away and have a personal call or a group call.\"\nAnd group conferencing is experiencing its own kind of secular change from phone to video, the CEO explained.\n\"All those enclosed rooms are going to be video-enabled, and it's the very beginning of this. So we make really low-cost video-enabling equipment for cloud-based video conferencing, so if you use a cloud-based video conferencing system, you get our stuff. It's really cheap. For the cost of a chair or two, you can video-enable a room,\" Darrell told Cramer.\nSo with the \"freight train\" of e-commerce behind it — 70 percent of Logitech's China business comes from e-commerce — and the rise of esports well underway, Darrell said he expects big things for his company's future.\n\"We're really at the beginning of what we're doing,\" the CEO said. \"There's a gigantic opportunity for all kinds of companies and certainly for us.\"\nWatch Bracken Darrell's full interview here: show chapters Top consumer tech CEO shares top 3 growth drivers: Location, innovation and diversification 19 Hours Ago | 07:47 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-25T01:23:00.000+02:00", "crawled": "2018-01-25T02:50:33.011+02:00", "highlightTitle": ""}