{"organizations": [], "uuid": "aed4fe60f62d338b8111c7c4ca9818d8bc707c24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/26/103423796-McPick2-FOF-Header.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/owners-of-mcdonalds-arent-happy-with-headquarters.html", "country": "US", "domain_rank": 767, "title": "Owners of McDonald's aren't happy with headquarters as promotions pick up and remodeling costs rise", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T21:22:00.000+02:00", "replies_count": 0, "uuid": "aed4fe60f62d338b8111c7c4ca9818d8bc707c24"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/owners-of-mcdonalds-arent-happy-with-headquarters.html", "ord_in_thread": 0, "title": "Owners of McDonald's aren't happy with headquarters as promotions pick up and remodeling costs rise", "locations": [], "entities": {"persons": [{"name": "mark kalinowski", "sentiment": "none"}, {"name": "nomura-instinet", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mcpick", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "negative"}, {"name": "mcdonald's mcdonald", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "McDonald's is gearing up for a strong 2018, impressing investors and customers, but its franchisees aren't as happy.\nIn survey conducted by Nomura-Instinet, several franchisees said their relationship with corporate executives was strained. \nAmong the reasons they cited were they felt pressured to adopt the brand's new value menu, add new equipment and products and to remodel their locations or face the wrath of the company, said Mark Kalinowski, a Nomura-Instinet analyst, in a research note. \n\"Our CEO will be great for shareholders but long-term franchisees will suffer and so will the system,\" one franchisee was quoted as saying.\nMcDonald's did not immediately respond to CNBC's request for comment.\nLast March, McDonald's revealed its plans to win back the more than 500 million visits it lost since 2012. The plan focused on adding new menu items, implementing digital ordering, launching delivery and renovating its restaurants.\nInvestors cheered these investments, driving the burger giant's stock up more than 41 percent in 2017. However, these innovations seem to have rubbed franchisees the wrong way.\n\"Owner/Operators around the country are not happy with the huge reinvestments they are forced to do,\" one franchisee told Kalinowski. \"Large numbers of operators will be put in financial trouble with the amounts of money they will be spending. Operators are not happy with the company direction but they will not say anything fearful of retaliation. The company [wants] little or no input from Operators. The company looks at Operators as the problem instead of\nthe solution.\"\nNotably, franchisees pointed to the installation of kiosks, which are aimed at speeding up lines and reducing mistakes, as a point of friction.\nOne franchisee said that adding kiosks does not address the \"real issues\" the brand is facing.\n\"Real issues are staffing, and the need for simplification of the restaurants,\" the franchisee said. \"We are ignoring the real issues. What good will new buildings be when we cannot deliver service because we are short-staffed. Employee turnover is at an all-time high for us. Our restaurants are way too stressful, and people do not want to work in them. Kiosks are not the answer.\"\nFranchisees also complained about McDonald's new value menu. They said the $1 $2 $3 Dollar menu, which launched this month, will drive sales in the first part of the year , but they fear it will drive checks lower, diminish their ability to control menu prices and raise their food costs.\nLast year, McDonald's sales benefited from the introduction of $1 and $2 soft drinks promotions and McCafe beverages.\nSeveral operators said the company has created a policy of \"say yes or leave\" when it comes to adopting these new protocols.\nTo be sure, not all franchisees are balking at the company's new focus. \n\"While it's hard to keep up with all the changes, I think McDonald's is making many of the right moves and we are about to make a quantum leap over our competitors,\" one franchisee said. \"The years 2018, 2019, and 2020 will be good years to be in McDonald's.\"\nAlso there has been a long history of McDonald's franchisees questioning management decisions. Last year, operators griped about the implementation of fresh beef, fearing it would slow down productivity. \nWhen Steve Easterbrook became CEO in 2015, McDonald's sales and earnings were slumping. Under his leadership, the brand increased its percentage of franchised stores, successfully launched promotions like All-Day Breakfast and bolstered its tech and delivery initiatives to reach lapsed customers.\nBut there seems to be growing tension between the C-Suite and its franchisees. When Kalinowski asked the franchisees to rate their relationship on a scale of one to five, with one being poor and five being excellent, the average response was 1.58. Six months ago, the average score was 1.62.", "external_links": [], "published": "2018-01-23T21:22:00.000+02:00", "crawled": "2018-01-23T21:36:33.017+02:00", "highlightTitle": ""}