{"organizations": [], "uuid": "6f8aac7b48a5468cb85c0a473131df6a168f0a8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/04/104449236-GettyImages-524237302.1910x1000.jpg", "site_section": "http://www.drudgereportfeed.com/rss.xml", "section_title": "Drudge Report Feed", "url": "https://www.cnbc.com/2018/01/05/us-nonfarm-payrolls-december-2017.html", "country": "US", "domain_rank": 767, "title": "DECEMBER JOBS: +148K...", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T15:37:00.000+02:00", "replies_count": 0, "uuid": "6f8aac7b48a5468cb85c0a473131df6a168f0a8c"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/us-nonfarm-payrolls-december-2017.html", "ord_in_thread": 0, "title": "DECEMBER JOBS: +148K...", "locations": [], "entities": {"persons": [{"name": "matthew busch", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "toshiba international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. economy added a disappointing 148,000 jobs in December while the unemployment rate held at 4.1 percent, according to a closely watched Labor Department report Friday.\nEconomists surveyed by Reuters had been expecting nonfarm payrolls to grow by 190,000. The total was well below the November pace of 252,000, which was revised up from the initially reported 228,000.\nAn unexpected loss of 20,000 retail positions during the holiday season held back the headline number. The unemployment rate for blacks fell to 6.8 percent, its lowest ever.\n\"A little bit of a disappointment when you only get 2,000 jobs out of the government and get retail at the absolute busiest time of the year losing 20,000 jobs. It just goes to show the true struggle that traditional brick and mortar is having now,\" said JJ Kinahan, chief market strategist at TD Ameritrade. \"Outside of that I actually thought it was a good report.\"\nBiggest gains came from health care (31,000), construction (30,000) and manufacturing (25,000). Bars and restaurants added 25,000, while professional and business services grew by 19,000.\nAverage hourly earnings rose modestly to the same 2.5 percent annualized gain as in November.\nFederal Reserve policymakers were watching the jobs data closely, both for payroll gains and for wage growth. Though central bank economists estimate the jobs market is near full employment, wage pressures have remained muted.\n\"I don't think it's that big of a deal,\" Michael Arone, chief investment strategist at State Street Global Advisors, said of the lower-than-expected number. \"I certainly don't think this has any impact in terms of what the Fed will do in the future. The economy continues to be on solid footing.\"\nIndeed, markets mostly shrugged off the jobs number. Stocks rose modestly in morning trade while government bond yields edged lower.\nMatthew Busch | Bloomberg | Getty Images Employees build components for hybrid electric vehicle motors at the Toshiba International manufacturing facility in Houston, Texas. Traders actually indicated a higher chance of a March Fed rate hike, pushing the probability from 68 percent before the report's release to 73 percent a half-hour later.\nAn alternative measure of unemployment that counts discouraged workers and those working part time for economic reasons edged higher to 8.1 percent. That came amid an unchanged labor force participation rate at 62.7 percent and a steady employment-to-population level of 60.1 percent, tied for the lowest since May.\nThe household survey, which calls homes to ask how many are at work, rose even less than the establishment survey, with 104,000 more Americans reported on the job.\nThe report comes amid buoyant expectations for growth overall. GDP rose 3.2 percent in the third quarter and 3.1 percent in the second quarter, and the Atlanta Fed projects the third quarter to register another 3.2 percent gain.\nIn addition, most retailers reported sharply higher holiday sales. Mastercard estimated growth at 4.9 percent for the 2017 holiday season from the same period a year earlier.\nThe pace of job growth came on the same month that Congress passed landmark tax legislation that took down the corporate rate from 35 percent to 21 percent and lowered rates for many Americans.\nNo less an authority than Warren Buffett is urging optimism, penning a column for Time magazine that cites the U.S. \"game of economic miracles\" that is only in its \"early innings.\"\nThe jobs report follows a stronger-than-expected reading on private-sector employment . The private sector added 250,000 jobs in December, according to Thursday's report by ADP and Moody's Analytics, well above the 190,000 jobs expected by economists polled by Reuters.", "external_links": [], "published": "2018-01-05T15:37:00.000+02:00", "crawled": "2018-01-05T15:41:29.004+02:00", "highlightTitle": ""}