{"organizations": [], "uuid": "98be87879a66578251417730d6a019a24289fc41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 49}, "facebook": {"likes": 36, "shares": 36, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104912513-_sites_default_files_images_104912513-GettyImages-892695676.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/blockchain-experts-tips-for-understanding-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "Regulators and investors 'are just waking up' to cryptocurrency, and blockchain expert has some advice", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-27T01:34:00.000+02:00", "replies_count": 0, "uuid": "98be87879a66578251417730d6a019a24289fc41"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/blockchain-experts-tips-for-understanding-cryptocurrency.html", "ord_in_thread": 0, "title": "Regulators and investors 'are just waking up' to cryptocurrency, and blockchain expert has some advice", "locations": [], "entities": {"persons": [{"name": "jamie smith", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "global blockchain business council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Regulators and investors alike are just beginning to understand what cryptocurrency is, says Jamie Smith, president of the Global Blockchain Business Council. The organization helps regulators understand blockchain technology and other cryptocurrencies.\n\"What concerns me is that there are so many regulators, not just in the United States, but all over the world, who are just waking up to what this is,\" Smith told CNBC during \" Power Lunch \" on Friday.\nDespite the buzz around digital currency, people have little understanding of it, Smith said. \"It's just really critical that they learn and that they take the time [to understand].\"\nFears over an uncertain regulatory environment around the digital coin market may have sparked a sell-off earlier this month, with bitcoin tumbling more than 30 percent. South Korea and China already have imposed or have said they will impose regulations on digital currency.\nSmith, who was in Davos this week to co-chair the first-ever Future Council on Blockchain at the World Economic Forum, said she is \"a big believer in smart regulation.\"\n\"But you can't have smart regulation until you're smart,\" she said. Here are some of her tips on cryptocurrency.\n1. Don't invest in an ICO that doesn't have a product.\nSmith said she supports the U.S. Securities and Exchange Commission 's statements that if a company decides to make an initial coin offering, or ICO, a way to raise funds for cryptocurrency ventures, they should first have an actual product.\n2. Get some guidance on cryptocurrency options.\n\"It would be very helpful to have a little guidance on all of these cryptocurrencies,\" Smith said. \"Everybody's heard about bitcoin. But there's a lot of different cryptocurrencies out there.\" Without knowledge of the many ways to invest in digital money, Smith said, investors are at the mercy of companies that use their own criteria for selecting which digital currency to invest in.\n3. Know the difference between pseudo-anonymous and fully anonymous.\n\"Bitcoin is pseudo-anonymous,\" Smith said. \"Pseudo-anonymous just means [other users] don't know exactly your name attached to the IP address, but law enforcement could essentially figure it out if they needed to.\"\n4. Use resources such as the Blockchain Alliance.\nThe organization helps law enforcement and regulatory agencies all over the world understand the blockchain ecosystem, Smith said. The organization's website also says it provides informational sessions and technical assistance for investors to understand digital currencies.\n\"There's a lot of really cool work going on educating law enforcement on this,\" Smith said. \"The problem is there aren't even that many people in law enforcement who know about it or have the funding to spend time on it.\"", "external_links": [], "published": "2018-01-27T01:34:00.000+02:00", "crawled": "2018-01-27T01:40:02.002+02:00", "highlightTitle": ""}