{"organizations": [], "uuid": "46118366f237ea5e495d453fc2e81aea45980cb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 68, "shares": 68, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/12/103070123-RTX1RVI2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19836768/device/rss", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/24/oil-hits-highest-since-late-2014-on-us-crude-inventory-drop-weaker-dollar.html", "country": "US", "domain_rank": 767, "title": "Oil hits highest since late 2014 on US crude inventory drop, weaker dollar", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T03:28:00.000+02:00", "replies_count": 0, "uuid": "46118366f237ea5e495d453fc2e81aea45980cb1"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/oil-hits-highest-since-late-2014-on-us-crude-inventory-drop-weaker-dollar.html", "ord_in_thread": 0, "title": "Oil hits highest since late 2014 on US crude inventory drop, weaker dollar", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "guthrie", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "devon energy production co.", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "mins ago shares nick oxford | reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil futures sold off heading into the close of trading on Thursday as the U.S. dollar reversed earlier losses that had bolstered crude prices throughout the session.\nGlobal benchmark Brent briefly surged above $71 a barrel for the first time since 2014 on support from a weaker dollar , tighter global supplies and a record run of declines in U.S. crude inventories.\nBrent crude , the international oil benchmark, hit $71.28 a barrel — the highest since early December 2014. Brent eased to $70.42, down 11 cents by 2:29 p.m. ET.\nU.S. crude climbed to $66.66, also the highest since early December 2014, before dipping to end Thursday's trade down 10 cents at $65.51.\nshow chapters Oil hits three-year high 1:18 PM ET Wed, 24 Jan 2018 | 01:37 \"This latest pop is due to the dollar trade,\" said Gene McGillian, director of market research at Tradition Energy.\nThe U.S. dollar hit its lowest since December 2014 against a basket of other currencies, sliding further as comments by the European Central Bank president boosted the euro a day after U.S. Treasury Secretary Steven Mnuchin said a weaker dollar was \"good for us.\"\nA falling dollar makes dollar-denominated commodities cheaper for other currency holders and tends to support oil prices.\n\"The depreciation of the U.S. dollar is also allowing oil prices to make further gains,\" said Carsten Fritsch, analyst at Commerzbank. \"Almost every commodity class is being driven up by this extended dollar fall.\"\nTightening global supplies have also lifted oil, as the Organization of the Petroleum Exporting Countries and allies including Russia have continued supply curbs.\nAn involuntary drop in Venezuela's production in recent months has deepened the impact of the output cuts.\nshow chapters Low oil prices have generated high oil demand, says Total CEO 10 Hours Ago | 02:49 U.S. crude stockpiles have been dropping, underscoring the idea that global supply is rebalancing after a glut. U.S. crude inventories fell for a record 10th straight week to the lowest since February 2015, official figures showed on Wednesday.\n\"The rebalance of the fundamental picture continues,\" McGillian said. Still, he pointed to rising product inventories as a potential bearish signal.\nThe supply cuts led by OPEC and Russia started a year ago and are set to last throughout 2018. They have been somewhat offset by growing output of U.S. shale oil, as higher prices have encouraged more investment in expanding supplies.\nU.S. crude oil production is expected to surpass 10 million barrels per day (bpd) in February, on the way to a record ahead of previous forecasts, according to the U.S.government's Energy Information Administration.\n— CNBC's Tom DiChristopher contributed to this report.", "external_links": [], "published": "2018-01-25T03:28:00.000+02:00", "crawled": "2018-01-25T03:43:29.006+02:00", "highlightTitle": ""}