{"organizations": [], "uuid": "a8f5e991184ecb612dd450215d78a7c633ada35b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226280581&w=1200&r=LYNXMPEE0S0SQ", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-bmw-carsharing-drivenow-sixt/sixt-to-sell-its-drivenow-stake-to-bmw-idUSKBN1FI1AJ", "country": "US", "domain_rank": 408, "title": "DriveNow deal paves way for BMW-Daimler alliance - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T13:56:00.000+02:00", "replies_count": 0, "uuid": "a8f5e991184ecb612dd450215d78a7c633ada35b"}, "author": "", "url": "https://www.reuters.com/article/us-bmw-carsharing-drivenow-sixt/sixt-to-sell-its-drivenow-stake-to-bmw-idUSKBN1FI1AJ", "ord_in_thread": 0, "title": "DriveNow deal paves way for BMW-Daimler alliance - source", "locations": [], "entities": {"persons": [{"name": "edward taylor", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "daimler", "sentiment": "none"}, {"name": "north american international auto show", "sentiment": "none"}, {"name": "sixt", "sentiment": "none"}, {"name": "mercedes-benz", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:36 AM / in 5 hours DriveNow deal paves way for BMW-Daimler alliance - source Edward Taylor 3 Min Read \nFRANKFURT (Reuters) - Germany’s BMW has bought out partner Sixt from their joint venture DriveNow, paving the way for a broader car-sharing and driverless taxi alliance with Daimler to compete against the likes of Uber and Lyft. \nCar rental company Sixt said on Monday it would generate an extraordinary pre-tax profit of about 200 million euros ($248 million) in 2018 from the sale of the DriveNow stake to BMW for 209 million euros. \n“With DriveNow as a wholly-owned subsidiary, we have all options for continued strategic development of our services,” Peter Schwarzenbauer, BMW’s board member for Digital Business Innovation, said. \n“Our experience with mobility services supports our development of future autonomous, electrified and connected fleets,” he said, adding that BMW aims to have 100 million customers for “premium mobility services” by 2025. \nThe Sixt deal comes as BMW moves closer to agreeing a deal to combine its car-sharing services with Daimler’s Car2Go, a person familiar with the discussions told Reuters last week. \nThe German carmakers want to build a joint business which includes car sharing, ride-hailing, electric vehicle charging, and digital parking services, a senior executive at one of the companies said on Monday. The BMW booth displays the company logo at the North American International Auto Show in Detroit, Michigan, U.S. January 16, 2018. REUTERS/Jonathan Ernst \nMercedes-Benz parent Daimler and BMW declined comment on the status of potential talks on their car-sharing business. “This is speculation, we do not comment,” BMW said. \nThe senior executive, who declined to be named because the plan is not public, said: “This will create an ecosystem which can also be used for managing robotaxi (driverless taxi) fleets.” \nBMW would contribute its ParkNow and ChargeNow businesses to the common company, the executive said, adding that there were still differences of opinion over the valuation of Car2Go. \nThe market for ride-hailing services currently makes up around 33 percent of the global taxi market, and could grow eightfold to $285 billion by 2030, once autonomous robotaxis are in operation, Goldman Sachs said in a recent research note. \nBMW and Daimler are now working on developing autonomous cars, vehicles which could enable them to up-end the market for taxi and ride-hailing services. \n($1 = 0.8078 euros)", "external_links": [], "published": "2018-01-29T13:56:00.000+02:00", "crawled": "2018-01-29T14:09:08.012+02:00", "highlightTitle": ""}