{"organizations": [], "uuid": "6c848f255019e6604092078bdeeed4b5c9577f12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/19/104228711-GettyImages-584738120.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/billionaire-mark-cubans-morning-routine.html", "country": "US", "domain_rank": 767, "title": "Billionaire Mark Cuban does these 4 things every morning", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:25:00.000+02:00", "replies_count": 0, "uuid": "6c848f255019e6604092078bdeeed4b5c9577f12"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/billionaire-mark-cubans-morning-routine.html", "ord_in_thread": 0, "title": "Billionaire Mark Cuban does these 4 things every morning", "locations": [], "entities": {"persons": [{"name": "huffington", "sentiment": "none"}, {"name": "arianna huffington", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mavericks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire and ABC \"Shark Tank\" star Mark Cuban is a successful tech entrepreneur and the owner of the Dallas Mavericks. He's also almost 60.\nBut he hasn't used his success or his age as reasons to rest on his laurels. \n\"Every morning, I am rising, I am grinding, I am learning,\" says Cuban in a video he tweeted to promote fellow \"Shark Tank\" star Daymond John's new book, \" Rise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life. \"\n4 things my man billionaire businessman @mcuban does EVERY morning. \nHere are the four things Mark Cuban, currently worth $3.3 billion according to Forbes, does every morning.\n1. Start the day with a positive attitude \"My rise and grind is to get up every morning knowing how I am going to kick everybody's a--, first of all, and then get after it,\" Cuban says.\nThe Pittsburgh native grew up in a working class family. His father installed upholstery in cars and his mom worked any number of odd jobs. But he's always had a can-do attitude, he says.\n\"People thought I might go work at a mill. My mom wanted me to learn how to lay carpet because she was concerned about my future.\n\"Nobody had high hopes for me,\" Cuban says in an interview on \"Shark Tank.\" \"But I was a hustler.\"\nshow chapters What Mark Cuban learned from missing out on Uber      11:06 AM ET Mon, 13 March 2017 | 00:59 2. Tackle his email inbox \"Usually, I will do my emails — spend about an hour doing that.\"\nCuban conducts almost all his business over email .\n\"No meetings or phone calls unless I'm picking up a check. Everything is email,\" Cuban tells Thrive Global's Arianna Huffington . \"Love it. Live on it. Saves me hours and hours every day. No meetings. No phone calls. All because of email. I set my schedule.\"\nThat's important to Cuban because the entrepreneur considers time the most valuable resource. \"You can't buy it. You can't find it. You can't store it. You can't trade it,\" Cuban tells Huffington .\n3. Get up to speed on current events \"Then, I will catch up on all the news.\"\nCuban tweets regularly about current events, and for a time, was on a short list of potential presidential candidates for 2020.\n\"If I was single, I would do it. For sure,\" says Cuban, during a court-side interview at a Mavericks team practice in October.\nshow chapters Mark Cuban’s best advice for college grads      1:28 PM ET Fri, 12 May 2017 | 01:02 4. Educate himself by reading Cuban is relentless about staying on top of new trends.\n\"Then, I start reading. Right now I am learning all about artificial intelligence, machine learning, deep learning, that is the wave of the future. So when I have a topic that I think I need to get up to speed on to stay ahead of everybody,\" he reads about it.\nCuban says the first trillionaire will be an AI entrepreneur and everybody should be educating themselves on the topic.\n\"Whatever you are studying right now if you are not getting up to speed on deep learning, neural networks, etc., you lose,\" says Cuban, speaking at SXSW in 2017. \"We are going through the process where software will automate software, automation will automate automation.\"\nSee also: \nMark Cuban: The world's first trillionaire will be an artificial intelligence entrepreneur \nHow Mark Cuban went from a working-class family in Pittsburgh to a self-made billionaire \nMark Cuban: If I lost everything and had to start over, here's what I would do \nshow chapters Mark Cuban: AI will produce the world’s first trillionaires      4:19 PM ET Fri, 21 April 2017 | 00:46 Like this story? Like CNBC Make It on Facebook \nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-24T19:25:00.000+02:00", "crawled": "2018-01-24T19:51:50.010+02:00", "highlightTitle": ""}