{"organizations": [], "uuid": "0e6ef655b15fd2ac6b1f9e4430b68a5b0a7a48f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/14/104899288-GettyImages-882963066.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/newbie-bitcoin-day-traders-are-going-to-get-slaughtered-says-blockchain-entrepreneur.html", "country": "US", "domain_rank": 767, "title": "Day traders tempted by bitcoin's recent plunge are going to 'get slaughtered,' says blockchain entrepreneur", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T17:08:00.000+02:00", "replies_count": 0, "uuid": "0e6ef655b15fd2ac6b1f9e4430b68a5b0a7a48f3"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/newbie-bitcoin-day-traders-are-going-to-get-slaughtered-says-blockchain-entrepreneur.html", "ord_in_thread": 0, "title": "Day traders tempted by bitcoin's recent plunge are going to 'get slaughtered,' says blockchain entrepreneur", "locations": [], "entities": {"persons": [{"name": "novaes", "sentiment": "none"}, {"name": "dan novaes", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 Hours Ago | 03:59 \nInvestors looking at bitcoin' s drop of nearly 50 percent from last month's all-time high above $19,000 should not enter the market for the first time with get-rich-quick aspirations, a cryptocurrency entrepreneur with big-name backers warned on Wednesday. \n\"If people are going to day trade cryptocurrencies, and they don't know what they are going, they're going to get slaughtered,\" said Dan Novaes, co-founder and CEO of Current . \nHis company, whose initial investors include billionaire Mark Cuban , provides an all-in-one platform for popular streaming services such as Spotify and SoundCloud. It also offers users a way to earn cryptocurrency to reduce or eliminate subscription costs. \nIn addition to running a business based on blockchain, the online ledger technology underlying bitcoin and other digital coins, Novaes said he's an investor who is \"long cryptocurrencies.\" \n\"I believe in the technology behind it, and we're in the middle of the biggest wealth transfer in history,\" he said on CNBC's \" Squawk Box .\" \"It will develop over the next five to 10 years. I won't put my entire life savings on it … but 1 or 2 percent, whatever, because there's a lot of upside and it will ultimately change our lives.\" \nNovaes likened the crypto craze to the internet boom 20 years ago. \n\"Not every single currency or application will survive. We'll see which ones do,\" he said. \"If you had spread your portfolio out with maybe the top 20 tech companies predot-com boom, you would have actually made quite a lot of return on the ones that made it.\" \nDespite losing about a quarter of their values in the past 48 hours, top digital coins like bitcoin, ethereum and ripple were still up in the past 12 months 1,000 percent, 8,500 percent, and 13,000 percent, respectively, making for relatively high entry points for new investors. \nBut Novaes, who has profited as an early adopter, said it's not too late to buy into the various coins. \"To be honest with you, I bought cryptocurrency last week. I buy these dips.\" show chapters 5 Hours Ago | 04:48 \nNolan Bauerle, director of research at CoinDesk, told \"Squawk Box\" on Wednesday that bitcoin prices are still based solely on \"what a person is willing to pay\" and \"what a person is willing to sell it for.\" \n\"Since 2016, there have been six 25 percent decreases in bitcoin. So six times it's hit large-scale sell-offs,\" Bauerle said. \"What we can see from that is often times that money goes into other cryptocurrencies.\" \nRipple, whose market capitalization of $40 billion is a strong No. 3 among the hundreds of digital currencies, was among the biggest beneficiaries in those past bitcoin plunges, he said. Bitcoin, with a market value at $171 billion, and ethereum at $84 billion are the top two digital coins. \nCoinDesk is an online media firm aimed at the digital asset and blockchain community. Morning Squawk: CNBC's before the bell news roundup \nSign up to get Morning Squawk each weekday Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit ", "external_links": [], "published": "2018-01-17T17:08:00.000+02:00", "crawled": "2018-01-17T17:15:48.000+02:00", "highlightTitle": ""}