{"organizations": [], "uuid": "b2a5ff10dae47f2da74200d1d3407067d9cdfa7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/18/104410446-GettyImages-669889288.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/why-mark-zuckerberg-started-facebook.html", "country": "US", "domain_rank": 767, "title": "How Mark Zuckerberg came up with the idea for Facebook", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "b2a5ff10dae47f2da74200d1d3407067d9cdfa7d"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/why-mark-zuckerberg-started-facebook.html", "ord_in_thread": 0, "title": "How Mark Zuckerberg came up with the idea for Facebook", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "neutral"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "neutral"}, {"name": "facebook facebook", "sentiment": "neutral"}, {"name": "harvard", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "freakonomics radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Zuckerberg , the CEO and founder of Facebook , did not set out to build a business.\nToday the social media platform has a market capitalization of more than $500 billion and more than 2 billion monthly active users , and Zuckerberg is worth more than $70 billion, according to Forbes . But he was famously just a college student at Harvard when he launched \" theFacebook \" in 2004 .\nAt the time, Zuckerberg says he was simply solving a problem he saw around him.\n\"Yeah, well, I never started this to build a company,\" says Zuckerberg, speaking to Freakonomics Radio as part of its six-week series called \"The Secret Life of CEOs,\" which launched Thursday.\n\" Ten years ago, you know, I was just trying to help connect people at colleges and a few schools.\n\"That was a basic need, where I looked around at the internet and there were services for a lot of things that you wanted,\" says Zuckerberg, according to a transcript.\n\"You could find music; you could find news; you could find information, but you couldn't find and connect with the people that you cared about, which as people is actually the most important thing.\n\"So that seemed like a pretty big hole that needed to get filled.\"\nshow chapters The world's greatest leaders have these traits in common 9:14 AM ET Thu, 10 Aug 2017 | 00:59 Indeed. And the Silicon Valley social media titan isn't alone in his method.\nBillionaire entrepreneur Richard Branson also says the key to finding a good business idea is noticing what could be improved in your own life.\n\"Entrepreneurship in its truest form is about identifying a gap in the market and creating a product of use to fill that hole and make people's lives better,\" writes Branson in a blog post published in January.\n\"Often the best way to find this gap is to look around you — are there services that could be improved or a product that could make something easier?\"\nStarting with a small idea does not mean your business will be small, points out Branson.\n\"My advice to aspiring entrepreneurs thinking of starting their own business is: start small but always think big,\" says Branson. \"Technology also has allowed companies to think bigger than just selling to their local community and puts the world at their fingertips,\" Branson says.\nSee also:\nBillionaire Richard Branson: This simple trick is the best way to come up with an idea for a successful business\nThis is what motivates billionaire Richard Branson (Hint: It's not money)\nThis is the No. 1 trait of great leaders, says a Wharton professor who's studied thousands of executives\nshow chapters Billionaire Richard Branson says he's never been motivated by money — here's why 3:02 PM ET Wed, 18 Oct 2017 | 01:16 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T15:57:03.016+02:00", "highlightTitle": ""}