{"organizations": [], "uuid": "388ae685b185636182e98aa634f3854a885011ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221978547&w=1200&r=LYNXMPEE0D0LU", "site_section": "http://dede-indra.blogspot.com/feeds/posts/default", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/china-absence-looms-over-canada-meeting-on-how-to-pressure-north-korea-idUSKBN1F30XH", "country": "US", "domain_rank": 408, "title": "China absence looms over Canada meeting on how to pressure North Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-14T23:08:00.000+02:00", "replies_count": 0, "uuid": "388ae685b185636182e98aa634f3854a885011ed"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/china-absence-looms-over-canada-meeting-on-how-to-pressure-north-korea-idUSKBN1F30XH", "ord_in_thread": 0, "title": "China absence looms over Canada meeting on how to pressure North Korea", "locations": [], "entities": {"persons": [{"name": "david ljunggren", "sentiment": "none"}, {"name": "brian hook", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "min read  vancouver", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 9:08 PM / Updated 34 minutes ago China absence looms over Canada meeting on how to pressure North Korea David Ljunggren 5 Min Read \nVANCOUVER (Reuters) - Foreign ministers from around 20 nations gather on Tuesday to discuss how to curb North Korea’s nuclear ambitions through diplomatic and financial pressure, but China, seen as a key player in any long-term solution, will be absent. \nThe Vancouver meeting, co-hosted by Canada and the United States, comes amid signs that tensions on the peninsula have eased, at least temporarily. North and South Korea held talks for the first time in two years last week and Pyongyang says it will send athletes across the border to the Pyeongchang Winter Olympics. \nBut the United States and others say the international community must look at ways of expanding a broad range of sanctions aimed at North Korea’s nuclear program. \n“There is growing evidence that our maximum pressure campaign is being felt in North Korea. They are feeling the strain,” said Brian Hook, the State Department’s director of policy planning. \nHook told a briefing in Washington that participants, including U.S. Secretary of State Rex Tillerson, would examine how to boost maritime security around North Korea to intercept ships trying to defy sanctions as well as “disrupting funding and disrupting resources.” \nThe 17-nation Proliferation Security Initiative, which aims to prevent the trafficking of weapons of mass destruction, on Friday said “it is imperative for us to redouble our efforts to put maximum pressure on North Korea”. \nBut North Korean leader Kim Jong Un has shown no sign of willingness to give in to U.S. demands and negotiate away a weapons program he sees as vital to his survival. \nAnother challenge in Vancouver will be the absence of China, which has significant influence in North Korea. Beijing is Pyongyang’s only ally and its chief trading partner. \nThe meeting primarily groups those nations that sent troops to the Korean war of 1950-53, when China fought alongside the North. Beijing condemned the gathering. \n“Holding this kind of meeting that doesn’t include important parties to the Korean peninsula nuclear issue actually cannot help in advancing an appropriate resolution to the issue,” foreign ministry spokesman Lu Kang told a regular briefing. \nOther invitees include Japan and South Korea, front-line U.S. allies in the Washington-led effort against North Korea. \nHook said China and Russia - which is also not attending - would be fully briefed on the conclusions. That said, Beijing’s absence will be felt, say diplomats. \n“Without China there is a real limit as to what can be achieved,” said one senior diplomatic source. \nZhao Tong, a North Korea expert at the Carnegie-Tsinghua Center in Beijing, said the United States did not want Russia and China potentially distracting the discussion by raising their proposal to halt joint U.S.-South Korean military drills that the North says are a prelude to an invasion. \nFears of war have eased somewhat after the first round of intra-Korean talks in more than two years, and Trump, in an interview with the Wall Street Journal on Thursday, appeared to signal more of an openness toward diplomacy after a period of exchanging insults and threats with Kim. \nBut U.S. officials say hawks in the Trump administration remain pessimistic that the North-South contacts will lead anywhere. \nEven so, debate within the U.S. administration over whether to give more active consideration to military options, such as a pre-emptive strike on a North Korean nuclear or missile site, has lost momentum ahead of February’s Olympic games, the officials said. \nFor his part, Trump has vacillated between praising and criticizing China, which he has cast as critical to reining in North Korea’s nuclear ambitions. \nThe White House on Friday welcomed news that China’s imports from North Korea plunged in December to their lowest in dollar terms since at least the start of 2014, with trade curbed by United Nations sanctions. \nLast month, however, Trump accused China of allowing oil into North Korea, which he said would prevent “a friendly solution” to the nuclear crisis. Beijing denied the charge. Additional reporting by Arshad Mohammed, John Walcott, David Brunnstrom, Matt Spetalnick and David Alexander in Washington and Christian Shepherd and Michael Martina in Beijing; Editing by Mary Milliken and James Dalgleish", "external_links": [], "published": "2018-01-14T23:08:00.000+02:00", "crawled": "2018-01-14T23:14:29.000+02:00", "highlightTitle": ""}