{"organizations": [], "uuid": "3f4698dbf26c62d157650190fc53dae20e446634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 390, "shares": 390, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/transgender-rights-protest.jpg", "site_section": "http://news.google.com/news?cf=all&hl=en&q=transgender&cf=all&output=rss", "section_title": "transgender - Google News", "url": "http://fortune.com/2018/01/18/transgender-health-medical-care-discrimination-religious-refused/", "country": "US", "domain_rank": 1196, "title": "Commentary: 'Religious Liberty' Is Not an Excuse to Deny Transgender People Medical Care - Fortune", "performance_score": 3, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T22:39:00.000+02:00", "replies_count": 0, "uuid": "3f4698dbf26c62d157650190fc53dae20e446634"}, "author": "", "url": "http://fortune.com/2018/01/18/transgender-health-medical-care-discrimination-religious-refused/", "ord_in_thread": 0, "title": "Commentary: 'Religious Liberty' Is Not an Excuse to Deny Transgender People Medical Care - Fortune", "locations": [], "entities": {"persons": [{"name": "steve sanders", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "the trump", "sentiment": "negative"}, {"name": "politico", "sentiment": "none"}, {"name": "department of health and human services", "sentiment": "none"}, {"name": "office of civil rights", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Steve Sanders January 18, 2018 \nThe Trump administration is developing a policy that would empower health care workers to refuse to participate in abortions or treat transgender patients. According to Politico , the new rules would punish health care organizations that don’t give employees an opportunity to object to treating patients for religious or moral reasons . The Department of Health and Human Services is creating a new division within its Office of Civil Rights to investigate such complaints. \nThis is a perilous new policy, as it has the potential to impede access to care, insult the dignity of patients, and allow religious beliefs to override mainstream medical science. \nEmployee religious accommodations are part of American law because they advance values of tolerance and pluralism. But it has always been understood that accommodations must be drawn carefully to avoid unduly burdening an employer or harming the interests of third parties. \nFor example, under federal law, an employer must make reasonable efforts to accommodate an employee who can’t work on their Sabbath. But the accommodation need not be granted if it would cause the employer more than a minimal hardship. And accommodating one employee’s religious observance does not mean a coworker with seniority can be forced to give up part of their weekend to cover the employer’s staffing needs. \nCaution also is necessary with accommodations because often there is no way to differentiate between genuine religious convictions and beliefs that are made up out of convenience. Because religious beliefs are inherently personal and not subject to conventional forms of proof, an employer is usually powerless to question them. And so an employee who merely has a phobia toward transgender people might still claim a “religious” exemption, and the employer would have little choice but to grant it. \nA religious exemption for participating in an abortion is more understandable, given that an employee could be forced into performing a procedure that they see as the taking of a life. By contrast, it is unclear what legitimate objection a health care worker could have to treating a transgender person. \nSuch claims really come down to religious attitudes that say there can be no such thing as a transgender man or woman. As already mentioned, there is no way of proving whether such an attitude comes from legitimate religious belief or simply from an individual employee’s distaste toward transgender people. \nTransgender people get colds, backaches, and cancer like everyone else. Will the new policy be so broadly written that a nurse might believe they can refuse to administer chemotherapy drugs to a patient who happens to be trans? Even if that is not the policy’s intent, it is foreseeable that such humiliating incidents could occur. \nTransgender people also sometimes require specific care related to gender transition, such as surgeries, hormones, or counseling. Now, if a doctor cannot treat a patient’s condition because they lack the necessary professional competencies, they should not be forced to do so. But the Trump administration is allowing something different than that—for a medical decision to be based on moral animus toward the very existence of transgender people. \nThere is reason to doubt whether the new Trump policy will carefully balance the interests of all concerned. The new rules appear to be a political reward to the Christian right, part of Trump’s all-important base. They’re being spearheaded by former Heritage Foundation activist Roger Severino, who has long promoted the idea that law must favor religious viewpoints over the rights of LGBTQ people. \nHealth policy making should not be outsourced to Christian conservatives who deny that a person can medically change their gender identity. It does not matter to these conservatives that gender dysphoria is a recognized diagnosis with established treatment protocols. They believe transition-related medical care can be refused because transgender people are, according to an essay in the religious-conservative journal Public Discourse , an “absurdity,” and “[n]o amount of surgical mutilation of body parts, effeminate behaviors, or artificial female appearances can make a man a woman .” \nTrump’s new policy would empower workers to withhold care because they object to a patient’s identity and because such workers believe their religious liberty allows them to denigrate the patient’s very being. Government should not place its authority behind religion when it would require a health care organization to deny someone not only care, but basic human dignity. \nSteve Sanders is an associate professor of law at the Indiana University Maurer School of Law. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T22:39:00.000+02:00", "crawled": "2018-01-20T05:46:16.000+02:00", "highlightTitle": ""}