{"organizations": [], "uuid": "f7406ecfecbb6305d152cb982e2c4c4dd8c24ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/01/26/102369471-187884864.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/winklevoss-twins-are-bitcoin-billionaires-yet-one-drives-an-old-suv.html", "country": "US", "domain_rank": 767, "title": "Why Cameron Winklevoss drives an 'old SUV' even though the twins are bitcoin billionaires", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T22:26:00.000+02:00", "replies_count": 0, "uuid": "f7406ecfecbb6305d152cb982e2c4c4dd8c24ae0"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/winklevoss-twins-are-bitcoin-billionaires-yet-one-drives-an-old-suv.html", "ord_in_thread": 0, "title": "Why Cameron Winklevoss drives an 'old SUV' even though the twins are bitcoin billionaires", "locations": [], "entities": {"persons": [{"name": "cameron winklevoss", "sentiment": "negative"}, {"name": "tyler", "sentiment": "negative"}, {"name": "winklevoss", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "the new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5:50 PM ET Tue, 5 Dec 2017 | 01:40 SHARES \nInvestors Tyler and Cameron Winklevoss may be among the first bitcoin billionaires, but they don't act much like it. \nWhen the twins were awarded $65 million in cash and Facebook stock after a lengthy legal dispute with Mark Zuckerberg, they used their windfall to take a risk: They backed bitcoin , and the decision paid off. \nIn April 2013, the Winklevoss twins together held $11 million in bitcoin priced at $120 a coin. That holding grew to be worth more than $1 billion in December 2017 as the price of one coin surpassed $11,700. \nThat month, The New York Times reported the twins' bitcoin holdings were worth about $1.3 billion and that they held an additional $350 million in other cryptocurrencies like Ethereum. (December saw wild swings in the price of bitcoin, at one point topping $19,000 trading on the Coinbase exchange. Friday, Bitcoin was trading near $13,500, according to Coinbase. ) \nWhile other early cryptocurrency investors are splurging on things like Lamborghinis , though, the Winklevoss brothers are managing their wealth differently. \n\"While they both have apartments in downtown Manhattan, they say they live relatively spartan lives with few luxuries,\" The Times' Nathaniel Popper reports. \"Cameron drives an old S.U.V.; Tyler doesn't have a car at all.\" Getty Images Cameron Winklevoss, left, and Tyler Winklevoss \nTheir mentality appears to be focused on investing rather than spending. \"Long term, directionally, it is a multitrillion-dollar asset — I don't know how long it takes to get there,\" Cameron Winklevoss tells CNBC. They're willing to be patient. As Cameron wrote in a 2013 Reddit, Ask Me Anything post , \"I'm in this for the long-haul.\" \nThe Times reports Cameron and Tyler did sell a portion of their coins to launch Gemini, a cryptocurrency exchange on which people can buy and sell bitcoin, but they have no other plans to sell their stake. A representative for Winklevoss Capital, the brothers investment firm, declined to comment. \nWhether or not you're getting rich off of crypto, there is a good lesson you can take away from the Winklevoss twins: Money you don't spend on luxuries like fancy cars can be invested, and that lets it keep growing over time. \nAs 'Shark Tank' investor Kevin O'Leary puts it in a conversation with CNBC Make It , \"The truth is, there is a lot of crap you don't need.\" \n\"Anytime I pick up something I'm going to buy, I say to myself, 'Do I really need this?'\" O'Leary explains. \"Because if I don't buy it, the money is going to be invested and make money every year for me while I'm sleeping.\" \nBitcoin skeptics like Warren Buffett, who tells CNBC \"almost with certainty\" that cryptocurrencies \" will come to a bad ending ,\" recommend investing in low-cost index funds, a way to cheaply hold diverse positions in the largest companies in the stock market. \n\"Consistently buy an S&P 500 low-cost index fund,\" Warren Buffett tells CNBC's On The Money. \"I think it's the thing that makes the most sense practically all of the time.\"", "external_links": [], "published": "2018-01-12T22:26:00.000+02:00", "crawled": "2018-01-12T22:41:24.000+02:00", "highlightTitle": ""}