{"organizations": [], "uuid": "a767a167403ee6f99da5698a0ab64f5cafbce892", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941438-GettyImages-903910002.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/trump-denies-he-called-countries-s--holes-rejects-senators-daca-deal.html", "country": "US", "domain_rank": 767, "title": "Trump denies he called countries s---holes, rejects senators’ DACA deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:15:00.000+02:00", "replies_count": 0, "uuid": "a767a167403ee6f99da5698a0ab64f5cafbce892"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/trump-denies-he-called-countries-s--holes-rejects-senators-daca-deal.html", "ord_in_thread": 0, "title": "Trump denies he called countries s---holes, rejects senators’ DACA deal", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "saul loeb", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}], "organizations": [{"name": "taxes trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump on Friday denied reports that he asked , in a meeting with lawmakers about protections for immigrants from Haiti, El Salvador and African countries, \"Why are we having all these people from s---hole countries come here?\"\n\"The language used by me at the DACA meeting was tough, but this was not the language used,\" Trump said.\n@realDonaldTrump: The language used by me at the DACA meeting was tough, but this was not the language used. What was really tough was the outlandish proposal made - a big setback for DACA!\nThe president declared that he \"never said anything derogatory about Haitians\" beyond that \"Haiti is, obviously, a very poor and troubled country.\"\n\"I have a wonderful relationship with Haitians,\" Trump said.\n@realDonaldTrump: Never said anything derogatory about Haitians other than Haiti is, obviously, a very poor and troubled country. Never said \"take them out.\" Made up by Dems. I have a wonderful relationship with Haitians. Probably should record future meetings - unfortunately, no trust!\nTrump attacked the proposed deal for the Deferred Action for Childhood Arrivals (DACA) program in further tweets, after the White House denied that an agreement had been reached to extend the program. The president said the \"so-called bipartisan\" deal \"was a big step backwards.\"\n\"Wall was not properly funded, Chain & Lottery were made worse and USA would be forced to take large numbers of people from high crime...countries which are doing badly,\" Trump said in two tweets.\n@realDonaldTrump: The so-called bipartisan DACA deal presented yesterday to myself and a group of Republican Senators and Congressmen was a big step backwards. Wall was not properly funded, Chain & Lottery were made worse and USA would be forced to take large numbers of people from high crime\n@realDonaldTrump: ....countries which are doing badly. I want a merit based system of immigration and people who will help take our country to the next level. I want safety and security for our people. I want to stop the massive inflow of drugs. I want to fund our military, not do a Dem defund....\nSix bipartisan senators announced Thursday that they reached a deal in principle on legislation that would shield hundreds of thousands of young immigrants from deportation. It remains to be seen, however, if the chamber's leaders, the House of Representatives, or the White House would get behind their framework.\nTrump, at a Tuesday meeting with lawmakers, had signaled that he would sign any legislative solution that Congress passes to shield the undocumented immigrants .\nDemocrats , and many Republicans , do not want to authorize federal funds to build Trump's proposed physical barrier on the U.S.-Mexico border. Trump ended the Obama-era DACA program in September with a six-month delay. Under the administration's plan, DACA would cease March 5 unless Congress can pass the protections into law. Those immigrants brought to the U.S. illegally as children will no longer be shielded from deportation or have the ability to work legally in the country.\nTrump also accused Democrats of \"shutting down\" the U.S. military, saying the party's members are not \"interested in life and safety.\"\n@realDonaldTrump: ....Because of the Democrats not being interested in life and safety, DACA has now taken a big step backwards. The Dems will threaten \"shutdown,\" but what they are really doing is shutting down our military, at a time we need it most. Get smart, MAKE AMERICA GREAT AGAIN!\n— CNBC's Jacob Pramuk contributed to this report.", "external_links": [], "published": "2018-01-12T15:15:00.000+02:00", "crawled": "2018-01-12T15:38:41.008+02:00", "highlightTitle": ""}