{"organizations": [], "uuid": "3dac96d1aedad87aa6758e3490593f4ca183266e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/23/reuters-america-preview-bombardier-seeks-to-enmesh-embraer-in-trade-spat-before-ruling.html", "country": "US", "domain_rank": 767, "title": "PREVIEW-Bombardier seeks to enmesh Embraer in trade spat before ruling", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T01:11:00.000+02:00", "replies_count": 0, "uuid": "3dac96d1aedad87aa6758e3490593f4ca183266e"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/reuters-america-preview-bombardier-seeks-to-enmesh-embraer-in-trade-spat-before-ruling.html", "ord_in_thread": 0, "title": "PREVIEW-Bombardier seeks to enmesh Embraer in trade spat before ruling", "locations": [], "entities": {"persons": [{"name": "reca", "sentiment": "negative"}, {"name": "allison lampert", "sentiment": "negative"}], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "embraer", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "boeing co", "sentiment": "none"}, {"name": "itc", "sentiment": "none"}, {"name": "embraer sa", "sentiment": "none"}, {"name": "international trade commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}, {"name": "u.s. commerce department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PREVIEW-Bombardier seeks to enmesh Embraer in trade spat before ruling Allison Lampert SHARES \n(Recasts with Bombardier letter to ITC) \nMONTREAL, Jan 23 (Reuters) - Bombardier on Tuesday attempted to draw its Brazilian rival Embraer SA into a hotly contested trade dispute, two days before a U.S. agency will rule on whether duties should be slapped on American sales of the Canadian plane-and-train-maker's largest jet. \nThe International Trade Commission (ITC), which oversees U.S. trade remedy laws, is to decide on Thursday whether to back a U.S. Commerce Department recommendation to hit Bombardier's 110-to-130-seat CSeries with a duty of nearly 300 percent on sales to American carriers. \nThe case follows a petition by Boeing Co, the world's largest maker of jetliners, which argued its business was hurt because Bombardier received illegal government subsidies and dumped the CSeries in the United States through the 2016 sale of 75 jets at \"absurdly low prices\" to Delta Air Lines. \nThe case could raise tensions this week between the United States and Canada which are meeting with Mexico in Montreal to renegotiate the North American Free Trade Agreement (NAFTA). \nBombardier, which contests Boeing's claim, is asking the ITC to consider Embraer's E190-E2 as a competitor in the 100-to-150-seat market because of recent improvements to the new plane's range. \nBombardier wants the ITC to take the unusual step of reopening the record to consider a recent FlightGlobal article, which cites an Embraer executive saying the plane's range has improved from 2,850 nautical miles to 2,900 nautical miles. \nThe ITC considered only 100-to-150-seat jets with a range of 2,900 nautical miles or more as competitors to Boeing's 737 narrowbodies. While the CSeries was included as a competitor, the E190-E2, which will enter service this year and has around 100 seats, was excluded because it had a shorter range, Bombardier said in a letter to the ITC on Tuesday. \n\"Embraer has now confirmed publicly that certain Embraer E-jets capable of sitting at least 100 passengers in fact do have a range of 2,900 nm,\" the letter said. \nAn Embraer spokesman in Dublin told Reuters on Tuesday that \"due to the better fuel burn, maximum range is increased to 2,880 nautical miles\" on the E190-E2. \nA separate Embraer spokesman in Brazil could not be reached for comment on the letter. \nBombardier's letter highlights the complexity of the trade case which is being decided by a commission accustomed to ruling on items like solar panels and lumber, but not plane programs. \nSeveral aerospace and trade experts believe Boeing has the upper hand because the ITC sides more frequently with U.S. companies. For Bombardier to win, at least three of the body's four commissioners would have to rule for the Canadian planemaker. \n\"A tie vote goes to petitioners,\" said U.S. trade expert and lawyer William Perry, who believes Boeing will win the case. \nBut others would not rule out a victory for Bombardier which argues that Boeing never used its smallest jet to compete for the Delta order and has a healthy backlog of 737 MAX planes. \n\"If I was there still, I'd be looking skeptically at Boeing's claims,\" said former ITC chairperson Dan Pearson. \n\"I think there's a very good chance that the ITC will find that Boeing (was harmed),\" said aerospace analyst Richard Aboulafia. \"I think most of the industry thinks otherwise.\" \nBombardier has called Boeing's trade case self-serving after the U.S. planemaker revealed on Dec. 21 it was discussing a \"potential combination\" with Embraer. \n\"Throughout this case, Boeings claims have been disingenuous, starting with its demand that the U.S. government ignore Embraer's role in the market, while it secretly sought to buy Embraer,\" said Bombardier spokesman Mike Nadolski by email. \nEarlier in the day, Boeing spokesman Dan Curran denied that the company's ongoing conversations with Embraer had anything to do with its case against Bombardier. \n\"This week's vote by the ITC is an opportunity to restore a level playing field and recommit to the global trading rules we have all agreed to,\" Curran said. \n(Reporting by Allison Lampert in Montreal, Tim Hepher in Dublin and Brad Haynes in Sao Paulo; Editing by Denny Thomas and Matthew Lewis)", "external_links": [], "published": "2018-01-24T01:11:00.000+02:00", "crawled": "2018-01-24T16:27:33.024+02:00", "highlightTitle": ""}