{"organizations": [], "uuid": "9679fe7185cb845cbf36f8c950faf0afc32a2805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 549, "shares": 549, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965772-GettyImages-909741552.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/judge-rosemarie-aquilina-sentenced-larry-nassar-became-a-folk-hero.html", "country": "US", "domain_rank": 767, "title": "How the judge who sentenced USA gymnastics doctor Larry Nassar became a folk hero", "performance_score": 5, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T23:50:00.000+02:00", "replies_count": 0, "uuid": "9679fe7185cb845cbf36f8c950faf0afc32a2805"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/judge-rosemarie-aquilina-sentenced-larry-nassar-became-a-folk-hero.html", "ord_in_thread": 0, "title": "How the judge who sentenced USA gymnastics doctor Larry Nassar became a folk hero", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What could be seen as the first high-profile hearing of the #MeToo era came to a dramatic close on Wednesday: Judge Rosemarie Aquilina sentenced Larry Nassar, the former USA Gymnastics and Michigan State University doctor who has been convicted of charges related to possession of child pornography and has pleaded guilty to seven counts of first-degree sexual assault, to 40-175 years in prison .\n\"It is my honor and privilege to sentence you because you do not deserve to walk outside of a prison ever again,\" said the judge.\nOf the 150 or athletes who were victimized, twice as many as expected spoke out, according to the New York Times , including Olympic gold-medal-winning gymnasts Simone Biles, Aly Raisman, Gabby Douglas and McKayla Maroney.\nFor her blistering statements and for her commitment to giving a platform to any victim willing to step forward over the week-long sentencing hearing, Aquilina has become a folk hero, especially on social media.\nTWEET 1\nTWEET 2\nTWEET 3\nHeartfelt tributes to her have begun to appear in newspapers such as the Guardian and she has been profiled in the New York Times, which called the cowboy-boot-wearing grandmother of two \" an unusually fierce victims' advocate \" who offered \"a mix of praise, gratitude and support for the women who have come forward to address the court.\"\nThe feeling is not unanimous, of course. In an ESPN.com comment section, some readers grumble that she is a \"bad judge\" who \"has to put the spotlight on herself\" and \"is enjoying this whole thing too much.\" Some pundits also objected, including Jonathan Chait of New York Magazine, who complained the judge \"leaves me cold.\"\nTWEET 1\nMatthew Yglesias also initially reported that he disapproved of the judge's actions but, after engaging with those who disagreed with him , he took down his first tweet and wrote a new one that said only \"OK, I'm convinced.\"\nOverwhelmingly, though, viewers and readers seem to agree with prosecutor Angela Povilaitis, who said on Wednesday that the athletes Aquilina encouraged to speak offered \"important narratives to hear and witness and listen to,\" and with the Times, which called the way the judge ran the sentencing hearing \"cathartic.\"\nThe athletes and their families have expressed their gratitude, too, the Times reports. \"Several victims — and their parents — have thanked Judge Aquilina, including Doug Powell, whose daughter Kassie spoke out last week as one of Dr. Nassar's many accusers. 'Judge Aquilina, I applaud you,' Mr. Powell said after his daughter addressed the court. 'We applaud you. This room applauds you.'\"\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: How Sally Yates' history and career prepared her to perform under pressure", "external_links": [], "published": "2018-01-24T23:50:00.000+02:00", "crawled": "2018-01-25T00:15:27.000+02:00", "highlightTitle": ""}