{"organizations": [], "uuid": "b7d43795a732e597651cdbe0e37faad1d10127f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/20/104956727-Thrive_phone_bed.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/20/arianna-huffingtons-thrive-promote-wellness-by-giving-phones-a-rest.html", "country": "US", "domain_rank": 767, "title": "Arianna Huffington's new company wants to give phones a rest—so you can get some yourself", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T22:00:00.000+02:00", "replies_count": 0, "uuid": "b7d43795a732e597651cdbe0e37faad1d10127f0"}, "author": "", "url": "https://www.cnbc.com/2018/01/20/arianna-huffingtons-thrive-promote-wellness-by-giving-phones-a-rest.html", "ord_in_thread": 0, "title": "Arianna Huffington's new company wants to give phones a rest—so you can get some yourself", "locations": [], "entities": {"persons": [{"name": "arianna huffington", "sentiment": "negative"}, {"name": "huffington", "sentiment": "none"}], "locations": [], "organizations": [{"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "huffington post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "22 Hours Ago | 04:24 \nWant to feel healthier, happier and more productive? Put down your phones, turn off the television and get some shut eye. \nIn a media-saturated world where most people are always plugged in, that advice may seem easier said than done. There's little doubt that, for those reasons, people are losing out on sleep: Experts recommend at least seven hours per night for adults aged 18 to 60 years old. \nStudies show that sleeping less than 7 hours increases the risk of developing chronic diseases such as diabetes, stroke, depression and heart disease to name a few. Yet, according to the Centers for Disease Control and Prevention, 35 percent of adults are not getting enough sleep . \nIt's something that Huffington Post founder Arianna Huffington knows all too well. Ten years ago, the media mogul says she collapsed due to exhaustion, and broke her cheek bone in the process. Huffington referred to it as her \"wake up call\" and knew she needed to make changes in her life. \nHuffington felt so strongly about the issue that she launched a new company called Thrive Global that focuses on reducing stress and improving wellness. \n\"I wanted to create a company that could both work with corporations to change their culture and help them see the connection between well-being and business metrics, and also have a media platform where we could have all the latest science and new role models,\" Huffington told CNBC's \"On the Money\" in an interview. \nFor example, Amazon CEO Jeff Bezos recently wrote a piece for Thrive on why he sleeps 8 hours per night. \n\"People did not expect a major executive to actually be getting the sleep he needed to make the best decisions,\" Huffington explained. \nIf you're one of the estimated 83 million Americans that isn't getting the proper res t, Huffington recommended tips to help you achieve better sleep, including: Keep your phone out of your bedroom at night; Take a minute in the morning to remember what you're grateful for, and; Set your intention for the day before looking at your phone \n\"If you think about it, your phone is everybody else's agenda for you,\" said Huffington. \"Ending your day without your phone and starting your day without your phone are keys.\" \"... If somebody is taking care of themselves it means they are not going to burn out\" -Arianna Huffington, Thrive founder \nThrive Global even sells a phone bed charging station , so that when you go to bed, so do your devices. \nIn addition to products like the phone bed, Thrive offers what may seem like a counterintuitive solution, a mobile app that's currently available to Android users, with an iOS version in the works. Jodi Luchs \nThe idea behind the app is to help users set up boundaries when it comes to using their phone. Turning on \"Thrive Mode\" blocks calls, texts, and allows users to set up an auto reply. \nSo what would happen if Huffington emails an employee about work and gets a \"Thrive mode\" reply message? \n\"I actually love that,\" Huffington told CNBC. \"We all have to learn to work in teams. And if somebody is taking care of themselves it means they are not going to burn out. And we know that burnt out employees are over 30 percent more likely to change jobs.\" \nWhen it comes to social media, Huffington says we're at a major inflection point. \n\"It's about ten years since the smartphone has become so ubiquitous and such a big part of our lives, so now we're establishing the rules of the road,\" she said. Yet Huffington added that the responsibility to regulate social media usage isn't just on individuals, but companies as well. \n\"Companies are beginning to realize the backlash - and to take steps to basically produce products that are not so addictive,\" Huffington explained. \"Otherwise they are going to be regulated.\" PhotoAlto/Frederic Cirou/Getty Images \nOn the Money airs on CNBC Saturdays at 5:30 am ET, or check listings for air times in local markets.", "external_links": [], "published": "2018-01-20T22:00:00.000+02:00", "crawled": "2018-01-20T23:28:20.001+02:00", "highlightTitle": ""}