{"organizations": [], "uuid": "a8995514fdf1993bdfcf289c207e343558d0bc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/07/104515898-GettyImages-623836604-eric-trump.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/21/eric-trump-the-shutdown-is-a-good-thing-for-us-politically.html", "country": "US", "domain_rank": 767, "title": "Eric Trump says the shutdown is 'a good thing for us,’ politically", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-21T08:00:00.000+02:00", "replies_count": 0, "uuid": "a8995514fdf1993bdfcf289c207e343558d0bc2a"}, "author": "", "url": "https://www.cnbc.com/2018/01/21/eric-trump-the-shutdown-is-a-good-thing-for-us-politically.html", "ord_in_thread": 0, "title": "Eric Trump says the shutdown is 'a good thing for us,’ politically", "locations": [], "entities": {"persons": [{"name": "eric trump", "sentiment": "negative"}, {"name": "eduardo munoz alvarez", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "eric trump  eric trump", "sentiment": "neutral"}, {"name": "jeanine", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "palm beach", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Eric Trump , President Donald Trump 's second eldest son, had a busy night on Saturday. In addition to filling in for his father at a high-dollar fundraiser at Mar-a-Lago , the president's private club in Palm Beach, Fla., the 34-year old also went on Fox News Channel's \"Judge Jeanine,\" to defend the president's accomplishments.\nBetween accolades for his father, the younger Trump stumbled over a basic rule of politics: Never boast about how you will benefit politically from the misfortune of your constituents.\n\"I think it's a good thing for us,\" Eric Trump said of the government shutdown that was triggered at midnight on Friday by the failure of congressional negotiators and the Trump White House to reach a deal to fund the government. The public, Eric Trump said, would blame Democrats for the paralysis in Washington, and for the forced furlough of hundreds of thousands of federal employees, who would be sent home without pay. \nYet even if this prediction came true – and recent polling suggests otherwise – it could be seen as a stumble at a politically fraught time for his father and Republican lawmakers.\nTo be sure, Eric Trump is not the sort of experienced politician who might be expected to navigate situations like these with traditional savvy. But neither is he the disinterested outsider that he promised to be in late 2016, as his father prepared to take office.\nIn March 2017, weeks after the elder Trump's inauguration, Eric Trump was still describing a \"clear separation of church and state\" between his father's political career and the Trump Organization, the family real estate business that he and his brother Donald Trump Jr. are managing while their father is president. Yet almost from the start, both Eric and Donald Jr. have served as outspoken political advocates for the president and his policies.\nSaturday offered a perfect example of this ongoing tension. By calling in to Jeanine Pirro's show a little after 9 p.m. ET, Eric Trump was serving as a both a de facto White House surrogate on prime-time TV and as a stand-in for his father at a gala fundraiser for Trump's reelection campaign. \nWhether Eric Trump's boast will turn into a headache for the Trump White House remains to be seen. And it wasn't the only miscalculation he made on Saturday night.\nDuring Saturday's call-in with Pirro, Eric Trump sought to explain why Democrats deserve the blame for the current shutdown by highlighting how many Democrats voted against a bill to fund the government. \n\"If you looked at the vote, you had 269 Republicans who voted to keep the government open. And you had 230 Democrats who voted to close government,\" he said, \"and they'll say Trump wanted to close the government. ... It doesn't make a whole lot of sense to me. And I'm pretty good at math.\"\nYet in the House, 230 Republicans voted for the measure, while in the Senate, 45 did, for a total of 275 GOP votes – not 269, as Trump claimed. On the Democrats' side, 197 voted against the spending bill in the House, while 44 Democrats opposed advancing the measure in the Senate for a total of 241 – not 230.\nThe White House referred CNBC's questions to Eric Trump, but attempts to reach him late Saturday were unsuccessful.", "external_links": [], "published": "2018-01-21T08:00:00.000+02:00", "crawled": "2018-01-21T08:04:44.007+02:00", "highlightTitle": ""}