{"organizations": [], "uuid": "809d7ac71bc8f8e853e8d71c85c1ca450d03944e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/18/104781059-GettyImages-823873548.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/bitcoin-is-now-higher-reversing-earlier-losses-that-brought-it-below-10000.html", "country": "US", "domain_rank": 767, "title": "Bitcoin is now higher, reversing earlier losses that brought it below $10,000", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T18:39:00.000+02:00", "replies_count": 0, "uuid": "809d7ac71bc8f8e853e8d71c85c1ca450d03944e"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/bitcoin-is-now-higher-reversing-earlier-losses-that-brought-it-below-10000.html", "ord_in_thread": 0, "title": "Bitcoin is now higher, reversing earlier losses that brought it below $10,000", "locations": [], "entities": {"persons": [{"name": "vyacheslav prokofyev", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coindesk", "sentiment": "none"}, {"name": "tass", "sentiment": "none"}, {"name": "getty images  bitcoin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin jumped more than 10 percent Tuesday from session lows of below $10,000. \nThe digital currency climbed to $11,358 in midday trading, up 13.9 percent from a low of $9,972.29 hit early Tuesday morning, according to CoinDesk's bitcoin price index, which tracks prices from digital currency exchanges Bitstamp, Coinbase, itBit and Bitfinex. The dip below $10,000 had marked bitcoin's second drop below the psychologically key level in a week. \nBitcoin plunged more than 30 percent in the middle of last week, briefly falling below $10,000 to a low of $9,199.59 on CoinDesk, after concerns about increased regulation in South Korea and China. Prices had stabilized by the end of the week, but began falling again Monday. \nBitcoin performance Tuesday \n\nSource: CoinDesk \nCboe bitcoin futures traded about 10 percent higher near $11,210, while CME bitcoin futures were more than 7.5 percent higher around $11,145. Trading in Cboe bitcoin futures was briefly halted due to the price move.\nNo specific driver was immediately apparent behind Tuesday's price action. At session lows, bitcoin was down more than 25 percent for the year so far, but remained more than a staggering 955 percent above January 2017 levels. \n\"It was a bubble. It is a bubble,\" Ray Dalio , founder of hedge fund giant Bridgewater Associates, told CNBC Tuesday from the World Economic Forum in Davos, Switzerland. \"A perfectly good market can be in a bubble.\" \n\"I don't know how to value it,\" Dalio said. \"I believe in the blockchain technology. I think it's great, but that notion of how to trade it and how to value it is not my expertise.\"\nBitcoin's initial losses Tuesday did come as more details emerged around South Korea's efforts to limit speculation in cryptocurrencies. \nThe South Korean Financial Services Commission announced Tuesday that a proposed ban on anonymous trading accounts will take effect Jan. 30. \nshow chapters Bitcoin could be the biggest bubble in history – here's how      7:26 AM ET Wed, 17 Jan 2018 | 02:00 \"Those who do not have their real-name accounts at the same bank with the exchanges will not be allowed to make new deposits into the exchanges' accounts. They will be only allowed to make withdrawals,\" a release said. The commission also announced guidelines for financial institutions to prevent cryptocurrency-related money laundering.\nThe share of bitcoin trading in South Korean won remained steady around 5 percent, while U.S. dollar-bitcoin trading had the largest share at 38 percent, according to CryptoCompare. The yen had the second-greatest share, nearly 30 percent of bitcoin trading volume. \nOther major digital currencies also recovered in late Tuesday morning trading.\nEthereum , the second-largest digital currency by market capitalization, traded slightly higher near $1,006.98, according to CoinMarketCap.\nRipple , the third-largest cryptocurrency by market cap, traded a touch higher near $1.39, the website showed.", "external_links": [], "published": "2018-01-23T18:39:00.000+02:00", "crawled": "2018-01-23T19:02:39.008+02:00", "highlightTitle": ""}