{"organizations": [], "uuid": "57bd571f1623e7145d8eeb6d8af392c1b75b4a5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223805027&w=1200&r=LYNXMPEE0K055", "site_section": "http://app.feed.informer.com/digest3/VLZEFJTITH.atom", "section_title": "World News Review", "url": "https://www.reuters.com/article/us-myanmar-journalists-prison/while-political-prisoners-released-myanmars-judicial-reforms-stall-idUSKBN1FA05F", "country": "US", "domain_rank": 408, "title": "While political prisoners released, Myanmar's judicial reforms stall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-21T08:47:00.000+02:00", "replies_count": 0, "uuid": "57bd571f1623e7145d8eeb6d8af392c1b75b4a5f"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-journalists-prison/while-political-prisoners-released-myanmars-judicial-reforms-stall-idUSKBN1FA05F", "ord_in_thread": 0, "title": "While political prisoners released, Myanmar's judicial reforms stall", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "suu kyi", "sentiment": "none"}, {"name": "aung san suu kyi", "sentiment": "none"}, {"name": "simon lewis", "sentiment": "none"}, {"name": "thu thu aung", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}], "organizations": [{"name": "assistance association for political prisoners", "sentiment": "none"}, {"name": "nld", "sentiment": "none"}, {"name": "national league for democracy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "aapp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON (Reuters) - Hundreds of political prisoners have been released from Myanmar’s jails in amnesties in recent years, including dozens freed in January 2016, days before democracy champion Aung San Suu Kyi’s party took power for the first time.\nFormer President Barack Obama announced the lifting of U.S. sanctions in October 2016, citing the release of political prisoners and improved human rights as well as the elections that brought Suu Kyi to power. Suu Kyi herself had been under house arrest for 15 years before being released in 2010.\nPrison reform, however, has been put on the back burner under the new government.\nA new prison law was discussed in parliament in 2015, but was not passed. It has not been taken up since then by a new set of lawmakers - most of them from Suu Kyi’s National League for Democracy (NLD) - who took their seats in early 2016.\nThe Assistance Association for Political Prisoners (AAPP), a Myanmar group formed by former detainees, says prison reform should include repealing a law that gives police broad powers of arrest and pre-trial detention.\nThe AAPP advocates overhauling vague or outdated rules in the Jail Manual and Penal Code, much of it written during British colonial rule.\nBut the AAPP and rights groups caution that any new legislation on prison reform would not stop politically motivated prosecutions, which would need to be addressed with specific judicial and legal reforms.\nSuu Kyi’s government pardoned, released or dropped charges against hundreds of political prisoners in the month after it took office. But today, 46 people are serving prison sentences for political activities, and another 52 political prisoners are in jail awaiting trial, the AAPP says.\nOTHER PRIORITIES NLD Party spokesman Aung Shin told Reuters prison reform was not yet on the legislative agenda because of other priorities.\n“There are so many things to do as MPs, it may be a part of the reasons for not including prison reform in the parliament discussions,” Aung Shin said.\nHe also said, however, prisons should be part of a broader examination of legal and judicial reform that the party and legislature was planning. He did not give a time frame for any contemplated legislation.\nAAPP says that 120 former political prisoners from the NLD party are members of the national parliament or regional assemblies.\n“There are so many former political prisoners in the NLD party, and even in the current parliament,” said Aung Myo Kyaw, head of AAPP’s Yangon office. “It’s sad they aren’t considering this issue.”\nThe military did not respond to requests for comment.\nThe home affairs ministry says it has improved prison conditions across the country. A ministry report in March said the Correctional Department had relaxed rules on family visits and improved education programs.\nRULE OF LAW Many of the political prisoners, including some today, were jailed in Insein, a 19th-century prison in the north of Yangon that had a notorious reputation for torture, hunger strikes and rioting over inhumane conditions until Myanmar began transitioning to civilian rule in 2011.\nA security officer stands guard in front of Insein Prison in Yangon, Myanmar December 29, 2017. Picture taken December 29, 2017. REUTERS/Stringer For decades, Insein prison, which has held politicians and poets alongside murderers, thieves and drug dealers, was emblematic of oppressive junta rule and Myanmar’s poor record when it came to the rule of law.\nSome prisoners were kept isolated or were physically and mentally abused while in jail, former inmates say. Amnesty International said misbehaving prisoners, including political prisoners on hunger strike, were still kept shackled in filth in kennels meant for dogs as recently as 2011.\nSuu Kyi herself was briefly held in a hut in the prison compound between spells of house arrest. Leaders of the NLD spent time there before Myanmar’s military rulers started a transition to democracy in 2011 that brought both the release of hundreds of political prisoners and an improvement to prison conditions.\nInsein is where Reuters journalists Wa Lone, 31, and Kyaw Soe Oo, 27 have been detained as they face an investigation into whether they breached Myanmar’s Official Secrets Act after the two were detained on Dec. 12.\nBuilt during British colonial rule in the 19th century, Insein covers about 200,000 square meters - larger than New York’s Grand Central station.\nBy some accounts, conditions there have gotten a lot better.\nKyaw Zwa Naing, detained in Insein for two weeks in June after writing a satirical article mocking the military, said “the prison officers treated us well”.\n“We could access food supply without limitation. No one threatened us,” he said.\nOVERCROWDED After an inspection in March, the government-backed Myanmar National Human Rights Commission identified overcrowding as a problem and recommended building new dormitories.\n“The unlucky ones have to sleep right next to the toilet. In Myanmar, we can’t provide international standard cells for inmates,” Commissioner Yu Lwin Aung told Reuters.\nPolitical prisoners and those accused of other non-violent offences are housed with inmates both accused and convicted of violent crimes, according to the AAPP, which regularly interviews recent inmates.\nFamily members say the Reuters reporters each have their own cell and sleep on mats on raised platforms. However, they say the two are fearful because they are being held in the same block as both suspected and convicted criminals.\nMin Tun Soe, a deputy director and spokesperson for the Prison Department said overcrowding was no longer a concern - the prison now houses 12,000 inmates after increasing its capacity to 10,000.\n“There’s lots of reform going on in the prisons, such as new budgets for food supplies, healthcare and education opportunities for inmates, and also reforming the moral behavior of inmates,” he said.\n“The situation is different than it was before,” he said.\nEditing by Bill Tarrant\n ", "external_links": [], "published": "2018-01-21T08:47:00.000+02:00", "crawled": "2018-01-21T09:14:07.012+02:00", "highlightTitle": ""}