{"organizations": [], "uuid": "4336603182bd96dea0cbb0119b48377b99e5b672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/03/104750304-GettyImages-156732257.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/barack-obama-says-this-is-how-he-now-spends-his-mornings.html", "country": "US", "domain_rank": 767, "title": "Barack Obama reveals the ‘hugely liberating’ change to his mornings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T17:39:00.000+02:00", "replies_count": 0, "uuid": "4336603182bd96dea0cbb0119b48377b99e5b672"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/barack-obama-says-this-is-how-he-now-spends-his-mornings.html", "ord_in_thread": 0, "title": "Barack Obama reveals the ‘hugely liberating’ change to his mornings", "locations": [], "entities": {"persons": [{"name": "samad", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "negative"}, {"name": "prince harry", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "phnom penh", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "bbc radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Now that Barack Obama is no longer president of the U.S., his schedule has freed up in the last year.\nSpeaking in an interview for BBC Radio 4 , the former commander-in-chief tells Prince Harry of the U.K. royal family the best part of his post-presidency life.\nObama explains that he spends his mornings contemplating how to move forward on things he cares deeply about and \"that's obviously hugely liberating.\"\n\"Now when I wake up, I can make my own decisions about how do I want to spend my time,\" says Obama.\nThe former president also admits that he now wakes up much later than he did as leader of the free world and he's enjoying this freedom.\n\"It's wonderful to be able to control your day in a way that you just can't as president,\" he says.\nHis job as president entailed a wide range of responsibilities and a \"constantly full inbox,\" he says. As a citizen, he can now tailor his day as he pleases.\nAlthough a typical day has changed for him, the former president notes that the things that were important to him as president are still his priorities and what he spends his days working on. For example, Obama says that he cares about kids all over the world receiving a decent education, people being able to find jobs that pay a living wage and conserving environmental resources for the next generation.\n\"So although I don't have the same tools that I had as president,\" he tells Prince Harry, \"a lot of the things that still motivate me and move me continue to this day.\"\nObama acknowledges that there are certain things he misses about being president, like being able to avoid traffic.\n\"I didn't used to experience traffic,\" he says. \"I used to cause traffic, much to the consternation of any place I was visiting.\"\nHe also misses his team. \"There's a camaraderie and an intensity to the work. Everything you do every day, you know can affect millions or billions of people,\" says Obama.\nTWEET\n\"To have really smart, focused people who are there for the right reasons and who over time have built up trust and have learned to support each other and rely on, I miss that,\" he continues.\nHe also misses the work itself. Even though the politics didn't always work out well, Obama says he found the job both fascinating and rewarding. \"That kind of day-to-day satisfaction I think is hard to match.\"\nLike this story? Like CNBC Make It on Facebook .\nSee also:\nBarack Obama: 2017 has been a tough year, but here's what to look forward to in 2018\nBarack Obama on success: Not a marathon or sprint, but a 'relay race'\nBarack and Michelle Obama show that who you marry could be key to your success\nshow chapters", "external_links": [], "published": "2018-01-23T17:39:00.000+02:00", "crawled": "2018-01-23T18:05:57.009+02:00", "highlightTitle": ""}