{"organizations": [], "uuid": "39e7d5ca4b05c7a1279b71f12c212c7ecfcd91d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 132, "shares": 132, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221692783&w=1200&r=LYNXMPEE0C09R", "site_section": "http://dede-indra.blogspot.com/feeds/posts/default", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-iran-nuclear/u-s-ultimatum-on-nuclear-deal-new-sanctions-draw-iran-threat-idUSKBN1F20FG", "country": "US", "domain_rank": 408, "title": "U.S. ultimatum on nuclear deal, new sanctions draw Iran threat", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-13T14:13:00.000+02:00", "replies_count": 0, "uuid": "39e7d5ca4b05c7a1279b71f12c212c7ecfcd91d5"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear/u-s-ultimatum-on-nuclear-deal-new-sanctions-draw-iran-threat-idUSKBN1F20FG", "ord_in_thread": 0, "title": "U.S. ultimatum on nuclear deal, new sanctions draw Iran threat", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "andrey ostroukh", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 12:13 PM / Updated 7 minutes ago U.S. ultimatum on nuclear deal, new sanctions draw Iran threat Andrey Ostroukh 5 Min Read \nMOSCOW (Reuters) - Iran said on Saturday it would retaliate against new sanctions imposed by the United States after President Donald Trump set an ultimatum to fix “disastrous flaws” in a deal curbing Tehran’s nuclear program. \nTrump said on Friday he would waive nuclear sanctions on Iran for the last time to give the United States and European allies a final chance to amend the pact. Washington also imposed sanctions on the head of Iran’s judiciary and others. \nRussia - one of the parties to the Iran pact alongside the United States, China, France, Britain, Germany and the European Union - called Trump’s comments “extremely negative.” \nThe ultimatum puts pressure on Europeans, key backers of the 2015 nuclear deal, to satisfy Trump, who wants the pact strengthened with a separate agreement within 120 days. \nWhile approving the waiver on U.S. sanctions related to the nuclear deal, Washington announced other sanctions against 14 Iranian entities and people, including judiciary head Ayatollah Sadeq Larijani, a close ally of Iran’s Supreme Leader Ayatollah Ali Khamenei. \nDescribing sanctions against Larijani as “hostile action”, Iran’s Foreign Ministry said the move “crossed all red lines of conduct in the international community and is a violation of international law and will surely be answered by a serious reaction of the Islamic Republic,” state media reported. \nIt did not specify what any retaliation might involve. \nIran’s Foreign Minister Mohammad Javad Zarif had earlier said on Twitter that the deal was “not renegotiable” and that Trump’s move “amounts to desperate attempts to undermine a solid multilateral agreement.” \nIran says its nuclear program has only peaceful aims and says it will stick to the accord as long as others respect it. But it has said it would “shred” the deal if Washington quit. \n“LAST CHANCE” \nTrump, who has sharply criticized the deal reached in Barack Obama’s presidency, had chafed at having to once again waive sanctions on a country he sees as a threat in the Middle East. \n“Despite my strong inclination, I have not yet withdrawn the United States from the Iran nuclear deal,” Trump said in a statement, saying the options were to fix “the deal’s disastrous flaws, or the United States will withdraw.” FILE PHOTO - U.S. President Donald Trump speaks before signing a proclamation to honor Martin Luther King Jr. day in the Roosevelt Room of the White House in Washington, U.S., January 12, 2018. REUTERS/Joshua Roberts \n“This is a last chance,” Trump said, pushing for a separate agreement and saying the United States would not waive sanctions again to keep Iran in the pact without such an agreement. \nRussian Deputy Foreign Minister Sergei Ryabkov called Trump’s remarks ”extremely negative“, RIA state news agency reported. ”Our worst fears are being confirmed,” he said. \nThe EU said in a statement it had taken note of Trump’s decision and would assess its implications. “It’s going to be complicated to save the deal after this,” said one European diplomat, speaking on condition of anonymity. \nBritain, France and Germany had called on Trump on Thursday to uphold the pact. Slideshow (2 Images) \nSenior U.S. administration officials told reporters Trump would work with Europeans on a follow-on deal to enshrine triggers that the Iranian government could not exceed related to ballistic missiles. \nRepublican Senator Bob Corker said “significant progress” had been made on bipartisan congressional legislation to address “flaws in the agreement without violating U.S. commitments.” CONDITIONS \nTrump laid out conditions to keep Washington in the deal. Iran must allow “immediate inspections at all sites requested by international inspectors,” he said, and “sunset” provisions imposing limits on Iran’s nuclear program must not expire. \nTrump said U.S. law must tie long-range missile and nuclear weapons programs together, making any missile testing by Iran subject to “severe sanctions.” \nThe president wants U.S. Congress to modify a law that reviews U.S. participation in the nuclear deal to include “trigger points” that, if violated, would lead to the United States reimposing its sanctions, the official said. \nThis would not entail negotiations with Iran but would be the result of talks with European allies, the official said. \nA decision to withhold a waiver would have effectively ended the deal between Iran and the other international signatories. The other parties to the agreement would have been unlikely to join the United States in reimposing sanctions. \nTwo EU diplomats said EU foreign ministers would discuss next steps at their next regular meeting on Jan. 22 in Brussels. Additional reporting by by Andrey Ostroukh in Moscow, Jeff Mason, Doina Chiacu, David Alexander and Arshad Mohammed in Washington, Robin Emmott in Brussels, John Irish in Paris and Parisa Hafezi in Ankara; Writing by Edmund Blair; Editing by Alexander Smith", "external_links": [], "published": "2018-01-13T14:13:00.000+02:00", "crawled": "2018-01-13T14:20:00.024+02:00", "highlightTitle": ""}