{"organizations": [], "uuid": "0e1b58b6bcf75537e88a23ceb8d0951471eaddff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950133-GettyImages-871795390-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/weiss-ratings-gives-ethereum-higher-rating-than-bitcoin.html", "country": "US", "domain_rank": 767, "title": "Ratings firm issues first grades on cryptocurrencies, sparking outrage online and a cyberattack", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:58:00.000+02:00", "replies_count": 0, "uuid": "0e1b58b6bcf75537e88a23ceb8d0951471eaddff"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/weiss-ratings-gives-ethereum-higher-rating-than-bitcoin.html", "ord_in_thread": 0, "title": "Ratings firm issues first grades on cryptocurrencies, sparking outrage online and a cyberattack", "locations": [], "entities": {"persons": [{"name": "weiss", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "barron", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Weiss Ratings, which claims to offer the first \"ratings\" on cryptocurrencies, has judged ethereum to be better than bitcoin .\nThe securities ratings agency announced Wednesday that it gave ethereum a B rating because it \"benefits from more readily upgradable technology and better speed, despite some bottlenecks.\"\nBitcoin received a \"fair\" C+ rating because the digital currency is \"encountering major network bottlenecks, causing delays and high transactions costs,\" according to a release. \"Despite intense ongoing efforts that are achieving some initial success, Bitcoin has no immediate mechanism for promptly upgrading its software code.\"\nNone of the 74 cryptocurrencies the agency covers received an \"excellent\" A rating. B-rated ethereum and digital currency EOS have the highest ratings.\nThat tough take is apparently a trademark of the 47-year-old independent financial ratings agency. Reports from Barron's and The New York Times from 2002 and 1992, respectively, note Weiss' lack of A ratings in coverage of insurance stocks, mutual funds and other securities. The Florida-based company usually flies under the radar in comparison to better-known agencies such as Standard & Poor's and Moody's. Weiss says it does not accept compensation from the companies it rates for issuing the rating.\nshow chapters Weiss Ratings starts grading cryptocurrencies 12:19 PM ET Fri, 19 Jan 2018 | 03:09 Foreign cryptocurrency investors were apparently very worried that Weiss would issue negative ratings on digital currencies.\nThe agency said in a release Wednesday that \"staff was up all night last night fending off denial of service attacks from Korea\" and cited Korean social media posts calling others to bring down the ratings agency's website. The hackers then broke into the website, took information from it and are distorting it on social media, the company said.\nTweet\n\"Earlier commentary on social media expressed considerable fear we were about to release negative ratings on their preferred currencies,\" Weiss Ratings founder Martin D. Weiss said in a statement. \"So this may be an attempt to thwart our release today.\"\nSome digital currency exchanges have reported degraded service due to similar cyberattacks, which attempt to paralyze a system with a flood of information.\nWeiss said Friday on CNBC's \" Squawk Box \" that the agency uses a computer model to rate cryptocurrencies based on four metrics: risk, reward, technology, and fundamental aspects of adoption and security.\n\"You can have a great technology index — all the pieces are in place for a very nice, strong currency — but unless it's actually reality-tested in the marketplace, it may not succeed, and that's what this last, fourth index tests,\" he said.\nWeiss holds a Ph.D. from Columbia University. He founded the company as Weiss Research in 1971 after an early stint at his father's investment-newsletter publishing firm, according to the Times. The company went on to issue safety ratings on banks, saving associations and insurers.\n\"Weiss' cryptocurrency ratings are a great example of the ongoing institutionalization of the cryptocurrency industry and a healthy addition,\" Ari Paul, chief investment officer at cryptocurrency investment firm BlockTower Capital, said in an email.\n\"Their rating of Bitcoin suggests a misunderstanding of the core value proposition of cryptocurrency, however, as they seem to overvalue transaction capacity, and undervalue protocol stability, security, and decentralization.\"\nBitcoin, the largest digital currency by market capitalization, traded 1 percent higher midday Wednesday near $10,955, according to CoinDesk. Ethereum, the second largest by market cap, traded about 3 percent higher near $1,019, according to CoinMarketCap.\nThe median bitcoin transaction fee was above $10 for the last several weeks before dropping to $5 on Tuesday, according to bitinfocharts . In contrast, ethereum had a median transaction fee of about 85 cents Tuesday.\nEthereum's technology also differs from bitcoin in that developers can build applications on the ethereum network.", "external_links": [], "published": "2018-01-24T19:58:00.000+02:00", "crawled": "2018-01-24T20:11:22.011+02:00", "highlightTitle": ""}