{"organizations": [], "uuid": "cca2396297376aad343c54ed667eb8ac3f9f345e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/05/104879786-Photo-Sep-03-12-42-17-PM.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/eight-weeks-in-starbucks-shanghai-roastery-is-raking-in-insane-sales.html", "country": "US", "domain_rank": 767, "title": "Eight weeks in, Starbucks Shanghai Roastery is raking in insane sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T02:07:00.000+02:00", "replies_count": 0, "uuid": "cca2396297376aad343c54ed667eb8ac3f9f345e"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/eight-weeks-in-starbucks-shanghai-roastery-is-raking-in-insane-sales.html", "ord_in_thread": 0, "title": "Eight weeks in, Starbucks Shanghai Roastery is raking in insane sales", "locations": [], "entities": {"persons": [{"name": "justin solomon", "sentiment": "none"}, {"name": "howard schultz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "starbucks shanghai roastery", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reserve roastery", "sentiment": "none"}, {"name": "starbucks reserve roastery", "sentiment": "none"}, {"name": "shanghai roastery", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to know why China is so important to Starbucks , you need only look at this statistic:\n\"Our U.S. Starbucks stories, on average, do about $32,000 a week,\" Howard Schultz, Starbucks' chairman, said during an earnings conference call Thursday. \"The Roastery in Shanghai, after eight weeks of operations is doing, on average, twice that not each week, but each day.\"\nIt has been Starbucks' hope that these Roastery locations will become destinations for coffee drinkers and that seems to be coming to fruition. On its first day of operation, the Shanghai Roastery saw an average check of $29 and the location continues to draw customers, who often wait for hours to get in the door.\n\"In my long, long history of Starbucks, I have never, ever seen anything remotely like what happened when we opened the Shanghai Roastery ,\" Schultz said. \"We shattered every sales record in the history of the company.\"\nSchultz said it chose to place the company's second Reserve Roastery in this market because he believes that Starbucks will have more stores in China than in the U.S. in the coming years.\nCurrently, Starbucks has more than 28,000 stores in 76 markets, with about half located in the United States. Starbucks operates more than 3,100 stores in China and expects to accelerate its growth in the country.\nWhile same-store sales came up short in all of the company's regions, growth in China was robust in the latest quarter. China saw fiscal first quarter same-store sales rise 6 percent during the first quarter on the back of a 6 percent increase in transactions. In addition, the company said that revenue in the country grew 30 percent.\n\"China is going to be larger than Starbucks in the U.S.,\" Schultz said. \"China is going to have more impact and grow faster than anything we've done in our history. And what we have seen in Shanghai with the Roastery not only gives us confidence but demonstrates the opportunity to be even larger than we once realized just a year ago.\"\nWATCH: Ugly retail environment hurting Starbucks' foot traffic show chapters The retail environment is 'ugly,' affecting Starbucks foot traffic: Patriarch Group's Eric Schiffer 18 Hours Ago | 02:36", "external_links": [], "published": "2018-01-26T02:07:00.000+02:00", "crawled": "2018-01-26T02:35:35.002+02:00", "highlightTitle": ""}