{"organizations": [], "uuid": "ae9bbcb242339fc53664cb9f4d541ed6cf3c4d77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/21/104180543-GettyImages-459624106.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/health-care-top-issue-for-voters-could-hurt-republicans-in-midterms.html", "country": "US", "domain_rank": 767, "title": "Health care top issue for voters, and could hurt Republicans in 2018 midterms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T21:32:00.000+02:00", "replies_count": 0, "uuid": "ae9bbcb242339fc53664cb9f4d541ed6cf3c4d77"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/health-care-top-issue-for-voters-could-hurt-republicans-in-midterms.html", "ord_in_thread": 0, "title": "Health care top issue for voters, and could hurt Republicans in 2018 midterms", "locations": [], "entities": {"persons": [{"name": "andy cross", "sentiment": "negative"}, {"name": "obamacare", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "st. vincent hospital", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "leadville", "sentiment": "none"}], "organizations": [{"name": "denver post", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "protect our care campaign", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Andy Cross | The Denver Post | Getty Images A neurologist checks a patient during an exam at the St. Vincent Hospital in Leadville, Colorado. \nYou try to break it, you own it. \nA new poll shows that health care is a top priority for most voters going into the 2018 midterm election cycle, and that Republicans who have repeatedly tried but failed to kill Obamacare could suffer mightily because of that. \nThe group that commissioned the poll, the Obamacare-advocacy group Protect Our Care Campaign , said Friday that it use the findings to push Democrats and progressives to campaign heavily on the issue of health care. \nBy a margin of 47 percent to 38 percent, voters said they would be less likely to reelect their members of Congress if they voted for GOP-sponsored bills to repeal and replace Obamacare. \nAnd a whopping 68 percent said they agreed with the statement that President Donald Trump and Republicans in Congress should abandon their Obamacare repeal efforts and \"start working across party lines on commonsense solutions that build on the current law.\" \n\"The Republicans have done what we never could,\" said Protect Our Care Brad Woodhouse, who previously was a campaign strategist for President Barack Obama . \n\"They have made the Affordable Care Act popular, and they have made it a political anvil around their necks,\" Woodhouse said. \nAnd \"it's the equivalent of political suicide\" for Republicans to persist in efforts to repeal and replace\" Obamacare, as the ACA is more commonly known, he said. \n\"I absolutely think it has the potential to impact races in a way that will be decisive.\" \nRepublicans in the Senate have a majority of just one seat. In the House, Republicans hold 239 seats, compared to 193 seats held by Democrats. \nThe poll of 1,000 people found that 54 percent chose health care as one of the two issues that that will be most important to them in deciding who to vote for in congressional elections. \nNo other issue was even close to that percentage of respondents. The second most commonly cited issue was the economy, at 29 percent, and taxes, at 28 percent. Immigration was at 18 percent, as was education. \nHart Research, which conducted the poll, found in a survey last August that health care was named by 55 percent of voters as a top issue. And in a May survey, 57 percent cited it as a top issue. \nWoodhouse said that the persistence of health care in the survey as a leading issue of concern, even after the more recent debate over the Republican tax bill, is striking, and underscores the risk of alienating voters on that issue. \nHe also noted that even after the failure to repeal the entire Obamacare law, Trump has continued to take controversial actions that involve health care, including halting key reimbursement payments to insurers , winning approval of effective repeal of the requirement that nearly all Americans have insurance or pay a fine, and making it easier for states to impose work requirements on Medicaid beneficiaries. \nThe poll found that more voters, 72 percent of respondents, disapprove of how the GOP has handled the issue of health care than do disapprove of the Republicans' job in Congress overall, which stood at 61 percent of voters. \nOnly 35 percent of voters had a favorable opinion of bills proposed by Republicans in Congress last year to repeal Obamacare, and 52 percent had an unfavorable opinion of that legislation, which all failed to pass. \nThe poll also found that there was a 10 percentage point increase in the share of voters who view Trump as actively trying to make Obamacare fail. Fifty-two percent of voters now say that, compared to the prior findings in August's survey. \nBy a margin of 55 percent to 45 percent, voters said problems with Obamacare are the result mainly of actions by Trump and Republicans.", "external_links": [], "published": "2018-01-12T21:32:00.000+02:00", "crawled": "2018-01-12T21:51:02.037+02:00", "highlightTitle": ""}