{"organizations": [], "uuid": "6e926ad13e308d80171c81bd557404585cd30008", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/22/103962120-GettyImages-148148962.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/richard-branson-reveals-that-hes-excited-for-virgin-galactic-in-2018.html", "country": "US", "domain_rank": 767, "title": "Billionaire Richard Branson reveals what he's most excited about for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T17:08:00.000+02:00", "replies_count": 0, "uuid": "6e926ad13e308d80171c81bd557404585cd30008"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/richard-branson-reveals-that-hes-excited-for-virgin-galactic-in-2018.html", "ord_in_thread": 0, "title": "Billionaire Richard Branson reveals what he's most excited about for 2018", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "adrian dennis", "sentiment": "negative"}, {"name": "branson", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "hampshire", "sentiment": "none"}, {"name": "virgin galactic", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "virgin group", "sentiment": "none"}, {"name": "farnborough international airshow", "sentiment": "none"}, {"name": "virgin galactic", "sentiment": "none"}, {"name": "vss unity", "sentiment": "none"}, {"name": "vms", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While visiting Ireland recently, Virgin Group founder Richard Branson revealed what he's most excited about for this year: his commercial spaceflight company.\n\"I had to say Virgin Galactic and hopefully going into space,\" he writes in a blog post . Venturing into space has been a longtime dream of Branson's and with a recent announcement from Virgin Galactic, Branson is approaching his goal.\nOn Thursday, the commercial spaceflight company tweeted that the company had successfully launched a spaceship flight test.\nTWEET \nTWEET 2 \nThe flight test marks the 11th flight for VSS Unity and the 242nd for VMS Eve, according to the company's Twitter feed. This was also the first flight since an August glide test.\nBranson expressed his own excitement for Virgin Galactic's most recent accomplishment, noting that this will hopefully be their final glide test.\nTWEET \nThough Branson has discussed his space goals at length , the serial entrepreneur admits that he still can't believe that it's actually coming to fruition. In his blog post, Branson writes that when he first founded Virgin, he never imagined that he'd be going into space.\n\"I still pinch myself to think of how far we've come,\" he writes.\nThe tech entrepreneur has been gearing up for his eventual space travel by focusing on his fitness. Branson has previously touted the importance of exercise and generally keeps active. However, there are different demands on the body when entering space.\nAccording to NASA , muscles atrophy quickly because of the lack of gravity in space. Astronauts on the International Space Station spend two and a half hours per day working, in order to combat this issue.\nBranson isn't the only person preparing for space travel in the very near future. Virgin Galactic CEO George Whitesides told CNBC last March that more than 600 people have signed up for the $250,000 ticket aboard the spaceship.\nVenture firms are also seeing space travel as a viable business : Last October, the Kingdom of Saudi Arabia invested $1 billion into Branson's three space companies: Virgin Galactic, The Spaceship Company and Virgin Orbit.\nWith a second test under his belt, Branson is now closer to his 2018 goal for Virgin Galactic. In fact, it was just last October that the self-made billionaire said that he expects to be in space by April 2018. \"I would be very disappointed if I haven't been into space within six months or so,\" he told CNBC's Squawk Box at the time.\nBut the rapid pace of entrepreneurial success doesn't elude him. In his most recent blog post, Branson says that he enjoys seeing how quickly businesses can grow and thrive in such a short span of time.\n\"It really reinforces how anything is possible if you surround yourself with the best team of motivated people who want to bring out the best in others and strive to do better for their customers.\"\nLike this story? Like CNBC Make It on Facebook \nSee also: \nRichard Branson took his kids to Las Vegas to teach this crucial money lesson \nHere's where billionaire Richard Branson gets his inspiration \nBillionaire Richard Branson reveals why he's such a huge fan of always saying 'yes' \nshow chapters Richard Branson: What I learned when Coke ran me out of business      1:01 PM ET Tue, 7 Feb 2017 | 01:07", "external_links": [], "published": "2018-01-12T17:08:00.000+02:00", "crawled": "2018-01-12T17:16:12.021+02:00", "highlightTitle": ""}