{"organizations": [], "uuid": "75cb0d74f990f1d3ab94c0621b3d5956c0b95b4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955515-GettyImages-906623638.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/trump-administration-continues-rollback-of-obama-abortion-protections.html", "country": "US", "domain_rank": 767, "title": "Trump administration takes new steps in anti-abortion fight", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T18:26:00.000+02:00", "replies_count": 0, "uuid": "75cb0d74f990f1d3ab94c0621b3d5956c0b95b4f"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/trump-administration-continues-rollback-of-obama-abortion-protections.html", "ord_in_thread": 0, "title": "Trump administration takes new steps in anti-abortion fight", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "eric hargan", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "department of health and human services", "sentiment": "none"}, {"name": "medicaid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration on Friday took two new steps in its ongoing fight against abortion.\nThe first was a new regulation that further underscored protections for health-care workers who refuse to perform abortions and other medical procedures because of religious and moral objections.\nThe second rescinded a formal warning issued by the Obama administration in 2016 to all state Medicaid directors reminding them that they could not cut funding to Planned Parenthood just because that group offers abortion services.\nHowever, the rescission of that warning does not affect the existing federal law barring Medicaid directors from taking such actions.\nThe moves came a day after the Health and Human Services Department announced it was creating a new \"Conscience and Religious Freedom Division\" within its Office of Civil Rights.\nAnd it came on the same day that President Donald Trump was due to become the first sitting president to address the annual March for Life anti-abortion demonstration in Washington.\n\"Today's actions represent promises kept by President Trump and a rollback of policies that had prevented many Americans from practicing their profession and following their conscience at the same time,\" said Acting HHS Secretary Eric Hargan.\n\"Americans of faith should feel at home in our health system, not discriminated against, and states should have the right to take reasonable steps in overseeing their Medicaid programs and being good stewards of public funds.\"\nRichard Severino, head of HHS' Civil Rights Office, said a new regulation being proposed Friday would require health-care providers that receive federal funding to certify they are in compliance with existing rules barring workers from being coerced into performing abortions, sterilizations, assisted suicide and certain other procedures that they object to on religious or moral grounds.\nHealth providers also would be required to post notices informing workers of such rights.\n\"America's doctors and nurses are dedicated to saving lives and should not be bullied out of the practice of medicine simply because they object to performing abortions against their conscience,\" said Severino. \"Conscience protection is a civil right guaranteed by laws that too often haven't been enforced. Today's proposed rule will provide our new Conscience and Religious Freedom Division with enforcement tools that will make sure our conscience laws are not empty words on paper, but guarantees of justice to victims of unlawful discrimination.\"\nReferring to the federal Centers for Medicaid and Medicare Services, HHS said the 2016 letter sent by Obama administration health officials to state Medicaid directors \"had said that states that attempted to protect the integrity of their program standards by disqualifying abortion providers from their Medicaid programs would come under CMS scrutiny, and would be required to present to CMS evidence of criminal action or unfitness to perform healthcare services.\"\n\"A s stated in the Friday letter to state Medicaid directors, CMS is concerned that the 2016 letter may have gone beyond merely interpreting what the statute and current regulations require,\" HHS said. \"This decision returns CMS policy to what it was prior to the issuance of the 2016 letter.\"\n\"States will still be required to comply with all applicable statutory and regulatory requirements, including the requirement that provider qualification standards be reasonable.\"", "external_links": [], "published": "2018-01-19T18:26:00.000+02:00", "crawled": "2018-01-19T18:44:38.009+02:00", "highlightTitle": ""}