{"organizations": [], "uuid": "dc10426d69e643e912c37e81ae723f18b8401141", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "http://www.bostonherald.com/sites/default/files/styles/full/public/media/2018/01/15/gettyimages-634208250.jpg?itok=AKwuz6AY", "site_section": "http://www.bostonherald.com/feed", "section_title": "Boston Herald - Boston Herald", "url": "http://fortune.com/2018/01/15/softbank-wireless-ipo-spinoff/", "country": "US", "domain_rank": 1196, "title": "SoftBank flirts with wireless unit IPO that could be Japan's biggest in two decades", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "dc10426d69e643e912c37e81ae723f18b8401141"}, "author": "Reuters", "url": "http://fortune.com/2018/01/15/softbank-wireless-ipo-spinoff/", "ord_in_thread": 0, "title": "SoftBank flirts with wireless unit IPO that could be Japan's biggest in two decades", "locations": [], "entities": {"persons": [{"name": "kazuhiro nogi", "sentiment": "negative"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "ginza", "sentiment": "none"}], "organizations": [{"name": "softbank", "sentiment": "negative"}, {"name": "softbank corp", "sentiment": "none"}, {"name": "softbank group", "sentiment": "none"}, {"name": "softbank group corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 6:02 AM EST \nSoftBank Group Corp said on Monday it was considering listing its Japanese wireless business—a move that could reportedly raise $18 billion and would accelerate the conglomerate’s transformation into one of the world’s biggest tech investors. \nA spin-off—potentially the biggest IPO by a Japanese company in nearly two decades—would give the unit more autonomy and help investors value the business as well as its parent which has myriad holdings across the tech industry. \nSoftBank Group is aiming to sell about 30% of SoftBank Corp, Japan’s No. 3 wireless carrier, for around 2 trillion yen ($18 billion), the Nikkei newspaper said without citing sources. It added that proceeds will go towards investments in growth such as buying into foreign information technology companies. \n“It makes sense to spin off the mobile-phone business using a public offering that would leave SoftBank in control and provide SoftBank with more cash to pursue its strategy of investing in companies with potentially high growth prospects,” Erik Gordon, a professor at the University of Michigan’s Ross School of Business. \n“It is a way of obtaining capital without adding debt or diluting SoftBank‘s equity interests in the growth companies.” \nSoftBank Group plans to seek approval from the Tokyo Stock Exchange as early as spring, the Nikkei said, adding that it was aiming to list around autumn in Tokyo as well as overseas, possibly London. \nThe conglomerate said in a statement that a listing of the telecoms business was one option for its capital strategy but that no such decision had been made. Its shares finished 3% higher on the news. \nAn IPO of about 2 trillion yen would be one of the biggest offerings by a Japanese company, rivaling a 2.1 trillion yen listing by NTT DoCoMo Inc in 1998 and the 2.2 trillion yen raised by the government’s sale of Nippon Telegraph and Telephone Corp shares before its 1987 listing. \nLarge companies seeking to list in Tokyo are required to float at least 35% of their shares although these rules can be eased when the company is also listing overseas. \nCOMPLEX STRUCTURE \nSoftBank Group has a vast range of holdings including stakes in British chip designer ARM Holdings, struggling U.S. wireless service provider Sprint Corp as well as Alibaba Group Holding Ltd. \nIt has with other investors also set up a $93 billion Vision Fund that is investing in a range of firms to capitalize on a tech future expected to be driven by artificial intelligence, robotics and interconnected devices. \nThat complicated structure and constant stream of new investments has made valuing the company extremely difficult and analysts often note that its market value does not accurately reflect the value of its massive holdings. \nSoftBank Group’s market capitalisation currently stands at around $92 billion. By contrast, its near 30% stake in Alibaba is worth around $140 billion. \nAn IPO could lead to softness in SoftBank Group shares for a while as some telecoms-focused investors sell their holdings to buy shares in the newly listed entity, said Chris Lane, an analyst at Sanford C. Bernstein. \n“What SoftBank will ultimately have to do, and they would have to do this in any case, is attract investors who are looking at this as a tech focused investment co(mpany),” he said. \nThe domestic telecoms unit posted a 4.5% rise in operating profit to 720 billion yen in the year ended March on sales of 3.2 trillion yen. \nWhile it has been SoftBank Group’s most profitable source of income, it faces headwinds including an aging population, a shift by consumers to cheaper carriers and plans by e-commerce firm Rakuten Inc to enter the market. \nWith SoftBank‘s founder Masayoshi Son reluctant to sell stakes in investments seen as having large upside potential such as Alibaba, listing the telecoms business could provide a place to park some of the conglomerate’s large debt burden. \n“If the desire is to be able to raise capital for future vision funds, pushing as much of the debt into the telco as possible makes sense,” said Lane. \nSoftBank‘s debt pile stood at around $100 billion in the financial quarter ended September. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T02:00:00.000+02:00", "crawled": "2018-01-15T13:49:57.018+02:00", "highlightTitle": ""}