{"organizations": [], "uuid": "fe6953261c1ebb2b35c005a4144d591ca2b28ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/08/103225968-GettyImages-475600222.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/chevron-and-conocophillips-could-be-key-drivers-in-the-energy-rally.html", "country": "US", "domain_rank": 767, "title": "Chevron and ConocoPhillips could be key drivers in the energy rally", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:00:00.000+02:00", "replies_count": 0, "uuid": "fe6953261c1ebb2b35c005a4144d591ca2b28ac2"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/chevron-and-conocophillips-could-be-key-drivers-in-the-energy-rally.html", "ord_in_thread": 0, "title": "Chevron and ConocoPhillips could be key drivers in the energy rally", "locations": [], "entities": {"persons": [{"name": "tepper", "sentiment": "none"}, {"name": "mark tepper", "sentiment": "none"}], "locations": [], "organizations": [{"name": "conocophillips", "sentiment": "negative"}, {"name": "chevron", "sentiment": "negative"}, {"name": "strategic wealth partners", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "show chapters Two energy stocks to buy as the group leads the market 21 Hours Ago | 03:49 Energy has gone from zero to hero this year.\nThe sector drove a market rally Thursday, and pushed the S&P 500 to records, in what has been the great comeback story of 2018 so far. Nearly two weeks into the new year and energy has emerged as the best-performing sector. This as oil has surged to its highest level since December 2014.\nThere are two winners that could perform better than others this year, though, according to two market watchers.\nMark Tepper , president and CEO of Strategic Wealth Partners, says Chevron should lead the pack after keeping close control of its balance sheet last year. The energy company had positive excess cash flow for the first time since 2012, Tepper told CNBC's \" Trading Nation \" on Thursday.\n\"We think things are going to continue to get better in the future,\" said Tepper. \"They're making some big improvements on cost reduction and exiting some unprofitable markets.\"\nIt's not just Chevron, though — Tepper and his firm are bullish on energy as a whole. Their outlook sees an expanding global economy and higher capital expenditures and infrastructure spending fueling further gains for oil and the sector.\n\"All the fundamentals are good for the energy sector and with the rebound in oil prices we really expect this to be a bounce-back year for energy stocks,\" he said.\nThe charts back up Tepper's bullish case, according to Craig Johnson, chief market technician at Piper Jaffray.\n\"We've got a little bit more to go in oil,\" said Johnson, appearing on \"Trading Nation.\" \"Get through $65 where you get a little bit of resistance, you're going to go to $70.\"\nFor his pick, Johnson names ConocoPhillips as the \"safe way for investors to play the energy trade\" right now. His technical analysis suggests a rise of at least 10 percent from current levels.\nA recovery in crude that gathered steam last year has found new momentum so far in 2018. Oil prices reached as high as $64.08 a barrel in intraday trade Thursday, its highest in more than three years, before paring gains to settle at $63.80. Crude has risen for the past four sessions in a row, supported by a drop in U.S. production and an eighth week of falling domestic stockpiles.\nThe Energy Select Sector ETF ( XLE ) rose 2 percent Thursday, its best one-day gain in three weeks, and is trading at its highest level since December 2016. The ETF's top three holdings – Exxon Mobil , Chevro, and Schlumberger — have had a rock-solid start to the year. Exxon is up nearly 4 percent since the beginning of 2018, Chevron more than 5 percent and Schlumberger 14 percent.\nDisclosure: Mark Tepper does not personally own CVX, but his firm does.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-12T15:00:00.000+02:00", "crawled": "2018-01-12T15:16:38.002+02:00", "highlightTitle": ""}