{"organizations": [], "uuid": "51bde5d1d6fc58d105e28d89918ebf20dff5fda9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "‘Three Billboards’ Wins Big at This Year’s Female-Focused SAG Awards – Fortune", "url": "http://fortune.com/2018/01/22/three-bilboards-sag-awards-2018/", "country": "US", "domain_rank": 1196, "title": "‘Three Billboards’ Wins Big at This Year’s Female-Focused SAG Awards", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T09:00:00.000+02:00", "replies_count": 0, "uuid": "51bde5d1d6fc58d105e28d89918ebf20dff5fda9"}, "author": "Reuters", "url": "http://fortune.com/2018/01/22/three-bilboards-sag-awards-2018/", "ord_in_thread": 0, "title": "‘Three Billboards’ Wins Big at This Year’s Female-Focused SAG Awards", "locations": [], "entities": {"persons": [{"name": "gary oldman", "sentiment": "none"}, {"name": "sam rockwell", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "allison janney", "sentiment": "none"}, {"name": "tonya", "sentiment": "none"}, {"name": "frances mcdormand", "sentiment": "none"}], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "focus features", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Movies 'Three Billboards' Wins Big at This Year's Female-Focused SAG Awards Actors Sam Rockwell, Francis McDormand and Woody Harrelson at the Screen Actors Guild Awards in Los Angeles, Calif. on Jan. 21, 2018. Kevork Djansezian—Getty Images By Reuters 2:00 AM EST \nDark comedy “Three Billboards Outside Ebbing, Missouri” won three prizes at the Screen Actors Guild (SAG) awards on Sunday in a ceremony marked by women and their stories amid the sexual misconduct scandal that has swept Hollywood. \nThe Fox Searchlight film about a furious woman seeking justice for the murder of her daughter was named best ensemble, the top SAG honor. \nFrances McDormand won best actress and Sam Rockwell took home the best supporting actor statuette for their roles in the film. \nBritain’s Gary Oldman won best actor for playing wartime leader Winston Churchill in Focus Features’“Darkest Hour.” \nAllison Janney won for her supporting actress role as a demanding mother in independent ice-skating movie “I, Tonya.” \nThe SAG awards are indicators of likely Oscar success in March because actors form the largest group of voters in the Academy of Motion Picture Arts and Sciences. \nOscar nominations will be announced on Tuesday. \nThe SAG ceremony took place after two days of marches by hundreds of thousands of women throughout the United States. \nHost Kristen Bell said women were having a “watershed moment.” \n“Let’s make sure we lead the charge with empathy and diligence because fear and anger never win the race,” said Bell, star of television’s “The Good Place.” \nAccusations of sexual misconduct have forced dozens of powerful men in Hollywood to step down, be fired or dropped from creative projects. \nFor more on sexual harassment in Hollywood, watch Fortune’s video: \nWomen, many of them leading actresses, have responded by breaking their silence through the #MeToo social media movement and the Time’s Up campaign for legal support of victims. \nOn the red carpet, women swapped the black gowns that marked support for victims of sexual harassment at the Golden Globes two weeks ago for brighter blues, green and metallic hues. \nWomen were the dominant theme inside the Shrine Auditorium. \nNicole Kidman, 50, won for playing a battered wife in HBO’s female-centric TV series “Big Little Lies.” \n“How wonderful that our careers today can go beyond 40 years old. Twenty years ago we were pretty washed up by this stage in our lives. This is not the case now,” Kidman said. \nAziz Ansari, nominated for his Netflix comedy series “Master of None,” was a no-show on Sunday after making headlines last week when a woman described feeling violated following an awkward date last year. Ansari said he believed their sexual activity was consensual. \nAnsari lost the television comedy actor statuette to William H. Macy for “Shameless.” \nJames Franco, a best actor nominee for “The Disaster Artist,” did show up but skipped the red carpet and did not win. Franco had kept a low profile since describing allegations of sexual impropriety against him by five women two weeks ago as “not accurate.” \nIn television, NBC’s sentimental family drama “This is Us” was named the best drama ensemble cast in a surprise win over presumed front runners “The Crown” and dystopian series “A Handmaid’s Tale.” \nThe cast of HBO political satire “Veep” won best ensemble for a television comedy. Julia Louis-Dreyfus, who is undergoing treatment for breast cancer and missed the SAG show, was named best comedy actress. \n“She’s genuinely been in good spirits when we’ve seen her, which I think will carry her along … She is incredibly strong and is uniquely able to combat something like this,” Timothy Simons, who plays Jonah Ryan on “Veep,” told reporters on Sunday. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T09:00:00.000+02:00", "crawled": "2018-01-22T09:00:24.002+02:00", "highlightTitle": ""}