{"organizations": [], "uuid": "a34c57592af403be956b6973d01aad677f5612bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 171, "shares": 171, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/31/104377834-104377834.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/21/trump-is-dissatisfied-with-wilbur-ross-as-commerce-secretary-axios.html", "country": "US", "domain_rank": 767, "title": "Trump reportedly thinks Wilbur Ross has done a bad job as Commerce secretary", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T00:45:00.000+02:00", "replies_count": 0, "uuid": "a34c57592af403be956b6973d01aad677f5612bb"}, "author": "", "url": "https://www.cnbc.com/2018/01/21/trump-is-dissatisfied-with-wilbur-ross-as-commerce-secretary-axios.html", "ord_in_thread": 0, "title": "Trump reportedly thinks Wilbur Ross has done a bad job as Commerce secretary", "locations": [], "entities": {"persons": [{"name": "wilbur ross", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ross", "sentiment": "none"}, {"name": "robert lighthizer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "commerce", "sentiment": "negative"}, {"name": "nafta", "sentiment": "none"}, {"name": "axios", "sentiment": "none"}, {"name": "w.l. ross and co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump has been so disappointed with Wilbur Ross 's performance as Commerce secretary that he has humiliated him in meetings, ripping the former Wall Street investor's inability to secure satisfying trade deals, Axios reported Sunday, citing sources .\n\"Your understanding of trade is terrible. Your deals are no good. No good,\" Trump told Ross, according to a source cited by the news outlet. Ross also is known for falling asleep in meetings, the report added.\nThe White House disputed the notion that Trump is dissatisfied with Ross.\n\"Secretary Ross is leading the administration's approach on steel, aluminum, intellectual property and trade. Far from souring on his performance, since taking office, the President has expanded his responsibilities,\" said an emailed statement from White House spokeswoman Lindsay Walters.\nSeparately, a White House official noted to CNBC that Commerce had recently delivered to Trump the results of its probes into aluminum and steel imports, and their impact on national security. The department is now awaiting Trump's response to the reports.\n\"The president is excited with the actions that Secretary Ross will be taking on trade in the future,\" the White House official told CNBC.\nWhen Trump nominated Ross to be his Commerce secretary, he was putting the W.L. Ross & Co. founder at the forefront of his ambitious, nationalist trade policy. During the election, Trump galvanized a wide swath of working-class voters by saying he would renegotiate trade deals, such as the North American Free Trade Agreement, or NAFTA, which the president has said favored other countries over the U.S.\nYet, as the administration started work in earnest, Trump found Ross's talks with China lacking, according to Axios. The president then made U.S. Trade Representative Robert Lighthizer the point man on negotiations, the outlet added.\n\"Wilbur has lost his step. Actually, he's probably lost a lot of steps,\" Trump is reported to have said.\nRepresentatives for the Trump administration, including top economic advisor Gary Cohn, also voiced their support for Ross to Axios.\nRead the full Axios report here.\n-CNBC's Lori Ann LaRocco contributed to this report.", "external_links": [], "published": "2018-01-22T00:45:00.000+02:00", "crawled": "2018-01-22T00:48:16.019+02:00", "highlightTitle": ""}