{"organizations": [], "uuid": "5ef0098f9439d92d77741df0b3d3f8822e257549", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/22/102111571-philanthropy-world.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/this-is-a-gutsy-way-to-go-international--and-reap-huge-returns.html", "country": "US", "domain_rank": 767, "title": "An overlooked, gutsy way for investors to make huge returns", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T16:42:00.000+02:00", "replies_count": 0, "uuid": "5ef0098f9439d92d77741df0b3d3f8822e257549"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/this-is-a-gutsy-way-to-go-international--and-reap-huge-returns.html", "ord_in_thread": 0, "title": "An overlooked, gutsy way for investors to make huge returns", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "indonesia", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "crimea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eido", "sentiment": "positive"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It hasn't gone unnoticed that 2017 was an exceptionally good year for overseas stock markets. Gains were recorded in virtually every country stock market in the world. Out of more than 120 stock markets I follow, only a few ended down in 2017. If only it could be that simple every year.\nTo expect the same kind of returns for 2018, you'd have to see a continuation of last year's super winning streak across the globe. But there is another way to keep the overseas streak going that's proven historically. You just have to be willing to take a deep dive into poorly performing international stock markets at seemingly terrible times.\nI'm talking about a Dogs of the World strategy. It exists. I discovered it during my hunt to build an international contrarian stock market strategy. Historical data backs up the approach.\nLast year was another one in which the strategy worked . Back in January 2017, the country stock market dogs were Turkey , Italy , Denmark , Ireland and Mexico . These were markets down anywhere from 7 percent to 10 percent in 2016. Here 's how they did for my Dogs of the World strategy in 2017:\nTurkey: 37 percent Denmark: 35 percent Ireland: 29 percent Italy: 29 percent Mexico: 14 percent In fact, if you were to invest in those five dog country ETFs at the very beginning of 2017, you would have made more than 29 percent for the year.\nMy country dogs versus broad global benchmarks Everything has to be compared to a benchmark. Since my international dogs basket of five countries includes both developed and emerging market country ETFs, I thought it also would be wise to compare the returns to a 50/50 ETF blend of both the broad emerging markets ( EEM ) and broad developed markets ex-U.S. ( EFA ), and annually reset based on gains to maintain a 50/50 weighting. For 2017 that simple strategy would have returned about 31 percent, slightly beating out my strategy by 2 percent. But does this negate my strategy? No. In fact, in four of the past six years, my dogs strategy has beaten the broad indexes.\nYear Global dogs EFA+EEM 2012 33% 19% 2013 7.50% 9% 2014 2.50% (-5%) 2015 14% (-8.5) 2016 32% 6% 2017 29% 31% Mitch Goldberg, ClientFirst Strategy In the two years my strategy lost out to the broad benchmark, it was by relatively small amounts. When it beat the benchmarks, it was by relatively large amounts. And the overall average was handily above and beyond. Plus, in the two losing years, returns were still attractive compared to the blended benchmark.\nOn a cumulative basis, the bottom 5 reformulated every year compared to the two benchmarks individually, again beating EEM and EFA. So what's the catch?\nThere's no catch, but there is a footnote to the research: I don't include every single country market for which there is an ETF. I follow most of the country ETFs, but for the global dogs strategy, I isolate approximately 50 single-country stock market indices that have corresponding iShares ETFs with at least a five-year trading history. Excluded markets include Qatar, UAE and Saudi Arabia. I also delete the country ETFs that are currency-hedged.\nMore from Global Investing Hot Spots:\nChina private fund assets hit staggering $1.63 trillion\nVanguard Group: There is now a 70 percent chance of correction\nThe last stock boom left that doesn't make big bets on the internet\nI back-test how I would have done if I invested in a range of global dog strategies — the 10-worst, five-worst, three-worst or single-worst country) in every year.\nIf you invested in the bottom five annual performers from the previous year — every year since going back to 2011 — the process was repeatable and delivered alpha over the averaged two standard international benchmarks.\nIn fact, if you had invested in only the second-to-worst country starting in 2011 — rather than the five worst — a $100,000 investment would turn into $378,000 (assuming reinvestment of the full amount each year over a five-year period through 2017). That was the biggest winner of all among potential Dogs of the World strategy options.\nI decided to create a portfolio of the bottom five single countries because this selection outperformed the bottom 10, and one country, or even three countries, just isn't enough for my taste when it comes to international diversification.\nHere are the Dogs of the World 2018 So here are the world's worst markets in 2017 based on my research criteria, and keep in mind that in a year of \"synchronized global growth,\" the \"worst\" doesn't look as bad as usual — in fact, all five countries generated healthy returns, just well below booming global benchmarks. These five countries generated a total return of 66 percent last year and an average return of 13 percent.\nETF 2017 return Russia (ERUS) 4% Israel (EIS) 13% Mexico (EWW) 14.50% Canada (EWC) 16% Indonesia (EIDO) 19% Creating a portfolio of 2017's bottom five international markets takes us globetrotting to domiciles that are as controversial as ever. Here are a few important things to consider about the bottom five.\nMexico : This one made an uncommon second-year-in-a-row appearance. We have a high murder rate, an election coming up that may bring about political instability, a very big energy sector, and President Trump continues to express his desire to rip up NAFTA . Canada : This country has a substantial energy sector that has suffered from low energy prices, has been subject to trading disputes with the United States in lumber and aircraft manufacturing, and President Trump continues to express his desire to rip up NAFTA. Russia : This one is the most controversial of the five. Between the independent counsel's investigation into Russian meddling in the 2016 presidential election, economic penalties due to its invasion of Crimea and its energy-dependent economy, this is a tough one to invest in. Yet of the five global dogs, Russia has started 2018 with the strongest performance. As one of the world's biggest energy exporters, if you believe energy prices are set to continue rising in 2018, this one should do well. Israel : Stuck in the middle of some of the world's most hostile countries to it and the United States, this technologically advanced country over the long term has been a sound place to invest. However, due to geopolitical events, it is often subject to investor selling on fear of war. Indonesia : Southeast Asia's biggest economy isn't exactly doing poorly. It's a bottom 5 country despite a near 20 percent gain last year. If you believe that materials and energy will do well in 2018, this could be a good pick. Oil, natural gas, rubber, plywood, tin and rice are just a few of the products it exports. Yet there are a few things to keep in mind.\nThis strategy is based on back-testing. We all know — or should know — the classic investment performance caveat: Past performance is no guarantee of future results.\nThis strategy is deeply contrarian. This is for investors who have a high risk tolerance or for those who allocate only a small portion of their portfolio to it.\nI think it works because investors sold their holdings in these markets when the news was bad, which translates into potential upside when investors realize these countries are probably not going to disappear. In other words, this is a gutsy way to go international, but it's what I'll do because I trust my work and because I feel it's often best to go where others have left.\n— By Mitch Goldberg, president of ClientFirst Strategy", "external_links": [], "published": "2018-01-18T16:42:00.000+02:00", "crawled": "2018-01-18T17:02:01.000+02:00", "highlightTitle": ""}