{"organizations": [], "uuid": "9d14fec7c0757f859c6b59e31e9051d4e0249e3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://app.feed.informer.com/digest3/VLZEFJTITH.atom", "section_title": "World News Review", "url": "https://www.reuters.com/article/us-kosovo-teargas-verdict/four-kosovo-mps-get-suspended-jail-terms-for-tear-gas-protest-idUSKBN1ES16C", "country": "US", "domain_rank": 408, "title": "Four Kosovo MPs get suspended jail terms for tear gas protest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T16:13:00.000+02:00", "replies_count": 0, "uuid": "9d14fec7c0757f859c6b59e31e9051d4e0249e3f"}, "author": "", "url": "https://www.reuters.com/article/us-kosovo-teargas-verdict/four-kosovo-mps-get-suspended-jail-terms-for-tear-gas-protest-idUSKBN1ES16C", "ord_in_thread": 0, "title": "Four Kosovo MPs get suspended jail terms for tear gas protest", "locations": [], "entities": {"persons": [{"name": "albin kurti", "sentiment": "none"}, {"name": "beqir kalludra", "sentiment": "none"}], "locations": [{"name": "kosovo", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "montenegro", "sentiment": "none"}], "organizations": [{"name": "fatos bytyci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 2:14 PM / Updated 3 minutes ago Four Kosovo MPs get suspended jail terms for tear gas protest Fatos Bytyci 2 Min Read \nPRISTINA (Reuters) - Four Kosovo opposition lawmakers were handed suspended jail terms of between 15 and 18 months on Wednesday for obstructing parliamentary work by releasing tear gas in the chamber. \nOpposition parliamentarians impeded parliament for almost two years by letting off tear gas in the chamber in 2015 and 2016 in protest against a border deal with Montenegro and an EU-brokered agreement with Serbia. \n“They have broken the law by using weapons or dangerous instruments,” judge Beqir Kalludra said as he read the verdict, referring to the leader of the biggest opposition party Vetevendosje, Albin Kurti, and three other party members. \n“The defendants will not go to jail if they do not repeat any other offence in the next two years,” he said. \nNone of the defendants, who include two women, were present at the reading of the verdict. They had repeatedly said the court was under the influence of politicians. \nAnother 11 lawmakers face the same charges and are awaiting verdicts. \nKosovo’s government says the border accord with Montenegro is an important condition for its citizens to eventually benefit from a visa-free travel regime with the European Union. \nBut Vetevendosje, which became the single biggest party in the parliament after June elections, opposes the deal. They say that by ratifying the agreement, Kosovo would hand over some 8,000 hectares (19,700 acres) of its land to Montenegro. \nThe party also opposes a 2013 EU-brokered deal between Serbia and Kosovo that gives more autonomy to Kosovo’s Serb minority. \nIn November last year another party member was sentenced to eight years in jail for taking part in a grenade attack on the parliament building in 2016. \nKosovo declared independence from Serbia in 2008, nearly a decade after NATO bombing drove Serb forces from the territory. Reporting by Fatos Bytyci; Editing by Ivana Sekularac, Editing by William Maclean", "external_links": [], "published": "2018-01-03T16:13:00.000+02:00", "crawled": "2018-01-03T16:20:50.006+02:00", "highlightTitle": ""}