{"organizations": [], "uuid": "42352454fec9eebc7a56744a583b5984fdc55181", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220879337&w=1200&r=LYNXMPEE0916V", "site_section": "http://dede-indra.blogspot.com/feeds/posts/default", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-courtsecrecy-harassment/how-courts-help-companies-keep-sexual-misconduct-under-cover-idUSKBN1EZ26S", "country": "US", "domain_rank": 408, "title": "Special Report: How courts help companies keep sexual misconduct under cover", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T18:54:00.000+02:00", "replies_count": 0, "uuid": "42352454fec9eebc7a56744a583b5984fdc55181"}, "author": "", "url": "https://www.reuters.com/article/us-usa-courtsecrecy-harassment/how-courts-help-companies-keep-sexual-misconduct-under-cover-idUSKBN1EZ26S", "ord_in_thread": 0, "title": "Special Report: How courts help companies keep sexual misconduct under cover", "locations": [], "entities": {"persons": [{"name": "renee dudley", "sentiment": "none"}, {"name": "cathy sellars", "sentiment": "none"}, {"name": "cristina chen-oster", "sentiment": "none"}, {"name": "dan levine", "sentiment": "none"}, {"name": "benjamin lesser", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "mit", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Cristina Chen-Oster, a senior salesperson in Goldman Sachs’s convertible bonds department, was a few years out of MIT when a male colleague pinned her against a wall, kissed her, groped her and tried to engage in a sexual act, she said in a lawsuit in federal court. After reporting the incident to her boss, the lawsuit alleged, she missed out on pay and promotions while her accused attacker steadily rose through the ranks.\nCathy Sellars, a 59-year-old mother of two adult children, was training to become a truck driver for freight hauler CRST when she complained to her bosses about repeated sexual harassment by male colleagues, according to a class action lawsuit against the company. Her complaints ignored, she says in court records, she eventually found herself in a truck cab with a male driver who pulled a knife on her after she rebuffed his sexual advances. He then refused to allow her to exit the truck during a trip through the southwest and held her for several hours, she said.\nAnd Sebastian Kelly, a gay driver for an ambulance company in Alabama, said in a lawsuit that he worked in a sexually charged atmosphere, where two male co-workers routinely exposed their genitalia.\nNews headlines of late have focused on sexual harassment accusations against movie mogul Harvey Weinstein, former Today show anchor Matt Lauer, former U.S. Senator Al Franken and other media figures, entertainers and politicians. In each case, the accusers say they waited years to confront the men who accosted them, most of them too ashamed or fearful to complain publicly or persuaded to keep quiet by tactics meant to suppress the truth.\nBut these three plaintiffs, and many like them, chose to confront their alleged abusers and hold the companies they work for accountable in public court. Rather than opening the incidents to full public scrutiny, however, judges let companies push the legal boundaries of what should be considered confidential and to keep details of abusive behavior secret.\nA Reuters review of federal court cases filed between 2006 and 2016 revealed hundreds containing sexual harassment allegations where companies used common civil litigation tactics to keep potentially damning information under wraps. Plaintiffs in some cases say companies sought to conceal internal documents that reveal similar harassment claims, as well as corporate policies that favored abusers over victims.\nIn one case, plaintiff lawyers collected secret evidence about alleged criminal behavior, including details of a pharmaceutical saleswoman who alleged a doctor sexually assaulted her at a work-related event. Her supervisor admitted to giving a sheriff’s detective false information about the allegations, court records show.\nTHE COST OF SECRECY The true number of such cases is likely much greater than the hundreds identified by Reuters. Federal courts categorize sexual harassment within a larger group of gender discrimination claims, which makes a full accounting difficult. In addition, many sexual harassment cases are filed in state courts. Reuters focused its review on the federal courts because records are more accessible and consistent.\nAs a result of the sealed documents, cases that could shine light on specific abusers, or on toxic corporate cultures, do the opposite: They enable the very secrecy and corporate complicity that allow sexual harassment to persist in the workplace.\nShira Scheindlin, a former Manhattan federal judge, said judges should make public human-resources complaints that result in employee discipline.\n“Otherwise, you get the serial abuser just doing it at the next job,” said Scheindlin, who currently heads the American Bar Association’s federal courts subcommittee and whose private practice includes advising companies on handling sexual harassment complaints. “If that record had been available, there would have been no next job.”\nU.S. District Judge Charles Breyer said courts are going too far in routinely sealing such cases. Documents filed in federal court are presumed to be public, he said, so people can understand how the judiciary works. Companies should not be allowed to cloak evidence just because it is damaging, said the judge, based in San Francisco. That goes not only for sexual harassment but also for broader corporate governance issues.\n“It’s hard to see why their private interests to avoid embarrassment trumps the public’s right to have access to litigation,” Breyer said.\nCompanies say they have good reason to seek broad protective orders. They frequently argue that their internal documents contain unproven allegations that shouldn’t be public, or sensitive business information that could aid a competitor. Plaintiff attorneys say they often agree to protective orders and motions to seal information from public disclosure because fighting over public access can increase the length and cost of a lawsuit.\nMany judges, meanwhile, are reluctant to enforce transparency when neither side has requested it, according to several current and former federal judges.\n“I don’t think any judge is presumptively hostile to the idea of disclosure,” Breyer said. “We may be presumptively hostile to doing more work. I’m speaking for myself.”\nMost civil cases settle before they can be publicly aired before a jury. That means the pre-trial secrecy allows companies to permanently conceal information about their sexual harassment policies and how they respond to specific complaints of abuse.\nA broad protective order in the ongoing lawsuit by Chen-Oster and three other women against Goldman has allowed the Wall Street giant to keep hundreds of documents under wraps for three years.\nAsked about the secrecy, a Goldman spokesperson told Reuters the firm keeps details private because it promises employees confidentiality when they report concerns. The spokesperson would not discuss the specific allegations raised by Chen-Oster and the other plaintiffs.\nIn court documents, the company acknowledges that Chen-Oster told her boss about the contact with her co-worker and that the supervisor contacted Goldman’s human resources department about it. Chen-Oster, the company says in court filings, did not want to pursue a human resources complaint.\nThe protective order permitted lawyers on either side to mark any document exchanged in discovery as confidential, thus barring anyone from disclosing it outside the case. Such orders have become standard to ensure secrecy during the pre-trial evidence discovery phase in U.S. civil litigation.\nThere are no nationwide standards on what information should be sealed when discovery documents are later filed in court. Several federal appeals courts recognize that trade secrets, sensitive financial data, or personal information like Social Security Numbers can remain secret. When it comes to allegations of misconduct, some case law allows information that would intrude on an individual’s privacy to be kept secret. But it is left to judges to decide if someone’s privacy outweighs the public’s interest in disclosure.\nInitially, Chen-Oster’s lawyers agreed to the protective order, but later, when they sought to broaden the case, they took the rare step of arguing that many documents filed in court should be made public.\nAdam Klein, one of her lawyers, said plaintiff", "external_links": [], "published": "2018-01-10T18:54:00.000+02:00", "crawled": "2018-01-10T18:59:42.020+02:00", "highlightTitle": ""}