{"organizations": [], "uuid": "fbbf51f633c5d4bff49a3890ffac893a0ed7d2f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cigarbox.net/feed", "section_title": "The Cigarbox", "url": "https://www.cnbc.com/2018/01/25/the-associated-press-17-universities-oppose-anti-smoking-group-with-tobacco-ties.html", "country": "US", "domain_rank": 767, "title": "17 universities oppose anti-smoking group with tobacco ties", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T19:01:00.000+02:00", "replies_count": 0, "uuid": "fbbf51f633c5d4bff49a3890ffac893a0ed7d2f0"}, "author": "Google", "url": "https://www.cnbc.com/2018/01/25/the-associated-press-17-universities-oppose-anti-smoking-group-with-tobacco-ties.html", "ord_in_thread": 0, "title": "17 universities oppose anti-smoking group with tobacco ties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "17 universities oppose anti-smoking group with tobacco ties By COLLIN BINKLEY, Associated Press Published 4 Hours Ago The Associated Press \nBOSTON (AP) — Seventeen public health schools in the U.S. and Canada pledged Thursday to refuse research money from a new anti-smoking group funded by the tobacco industry. \nThe Foundation for a Smoke-Free World was created in September with nearly $1 billion from the Philip Morris tobacco company, saying it aims to end smoking worldwide and support research to meet that goal. \nBut deans of public health schools at Harvard, Johns Hopkins and other universities said the group is too closely tied to an industry that sells deadly products to millions. \n\"The idea of taking money that's from the tobacco industry is just antithetical to everything we do,\" said Karen Emmons, dean for academic affairs at Harvard's public health school. \"Philip Morris in particular has focused very hard to undermine the strategies that we know will reduce smoking rates.\" \nOfficials at the New York-based foundation and at Philip Morris, maker of Marlboro and other cigarette brands, did not immediately respond to a request for comment. \nThe foundation has yet to issue research grants but said it has received draft proposals and will make funding decisions after a series of meetings scheduled to be held in February. \nA statement signed by the 17 deans and first released to The Associated Press says that if Philip Morris wants to end smoking, it should stop selling and advertising cigarettes. \n\"Further, both the tobacco industry and Philip Morris International have a long history of funding 'research' in ways meant to purposely confuse the public and advance their own interests,\" the letter says. \nOthers signing the pledge include leaders of public health schools at Florida International University, the University of Minnesota, Ohio State University and Tulane University in New Orleans. \nThe foundation said it will pay for research that helps smokers quit, helps tobacco farmers find other livelihoods and develops \"reduced-risk\" alternatives to traditional cigarettes. \nBut some critics fear the foundation will try to produce research promoting some of those alternatives, including a new electronic device called the iQOS (pronounced EYE'-kose) that Philip Morris hopes to market in the U.S. \n\"This strategy fits into their business model,\" said Emmons, at Harvard. \"But right now we don't really know if these alternatives are safer. There just isn't the evidence base.\" \nAfter the foundation was announced Sept. 13, it quickly drew scorn from the World Health Organization, which says it won't work with the group and accused it of having \"a number of clear conflicts of interest.\" \nDerek Yach, chief of the foundation and a former executive of the World Health Organization, responded in a letter insisting that the group is \"fully insulated\" from industry influence. \nBut leaders of the public health schools questioned the group's independence, writing that its money is \"equivalent to funding from the tobacco industry.\" \n\"There is a fundamental contradiction in what they are doing,\" said Dr. Pierre Buekens, dean of Tulane's public health school. \"Until we know more, we are not prepared to accept funding from the foundation.\" \nAmid the debate, the U.S. Food and Drug Administration says it's working on a new plan that would drastically cut nicotine levels in cigarettes so they would essentially be non-addictive. For those who don't quit, the plan would allow lower-risk products that deliver nicotine without the deadly effects of combustible cigarettes. \nEllen MacKenzie, dean of Johns Hopkins University's public health school, said the possibility of forthcoming regulation makes it even more important for schools to be cautious about funding sources. \n\"This an especially critical time for tobacco control efforts,\" said MacKenzie, who organized the statement from the public health schools. \"Thoughtful, independent academic research will be essential to guide policy.\" \nFollow Collin Binkley on Twitter at @cbinkley. Related Securities", "external_links": [], "published": "2018-01-25T19:01:00.000+02:00", "crawled": "2018-01-26T00:23:52.016+02:00", "highlightTitle": ""}