{"organizations": [], "uuid": "a11b26f30763ae9a230f27b91d2c1a825f8a079e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/21/102852380-459883166.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/biogen-buys-brain-drug-for-217-million-but-must-go-bigger-analyst.html", "country": "US", "domain_rank": 767, "title": "Biogen buys a brain disorder drug for $217 million, but needs to go bigger, analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T19:44:00.000+02:00", "replies_count": 0, "uuid": "a11b26f30763ae9a230f27b91d2c1a825f8a079e"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/biogen-buys-brain-drug-for-217-million-but-must-go-bigger-analyst.html", "ord_in_thread": 0, "title": "Biogen buys a brain disorder drug for $217 million, but needs to go bigger, analyst says", "locations": [], "entities": {"persons": [{"name": "suzanne kreiter", "sentiment": "negative"}, {"name": "porges", "sentiment": "none"}, {"name": "geoffrey porges", "sentiment": "none"}], "locations": [{"name": "mass", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "getty images employees", "sentiment": "negative"}, {"name": "biogen", "sentiment": "negative"}, {"name": "boston globe", "sentiment": "negative"}, {"name": "celgene", "sentiment": "none"}, {"name": "karyopharm therapeutics", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "leerink partners", "sentiment": "none"}, {"name": "sanofi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Suzanne Kreiter | The Boston Globe | Getty Images Employees at Biogen in Cambridge, Mass. \nBiogen shares briefly rose 3 percent Thursday after the U.S. drugmaker reported better-than-expected quarterly revenue and an upbeat 2018 forecast. \nThe Massachusetts-based biotech company also said it agreed to buy an experimental brain disorder drug for up to $217 million, a notable purchase as some on Wall Street speculate whether the company could be near an even larger deal. \n\"Biogen most definitely needs to do another deal, optimally a large one\" as biotech deals heat up, Geoffrey Porges, a senior biotech analyst at Leerink Partners, told CNBC. \nRecent acquisitions by Celgene and Sanofi have prompted some hopes there could be a pickup in mergers and acquisitions activity in the biotech sector, analysts say. \nPorges sees potential acquisition candidates for something in the range of $3 billion to $ 15 billion. \n\"They could lever up significantly and already have substantial cash reserves,\" he said. \nUnder the deal announced Thursday, Karyopharm Therapeutics, which makes the early stage drug to treat neurological and inflammatory conditions, will receive a one-time upfront payment of $10 million from Biogen, and up to an additional $207 million in milestones, plus tiered royalty payments on potential sales of the drug. \nIn its fourth-quarter results, Biogen reported revenue of $3.31 billion, above the $3.1 billion expected from analysts polled by Thomson Reuters. \nRevenue was boosted by sales of its spinal muscular atrophy drug Spinraza, which contributed a 15.3 percent increase in the company's revenue. \nHowever, earnings came in 19 cents below Wall Street estimates at $5.26 per share. \n\"It was a pretty clean quarter,\" Salim Syed, a senior biotech analyst at Mizuho Securities, told CNBC. \"Fundamentally the drug did OK this quarter.\" \nBiogen expects further success from its key multiple sclerosis drugs. \n\"Our core MS business demonstrated resilience in an increasingly competitive market, and Spinraza has had one of the most successful rare disease launches of all time,\" Biogen CEO Michel Vounatsos said in an earnings release. \nBiogen said it expected 2018 adjusted earnings to be between $24.20 and $25.20 a share, above estimates. Revenue for 2018 is projected to come in between $12.7 billion to $13 billion. Analysts expect $12.7 billion.Biogen did not immediately respond to a request for comment. Morning Squawk: CNBC's before the bell news roundup \nSign up to get Morning Squawk each weekday Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit", "external_links": [], "published": "2018-01-25T19:44:00.000+02:00", "crawled": "2018-01-25T19:47:12.001+02:00", "highlightTitle": ""}