{"organizations": [], "uuid": "1ce0d3715b3c54efc199f0e922ac2ae32980b593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934701-V1_makeit_01052018_yardcars_BCM.00_03_53_26.Still004.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/ron-sturgeon-sold-salvage-company-aaa-small-car-world-for-millions.html", "country": "US", "domain_rank": 767, "title": "This Texas man went from living in a trailer to selling a business for $23 million", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T16:11:00.000+02:00", "replies_count": 0, "uuid": "1ce0d3715b3c54efc199f0e922ac2ae32980b593"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/ron-sturgeon-sold-salvage-company-aaa-small-car-world-for-millions.html", "ord_in_thread": 0, "title": "This Texas man went from living in a trailer to selling a business for $23 million", "locations": [], "entities": {"persons": [{"name": "ron sturgeon", "sentiment": "negative"}, {"name": "sturgeon", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For Ron Sturgeon, a pile of rusty, broken down cars isn't trash. It's a gold mine.\n\"What one man might call junk, I call treasure,\" he says on CNBC's Blue Collar Millionaires . \nSalvaging parts from wrecked automobiles is a business that has made Sturgeon rich, or to be exact, \"filthy rich,\" he says on the show. \n\"When you can pay $100 for a junk car, sell the engine out of it for $150 and still have the rest of the car, that is pretty good business,\" he explains. \nCNBC | Blue Collar Millionaires Wealth was new to Sturgeon. As a young person, he had been nearly homeless. \n\"When I was a senior in high school, my dad died and left me a '65 Volkswagen, $2,000 and no place to live,\" Sturgeon says. \"I moved into a mobile home and started working on other people's Volkswagens. That was all I knew, I had to do something to eat.\"\nAs he was repairing vehicles, he realized a different business model would be more lucrative. \n\"I accumulated about 35 junk cars that we were using to fix the other cars,\" he explains. \"Within weeks, I realized that I could make more money selling parts off the cars than I ever could working on them. Every week I would go to the salvage auction and buy a few more cars, drag them in, and we would sell a few more parts.\"\nSturgeon founded his salvage business, AAA Small Car World in 1978, and over the next two decades, his business boomed: \"We grew to six locations, 150 employees and $15 million in sales with a 30 percent net profit,\" he says.\nFord acquired the business in 1999 for about $15 million, according to \"Blue Collar Millionaires.\" But Sturgeon says the auto giant had trouble operating it.\n\"In the long run, it was a terribly bad fit for Ford,\" Sturgeon says on the show. \"They ended up divesting the division, selling it back to me.\"\nIn 2003, Sturgeon bought his business back from Ford. Just two years later, after working to re-structure the company's finances, Sturgeon sold it again to Schnitzer Industries for $23.5 million, Dallas News reports.\nSturgeon, who says he had no formal business training, achieved his success with the help of one important habit: reading.\n\"I read the Wall Street Journal every day for 25 years,\" Sturgeon tells CNBC Make It. \nIf you want to see dollars piling up in your bank account, he advises following suit. \n\"My advice is read a minimum of one book a month,\" he says. \"Even today, I still read voraciously.\"\nTwo books in particular — \" Customers for Life ,\" by Carl Sewell, and \" Secrets of the Millionaire Mind ,\" by Harv Eker — gave him footing during his early career. That, and hard work.\n\"I don't think there is anything unusual about me, I'm not a prodigy. I didn't do better than anybody else in high school,\" he says. \"I think I'm smart from learning a lot through the years.\"\nStill, he hasn't forgotten the feeling of not having a bed to sleep in. \nSturgeon, who is now in commercial real estate, offered up his two mansions in Colleyville, Texas to families whose homes were destroyed during a 2015 tornado, according to CBS DFW. \n\"A light bulb just went off in my head that I've got these two big houses sitting vacant, surely I could help somebody that would need housing,\" he tells the local CBS station .\nToday, Sturgeon is certainly comfortable — he tells CNBC Make It he bought himself a $1.5 million Bugatti Veyron for Christmas, although he adds that he opted for a used model — but he's still focused on learning and living new experiences. \n\"I'm loving life,\" he says. \nDon't miss: This former Texas cop turned $5,000 into a multimillion-dollar business cleaning up crime scenes \nLike this story? Like CNBC Make It on Facebook \nshow chapters This man is making millions from cleaning radioactive waste and infectious fluids      11:50 AM ET Thu, 30 Nov 2017 | 01:15", "external_links": [], "published": "2018-01-18T16:11:00.000+02:00", "crawled": "2018-01-18T16:34:46.013+02:00", "highlightTitle": ""}