{"organizations": [], "uuid": "9b599dc323e463dc1b0fd27a0e7d7314a7436fe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/24/102861824-GettyImages469308988.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/amazon-will-no-longer-ask-job-applicants-to-provide-their-salary-history.html", "country": "US", "domain_rank": 767, "title": "Amazon will no longer ask job applicants to provide their salary history", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T20:13:00.000+02:00", "replies_count": 0, "uuid": "9b599dc323e463dc1b0fd27a0e7d7314a7436fe5"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/amazon-will-no-longer-ask-job-applicants-to-provide-their-salary-history.html", "ord_in_thread": 0, "title": "Amazon will no longer ask job applicants to provide their salary history", "locations": [], "entities": {"persons": [{"name": "philippe huguen", "sentiment": "negative"}, {"name": "miriam clark", "sentiment": "none"}, {"name": "david ryder", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "getty images an amazon", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "institute for women's policy research", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "getty images  labor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Several states and cities including California, New York and Philadelphia have passed laws which prohibit employers from asking job candidates about their salary history . Now, Amazon, one of the largest employers in the country, will also ban this controversial question .\nAn Amazon spokesperson tells BuzzFeed News , \"We think this is the right thing to do for our current and future employees.\"\nPolicies like these are intended to address cycles of income inequality that can be perpetuated when compensation is based primarily on a candidate's salary history. For instance, a hiring manager may offer a candidate a lower salary than the job was intended to pay simply because they were paid less — or unfairly — in the past.\nDavid Ryder | Getty Images Labor and employment lawyer Miriam Clark tells CNBC Make It , \"There's a cycle of gender pay inequity that's been going on for as many years as anyone's been measuring compensation by gender.\"\nAccording to the Institute For Women's Policy Research , women on average are paid 20 percent less than their male counterparts performing the same job. It's even worse for women of color. Latina women are paid 46 percent less than white men, and African-American women are paid 37 percent less.\nBuzzFeed News reports that on Tuesday, Amazon posted a message on an internal company message board that instructed hiring managers not to ask prospective hires about their salary history.\nAmazon recruiters can no longer \"directly or indirectly ask candidates about their current or prior base pay, bonus, equity compensation, variable pay or benefits\" or \"use salary history information as a factor in determining whether or not to offer employment and what compensation to offer a candidate.\" This includes information gathered from sites like LinkedIn Recruiter.\nshow chapters Amazon's first employee shares what he learned from Jeff Bezos 12:18 PM ET Thu, 26 Jan 2017 | 00:53 The rule applies to candidates for all positions, including salaried employees and hourly workers. Amazon currently employs over 500,000 workers, many of whom are hourly workers in distribution centers and call centers.\nThe online retailer is not the first tech company to ban recruiters from asking this question. Facebook and Google also report that they've stopped asking about compensation history, but many other employers are not as restrained.\nIf you are asked this question in a state or city where it is illegal Merrick Rossein , lawyer and professor at the City University of New York School of Law, suggests that applicants say something like, \"Pardon me if I'm wrong, but it's my understanding that that question isn't legal here. However, I'm very interested in this job and would be happy to discuss compensation ranges and goals.\"\nIf you live in an area where employers are legally permitted to ask this question you really only have two options: offer a general range or be completely transparent.\nshow chapters Suzy Welch: Here's the best answer to 'What's your current salary?' 8:56 AM ET Wed, 9 Aug 2017 | 01:42 Career coach Nicole Hill Orisich says that candidates should say something to the effect of, \"I'd love to talk about the value I bring to the table as well as the market value for this position. Based on my own research for someone with my skills in this industry, I believe my market rate is somewhere between X and Y. I would be happy with something in this range.\"\nBestselling management author and CNBC contributor Suzy Welch suggests a different strategy.\n\"People are going to tell you that you should game this conversation. You should dodge this question by talking about ranges,\" she says. \"That is no way to start a relationship.\"\nOnce you have done your research, know how much the position typically pays and understand how much you are really worth, Welch says candidates should be candid and what they make. Hopefully, the recruiter will return your honesty with respect.\n\"If your potential employer games you in this conversation, it's a warning sign,\" she says. \"Don't ignore it.\"\nLearn more about this infographic at Visual Capitalist .\nLike this story? Like CNBC Make It on Facebook\nDon't miss:\nMeet the 5 people Bill Gates calls 'heroes' 10 cities with amazing job opportunities right now Jeff Bezos donated $33 million to pay 'dreamers'' tuition. Here are 8 other CEOs who've spoken up show chapters This is how much education you need to land a job at the world's biggest tech companies 1:26 PM ET Wed, 26 July 2017 | 00:56", "external_links": [], "published": "2018-01-19T20:13:00.000+02:00", "crawled": "2018-01-19T20:27:30.000+02:00", "highlightTitle": ""}