{"organizations": [], "uuid": "8b084a39ceed1411841db0f0fcd50d62d0ed3a6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/29/102134029-bubble-burst.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/bitcoin-to-central-banks-managing-market-risk-in-2018-ubs-commentary.html", "country": "US", "domain_rank": 767, "title": "From bitcoin to central bankers, here’s how to manage market risk in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:28:00.000+02:00", "replies_count": 0, "uuid": "8b084a39ceed1411841db0f0fcd50d62d0ed3a6a"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/bitcoin-to-central-banks-managing-market-risk-in-2018-ubs-commentary.html", "ord_in_thread": 0, "title": "From bitcoin to central bankers, here’s how to manage market risk in 2018", "locations": [], "entities": {"persons": [{"name": "mark haefele", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ubs wealth management published 30 mins ago shares jason way photography", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In 2018, investors can expect another year of respectable economic growth, higher corporate profits, and rising equity markets. But there are rising risks. To help investors negotiate the shifting investment landscape we offer our portfolio tips for the coming year:\nNavigating the end of easy money : The last quarter of 2018 will be the first time since the financial crisis when central banks are, in aggregate, withdrawing liquidity from global markets – the so-called end of easy money. The scale of the withdrawal is small relative to the stimulus, so we don't expect a hit to equity markets. But such policy turning points can see correlations rise in the movements of asset classes like equities and bonds, increasing portfolio volatility. Diversification into less-correlated alternatives, including hedge funds, could help.\nPosition for the return of active management : Market dynamics are starting to favor investors looking to take advantage of specific opportunities. Correlations between S&P 500 stocks recently fell to a 16-year low, meaning that stocks are increasingly being driven by their own fundamentals, rather than by moves in the overall market. The dispersion in valuation between the cheapest and most expensive stocks is also now well above its average since 1991, providing more opportunities for investors or managers seeking value in stocks.\nTurn off the 24 hour news: 2018 will bring more political flux, with March elections in Italy an early focal point. But investors should not get too caught up in the news cycle. In general, we believe that the impact of domestic politics on global markets is overestimated. While politics can have a negative effect on local markets, this can be mitigated by diversification. And the cost of being under invested over the long-term is much greater.\nRide the bumps: Over trading is another risk. Whether returns are positive or negative in the very short-term is largely down to chance. And our own analysis of mutual fund investors' buy and sell decisions indicates those who turned over their portfolios under performed by 0.9 percent annually compared with a buy and hold strategy, between April 2007 and March 2016.\nKeep some insurance: In our base case we don't expect flashpoints on the Korean Peninsula or in the Middle East to escalate to the extent that they disrupt markets. But it's worth holding at least some high-quality bonds in your portfolio, even if expected returns are low (or even negative in some currencies), just in case. They could prove a safe haven and help shield portfolios from losses. Exact percentage holdings will depend on individual investors' requirements, but they shouldn't be tempted to sell all high-quality bonds at this stage in favor of stocks.\nGet on the right side of technology: Tech firms accounted for 23 percent of S&P 500 earnings in the last reporting quarter, up by 5 percentage points in three years, and tech is now the largest sector in the MSCI Emerging Market and MSCI China indices. We see particular opportunities in digital data, automation and robotics, and smart mobility, which should benefit from secular trends such as population growth, aging, and urbanization. Meanwhile, avoiding the sectors at risk of disruption will be key. Recall that the entire US food retail sector fell by more than 10 percent in the week of Amazon's purchase of Whole Foods. The automotive and non-food retail sectors face particular risks.\nAvoid frenzies like cryptocurrencies: Getting on the right side of tech doesn't mean jumping into the latest investment mania. Bitcoin's 1600 percent price gain in 2017 was driven in part by FOMO, the fear of missing out on the next new thing. But it has all the hallmarks of a speculative bubble. Predicting the peak is difficult, but all bubbles tend to result in the same thing – a transfer of wealth from the many to the very fortunate few who got out at the right time.\nThink about sustainability: There is now strong evidence that incorporating social responsibility as part of the investment decision-making process does not sacrifice returns. Over the past 25 years the returns on the MSCI KLD 400 Social index has performed in line with the S&P 500, while Barclays MSCI Green Bond index has performed in line with the equivalent investment grade bond index since inception in 2013. So those making a New Year's Resolution to make a difference in 2018 can think about doing so with their portfolio, while still aiming for market returns.\nCommentary by Mark Haefele, global chief investment officer at UBS Wealth Management, overseeing the investment strategy for $2 trillion in invested assets. F ollow him on Twitter @UBS_CIO .\nFor the latest commentary on the markets in the U.S. and around the world, follow @cnbcopinion on Twitter.", "external_links": [], "published": "2018-01-12T15:28:00.000+02:00", "crawled": "2018-01-12T15:59:57.048+02:00", "highlightTitle": ""}