{"organizations": [], "uuid": "aa93698a1c27d049da646103977366881778cbbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104949234-GabbyBernsteinGetty.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/gabby-bernstein-how-to-unfollow-your-way-to-success-and-happiness.html", "country": "US", "domain_rank": 767, "title": "'Unfollow' your way to a better, happier life, suggests guru Gabby Bernstein", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T18:17:00.000+02:00", "replies_count": 0, "uuid": "aa93698a1c27d049da646103977366881778cbbc"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/gabby-bernstein-how-to-unfollow-your-way-to-success-and-happiness.html", "ord_in_thread": 0, "title": "'Unfollow' your way to a better, happier life, suggests guru Gabby Bernstein", "locations": [], "entities": {"persons": [{"name": "gabby bernstein stefanie keenan", "sentiment": "negative"}, {"name": "oprah", "sentiment": "none"}, {"name": "gabby", "sentiment": "none"}, {"name": "gabby bernstein", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Though she's a guru who with a cult following who has been featured on Oprah and The Dr. Oz Show, Gabby Bernstein says she still suffers from judging others. That bad habit has made one of the most prominent self-help gurus in America right now unhappy and damaged relationships with those closest to her.\nNow that she's identified judgment as an obstacle in her life, though, she has set out to learn how stop through a step-by-step process, one she discusses in her new book, \" Judgment Detox: Release the Beliefs That Hold You Back from Living A Better Life .\" \nShe talks to CNBC Make It about the most common belief that holds people back from achieving their full potential and outlines 5 steps to take to stop judging others.\nDetox In order to heal from her never-ending cycle of judgment, Gabby fearlessly committed to going through a detox. In the process, she learned that, when we judge other people, it's often deeply personal and not about the other people at all. \"Whatever we resent or dislike in another person is a reflection of something we dislike in ourselves or a representation of a deep wound that we're unwilling to heal,\" she said.\nWhile judging others often feels natural and gives us a quick high, the hangover is painful. As Gabby puts it, \"Judgment lowers our energy and weakens us physically and mentally. It makes us feel alone and cut off from inspiration and love.\"\nSometimes, in order to remove judgment, we need to look at all of our fears and bring them to light. By removing the negative feelings and toxins that judging others creates, you can form better relationships with others.\nshow chapters Here's how successful people de-stress      1:20 PM ET Thu, 23 Feb 2017 | 00:48 Recognize your potential Gabby believes that the most common belief that holds people back from realizing their full potential is the idea that \"I'm not good enough.\"\nIt's an easy excuse to say that we don't deserve a business opportunity or relationship. In most cases, this belief only exists in our heads, yet it prevents us from moving forward with our lives. \"We play small, we attack back and we even turn to addictive behavior to anesthetize the feeling,\" she says.\nCommit to positive results Through her healing process, Gabby was determined to see change. \"My commitment to healing my own relationship to judgment has changed my life in profound ways,\" she says. Commitment helped her become a more mindful and conscious person and to let go of resentments and jealousies.\nNow, instead of being in pain, she has forgiven others and has a healthy relationship with judgment.\nBe generous \"Want for others what you want for yourself,\" says Gabby, and help others, in part because you end up being helped, too. We feel better about our own situation when we are generous with those around us, at work or at home.\n\"Celebrate the success of others and you will become a magnet for what you desire,\" she says. When you do someone a favor, people will see you more positively and you will feel good about yourself at the same time.\nUnfollow anyone who makes you unhappy \nThe more we compare our lives with others in our social media feeds, the more depressed we become. That's why Gabby recommends that we only follow people on social media that inspire us. Unfollow those who bring you down and make your lives toxic and instead follow only those who make you smarter and better.\nDan Schawbel is a partner and research director at Future Workplace and New York Times bestselling author of \"Promote Yourself\" and \"Me 2.0.\" Follow him on Twitter @DanSchawbel .\nLike this story? Like CNBC Make It on Facebook \nDon't miss: 8 small things people use to judge your personality \nshow chapters This one ancient trick will make you a better decision maker      7:28 AM ET Wed, 4 May 2016 | 01:56", "external_links": [], "published": "2018-01-17T18:17:00.000+02:00", "crawled": "2018-01-17T18:31:08.005+02:00", "highlightTitle": ""}