{"organizations": [], "uuid": "303eb22723cdcda5e979d27a582fd88a166c7a4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/29/103979797-GettyImages-159544772.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/its-been-a-bad-flu-season-but-heres-how-you-can-prevent-it-from-getting-worse.html", "country": "US", "domain_rank": 767, "title": "It's been a bad flu season, but here's how you can prevent it from getting worse", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T23:56:00.000+02:00", "replies_count": 0, "uuid": "303eb22723cdcda5e979d27a582fd88a166c7a4d"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/its-been-a-bad-flu-season-but-heres-how-you-can-prevent-it-from-getting-worse.html", "ord_in_thread": 0, "title": "It's been a bad flu season, but here's how you can prevent it from getting worse", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Modern Medicine It's been a bad flu season, but here's how you can prevent it from getting worse The flu is widespread across the U.S. right now, with the H3N2 flu dominating, according to the CDC. Some people doubt whether they should get a flu shot during bad years, but doctors and the CDC still overwhelmingly recommend getting one to prevent influenza from spreading more. Hand washing is another way to help avoid getting sick. 3:49 PM ET Thu, 11 Jan 2018 | 03:48 \nTackling the flu is tricky. \nInfluenza is widespread across the U.S. right now, according to data from the Centers for Disease Control and Prevention. The main culprit this season is the H3N2 flu, though others are also circulating. \nH3N2 viruses are often linked to more severe illness and hospitalizations and more deaths, according to the CDC. It can hit children and adults over 65 especially hard, though stories of even healthy people falling sick and dying from influenza have sprouted up across the country. \nWhenever a bad flu season hits, people condemn the shot and wonder if it's even worth getting. In good years, the vaccine can be about 40 to 60 percent effective. This year, the CDC estimates the vaccine will be in the range of 30 percent effective against the predominant H3 viruses. \nNonetheless, doctors and public health officials urge people to remember that some protection is better than none. \n\"This vaccine provides probably your best chance of protecting yourself against the flu, even though it's imperfect,\" said Dr. Paul Offit, professor of pediatrics at the Children's Hospital of Philadelphia. \"There's no downside to the vaccine. It's a safe vaccine.\" \nCreating a vaccine that matches the flu strains that eventually circulate can be challenging.The U.S. Food and Drug Administration meets every February to choose what to put into the year's flu shot based on recommendations from the World Health Organization. They include three or four strains since multiple viral strains can circulate throughout the season. Effectiveness rates of seasonal flu vaccines Year ", "external_links": [], "published": "2018-01-19T23:56:00.000+02:00", "crawled": "2018-01-20T00:52:57.002+02:00", "highlightTitle": ""}