{"organizations": [], "uuid": "9e942e3fabf0acf0f4e3c42bbe60bb06cd6853f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/10/104764417-GettyImages-452960956.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/kkr-warns-about-danger-from-corporate-misconduct-scandals.html", "country": "US", "domain_rank": 767, "title": "Private equity giant KKR warns about investment danger from corporate misconduct scandals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T19:34:00.000+02:00", "replies_count": 0, "uuid": "9e942e3fabf0acf0f4e3c42bbe60bb06cd6853f3"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/kkr-warns-about-danger-from-corporate-misconduct-scandals.html", "ord_in_thread": 0, "title": "Private equity giant KKR warns about investment danger from corporate misconduct scandals", "locations": [], "entities": {"persons": [{"name": "harvey weinstein", "sentiment": "positive"}, {"name": "henry mcvey", "sentiment": "none"}], "locations": [], "organizations": [{"name": "kkr", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The wave of sexual misconduct scandals that has hit the entertainment and corporate worlds in 2017 will have investment repercussions in 2018, private equity giant KKR warned clients.\nInvestors should be on the lookout for companies whose executives get into trouble, the firm said, though it also cautioned that the options to protect against such events are limited.\nOne thing investors can do, though, is use corporate governance criteria and examine companies' history in dealing with personnel issues and harassment allegations. Social media has served as an effective conduit to expose harassment scandals, and will continue to do so, KKR said in its 2018 market outlook.\n\"Without question, social media is not just about reputational issues; the aforementioned concerns can impact a company's bottom line, result in termination of top talent, and otherwise impair brand,\" Henry McVey, head of global macro and asset allocation at KKR, said in a report. \"In this environment, there is no easy hedge; rather, investors must carefully assess company culture, risk management practices, and personnel risks.\"\nMisconduct cases have cut across a wide swath of the business world, a situation that accelerated after multiple women came forward and accused Miramax founder Harvey Weinstein of a pattern of assault that stretched over decades.\nThe allegations quickly spread to politics and corporate board rooms.\nWith victims feeling more empowered to come forward, the issue likely will remain prominent in the year ahead and beyond.\n\"We see multiple dynamics at work,\" McVey sad. \"First, the Internet and social media turn previously powerless individuals with a story to tell into de facto investigative journalists. Second, social media builds community among otherwise random individuals with similar experiences–making it more likely these individuals will tell their stories. Third, social media's immediacy spreads and accelerates these stories at a rapid clip.\"\nThe warning came as part of KKR's broader market forecast. The firm believes the year ahead likely will continue to be positive for risk assets like stocks — the banking sector in particular — though 2019 could bring a \"mean reversion\" that will benefit real assets over financial assets.\nDisclaimer", "external_links": [], "published": "2018-01-11T19:34:00.000+02:00", "crawled": "2018-01-11T19:45:39.015+02:00", "highlightTitle": ""}