{"organizations": [], "uuid": "3670aed0286f14c05237dda5024b1c974b24a5d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104878566-GettyImages-76122702.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/trump-energy-ally-robert-murray-slams-ferc-for-rejecting-coal-subsidy.html", "country": "US", "domain_rank": 767, "title": "Trump ally Robert Murray slams Trump energy appointees for rejecting coal power subsidy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T23:21:00.000+02:00", "replies_count": 0, "uuid": "3670aed0286f14c05237dda5024b1c974b24a5d6"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/trump-energy-ally-robert-murray-slams-ferc-for-rejecting-coal-subsidy.html", "ord_in_thread": 0, "title": "Trump ally Robert Murray slams Trump energy appointees for rejecting coal power subsidy", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "robert murray", "sentiment": "negative"}, {"name": "perry", "sentiment": "none"}, {"name": "kevin mcintyre", "sentiment": "none"}, {"name": "robert powelson", "sentiment": "none"}, {"name": "richard glick", "sentiment": "none"}, {"name": "cheryl lafleur", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "murray energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 05:41 \nWhite House energy ally and coal baron Robert Murray on Wednesday sharply criticized a five-member U.S. commission that regulates energy and includes four Trump appointees. \nThe Federal Energy Regulatory Commission on Monday rejected a rule proposed by Energy Secretary Rick Perry that would have subsidized coal and nuclear power plants in parts of the United States. \n\"That does not sit with me well,\" the chairman and CEO of Murray Energy told CNBC's \"Power Lunch.\" \nThe rule would have benefited power generators that Murray counts as customers, and he has been accused of helping to develop the proposal. \nMurray accused the two Democratic commissioners, Richard Glick and Cheryl LaFleur, of political bias, saying they will never support coal or nuclear power. The two Republicans who voted against Perry's proposal, Chairman Kevin McIntyre and Robert Powelson, \"are wrong in their decision and it needs to be overturned,\" he said. \nFERC is an independent government agency that regulates interstate transport of oil and natural gas and electric power transmission. It has a long-standing reputation as a highly technocratic, non-partisan organization. \nPerry asked FERC in September to create a rule that would compensate plants that keep 90 days of supply on site — primarily coal and nuclear facilities — arguing this so-called baseload energy is necessary to keep the U.S. grid resilient. show chapters 6:50 PM ET Mon, 8 Jan 2018 | 01:05 \n\"There is no ask here for a subsidy for coal,\" Murray said. \"It's to pay the coal-fired generators and the nuclear electricity generators for having the capacity in the grid to keep the lights on.\" \nMurray noted that during the recent \"bomb cyclone\" and cold snap that followed, higher power demand pushed natural gas prices to $175 per million British thermal unit — 60 times their typical level. \nHowever, that statistic is misleading. Prices only spiked to that level in one area of New York, according to Jacob Meisel, chief weather analyst at Bespoke Weather Services. \nPower prices did rise in many parts of the United States, he said, particularly in New England, where there is limited natural gas pipeline capacity. During extreme cold, home heating competes with power plants for natural gas supplies. \nBut in New England, oil-fired plants played a much greater role than coal plants in making up for increased power demand during the cold snap. Oil provided more then 30 percent of power during the period, while coal units supplied 4-6 percent. \nThere were no grid reliability issues during the recent cold spell in PJM Interconnection, which operates the the grid and power markets in 13 Eastern states and Washington DC, according to a spokesperson. \n\"Unit outages across fuel types were manageable and there were sufficient reserves and no emergency procedures needed,\" Susan Buehler, chief communications officer at PJM, told CNBC. \nOn Tuesday, The New York Times published a story on Murray's influence over Trump's energy policy . The report resurfaced accusations by environmental groups that Murray hand-delivered the coal and nuclear subsidy proposal to Perry. \nMurray denies that charge. @SenWhitehouse: MUST READ: This is a very important look into the influence Murray Energy Corporation has over the Trump Administration. Murray Energy made a wish list, and @realDonaldTrump is granting its wishes. \nThe groups pointed to wording in a memo Murray gave to Perry during a meeting in March, first revealed last month in photographs seen by In These Times. The investigative reporting website noted the wording closely resembles text from Perry's proposal to FERC : \nImmediate action needs to be taken to require organized power markets to value fuel security, fuel diversity, and ancillary services that only base load generating assets, especially coal plants, can provide — Murray Energy memo \nImmediate action is necessary to ensure fair compensation in order to stop the imminent loss of generators with on-site fuel supplies, and thereby preserve the benefits of generation diversity and avoid the severe consequences that additional shut-downs would have on the electric grid — Energy Department Grid Resiliency Pricing Rule propsal \nIn a comment to FERC, the environmental groups said another part of Perry's proposal also resembled Murray's memo. \n\"These photographs documenting Murray's request to DOE in language that mirrors the language ultimately used in the Proposal adds to the weight of evidence that the Proposal aims to benefit select companies rather than achieve legitimate statutory aims,\" the groups said. \nMurray responded in a letter to FERC, saying the comment was \"composed solely of lies, mistruths, and reckless and inaccurate speculation.\"", "external_links": [], "published": "2018-01-10T23:21:00.000+02:00", "crawled": "2018-01-10T23:38:08.008+02:00", "highlightTitle": ""}