{"organizations": [], "uuid": "d1857c69f502e56f928408cdc629b6f85cc26b33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 65}, "facebook": {"likes": 310, "shares": 310, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226167387&w=1200&r=LYNXMPEE0S04J", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-japan-cryptocurrency/japan-to-punish-hacked-cryptocurrency-exchange-coincheck-on-monday-idUSKBN1FI06S", "country": "US", "domain_rank": 408, "title": "Japan to punish hacked cryptocurrency exchange Coincheck on Monday", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T04:35:00.000+02:00", "replies_count": 0, "uuid": "d1857c69f502e56f928408cdc629b6f85cc26b33"}, "author": "", "url": "https://www.reuters.com/article/us-japan-cryptocurrency/japan-to-punish-hacked-cryptocurrency-exchange-coincheck-on-monday-idUSKBN1FI06S", "ord_in_thread": 0, "title": "Japan to punish hacked cryptocurrency exchange Coincheck on Monday", "locations": [], "entities": {"persons": [{"name": "coincheck", "sentiment": "none"}, {"name": "sam holmes", "sentiment": "none"}, {"name": "yoshihide suga", "sentiment": "none"}, {"name": "chang-ran kim", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "coincheck inc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "financial services agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:36 AM / in 7 hours Japan raps Coincheck, orders broader checks after $530 million cryptocurrency theft Taiga Uranaka , Thomas Wilson 6 Min Read \nTOKYO (Reuters) - Japanese authorities said on Monday they would investigate all cryptocurrency exchanges in the country for security gaps and ordered Coincheck to raise its standards after hackers stole $530 million of digital money from the Tokyo-based exchange. \nThe theft - one of the world’s biggest cyberheists - highlights the vulnerabilities in trading an asset that policymakers are struggling to regulate, as well as the broader risks for Japan as it aims to leverage the fintech industry to stimulate economic growth. \nThe Financial Services Agency (FSA) on Monday ordered improvements to operations at Coincheck, which on Friday suspended trading in all cryptocurrencies except bitcoin after hackers stole 58 billion yen ($534 million) of NEM coins, among the most popular digital currencies in the world. \nCoincheck said on Sunday it would repay about 90 percent, though it has yet to figure out how or when. \nThe NEM coins were stored in a “hot wallet” instead of the more secure “cold wallet”, which operates on platforms not directly connected to the internet, Coincheck said. It also does not use an extra layer of security known as a multi-signature system. \nThe hack has drawn into focus Japan’s approach to regulating cryptocurrency exchanges. Last year, it became the first country to regulate exchanges at the national level - a move that won praise for boosting innovation and protecting consumers, contrasting sharply with crackdowns in South Korea and China. \nThe FSA said it ordered Coincheck to submit a report on the hack and measures for preventing a recurrence by Feb. 13. \nIt added it would conduct hearings with other exchanges after their operators had run their own checks. If any problems or weaknesses with security were found during the course of the hearings, the FSA would also conduct onsite inspections. \nThe regulator also said it had yet to confirm whether Coincheck had sufficient funds for the reimbursement. \nBut the regulator does not have any rules banning the use of “hot wallets” by exchanges, nor does it set requirements on how much should be kept in “cold wallets,” an FSA official said at a briefing. \nIn response to FSA’s order for improvements, Coincheck said it would promptly strengthen its customer protection and governance and develop its risk management systems. \nJapan started to require cryptocurrency exchange operators to register with the government only in April 2017, allowing pre-existing operators such as Coincheck to continue offering services ahead of formal registration. \nThe FSA has registered 16 cryptocurrency exchanges so far, and another 16 are still awaiting clearance. Coincheck’s application was made in September. \n“It’s been long said that cryptocurrencies are a solid system but cryptocurrency exchanges are not,” said Makoto Sakuma, research fellow at NLI Research Institute. Cryptocurrency exchange Coincheck's signboard is pictured in front of a building where their office is located, in Tokyo, Japan January 29, 2018. REUTERS/Kim Kyung-Hoon \n“This incident showed that the problem has not been solved at all. If Coincheck screws up its crisis management, that could deal a blow to the current cryptocurrency fever.” \nNEM fell to $0.78 from $1.01 on Friday but recovered to $0.95 by Monday evening, according to CoinMarketCap. Crypto-currency related shares mostly rose in Tokyo, with GMO Internet ( 9449.T ), which offers cryptocurrency exchange services, gaining 5.7 pct. \nExchange operators said the hack will likely cause concerns over security to grow among consumers, potentially pressuring the price of cryptocurrencies. \n“All cryptocurrencies will now be tainted in their minds, so there may be a mid-term negative impact,” said Genki Oda, president of BitPoint Japan. \nAt a NEM-themed pub in the Shibuya entertainment district, Tokyoites took stock of the Coincheck hack - some paying for drinks in the cryptocurrency via their mobile phones. \nNaoki Yamamoto, a 29-year-old financial services worker, said he had lost thousands of dollars worth of NEM coins. \n“When I think about the damage that’s been done to other people, (my loss) isn’t bad at all,” he said. “Until the security of asset flows can be guaranteed, the market can’t be trusted.” CRYPTOCURRENCY RISKS \nThe Singapore-based NEM Foundation, which describes itself as a promoter of the technology underlying the cryptocurrency, said it had a tracing system on the NEM blockchain and that it had “a full account” of all of Coincheck’s lost NEM coins. It added that the hacker had not moved any of the funds to any exchange or personal accounts but that it had no way to return the stolen funds to its owners. \nIn 2014, Tokyo-based Mt. Gox, which once handled 80 percent of the world’s bitcoin trades, filed for bankruptcy after losing bitcoins worth around half a billion dollars. More recently, South Korean cryptocurrency exchange Youbit last month shut down and filed for bankruptcy after being hacked twice last year. \nWorld leaders meeting in Davos last week issued fresh warnings about the dangers of cryptocurrencies, with U.S. Treasury Secretary Steven Mnuchin relating Washington’s concern about the money being used for illicit activity. \nJapan’s top financial diplomat said regulation of cryptocurrencies would likely be on the agenda at the G20 finance chiefs’ meeting in Argentina in March. \nSouth Korea will this week ban cryptocurrency traders from using anonymous bank accounts, to crack down on the criminal use of virtual coins. China, worried about financial risks from such trading, has ordered some exchanges in Beijing to close. \n($1 = 108.6600 yen)", "external_links": [], "published": "2018-01-29T04:35:00.000+02:00", "crawled": "2018-01-29T04:49:11.002+02:00", "highlightTitle": ""}