{"organizations": [], "uuid": "5d7f28e71425992860b739abffe1e419131a67d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "This New Airline CEO Took a Pay Cut to Match His Female Predecessor – Fortune", "url": "http://fortune.com/2018/01/29/easyjet-ceo-johan-lundgren-takes-pay-cut-to-match-female-predecessor-carolyn-mccall/", "country": "US", "domain_rank": 1196, "title": "This New Airline CEO Took a Pay Cut to Match His Female Predecessor", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T14:59:00.000+02:00", "replies_count": 0, "uuid": "5d7f28e71425992860b739abffe1e419131a67d4"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/29/easyjet-ceo-johan-lundgren-takes-pay-cut-to-match-female-predecessor-carolyn-mccall/", "ord_in_thread": 0, "title": "This New Airline CEO Took a Pay Cut to Match His Female Predecessor", "locations": [], "entities": {"persons": [{"name": "carolyn mccall", "sentiment": "none"}, {"name": "johan lundgren", "sentiment": "none"}, {"name": "lundgren", "sentiment": "none"}, {"name": "mccall", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}], "organizations": [{"name": "easyjet", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 7:59 AM EST \nEasyJet’s newly hired chief executive officer is taking a pay cut to match the salary of his predecessor, Carolyn McCall, as the discount airline joins U.K.-wide efforts to reduce the national gender gap in remuneration . \nJohan Lundgren’s salary, originally set at 740,000 pounds ($1.04 million), will be reduced 4.6% to the 706,000 pounds earned by McCall last year, before she left to run U.K. broadcaster ITV, the Luton, England-based carrier said in a statement Monday. EasyJet (ejttf) will also seek to beat a target of ensuring that 20% of new pilots are women by 2020, Lundgren said. \nU.K. government data show men out-earn women at every level across industries, with the gap widest in skilled trades, according to figures released this month. EasyJet came under fire after it said there was a 51.7% difference between men and women, driven by the gender imbalance among its pilots, its highest paid position. Only 5% of the carrier’s flight-deck crew are women, though that proportion is higher than the industry average of 4%, it said. \nRead: How Robots Could Make the Gender Pay Gap Even Worse \nLundgren’s most recent full-time position in the travel industry was with German tourism operator TUI AG, which he left in 2015 after the company merged with its U.K. business. Contractually barred from being employed at a rival immediately following that deal, he was a travel consultant until joining EasyJet on Dec. 1. The company said Lundgren asked the board to cut his salary. ‘Absolutely Committed’ \n“At EasyJet we are absolutely committed to giving equal pay and equal opportunity for women and men,” Lundgren said in Monday’s statement. “I also want to affirm my own commitment to address the gender imbalance in our pilot community which drives our overall gender pay gap.”’ \nThe U.K. government has mandated that all companies with a workforce exceeding 250 employees publish details of gender pay gaps by April 4. EasyJet was one of the earliest to report, providing figures in November. Other airlines operating in Britain have yet to do so. \nRead: EasyJet Shares Pop as Airline Profits From Other Carriers’ Woes \nIn a report in advance of EasyJet’s annual shareholders meeting next month, the advisory group ISS only gives the company “qualified support” for its remuneration report. ISS pointed out that the new CEO was appointed on a higher salary than his predecessors and that the amount is “not without concern for shareholders.” With McCall’s departure, only two of the airline’s eight board members are women. \nWhile Lundgren has lowered his base salary, a bigger proportion of EasyJet’s CEO compensation is paid through bonuses and incentive targets. The carrier said last year that it was relaxing executive pay goals after McCall’s total remuneration fell to 1.5 million pounds in fiscal 2016 from 6.2 million pounds a year earlier. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-29T14:59:00.000+02:00", "crawled": "2018-01-29T14:59:44.002+02:00", "highlightTitle": ""}