{"organizations": [], "uuid": "2a442121e5da4244410c6092070169c30f534ad7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/07/104885262-GettyImages-886626124-steve-bannon.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/trump-bannon-fallout-could-threaten-republicans-in-midterm-elections.html", "country": "US", "domain_rank": 767, "title": "Trump-Bannon fallout could threaten Republicans in midterm elections, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T16:20:00.000+02:00", "replies_count": 0, "uuid": "2a442121e5da4244410c6092070169c30f534ad7"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/trump-bannon-fallout-could-threaten-republicans-in-midterm-elections.html", "ord_in_thread": 0, "title": "Trump-Bannon fallout could threaten Republicans in midterm elections, analysts say", "locations": [], "entities": {"persons": [{"name": "roy moore", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "derek halpenny", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "fairhope", "sentiment": "none"}, {"name": "oak hollow farm", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "mufg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Bannon's fiery comments about President Donald Trump in a soon-to-be-published White House expose could impact Republican performance in the 2018 midterm elections, according to analysts.\nTrump lashed out at Bannon on Wednesday, saying his former campaign strategist had \"lost his mind,\" in response to Bannon's scathing criticism of his family published in Michael Wolff's forthcoming book \"Fire and Fury: Inside the Trump White House.\" Part of Bannon's broadside was the accusation that Donald Trump Jr.'s 2016 meeting with a Russian lawyer in Trump Tower was \"treasonous\", among other claims.\n\"Divisions with Bannon could result in the Republicans losing support in the midterms with Bannon promising to run hard-right independent candidates in as many districts as possible in the House elections,\" Derek Halpenny, head global markets analyst at MUFG, said in an email note. \"It could split some of Trump's support.\"\nPolls already suggest that Democrats could feasibly win the 25 seats needed to regain control of the House of Representatives.\n\"Many of them (Republicans) are running scared at this point, a lot of them have decided not to actually stand for election,\" Peter Trubowitz, director of the United States Center at the London School of Economics, told CNBC on Friday.\n\"They sense that there's a Democratic wave coming. And for Republicans, the move toward the center guarantees getting primaried by a Republican challenger, a Breitbart type or so forth.\"\nshow chapters Michael Wolff's tell-all book won't really change Trump's agenda: Pro 12 Hours Ago | 03:59 In December, many congressional Republicans excoriated Breitbart Executive Chairman Bannon after his fielding of right-wing anti-establishment Senate candidate Roy Moore in Alabama — who beat Republican incumbent Luther Strange in the primaries — led to a victory for the Democratic contender Doug Jones .\nStill, winning any majority for the Democrats will not be easy. Although the party needs only two more seats for control of the Senate, 23 of the 33 senators up for re-election are Democrats, making them vulnerable. Two are independents who caucus with the Democrats, and only eight are Republicans.\nAdditionally, Republican leadership in Congress may welcome the split, as it could give them an opportunity to steer Trump in a direction that is more favorable to their mainstream conservative agenda.\nThe spat between Trump and Bannon slashes an alliance that helped galvanize the president's Republican base during his election. Bannon was a staunch Trump backer from the early days of the campaign, and is credited with pushing ethno-nationalism and populism onto the forefront of national politics.\nSome observers, however, are questioning the veracity of Bannon's accusations in \"Fire and Fury,\" with many calling him an opportunist and a self-promoter, skeptical of how much stock to put in his words. Bannon may also try to make amends — on Wednesday night he praised Trump on his Breitbart radio show, calling him \"a great man.\"", "external_links": [], "published": "2018-01-05T16:20:00.000+02:00", "crawled": "2018-01-05T16:50:59.020+02:00", "highlightTitle": ""}