{"organizations": [], "uuid": "072530c2cd31a85fcadb1bbdad5c2faea68101e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970807-RTX4EGAV.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/this-years-flu-season-is-worse-than-usual-for-baby-boomers.html", "country": "US", "domain_rank": 767, "title": "This year’s flu season is worse than usual for baby boomers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T20:10:00.000+02:00", "replies_count": 0, "uuid": "072530c2cd31a85fcadb1bbdad5c2faea68101e1"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/this-years-flu-season-is-worse-than-usual-for-baby-boomers.html", "ord_in_thread": 0, "title": "This year’s flu season is worse than usual for baby boomers", "locations": [], "entities": {"persons": [{"name": "richard horner", "sentiment": "none"}, {"name": "mike blake", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "escondido", "sentiment": "none"}], "organizations": [{"name": "modern medicine this year", "sentiment": "negative"}, {"name": "cdc", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "palomar medical center", "sentiment": "none"}, {"name": "reuters emergency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Modern Medicine This year’s flu season is worse than usual for baby boomers Flu activity in the U.S. remains high and will likely continue for several more weeks, the Centers for Disease Control and Prevention said Friday. People ages 50 to 64 are particularly badly affected by this year's flu. One possible reason why is a phenomenon called imprinting. The first influenza virus somebody's exposed to as a child has way of determining how he or she will respond to influenza in the future. CNBC.com Mike Blake | Reuters Emergency room nurse Richard Horner wears a mask as he deals with flu patients at Palomar Medical Center in Escondido, California, January 18, 2018. \nThis flu season is considered by the Centers for Disease Control and Prevention to be highly severe , but one age group is feeling it more than usual. \nPeople ages 50 to 64 are particularly badly affected by this year's flu, the CDC told reporters Friday. That could be because of the strains in circulation. While the predominant strain is the nasty H3N2, which is less well-protected by the flu vaccine, H1N1 is also sending baby boomers to the hospital. \nOne possible reason why, according to the CDC's Dr. Dan Jernigan: a phenomenon called imprinting . \n\"The first influenza virus somebody's exposed to as a child has way of determining how you respond to influenza for the rest of your life,\" said Jernigan, director of the Influenza Division at the CDC's National Center for Immunization and Respiratory Diseases. \nWith H1N1 in 2009, for example, \"we saw a strikingly low number of people being hospitalized over age 65,\" he said. That strain first emerged in 1918. \"From 1918 to 1947, when that H1N1 was circulating, people that were exposed to that one seemed to respond better when this 2009 H1N1 showed back up,\" Jernigan explained. \nFolks not imprinted by that strain, in the 50- to 64-year age group, therefore may not have the same protections as older people. \n\"There's still a lot for us to learn about this,\" Jernigan said, pointing out it \"shows the complicated nature of influenza .\" \nAs for the predominant H3N2 strain in circulation this season, that first arose in 1968, Jernigan said. And it's continued to change, and evade the human immune system, since then. \n\"It really depends on a mixture of things: the environment, the virus itself and how it changes,\" and, he said, \"also the host.\" WATCH: Widespread flu outbreak causing serious complications this year show chapters ", "external_links": [], "published": "2018-01-26T20:10:00.000+02:00", "crawled": "2018-01-26T20:25:34.001+02:00", "highlightTitle": ""}