{"organizations": [], "uuid": "25911a1711ed8b7235e0f86e7399c172cb012176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222304331&w=1200&r=LYNXMPEE0F04U", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-jd-com-tiki-vn-funding/jd-com-vng-corp-lead-investment-in-vietnamese-e-commerce-firm-tiki-vn-idUSKBN1F5075", "country": "US", "domain_rank": 408, "title": "JD.com, VNG Corp lead investment in Vietnamese e-commerce firm Tiki.vn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T05:14:00.000+02:00", "replies_count": 0, "uuid": "25911a1711ed8b7235e0f86e7399c172cb012176"}, "author": "", "url": "https://www.reuters.com/article/us-jd-com-tiki-vn-funding/jd-com-vng-corp-lead-investment-in-vietnamese-e-commerce-firm-tiki-vn-idUSKBN1F5075", "ord_in_thread": 0, "title": "JD.com, VNG Corp lead investment in Vietnamese e-commerce firm Tiki.vn", "locations": [], "entities": {"persons": [{"name": "tiki", "sentiment": "none"}, {"name": "cate cadell", "sentiment": "none"}, {"name": "edwina gibbs", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "vng corp", "sentiment": "negative"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "tiki.vn reuters staff", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jd.com inc", "sentiment": "none"}, {"name": "vng", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 3:16 AM / Updated 13 hours ago JD.com widens Southeast Asia presence by investing in Vietnam's Tiki.vn Reuters Staff 3 Min Read \nBEIJING (Reuters) - Chinese online retailer JD.com Inc has made an investment in Vietnamese e-commerce firm Tiki.vn, expanding its Southeast Asia business amid growing competition in the region from Alibaba Group Holding Ltd and Amazon.com Inc. \nJD.com co-led the financing with Vietnamese entertainment and social media firm VNG Corp, which is an existing investor, China’s second-biggest e-commerce firm behind Alibaba said in a statement on Tuesday. \nThe firm did not disclose the size of the funding but said that JD.com will become one of Tiki’s largest shareholders alongside VNG following the deal. \nVietnamese media had reported in November that the round was worth roughly 1 trillion dong ($44.04 million). JD.com declined to give a dollar number for the investment, when contacted by Reuters. \n“With JD’s expertise in leveraging social media for e-commerce, Tiki.vn’s partnership with VNG in social network and mobile payments is a natural fit,” Winston Cheng, president of JD.com’s international business, said in the statement. \nVietnam is the latest focal point in JD.com’s strategic push into Southeast Asia, where Alibaba and Amazon have also made significant investments in the past year. \nJD.com will tap Tiki.vn’s warehousing and delivery system, as well as its technology and payments capabilities. \nTiki.vn and VNG’s tie-up has similarities to the partnership between JD.com Inc and internet giant Tencent Holdings Ltd, which is an investor in JD.com and Asia’s largest tech firm by market cap. \nJD.com leverages data and payments from Tencent’s WeChat, China’s most popular social media app, and will seek to build similar capabilities with VNG and Tiki.vn, Cheng told Reuters. \nWhile Southeast Asia’s e-commerce market is still nascent compared to the China‘s, improvement in internet services and an increase in mobile-based payments have attracted large international e-commerce firms to the region. \nAlibaba has invested heavily in payment and e-commerce ventures in Thailand, Singapore, Indonesia and Malaysia. U.S. retailer Amazon also launched its subscription-based Prime service in Singapore last month in a bid to challenge Alibaba-backed online retailer Lazada Group in Southeast Asia. \nJD.com launched a local online retail business in Indonesia two years ago, and now claims to be the country’ largest retailer by revenue. It also formed a $500 million e-commerce venture with Thai retailer Central Group. \nBesides VNG, Tiki.vn’s previous investors include Seedcom, Sumitomo Corp and CyberAgent Ventures. \n($1 = 22,709.0000 dong)", "external_links": [], "published": "2018-01-16T05:14:00.000+02:00", "crawled": "2018-01-16T05:23:41.023+02:00", "highlightTitle": ""}