{"organizations": [], "uuid": "91ee10a49f1283e865b3f89887ee56676f0887f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864783-RTX3K2TK-amazon.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/amazon-is-a-monster-set-to-continue-its-winning-streak-analysts-say.html", "country": "US", "domain_rank": 767, "title": "Amazon is a ‘monster’ set to continue its winning streak, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T21:18:00.000+02:00", "replies_count": 0, "uuid": "91ee10a49f1283e865b3f89887ee56676f0887f3"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/amazon-is-a-monster-set-to-continue-its-winning-streak-analysts-say.html", "ord_in_thread": 0, "title": "Amazon is a ‘monster’ set to continue its winning streak, analysts say", "locations": [], "entities": {"persons": [{"name": "max wolff", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}, {"name": "boris schlossberg", "sentiment": "none"}, {"name": "maisel", "sentiment": "none"}, {"name": "schlossberg", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "amazon basics", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "golden globe", "sentiment": "none"}, {"name": "bk asset management", "sentiment": "none"}, {"name": "the phoenix group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The wins just keep coming for Amazon .\nThe e-commerce giant has risen every trading day so far this year and is on track for its 10th straight day in the green, its longest winning streak since mid-2013. Those gains have pushed Amazon to the highest level of its two decades as a public company.\nThis streak isn't over yet, according to two market watchers.\n\"They're just executing on every possible front which is incredibly unusual for such a large company,\" Boris Schlossberg , managing director of foreign exchange strategy at BK Asset Management, said Friday on CNBC's \" Trading Nation .\"\n\"Amazon is a monster and has multiple streams of possible income,\" he said.\nThose revenue streams include Amazon Basics, advertisements through its search platform, its artificial intelligence program Alexa, and its new reputation as a creative powerhouse, said Schlossberg. Earlier this month, Amazon's streaming service won a Golden Globe for its latest series, \"The Marvelous Mrs. Maisel.\"\nMax Wolff , chief economist of The Phoenix Group, agrees that Amazon has potential for more gains.\n\"In a melt-up market where people are buying a lot of quality names like it's going out of style , this one looks like it's got legs to go,\" said Wolff, joining Schlossberg on \"Trading Nation.\"\nEven in a market hitting new highs, Amazon has managed to outpace its peers. Since the beginning of the year, the stock has close to 13 percent, nearly triple the S&P 500 's year-to-date gain. Amazon has also exceeded the Technology Select Sector SPDR ETF's 5 percent rise and is the second best-performing FANG stock of the year, coming in behind Netflix .\nThere is some risk to Amazon's ascendancy this year that could be delivered directly from the White House, said Schlossberg. President Donald Trump has frequently targeted Jeff Bezos , Amazon's founder and the owner of The Washington Post . Among Trump's tweeted attacks, he has suggested levying an internet sales tax against Amazon and said that its cheap delivery prices are devastating the United States Postal Service.\n\"But policy by Twitter is not a risk you can handicap,\" Schlossberg added.\nWolff has a price target of $1,400 to $1,500 on Amazon shares, representing 7 percent to 15 percent upside to current levels. Schlossberg does not have a price target on Amazon shares.\nOther analysts generally have a positive view of Amazon and its chance for growth. BMO Capital recently upped its price target to $1,600 from $1,200, the highest forecast among analyst firms. Of those surveyed by FactSet, more than 80 percent have a buy rating on the stock. The average target price of $1,343 a share represents 2.5 percent upside to current levels.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-16T21:18:00.000+02:00", "crawled": "2018-01-16T21:22:33.010+02:00", "highlightTitle": ""}