{"organizations": [], "uuid": "75bdf160c21b9a69a21ba6bb8d9569115a0717ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/01/104067481-RTX2RAXX.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/investors-fear-after-japan-move-the-last-of-the-global-market-punch-bowls-are-being-taken-away.html", "country": "US", "domain_rank": 767, "title": "Investors fear after Japan move the last of the global market 'punch bowls' are being taken away", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:08:00.000+02:00", "replies_count": 0, "uuid": "75bdf160c21b9a69a21ba6bb8d9569115a0717ce"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/investors-fear-after-japan-move-the-last-of-the-global-market-punch-bowls-are-being-taken-away.html", "ord_in_thread": 0, "title": "Investors fear after Japan move the last of the global market 'punch bowls' are being taken away", "locations": [], "entities": {"persons": [{"name": "kim kyung-hoon", "sentiment": "none"}, {"name": "haruhiko kuroda", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}, {"name": "reuters bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider Investors fear after Japan move the last of the global market 'punch bowls' are being taken away The Bank of Japan tweaked its bond purchases, sparking speculation it is getting ready to pull back from easing. But strategists say the BOJ is not ready to move away from its easy ways yet, and that it was largely a technical move. The yen jumped and bond yields rose on the move, including the U.S. 10-year since a move away form easy policy in Japan could move global interest rates higher. SHARES Kim Kyung-Hoon | Reuters Bank of Japan (BOJ) Governor Haruhiko Kuroda gestures during a news conference at the BOJ headquarters in Tokyo, Japan November 1, 2016. \nThe Bank of Japan is seen as the last grown-up in the room actively filling the global liquidity punch bowl with both hands. \nThat's why a slight tweak to its bond buying program caused a flurry across financial markets Tuesday, sparking speculation it was joining the Federal Reserve and European Central Bank in cutting back on asset purchases, a move that could ultimately help drive up global interest rates. \nOn Tuesday, the BOJ modestly trimmed its purchases of Japanese government bonds by about $10 billion in the 10- to 25-year maturities and another $10 billion in maturities of more than 25 years. The yen jumped about a half percent to about 112.60 to the dollar, and bond yields rose. The U.S. 10-year yield also moved higher, breaking above 2.50 percent to a March high. Meanwhile, the slow-moving 10-year JGB yield barely budged, hovering around 0.07 percent. \nBut some strategists say while the BOJ may have sent a powerful signal, it in fact is just acting on a technicality that comes with changes it made to its bond purchase program back in 2016. Unlike the U.S. and Europe, where central banks have targeted the balance sheet size, the Japanese central bank is targeting interest rates and its purchases are based on prices. \n\"I think it's too early to proclaim the easy conditions in Japan are over. That said, I do think it's constructive and it shows how sensitive the markets are to any potential change,\" said Greg Peters, senior portfolio manager at PGIM Fixed Income. \nThe Bank of Japan has been a poster child for central bank easing, taking its rates to negative levels and buying all types of assets, including stocks. \n\"They're still buying ETFs, J-REITs, corporate paper. They changed how they're easing , but they're still easing,\" said Marc Chandler, head of fixed income strategy at Brown Brothers Harriman. \"I think the market is overinterpreting this, partly because of their positions. They're short yen. They're long euros. They're being squeezed on both legs today.\" \nThe Bank of Japan is still in full throttle easing mode, while the Fed and ECB and are slowing down their programs. The Fed is the furthest along, having hiked interest rates five times so far after taking them to zero in the financial crisis. The Fed is on track to raise interest rates at least three more times this year, and it is also moving to shrink its balance sheet by reducing purchases of securities to replace those that are maturing. \nThe ECB is not yet hiking rates and is still in the middle of quantitative easing, but it is slowing down its purchases fairly dramatically. As of last Tuesday, it cut back its asset purchases in half, and there's talk it could end the program later in the year. \nWhile its last to leave the party, a change in BOJ policies would be the most symbolic move yet that the extreme policies adopted in the global financial crisis are finally coming to an end, and the juice that helped push risk assets higher is being slowly withdrawn. \nChandler said the BOJ has made a point of saying it will continue to ease. \"The BOJ says 'we're going to be patient. We're going to be the last one out…[Prime Minister Shinzo] Abe told the Bank of Japan: 'please be patient,\" said Chandler. \nPart of the reason the speculation rolled so easily across markets is that Japanese wage data picked up, seen as a potential early inflationary signal. Base pay in November rose 0.4 percent year over year form 0.3 percent in October. Overtime pay rose 2.6 percent and bonuses jumped 7.5 percent. The overall cash earnings rose 0.9 percent, higher than expected and the best since July, 2016. \nThere also has been some expectations that this would be the year that the BOJ changes its position and moves to ending extreme easy policy. \n\"If long rates continue to move higher, and the BOJ follows this with a continued reduction in the pace of the purchases, then we know we're on to something. We're onto a potential change in monetary policy in Japan,\" said Peter Boockvar, chief investment officer at Bleakley Financial Group. \"I think that is likely in 2018. Whether this is the beginning of it, we'll have to see. They have some cover too. They know that the Fed is going to do and they know what the ECB is doing. Does the BOJ want to be the outlier of temporary insanity when every other central bank is pulling back? They are the epitome of extremity in terms of monetary policy.\" \nPeters said the ECB is the bank to watch and it may in fact be more aggressively moving away from easy policies . \n\"They're actually talking up the unwinding of the program, which actually could do one of two things. It could either pull the market action forward around their actual tapering or it could just dampen the market reaction when they do taper,\" he said. \nAs for the U.S., he does not see a big move up in U.S. rates this year, in part because of the super low and negative rates in Europe and Japan. \"I still think the curve will flatten but there will be steepening events. The back end is really well contained just based on underlying growth dynamics the lack of inflation coupled with the continued need for yield,\" he said. \nIf the U.S. 10-year does reach 3 percent, he expects it to back off. \"I think it would be very short lived unless something ultimately shifts like inflation shifts higher or growth really shifts higher,\" he said. Patti Domm CNBC Markets Editor Related Securities", "external_links": [], "published": "2018-01-09T21:08:00.000+02:00", "crawled": "2018-01-09T21:36:36.029+02:00", "highlightTitle": ""}