{"organizations": [], "uuid": "d1fe6f8c3b729a05cb1f63f7e885137b78e2ff56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/26/104610688-RTS19AU3-donald-trump.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/trumps-consumer-protection-bureau-has-an-odd-budget-request-zero.html", "country": "US", "domain_rank": 767, "title": "Trump's consumer protection bureau has an odd budget request: Zero", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T18:16:00.000+02:00", "replies_count": 0, "uuid": "d1fe6f8c3b729a05cb1f63f7e885137b78e2ff56"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/trumps-consumer-protection-bureau-has-an-odd-budget-request-zero.html", "ord_in_thread": 0, "title": "Trump's consumer protection bureau has an odd budget request: Zero", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jim bourg", "sentiment": "none"}, {"name": "mulvaney", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "mulvaney", "sentiment": "none"}], "organizations": [{"name": "zero venture capital trump", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "cfpb", "sentiment": "none"}, {"name": "consumer financial protection bureau", "sentiment": "none"}, {"name": "protection bureau", "sentiment": "none"}, {"name": "bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Trump's consumer protection bureau has an odd budget request: Zero The Consumer Financial Protection Bureau's acting director, Mick Mulvaney, told Fed officials that the bureau needs no additional funds to operate for the coming quarter. The CFPB began fiscal 2018 with a balance of $177.1 million but only requires $145 million to operate each quarter, he said in a letter to Fed officials. SHARES Joshua Roberts | Reuters Office of Management and Budget (OMB) Director Mick Mulvaney arrives to speak to the media at the U.S. Consumer Financial Protection Bureau (CFPB), where he began work earlier in the day after being named acting director by U.S. President Donald Trump in Washington November 27, 2017. \nRecently installed Consumer Financial Protection Bureau acting Director Mick Mulvaney is hitting up the Federal Reserve with a budget request you don't see every day: nothing. \nThat's nothing as in zero, as in Mulvaney expects the bureau will not need any additional funding to operate during the current time period. The central bank is in charge of the CFPB's allotment. \n\"This letter is to inform you that for Second Quarter of Fiscal 2018, the Bureau is requesting $0,\" Mulvaney wrote to Fed Chair Janet Yellen . The zero was typed in boldface. \nAs it turns out, the bureau, which has been criticized by President Donald Trump and his administration as ineffective and an over-regulation burden on the banking system, apparently has enough money in its coffers to operate without any additional funds. \nThe CFPB began the 2018 fiscal year with a balance of $177.1 million but only requires $145 million to operate each quarter, Mulvaney wrote. \n\"Simply put, I have been assured that the funds currently in the Bureau Fund are sufficient for the Bureau to carry out its statutory mandates for the next fiscal quarter while striving to be efficient, effective, and accountable,\" he said. \nWhile previous management has preferred to carry a reserve fund, Mulvaney said there's no law requiring it to do so and he sees no \"practical reason\" to continue the practice. \n\"It is my intent to spend down the reserve until it is of a much smaller size, while still allowing the Bureau to successfully perform its functions, before making an additional financial request of the Board,\" he added. \nNot requesting any money will allow the bureau to do its part for deficit reduction. \nThough he acknowledged that the $145 million saved in operating expenses won't \"make much of a dent\" in the $392 billion deficit projected for the 2018 fiscal year, \"the men and women at the Bureau are proud to do their part to be responsible stewards of taxpayer dollars,\" Mulvaney wrote. \nA Fed spokesman did not return a request for comment.", "external_links": [], "published": "2018-01-18T18:16:00.000+02:00", "crawled": "2018-01-18T18:28:26.106+02:00", "highlightTitle": ""}