{"organizations": [], "uuid": "01ae1aca12a8e2a0bfd9ff95f7d5a1a20fd1b9e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/07/104637042-GettyImages-513101776.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/google-uses-this-shocking-strategy-to-hire-the-best-employees.html", "country": "US", "domain_rank": 767, "title": "Top Google recruiter: Google uses this 'shocking' strategy to hire the best employees", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T22:48:00.000+02:00", "replies_count": 0, "uuid": "01ae1aca12a8e2a0bfd9ff95f7d5a1a20fd1b9e6"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/google-uses-this-shocking-strategy-to-hire-the-best-employees.html", "ord_in_thread": 0, "title": "Top Google recruiter: Google uses this 'shocking' strategy to hire the best employees", "locations": [], "entities": {"persons": [{"name": "haynes", "sentiment": "none"}, {"name": "lisa stern haynes", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "mountain view", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "google partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When it comes to hiring, most companies use this standard formula: You speak with an HR representative, you interview with your potential boss, you may meet with other senior level employees within the company and then one person makes the final hiring decision.\nGoogle takes a different approach that may \"shock\" some, according to a Google Partners podcast . The company's global staffing lead and senior recruiter Lisa Stern Haynes says that the tech giant is able to employ the very best because a group of people have to agree on each person that's hired.\nA hiring manager can say no to an applicant for any reason, says Haynes. On the flip side, a hiring manager cannot single-handedly give the \"final yes\" to extend a job offer. All suitable candidates must be passed along to a hiring committee for review.\n\"When managers come to Google for the first time and hear this, especially after years and years of having it a very different way at their previous companies, they're shocked,\" says Haynes.\nBut the tech giant stands by its strategy of making hiring decisions through a team consensus. \"Research tells us that team's that have diverging opinions can make better less biased decisions. And that also applies to the way we make hiring decisions too,\" Haynes explains.\nThe senior recruiter admits that utilizing a hiring committee does slow down the hiring process, although this approach is beneficial for the company in the long run. Haynes explains that you often see employers rushing to settle for a candidate because of time pressure, or even hiring someone due to a preexisting relationship or as a favor to someone.\nThis can lead to a bad hire, which has a really \"long lasting negative effect on a team or a company's culture,\" says Haynes. \"It's way better to take the time and go through a very robust hiring committee on the front end and then identify the best possible candidate the first time around.\"\nThe hiring committees at Google are usually made up of leaders in the specific organization doing the hiring. Members serve on the committee for three to six months before being rotated out of the committee. However, the individual hiring manager is not part of the committee, which Haynes says new managers also find surprising.\nshow chapters Former Google career coach shares a visual trick for making the new year more productive and happy 11:27 AM ET Thu, 21 Dec 2017 | 01:03 Here's how hiring decisions are made, she says: The hiring manager first interviews the candidate and then fills out a hiring packet that includes things like the detailed interview feedback, the recruiter's notes from the initial conversation, internal references if the person knows someone at Google and external references if the person has submitted professional references.\nThe hiring manager then passes this review on to the independent committees. The best part of this chain, says Haynes, is that unlike the hiring manager, committee members are removed from the urgency of selecting someone and are able to judge the applicant based solely on merit.\n\"They're like a layer of objectivity and they're looking to see does this person match the qualification for this immediate role at hand,\" says the lead recruiter. \"Also, are they gonna be a good fit for the organization as a whole for the longer term,\"\nThis is particularly important for a company like Google in which employees jump from team to team and from role to role. In fact, Haynes says that the company values applicants who are problem-solvers and who have a \"general cognitive ability\" over role-related knowledge because positions are constantly shifting.\n\"If you think about how quickly Google changes, if you just hire someone to do one specific job but then our company needs change, we need to be rest assured that that person is going to find something else to do at Google,\" she says. \"That comes back to hiring smart generalists.\"\nLike this story? Like CNBC Make It on Facebook .\nSee also:\nFemale Google engineer on viral memo: 'I was painfully unsurprised'\nTop Google recruiter: The most important skill you should have to score a position at the company\nTop Google recruiter: You have to 'absolutely nail' this if you want to score your dream job\nshow chapters Entrepreneurs reveal the top lessons from their time at Google 1:52 PM ET Wed, 26 April 2017 | 01:15", "external_links": [], "published": "2018-01-10T22:48:00.000+02:00", "crawled": "2018-01-10T23:12:38.010+02:00", "highlightTitle": ""}