{"organizations": [], "uuid": "90a72093bce52966fd69d2e3d5235aa4a6f27984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/09/104520939-RTSLZAD-real-estate.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/mortgage-applications-jump-4-point-5-percent-as-buyers-rush-to-beat-higher-rates.html", "country": "US", "domain_rank": 767, "title": "Mortgage applications jump 4.5% as buyers rush to beat higher rates", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T14:00:00.000+02:00", "replies_count": 0, "uuid": "90a72093bce52966fd69d2e3d5235aa4a6f27984"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/mortgage-applications-jump-4-point-5-percent-as-buyers-rush-to-beat-higher-rates.html", "ord_in_thread": 0, "title": "Mortgage applications jump 4.5% as buyers rush to beat higher rates", "locations": [], "entities": {"persons": [], "locations": [{"name": "california", "sentiment": "none"}, {"name": "jurupa valley", "sentiment": "none"}], "organizations": [{"name": "mortgage bankers association", "sentiment": "none"}, {"name": "the mortgage bankers association", "sentiment": "none"}, {"name": "nichola groom | reuters prospective", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mortgage applications jump 4.5% as buyers rush to beat higher rates Mortgage applications rose 4.5 percent last week from the previous week, the Mortgage Bankers Association says. Application volume was 6.1 percent higher than one year ago. 43 Mins Ago | 00:39 \nSpring has sprung early in this housing market. Buyers, seeing a new trend toward higher interest rates, are rushing in before the first buds appear. \nMortgage applications rose 4.5 percent last week from the previous week, according to the Mortgage Bankers Association's seasonally adjusted report. Application volume was 6.1 percent higher than the same week one year ago. \nApplications to purchase a home led the charge, rising 6 percent for the week to the highest level since April 2010. These loan applications are now 7 percent higher than the same week one year ago. \n\"A combination of being left on the sideline last summer due to a lack of inventory for sale and the prospect of slowly rising interest rates over the near term appears to have buyers in a hurry to start the spring buying season,\" said Lynn Fisher, MBA's vice president of research and economics. \nThe average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances of $453,100 or less increased to 4.36 percent, its highest level since March. That's up from 4.33 percent, with points remaining unchanged at 0.54, including the origination fee, for 80 percent loan-to-value ratio loans. The 15-year fixed rate climbed to its highest level since September 2013. \nMortgage applications to refinance a home loan also rose, up 1 percent for the week, despite higher rates. Refinance volume usually moves in the opposite direction of interest rates, but borrowers are clearly worried that the direction now is only going to be higher, and they may miss an opportunity with rates still near multiyear lows. Mortgage rates loosely follow the yield on the 10-year Treasury. \n\"Last week, 10-year Treasury yields increased by 10 basis points over the course of holiday-shortened week, due to a mixed bag of economic and political headlines,\" Fisher said, referring to Martin Luther King Day. \nNot only are homebuyers facing higher mortgage rates, they are looking at a spring season with precious few homes for sale, especially in the starter and mid-level categories. Inventory has been falling for more than two years and homebuilders are not even close to meeting today's strong demand. That means higher home prices even amid higher mortgage rates. \n\"The increases that we've seen so far have only gotten people off the couch and into the market,\" Glenn Kelman, CEO of Redfin, told CNBC's \"Power Lunch\" on Tuesday. \"People are worrying that they need to hurry and buy a house now before rates go up further.\" Diana Olick CNBC Real Estate Reporter Playing", "external_links": [], "published": "2018-01-24T14:00:00.000+02:00", "crawled": "2018-01-24T14:25:23.013+02:00", "highlightTitle": ""}