{"organizations": [], "uuid": "750abd42d11fbe1d6e49732fc695253ce383c071", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/11/104579700-GettyImages-181170649.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/facebook-stock-down-fb-wall-street-note-reactions-on-newsfeed-change.html", "country": "US", "domain_rank": 767, "title": "Facebook's stock is tanking — but Wall Street analysts aren't too worried, for now", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T20:30:00.000+02:00", "replies_count": 0, "uuid": "750abd42d11fbe1d6e49732fc695253ce383c071"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/facebook-stock-down-fb-wall-street-note-reactions-on-newsfeed-change.html", "ord_in_thread": 0, "title": "Facebook's stock is tanking — but Wall Street analysts aren't too worried, for now", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "scott devitt", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "stifel", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Changes at Facebook will cause only short-lived pain for the company, Wall Street analysts said on Friday — even though traders were dumping shares.\nShares of Facebook dropped more than 4 percent on Friday on the heels of an announcement from CEO Mark Zuckerberg . Facebook's newsfeed will continue to shift toward favoring content from people, rather than publishers, Zuckerberg said — even if \"some measures of engagement will go down.\" \nDespite the stock's clear decline, reactions among analysts were more positive, if still lukewarm — most analysts listed in FactSet raised their price targets for the company's next earnings report, and the outlook for coming quarters was a mix of upgrades, downgrades and unchanged expectations.\nConfused? You're not alone. Analysts across the industry had both good and bad things to say about the changes. Stifel analyst Scott Devitt abruptly changed his view for Facebook over the past 24 hours, reiterating his buy rating just after midnight Friday, only to downgrade his rating to hold around 9 a.m. ET.\nHere's what other analysts had to say: \nSamuel Kemp, Piper Jaffray: \"We see this as the right long-term decision.\" \nWhen people are selling the stock, they're thinking: \"This could lead to reduced Facebook engagement, ad impressions and therefore ad revenue,\" according to Kemp.\nBut Facebook still owns Instagram, and that could absorb any ads that don't find a home on Facebook's main product, Kemp wrote. Plus, Facebook has proven its ability to charge more for ads in the past.\nOverall, Kemp wrote that he didn't see enough evidence of advertising impacts to change his long-term view of the company. Indeed, the changes could combat user attrition over time by making the product more pleasant, he theorized.\n\"We see this as the right long-term decision for the platform and, over the near-term, doubt that this will have a material impact on revenue,\" Kemp wrote. \nBrian Nowak, Morgan Stanley: Be cautious; there are \"just as many unknowns vs. knowns.\" \nNowak urged caution in his note, writing that there were \"just as many unknowns vs. knowns\" about the company's future.\n\nWhile Zuckerberg's post \"injects incremental near-term uncertainty,\" Nowak noted that the overall trend toward \"societal interaction\" has been pretty", "external_links": [], "published": "2018-01-12T20:30:00.000+02:00", "crawled": "2018-01-12T20:49:45.018+02:00", "highlightTitle": ""}