{"organizations": [], "uuid": "a472d844cf05ec567a9b8bbc1c4e56d8193cd99a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940805-IMG_0833.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/delta-expects-an-increase-in-revenue-because-of-a-strong-economy.html", "country": "US", "domain_rank": 767, "title": "Delta's response to rising costs: The economy's on our side", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T21:42:00.000+02:00", "replies_count": 0, "uuid": "a472d844cf05ec567a9b8bbc1c4e56d8193cd99a"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/delta-expects-an-increase-in-revenue-because-of-a-strong-economy.html", "ord_in_thread": 0, "title": "Delta's response to rising costs: The economy's on our side", "locations": [], "entities": {"persons": [{"name": "leslie josephs", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "neutral"}, {"name": "delta", "sentiment": "neutral"}, {"name": "delta air lines", "sentiment": "neutral"}, {"name": "united", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Delta Air Lines is betting a strong global economy will help it weather climbing fuel and other costs. \nThe second-largest U.S. carrier after American Airlines , brought in revenue and profits in the last three months of 2017 that topped Wall Street estimates. It raised its profit outlook for 2018 by around 20 percent, citing the new tax legislation.\nDelta said passenger revenue rose in all of the regions where it operates, the first time it posted across-the-board gains in five years. The airline's shares were up more than 5 percent in afternoon trading.\nBut Delta, like its rivals, such as American and United , which report later this month, faced higher fuel costs last year and is now grappling with oil prices at multi-year highs. \nFuel prices still climbing Delta said its fuel expense rose $350 million in the third quarter, and that it paid an average of $1.93 a gallon. It expects to pay around $2.05 to $2.10 a gallon in the first three months of this year.\n\"I think the biggest thing we have going in our favor in 2018 is a strong economy with a lot of optimism,\" Delta's CEO Ed Bastian said on an earnings call Thursday. He admitted, however, that fuel \"is a little bit of a wild card.\"\nThe U.S. economy grew 3.2 percent in the third quarter, the biggest increase for the July through September period, in two years, according to the U.S. Commerce Department.\nCorporate travel revenue last quarter grew at the fastest clip since 2014, the airline said, adding that it will likely continue this year.\nCorporate travel will rise more than 6 percent this year, the highest growth rate since 2011, Deloitte recently estimated.\nEarlier this week, Bank of America Merrill Lynch said the new tax legislation would boost business-travel spending this year and that would help boost shares of Delta, United and American, which are heavily reliant on corporate travel revenue. Delta said the tax law would likely spur more corporate travel spending.\nBut investors will task Delta to keep a lid on increasing costs, which the airline expects to rise 2 percent to 4 percent this quarter, not including fuel. Delta said it would try to trim costs for hotels, transportation and fleet management.\nHigher costs will hurt its ability to grow profits in the first three months of the year, it said, forecasting earnings of between 60 and 80 cents a share, below the 83 cents a share forecast by analysts polled by Thomson Reuters.\nDelta has been restrained when it comes to growing capacity and expects to upgrade to larger aircraft to meet some of the increasing demand. It expects to grow capacity around 3 percent this quarter, while increasing revenue per each seat it flies — a key industry metric — to a gain of 2.5 percent to 4.5 percent. Too much growth can lead to depressed fares, which tends to spook investors.\nPassengers are opening their wallets Not only are planes flying fuller, but passengers are willing to shell out more for higher fares. Delta, like its competitors, have sliced up their economy cabins and rolled out new premium cabins to encourage passengers to pay for more room on board and other amenities.\nDelta's president Glen Hauenstein said its so-called branded fares generated $200 million in the fourth quarter, and revenues from upselling passengers on first-class seats and its Comfort+ economy seats increased between 25 percent and 30 percent. \nThose types of fares will contribute $350 million in incremental revenue this year. Delta has said it's bare-bones basic economy fares, which offer little flexibility and no free checked bags, are intended to drive passengers to a more expensive, full-service economy fare. Delta is taking those fares global this year .\nRevenue from its co-branded credit card program with American Express is also on the rise. It said it logged more than 1 million signups for SkyMiles credit card accounts in 2017, an annual record. Delta and other airlines make money by selling airline miles to credit card issuers and those issuers in turn receive new customers.\nNo taxes...yet Because of years of losses in the past, Delta and some other airlines don't pay taxes because of what's known as deferred tax assets. The airline could become a taxpayer in 2019 and 2020, it said, in which case it would be at the the new lower rate. \nOther challenges ahead There are some curveballs Delta has to face this year. Its order for at least 75 Bombardier are stuck in a trade dispute with rival plane-maker Boeing , which complained that its Canadian counterpart sold them to Delta below cost and received illegal government subsidies for the program. So far, the Trump administration has sided with Boeing and recommended tariffs of almost 300 percent on the planes, which seat around 100 to 125 passengers.\nA final ruling is expected later this month and Delta said it doesn't expect to take delivery of the planes this spring, as planned. To match demand, Bastian said the airline is investing in maintaining MD-88 jets, which it intends to retire soon, \"around a bit longer than we were otherwise anticipating. \"\nDelta recently agreed to buy 100 single-aisle Airbus jets , but those don't arrive until 2020.", "external_links": [], "published": "2018-01-11T21:42:00.000+02:00", "crawled": "2018-01-11T22:02:45.010+02:00", "highlightTitle": ""}