{"organizations": [], "uuid": "0d15967f0111cce40a8c67e6d445b322668be85a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 52, "shares": 52, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "This Is Your Guide to Buying Bitcoin – Fortune", "url": "http://fortune.com/2018/01/03/bitcoin-buy-how-to-cryptocurrency/", "country": "US", "domain_rank": 1196, "title": "This Is Your Guide to Buying Bitcoin", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T13:00:00.000+02:00", "replies_count": 0, "uuid": "0d15967f0111cce40a8c67e6d445b322668be85a"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/03/bitcoin-buy-how-to-cryptocurrency/", "ord_in_thread": 0, "title": "This Is Your Guide to Buying Bitcoin", "locations": [], "entities": {"persons": [], "locations": [{"name": "bitcoin", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 6:00 AM EST \nBitcoin mania doesn’t seem to be waning. People are even mortgaging their homes to pour money into the cryptocurrency that started out 2017 being worth $1,000. By Nov. 20 the price of Bitcoin had set a new record, passing the $8,000 mark . On the last day of the year, the value of Bitcoin was $14,129 per coin. \nPerhaps you too want to invest in Bitcoin—but you’re not really sure how. Here’s a guide. \nTo be clear, this is not an endorsement for any cryptocurrency, Bitcoin , Ethereum, Ripple or otherwise. It’s also not a suggestion that you should invest in cryptocurrency at all. Here’s what we do know: The markets for these largely untested, unproven digital assets are like teenagers—young and unpredictable. Just look at the volatile ride Bitcoin was on over the Christmas holiday . \nFirst, some context. (Want to get right to the buying? Scroll down to the section “How Do I Buy Bitcoins?”) What Is Bitcoin? \nBitcoin is a decentralized digital currency that can be bought, sold, or traded like a commodity. It can also be used to buy goods—pizza, cars, beer, whatever you’d like. \nBitcoin is different from U.S. dollars because it uses peer-to-peer technology to operate. That means there is no central authority—in this example, the U.S. Treasury—to issue new money or track transactions. Those functions are built into Bitcoin itself—specifically, the so-called blockchain technology that powers Bitcoin and other cryptocurrencies—which is one reason it’s such an attractive, and controversial, concept. \nWhat is the blockchain , you ask? Think of it like a digital version of a public ledger, in which all transactions are recorded for everyone to see. It serves as the primary mechanism for trust in this financial system. \nThe term “cryptocurrency,” by the way, applies to any digital currency that uses cryptography to make secure transactions between two people instantly anywhere in the world. Created in 2009, Bitcoin is the oldest cryptocurrency. Other cryptocurrencies have since emerged, including Ripple and Ethereum. \nBitcoins, which are also called BTC for short, are the units of currency of the Bitcoin system. How Is Bitcoin Generated? \nBitcoins are created or generated by the network as a reward for the “mining” process, a computational effort in which blockchain—that is, public ledger—transactions are verified. \nThe details of this democratic process are complicated. It involves mathematical problems of varying difficulty, software to solve them, and a schedule that ensures that solutions are discovered on a highly regulated basis. All you need to know is that every time a mathematical solution is found, a new “block” on the chain is created. Blocks cannot be removed or altered once they’ve been accepted by the network. \nThe Bitcoin system allows six blocks to be mined every hour. Because it gets more difficult over time, the system is expected to generate fewer Bitcoins over time. (It is structured such that, for every four years the network is in operation, half the amount of Bitcoins that were created in the previous four years are generated.) The bitcoin supply is capped at just under 21 million coins. More than 16.7 million coins have been mined as of Dec. 30, 2017. So How Do I Buy Bitcoins? \nYou can buy Bitcoins directly from other people using online marketplaces, no different than any other product or service. Alternately, you can also use a digital currency exchange or broker such as Coinbase , Bitstamp , Kraken , and Gatehub . Coinbase is one of the biggest U.S. cryptocurrency exchanges. For a beginner, it’s best and easiest to use one of these exchanges. \nYou’ll also need a “wallet,” a place to store the digital currency. (You’ll need one of these no matter which exchange you might use.) The wallet stores your private key, a secret number—a 256-bit string—that gives you access to your Bitcoins. Your private key also allows you the freedom to move across marketplaces. Just because you purchased Bitcoin on a particular exchange doesn’t mean you have to stick with it; your private key ensures that you can always access your wallet, whichever marketplace you use. \nThere different kinds of wallets, including software and hardware wallets. Software wallets are in essence applications, or apps, that you connect with your traditional bank account. There are several to choose from: Coinbase offers a wallet, which is convenient because it is tied directly to its exchange service. There is also Mycelium , a popular mobile wallet, as well as Electrum . Meanwhile hardware wallets store the user’s private keys on a secure hardware device that looks a lot like a flash memory stick. Hardware wallets are considered by some people to be more secure because they can disconnect from the Internet. (There have been cases of hackers stealing Bitcoin from Internet-connected computers . Worried? Here’s how to avoid bitcoin theft .) \nPicked your wallet and your marketplace of choice? Good. Now that you have all the ingredients ready, here’s how to complete the recipe. \nStep one. Create your wallet. The easiest way to do this is through a third-party like Coinbase , Exodus, MyCelium, or blockchain.info . Go to the site of the wallet provider you’ve chosen and sign up. This step requires name, email address, and password. \nStep Two. If you’ve chosen a software wallet, you will be asked to download the app. Download it through the Apple app store or Google Play, depending on whether you have the iOS or Android operating system. Some wallets are designed for desktops; others are better for mobile devices. \nStep Three. Visit the exchange you’ve picked out. Maybe it’s Coinbase, Poloniex , CEX.io, Kraken, Bitfinex, BitPanda, or BitStamp. Register with the exchange. Again, you’ll need your name, email address, password. Most exchanges require you to connect with your bank account to pay for your Bitcoin purchase. \nSome exchanges like Coinbase offer an app that acts as an exchange and a wallet. Through the app, you can both buy and trade Bitcoins as well as store them. That’s fine, but remember that just because you use the Coinbase exchange doesn’t mean you have to use the Coinbase digital wallet. There are many other digital wallets out there. (And exchanges, for that matter.) \nStep four : Go to the exchange’s “buy” section. Select the amount of bitcoin you want to buy. Given the recent high price of Bitcoin, you can buy less than one Bitcoin on these exchanges. Bitcoin can be divided up to eight decimal points. This means you can buy 0.5 Bitcoins, 0.02 Bitcoins, or even 0. 1 Bitcoin, if it suits your budget. Depending on the exchange, you can buy Bitcoins with a credit card, bank transfer, or even cash. \nHappy Bitcoin trading! ", "external_links": [], "published": "2018-01-03T13:00:00.000+02:00", "crawled": "2018-01-03T13:00:30.003+02:00", "highlightTitle": ""}