{"organizations": [], "uuid": "891a40a23d3180f263727deb9ac554eed860a693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956113-GettyImages-901267954.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/government-might-stop-tracking-spread-of-flu.html", "country": "US", "domain_rank": 767, "title": "This flu season is already awful, and government might stop tracking the bug if shutdown happens", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T22:55:00.000+02:00", "replies_count": 0, "uuid": "891a40a23d3180f263727deb9ac554eed860a693"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/government-might-stop-tracking-spread-of-flu.html", "ord_in_thread": 0, "title": "This flu season is already awful, and government might stop tracking the bug if shutdown happens", "locations": [], "entities": {"persons": [{"name": "troy ali", "sentiment": "negative"}, {"name": "carl d. walsh", "sentiment": "negative"}, {"name": "anissa millette", "sentiment": "none"}], "locations": [{"name": "portland", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "cumberland ave", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "franklin towers", "sentiment": "none"}], "organizations": [{"name": "portland press herald", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "hhs", "sentiment": "none"}, {"name": "cdc", "sentiment": "none"}, {"name": "greater portland health", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "u.s. health and human services department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Carl D. Walsh | Portland Press Herald | Getty Images Troy Ali, 21 of Portland receives a flu shot from Greater Portland Health medical assistant Anissa Millette at the clinic in Franklin Towers on Cumberland Ave on Friday, December 29, 2017. \nFederal health officials might stop tracking the spread of the flu if the government shuts down. \nWhile that move could be problematic from a public health perspective in any year, it might be even more worrisome this year, given how hard the flu has been hitting Americans. \nThe U.S. Health and Human Services Department, in a contingency plan posted on its website , has said it would place slightly more than half of its almost 82,000 workers on furlough if the government shuts down due to lack of funding appropriations by Congress. \nThose furloughs will affect the Centers for Disease Control and Prevention, an HHS division which, among many other things, tracks the spread of flu in the U.S. \nHHS, in its contingency plan, said that in the event of a shutdown, \"CDC will continue minimal support to protect the health and well-being of US citizens here and abroad through a significantly reduced capacity to respond to outbreak investigations, processing of laboratory samples.\" \nCDC had no immediate comment when asked whether it would halt its flu tracking during a shutdown. \nA research note on the potential impact of a shutdown, by investment firm Cowen, added a note of caution. \"For a short shutdown, say a week or less, there is not a lot of effect save perhaps CDC which may not be able to track flu and other disease tracking and NIH [National Institute of Health] which could be barred from enrolling people in clinical trials,\" the Friday note said. \nInfluenza this season has been more widespread and peaking earlier in effects than in recent years. So far this season, 30 children have died from the flu, and hospitalizations related to influenza rose last week. \n\"Flu is everywhere in the U.S. right now,\" Dr. Dan Jernigan, director of the influenza division in CDC's National Center for Immunization and Respiratory Diseases, said during a conference call on Jan. 12. \"There's lots of flu in lots of places,\" Jernigan said. \n\"Our team that does this kind of surveillance studies has been doing this particular thing for 13 years, and this is the first year we had the entire continental U.S. be the same color on the graph, meaning there's widespread activity in all of the continental U.S. at this point. It is in a lot of places and causing a lot of flu,\" he said. \nHarold Wimmer, CEO of the American Lung Association, cited the flu in urging a deal to avoid a shutdown. \n\"In the midst of a national flu epidemic, the President and Congress are hurtling toward a federal shutdown at midnight on Friday,\" Wimmer said in a statement. \n\"Such a shutdown could harm the urgent response needed from the Centers for Disease Control and Prevention and other public health agencies to this epidemic.\"", "external_links": [], "published": "2018-01-19T22:55:00.000+02:00", "crawled": "2018-01-19T23:10:39.002+02:00", "highlightTitle": ""}