{"organizations": [], "uuid": "bd0b9bb2b2c9aa55065b4b42f6fbf93ae5ea3d01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Trump Is Giving a Speech at Davos. Here’s What CEOs Want to Hear – Fortune", "url": "http://fortune.com/2018/01/26/trump-davos-speech-ceos/", "country": "US", "domain_rank": 1196, "title": "Trump Is Giving a Speech at Davos. Here’s What CEOs Want to Hear", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T12:12:00.000+02:00", "replies_count": 0, "uuid": "bd0b9bb2b2c9aa55065b4b42f6fbf93ae5ea3d01"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/26/trump-davos-speech-ceos/", "ord_in_thread": 0, "title": "Trump Is Giving a Speech at Davos. Here’s What CEOs Want to Hear", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "neutral"}, {"name": "justin trudeau", "sentiment": "none"}, {"name": "steve mnuchin", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Claire Zillman 5:12 AM EST \nPresident Donald Trump’s much-anticipated address to the world VIPs gathered in Davos, Switzerland takes place on Friday, and corporate chiefs at the meeting are eager to know which Trump trade policy is the real one. \nSteve Mnuchin came to the World Economic Forum’s annual meeting in Davos to deliver one Trump message: the U.S. is open for business. The U.S. Treasury secretary repeated that talking point on Wednesday and Thursday, and insisted that the Trump administration is committed to “fair and reciprocal” trade, in an appeal to the gathering’s self-proclaimed champions of globalization. \nBut it not everyone stuck to that script. Commerce Secretary Wilbur Ross, for one, staked out different ground, telling reporters in Davos that “trade wars are fought every single day, the difference is U.S. troops are now coming to the ramparts.” \nMoving into the gap, Canadian Prime Minister Justin Trudeau used his Davos speech to announce a TPP-like trade deal with 10 Asia-Pacific countries, in a sign that the rest of the world isn’t going to wait for the U.S. to move ahead on trade . \nRead More: Wilbur Ross Tells Davos: U.S. Is Done ‘Being a Patsy’ on Trade \nYou can understand, then, why chief executives at Davos are hoping Trump’s speech on Friday provides more specifics on the issue. \nLynne Doughtie, chairman and CEO of KPMG in the U.S. told Fortune that—in talking to other business leaders this week—she got the impression that they are encouraged with Trump’s tax reforms, but “there’s uncertainty around trade.” \nLikewise, Levi Strauss & Co. President and CEO Chip Bergh, whose denim business imports products from Mexico , said he wants to know “where [Trump] stands on free trade” given the president’s decision to pull out of the Trans-Pacific Partnership and his “lighting-rod” comments on the renegotiation of the North American Free Trade Agreement. Trump arrives at Davos with Secretary of State Rex Tillerson on Thursday. FABRICE COFFRINI AFP/Getty Images \nOn a panel at Davos on Wednesday , Cargill chairman and CEO David MacLennan said that the Trump administration’s decision to exit the Trans-Pacific Partnership was “not good” for his business and expressed wariness about Trump’s threats during the presidential campaign to rip up agreements like NAFTA. \n“I hope that’s not where it’s going,” he said. \nWhite House Economic Advisor Gary Cohn has indicated that Trump will indeed talk trade on Friday. “We are very open to free, fair, reciprocal trade,” he told reporters earlier this week , echoing Mnuchin. “If you treat us one way we will treat you the same way.” \nTrump, meanwhile, provided his own preview on Twitter on Wednesday: “Will soon be heading to Davos, Switzerland, to tell the world how great America is and is doing. Our economy is now booming and with all I am doing, will only get better…Our country is finally WINNING again!” Will soon be heading to Davos, Switzerland, to tell the world how great America is and is doing. Our economy is now booming and with all I am doing, will only get better…Our country is finally WINNING again! \n— Donald J. Trump (@realDonaldTrump) January 25, 2018 \nTrade aside, that overarching theme will meet a receptive crowd. Thanks to economic growth, tax reform and regulation rollback, CEOs in the U.S. are smitten ; with confidence in their own business growth prospects for the year spiking to 52% from 39% in 2017. In fact, as Trump addresses Davos on Friday, CEO optimism overall is the highest it’s ever been . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T12:12:00.000+02:00", "crawled": "2018-01-26T12:12:58.000+02:00", "highlightTitle": ""}