{"organizations": [], "uuid": "85142351eb7dab832a6977a984e89c12b64c0f3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968125-GettyImages-910117246.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/trump-must-use-friedmans-wisdom-to-educate-davos-elites-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump needs to deliver an economic 'truth bomb' at Davos", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T20:16:00.000+02:00", "replies_count": 0, "uuid": "85142351eb7dab832a6977a984e89c12b64c0f3c"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/trump-must-use-friedmans-wisdom-to-educate-davos-elites-commentary.html", "ord_in_thread": 0, "title": "Trump needs to deliver an economic 'truth bomb' at Davos", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "milton friedman", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "davos shares fabrice coffrini", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump is set to give what will surely be the most-watched speech at the annual World Economic Forum Friday. He's expected to tell the assembled world leaders and CEOs why his \"America First\" policies aren't a bad thing for the rest of the world.\nBut it will fail if he attempts to make this case on political grounds or based on the argument that the U.S. has been shafted by international trade deals. This is the World Economic Forum, after all. What this speech and the Davos elites need to hear is a healthy dose of economic wisdom.\nLuckily, there just so happens to be a wealth of easily-delivered economic wisdom that justifies the core of the president's message. And it comes from a Nobel Prize-winning economist Milton Friedman . His work provides all the respectable reasoning needed to explain that the world needs more self-interested competition, not less.\nFriedman's soft spoken tone, modest lifestyle, and professorial stature are all the perfect foil right now to Trump's bluster and the jet-setting super rich image of people like Treasury Secretary Steven Mnuchin. That's important because it's the president's persona that remains a key stumbling block for him among several top business leaders who praise his policies, but otherwise seek to distance themselves from him.\nThere's no public evidence Trump is a student or a fan of Friedman's direct teachings. Also, Friedman was an opponent of just about any form of trade protectionism. But before Friedman died in 2006, he also came to see NAFTA as terrible deal and distrusted supranational institutions like the IMF and the United Nations. That's where his and Trump's messages jibe the most. So this would be the time for the president and his team to bone up on Friedman's wisdom and use it in this perfect venue.\nHere are the two key Friedman Quote: s Trump can use to support his own stance on the global economy:\n1. \"Self-interest is not myopic selfishness. It is whatever it is that interests the participants, whatever they value, whatever goals they pursue. The scientist seeking to advance the frontiers of his discipline… the philanthropist seeking to bring comfort to the needy – all are pursuing their interests, as they see them, as they judge them by their own values.\"\n(Milton and Rose Friedman, Free to Choose , published 1979)\nThis is the most important \"truth bomb\" Trump should drop right away. Davos is brimming with the kinds of globalists who created the European Union and treated economic independence movements like the U.K.'s Brexit vote like Armageddon. It doesn't mean constructs like the E.U. don't have their economic benefits, but the idea that an entire world region needs to have all its economic boats sailing in the same direction was always questionable at best.\nWhite House senior economic advisor Gary Cohn summarized this by saying that \"America first is not America alone.\" America is looking to compete, but still compete on a fair playing field with the rest of the world. Whether it's the E.U. or multinational trade deals like NAFTA or the TPP, every nation deserves the right to examine all its competitive self-interests before joining or staying in them.\n2. \"It is tempting to believe that social evils arise from the activities of evil men and that if only good men (like ourselves, naturally) wielded power, all would be well... To understand why it is that 'good' men in positions of power will produce evil, while ordinary man without power but able to engage in voluntary cooperation with his neighbors will produce good, requires analysis and thought, subordinating the emotions to the rational faculty .\"\n(Milton Friedman, International Herald Tribune, 1994)\nDavos is filled with billionaires, but it isn't really a celebration of wealth. It's a celebration of power, and the belief that concentrating corporate and political power in one place like Davos will produce great results. The Davos elites need to be reminded they may not have enough good answers to justify their real or imagined power.\nTrump has been doing himself a favor lately by throwing off much of the populist rhetoric he used during the campaign. And populist guru Steve Bannon is not only out of the White House, but clearly out of favor .\nThere is one vestige of populism Trump should cling to even at Davos: the idea that the richest and most powerful people in the world aren't always right. It says something about Davos that a very rich and suddenly very powerful person like Trump is only now important enough to make an appearance there. That outsider status gives him the perfect opportunity to deliver the kind of \"out of the box\" message needed atop that Swiss mountain right now.\nProvided Trump acknowledges that his message is rooted in the respected teaching of a source like Friedman, the elites at Davos might even listen.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-25T20:16:00.000+02:00", "crawled": "2018-01-25T20:29:08.000+02:00", "highlightTitle": ""}