{"organizations": [], "uuid": "c180773da48160cfd90298e0b6c96df727123153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953606-GettyImages-906685466.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/donald-trump-the-only-man-in-washington-not-worried-about-a-shutdown.html", "country": "US", "domain_rank": 767, "title": "Donald Trump is the only person in Washington who doesn't seem worried about a shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T02:09:00.000+02:00", "replies_count": 0, "uuid": "c180773da48160cfd90298e0b6c96df727123153"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/donald-trump-the-only-man-in-washington-not-worried-about-a-shutdown.html", "ord_in_thread": 0, "title": "Donald Trump is the only person in Washington who doesn't seem worried about a shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "mandel ngan", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "coraopolis", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fears of a government shutdown coursed through Washington, D.C., on Thursday, as House and Senate leaders negotiated a spending bill and federal agencies prepared to furlough workers. But if you watched President Donald Trump touting his recently passed tax cuts outside Pittsburgh, Pa., you might never have known it.\nOver the course of a 20-minute speech at a heavy-equipment manufacturing plant, Trump, who read from a teleprompter, didn't mention the looming closure of government once. \"Who knows?\" Before the speech, Trump said, \"Who knows?\" when reporters asked if he thought the federal government would be forced to close.\nThe president has consistently claimed that Democrats in Congress actually want a government shutdown, in order to detract attention away from the recently enacted Republican tax cuts.\nDemocrats are insisting that DACA protections for undocumented immigrants who were brought to the United States as children be extended as part of any longer-term spending bill. Both Trump and Republican leaders have previously said they would support a fix to keep the 800,000 immigrants from being at risk of deportation.\nMandel Ngan | AFP | Getty Images President Donald Trump speaks during a tour of the H&K Equipment Company in Coraopolis, Pennsylvania on January 18, 2018. But last week, Trump rejected a bipartisan Senate group's immigration deal that lawmakers said would have enshrined DACA protections and would have met Trump's demands, which included funding for a barrier on the Southern border, and changes to extended family migration and the visa \"lottery.\"\nEver since then, the White House has put out mixed messages about what Trump wants, sowing confusion in Congress and angering lawmakers in both parties.\n\"I'm looking for something that President Trump supports,\" Republican Senate Majority Leader Mitch McConnell said on Wednesday, \"and he's not yet indicated what measure he's willing to sign.\"\nA government shutdown would mean hundreds of thousands of federal workers would be forced to go without pay, and important public services would be suspended. Lawmakers are desperate to avoid this scenario, as well as the resulting public backlash.\nBut judging from the president's twitter account – an often instantaneous reflection of what Trump is thinking about – Trump isn't nearly as desperate. Only three of the 36 tweets from Trump's account this week mentioned the word \"shutdown,\" and two sought to blame Democrats. One of them, on Thursday, made a shutdown sound all but inevitable.\nTrump tweet\nComplicating matters for Republicans is Trump's well documented willingness to blame members of his own party when it is politically expedient for him to do so.\nDuring last year's failed repeal of Obamacare, Trump refused to take responsibility for the legislative breakdown, blaming GOP lawmakers instead.\n\"I'm not going to blame myself. I'll be honest, they are not getting the job done,\" Trump told reporters at a Cabinet meeting in October, adding that some Republicans, \"should be ashamed of themselves.\"\nAlready on Thursday, the White House appeared to be downplaying the impact of a possible shutdown, while at the same time preparing to lay blame on Congress if the government shuts down. \"We're all focused myopically on what is happening today and whether the government will shut down,\" While House legislative director Marc Short told Politico. \"What's missing from this conversation is the complete dysfunction ofd Congress, and its inability to complete the appropriations process.\"\nAs if on cue, less than an hour before a scheduled House vote on a spending bill Thursday night, Trump tweeted at lawmakers. \"Our military needs it!\" he wrote.\nTRUMP tweet\nTrump, meanwhile, is scheduled to leave Washington on Friday afternoon for his private Mar-a-Lago club in Florida, where he will mark the one-year anniversary of his inauguration by holding a fundraiser. A White House spokesman would not not say on Friday whether he plans to change his travel plans if Congress doesn't reach a deal.\nWATCH: What happens when the government shuts down\nshow chapters This is what happens when the U.S. government shuts down 6 Hours Ago | 02:07", "external_links": [], "published": "2018-01-19T02:09:00.000+02:00", "crawled": "2018-01-19T02:36:02.000+02:00", "highlightTitle": ""}