{"organizations": [], "uuid": "ab2b4e6393e37c04ff4aeaa25ea7408aa7a783af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104951093-Ellen_Pompeo_2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/shonda-rhimes-advice-helped-ellen-pompeo-win-her-20-million-contract.html", "country": "US", "domain_rank": 767, "title": "The advice from Shonda Rhimes that helped Ellen Pompeo land a $20 million contract", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T22:47:00.000+02:00", "replies_count": 0, "uuid": "ab2b4e6393e37c04ff4aeaa25ea7408aa7a783af"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/shonda-rhimes-advice-helped-ellen-pompeo-win-her-20-million-contract.html", "ord_in_thread": 0, "title": "The advice from Shonda Rhimes that helped Ellen Pompeo land a $20 million contract", "locations": [], "entities": {"persons": [{"name": "shonda rhimes", "sentiment": "positive"}, {"name": "ellen pompeo", "sentiment": "positive"}, {"name": "rhimes", "sentiment": "none"}, {"name": "dempsey", "sentiment": "none"}, {"name": "getty  pompeo", "sentiment": "none"}, {"name": "patrick dempsey", "sentiment": "none"}, {"name": "meredith grey", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "pompeo", "sentiment": "none"}], "locations": [], "organizations": [{"name": "getty", "sentiment": "positive"}, {"name": "abc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nPompeo says that she reached out to co-star Patrick Dempsey to see if he’d be interested in negotiating their salaries together, to prevent the network from playing the two off each other (he declined.) She also recalls asking network executives for $5,000 more than Dempsey, to prove a point. They refused, and she felt conflicted about remaining on the show. \n“And I could have walked away, so why didn’t I?,” she says. “It’s my show; I’m the number one. I’m sure I felt what a lot of these other actresses feel: Why should I walk away from a great part because of a guy? You feel conflicted but then you figure, ‘I’m not going to let a guy drive me out of my own house.'” \nAfter Dempsey left the show in 2015, things took a positive turn for Pompeo. Not only did the show’s ratings spike, but she negotiated an unprecedented deal with Rhimes and the production studio that gave her more creative control and ownership of her career. \nAfter Rhimes signed a nine-figure deal with Netflix last August, Pompeo says she told the creator, “If you’re moving on to Netflix and you want the show to go down, I’m cool with that. But if you want it to continue, I need to be incentivized. I need to feel empowered and to feel ownership of this show.” \nPompeo secured a contract that includes a salary upwards of $20 million a year and a role as producer of “Grey’s Anatomy” and a co-executive producer of the show’s forthcoming spinoff. She even secured pilot commitments and office space for her Calamity Jane production company on Disney’s Burbank lot. “Grey’s” has reportedly generated nearly $3 billion for Disney, ABC’s parent company. \nThe actress says she’s recently met with other women in Hollywood to discuss how they can bring about change to the culture as part of the Time’s Up initiative. \n“I’ll tell you, sitting in rooms full of Oscar-winning actresses listening to how they’ve been preyed upon and assaulted is frightening,” she says. “And it confirmed that my path really was the right one for me, because I’ve chosen to financially empower myself so that I never have to be ducking predators and chasing trophies. It’s not for everyone. You have to be more interested in business than you are in acting.” \nWhile she admits that asking for what she deserves is an ability she’s honed over time, Pompeo says she hopes she can be a positive example to her daughter about the benefits of owning your career. \n“My 8-year-old daughter gets to come [to the set] and see fierce females in charge,” she says. “She’s growing up in an environment where she’s completely comfortable with power.”", "external_links": [], "published": "2018-01-17T22:47:00.000+02:00", "crawled": "2018-01-17T23:11:26.019+02:00", "highlightTitle": ""}