{"organizations": [], "uuid": "a9ba694d6485c761f12c2251768bde5577f6b1f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 1}, "linkedin": {"shares": 16}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/11/103778900-GettyImages-546066166.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/jeff-saut-the-economy-is-stronger-than-a-garlic-milkshake.html", "country": "US", "domain_rank": 767, "title": "One of Wall Street's loudest bulls says the economy is 'stronger than a garlic milkshake'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T15:00:00.000+02:00", "replies_count": 0, "uuid": "a9ba694d6485c761f12c2251768bde5577f6b1f1"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/jeff-saut-the-economy-is-stronger-than-a-garlic-milkshake.html", "ord_in_thread": 0, "title": "One of Wall Street's loudest bulls says the economy is 'stronger than a garlic milkshake'", "locations": [], "entities": {"persons": [{"name": "raymond james", "sentiment": "negative"}, {"name": "jeffrey saut", "sentiment": "negative"}, {"name": "saut", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "22 Hours Ago | 01:22 \nRaymond James' Jeffrey Saut isn't letting the string of new record highs and soaring optimism intimidate him. He doesn't see these factors as contrary indicators to the rally. \nSaut still contends there are years remaining in the secular bull market, and his bull call sounds even louder. \n\"The economy is stronger than a garlic milkshake. Earnings are coming in better than people think,\" the firm's chief investment strategist said Wednesday on CNBC's \" Trading Nation .\" \nIt's now 12 months since the Dow broke through the 20,000 milestone, and it's now striking distance from the 26,500 market — a more than 30 percent gain. In January alone, the Dow and S&P 500 have secured intraday all-time highs 13 times. \n\"There's not a whole lot to see that could go wrong with this,\" Saut said. \"Inflation has picked up a little bit, but it's nothing to be worried about as of yet.\" \nSaut, who believes there are still too many people under-invested in the stock market, has been one of Wall Street's most vocal bulls. \nLast May, he correctly predicted on \"Trading Nation\" that the rally had more room to run and that President Donald Trump's tax cut plan would likely become a reality. \nDespite Saut's robust outlook that's built on strong synchronized global growth and benefits from Trump's tax policies, he's still in the correction camp . He believes a textbook correction of 10 percent could happen before spring. \n\"Our short-term model and intermediate term model that have been very bullish since the beginning of November have targeted the first part to middle part of February as potentially the first point of vulnerability,\" he said. \nIf a correction hits, Saut said, it will be short and profitbale rather than long and painful. He already has a plan in place to play it. \n\"I'm pretty much overweight technology , so I'd probably trim some of those positions,\" said Saut. \"I'm probably not going to take anything out of financials because financials relative to the overall market are not that expensive.\"", "external_links": [], "published": "2018-01-25T15:00:00.000+02:00", "crawled": "2018-01-25T15:40:40.007+02:00", "highlightTitle": ""}