{"organizations": [], "uuid": "8a0ade403795ca473f906a1b1e6ceb6dc1ff81c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/03/104447075-GettyImages-532079304.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/the-royal-family-is-hiring-heres-what-the-job-entails.html", "country": "US", "domain_rank": 767, "title": "The royal family is hiring—here's what the job entails", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:34:00.000+02:00", "replies_count": 0, "uuid": "8a0ade403795ca473f906a1b1e6ceb6dc1ff81c9"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/the-royal-family-is-hiring-heres-what-the-job-entails.html", "ord_in_thread": 0, "title": "The royal family is hiring—here's what the job entails", "locations": [], "entities": {"persons": [{"name": "alastair grant", "sentiment": "negative"}, {"name": "elizabeth ii", "sentiment": "negative"}, {"name": "meghan markle", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Alastair Grant | WPA Pool | Getty Images Queen Elizabeth II reads the Queen's Speech on her throne as Prince Philip listens during the state opening of Parliament in the House of Lords, May 18, 2016 in London. SHARES \nIf you're obsessed with royal weddings , crown jewels and Meghan Markle then your dream job may finally be here, because the U.K.'s Royal Household is hiring. \nAccording to a job posting on LinkedIn , the royal family is looking to hire an entry-level communications assistant to produce press announcements, write media briefings and compose social media posts. \n\"Joining this fast-paced and dynamic team, you'll assist senior colleagues with both proactive and reactive communications,\" says the post. \"You'll organize coverage of set-piece Palace engagements including investitures and garden parties, and provide support as required for off-site engagements.\" show chapters 11:42 AM ET Mon, 27 Nov 2017 | 00:43 \nThe role is based at Buckingham Palace but will provide opportunities for high-profile travel in the U.K. and overseas. \n\"The reaction to our work is always high-profile, and so reputation and impact will be at the forefront of all that you do,\" the post says. Responsibilities also include promoting the \"work, role, relevance and value of the Royal Family\" and publicizing state visits, award ceremonies and royal engagements. \nThe job comes with a comprehensive benefits package, 33 holidays per year and pension with a 15 percent employer contribution. \nPerhaps most importantly, \"This is your opportunity to develop your career and deliver the exceptional,\" says the post. show chapters 8:57 AM ET Tue, 2 Jan 2018 | 01:39 \nIn order to land a job like this, you'll need to polish your interviewing skills. Be prepared to answer the most common interview questions and also a few curveballs . \nFor an interview like this, you'll want to dress formally. Best-selling management author and CNBC contributor Suzy Welch says that dressing too casually can sabotage your chances — especially true when you're applying to join the queen's staff. \nWhen in doubt, it's always better to be overdressed than underdressed, says Welch. \"Look, these days, it's perfectly OK to show up in jeans and a T-shirt if, and only if, you're interviewing for a tech company with three employees who think hoodies are formal wear,\" she tells CNBC Make It . \nBefore you leave, Welch says that applicants should stress how passionate they are for the role by simply saying, \" I really want this job .\" \n\"Make your case. Give it your all,\" Welch says. \"And somewhere near the end of the process, make sure they know how you really feel.\" \nLike this story? Like CNBC Make It on Facebook \nDon't miss: ", "external_links": [], "published": "2018-01-24T17:34:00.000+02:00", "crawled": "2018-01-24T17:37:53.016+02:00", "highlightTitle": ""}