{"organizations": [], "uuid": "f824b15cb02f005e6ad1ea90ba847c44fb200e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968309-TST.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/satanists-say-missouris-abortion-law-violates-their-religious-beliefs.html", "country": "US", "domain_rank": 767, "title": "Satanists say rules in Missouri's strict abortion law violate their religious beliefs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T23:27:00.000+02:00", "replies_count": 0, "uuid": "f824b15cb02f005e6ad1ea90ba847c44fb200e70"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/satanists-say-missouris-abortion-law-violates-their-religious-beliefs.html", "ord_in_thread": 0, "title": "Satanists say rules in Missouri's strict abortion law violate their religious beliefs", "locations": [], "entities": {"persons": [{"name": "mary doe", "sentiment": "none"}], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "missouri supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A supporter of The Satanic Temple in Washington, D.C. \nThese Satanists are on a religious mission to protect women's abortion rights. \nA group of Satanists is waging a court fight in Missouri , saying they should be entitled to avoid the strict rules contained in that state's abortion law because such requirements violate their religious beliefs. \nAnd The Satanic Temple is claiming it scored \"an unprecedented triumph\" during a Missouri Supreme Court hearing that was held in the case on Tuesday. \nDuring that hearing, the state's lawyer agreed that women seeking an abortion in Missouri are not required by the law to first undergo an ultrasound, but instead must only be offered the \"opportunity\" to get such imaging and hear the fetal heartbeat if she so wants. \nThe Satanic Temple's member, known as \"Mary Doe,\" claimed she was required to get an ultrasound by a Planned Parenthood clinic before obtaining an abortion in May 2015. \nAnd the religious group said clinics in the state to this day still believe that the abortion law requires them to have such ultrasounds performed before aborting a fetus. \nPlanned Parenthood didn't immediately return calls for comment. \nThe Satanic Temple argues that its members, and anyone else whose religious beliefs conflict with the abortion law, should be able to claim an exemption from the law's requirements. \nThose requirements, among other things, impose a 72-hour waiting period before a woman can get her abortion, as well as mandate that she sign an acknowledgment of being given a booklet that claims human life begins at conception. \nThe statement in the booklet, which is published by the Missouri Department of Health and Senior Services, says, \"Abortion will terminate the life of a separate, unique, living human being.\" \nJex Blackmore, a spokeswoman for The Satanic Temple, said of the case, \"This is the first time that anyone has brought a religious objection to abortion laws.\" \n\"I think that's interesting, because abortion laws, across the board, are religiously based,\" Blackmore told CNBC. \"These laws would not be in place without the state imposing their religious beliefs.\" \nThe Satanic Temple, despite its name, does not worship the popular religious conception of \"Satan:\" the angel Lucifer who rebelled against God, was cast out from heaven, rules in hell and is generally considered to be the embodiment of pure evil in the world. \nInstead, the group says it is \"a non-theistic religious organization dedicated to Satanic practice and the promotion of Satanic rights.\" \n\"We understand the Satanic figure as a symbol of man's inherent nature, representative of the eternal rebel, enlightened inquiry and personal freedom rather than a supernatural deity or being,\" the group says on its website. \nBlackmore said that when Mary Doe went to get her abortion at a St. Louis Planned Parenthood clinic in 2015, at a time when the clinic was the sole abortion provider in the entire state of Missouri, she was carrying a document that claimed she was exempt on religious grounds from restrictions in the abortion law. \nThe letter said that as an adherent of the Satanic Temple, \"my sincerely held religious beliefs are: My body is inviolable and subject to my will alone.\" \n\"I make any decision regarding my health based on the best scientific understanding of the world, even if the science does not comport with the religious or political beliefs of others,\" the letter said. \nThe document went on to say that \"my deeply held religious belief\" is that \"abortion does not terminate the life of a separate, unique, living human being\" — and that she absolved the clinic of having to give her the booklet from the state, and of having to wait 72 hours to perform the abortion. \nDespite her letter, Mary Doe was forced to comply with the restrictions in order to obtain her abortion. \nThe Satanic Temple, in its lawsuit on her behalf, claims that the state's interference in her seeking an abortion violated her rights under Missouri's Religious Freedom Restoration Act . The group also claimed the state abortion law violates the U.S. Constitution's protection of religious beliefs by not permitting people to cite their religion to obtain an exemption from the law's mandates. \nBut John Sauer, the state's attorney, who argued at the Missouri Supreme Court hearing, reportedly told the justices that the state's law is not forcing Doe to endorse a view on when life begins, nor are her religious views being affected by the law. \nIn earlier court papers , Missouri's attorney general's office said, \"Even if Doe has alleged a restriction on free exercise (of religion), the Informed Consent Law clearly serves compelling state interests and is not unduly restrictive on Doe's asserted exercise of religion.\" \n\"Doe failed to allege an 'exercise of religion' that was 'restricted' within RFRA's meaning, because she alleged only an interest in avoiding exposure to information with which she disagreed, and she failed to allege any religious belief that would be violated by such exposure to information,\" the AG's office wrote. \nThe state also argues that the abortion law \"is not a religious tenet but a political and philosophical position adopted by the political branches of Missouri's government.\" \nIn a footnote to its court papers, the state said it was assuming, for the sake of argument, that Doe's beliefs detailed in the lawsuit are \"sincerely held religious beliefs.\" \nBut, the AG's office went on to write, \"Respondents do not concede that these beliefs are in fact religious beliefs, rather than political and philosophical views on abortion dressed up as religious beliefs in order to manufacture a legal controversy.\" \nIt is not known when the Missouri Supreme Court will rule in the case.", "external_links": [], "published": "2018-01-25T23:27:00.000+02:00", "crawled": "2018-01-25T23:53:43.004+02:00", "highlightTitle": ""}