{"organizations": [], "uuid": "a13b412af4e7c959efa068c790957a042adbd190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 44}, "facebook": {"likes": 277, "shares": 277, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226790163&w=1200&r=LYNXMPEE0U045", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/south-korea-says-uncovered-about-600-million-in-cryptocurrency-crimes-idUSKBN1FK09J", "country": "US", "domain_rank": 408, "title": "South Korea says uncovered about $600 million in cryptocurrency crimes", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T04:45:00.000+02:00", "replies_count": 0, "uuid": "a13b412af4e7c959efa068c790957a042adbd190"}, "author": "", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/south-korea-says-uncovered-about-600-million-in-cryptocurrency-crimes-idUSKBN1FK09J", "ord_in_thread": 0, "title": "South Korea says uncovered about $600 million in cryptocurrency crimes", "locations": [], "entities": {"persons": [{"name": "dahee kim", "sentiment": "none"}, {"name": "sam holmes", "sentiment": "none"}, {"name": "cynthia kim", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:48 AM / Updated 8 hours ago South Korea says no plans to ban cryptocurrency exchanges, uncovers $600 million illegal trades Dahee Kim , Cynthia Kim 4 Min Read \nSEOUL (Reuters) - South Korea’s finance minister said the government has no plans to shut down cryptocurrency trading, welcome news for investors worried that authorities might go as far as China’s tough action in blocking virtual coin platforms. \nThe comment by Kim Dong-yeon on Wednesday comes as traders at home and around the world have been spooked by conflicting comments from government officials in South Korea, a major hub for cryptocurrency trade, that Seoul was planning to ban local digital coin exchanges. \n“There is no intention to ban or suppress cryptocurrency (market),” Kim said, adding the government’s immediate task is to regulate exchanges. \nReinforcing Seoul’s intent to tighten the screws on a market widely seen as opaque and risky by global policymakers, the country’s customs earlier on Wednesday announced it had uncovered illegal cryptocurrency foreign exchange trading worth nearly $600 million. \n“Customs service has been closely looking at illegal foreign exchange trading using cryptocurrency as part of the government’s task force,” it said. \nSouth Korea has been at the forefront of pushing for broad regulatory oversight of cryptocurrency trading as many locals, including students and housewives, jumped into a frenzied market despite warnings from policy makers around the world of a bubble. \nSeoul previously said that it is considering shutting down local cryptocurrency exchanges, which threw the market into turmoil and hammered bitcoin prices. Officials later clarified that an outright ban is only one of the steps being considered, and a final decision was yet to be made. CRYPTO CRIMES \nCustoms said about 637.5 billion won ($596.02 million) worth of foreign exchange crimes were detected. \nIllegal foreign currency trading of 472.3 billion formed the bulk of the cryptocurrency crimes, it said in a statement, but gave no details on what action authorities were taking against the rule breaches. \nIn one case, an illegal FX agency collected a total of 1.7 billion won ($1.59 million) from local residents in a form of “electric wallet” coins to transfer it to a partner agent abroad. The partner agent then cashed them out and distributed the settlement to clients based in that country, according to the statement. \nIn South Korea, only licensed banks and brokers can offer foreign exchange services. Local companies and residents who move more than $3,000 out of the country at a time must submit documents to tax authorities explaining reasons for the transfers. Annual overseas transfers of more than $50,000 must also be reported with similar documents. \nEffective from Jan. 30, authorities imposed rules which allow only real-name bank accounts to be used for cryptocurrency trading designed to stop virtual coins from being used for money laundering and other crimes. \nAmong other breaches, Customs said there were also cases where investors in Japan sent their yen worth 53.7 billion won to their partners in South Korea for illegal currency trade. \nIt said authorities will continue to monitor for any violations of foreign exchange rules or of money laundering activities. \nBitcoin stood at $10,123.13 as of 0842 GMT on the Luxembourg-based Bitstamp exchange. The heightened regulatory scrutiny around the world, however, has seen bitcoin dive about 27.1 percent so far this month, on track for its biggest monthly decline since January 2015. \nCryptocurrencies got another jolt last week after Tokyo-based exchange Coincheck said hackers stole over $500 million in one of the world’s biggest cyber heists. Reporting by Dahee Kim, Cynthia Kim and Shin-hyung Lee; Editing by Sam Holmes & Shri Navaratnam", "external_links": [], "published": "2018-01-31T04:45:00.000+02:00", "crawled": "2018-01-31T05:00:29.040+02:00", "highlightTitle": ""}