{"organizations": [], "uuid": "e2b7e75783498101744d4a07ea893f127fa0e7c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953933-GettyImages-902753412.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/only-61-percent-of-men-believe-a-wage-gap-exists.html", "country": "US", "domain_rank": 767, "title": "Only 61 percent of men believe a wage gap exists, new study finds", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T16:30:00.000+02:00", "replies_count": 0, "uuid": "e2b7e75783498101744d4a07ea893f127fa0e7c3"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/only-61-percent-of-men-believe-a-wage-gap-exists.html", "ord_in_thread": 0, "title": "Only 61 percent of men believe a wage gap exists, new study finds", "locations": [], "entities": {"persons": [{"name": "mark wahlberg", "sentiment": "none"}, {"name": "ellevest", "sentiment": "none"}, {"name": "michelle williams", "sentiment": "none"}, {"name": "jennifer lawerence", "sentiment": "none"}, {"name": "emma stone", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "hollywood rep", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It was reported on Thursday by the Hollywood Reporter that Michelle Williams, who was nominated for a Golden Globe for \"All the money in the world,\" was paid $625,000 for her work on the film, while her costar Mark Wahlberg made $5 million for a similar amount of screen time . And as many take aim at the gender wage gap — from other Hollywood heavyweights like Jennifer Lawerence and Emma Stone to the country of Iceland — some still don't believe it exists.\nOnly 61 percent of men believe that men make more than women for performing the same jobs, according to a new census of 2,000 American professional men and women by Ellevest, an online investing platform aimed at women. The remaining 39 percent of men either do not believe the gap is real, or chose not to answer the survey question.\nIn comparison, 83 percent of all women surveyed said they believe there is a gender wage gap. However, that number is higher for some minorities: 91 percent of LGBTQ women surveyed said they believe there is a gender wage gap, as did 87 percent of the women of color.\nWomen aren't feeling too great about their overall treatment in the workplace, the survey reveals.\nForty-eight percent of women overall think that women have to work twice as hard to earn half as much, which is a sharp contrast to only 25 percent of men who believe that to be true.\nThe wage gap Despite Ellevest's findings, the Institute for Women's Policy and Research (IWPR) reports that in 2015, women earned 80 cents for every dollar earned by men.\nIf the current push for pay equity — led by high-profile people including Oprah Winfrey and Venus Williams — continues at its current clip, women will continue to be outearned by men until 2059. For women of color, that timeline is even longer; the IWPR found that for pay equity, white women will have to wait until 2056, Hispanic women would have to wait until 2233 and black women until 2124. \nHowever, other countries are making legislative strides toward closing that gap: Earlier this month Iceland started enforcing a new law requiring employers with at least 25 workers to prove that they are paying men and women equally for equal work.\nDaniel Acker | Bloomberg | Getty Images Sallie Krawcheck \"Around the world, more women are speaking truth to power, and I believe we've reached a tipping point. Those who can't or won't see the inequalities woman face will either come around and join us on the path to progress — or they'll have to get out of the way,\" ex-Wall Street executive and Ellevest co-founder and CEO Sallie Krawcheck says.\nFinancial Satisfaction In addition to a disconnect with the reality of the wage gap, Ellevest's survey also found that in comparison to men, women are far less satisfied in every aspect of their financial lives.\nThe census reveals that while 55 percent of male respondents are satisfied with their current salary and compensation, only 47 of women overall and 40 percent of women of color feel that way. The gap widens even further when it comes to bank accounts: 51 percent of men surveyed are satisfied with their current bank account balances, compared to just 39 percent of women.\nAs for their investment portfolio, 50 percent of men said they are satisfied, compared to just 37 percent of women. Ellevest's census also found that while 52 percent of men say they \"feel financially prepared to face the unexpected,\" only 39 percent of women feel the same.\n\"As women we have a number of money gaps. We don't invest as much as men do…we don't make the money men do, we aren't as advanced at work as men, things actually cost us more, [and] we have a gender debt gap,\" Krawcheck previously told CNBC's \"On the Money.\"\n\"We're not going to be equal until we're financially equal,\" Krawcheck said.\nDon't miss: Men most regret not investing—but women have a very different No. 1 money regret \nshow chapters Melinda Gates: Tackling gender wage gap      9:18 AM ET Tue, 10 March 2015 | 02:17 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-19T16:30:00.000+02:00", "crawled": "2018-01-19T17:13:30.044+02:00", "highlightTitle": ""}