{"organizations": [], "uuid": "6aaeb725583430aeeaf0e277131aae89f9b34344", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958758-Draghi_ECB_2_.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/ecb-preview-dont-expect-a-more-hawkish-policy-just-yet-analysts-say.html", "country": "US", "domain_rank": 767, "title": "Don't expect a more hawkish ECB just yet, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T08:08:00.000+02:00", "replies_count": 0, "uuid": "6aaeb725583430aeeaf0e277131aae89f9b34344"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/ecb-preview-dont-expect-a-more-hawkish-policy-just-yet-analysts-say.html", "ord_in_thread": 0, "title": "Don't expect a more hawkish ECB just yet, analysts say", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "negative"}, {"name": "alex kraus", "sentiment": "negative"}, {"name": "claus vistesen", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}, {"name": "vistesen", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "pantheon macroeconomics", "sentiment": "none"}, {"name": "european banking congress", "sentiment": "none"}, {"name": "frankfurt finance week", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Alex Kraus | Bloomberg via Getty Images Mario Draghi, president of the European Central Bank (ECB), delivers a speech during the European Banking Congress on the final day of Frankfurt Finance Week in Frankfurt, Germany, on Friday, Nov. 17, 2017. \nThe European Central Bank (ECB) is not expected to make any major policy announcements Thursday, despite signaling a growing appetite for revising its policy message in \" early \" 2018. \n\"We are about to begin of one of the most interesting phases for the ECB in a long time,\" Claus Vistesen, chief euro zone economist at Pantheon Macroeconomics, told CNBC in a telephone interview. \nVistesen said ECB President Mario Draghi should expect to be faced with a \"barrage\" of questions over how fast the central bank is likely to change monetary policy, before adding it was about time he answered them. \n\"They have plenty of cover in terms of economic data to be more hawkish but, then again, this is Draghi right? Investors are not used to it,\" he added. Robust data and euro strength show chapters 7:24 AM ET Mon, 22 Jan 2018 | 01:26 \nStable job creation, as well as surging business and consumer confidence, has caused many economists to upwardly revise their economic forecasts for several major European economies. \nWith the euro zone seeing its best economic growth in a decade, the ECB should gradually shift its stance to avoid a more disruptive move later, accounts of the central bank's December meeting showed when published on January 11. \nThe minutes prompted the euro to surge against the dollar, extending the single currency's rally throughout the opening days of the calendar year. The euro has gained more than 2 percent since the start of 2018 as a broadening recovery bolsters expectations the ECB may be forced to unwind its policy stimulus quicker than forecast. \nEuro strength remains one the main challenges the central bank needs to contend with over the coming months, as a stronger currency tends to soften inflation by making exports more expensive and imports cheaper. 'No incentive' to fuel ECB hawks \nFrederik Ducrozet, senior economist at Pictet Wealth Management, said in a research note published Monday that he did not anticipate any major changes in the ECB's communication on Thursday. \n\"There is no incentive for the ECB to fuel further hawkish market re-pricing at this stage, especially after core inflation disappointed again and the euro has strengthened,\" he added. Krisztian Bocsi | Bloomberg | Getty Images The stars of the European Union sit on banners flying outside the European Central Bank headquarters in Frankfurt, Germany, on July 20, 2017. \nOnce Italian elections are out the way and assuming the single currency does not strengthen even further, Ducrozet said the ECB could adopt a more hawkish tone in the spring. \nItaly is holding a general election on March 4 but it is unclear whether the country will manage to form a solid government. The vote, which is raising concern among some market participants, could prompt policymakers at the ECB to hold off on any major policy changes until later in the year. Inflation \nThe ECB has long-struggled to bring up core inflation to its aim of about 2 percent and the central bank is not projected to meet its target level until 2020 at the earliest. \nLate last year, the bank said headline inflation would be at 1.5 percent in 2017 and 1.2 percent in 2018. \nAt its last meeting in December, the ECB's main benchmark rates were left unchanged. In October, the ECB announced a reduction in the level of its monthly purchases from 60 billion euros ($71 billion) to 30 billion euros. At that time, the bank also said that its quantitative easing program would stay in place until September 2018. It kept the door open to further extensions in the program, depending on the economic conditions of the euro area. Sam Meredith Digital Reporter, CNBC.com Playing ", "external_links": [], "published": "2018-01-25T08:08:00.000+02:00", "crawled": "2018-01-25T08:10:26.004+02:00", "highlightTitle": ""}