{"organizations": [], "uuid": "81fb72da0313643583ed21857ad819b858a95dfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/03/30/100604229-20130330-1402-100.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/staples-taps-former-coca-cola-exec-as-ceo-to-replace-shira-goodman.html", "country": "US", "domain_rank": 767, "title": "Staples taps former Coca-Cola exec as CEO, to replace Shira Goodman", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T22:39:00.000+02:00", "replies_count": 0, "uuid": "81fb72da0313643583ed21857ad819b858a95dfd"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/staples-taps-former-coca-cola-exec-as-ceo-to-replace-shira-goodman.html", "ord_in_thread": 0, "title": "Staples taps former Coca-Cola exec as CEO, to replace Shira Goodman", "locations": [], "entities": {"persons": [{"name": "shira goodman staples", "sentiment": "negative"}, {"name": "adam jeffery", "sentiment": "none"}, {"name": "goodman", "sentiment": "none"}, {"name": "douglas", "sentiment": "none"}, {"name": "staples", "sentiment": "none"}, {"name": "john lederer", "sentiment": "none"}, {"name": "shira goodman", "sentiment": "none"}, {"name": "j. alexander douglas", "sentiment": "none"}], "locations": [{"name": "staples", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "negative"}, {"name": "sycamore partners", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "office depot", "sentiment": "none"}, {"name": "cnbc  staples", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Staples taps former Coca-Cola exec as CEO, to replace Shira Goodman Staples' Chief Executive Officer Shira Goodman is departing the company. Goodman will be replaced by J. Alexander Douglas, who most recently served at Coca-Cola. The news comes just a few months after Staples was acquired by private-equity firm Sycamore Partners. CNBC.com Adam Jeffery | CNBC \nStaples' Chief Executive Officer Shira Goodman is departing the company , to be replaced by J. Alexander Douglas, the company announced Friday afternoon. \nThe changes will be effective April 2, and Staples' Executive Chairman John Lederer will lead the company on a day-to-day basis in the interim. \nDouglas (also known as Sandy) most recently served as president of Coca-Cola 's North American division and also spent time at Procter & Gamble . \n\"Sandy has extensive experience across multiple function areas including sales, marketing, merchandising and operations,\" Lederer said in prepared remarks. \"The North American Delivery business has a significant opportunity to accelerate long-term growth.\" \nGoodman began leading the office supply retailer in 2016, shortly after Staples failed to merge with Office Depot. She previously had served as president of Staples' North American operations and has served in \"various leadership roles\" at Staples since 1992, according to her LinkedIn profile. \nPrivate-equity firm Sycamore Partners acquired Staples for $6.9 billion late last year, adding to its retail holdings that include Talbots, Coldwater Creek, Hot Topic and Nine West. The goal for Sycamore was to turn the struggling retailer around, with a bigger focus on serving a corporate market. \nSycamore financed its acquisition of Staples in three parts. The arrangement allowed banks to finance the strongest parts of the business separately and give Sycamore the option to wind down its weakest unit — the retail business — at a later date. \nStaples' business still has some bright spots and profitable segments, but its stores are increasingly threatened by the likes of Amazon and other retailers that sell less-expensive goods. \nMeanwhile, Sycamore is in the midst of raising its biggest-ever fund, which it will use to invest primarily in retail, sources familiar with the situation have told CNBC .", "external_links": [], "published": "2018-01-26T22:39:00.000+02:00", "crawled": "2018-01-26T22:42:25.003+02:00", "highlightTitle": ""}