{"organizations": [], "uuid": "2be93d144202aa263dfde38018adcd7d98edacdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937254-TonyRobbins_BestSelf_Co.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/what-entrepreneurs-learned-after-winning-a-fiji-stay-with-tony-robbins.html", "country": "US", "domain_rank": 767, "title": "What 2 entrepreneurs learned after they won a stay in Fiji with Tony Robbins", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T17:07:00.000+02:00", "replies_count": 0, "uuid": "2be93d144202aa263dfde38018adcd7d98edacdf"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/what-entrepreneurs-learned-after-winning-a-fiji-stay-with-tony-robbins.html", "ord_in_thread": 0, "title": "What 2 entrepreneurs learned after they won a stay in Fiji with Tony Robbins", "locations": [], "entities": {"persons": [{"name": "cathryn lavery", "sentiment": "positive"}, {"name": "allen brouwer", "sentiment": "positive"}, {"name": "lavery", "sentiment": "none"}, {"name": "brouwer", "sentiment": "none"}, {"name": "tony robbins", "sentiment": "none"}, {"name": "shopify", "sentiment": "none"}, {"name": "bestself co allen brouwer", "sentiment": "none"}], "locations": [{"name": "fiji", "sentiment": "none"}], "organizations": [{"name": "tony robbins cnbc.com courtesy of bestself co", "sentiment": "positive"}, {"name": "self journal", "sentiment": "none"}, {"name": "bestself co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Courtesy of BestSelf Co Entrepreneurs Cathryn Lavery and Allen Brouwer won a chance to meet with Tony Robbins for personal mentorship SHARES \nCathryn Lavery and Allen Brouwer spent one year researching what makes people more productive and happy . \nAfter reading hundreds of books and listening to thousands of podcasts, the entrepreneurs ended up with a start-up, BestSelf Co , and a productivity journal called the SELF Journal. \nLavery and Brouwer raised more than $300,000 on Kickstarter in 2015 and then sold the SELF journal and other products to more than 100,000 customers in their first year of business. They also were one of eight winners of Shopify's Build a BIGGER Business competition , which highlights some of the fastest growing businesses selling on Shopify. Source: BestSelf Co Allen Brouwer and Cathryn Lavery, co-founders of BestSelf Co \nThe win came with a sweet prize: One-on-one time with entrepreneur Tony Robbins, who has been nicknamed the \" CEO whisperer \" for his ability to help leaders grow their businesses. Lavery and Brouwer, along with the other winners, spent five days at Robbin's Fiji resort for personal and group mentoring. \nTheir main takeaway from Robbins? Think long-term and think bigger. \n\"Without question, our biggest takeaway was the importance of staying focused on the long-term vision rather than the day-to-day — to stop you getting left behind,\" the co-founders tell CNBC Make It . \n\"Tony talked about big, successful businesses that seemed untouchable. But they got caught playing catch-up because they hadn't given enough thought to the future. They didn't anticipate the changing market, which created space for a competitor to knock them off the top spot.\" Courtesy of BestSelf Co Tony Robbins mentors Cathryn Lavery and Allen Brouwer \nRobbins encouraged them to answer three questions: What business are you in now? In the long term, what business do you need to be in? What are the steps you need to take to close the gap? \nFor Lavery and Brouwer, who sell paper journals, the experience encouraged them to think about how to diversify their products in order to offer something for those who prefer digital products. They started by launching a free Chrome extension that blocks distracting websites and helps you get more done. Source: BestSelf Co The SELF Journal by BestSelf Co \nAs for how to maintain a long-term view and continue to adapt to a changing market, the key is to not fall in love with your product, the co-founders learned: \"If you stay focused on your product, you can lose sight of the changing market.\" \nOn the flip side, \"if you fall in love with your customers , you'll have access to the information you need to keep serving them in innovative and interesting ways. That's how you survive long-term.\" ", "external_links": [], "published": "2018-01-10T17:07:00.000+02:00", "crawled": "2018-01-10T17:27:29.016+02:00", "highlightTitle": ""}