{"organizations": [], "uuid": "156b93c36f5c71a31cf57d11b3a85e853c1c91cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/08/104887780-GettyImages-887887070-bitcoin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/bitcoin-has-little-shot-at-ever-being-a-major-global-currency.html", "country": "US", "domain_rank": 767, "title": "Bitcoin has little shot at ever being a major global currency", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T21:48:00.000+02:00", "replies_count": 0, "uuid": "156b93c36f5c71a31cf57d11b3a85e853c1c91cd"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/bitcoin-has-little-shot-at-ever-being-a-major-global-currency.html", "ord_in_thread": 0, "title": "Bitcoin has little shot at ever being a major global currency", "locations": [], "entities": {"persons": [{"name": "rick findler", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}], "locations": [{"name": "omaha", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "metals bitcoin", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Materials and Metals Bitcoin has little shot at ever being a major global currency Oracle of Omaha, Warren Buffett, said on CNBC Wednesday morning that the speculation in bitcoin, and other cryptocurrencies, \"will have a bad ending.\" Cryptocurrencies have fallen 10 percent to 20 percent in value in recent days. Anytime bitcoin is mentioned, it is expressed in U.S. dollar terms. Rick Findler | PA Images | Getty Images A customer uses a Bitcoin machine in Piccadilly Circus in London. \nWith cryptocurrencies still in the news, tumbling 10 percent to 20 percent in recent days thanks in part to a change in calculating how the coins are valued, the debate rages on as to whether bitcoin , ethereum, ripple, bitcoin cash and litecoin are, in fact, money. \nThe Oracle of Omaha, Warren Buffett, said on CNBC W ednesday morning that the speculation in bitcoin, and other cryptocurrencies, \"will have a bad ending.\" \nAppropriately, dogecoin, a digital currency that began as a joke based on an internet meme, has risen sharply in recent days and hit a total value of $2 billion. By Wednesday it had retreated to a market value of about $1.5 billion, according to CoinMarketCap. \nBut rather than seeing all these digital currencies as a small part of a larger system known as blockchain, I am predisposed to view them as just speculative tokens in a cryptocurrency bubble that has inflated more quickly than any other in financial market history. \nAdmittedly I'm green with envy for failing to foresee the explosive rally in the price of bitcoin when it was first brought to my attention several years ago. \nHaving said that, there are many things I find quite ironic about how bitcoin and other \"cryptos\" are described. \nFirst, they are largely denominated, or discussed, in U.S. dollar terms. \nIf, however, you are buying and selling these currencies on the various exchanges, then, generally speaking, the currencies trade against one another. \nBitcoin, bitcoin cash, ethereum or litecoin, are cross-traded, just like on traditional foreign exchange markets, where dollars are priced in value against yen, euros, Swiss francs or Chinese yuan. \nThese exchanges are easy to pull up on a computer screen but not that easy to use. It's much easier to buy and sell dollars, stocks or commodities than it is to trade bitcoin and its brethren. \nThe conversion of one crypto to another is relatively easy on these embryonic exchanges. But getting your digital wealth converted into cold hard cash is more problematic. \nIf the dollar is archaic, as the crypto-enthusiasts believe, why not speak only in crypto-terms? \nBecause the dollar remains the reserve currency of the globe. Its usage remains widespread, accounts for roughly 65 percent of all global economic transactions. \nIn the U.S. alone, one of the broad gauges of the nation's money supply, known as M2, totaled nearly $14 trillion as of December 2017. And that doesn't count even broader measures of the U.S. money supply and the dollar-denominated accounts held all around the world. \nNor does it count the tens of trillions of other sovereign currencies sloshing around the globe, all readily convertible to one another. \nThe total market value of all cryptocurrencies is roughly $600 billion, give or take a hundred billion. And while the growth has been impressive, it remains very difficult to walk into any establishment and exchange a digital token for goods or services. Founders' Worth Measured in U.S. Dollars \nInterestingly, also, is the fact that the founders of cryptocurrencies and other early entrants into the field, some of whom have been named among the wealthiest people in the world, talk about their worth in dollars, not digital coins. \nYou rarely, if ever, hear anyone say how many bitcoin they own. If they disclose that information at all, they talk about the dollar value of their holdings. \nCryptocurrency wealth is valued in dollars, isn't that ironic? \nThe Winklevoss twins are said to be the first bitcoin billionaires in history, for example. \nI understand that the entire development of this ecosystem is new, hence the need to compare it to existing forms of money. And, yes, 10 or 20 years from now, dollars may be obsolete and bitcoin could be the world's reserve currency. \nAchieving that goal may be quite hard. There have been only a handful of generally accepted forms of reserve currency in modern economic history — gold, the British pound sterling, very briefly, the French franc, and, of course, the U.S. dollar. \nIt strikes me as quite concerning that exchanges that have begun trading bitcoin derivatives settle their contracts in cash. And there exchange traded funds, or ETFs, that dabble in digital currencies coming soon to a market near you. \nRather interestingly, holders of digital derivatives do not take delivery in bitcoin, as you might gold, silver, or stocks. They cash out in dollars. It's like using tokens in a slot machine that will pay out in cash, or scrip, if you happen to win a potful. \nThis, of course, is not required when you buy a good or service with a U.S. dollar. The dollar is simply exchanged for the comparable value of goods and services and, whiles taxed as a retail sale; there is no profit or loss shown. \nUnderstanding of the history of money, the language associated with it, and how much time it takes for a currency to become generally acceptable has a very long tail. \nThe adoption of cryptocurrencies as a global source of funds has a long way to go before staking a claim to the world's economy. \nAnd unless, or until, the world starts transacting and measuring wealth in some alternative currency, the crypto-critics will likely have the upper hand, even if they haven't played that hand terribly well to date. \nAs a long-term investor, Buffett told CNBC he would be glad to buy five-year \"puts\" (downside bets) on all of the cryptocurrencies. He added, however, that he would \"would never short a dime's worth.\" \nThere's an old saying on Wall Street, \"markets can remain irrational for longer than investors can remain solvent.\" \nThat's never been more true than today. Ron Insana Senior Analyst & Commentator, CNBC Related Securities ", "external_links": [], "published": "2018-01-10T21:48:00.000+02:00", "crawled": "2018-01-10T22:19:45.023+02:00", "highlightTitle": ""}