{"organizations": [], "uuid": "79b00ced716bb733dc6a763b9f8cc20a3a930520", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/30/reuters-america-mexicos-oil-reform-a-boon-for-hard-hit-oil-service-seismic-firms.html", "country": "US", "domain_rank": 767, "title": "Mexico's oil reform a boon for hard-hit oil service, seismic firms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T22:11:00.000+02:00", "replies_count": 0, "uuid": "79b00ced716bb733dc6a763b9f8cc20a3a930520"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/reuters-america-mexicos-oil-reform-a-boon-for-hard-hit-oil-service-seismic-firms.html", "ord_in_thread": 0, "title": "Mexico's oil reform a boon for hard-hit oil service, seismic firms", "locations": [], "entities": {"persons": [{"name": "adriana barr", "sentiment": "negative"}, {"name": "marianna parraga", "sentiment": "negative"}, {"name": "enrique pena nieto", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "mins ago reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pemex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mexico's oil reform a boon for hard-hit oil service, seismic firms Marianna Parraga and Adriana Barrera Published 22 Mins Ago Reuters \nHOUSTON/MEXICO CITY, Jan 30 (Reuters) - Oil service and mapping firms still emerging from an industry recession have received a boost from about $800 million of data sales to energy firms considering bidding for Mexican oil and gas blocks. \nMexico will on Wednesday hold its most important auction since a 2013 reform ended the 75-year monopoly on the energy sector held by state-run oil firm Pemex. \nThe government of President Enrique Pena Nieto hopes the deepwater sale will attract tens of billions of dollars of investment to turnaround a slump in the country's oil output. Seven previous auctions drew investment pledges of $61 billion. 1/8Link to Graphic on offered areas: http://tmsnrt.rs/2DGpgnB 3/8 \nInternational oil firms will this week bid for blocks on the Mexican side of the Gulf, which they expect to hold large reserves. The same companies have pumped billions of barrels of crude from fields in U.S. waters nearby. \nMexico has done little deepwater exploration, so not much is known about the energy reserves. \nThat has created strong demand for whatever data oil service and seismic firms can offer. Mexico has given survey companies all the information it has in an effort to build appetite for the auctions. \n\"Because there is less information about reserves there, and more risk that there are not big reserves, companies are willing to pay for data,\" said an executive from one of the registered bidders who could not be identified because he was not authorized to speak publicly. \nCompanies including Schlumberger, France's CGG SA, Ion Geophysical and Seitel Inc have spent $2 billion undertaking their own seismic surveys since 2015. They have also reprocessed Pemex's old data on the region. \nSchlumberger said it was \"fully committed\" to its customers in Mexico, but declined to elaborate on its business. The other three companies did not respond to requests for comment. \nAmong companies bidding at Wednesday's auction are China Offshore Oil Corp, ExxonMobil and Total SA. \nMore data sales, which are tracked by Mexico's energy regulator, are expected for further rounds and joint ventures this year as the country puts some 66 percent of its prospective oil reserves on the block. \nSome energy firms only pay for detailed data packages after they win areas, two executives involved in exploration work in the Americas said. \n\"The geological data business in Mexico has been good, not spectacular, but good,\" said a source at Schlumberger on condition of anonymity. \nThe seismic industry was hit hard by the crash in oil prices in 2014 and ensuing recession. International oil firms cut back on exploration, especially in areas considered expensive to develop such as deepwater. \nEven with the Mexico data sales, the sector continues to struggle. Schlumberger this month announced the closure of its marine and land seismic acquisition business, two of four units at its WesternGeco subsidiary. \nPUSHING PEMEX \nIn its efforts to break Pemex's monopoly and attract international oil firms, the Mexican government has charted a more aggressive reform than others Latin American countries. \nTo encourage oil service and mapping firms to work quickly and extensively, the government gave them licenses for up to 12 years to sell data they collect. \n\"On the American side (of the Gulf of Mexico), there is a tonne of information. On the Mexican side, very little. So they had to have a solution, a way to speed it up,\" Marcio Felix, Brazil's oil and gas secretary, said on Monday. \nThe Mexican regulator, the National Hydrocarbon Commission (CNH), opened all of Pemex's data to seismic firms, licensing them to reprocess and sell it. \nIn countries including Brazil and Venezuela, state-run oil companies have kept most of their seismic data from rivals, giving them an advantage in areas where they are considered strong. \n\"Pemex has had to give up a lot to make the reform work,\" said Luis Vierma, exploration and production consultant and former vice-president of Venezuela's PDVSA. \nThe CNH has said the data, which includes information from 30,000 oil and gas wells, belongs to the country, not Pemex. \nFor Pena Nieto's government, the stakes are high. Energy reform was one of its top economic priorities, and the administration wants to show progress ahead of a presidential election in July. \nMexico faces stiff competition from other Latin American countries keen to attract investment from energy firms. Brazil, Ecuador, Uruguay and Argentina are set to auction oil and gas blocks this year. \nThat has Mexico determined to make the auctions successful - even if it means giving up Pemex's secrets. \n\"Only one player (Pemex) gains if the geological information is kept confidential,\" said Horacio Cuenca, a research director at consultancy Wood Mackenzie. \"The whole country will benefit from opening up the data to secure equal access and accuracy.\" \n(Additional reporting by Ana Isabel Martinez and David Alire Garcia in Mexico City and Alexandra Alper in Rio de Janeiro; Editing by Gary McWilliams, Simon Webb and Andrew Hay)", "external_links": [], "published": "2018-01-30T22:11:00.000+02:00", "crawled": "2018-01-30T23:01:30.157+02:00", "highlightTitle": ""}