{"organizations": [], "uuid": "fc2420a6957feb40c5cf7b5c3655e60edd4d068e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953613-IMG_7372.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/tesla-brings-model-3-to-three-east-coast-showrooms.html", "country": "US", "domain_rank": 767, "title": "Tesla bringing Model 3 to three East Coast showrooms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T00:01:00.000+02:00", "replies_count": 0, "uuid": "fc2420a6957feb40c5cf7b5c3655e60edd4d068e"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/tesla-brings-model-3-to-three-east-coast-showrooms.html", "ord_in_thread": 0, "title": "Tesla bringing Model 3 to three East Coast showrooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tesla bringing Model 3 to three East Coast showrooms Tesla is bringing the Model 3 to showrooms in New York, Boston and Miami this week. This will be the first time many people in these cities will be able to see the car up close and climb inside it. Around 500,000 customers have made reservations for the car. 22 Hours Ago | 02:51 \nTesla is bringing its Model 3 to showrooms on the East Coast, giving local reservation holders a chance to see the car in person months after the company began production. \nThe electric-car maker will pull the cloth off Model 3s on Friday at its store in Manhattan's Meatpacking district, and in its showroom on Boston's Boylston Street. The car will debut in Miami this weekend. \nCustomers at these showrooms can see it up close, sit inside and ask questions about the vehicle many have handed over $1,000 to reserve. Robert Ferris | CNBC A Tesla Model 3 on display at a showroom in New York on Jan. 18th, 2018. \nTesla recently also debuted Model 3 showroom vehicles at Tesla stores in Los Angeles and Palo Alto, California. The company, which does not sell through dealers, has more than 100 showrooms and galleries spread across the United States. Around 500,000 customers have made reservations for the car. Model 3 is Tesla's lowest-priced car. The company has said the s tarting sticker price is $35,000, but it began production with more expensive versions with longer battery range. \nThe car is viewed by many as the model that will either make or break Tesla as a mass market automaker, or perhaps as a company altogether. Tesla has rarely had a profitable quarter since going public in 2010 and has spent billions building its auto, energy storage, and solar businesses. \nTesla has been ramping up production of the Model 3. Tesla had said it planned to reach a production rate of 5,000 Model 3s per week by the end of 2017, but later moved that target to the end of the first quarter of 2018, and then moved it again, to the end of the second quarter. ", "external_links": [], "published": "2018-01-19T00:01:00.000+02:00", "crawled": "2018-01-19T00:10:51.008+02:00", "highlightTitle": ""}