{"organizations": [], "uuid": "2bf97930d7f0a371deedc8ba36e0f0c9488c772c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "raceAhead: Zuckerberg’s New Resolve, Genocide Spurred on By Facebook Posts and Toxic Femininity – Fortune", "url": "http://fortune.com/2018/01/05/raceahead-mark-zuckerberg-facebook-genocide-toxic-femininity/", "country": "US", "domain_rank": 1196, "title": "raceAhead: Zuckerberg’s New Resolve, Genocide Spurred on By Facebook Posts and Toxic Femininity", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T22:17:00.000+02:00", "replies_count": 0, "uuid": "2bf97930d7f0a371deedc8ba36e0f0c9488c772c"}, "author": "Ellen McGirt", "url": "http://fortune.com/2018/01/05/raceahead-mark-zuckerberg-facebook-genocide-toxic-femininity/", "ord_in_thread": 0, "title": "raceAhead: Zuckerberg’s New Resolve, Genocide Spurred on By Facebook Posts and Toxic Femininity", "locations": [], "entities": {"persons": [{"name": "zuckerberg", "sentiment": "negative"}, {"name": "erica garner", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "roy cohn", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "carson jones", "sentiment": "none"}], "locations": [{"name": "west wing", "sentiment": "none"}], "organizations": [{"name": "facebook posts", "sentiment": "negative"}, {"name": "baltimore", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Your week in review, in haiku\n \n1.\nEssence Magazine:\nNow black-owned, women-lead. Yes,\nsome dreams do come true.\n \n2.\nJeff goes grass backward,\nWest Wing bans cells. Now Roy Cohn?\nNice entrance, New Year.\n \n3.\nSmall button, big threat:\nYou won your job, we lost our\nminds. Wolff pack drama.\n \n4.\nCarson Jones's side-\neye, a line in the sand: Pray\nthis gay away, Veep.\n \n5.\nBomb cyclone never\nends: Baltimore students freeze.\nBlizzard of neglect.\n \n \nIn tribute: \nDaughter-mother breathes\npower, exhales oppression.\nErica Garner\n \nHave a warm and powerful weekend. \nOn Point [bs-title]Mark Zuckerberg's New Year Resolution: Fix Facebook[/bs-title][bs-content]His resolution, announced yesterday is a tacit acknowledgement of the many problems the platform has faced in 2017, from abuse on the platform, the rise of propaganda and false news and advertising which runs afoul of discrimination laws. \"The world feels anxious and divided, and Facebook has a lot of work to do,\" he wrote in a Facebook post. \"We won't prevent all mistakes or abuse, but we currently make too many errors enforcing our policies and preventing misuse of our tools.\"[/bs-content][bs-link link=\"http://fortune.com/2018/01/04/mark-zuckerberg-new-years-resolution-2018/\" source=\"Fortune\"]\n[bs-title]Is Facebook fueling the Rohingya genocide?[/bs-title][bs-content]If I were Zuckerberg, I'd put this issue high on the to-do list. Robert Huish and Patrick Balazo, researchers from Dalhousie University in Canada, have data that suggests the overabundance of ultra-nationalist Myanmar (Burmese) propaganda and anti-Rohingya hate speech on Facebook has played a lead role in the genocide. For complex reasons of cost and access, many people in Myanmar view Facebook as the internet. \"[T]his open information pipeline reinforces Facebook's dark side of self-reaffirmation with limited perspective,\" they say. It has precedent: The tactical use of radio in fueling the 1994 Rwandan genocide is one example they cite.[/bs-content][bs-link link=\"https://theconversation.com/unliked-how-facebook-is-playing-a-part-in-the-rohingya-genocide-89523\" source=\"The Conversation\"]\n[bs-title]Building safe spaces at work[/bs-title][bs-content]In the ongoing conversation about the role Employee Resource Groups (ERGs) should play in the workplace, Mekaelia Davis, a program officer with the Prudential Foundation, advocates for a reimagining that better reflects the intersections that inform people's identities. \"Employees who identify as black and gay and veteran, for instance, may not be able to speak about their concerns or share ideas in a group that excludes any one of these identities, let alone feel safe in offering their unique perspective towards business challenges,\" she says. How to accomplish this is the challenge. Click through for her advice for building safe sub-spaces between existing ERGs.[/bs-content][bs-link link=\"https://work.qz.com/1160644/if-you-really-want-a-diverse-workplace-you-have-to-build-safe-spaces/\" source=\"Quartz\"]\n[bs-title]A YouTuber's ugly \"prank\" raises bigger questions[/bs-title][bs-content]It was a disgusting display. YouTube star Logan Paul traveled to the Aokigahara, the Japanese forest where suicides are common, and giggled his way through a video showing a suicide victim. The video got six million views before it was taken down amid a storm of complaints . Paul, known for his pranks and stunts, has gotten rich via advertising on YouTube, which is part of the problem. Google has been hands off on monitoring popular channels for inappropriate content, and the Paul debacle has newly alarmed parents and experts. \"There is no filter when it comes to YouTube stars,\" Jill Murphy from the non-profit advocacy organization Common Sense Media told USA Today. \"It's not until something tragic is shown via a video, and viewers react, that the content is removed or dealt with by the platform.\" ( Rerunning with correct link and apologies - EM) [/bs-content][bs-link link=\"https://www.usatoday.com/story/tech/news/2018/01/03/logan-paul-suicide-video-youtube-not-safe-kids/998480001/\" source=\"USA Today\"]\nThe Woke Leader [bs-title]Toxic femininity in the workplace[/bs-title][bs-content]This hot take is a must for anyone who believes that the impending overthrow of the patriarchy isn't going to come with real problems. They're just not the problems that most people might have anticipated. You think that running a meeting efficiently, not talking over other people and respecting other's time is a magic bullet for workplace harmony? Read it and weep with laughter.[/bs-content][bs-link link=\"https://www.newyorker.com/humor/daily-shouts/examples-of-toxic-femininity-in-the-workplace/amp?__twitter_impression=true\" source=\"New Yorker\"]\n[bs-title]Is a lack of a college education a public health crisis?[/bs-title][bs-content]There are many issues at play in this piece set in hardscrabble Kennett, Missouri, once the home of singer Sheryl Crow, now a road to nowhere. It's in the part of Missouri called the Bootheel, for its distinctive shape on the map, but it's also \"...a place, one of many in America, where disadvantages pile up,\" say writers Sarah Brown and Karin Fischer. \"Educational disparities and economic malaise and lack of opportunity are making people like those in the Bootheel sick. And maybe even killing them.\"[/bs-content][bs-link link=\"https://www.chronicle.com/interactives/public-health\" source=\"Chronicle of Higher Education\"]\n[bs-title]Don Hogan Charles, the first black staff photographer to be hired by the NYT, has died[/bs-title][bs-content]You may not know his name, but you certainly know his work - he took the now iconic photo of Malcolm X holding a rifle and looking out the window of his home. He won wide acclaim for his shots of everyday black life in Harlem, and was a vital chronicler of the civil rights era. Though he preferred not to be typecast, he felt an obligation to do the work. \"He felt that his responsibility was to get the story right, that the white reporters and white photographers were very limited,\" said Chester Higgins, another black NYT photographer of the era. Click through for his bio and a slide show of his work, and a truly wonderful photograph of the man himself, looking dapper on the streets he loved.[/bs-content][bs-link link=\"https://nyti.ms/2ptWxzV\" source=\"New York Times\"]\nQuote [bs-quote link=\"https://www.facebook.com/DesmondTutuOfficial/posts/1136360939841237\" author =\"Desmond Tutu\"]In my heart you are a dearly beloved younger sister. For years I had a photograph of you on my desk to remind me of the injustice and sacrifice you endured out of your love and commitment for Myanmar's people. You symbolised righteousness. In 2010 we rejoiced at your freedom from house arrest, and in 2012 we celebrated your election as leader of the opposition...Your emergence into public life allayed our concerns about violence being perpetrated against members of the Rohingya. But what some have called 'ethnic cleansing' and others 'a slow genocide' has persisted -- and recently accelerated. The images we are seeing of the suffering of the Rohingya fill us with pain and dread...My dear sister: If the political price of your ascension to the highest office in Myanmar is your silence, the price is surely too steep.[/bs-quote]\n", "external_links": [], "published": "2018-01-05T22:17:00.000+02:00", "crawled": "2018-01-05T22:24:19.024+02:00", "highlightTitle": ""}