{"organizations": [], "uuid": "3c016b763c21e401f5965ea039b5ae1e2d291d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104818919-GettyImages-869590214.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/aapls-iphone-unit-sales-could-be-weak-bernsteins-toni-sacconaghi.html", "country": "US", "domain_rank": 767, "title": "Another Apple analyst predicts weak growth in iPhone sales this spring", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:20:00.000+02:00", "replies_count": 0, "uuid": "3c016b763c21e401f5965ea039b5ae1e2d291d3e"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/aapls-iphone-unit-sales-could-be-weak-bernsteins-toni-sacconaghi.html", "ord_in_thread": 0, "title": "Another Apple analyst predicts weak growth in iPhone sales this spring", "locations": [], "entities": {"persons": [{"name": "tomohiro ohsumi", "sentiment": "negative"}, {"name": "sacconaghi", "sentiment": "none"}, {"name": "toni sacconaghi", "sentiment": "none"}, {"name": "bernstein", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Checks with supply-chain vendors indicate that Apple's iPhone sales may decline about 33 percent between the December 2017 and March 2018 quarters, Bernstein analyst Toni Sacconaghi wrote in a research note released on Tuesday.\nHe predicts Apple will offer implied guidance of 51 million to 57 million iPhones sold for the March quarter, lower than consensus guidance estimates of 62 million. Last year, Apple sold 51 million iPhones in the March quarter.\n\"At a high level, noise in the supply chain appears most pronounced about Apple's March quarter, consistent with the fact that sequential declines could be in line, or worse than recent history,\" Sacconaghi said.\nThat's not too unusual on its own — Apple usually sells about 30 percent fewer iPhones in the quarter after the holiday shopping rush, Sacconaghi wrote. But the pricey iPhone X was widely expected on Wall Street to drive a \"super-cycle\" thanks to its new form factor, including a screen that takes up the entire front face.\nSo if 2018 turns out to be normal by Apple's standards, it could be a disappointment to investors.\nSacconaghi is the latest analyst to share a sober view of Apple's iPhone X prospects.\nResearch from JP Morgan briefly dinged Apple's stock on Tuesday , predicting that manufacturing of the iPhone X might drop 50 percent between the December and March quarters. Taiwanese media and some supply-chain analysts have also speculated that Apple might be scaling back on its iPhone X production plans.\nStill, Sacconaghi said that since November investors have started adjusting expectations downward, as well as factoring in a boost from tax reform.\nPlus, there are opportunities for Apple to surprise Wall Street. The company's secrecy and advanced, complex production techniques already make it hard to predict what Apple has planned. Now add to the mix higher prices, a staggered iPhone release schedule and an expanded product line that includes Apple Watch, AirPods and HomePod.\nApple did not immediately respond to a request for comment on the report.\nWATCH: Apple iPhone 6 battery: What happened when I tried to get it replaced show chapters Apple iPhone 6 battery: what happened when I tried to get it replaced 6:17 PM ET Fri, 19 Jan 2018 | 01:11", "external_links": [], "published": "2018-01-24T19:20:00.000+02:00", "crawled": "2018-01-24T19:51:46.010+02:00", "highlightTitle": ""}