{"organizations": [], "uuid": "aaae9539b391362bad3ad574d1951f774a94d243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943056-GettyImages-904147834.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/trump-says-london-us-embassy-is-off-location-but-apple-likes-it.html", "country": "US", "domain_rank": 767, "title": "Trump says the new London US embassy is ‘off location’ but it's good enough for Apple", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:42:00.000+02:00", "replies_count": 0, "uuid": "aaae9539b391362bad3ad574d1951f774a94d243"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/trump-says-london-us-embassy-is-off-location-but-apple-likes-it.html", "ord_in_thread": 0, "title": "Trump says the new London US embassy is ‘off location’ but it's good enough for Apple", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "london us", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "grosvenor square", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "pa images workers", "sentiment": "negative"}, {"name": "u.s. embassy", "sentiment": "none"}, {"name": "embassy", "sentiment": "none"}, {"name": "nine elms", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "us embassy in nine elms", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. President Donald Trump has told the world he won't visit London to officially open the new U.S. embassy as it is \"off location\" and a \"bad deal.\"\nThe U.S. Embassy in London moved to its new location in Nine Elms, an area in south London, in December 2017 and will be formally opened in February. It is understood that in Trump's absence the U.S. secretary of state Rex Tillerson will now cut the ribbon.\nTaking to Twitter, Trump said he thought the Obama administration had sold \"perhaps the best located and finest embassy in London for peanuts\", and he slammed the estimated $1.2 billion cost of the new project.\nTweet 1\nFollowing the tweet, many have pointed out that the original decision to move the Embassy away from its Mayfair location was actually during the final weeks of the George W. Bush presidency in 2008.\nAt the time, U.S. state department officials agreed to sell the Grosvenor Square building, in west London, to a Qatari Real Estate company, highlighting a lack of space and security concerns.\nNow, U.S. embassy employees in London will commute to a previously undeveloped site in south west London, bordered by the Thames River to the north and Battersea Power Station to the west.\nThe location may not be to Trump's taste but is he right to call it \"off location\" and what do we know about the new building?\nOff location? Trump may have a point when it comes to a loss of location prestige. The closing U.S. embassy was first sited at Grosvenor Square, Mayfair in 1938. The area houses almost nobody but the uber-rich, with prices for townhouses r egularly advertised at around $25 million .\nBordering Hyde Park and situated moments from Buckingham Palace, the Queen's residence, Mayfair is packed with Georgian era townhouses, gourmet restaurants and exclusive hotels such as Claridge's and The Dorchester\nGetty Images | Pawel Libera Claridges Hotel in London's Mayfair. The Nine Elms site that the new building sits on lies \"south of the river\". That's a red line for many wealthier buyers who deem the Thames as a southern barrier when considering luxury London property.\nWhile relatively central, Nine Elms has for many years been used for industrial purposes, populated by warehouses, scrap yards, garages and a fruit and veg market. Visually it was dominated by a network of railways lines and Battersea Power Station.\nNow, the area is the focus of expensive new residential developments with the new U.S. Embassy at its center. After physical work began in 2013 shops, cafes and restaurants have also sprung up.\nTwo new London Underground stations to serve the area are also under construction and a pedestrian bridge across the Thames to the north has also been agreed.\nMeet the neighbors The U.S. Embassy is considered an \"anchor\" development which has encouraged others to consider the area's potential. The embassy of the Netherlands in London announced in April 2013 that it would relocate to Nine Elms. The Chinese were also expected to move out of their large building in Marylebone and move to Nine Elms though this has not yet materialised.\nClaudio Divizia | iStock / 360 | Getty Images Just to the west of the new embassy is the iconic Battersea Power Station, also being developed under the Nine Elms regeneration.\nThe project, financed by a Malaysian consortium, received a big boost to its reputation when Apple said it would move its 1,400 London-based staff there.\nPop veteran Sting and celebrity survival expert Bear Grylls are among the most high-profile people to have committed to apartments in the area.\nWhat is the new building all about? At 518,000 square feet, the new building is twice as big as its predecessor which was said to be struggling to house staff .\nUS-based architect Kieran Timberlake won the right to design the building although its bold cube exterior has led to some negative commentary .\nGetty Images | Leon Neal Armed police patrol outside the new US embassy as soldiers prepare to raise the American flag for the first time on January 12, 2018. Aside from achieving more space, security was a key factor in the architect's brief. The building is surrounded by a moat deep enough to stop a large vehicle while concrete bollards are hidden in hedges.\nThe building itself is encased in 15cm thick bomb proof glass while plastic sails are in place to reduce solar glare.\nU.S. officials wanted at least 100 feet clearance from any neighbour, a major drawcard of the new Nine Elms development.\nTrump may not be certain about climate change but his new home in London is offering som green credentials. The roof and moat catch rainwater to fill toilet cisterns and the roof is decorated with electricity-generating solar panels.", "external_links": [], "published": "2018-01-12T15:42:00.000+02:00", "crawled": "2018-01-12T15:59:57.033+02:00", "highlightTitle": ""}