{"organizations": [], "uuid": "e9d287c69e93d2d2e6cab591e3ef199c3e929b04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "‘Salt Bae’ Might Spin Off Part of His Restaurant Business for an IPO – Fortune", "url": "http://fortune.com/2018/01/18/salt-bae-ipo/", "country": "US", "domain_rank": 1196, "title": "‘Salt Bae’ Might Spin Off Part of His Restaurant Business for an IPO", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T17:41:00.000+02:00", "replies_count": 0, "uuid": "e9d287c69e93d2d2e6cab591e3ef199c3e929b04"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/18/salt-bae-ipo/", "ord_in_thread": 0, "title": "‘Salt Bae’ Might Spin Off Part of His Restaurant Business for an IPO", "locations": [], "entities": {"persons": [{"name": "ferit sahenk", "sentiment": "negative"}, {"name": "sahenk", "sentiment": "none"}, {"name": "da mario", "sentiment": "none"}, {"name": "coya", "sentiment": "none"}, {"name": "gina", "sentiment": "none"}, {"name": "zuma", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "gunaydin", "sentiment": "none"}, {"name": "dogus holding as", "sentiment": "none"}, {"name": "dogus holding", "sentiment": "none"}, {"name": "dogus restaurant entertainment & management", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Turkish billionaire Ferit Sahenk is considering spinning off part of his restaurant business for a potential initial public offering, according to people with knowledge of the matter.\nSahenk's investment firm Dogus Holding AS is working with advisers to carve out some of the restaurants under Dogus Restaurant Entertainment & Management into a separate unit, said the people, asking not to be identified because the talks are private. The spin-off will contain the franchise of Japanese restaurant Zuma and the Nusr-Et steakhouse, popularly known by its founder chef's meme Salt Bae, among others, the people said.\nOnce the spin-off is complete, the new unit could sell a dollar-denominated bond later this year and then IPO in London in 2019, the people said. D.ream, as the restaurant business is known, operates outlets including Da Mario, Fenix, Coya, Gina and Gunaydin, according to its website.\n\"Food and beverages is an area that we are very focused on and are growing fast,\" Dogus Holding said in an emailed statement. \"We have various plans to further support this growth. 2018 will be a year that we will implement growth-oriented actions. We will do a lot of work in the area of food and beverages this year.\"\nSahenk, once Turkey's richest man, has been spending heavily on restaurants, marinas and hotels after selling his 31 percent stake in Turkiye Garanti Bankasi AS to Banco Bilbao Vizcaya Argentaria SA for almost $5.5 billion. One of Dogus Holding's biggest investments is the $1.5 billion development of Galataport, a cruise port and a compound of shopping malls on the Bosporus in central Istanbul.\nShares Advance Shares of Dogus Oto and Dogus Gayrimenkul Yatirim, which are also part of Dogus Holding, surged. Dogus Oto advanced as much as 4.8 percent, the biggest gain since Nov. 8, while Dogus GYO rose 9.3 percent.\nLosses at Dogus Holding, which also has interests in hotels, car sales, television, finance, construction and energy, widened to 1.48 billion liras ($390 million) in the first half of 2017 from 276 million liras loss a year earlier, according to the most recent data on its website. The company's total liabilities was 26.1 billion liras at the end of June.\nSahenk, who also owns Volkswagen AG's sole distributor in Turkey, is in talks to sell stakes in some assets and could strike a deal for one or more of these this year, Dogus Holding Chief Executive Husnu Akhan said in November. The company also wants to increase its number of hotels to 25 in three years from 19, he said.\nTurkish companies are expected to raise about $4 billion from IPOs this year, according to local brokerage Is Yatirim. They raised about $700 million from IPOs last year, up from $120 million in 2016 and the most since 2011, according to data compiled by Bloomberg.\n", "external_links": [], "published": "2018-01-18T17:41:00.000+02:00", "crawled": "2018-01-18T17:42:06.010+02:00", "highlightTitle": ""}