{"organizations": [], "uuid": "f2d31884b28ba17c5f18582fbb7759fd4130c744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926289-GettyImages-819002922.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/heres-why-amazon-may-not-buy-target.html", "country": "US", "domain_rank": 767, "title": "Here's why Amazon may not buy Target", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T21:49:00.000+02:00", "replies_count": 0, "uuid": "f2d31884b28ba17c5f18582fbb7759fd4130c744"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/heres-why-amazon-may-not-buy-target.html", "ord_in_thread": 0, "title": "Here's why Amazon may not buy Target", "locations": [], "entities": {"persons": [{"name": "gene munster", "sentiment": "negative"}, {"name": "mark kauzlarich", "sentiment": "none"}], "locations": [{"name": "city point", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "loup ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's why Amazon may not buy Target Loup Ventures' Gene Munster is predicting the e-commerce giant will buy Target in 2018. An acquisition of Target would be Amazon's largest yet. Target has a lot of company-owned real estate and its business is a mishmosh of offerings. SHARES Mark Kauzlarich | Bloomberg | Getty Images Pedestrians walk past the Target logo reflected in a window at City Point in Brooklyn, New York. \nLoup Ventures' Gene Munster is predicting the internet e-commerce company will buy Target in 2018. Industry sources aren't so sure. \nCertainly, Target's stock has swooned over the past year, and sources suggest it may need to do something transformative to address its challenges. It is the \"lost child\" of retailers, with no clear core competency (though a strong home and apparel business). It is unclear that a sale to Amazon though is in its future. \nAs a starting point, it is important to keep in mind that Amazon is prudent in its acquisitions and does not do many large-scale ones. Acquiring Target would be its largest deal yet. When Amazon does a big deal, it is looking for explicit capacities it lacks in areas it has already found challenging. \nWhen Amazon bought Whole Foods, it had been studying, investing and struggling to manage the business of fresh food for a long time prior. Whole Foods gave Amazon a strong brand name in the fresh food industry, expertise in managing foods and distribution centers for that food. \nIt similarly can be said for Amazon's $847 million acquisition of Zappos, which followed Amazon's unsuccessful dalliance with selling shoes and accessories through Endless.com. At the time of the Zappos deal, Endless was receiving 777,000 visitors a month according to Comscore, while Zappos got 4.5 million visitors, the New York Times then reported . \nThe question Amazon therefore faces in evaluating a Target deal are: 1) How much does Target offer that Amazon can't already do on its own; 2) Does Amazon need whatever Target does offer so badly that it justifies a purchase of a company with a market capitalization of $36 billion. \nHere are the considerations: Target's business is a mishmosh \nTarget is a little bit of this, a little bit of that — its roughly $70 billion in sales are scattered nearly equally across its various businesses. \nIn 2016, household essentials (pharmacy, beauty, etc.) generated 22 percent of its sales; food generated 22 percent; apparel and accessories generated 20 percent; furnishings and decor generated 19 percent and hardlines (electronics, sporting goods, etc.) generated 17 percent of its sales. \nMany of these businesses, particularly household essentials, home and hardlines, are areas in which Amazon already excels (it might, though, benefit from Target's furniture sales). It is therefore not clear that adding Target's hold on the those businesses would do much more than cannibalize Amazon's own sales. \nFood, meanwhile, is an area in which Target has struggled . Not to mention, Amazon already has a foothold into the space through its Whole Food's acquisition. \nApparel might be the one channel in which Target, at this moment, surpasses Amazon. It is also an industry Amazon seems to care about: It has invested in private label brands , launched a try- before-you-buy service and even patented a mirror that dresses you in virtual clothes. \nTarget has been largely successful in its clothing business, particularly in its private label ventures. Its Cat & Jack brand crossed the $2 billion mark a year after its launch. Target plans to launch at least 12 more brands on the heels of its success. \nBut part of Target's private label success has come from its focus away from selling third-party brands as a means of driving people into its stores and off of Amazon. Amazon, meanwhile, has been courting brands to sell on its website, including Nike . \nFurther, while Target has had success with private label, it is not clear that Amazon could not (or is not) successfully doing private label apparel on its own. Target's footprint is vast \nIt is unclear that Amazon needs to add Target's 1,834 stores. Target owns, not leases, the majority of its real estate. If Amazon buys Target, it also acquires its unproductive or less profitable stores and would be stuck managing them. Target, meanwhile, has been focusing on shifting its retail strategy, focusing on smaller and more productive stores in more urban locations. \nShould Amazon buy a retailer for its real estate, a more natural (and cheaper) choice might be Bed Bath & Beyond. A number of its leases are due to go up in the next couple of years, making it easier to roll off less attractive real estate. \nAmazon, like many other e-commerce companies, is increasingly appreciating the importance of brick and mortar. Stores help lower the cost of returns, shipping and marketing. \nBut Amazon's real estate plays so far have been very specific. Its Whole Foods acquisition helped it solve the unique problem of delivering fresh food, which requires infrastructure. It also signed a partnership with Kohl's last year, allowing shoppers to return items to Amazon from Kohl's stores. \nNot to mention, Amazon also already has roughly 322 distribution points, according to MWPVL International , a logistics consulting service. Integrating would be a challenge \nAmazon has certainly flirted with big box retailers, including its partnership with Kohl's. But partnering with a big box retailer and owning one are very different. In buying a big box retailer, Amazon also buys the headaches that come with it. \nOne of the biggest challenges of marrying the two is managing inventory and returns. Amazon has trained shoppers to become used to the \"extended aisle\" of online shopping — an endless assortment of products that are not sold in stores. Returns of these items for traditional retailers have become complicated and costly. \nStores can be left with \"orphan products\" — a random sweater they have no way to display, because a store doesn't typically sell it. Finding the sweater's way back home to a distribution center is also expensive. This seemingly minuscule problem can build up over time. \nNot to mention, consumer spending on apparel is dropping . Lauren Hirsch Retail Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-03T21:49:00.000+02:00", "crawled": "2018-01-03T22:03:51.033+02:00", "highlightTitle": ""}