{"organizations": [], "uuid": "af443d630d119c24213433279de5344f187c2694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/16/104656485-RTS167PS-opec-oil.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/oil-is-close-to-levels-not-seen-since-the-thanksgiving-2014-bloodbath.html", "country": "US", "domain_rank": 767, "title": "Oil prices are close to levels not seen since the Thanksgiving 2014 bloodbath", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T20:32:00.000+02:00", "replies_count": 0, "uuid": "af443d630d119c24213433279de5344f187c2694"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/oil-is-close-to-levels-not-seen-since-the-thanksgiving-2014-bloodbath.html", "ord_in_thread": 0, "title": "Oil prices are close to levels not seen since the Thanksgiving 2014 bloodbath", "locations": [], "entities": {"persons": [{"name": "essam al-sudani", "sentiment": "negative"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Essam Al-Sudani | Reuters \nA rally that kicked off in June has boosted oil prices to the highest closing levels in more than three years. \nThe oil price downturn is now 3½ years old, but it didn't gather devastating momentum until OPEC's fateful Thanksgiving day meeting in 2014. \nDuring that meeting, Saudi Arabia , OPEC's biggest producer and the world's top exporter, refused to cut production to kill a global oil glut and stop a five-month slide in prices. Crude futures, which were down about 30 percent from their June highs at that point, collapsed 10 percent in the next session and eventually plunged to 12-year lows . \nThe Saudis strategy of letting the oil market balance itself failed as U.S. producers learned to pump at lower prices. OPEC eventually conceded and agreed in November 2016 to curb output . \nNow, oil prices are at the highest closing levels since December 2014 and within close range of prices last seen on Nov. 28, 2014, the day after OPEC's decision. \nU.S. West Texas Intermediate crude ended Tuesday's session at $62.96 per barrel, compared with $66.15 on Nov. 28, 2014. Brent crude , the international benchmark, settled at $68.82, versus $70.15 the day after Thanksgiving 2014, when the market was closed. \nOn Wednesday, WTI hit a session peak of $63.67, its highest level since Dec. 9, 2014. Brent topped out at $69.37 on Wednesday, coming within 30 cents of taking out its May 2015 high. \nIt's uncertain whether the rally has enough momentum to close the gap with the post-Thanksgiving 2014 levels. From there, it's a long way to the pre-OPEC decision levels. WTI closed at $73.69 and Brent settled at $77.75 on Nov. 26, 2014. \nIn the first half of 2018, the seasonal drop in oil demand could pull crude futures out of sync with other commodities that are rallying, said Kevin Book, head of research for oil, gas and coal at Clearview Energy Partners. \n\"On a fundamental basis, the first half of year is about 1.5 million barrels per day weaker from a demand perspective than the second half of the year,\" he told CNBC's \" Squawk Box \" on Wednesday. show chapters 5 Hours Ago | 03:35 \nOn the other hand, OPEC's production cuts helped reduce huge stockpiles of oil around the world toward the five-year average, and Brent crude prices could average closer to $60 per barrel this year if supply and demand remain roughly balanced, he said. \nOPEC's output curbs should continue to pay off, Scott Nations, president and chief investment officer at NationsShares, told CNBC's \" Futures Now \" on Tuesday. \n\"We're now at the top of this trading channel we've been in since June,\" he said. \"It now looks like we've shifted into another gear once we got the news that crude oil in storage in Cushing has fallen below 50 million barrels for first time in nearly three years.\" \nTraders closely watch stockpile levels at the Cushing, Oklahoma delivery hub for U.S. crude for signs of oversupply and undersupply. Those levels slipped below 50 million barrels in the week through Dec. 29 and dropped by another 2.4 million barrels in the latest week. It was last below 50 million barrels in February 2015.", "external_links": [], "published": "2018-01-10T20:32:00.000+02:00", "crawled": "2018-01-10T20:46:29.005+02:00", "highlightTitle": ""}