{"organizations": [], "uuid": "d17cf32d56e0e9eec548e37e35d4d62582db5a90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/22/104726415-Screen-Shot-2017-09-22-at-1.37.09-PM.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/chipotles-final-price-hike-hits-restaurants-this-week.html", "country": "US", "domain_rank": 767, "title": "Last wave of Chipotle's price hike hits restaurants this week", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T18:23:00.000+02:00", "replies_count": 0, "uuid": "d17cf32d56e0e9eec548e37e35d4d62582db5a90"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/chipotles-final-price-hike-hits-restaurants-this-week.html", "ord_in_thread": 0, "title": "Last wave of Chipotle's price hike hits restaurants this week", "locations": [], "entities": {"persons": [{"name": "david tarantino", "sentiment": "none"}, {"name": "chris arnold", "sentiment": "none"}, {"name": "arnold", "sentiment": "none"}], "locations": [], "organizations": [{"name": "chipotle mexican grill", "sentiment": "negative"}, {"name": "chipotle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nChipotle Mexican Grill has hiked its prices, again. \nThe burrito chain bumped up prices by 5 to 7 percent this week in markets that did not already see increases in 2017, company spokesman Chris Arnold confirmed Wednesday. \nArnold said this is the last phase of Chipotle's planned price increase and is a response to rising inflation in food and labor costs. \nBaird analyst David Tarantino said this latest round of price increases covers the remaining 45 percent of Chipotle locations that were not affected by price hikes in April and November of last year. \n\"The move to implement pricing in the balance of the base was not entirely unexpected, as management previously had signaled willingness to complete the final wave of pricing actions in early Q1, after evaluating the customer reaction to the mid-November hikes,\" he wrote in a note to investors Wednesday. \nPrior to the April price hike, Chipotle had not raised prices at any of its locations since mid-2014. \nWhile these price increases could help protect the chain's margins, especially as it faces higher labor and commodity costs, it's also likely that Chipotle will see some pushback from diners, Tarantino said. \nChipotle is already having a hard time luring in customers and revitalizing traffic and sales even two years after a string of high-profile foodborne illness outbreaks tarnished the brand's reputation. \nIn an effort to turn the company around, CEO Steve Ells said in November that he would be stepping down from his post as head of the company as soon as Chipotle found someone to replace him. He will remain with the company as executive chairman and plans to oversee innovation once a new CEO is selected. \nPreviously, the chain had launched several initiatives to revitalize the brand, including a refreshed advertising campaign, a nationwide rollout of queso dip, and testing new items, such as salads and desserts. ", "external_links": [], "published": "2018-01-17T18:23:00.000+02:00", "crawled": "2018-01-17T18:31:06.001+02:00", "highlightTitle": ""}