{"organizations": [], "uuid": "2e021e25dd45ab718f41645e555c69bcf3310209", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Sustainability, Restoration On The Table At Brainstorm Design Hong Kong Lead-Up Dinner – Fortune", "url": "http://fortune.com/2018/01/24/sustainability-restoration-on-the-table-at-brainstorm-design-hong-kong-lead-up-dinner/", "country": "US", "domain_rank": 1196, "title": "Sustainability, Restoration On The Table At Brainstorm Design Hong Kong Lead-Up Dinner", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T10:50:00.000+02:00", "replies_count": 0, "uuid": "2e021e25dd45ab718f41645e555c69bcf3310209"}, "author": "Debbie Yong", "url": "http://fortune.com/2018/01/24/sustainability-restoration-on-the-table-at-brainstorm-design-hong-kong-lead-up-dinner/", "ord_in_thread": 0, "title": "Sustainability, Restoration On The Table At Brainstorm Design Hong Kong Lead-Up Dinner", "locations": [], "entities": {"persons": [{"name": "roosegaarde", "sentiment": "none"}, {"name": "daan roosegaarde", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "time inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The world is the throes of a vast urban migration. Roughly half the world’s 7.6 billion people live in cities, up from 30 percent in 1950, and population experts predict two thirds of us will do so by 2050. For billions, moving to the city has meant new opportunities. But it also has spawned huge challenges--in environmental quality, energy consumption and public health. At a Time Inc. dinner in Hong Kong’s The Murray hotel on 11 January, Dutch artist and innovator Daan Roosegaarde showed how good design and a little ingenuity can help keep our burgeoning megacities from killing us.\nRoosegaarde and his team spent more than a year working to build the world’s largest smog “vacuum cleaner”, a 23-feet-tall air purification tower that sucks up and removes pollutants from the air via a patented positive ionization technology. Visitors can purchase a \"smog-free ring\" from compressed particle matter collected by the towers, with each ring representing 1,000 cubic meters of cleaned air.\n“ W e live in a time when there is not a lack of money or technology , but a lack of imagination, and the leadership to activate that imagination,” Roosegaarde said. “There are huge challenges we face today: the rising sea level, pollution , rapidly growing cities and what do we do with it? We can blame the government, wait hide in a corner and cry, or in a way, we can engineer a way out of it, through design.” \nThe dinner was held in celebration of Brainstorm Design , a new Time Inc. conference to be held in Singapore on March 6-8. Organised in collaboration with the DesignSingapore Council, it will draw on the editorial and marketing resources of three of Time Inc.’s most iconic titles, Fortune , TIME and Wallpaper* . The three- day conference will bring together more than 50 renowned speakers from the worlds of design, business, academia and public policy to explore design’s rise as a crucial element of corporate strategy and public policy. As Roosegaarde put it, “Design is not so much about making another chair or lamp or table, but improving life. That is, in a way, the new economy …. W e live in an economy that is about time and money but m aybe the new economy is about clean air, clean energy and clean water.” \nThe Hong Kong dinner was attended by more than 60 guests including luminaries from the worlds of global design, architecture, art and finance. Among them: Carlo Imo, Asia Pacific president for the Kering Group; Adrian Cheng, New World Group executive vice chairman; Aric Chen, creative director for the M+ Museum; Bank of America Merrill Lynch’s China chairperson Margaret Ren, interior architect Andre Fu and Filipino design entrepreneur Robbie Antonio. Guests were welcomed by Time Inc. executives and editors including John Marcom, President of Time Inc. International; Clay Chandler, Time Inc. International Executive Editor; Tony Chambers, Wallpaper* Brand and Content director; and Dan Stewart, International Editor for TIME magazine.\nRoosegaarde, who will be among the speakers at Brainstorm Design, also shared the thinking behind some of his other award-winning recent work, such as a project to re-invigorate aged dykes in his native Holland, and giant kites that can power 200 households by harnessing the power of the wind. \nArchitect Colin Ward, who led Foster + Partners’ transformation of The Murray from a government office building constructed in the 1960s by British architect Ron Phillips into the Asian metropolis’ most anticipated luxury hotel opening, started the evening’s discussions with a presentation of the hotel history and its thoughtful restoration under the ownership of Hong Kong property conglomerate, the Wharf Group. Diners were then led on an exclusive preview tour of The Murray ahead of its opening to the public this month.\nParticipation in Brainstorm Design is by invitation only. Registration and further information on the conference is available here .", "external_links": [], "published": "2018-01-24T10:50:00.000+02:00", "crawled": "2018-01-24T10:50:54.024+02:00", "highlightTitle": ""}