{"organizations": [], "uuid": "5706c798f9a7ff12b2e58ec77e1d396e17a44ad5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104954401-GettyImages-615936766.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19834788/device/rss/rss.xml", "section_title": "Asia Top News and Analysis", "url": "https://www.cnbc.com/2018/01/19/south-korean-consumer-group-sues-apple-ceo-over-iphone-slowdown.html", "country": "US", "domain_rank": 767, "title": "South Korean group files complaint against Apple CEO over iPhone slowdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T07:23:00.000+02:00", "replies_count": 0, "uuid": "5706c798f9a7ff12b2e58ec77e1d396e17a44ad5"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/south-korean-consumer-group-sues-apple-ceo-over-iphone-slowdown.html", "ord_in_thread": 0, "title": "South Korean group files complaint against Apple CEO over iPhone slowdown", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "citizens united for consumer sovereignty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech Guide South Korean group files complaint against Apple CEO over iPhone slowdown A South Korean consumer group has filed a criminal complaint against Apple CEO Tim Cook over slowed iPhone devices The complaint comes after probes in Europe found that Apple deliberately shortened the life of its handsets Apple is already facing lawsuits in the United States Published 10 Hours Ago SHARES Jung Yeon-Je | AFP | Getty Images A woman looks at the Apple iPhone 7 at a shop in Seoul on October 21, 2016. \nA South Korean consumer group has filed a criminal complaint against Apple CEO Tim Cook over slower iPhone devices, after probes in Europe into allegations the firm had deliberately shortened the life of its handsets. \nApple is already facing lawsuits in the United States and elsewhere over accusations of having defrauded iPhone users by slowing down devices without warning to compensate for poor battery performance and to push clients into buying new phones. \nThe South Korean advocacy group, Citizens United for Consumer Sovereignty, in its complaint submitted on Thursday accused Apple of destruction of property and fraud. \n\"For the sake of its loyal fans, Apple has to take responsibility over the slowing iPhones,\" Park Soon-jang, an official at the advocacy group told Reuters by phone on Friday. \nThe group also represents about 120 plaintiffs in a civil damage suit against Apple filed earlier this month. \nThe Seoul Central District Prosecutors' Office declined to comment when asked if it would launch an investigation into Apple following the complaint from the consumer group. \nApple Korea, the U.S. tech firm's South Korean subsidiary, was not immediately available for comment. \nThe California -based company acknowledged in December that iPhone software can slow down some phones with battery problems and apologised for the issue. However, it said it would never do anything to intentionally shorten the life of any Apple product. \nApple will release a software update that will allow users to turn off a feature that slows down iPhones when batteries are low on charge, CEO Cook told ABC News on Wednesday. \nItaly's antitrust body said on Thursday it had opened a probe into allegations that Apple and Samsung Electronics used software updates to slow their mobile phones and push clients into buying new handsets. \nA French prosecutor has also launched a preliminary investigation into Apple's alleged deception and planned obsolescence of its products. Related Securities", "external_links": [], "published": "2018-01-19T07:23:00.000+02:00", "crawled": "2018-01-19T07:38:01.019+02:00", "highlightTitle": ""}