{"organizations": [], "uuid": "9f1ac7ae27bb821ea2b474bbd2778a97bb0827b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946909-GettyImages-900415328.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19834788/device/rss/rss.xml", "section_title": "Asia Top News and Analysis", "url": "https://www.cnbc.com/2018/01/15/asia-markets-currencies-rio-tinto-and-china-markets-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asian shares look set to open little changed; dollar in the doldrums", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T01:45:00.000+02:00", "replies_count": 0, "uuid": "9f1ac7ae27bb821ea2b474bbd2778a97bb0827b3"}, "author": "", "url": "https://www.cnbc.com/2018/01/15/asia-markets-currencies-rio-tinto-and-china-markets-in-focus.html", "ord_in_thread": 0, "title": "Asian shares look set to open little changed; dollar in the doldrums", "locations": [], "entities": {"persons": [{"name": "kathy lien", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "asx", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}, {"name": "bk asset management", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most Asian markets closed higher on Tuesday as the dollar nursed overnight losses. G reater China markets, which had slid in the last session, edged higher.\nJapan's Nikkei 225 , which had hovered near the flat line early in the session, rose 1 percent, or 236.93 points, to close at 23,951.81 as the dollar edged up against the yen. The index touched its highest levels in 26 years earlier in the session.\nTech names closed the session mostly higher, with Sony and Panasonic closing higher by 0.2 percent and 0.64 percent, respectively.\nSubaru advanced 2.61 percent by the end of the day, outperforming its peers. The company said it expected sales stateside to increase by 5 percent this year to 680,000 vehicles, the Wall Street Journal reported Monday. Other Japanese automakers were mostly higher: Toyota added 1.05 percent and Honda tacked on 0.2 percent.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Across the Korean Strait, the Kospi erased early losses to close 0.72 percent higher. Index heavyweight Samsung Electronics finished the session 3.01 percent higher after selling off last week on poorer-than-expected profit guidance . Rival chipmaker SK Hynix also recorded gains, climbing 2.43 percent by the end of the day.\nShare of Hyundai Motor closed up 1.94 percent after news this morning that union members at the automaker had come to an agreement on wages. Brokerages and manufacturing names, however, traded lower on the day.\nDown Under, the S&P/ASX 200 slipped 0.47 percent to end at 6,048.6 as the energy, utilities and telecommunications sectors led losses on the broader index. The heavily-weighted financials sector declined 0.52 percent.\nRio Tinto shares declined 0.66 percent by the end of the day, paring earlier gains made after it reported fourth-quarter production figures. The company said 2017 iron ore shipments rose 1 percent and were in line with guidance. Fourth-quarter iron ore shipments rose 3 percent compared to the same period one year ago.\nThe Hang Seng Index bounced 1.46 percent at 3:00 p.m. HK/SIN, with the benchmark looking set to notch a record close. The Hang Seng had closed lower on Monday, breaking a 14-day winning streak. Ahead of the market close, index heavyweights Tencent and HSBC were up 2.08 percent and 0.48 percent, respectively, as financials, casinos and energy-related plays notched gains.\nOn the mainland, the Shanghai composite edged up 0.79 percent to end at 3,437.48 and the Shenzhen composite rose 0.72 percent to finish at 1,927.56. Financials were among the best-performing sectors on the blue chip CSI 300 index, with Industrial and Commercial Bank of China closing up 2.33 percent.\nDespite the broader move higher, airline stocks suffered steep losses, with Air China falling 3.73 percent and China Eastern Airlines losing 2.42 percent by the end of the session.\nMSCI's index of shares in Asia Pacific excluding Japan gained 0.54 percent.\nDow Jones industrial average futures, meanwhile, soared 0.76 percent , or 197 points, ahead of markets stateside re-opening following Martin Luther King Jr. Day on Monday.\nEuropean markets finished in mildly negative territory in the last session, although volumes were lighter than usual owing to Wall Street being closed.\nDollar licks its wounds The dollar nursed losses after extending its broad declined overnight even though U.S. markets were closed. The dollar index , which tracks the U.S. currency against a basket of six peers, traded at 90.490 at 2:36 p.m. HK/SIN after falling as low as 90.279 on Monday.\n\"Holidays typically mean consolidations but today, less participation from the U.S. translated into exaggerated moves in currencies driven by low liquidities,\" Kathy Lien, managing director of FX strategy for BK Asset Management, said in a note.\nThe dollar edged up against the Japanese currency to trade at 110.79, above Monday's close of 110.52.\nMeanwhile, the euro held onto overnight gains made as the greenback sank in the last session. The common currency traded at $1.2274 after climbing as high as $1.2296 on Monday — its highest levels in three years.\nThe on-shore yuan traded at 6.4311 to the dollar and the offshore yuan traded at 4.4293 at 2:36 p.m. HK/SIN after the currency rose to its strongest levels in two years on Monday.\nThe People's Bank of China earlier fixed the official midpoint at 6.4372 a dollar, the highest reference point in more than two years, Reuters reported. China's central bank allows the yuan to move 2 percent higher or lower against the dollar, relative to the fixing rate.\nOn the energy front, U.S. West Texas Intermediate rose 0.3 percent to trade at $64.49 per barrel after touching three-year highs on Monday. Brent crude futures were lower by 0.4 percent at $69.98.\nIPOs in focus Baidu's video-streaming platform iQiyi has confidentially applied to potentially list stateside, Thomson Reuters publication IFR reported on Monday, citing sources. The deal, which could potentially raise around $1 billion, is expected to take place late in the current quarter or in the second quarter, IFR added.\nThe latest news came hot on the heels of earlier headlines that other Chinese companies, including online finance platform Lufax and smartphone maker Xiaomi , were looking into initial public offerings of their own, most likely in Hong Kong.", "external_links": [], "published": "2018-01-16T01:45:00.000+02:00", "crawled": "2018-01-16T01:50:14.002+02:00", "highlightTitle": ""}