{"organizations": [], "uuid": "985551bb3c7fc74458bcb1d3d94466be5cbb8a02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/31/104621164-GettyImages-824840512-martin-shkreli.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/new-york-tax-officials-seized-martin-shkrelis-nazi-code-machine.html", "country": "US", "domain_rank": 767, "title": "New York state tax officials seized, sold Shkreli's Nazi code machine — and more items", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T20:38:00.000+02:00", "replies_count": 0, "uuid": "985551bb3c7fc74458bcb1d3d94466be5cbb8a02"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/new-york-tax-officials-seized-martin-shkrelis-nazi-code-machine.html", "ord_in_thread": 0, "title": "New York state tax officials seized, sold Shkreli's Nazi code machine — and more items", "locations": [], "entities": {"persons": [{"name": "peter foley", "sentiment": "negative"}, {"name": "martin shkreli", "sentiment": "negative"}, {"name": "shkreli", "sentiment": "negative"}, {"name": "turi", "sentiment": "negative"}, {"name": "shkeli", "sentiment": "none"}, {"name": "isaac newton", "sentiment": "none"}, {"name": "james gazzal", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "shkreli", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "department of taxation and finance", "sentiment": "none"}, {"name": "sotheby", "sentiment": "none"}, {"name": "pharmaceuticals ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New York state tax officials have already seized and auctioned off a rare Nazi encryption machine and three valuable historical documents owned by convicted fraudster Martin Shkreli , even as the jailed former pharmaceutical executive fights efforts by federal prosecutors to seize his assets.\nShkreli's Enigma code machine , which was used by Germany during World War II to send secret messages, was seized last May and sold for $65,000 by the Sotheby's auction house, a spokesman for the state Department of Taxation and Finance told CNBC on Friday.\nThe money went toward reducing at least some of the \"pharma bro\" Shkreli's large tax liability with the state of New York, as did the three documents he had owned, which likewise were seized in May.\nOne of them was \"a rare, unpublished manuscript in Latin signed by Isaac Newton at the beginning of his chemical research,\" which sold for $38,000, according to James Gazzale, the tax department spokesman.\nA letter that Shkreli owned which was written by English mathematician and writer Augusta Ada King-Noel, Countess of Lovelace, signed \"A.A. Lovelace, sold for $26,000. The countess was the only legitimate child of the poet Lord Byron.\nThe third item, a signed letter from legendary naturalist Charles Darwin to a man named Thomas Green about the publication of Darwin's research during his travels aboard the HMS Beagle, went at auction for $5,500, Gazzale said.\nAll told, tax officials recouped $134,500 from selling off the Shkreli items that they seized.\nThe Enigma machine's seizure came seven months before federal prosecutors in Brooklyn, New York, listed it as an asset they wanted him to forfeit in connection with his criminal conviction. The seizure came four months before Shrekli was convicted in the fraud case.\nShkreli's lawyer, Benjamin Brafman, first disclosed the Enigma machine's seizure on Thursday in a letter filed in Brooklyn federal court that opposes a forfeiture request by prosecutors.\nBrafman's letter did not contain either the date of the filing or the amount obtained for the machine at auction. Nor did the lawyer's letter mention the historical documents seized by tax officials.\nBrafman, who could not be reached for comment, wrote in his filing that despite the state's auction of the Enigma machine, the 34-year-old Shkreli still owed New York state more than $450,000 in taxes.\nLandon Dowdy | CNBC The German “Enigma” coding machine used during World War II. In a filing in December, federal prosecutors in a filing said they were seeking forfeiture of Shkreli's Enigma machine, as well as of a Picasso painting, a one-of-a-kind Wu-Tang Clan album and more than $7 million in funds .\nBrafman's letter laid out his objections to the forfeiture, saying prosecutors had failed to establish \"that there are any forefeitable proceeds traceable to Mr. Shkreli's crimes of conviction.\" Those crimes include duping a group of investors in two hedge funds he ran.\nBrafman argues Shkreli \"was not indicted because he stole anyone's money.\"\nBrafman told CNBC last month: \"Our position is clear. ... None of the investors lost any money and Martin did not personally benefit from any of the counts of conviction. Accordingly, forfeiture of any assets is not an appropriate remedy.\"\nA spokesman for Brooklyn federal prosecutors declined to comment when asked about Brafman's letter, and referred questions about the auction to state tax officials.\nBrafman, in his filing, said that in the event Judge Kiyo Matsumoto orders forfeiture in the case, prosecutors \"should not be permitted to substitute assets.\" Brafman then noted the seizure and auction of the Enigma machine by state tax officials.\nThe Enigma machine's code during the war was cracked by a British team lead by Alan Turing, whose last name was used by Shkreli to name one of his companies, Turing Pharmaceuticals. Federal prosecutors are also seeking Shkreli's shares in Turing as part of their forefeiture demand.\nShkreli first gained widespread public notoriety in 2015, when Turing hiked the price of an anti-parasitic drug by more than 5,000 percent . Turing's name since has been changed to Vyera Pharmaceuticals .\nIn a Vanity Fair magazine profile published that same year , Shkreli said he was \"conflicted\" about having purchased an Enigma machine \"because it's a Nazi relic.\"\n\"It's like owning a gas chamber — like, what the f---?— but it's a constant reminder that we should use knowledge for good, even if the process is ugly,\" Shkreli told the magazine. \"From the Pythagorean theorem to Fermat's theorem, the math is ugly, but if you hold your nose during the process of proving it, you get to the right place.\"\nShkreli was convicted in August of defrauding a group of investors in two hedge funds he ran by misrepresenting the performance of ther investments . He also was accused, but acquitted of, swindling money from another drug company he founded, Retrophin , to repay those investors.\nShkreli, who is due to be sentenced in the case next month, currently is locked up without bail in a Brooklyn federal jail.\nHis $5 million bail was revoked in September by Matsumoto, who was outraged over his offer on Facebook of a $5,000 bounty for people who grabbed locks of hair off the head of Hillary Clinton.", "external_links": [], "published": "2018-01-12T20:38:00.000+02:00", "crawled": "2018-01-12T20:49:49.001+02:00", "highlightTitle": ""}