{"organizations": [], "uuid": "d4c0e6cce042f827f0c130ec4e129c51f1f78b9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/10/104890072-GettyImages-887657576.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/27/the-key-to-bitcoins-next-breakout-may-lie-in-google-search.html", "country": "US", "domain_rank": 767, "title": "The key to bitcoin’s next breakout may lie in Google search", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-28T00:00:00.000+02:00", "replies_count": 0, "uuid": "d4c0e6cce042f827f0c130ec4e129c51f1f78b9f"}, "author": "", "url": "https://www.cnbc.com/2018/01/27/the-key-to-bitcoins-next-breakout-may-lie-in-google-search.html", "ord_in_thread": 0, "title": "The key to bitcoin’s next breakout may lie in Google search", "locations": [], "entities": {"persons": [{"name": "nick colas", "sentiment": "none"}, {"name": "colas", "sentiment": "none"}], "locations": [], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "datatrek research", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The first analyst to follow bitcoin sees a very accessible way to track its next big move.\nDataTrek Research's co-Founder, Nick Colas, said recently that the key is looking into Google search and wallet growth.\n\"By looking at the number of people who search for the word 'bitcoin' on Google , which has roughly a 60 percent market share of search globally, we get a pretty good sense of where the interest is,\" he told CNBC's \" Trading Nation \" this week.\n\"The data does show exactly the same price trends that we saw for the past 90 days,\" he added.\nAnd, just like the latest search trends, the cryptocurrency's price has been deep in the doldrums. It's been trading in the $10,000 to $12,000 range, off sharply from its record price near $20,000 it hit in December.\n\"Bitcoin searches have really trailed off. So, the interest levels definitely show you where bitcoin has these big breakouts and then pullbacks,\" said Colas.\nHe points to more evidence to support his theory to the bitcoin boom between last Thanksgiving and December 17 — when search traffic saw a significant pick-up as bitcoin prices surged to a record at $19,843.\n\"Search trends skyrocketed after Thanksgiving here in the U.S. in November of last year — more than doubling in the course of just a couple of weeks,\" added Colas. \"That incremental search for the term 'bitcoin' actually led to an incremental number of wallets being formed, a method by which people hold bitcoin.\"\nBut days later, bitcoin prices crashed, and so did searches for it.\nDespite bitcoin's troubles, Colas, who owns a quarter of a bitcoin, doesn't think it needs a life raft. He points out that it's still trading higher than before Thanksgiving, and the technology makes a lot of sense long-term.\n\"From this point on, we just have to look for the beginnings of good news that will re-accelerate wallet growth to make the thing go higher,\" Colas said.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nshow chapters One of the first strategists to cover bitcoin believes it’s here to stay      5:07 PM ET Fri, 26 Jan 2018 | 04:27 Disclaimer", "external_links": [], "published": "2018-01-28T00:00:00.000+02:00", "crawled": "2018-01-28T00:16:38.016+02:00", "highlightTitle": ""}