{"organizations": [], "uuid": "338da8d063cbd8e1965478e52a4a63da0e8cd93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/19/104538454-erik_finman_color.1910x1000.png", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/19-year-old-bitcoin-millionaire-offers-crucial-investing-advice.html", "country": "US", "domain_rank": 767, "title": "This 19-year-old bitcoin millionaire offers 'crucial' advice for young people looking to invest", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T22:45:00.000+02:00", "replies_count": 0, "uuid": "338da8d063cbd8e1965478e52a4a63da0e8cd93e"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/19-year-old-bitcoin-millionaire-offers-crucial-investing-advice.html", "ord_in_thread": 0, "title": "This 19-year-old bitcoin millionaire offers 'crucial' advice for young people looking to invest", "locations": [], "entities": {"persons": [{"name": "erik finman", "sentiment": "negative"}, {"name": "finman", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Teenage bitcoin millionaire Erik Finman, 19, has advice for young people looking to invest in the cryptocurrency: \"Find what you're good at, and find a way to make money doing it.\"\n\"This is crucial for young people,\" he writes on Twitter. \"Establishing an extra stream of income will allow you to start investing earlier.\"\nTWEET \nFinman currently owns 401 bitcoins, which he confirmed with CNBC Make It , or over $4.4 million at the rate of $11,182 a coin . The teenager began investing in bitcoin in May 2011, after receiving a $1,000 gift from his grandmother at age 12.\nFinman tells Forbes that his knack for politics is actually what got him interested in bitcoin initially. \"[I] saw this as an incredible way to transcend the financial system including Wall Street,\" he tells the magazine.\nHowever, notable financial experts like Warren Buffett have warned against investing in bitcoin.\n\"In terms of cryptocurrencies, generally, I can say with almost certainty that they will come to a bad ending ,\" the billionaire investor told CNBC .\nOther bitcoin millionaires have also warned against sinking money into bitcoin , nothing that it's not secure and has no real value. But Finman refutes that claim.\nOn his Twitter , he writes that people often say, \"Bitcoin isn't real, it's just numbers on a computer screen!\"\nThe millionaire argues that the dollars in your bank account are also just numbers on a screen. \"Bitcoin is just as real as fiat money, except Bitcoin can't be printed endlessly,\" he writes.\nThe teenager remains optimistic about bitcoin's prospects and advises other young people to take part in the crypto-craze. \"What I love about Bitcoin is that instead of some rich old guy on Wall Street. Young poor people are the ones getting rich,\" he writes on Twitter.\nA post shared by Erik Finman (@erikfinman) on Jan 13, 2018 at 3:16pm PST \nIn fact, the 19-year-old believes that investing in cryptocurrency is one of the fastest ways for young people to attain wealth.\n\"Cryptocurrency represents the largest transfer of wealth our generation has ever seen,\" he writes. \"Never before have young people been able to change economic classes so quickly.\" He's proof of that.\nTWEET \nFinman had a 2.1 GPA in high school and says his teachers considered him a failure.\n\"One teacher told me to drop out and work at McDonald's because that was all I would amount to for the rest of my life,\" says the the teen. So he dropped out.\nHe also made a bet with his Stanford-educated parents that if he became a millionaire by 18 , he wouldn't have to go to college. Investing in bitcoin helped him avoid that fate.\nAfter selling his first bitcoin investments in 2013, Finman walked away with $100,000. At the time, each bitcoin was valued at $1,200.\nA post shared by Erik Finman (@erikfinman) on Jan 11, 2018 at 10:04am PST \nWith the money he earned, Finman launched an online education company in 2014 called Botangle, which he later sold for 300 bitcoins. Since then, he has been working with NASA to launch a rocket through the ELaNa project and managing his family's bitcoin investments.\nHe's also made personal smaller investments in other cryptocurrencies, including litecoin and ethereum .\nThe bitcoin millionaire says he strongly believes that this is just the beginning of cryptocurrency.\n\"Deep down, everybody knows cryptocurrencies are the future. Even the bankers and Wall Street know it,\" he writes on his Twitter. \"The only debate is how long until it completely takes over.\"\nTWEET \nLike this story? Like CNBC Make It on Facebook . \nSee also: \nSelf-made billionaire Tilman Fertitta reveals a major way people block their own success", "external_links": [], "published": "2018-01-24T22:45:00.000+02:00", "crawled": "2018-01-24T23:09:52.003+02:00", "highlightTitle": ""}