{"organizations": [], "uuid": "5fdc123a9f0f6de2e0ceda9719836bd66247b503", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 67, "shares": 67, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226728639&w=1200&r=LYNXMPEE0T1IY", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-cftc-subpoena/u-s-regulator-subpoenas-cryptocurrency-platforms-bitfinex-and-tether-source-idUSKBN1FJ2ZK", "country": "US", "domain_rank": 408, "title": "U.S. regulator subpoenas cryptocurrency platforms Bitfinex and Tether: source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T23:59:00.000+02:00", "replies_count": 0, "uuid": "5fdc123a9f0f6de2e0ceda9719836bd66247b503"}, "author": "", "url": "https://www.reuters.com/article/us-usa-cftc-subpoena/u-s-regulator-subpoenas-cryptocurrency-platforms-bitfinex-and-tether-source-idUSKBN1FJ2ZK", "ord_in_thread": 0, "title": "U.S. regulator subpoenas cryptocurrency platforms Bitfinex and Tether: source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. derivatives regulator has sent a subpoena to two of the world’s largest cryptocurrency platforms, a person familiar with the matter told Reuters on Tuesday, as watchdogs globally increase their scrutiny of the emerging asset class.\nThe Commodity Futures Trading Commission (CFTC) sent a subpoena on Dec. 6 to both Bitfinex, a cryptocurrency exchange, and Tether, a company that issues a virtual currency, the person said, wishing to remain anonymous because the matter is private.\nRegulators send subpoenas in order to gather information into a range of inquiries. Reuters could not ascertain what information the CFTC requested from Bitfinex and Tether, or if the CFTC was formally investigating the cryptocurrency platforms.\nDonna Faulk White, a spokeswoman for the CFTC, declined to comment.\nA spokesman for Bitfinex and Tether, which are affiliated with each other, said in a statement: “We routinely receive legal process from law enforcement agents and regulators conducting investigations. It is our policy not to comment on any such requests.”\nThe subpoena was first reported by Bloomberg.\nBitfinex is an online platform that enables traders to buy and sell virtual currencies such as bitcoin and ether. One of the largest cryptocurrency exchanges in the world by trading volume, it is owned by a British Virgin Islands company and does not have a head office, Reuters reported in September.\nBitfinex is affiliated with Tether, a company that issues virtual coins that it says are pegged to the U.S. dollar and can be used in the cryptocurrency market as a substitute for the dollar.\nThe CFTC has been increasing its scrutiny of cryptocurrencies over the past few months, an emerging asset class that it has said is highly vulnerable to manipulation and fraudsters.\nEarlier this month the regulator sued three virtual currency operators for misappropriating investor funds which it said had falsely claimed to be investing in bitcoin and other cryptocurrencies.\nIn June 2016 the CFTC fined Bitfinex $75,000 for offering “illegal” cryptocurrency transactions and failing to register as a futures commission merchant. A few months later hackers stole 119,756 bitcoins from Bitfinex.\nBitcoin BTC=BTSP was trading at around $10,000 on Tuesday.\nReporting by Michelle Price and Anna Irrera; Additional reporting by John McCrank; Editing by Lisa Shumaker\n ", "external_links": [], "published": "2018-01-30T23:59:00.000+02:00", "crawled": "2018-01-31T00:12:18.004+02:00", "highlightTitle": ""}