{"organizations": [], "uuid": "97819117afec8a449453ec472f279331222b5193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955337-GettyImages-51533836.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/why-amazons-jeff-bezos-drove-a-honda-after-he-was-a-billionaire.html", "country": "US", "domain_rank": 767, "title": "Here's why Jeff Bezos still drove a Honda long after he was a billionaire", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T16:20:00.000+02:00", "replies_count": 0, "uuid": "97819117afec8a449453ec472f279331222b5193"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/why-amazons-jeff-bezos-drove-a-honda-after-he-was-a-billionaire.html", "ord_in_thread": 0, "title": "Here's why Jeff Bezos still drove a Honda long after he was a billionaire", "locations": [], "entities": {"persons": [{"name": "jeff bezos", "sentiment": "negative"}, {"name": "bezos", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "chevy blazer", "sentiment": "none"}], "organizations": [{"name": "honda", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "apple tv", "sentiment": "none"}, {"name": "sotheby", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon founder Jeff Bezos has a staggering fortune : He's the richest man in the world, worth about $108 billion, according to Forbes .\nAnd he's been busy. Just in the last year, Amazon acquired Whole Foods , began allowing Amazon Prime members to watch its movies and TV shows on Apple TV, created a camera that can help you pick out nicer outfits, was granted patents for delivery drones with wings and legs and much more .\nBut back in 1994, when a 30-year-old, newly married Bezos quit his Wall Street job to start Amazon , the business was pretty simple. It sold books.\n\"When we opened our doors, we had 10 employees,\" Bezos tells technology blog GeekWire . \"I was driving the packages to the post office myself in my 1987 Chevy Blazer and dreaming one day that we might have a forklift.\"\nOnly three years later, in 1997, Amazon went public and Bezos' wealth catapulted to over $12 billion , according to Bloomberg. \nBut you wouldn't have known it by the newly minted billionaire's car. Despite his windfall, Bezos swapped out his 1987 Chevy Blazer for only a modest upgrade — a Honda Accord. \nThat's according to a profile CBS's Bob Simon did of Bezos in 1999 for \" 60 Minutes ,\" recently resurfaced by Geekwire , showing Bezos sporting khakis, a button-down and driving the car.\n\"What's with the Honda?\" Simon asks Bezos. \nAfter a laugh, Bezos, who according to The New York Times owned roughly $10 billion in Amazon stock in 1999, responds, \"This is a perfectly good car.\"\nDuring the interview, Simon also discovered Amazon's then-headquarters in Seattle shared a street address with pawn shop, a heroin-needle exchange and a \"porno parlor .\" And inside, Bezos' desk was made out of a re-purposed wooden door and two-by-four pieces of wood. In fact, the entire company used desks made of doors as deliberate message, according to the Times .\nWhy so frugal?\n\"It's a symbol of spending money on things that matter to customers and not spending money on things that don't,\" Bezos explains to Simon.\nBy 2004, Amazon employees were still using door desks , notes Fast Company. And in 2013, Bezos was still driving a Honda, though a slightly bigger model, according to Brad Stone's book, \"The Everything Store.\"\nToday, Amazon has a $620 billion market cap and reported $43.7 billion in revenue during its third quarter in 2017 alone, a 34 percent increase from the same quarter in 2016.\nBezos has some bigger extravagances , like multiple homes, a private jet and Blue Origin. \nYet \"frugality\" remains one of Amazon's core principles and the company sticks by Bezos' early mentality. Amazon even gives out an accolade called the \" Door Desk Award \" to employees who come up with ideas that save money. \nAccording to Amazon : \"Constraints breed resourcefulness, self-sufficiency and invention.\"\nDon't miss: Mark Cuban says he follows this advice from Jeff Bezos 'to a T' \nshow chapters Here's the future Jeff Bezos saw for himself at 80, if he didn't found Amazon at 30      5:18 PM ET Tue, 21 Nov 2017 | 02:09 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-19T16:20:00.000+02:00", "crawled": "2018-01-19T17:13:31.000+02:00", "highlightTitle": ""}