{"organizations": [], "uuid": "a6420b2882fe6a3b0529a86dfc70c4f313ca37d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962531-GettyImages-667754570.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/united-shares-plunge-after-airline-presents-its-growth-plan.html", "country": "US", "domain_rank": 767, "title": "Why United Airlines 'pretty darn good plan' is spooking investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T16:53:00.000+02:00", "replies_count": 0, "uuid": "a6420b2882fe6a3b0529a86dfc70c4f313ca37d1"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/united-shares-plunge-after-airline-presents-its-growth-plan.html", "ord_in_thread": 0, "title": "Why United Airlines 'pretty darn good plan' is spooking investors", "locations": [], "entities": {"persons": [{"name": "timothy fadek", "sentiment": "negative"}, {"name": "oscar munoz", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "newark liberty international airport", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "united airlines", "sentiment": "negative"}, {"name": "united continental", "sentiment": "negative"}, {"name": "ual", "sentiment": "none"}, {"name": "united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "United Airlines ' plan to grow aggressively over the next several years was aimed at getting investors even more jazzed about its stock, which was already rallying more than its peers' this year.\nBut the plan's unveiling backfired, raising concerns about how it would contribute to rising costs and a fare war, just as airlines are resorting to fees for things like seat assignments and checked baggage on international flights to increase revenue .\nUnited shares sunk more than 11 percent on Wednesday in a rout that nearly erased the stock's rally so far this year.\nWhile United's fourth-quarter profit surpassed Wall Street's expectations , investors were focused on its plan to grow capacity, or the number of seats it flies, by 4 percent to 6 percent each year through 2020.\nIncreasing the number of seats in the fly means higher labor, fuel and operational costs, and can spark bitter fare wars. Some analysts fretted about how and when the plan would expand the airline's margins, especially as fuel prices touch multi-year highs.\nUnited's CEO Oscar Munoz told CNBC in an interview on Wednesday that the decline was within the company's expectations. \"I think it's a buying opportunity,\" he said, adding that he expects the airline's plan to \"sink in\" with the industry in the coming days.\nA major part of United's plan is growing the airline's hubs in Denver, Chicago and Houston.\n\"I think it's important to know that what we have in front of you is a pretty darn good plan,\" Munoz said during the presentation late Tuesday. \"I think the growth aspect of it as it's been outlined, and the component pieces of it, and the reasons why, and the profitability therein, I think are important and doable.\"\nSome analysts appeared unconvinced.\n\"When is the transition year transitioning to higher margins instead of lower margins?\" asked J.P. Morgan Chase analyst Jamie Baker. \"And what are the most important drivers of that from tonight's presentation, because it's not really clear to me the timing or the contribution.\"\nThe presentation of capacity growth was a chance for United's top brass to impress investors who abandoned the company's stock last fall following a foggy outlook for the coming year . Wednesday marked the second-biggest percentage drop in United stock since that last October's earnings call, when shares lost 12 percent.\nPerhaps aware of how failing to provide forecasts, United executives gave plenty of forecast details in its presentation. It expects 2018 full-year per share earnings of as much as $8.50.\n\"The strategy is definitely sound on paper (and definitely works when you model it in an excel spreadsheet), but we do not believe it will result in a higher stock price in the nearterm,\" Cowen & Co. said in a note. \"The capacity growth outlook will likely be questioned by investors, as airline stocks generally have not worked in an environment of industry overcapacity. Typically, in a time of overcapacity, yields are the first thing to go as competitors compete on price for the same passenger.\"\nA worry is that the increased capacity, especially the U.S. market, where United last year had said some fares had dropped to $10, will mean the airline will have to match competitor fares.\n\"Half our revenue approximately comes from customers that are mostly shopping on price and we cannot ignore half of our revenue and we can't let our low-cost carriers have price advantages in our hubs,\" said United's president, Scott Kirby.\nThat could ripple out to other airlines, which might be forced to compete, creating a snowballing fare war. Other airlines also fell on Wednesday . Delta Air Lines and American Airlines fell 5 and percent, respectively. Spirit Airlines , the low-cost airline that goes head-to-head with United in some of its hubs, fell nearly 7 percent. Southwest Airlines lost close to 5 percent, while JetBlue fell 2 percent.\nAmerican and several other airlines will report earnings on Thursday morning.", "external_links": [], "published": "2018-01-24T16:53:00.000+02:00", "crawled": "2018-01-24T16:58:10.001+02:00", "highlightTitle": ""}