{"organizations": [], "uuid": "8d34335411252cb4ff1b306f7f1e9384c5a5f155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 67, "shares": 67, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970725-unnamed.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/i-ran-a-dna-test-on-my-dogs--heres-what-i-found-out.html", "country": "US", "domain_rank": 767, "title": "I ran a DNA test on my dogs — here's what I found out", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-27T20:00:00.000+02:00", "replies_count": 0, "uuid": "8d34335411252cb4ff1b306f7f1e9384c5a5f155"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/i-ran-a-dna-test-on-my-dogs--heres-what-i-found-out.html", "ord_in_thread": 0, "title": "I ran a DNA test on my dogs — here's what I found out", "locations": [], "entities": {"persons": [{"name": "roscoe jenkins", "sentiment": "none"}, {"name": "amy ruth", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech Guide I ran a DNA test on my dogs — here's what I found out Wisdom Panel 4.0 is a dog DNA test that will tell you your dog's ancestry, up to three generations. \nAs more people seek to find out more about their ancestry, genetic test sales have become a growing businesses for companies like Amazon . \nBut it's not just humans who can search for the code to their past. Dog DNA tests have emerged on the market as a way to find out about more about your furry companion and where they came from. \nIt might seem silly to run a genetic test on your pets – after all, they're not going to care about the results – but when you adopt a dog, you're often left wondering about the life they led before they became a permanent member of your family. Ancestry tests can also help you anticipate health concerns typical of certain dog breeds. The DNA subjects \nMy husband and I have a 9-year-old dog named Roscoe Jenkins and a (probably) 1-year-old dog named Amy Ruth. \nIn 2010, I moved into my first solo apartment, and to keep up with the adulting process I wanted to get a dog. After looking on rescue sites and shelters, I stumbled across a Craigslist post from an owner in the Bronx who was looking to get rid of her 2-year-old dog. Not only did he look like he fit the bill, his name was Roscoe. Roscoe's House of Chicken and Waffles was my favorite restaurant when I went to college in Los Angeles, so I took it as a sign. \nDespite his quirks and medical maladies – he can't eat grains, beef or chicken without scratching off his fur, he went blind because of a genetic disease about a year after I got him, and he's had to get many of his teeth removed – I quickly fell in love. More than seven years later, he's still by our side. \nI tracked down the original owner who told me he's a Yorkipoo. But no one else believed it -- the average Yorkipoo ranges from 3 to 14 pounds, much lighter than Roscoe's 18 pounds. Roscoe doesn't shed so we always thought he was some kind of poodle mix. He loves to take toys and shake them to death, which we were told was terrier behavior. People on the street most often think he's a West Highland Terrier-poodle mixt. \nWe wanted to add another dog, so in October 2017, we started fostering a skinny 12-pound rescue dog with the original name of Lil' Booger. She was between 1 and 2 and had just given birth to a litter of puppies. She also came with the note \"REALLY shy but adorable. Needs help with confidence.\" She had never walked on a leash, and didn't know how to play with toys. After fostering her for a few weeks, we decided to keep her and rename her Amy Ruth after my favorite fried chicken and waffles place in Harlem. \nWe thought she looked like a Chihuahua, but she's definitely much larger than the average 3 to 7 pounds. She also has ridiculously long legs for her size and is an incredible jumper, so maybe she had rat terrier in her. We then saw a Xoloitzcuintli but with hair (otherwise known as a Mexican hairless dog), and decided that was the closest to what she looked like. Amy Ruth (left) and Roscoe Jenkins the day they met. The test \nI purchased the Wisdom Panel 4.0 online from the website, which usually costs $84.99. (I got a Black Friday discount.) It claims to be able to identify more than 250 dog breeds and track your dog's ancestry up to three generations. \nThe test itself was pretty easy. You rip the box open, register the ID online, fill out basic information on the box with a pen, use two swabs to swab the inside of your dog's cheek and gums, let it dry, pack everything up, seal it up with pre-placed adhesive, and mail it out with the pre-paid postage. \nThe company notifies you when it receives the test via email. You then get a link to a website where you can check the test's progress. It took about three weeks. The results \nThe results include a page with a snippet of your dog's unique DNA code. The next section then shows you your dog's ancestry, followed by a little description of the breeds that make up your dog. The final section, titled \"health and traits,\" shows you if your dog has the genetic markers for multidrug sensitivity, exercise-induced collapse, and approximates your dog's weight based on its breeds, and what the genetic trait markers show your dog looks like. Roscoe Jenkins \nWe learned that Roscoe was actually a Yorkipoo, for the most part! He was 50 percent Yorkshire terrier, 25 percent miniature poodle and 25 percent mixed-breed terrier and sporting dogs. The test can only go back three generations, so for dogs that may have a ton of other breeds mixed in the results give you a \"mixed-breed\" category and tell you which kinds of dogs are in their ancestry. He was predicted to be about 8 to 17 pounds, so it was pretty accurate. Amy Ruth \nAmy was a quarter Chihuahua, a quarter Rat Terrier, a quarter Australian Cattle Dog (a total surprise) and a quarter of \"mixed-breeds\" from terrier, companion and herding backgrounds. In other words, she's got a little bit of everything. She was predicted to be between 19 and 33 pounds. While she's definitely gaining weight, I don't know if she'll hit that range. \nThe one thing I did find strange is some of reported traits did not line up with what my dogs looked like, especially Roscoe. For example, his ears flop down but according to the genetic test they \"could be prick or upright.\" He also was supposed to have a saddle tan pattern of dark pigment on his back, but he's pretty much beige. \nWisdom Panel lead researcher Angela Hughes pointed out Roscoe's miniature poodle breed often carries the \"prick\" allele, but doesn't always express it. It usually results in \"base-erect\" ears, which stand up at some point then flop over, instead of fully dropped ears. (That's exactly what he has.) She also said that the test showed Roscoe would be mostly tan, and have black parts like his nose and pads. When Yorkies age they can \"lighten\" or \"grey,\" which can make darker colors stand out. Roscoe's coat has become darker over the years. \nHughes, who ran the test on her own rescue, said the test could give me insights into how to train my dogs. Her adopted dog was driving her nuts barking out all the windows until the DNA test revealed she was part terrier. She was able to find proper terrier training techniques to help calm her dog down. \nDo the results change how I feel about my dogs? Not a single bit. But at least now when someone asks me what kind of dog I have, I'll be able to answer the question. Roscoe Jenkins (left) and Amy Ruth", "external_links": [], "published": "2018-01-27T20:00:00.000+02:00", "crawled": "2018-01-27T20:17:27.006+02:00", "highlightTitle": ""}