{"organizations": [], "uuid": "674b5f0235aa87d1cb6fdcc62812c636bc09b011", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/04/104081092-GC-Image1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/self-made-millionaire-grant-cardone-2-things-to-spend-on-in-2018.html", "country": "US", "domain_rank": 767, "title": "Self-made millionaire: Once you have some money, here's what to do", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T18:27:00.000+02:00", "replies_count": 0, "uuid": "674b5f0235aa87d1cb6fdcc62812c636bc09b011"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/self-made-millionaire-grant-cardone-2-things-to-spend-on-in-2018.html", "ord_in_thread": 0, "title": "Self-made millionaire: Once you have some money, here's what to do", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Do you want to get super rich in 2018? If you're like me, you know that you're capable of doing unbelievable things this year. I believe that you can do it. But you'll need money, and lots of it, to reach your full potential.\nOnce you have some of that money, what steps should you take? Should you put, say, $5,000 in stocks, or in cryptocurrency?\nI get questions like this all the time. There are the two things I tell people:\n1. Spend money on yourself People don't create wealth because they never invest enough in a deal to get a big payoff. Significant wealth creators make big plays, not little ones. If you have a little bit of money, the only big play that you can make is to invest in yourself .\nSpend your money on developing new skills, gaining knowledge, and making powerful connections. You can never lose when you invest in yourself.\nWhat skills can you learn that will increase your ability to collect money from others?\nWhen I was 25, I spent my last $3,000 on an audio program and I can honestly say the investment and commitment to go \"all in\" are the reasons for my success today. Before that, I was addicted to drugs and obsessed with all the wrong things. One single investment changed the whole course of my life.\nDo you see how powerful investing in yourself can be? The sad truth is that most people don't take it seriously. Maybe you have a friend that talks about riches and glory but won't spend a few thousand dollars to learn a skill or make a connection that can make their dreams come true.\nHow does that make sense?\nCourtesy of Grant Cardone Self-made millionaire Grant Cardone. Those kinds of folks, if they do anything at all, look for opportunities to get rich quick without thinking of how to create wealth that can never be destroyed. Don't let that be you. Spend money on yourself so that you can get your income to massive levels.\nOnce your income is up , you'll be ready to start making investments in income-producing assets. Take your money and use it to become better. Add skills and your value will increase in the marketplace.\n2. Spend money on a sure thing After you spend money on gaining new skills, your income will skyrocket. You should put that money away in sacred accounts to prepare for future investments.\nSo, which investments? When it comes to investing, I'm a coward. Losing money terrifies me. One of my goals is to create indestructible wealth so, if anything ever happened to me, my family would never have to worry about the future. When I spend money, I think in terms of my long-term goals and legacy. That's why I don't risk losing my money.\nI only spend money on a sure thing — and real estate has been proven for many years to be the preferred investment of the 1 percent. Why? It produces income.\nIf you make the right investment real estate has proven it's a solid bet. Keep in mind, I don't invest in single-family homes. I go after monster deals that produce income. Just like I mentioned earlier, the same principle applies: Go after a big play. That means putting all your money in a great deal .\nshow chapters Self-made millionaire: Working too hard is not the cause of burnout      10:53 AM ET Thu, 23 Feb 2017 | 01:11 Most people don't go after a big enough deal for it to be worth it. They try to play it safe and small. That's not going to get you the results that you want.\nWhether you choose to invest in real estate or something else, look for income producing assets. That means cash flow. It's said that \"cash is king\" for a reason.\nWhen you're new to investing, I think you're ready to invest once you have saved up $100,000. It's an arbitrary number but, if you can do that, you've proven to yourself that you have enough discipline to make and keep money . Keep the money coming and put it away. Be smart — position yourself to get rich for sure by making big plays on sure things!\nBy spending money on myself and on sure things, I went from literally broke at 25 to on my way to becoming a billionaire at 59.\nGrant Cardone is a highly successful entrepreneur, New York Times best-selling author and sales training expert. \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Mark Zuckerberg just made a 2018 resolution—here's how he and other leaders approach their goals \nshow chapters This is how millennials can catch up to the boomer generation      3:00 PM ET Mon, 15 May 2017 | 00:56", "external_links": [], "published": "2018-01-05T18:27:00.000+02:00", "crawled": "2018-01-05T18:40:01.186+02:00", "highlightTitle": ""}