{"organizations": [], "uuid": "167aecc91e02e9941ae7b1e67eb4af8b261af51c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104864179-20150331-0014-1180.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/berkshire-hathaways-warren-buffett-appoints-greg-abel-and-ajit-jain-as-vice-chairmen.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett takes a step closer to naming a successor as Berkshire appoints Abel and Jain to board as vice chairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T13:03:00.000+02:00", "replies_count": 0, "uuid": "167aecc91e02e9941ae7b1e67eb4af8b261af51c"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/berkshire-hathaways-warren-buffett-appoints-greg-abel-and-ajit-jain-as-vice-chairmen.html", "ord_in_thread": 0, "title": "Warren Buffett takes a step closer to naming a successor as Berkshire appoints Abel and Jain to board as vice chairs", "locations": [], "entities": {"persons": [{"name": "abel", "sentiment": "negative"}, {"name": "gregory abel", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "negative"}, {"name": "jain", "sentiment": "negative"}, {"name": "ajit jain", "sentiment": "none"}, {"name": "charles munger", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "berkshire", "sentiment": "negative"}, {"name": "berkshire hatha", "sentiment": "negative"}, {"name": "berkshire hathaway", "sentiment": "negative"}, {"name": "berkshire hathaway ajit jain", "sentiment": "none"}, {"name": "non-insurance business operations", "sentiment": "none"}, {"name": "berkshire hathaway energy company", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "berkshire hathaway insurance group", "sentiment": "none"}, {"name": "national indemnity company", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warren Buffett on Wednesday appointed Gregory Abel and Ajit Jain to the Berkshire Hathaway board as vice chairs, hinting that one of them is the most likely heir to the Oracle of Omaha at the helm of his sprawling, market-beating conglomerate.\nBuffett told CNBC this is \"part of a movement to succession over time.\"\nAbel, 55, will be vice chair of noninsurance businesses and will likely be seen by Wall Street as the most likely to ascend into Buffett's role eventually. Abel currently is the chairman and CEO of Berkshire Hathaway Energy Company, which he joined in 1992.\nJain, 66, was named vice chair of the insurance operations. Jain is the executive vice president of National Indemnity Company and joined the Berkshire Hathaway Insurance Group in 1986.\nThe company's Board of Directors also voted to increase the number of directors to 14 from 12.\nDaniel Acker | Bloomberg | Getty Images Greg Abel, chairman and chief executive officer of Berkshire Hathaway Energy Co., center, speaks with attendees before the start of the Berkshire Hathaway Inc. annual meeting in Omaha, Nebraska, U.S., on Saturday, May 6, 2017. But Berkshire Hathaway also said Buffett, 87, and 94-year-old partner Charlie Munger will continue in their respective roles as chairman/CEO and vice chairman and be in charge of significant investment decisions for the company.\nAfter the announcement, Berkshire's B share class were slightly in trading.\nBuffett also said on CNBC's \" Squawk Box \" the appointment announcement is not related to any issues from his health.\nSpeculation about who will succeed Buffett as head of the unique conglomerate has picked up in recent years given his advanced age.\nBuffett discussed his succession plan in his annual letter from 2014, saying that he and Munger had already identified who should succeed him.\n\"Our directors believe that our future CEOs should come from internal candidates whom the Berkshire board has grown to know well. Our directors also believe that an incoming CEO should be relatively young, so that he or she can have a long run in the job. Berkshire will operate best if its CEOs average well over ten years at the helm. (It's hard to teach a new dog old tricks.) And they are not likely to retire at 65 either (or have you noticed?). In both Berkshire's business acquisitions and large, tailored investment moves, it is important that our counterparties be both familiar with and feel comfortable with Berkshire's CEO. Developing confidence of that sort and cementing relationships takes time. The payoff, though, can be huge. Both the board and I believe we now have the right person to succeed me as CEO – a successor ready to assume the job the day after I die or step down. In certain important respects, this person will do a better job than I am doing.\"\nFor many years, it was thought that person was Jain because Buffett has often spoken about him so highly.\nDaniel Acker | Bloomberg | Getty Images Ajit Jain, head of the Berkshire Hathaway reinsurance business. Buffett wrote in his annual letter last year: \"Ajit has created tens of billions of value for Berkshire shareholders. If there were ever to be another Ajit and you could swap me for him, don't hesitate. Make the trade!\"\nBut lately, Abel has been discussed as the most likely successor given his younger age and success in running the utility business.\n\"The most likely successor in our view, who Warren Buffett regularly praises, is Greg Abel,\" J.P. Morgan analyst Sarah DeWitt wrote in a note about Berkshire in September. \"Ajit Jain, who runs Berkshire Hathaway Reinsurance, is also believed by many to be a potential successor, although our sense is his age may preclude him.\"\n\"We think Greg Abel would be a strong allocator of capital and the earning power of the underlying businesses would remain strong after Buffett,\" DeWitt added.\nBuffett has guided the sprawling conglomerate to a 20.8 percent compounded annual gain from 1965 through 2016, double the return of the S&P 500 over that period.\nTo achieve that market-beating return, Buffett has assembled a collection of cash-generating industrial and insurance businesses through acquisitions and in turn, invested that cash to make astute large bets on public stocks.\nWhoever takes over for Buffett will likely not retain that full stock-picking role because Buffett brought in two hedge fund managers, Ted Weschler and Todd Combs, in the last decade to do more of the investing.\nBerkshire's B share class traded lower after the announcement as investors began to think again about the future of the company without the Oracle of Omaha in charge.\n\"The stock is likely to drop, perhaps substantially over an extended period when Warren Buffett steps down, although this could ultimately present a buying opportunity because the underlying fundamentals should continue to improve and the board could repurchase significant amounts of stock if the shares fell below 1.2x book value,\" DeWitt's note said.", "external_links": [], "published": "2018-01-10T13:03:00.000+02:00", "crawled": "2018-01-10T14:16:34.003+02:00", "highlightTitle": ""}