{"organizations": [], "uuid": "0a41ec78923d4af9fd8e90ec095d31e86cb1a6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 19}, "facebook": {"likes": 160, "shares": 160, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934309-Bitcoin_Continues.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/treasury-secretary-mnuchin-explains-why-hes-really-looking-closely-at-bitcoin.html", "country": "US", "domain_rank": 767, "title": "Treasury Secretary Mnuchin explains why he's really looking closely at bitcoin", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:25:00.000+02:00", "replies_count": 0, "uuid": "0a41ec78923d4af9fd8e90ec095d31e86cb1a6cd"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/treasury-secretary-mnuchin-explains-why-hes-really-looking-closely-at-bitcoin.html", "ord_in_thread": 0, "title": "Treasury Secretary Mnuchin explains why he's really looking closely at bitcoin", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "dan kitwood", "sentiment": "negative"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "paul achleitner", "sentiment": "none"}, {"name": "christine lagarde", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "imf", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cryptocurrencies need more regulation and their use for illicit trade, money-laundering and \"dark trades\" is unacceptable, global financial leaders including U.S. Treasury Secretary Steven Mnuchin told CNBC on Thursday.\nSpeaking at a panel at the World Economic Forum in Davos, Switzerland, Mnuchin and IMF Managing Director Christine Lagarde and others shared their views about the use of cryptocurrencies in financial markets.\n\"My No. 1 focus on cryptocurrencies, whether that be digital currencies or bitcoin or other things, is that we want to make sure that they're not used for illicit activities,\" Mnuchin told CNBC.\n\"So in the U.S., our regulations [state that] if you're a bitcoin wallet, you're subject to the same regulations as a bank.\"\nshow chapters US Treasury Secretary Mnuchin: Consistent in comments on dollar 9 Hours Ago | 03:32 \"We want to make sure the rest of the world, and many of the Group of 20 countries are already starting on this, have the same regulations. We encourage fintech [financial technology] and innovation, but we want to make sure all of our financial markets are safe,\" he said.\nJoining Mnuchin on the CNBC panel at WEF was Lagarde, U.K. Finance Minister Philip Hammond, BlackRock CEO Larry Fink and Deutsche Bank Chairman Paul Achleitner.\nLagarde told the audience that the IMF had \"already started monitoring and surveilling and analyzing the risks associated with the development of cryptocurrencies and the potential benefits out of it.\"\n\"The fact that the anonymity, the lack of transparency and the way in which it conceals and protects money laundering and financing of terrorism and all sorts of dark trades is just not acceptable.\"\nshow chapters US Treasury Secretary Mnuchin: Want ‘reciprocal and fair’ trade 10 Hours Ago | 01:12 \"But there will be new things and innovations coming out of this movement, and we just need to keep them under our watch,\" she said.\nCryptocurrencies such as bitcoin, ethereum and ripple have dominated financial market chatter and headlines in recent months due to the exponential rise in demand and price. One bitcoin currently costs $11, 236 but cryptocurrencies have seen volatile price movements amid government moves to restrict, investigate or regulate them.\n'Index of money laundering' BlackRock's Fink told CNBC and the audience that cryptocurrencies were like an \"index of money laundering than anything more than that.\" However, he did praise the underlying technology behind these currencies. Known as the blockchain, this resembles a global online database that anyone with an internet connection can use. This facilitates and logs cryptocurrency transactions and is seen as a technology borne out of bitcoin that could potentially outlast the cryptocurrency craze.\n\"It is a real technology and it has created a fascination for millions of people, but it's real and it's going to transform how we do our businesses, and we should not turn our backs on it. We should embrace it and work towards a global solution [to managing it] because if we don't it will create systemic risk,\" Fink said.\nshow chapters Should you invest in a cryptocurrency? 9:27 AM ET Thu, 26 Oct 2017 | 05:22 Banking chiefs have watched the rise of cryptocurrencies, which are not created by states, with great interest, as have the traditional creators of money, central banks.\nDeutsche Bank's Achleitner said there needs to be a distinction between the technology — blockchain — and cryptocurrencies.\n\"What do you want from a currency? You want it to be liquid, you want it to be stable and you want it not to be forged — now there we are in the crypto space. But central banks control the creation of money and they delegate some of that to banks. ... So why central banks would sit back and watch how somebody is creating money is, I think, just a temporary phenomenon,\" he said.\n\"Still, that takes nothing away from the fundamental promises of the blockchain technology that is behind some of these cryptocurrencies. So I think we need to distinguish between the two, look away from the hype and take the long-term benefits out of it,\" he said.\n\"[We should] invest in the technology, that has a lot of potential for the remaking of the financial services, and focus on that as opposed to the short-term hype.\"", "external_links": [], "published": "2018-01-25T14:25:00.000+02:00", "crawled": "2018-01-25T15:07:29.009+02:00", "highlightTitle": ""}