{"organizations": [], "uuid": "4ef56020144e5feddca0640d696c5fb5c132d9c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974578-GettyImages-911834608r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/30/three-events-in-the-next-24-hours-that-could-determine-whether-the-sell-off-continues.html", "country": "US", "domain_rank": 767, "title": "Three events in the next 24 hours that could determine whether the sell-off continues", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T23:04:00.000+02:00", "replies_count": 0, "uuid": "4ef56020144e5feddca0640d696c5fb5c132d9c6"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/three-events-in-the-next-24-hours-that-could-determine-whether-the-sell-off-continues.html", "ord_in_thread": 0, "title": "Three events in the next 24 hours that could determine whether the sell-off continues", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "treausry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider Three events in the next 24 hours that could determine whether the sell-off continues The stock market's worst enemy this week has been the bond market and rising interest rates, and now three big events could push those rates even higher in the next 24 hours. The first is President Donald Trump's State of the Union speech. The second is the Treausry's funding announcement at 9 a.m. which should provide details on auction sizes. And finally the Federal Reserve holds its two-day meeting and is expected to issue a statement at the end of ts meeting Wednesday that could sound slightly more hawkish. Getty Images President Donald J. Trump \nThe jump in interest rates to four-year highs is the biggest catalyst behind the stock market's sell off, and there are three big events that could send those rates even higher in the next 24 hours. \nThe first is President Donald Trump's State of the Union speech Tuesday evening. On the surface, it appears harmless and possibly positive, but bond strategists say there are several risk factors associated with it. \nOne is that the president's plan to spend on infrastructure could end up increasing the national debt. The U.S. is already expected to double the size of its debt issuance this year, to nearly $1 trillion, and that is a factor that's been weighing on Treasury prices, which move opposite yields. \n\"It's $200 billion of actual spending, enhanced by private capital and municipal spending. Munis aren't really in a position to do that. It sounds better on paper than it is in practice,\" said George Goncalves, head of fixed income strategy at Nomura. \nThe second event and the one strategists see as the biggest wild card, is Treasury's refunding announcement, which includes details on the first quarter Treasury auctions at 8:30 a.m. ET Wednesday and possibly on other funding needs for 2018. \nWhile usually a minor event, this week everyone in markets is watching it. The government needs about $1 trillion in new debt this year, almost double last year's level. The bigger debt requirement is due to more spending from the tax cuts and also an increase in entitlement spending. \n\"That's huge. There's a lot of talk about that. We differ from the consensus so we think supply is at least going to pickup in the very long end, the 30-year bond. A lot of people think there will only be increases in the short end,\" said Michael Schumacher, director of rates at Wells Fargo. \nBriggs said he expects the auction size for 10-year notes and 30-year bonds to increase by $1 billion each, but any surprise could cause Treasury yields to move. He said the announcement should add supply across the curve, meaning an increase in Treasury bills at the short end all the way to the 30 year bond at at the long end. \nThe 10-year Treasury yield was at 2.72 percent in afternoon trading Tuesday, a big move from the 2.40 percent at the end of December. The 30-year was close to crossing the psychological 3 percent threshold. \nWhen interest rates rise, they can become a challenge for stocks because they offer higher yielding investment alternatives and also make for higher borrowing costs for corporations. The closely watched benchmark 10-year Treasury yield impacts a whole range of borrowing rates from small business loans to home mortgages. \nGoncalves said the government funding announcement will be important, particularly since it comes after the State of the Union focus on spending. \n\"Wednesday morning we may wake up and realize there's more debt coming down the road. Then we see the government estimates for its borrowing needs,\" he said. \"...that could be the one two punch that brings us to near term highs in rates for at least the week and maybe for the next month.\" \nThe final event is normally the one that would have the most potential to be market moving, but it is not expected to have much impact this week. The Fed meeting, under way Tuesday, concludes on Wednesday and the Fed issues at 2 p.m. ET statement. \nWhile the Fed is not expected to raise rates at Fed Chair Janet Yellen's final meeting, i t could indicate that the economy is improving and comment on inflation, which is running below its target. \nBut in the run up to the meeting, the market is also beginning to expect a fourth rate hike for this year on top of the three the Fed is currently forecasting. If the statement sounds hawkish, that could pressure shorter term rates, like the 2-year. The 2-year Tuesday was at 2.12 percent. \n\"I feel like we have this crescendo moment if everything lines up like I suspect,\" said Goncalves. \nThere are other factors impacting bond yields this week, including Friday's jobs report, which could drive yields higher if wages rise more than expected. \n\"Technically, the charts show rates are stretched, and they're due for a pull back. We have month end which will coincide with the day after the president's speech,\" Goncalve said. \nStrategists also say there could also be political risk this week around the State of the Union. \n\"I think the only risk is if his trade rhetoric is aggressive, not just on NAFTA but on China,\" said John Briggs, head of strategy at NatWest Markets. \nTrump could also venture into another area that would make the market nervous — the investigation into Russia's involvement in his campaign, and now the expected release of a GOP memo that is reported to detail FBI bias against Trump. \n\"I'm not sure much can salvage what's going on with sentiment now—all this chatter about the memo and concern about the just what's going to happen with the Russia probe. The negative is if he fires [Special counsel Robert] Mueller, it doesn't go away. It just gets worse,\" said Tom Simons, chief money market economist at Jefferies. \"It kind of casts a cloud over the State of the Union. If he's going to talk about infrastructure, it's not going to have much affect. He's going to talk about getting bipartisan cooperation in Congress. It's just like a fantasy to think that's something he can really expect.\"", "external_links": [], "published": "2018-01-30T23:04:00.000+02:00", "crawled": "2018-01-30T23:08:30.017+02:00", "highlightTitle": ""}