{"organizations": [], "uuid": "90aec85d7a013344b5abd951143723d64809d183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877783-GettyImages-450831338.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/how-cities-rate-in-the-race-to-win-amazons-new-headquarters.html", "country": "US", "domain_rank": 767, "title": "A stat sheet on the 20 city finalists trying to win Amazon's new headquarters", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T21:38:00.000+02:00", "replies_count": 0, "uuid": "90aec85d7a013344b5abd951143723d64809d183"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/how-cities-rate-in-the-race-to-win-amazons-new-headquarters.html", "ord_in_thread": 0, "title": "A stat sheet on the 20 city finalists trying to win Amazon's new headquarters", "locations": [], "entities": {"persons": [{"name": "jeff bezos", "sentiment": "negative"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "raleigh", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "montgomery county", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "northern virginia", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "getty images amazon.com", "sentiment": "negative"}, {"name": "washington post", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "34 Mins Ago | 03:22 \nAmazon's list of 20 finalists for its coveted HQ2 project , announced Thursday, includes some of the most competitive cities in the world—let alone in North America—and data compiled by CNBC bears that out. Now, the already heated battle is likely to turn red hot as the competition moves to a second round. \nAt stake: a $5 billion facility that will employ 50,000 and boost state coffers by adding billions of dollars in additional investment in the surrounding community over the next 10 to 15 years. \nMany of the finalists were thought to be contenders from the start. They include cities CNBC has already visited as we evaluate the bids: Chicago, Columbus, Ohio; Raleigh, North Carolina; and Denver. But three dark horse candidates join the list: Los Angeles, Indianapolis, and Toronto. The list includes three locations in and around the nation's capital: Washington, DC; the Northern Virginia suburbs, and Montgomery County, Maryland. The area was already receiving buzz based on Amazon CEO Jeff Bezos' ownership of the Washington Post. Getty Images Amazon.com founder and CEO Jeff Bezos. \nBut failing to make the cut are sentimental favorites like Detroit, which submitted a joint bid with Windsor, Ontario. Also off the list: Houston—Bezos' boyhood home—as well as Phoenix and Tucson, Arizona, and Salt Lake City. \n\"Getting from 238 to 20 was very tough — all the proposals showed tremendous enthusiasm and creativity,\" Holly Sullivan, an executive with Amazon Public Policy, said in a statement. \nA number of factors can help gauge which cities have a chance at this coveted bid. Amazon has stated criteria noting it favors metro areas with 1 million people and a stable, business-friendly environment. It also wants a location with strong local and regional talent — particularly in software development and related fields — and a community that thinks \"big and creatively.\" \nAlso included in a request for proposals issued by Amazon in September: convenient access to mass transit and an international airport, a highly educated labor pool, a strong university system and a diverse population. \nNow that Amazon has narrowed down the field, we have done the same in our ongoing analysis of the contenders. And we have added new grades for Los Angeles, Indianapolis, Toronto, and Montgomery County, Maryland. \nOur analysis scores the locations based on Amazon's main criteria—population, stability/business friendliness, talent, and location—using data from our 2017 America's Top States for Business study and the Census Bureau. Apples-to-apples data for Toronto is tricky, but we used figures from Statistics Canada, Transportation Canada, Ontario's Transportation Ministry, and the Association of Municipalities of Ontario. \nNo one outside of Amazon knows for certain how the company will score things, but our data offers some insight into which finalists have the best chances. First, a look at the new cities on the list: Los Angeles, California Matthew Gush | Stock / 360 | Getty Images Skyline of downtown Los Angeles, California \nLos Angeles has the talent, that's for sure. Higher education in the Golden State is outstanding, and Southern California's tech scene is giving Silicon Valley a run for its money. It also would not hurt Amazon's growing studio arm to have a bigger presence near Hollywood. \nBut this is California—notoriously unfriendly in terms of business regulation, though the economy has improved considerably. Making the list of finalists is giving the business community here renewed hope, unless it turns out to be a Hollywood fantasy. Indianapolis, Indiana John J. Miller Photogrpahy | Getty Images Indianapolis, Indiana \nIndianapolis is the capital of the Crossroads of America, and given Amazon's interest in strong infrastructure in its new location, that is not a bad distinction to have. The state economy is strong, stable, and business friendly. But the region lacks some of the options its competitors have when it comes to air travel. \nIndiana also suffers from shortages of workers—particularly the skilled workers Amazon craves. Toronto, Ontario Roberto Machado Noa | LightRocket | Getty Images Canadian flag and the Toronto skyline. \nAmazon had opened its search to locations across North America, but Toronto is the only non-U.S. city to make the cut. But it brings considerable might to the competition. The region far outpaces its American counterparts when it comes to an educated workforce. \nBusiness costs in Canada are tempting—the corporate tax rate is well below the U.S., even after the Trump tax cuts, and the Canadian dollar is cheap. But Toronto suffers some of the same problems as any other big city, including an aging infrastructure. And business regulation in Canada can be far stricter than in the U.S. Montgomery County, Maryland Denis Tangney Jr. | Getty Images Rockville is a city located in the central region of Montgomery County, Maryland. \nWe are grading D.C.'s Maryland suburbs separately from Northern Virginia because Maryland has some different pluses and minuses. On the positive side, the skilled workforce is plentiful here—particularly the all-important STEM workforce. But Maryland is a much less business-friendly state than Virginia. \nIf Amazon is intent on setting up shop in the D.C. area, it may do best in Virginia or the District itself. \nOther cities on the list are already well respected in economic development circles. Making it into Amazon's top 20 is yet another feather in their competitive caps. Denver, Colorado Bridget Calip | Getty Image Denver, Colorado \nEven before any city had submitted a bid, the New York Times in September declared Denver to be the winner. Our analysis is a little less glowing. Yes, the state has a tremendous talent pool, a thriving tech scene, and a business-friendly environment. But the state is dealing with a serious pension problem, which hurts the overall economy. Costs can be high, and the infrastructure needs work. \nGov. John Hickenlooper today gave the following statement on Amazon releasing the list of 20 finalists for its second headquarters. \"It's great to be on Amazon's list of finalists as they consider the location of their second headquarters,\" said Governor John Hickenlooper. \"Colorado is one of the most business-friendly states in America and we believe the Denver region would be a great choice for Amazon.\" Raleigh, North Carolina Sean Pavone | Getty Images Raleigh, North Carolina \nThe capital of the Tar Heel State benefits from a state with one of the best workforces in the country and a heritage of innovation dating back to the Wright Brothers. \n\"When I talk to CEOs about whether they will expand or bring their company to a state, the first thing they talk about is work force and talent,\" North Carolina Governor Roy Cooper told CNBC in November. \"North Carolina checks all of those boxes for Amazon.\" \nCounting against the state is a lack of mass transportation and a nagging lack of inclusiveness. North Carolina repealed the most controversial parts of its so-called bathroom bill, but it still lacks statewide protections against discrimination and expressly bars them at the local level. North Carolina finished No. 5 in this year's Top States rankings. Atlanta Steve Kelley | Getty Images", "external_links": [], "published": "2018-01-18T21:38:00.000+02:00", "crawled": "2018-01-18T22:00:23.002+02:00", "highlightTitle": ""}