{"organizations": [], "uuid": "6ddebf68551c23606cd7e79557659716ac818e37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938562-147664_7957.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/how-shark-tanks-barbara-corcoran-reinvented-herself.html", "country": "US", "domain_rank": 767, "title": "From real estate CEO to 'Shark Tank' star: How Barbara Corcoran reinvented herself in her 50s", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T17:50:00.000+02:00", "replies_count": 0, "uuid": "6ddebf68551c23606cd7e79557659716ac818e37"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/how-shark-tanks-barbara-corcoran-reinvented-herself.html", "ord_in_thread": 0, "title": "From real estate CEO to 'Shark Tank' star: How Barbara Corcoran reinvented herself in her 50s", "locations": [], "entities": {"persons": [{"name": "barbara corcoran", "sentiment": "neutral"}, {"name": "patrick mcmullan", "sentiment": "neutral"}, {"name": "corcoran", "sentiment": "none"}], "locations": [], "organizations": [{"name": "aarp", "sentiment": "none"}, {"name": "rolodex", "sentiment": "none"}, {"name": "corcoran group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Patrick McMullan | Getty Images SHARES \nBarbara Corcoran should have been on top of the world when she sold her successful real estate firm, The Corcoran Group, for $66 million in 2001. Yet despite her huge success, she felt miserable. \n\"It's a hard thing to be a big deal in town and then be a nobody,\" Corcoran tells AARP . \nCorcoran needed a new goal to strive for. So she put her thoughts on paper and quickly realized a whole new realm of career possibilities. \n\"It took a while, but I finally wrote a list of what I loved and what I hated. And I found out that the things I loved were very few,\" she tells the magazine. \"I loved making people happy. I loved the media. And I loved the attention of a crowd. \n\"So I decided to go into the TV business,\" she says. \nThere was just one major problem: \"I thought it would be easy, but my entire Rolodex was useless,\" she says. \n\"Even if you're a pro at the top of your game in your industry, once you switch to a different field you're starting from scratch,\" explains Corcoran in a 2015 LinkedIn post . \nThen Corcoran received some advice from television icon Barbara Walters that helped set her on the right path. Corcoran was going for total reinvention when should have been taking baby steps. show chapters 4:56 PM ET Fri, 11 March 2016 \n\"I went on The View and she asked me, 'What do you do now?' I said, 'I'm trying to become a TV expert on small business because I don't ever want to talk about real estate again,'\" Corcoran recalls. \nWalters encouraged her to use her expertise to make her move. \"She said, 'You better grab real estate and make it your own if you want to go into TV,\" Corcoran tells AARP. \"Because the minute someone else does, you're going to hate yourself. \n\"That was great advice,\" says Corcoran. \nIn fact, she now gives the same advice to others. \n\"Repackage yourself,\" advises Corcoran on LinkedIn, and make changes in stages. ABC | Matt Petit \"Shark Tank\" stars Robert Herjavec, Daymond John, Lori Greiner, Kevin O’Leary, Mark Cuban, Babara Corcoran \n\"Successful reinvention can't happen overnight. So instead of trying to reach my end goal as a business expert on TV, I built my new persona in small steps,\" Corcoran writes . \"I started as an occasional on-air guest on local TV, then got paid as a real estate contributor on morning talk shows, and finally landed as a Shark/Investor on ABC as a business expert. \nIndeed, Corcoran, now 68, was able to pivot from brokering real estate deals to being a contributor for shows including ABC's \" Good Morning America \" and NBC's \" The TODAY Show .\" And after landing a spot on ABC's \"Shark Tank\" in 2008, she has since become a regular on the small-screen, and was even tapped for ABC's \"Dancing with the Stars\" in 2017. \n\"Change is tough and you can always come up with 100 reasons not to do something or quit in the process, but reaching a goal that you bravely fought and won, is invigorating and a worthy reason for doing it,\" Corcoran writes on LinkedIn. ", "external_links": [], "published": "2018-01-10T17:50:00.000+02:00", "crawled": "2018-01-10T18:15:54.065+02:00", "highlightTitle": ""}