{"organizations": [], "uuid": "9fb233306369066275cd1be457ad41d5ccc3b749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968379-RTX4K3DO.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/trump-tells-cnbc-cutting-regulations-as-big-as-tax-cuts.html", "country": "US", "domain_rank": 767, "title": "Trump says cutting regulations 'was every bit as important as what we did with the tax cuts'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T14:20:00.000+02:00", "replies_count": 0, "uuid": "9fb233306369066275cd1be457ad41d5ccc3b749"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/trump-tells-cnbc-cutting-regulations-as-big-as-tax-cuts.html", "ord_in_thread": 0, "title": "Trump says cutting regulations 'was every bit as important as what we did with the tax cuts'", "locations": [], "entities": {"persons": [{"name": "joe kernen", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump spoke exclusively to CNBC's Joe Kernen in the run-up to his speech Friday at the World Economic Forum in Davos, Switzerland . Trump's key pitch to global political and business leaders is that America is open to their business, but on \"America first\" terms. The president has been talking up the effects of recently implemented tax cuts, including a big reduction in the corporate tax rate, but he also claims that cuts in regulations has also helped U.S. economic policy.\nHere, Trump talks about what he considers the impact of reduced regulations on U.S. gross domestic product :\nOK. Now, in my first quarter, which I consider to be the second quarter because I was there now long enough to have made an impact and don't kid yourself, regulations are just as big as the tax cuts. I've cut more regulations than any president in history and I've been here for one year. You can take their term whether it's eight years or 16 years in one instance — but you can take anybody you want, in one year, we've cut more regulations. And by the way, there's going to be regulation but they're good, solid, sane regulations. But in quarter two, we had 3.1, and in quarter three, as you know, we had 3.2. But in quarter one, which is the Obama quarter — really the last, I would say, Obama quarter, you had 1.2. We were going in the wrong direction.\nHere, the president talks about how he sees his regulatory approach enticing companies to bring business to the U.S.\nBut I also want these great companies that are coming in – Toyota 's now coming in. We talked already about Apple . Apple's coming in with a very big presence. We had many companies – Chrysler's coming in, leaving Mexico and coming back to Michigan. I mean, how good is that? When was the last time you heard that? And without me being here and without what we've been doing including regulation, by the way, because I happen to think that regulation is as big as the tax cuts, OK? I think the tax cuts are incredible. But I think the regulations, the cutting of regulations — because the businesses couldn't even — they couldn't do anything. They were totally bound. You'd have to get 16 different approvals from 15 different agencies. Hey Joe, it was impossible to do business. And I think you know that maybe better than anybody. The cutting of the regulations was every bit as important as what we did with the tax cuts. But you put them both together and we have a dynamic country again. I mean, everybody's talking. I just came out and some really wonderful people said, \"Davos has never been like this.\" This is like walking into the Academy Awards, except we have more photographers.", "external_links": [], "published": "2018-01-26T14:20:00.000+02:00", "crawled": "2018-01-26T14:42:15.002+02:00", "highlightTitle": ""}