{"organizations": [], "uuid": "a4a88624f5ef699f54cc257ea8d20b6dfd97fcfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 20}, "facebook": {"likes": 45, "shares": 45, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/22/104358334-GettyImages-649816122.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/december-2017-new-home-sales.html", "country": "US", "domain_rank": 767, "title": "New home sales in December underwhelm, snapping back from 10-year high in November", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "a4a88624f5ef699f54cc257ea8d20b6dfd97fcfc"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/december-2017-new-home-sales.html", "ord_in_thread": 0, "title": "New home sales in December underwhelm, snapping back from 10-year high in November", "locations": [], "entities": {"persons": [{"name": "paul j. richards", "sentiment": "none"}, {"name": "reut", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "fairfax", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "commerce department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sales of new U.S. single-family homes fell more than expected in December, recording their biggest drop in nearly 1-1/2 years, likely as the boost from the replacement of flood-damaged houses in parts of the South affected by hurricanes faded.\nThe Commerce Department said on Thursday new home sales declined 9.3 percent to a seasonally adjusted annual rate of 625,000 units last month. The percentage decrease was the largest since August 2016.\nNovember's sales pace was revised down to 689,000 units, still the strongest performance since July 2007, from the previously reported 733,000 units.\nUnseasonably cold temperatures at the end of December probably also hurt sales. Economists polled by Reuters had forecast new home sales, which account for 10.1 percent of the housing market, tumbling 7.9 percent to a pace of 679,000 units last month.\nNew home sales, which are drawn from permits, are volatile on a month-to-month basis. Sales plunged 9.8 percent in the South last month after jumping 6.6 percent in November amid reconstruction efforts following the devastation caused by Hurricanes Harvey and Irma. Sales fell 10 percent in the Midwest last month.\nNew home sales surged 14.1 percent from a year ago. They increased 8.3 percent in 2017 to 608,000 units.\nA strong labor market, which is near full employment, has unleashed demand for housing that has not been matched with an increase in supply. As a result, house price inflation has outpaced wage growth, pricing some first-time home buyers out of the market.\nA report on Wednesday showed sales of previously owned homes declined 3.6 percent to a seasonally adjusted annual rate of 5.57 million units last month as inventory of houses dropped to a record low.\nIn December, there were 295,000 new homes on the market, an increase of 3.9 percent and the highest level since April 2009. The stock of new home sales still remains well below its peak during the housing market bubble. At December's sales pace it would take 5.7 months to clear the supply of houses on the market, up from 4.9 months in November.\nA six-month supply is viewed as a healthy balance between supply and demand.", "external_links": [], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T17:20:54.052+02:00", "highlightTitle": ""}