{"organizations": [], "uuid": "12deb036f7b50c902f7b4d4e5473b314063f969a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104963303-GettyImages-501831730.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/sinovation-ventures-ceo-kai-fu-lee-at-davos-on-chinese-business.html", "country": "US", "domain_rank": 767, "title": "China's method of business will ultimately beat out the US approach, CEO says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T08:42:00.000+02:00", "replies_count": 0, "uuid": "12deb036f7b50c902f7b4d4e5473b314063f969a"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/sinovation-ventures-ceo-kai-fu-lee-at-davos-on-chinese-business.html", "ord_in_thread": 0, "title": "China's method of business will ultimately beat out the US approach, CEO says", "locations": [], "entities": {"persons": [{"name": "lee", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "sinovation ventures", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "14 Hours Ago | 03:41 \nChinese entrepreneurs are focused on their domestic market, but they will start looking abroad within the next five to 10 years, according to the chairman and CEO of venture capital firm Sinovation Ventures. \nWhen that time comes, the Chinese business approach will lead to those companies taking a larger share of foreign markets than their U.S. competitors, the CEO predicted. \n\"The Chinese approach will be much more partnership-friendly,\" Lee claimed, saying that those companies are more prone to \"investing in local companies and partnering with them.\" \nThe U.S. approach, meanwhile, is \"more monolithic, taking Facebook and Google everywhere,\" Lee told CNBC at the World Economic Forum meeting in Davos, Switzerland. \n\"I would bet that for those markets outside the U.S., English speaking countries and Western Europe , I would bet on China taking a larger share of that market,\" said Lee, whose firm says on its website that it manages about $1.3 billion in assets and has offices in both the U.S. and China. \nDespite his positive outlook, many Chinese entrepreneurs and businesses are still largely concentrated within the world's second-largest economy. VCG | Getty Images Kai-fu Lee, chairman and CEO of Sinovation Ventures on December 17, 2015. \n\"The China domestic market is so large, it is three times the size of the U.S. and even larger if you consider things like mobile payment and things like that, it's 50 times larger than the U.S.,\" Kai-Fu Lee explained. \n\"So I think for the Chinese entrepreneur, typically the opportunity domestically is so large. There isn't a lot of them looking overseas,\" the CEO said. \nBut, Lee said, that inward-looking model will not last, and Chinese entrepreneurs will be equally successful when they decide to expand their businesses outside of China. \n\"I do envision, within the next five to 10 years, the U.S. will continue to lead with its monolithic platform products in the U.S., English speaking countries and Western Europe,\" Lee said. \"China will continue to lead in China.\" \nLee praised the culture that has developed within Chinese tech companies that has allowed entrepreneurs to compete with their counterparts in Silicon Valley. \nWhile Lee admitted that \"there is no doubt that Silicon Valley remains the core of innovation,\" he said he is confident that China will not turn into a copy of Silicon Valley. \n\"China is also a very amazing model of a unique type of business value creation in the Chinese entrepreneur environment,\" Lee said, adding that \"I think Chinese companies learn very quickly. They fail fast, learn fast, [and] grow fast.\"", "external_links": [], "published": "2018-01-24T08:42:00.000+02:00", "crawled": "2018-01-24T09:00:29.007+02:00", "highlightTitle": ""}