{"organizations": [], "uuid": "b046cd7b763b7df81fa1b45d42c2acbc0edba103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965649-GettyImages-179798079.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/ai-used-to-predict-when-people-may-die-for-better-medical-care.html", "country": "US", "domain_rank": 767, "title": "These scientists are using AI used to predict when people will die for better access to medical care", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:15:00.000+02:00", "replies_count": 0, "uuid": "b046cd7b763b7df81fa1b45d42c2acbc0edba103"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/ai-used-to-predict-when-people-may-die-for-better-medical-care.html", "ord_in_thread": 0, "title": "These scientists are using AI used to predict when people will die for better access to medical care", "locations": [], "entities": {"persons": [{"name": "kenneth jung", "sentiment": "none"}, {"name": "andrew ng", "sentiment": "none"}, {"name": "lance downing", "sentiment": "none"}, {"name": "stephanie harmon", "sentiment": "none"}, {"name": "nigam h. shah", "sentiment": "none"}, {"name": "anand avati", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "stanford university", "sentiment": "neutral"}, {"name": "stanford", "sentiment": "none"}, {"name": "stanford center for biomedical informatics research", "sentiment": "none"}, {"name": "stanford university school of medicine", "sentiment": "none"}, {"name": "stanford department of computer science", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A team of six Stanford University scientists has used artificial intelligence to predict when people will die in order to improve access to palliative care, or specialized care for patients with particularly serious illnesses.\nCurrently, less than half of the 7 to 8 percent of individuals admitted to a hospital who need palliative care receive it, according to a report about the study written by Anand Avati and Andrew Ng from the Stanford Department of Computer Science; Kenneth Jung, Lance Downing, and Nigam H. Shah from the Stanford Center for Biomedical Informatics Research; and Stephanie Harmon, from the Stanford University School of Medicine.\nHuman physicians tend to be overly optimistic about whether and how long a patient will live, according to the brief . Also, Palliative caregivers and resources are limited. So to help increase access to care for those who would most benefit, the the Stanford team used artificial intelligence to identify patients who are likely to die between three and 12 months out.\nIf a patient is going to die in under three months, a palliative care team does not have enough preparatory time to administer the program. If a patient is predicted to die after 12 months, it is harder to accurately predict a time of death, the report says.\nTypically, physicians review the chart for every new hospital case to determine whether a patient is eligible for palliative care. That's time consuming and doctors' personal biases can affect care decisions.\n\"Our predictions enable the palliative care team to take a proactive approach in reaching out to such patients,\" the report says, and provides \"an objective recommendation based on the patient's EHR (electronic health records).\"\nshow chapters This CEO wants to put a computer chip in your brain 10:35 AM ET Wed, 12 April 2017 | 01:15 Using AI to identify patients who should receive care may miss some, admits Shah. But using the AI is better than not.\n\"Right now we miss most of [the patients who should receive palliative care], because clinicians over estimate survival... Less than one percent of individuals who die are offered palliative care more than six months before their passing,\" says Shah to CNBC Make It. \"So at this juncture, even if the AI assisted approaches misses half the cases, we'd still be way better off than the current state of affairs.\"\nFor the study, the team used data from 2 million electronic health records of both adults and children treated for advanced illness at the Stanford Hospital or the Lucile Packard Children's Hospital.\n\"The predictions from the model are only used to highlight some of the admitted patients for a chart review by (and automated referral to) the palliative care team,\" says Avati to CNBC Make It . \"The human doctor is always in the loop, and the decision of the program is only interpreted as a case worthy of palliative care consult — and not as a prediction of death,\" Avati says.\nPrediction of death is used as a proxy for advanced illness to identify those candidates who should be considered, but it's important to note that palliative care is not always end-of-life care.\n\"A patient in the hospital getting a bone marrow transplant (curative therapy) has severe side effects including pain from the highly toxic treatment regimen,\" says Harman to CNBC Make It . \"Palliative care is often consulted for a patient like this to treat these side effects and help them get through their curative treatment.\"\nTime of death is an effective surrogate, the report found. For example, for one patient subset where AI predicted that 90 percent of the patients would die in between three and 12 months, the team randomly selected 50 of those people to manually evaluate as well. All 50 were deemed \"appropriate for a referral,\" the report says. In other words, the AI worked the way it was supposed to.\nSee also:\nJapanese scientists just used AI to read minds and it's amazing\nThis former Google[X] exec is building a high-tech hat that she says will make telepathy possible in 8 years\nAhead of Elon Musk, this self-made millionaire already launched a company to merge your brain with computers\nshow chapters This former GoogleX'er is developing a technology that will make telepathy possible in 8 years 12:06 PM ET Fri, 7 July 2017 | 01:37 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-25T16:15:00.000+02:00", "crawled": "2018-01-25T16:27:47.013+02:00", "highlightTitle": ""}