{"organizations": [], "uuid": "79d5a68c1599e4b2671ad05c7ecd597f6b3056b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/goldman-sachs-ceo-lloyd-blankfein-businesses-tied-to-global-growth-are-doing-very-very-well.html", "country": "US", "domain_rank": 767, "title": "Goldman CEO Blankfein has 'really liked' what Trump has done for the economy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T15:27:00.000+02:00", "replies_count": 0, "uuid": "79d5a68c1599e4b2671ad05c7ecd597f6b3056b4"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/goldman-sachs-ceo-lloyd-blankfein-businesses-tied-to-global-growth-are-doing-very-very-well.html", "ord_in_thread": 0, "title": "Goldman CEO Blankfein has 'really liked' what Trump has done for the economy", "locations": [], "entities": {"persons": [{"name": "goldm", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "blankfein", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "lloyd blankfein", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "organizations": [{"name": "goldman", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "sachs", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Though he's taken a few jabs at President Donald Trump, Goldman Sachs CEO Lloyd Blankfein said Wednesday he's otherwise \"really liked what he's done for the economy.\"\n\"I'd say I like a lot more stuff than I don't like, and some of the stuff I don't like I really don't like,\" Blankfein told CNBC's \" Squawk Box \" during an interview at the World Economic Forum in Davos. \"But I don't want to be hypocritical, either. I've really liked what he's done for the economy.\"\nIn fact, he conceded that conditions probably would be weaker had Democrat Hillary Clinton defeated Trump in the 2016 election. Blankfein supported Clinton during the contentious campaign, and occasionally has taken shots at Trump on Twitter and elsewhere.\nSince Trump's win, the Dow has surged more than 40 percent and the economy is on its way to its third-straight quarter of growth topping 3 percent. Trump also has been aggressive in rolling back the thousands of regulations added during his predecessor Barack Obama 's term.\n\"I think the market would be lower [under Clinton], I'd be dealing with more regulation,\" Blankfein said. \"I'd say the animal spirits are out there and [more] vital than they would be otherwise.\"\n\"The country would be a bit less polarized, but I'm not even sure about that,\" he added.\nHe did express some caution about market values, which he said have been elevated due to a low interest rate environment.\n\"I'd feel a lot better about where asset prices are, including equities, if interest rates were normalized,\" he said.\nThough the Fed has raised its benchmark rate five times since December 2015, real interest rates compared with inflation are still around zero. Blankfein said \"normalization\" of rates is needed before it can be determined if the current prices can be sustained.\nThe remarks came during a wide-ranging interview with the head of the investment banking giant.\nDespite a weak trading environment that has held back revenue, Blankfein said the bank is otherwise in a solid position, thanks to global growth.\n\"We're kind of in a sweet spot, and I like it this way,\" he said. \"Let me tell you, trading is soft. All our other businesses which correlate to global growth are kind of doing very, very well and I think he's gone out of his way to be very, very supportive of the system.\"\nThe firm recently reported earnings and revenue that topped Wall Street expectations . However, the stock remains a laggard, up just over 2 percent in 2018 while the SPDR S&P Bank ETF, a proxy for the sector, has surged more than 8 percent.\nWATCH: Goldman CEO Lloyd Blankfein talks taxes, politics and trading from Davos show chapters Goldman CEO Lloyd Blankfein talks taxes, politics and trading from Davos 5 Hours Ago | 10:28", "external_links": [], "published": "2018-01-24T15:27:00.000+02:00", "crawled": "2018-01-24T15:32:41.005+02:00", "highlightTitle": ""}