{"organizations": [], "uuid": "3b194709303a718a70fbed1f5df0a12e40da3776", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-banks-fintech-glmx/glmx-reboots-high-tech-platform-in-post-crisis-repo-environment-idUSKBN1FE20C", "country": "US", "domain_rank": 408, "title": "GLMX reboots high-tech platform in post-crisis repo environment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:11:00.000+02:00", "replies_count": 0, "uuid": "3b194709303a718a70fbed1f5df0a12e40da3776"}, "author": "", "url": "https://www.reuters.com/article/us-banks-fintech-glmx/glmx-reboots-high-tech-platform-in-post-crisis-repo-environment-idUSKBN1FE20C", "ord_in_thread": 0, "title": "GLMX reboots high-tech platform in post-crisis repo environment", "locations": [], "entities": {"persons": [{"name": "kate duguid", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "glmx", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - GLMX has raised $20 million in financing and updated its high-tech platform for trading repurchase agreements and secured lending to help clients comply with new regulatory reporting requirements, the company said on Thursday.\nThe rise of non-bank institutions marks an evolution in the multitrillion-dollar repo market. As rules implemented since the 2008 financial crisis have made the business less attractive for Wall Street banks, companies like Palo Alto, California-based GLMX have stepped in to fill the gaps.\nNoting the lack of innovation and automation in fixed income markets, GLMX Chief Executive Officer Glenn Havlicek said he founded the company in 2010 to address “fragmentation and inefficiency in the front end of the markets.”\nGLMX, which acts as an intermediary between funds looking to finance trading bets and money-market investors with ready cash, said it doubled its client base last year, with average weekly trading volumes increasing by 400 percent to more than $68 billion.\nThe company expects the latest investment to help it expand its operations in Europe, where repo markets face new regulatory requirements under the Markets in Financial Instruments Directive, or MiFID II, and Securities Financing Transactions Regulation, or SFTR.\n“Global repo markets are in the midst of significant change, driven by evolving capital needs and regulatory requirements,” said Havlicek.\nTraditionally, banks were both participants in and mediators of repo deals. But post-crisis rules have forced banks to adopt higher leverage ratios after a panic in the repo market shuttered Lehman Brothers.\nBanks must therefore hold onto safe assets like Treasuries instead of loaning them out, limiting their involvement in the repo space. As banks have retreated from repo deals, they have also stepped back from their roles as deal mediators.\nGLMX’s platform features updated technology, automating the collection of pre- and post-trade data required under new rules, which otherwise must be keyed in manually. The streaming function of the platform sends the data collected directly to watchdogs, which may help boost transparency in a market increasingly directed by less-regulated non-bank players.\nThe funding round was led by Silicon Valley venture capital firm Sutter Hill Ventures as well as Otter Capital and Tippet Venture Partners.\nReporting by Kate Duguid; Editing by Lisa Von Ahn\n ", "external_links": [], "published": "2018-01-25T16:11:00.000+02:00", "crawled": "2018-01-25T16:22:45.014+02:00", "highlightTitle": ""}