{"organizations": [], "uuid": "c64f2b3433d74fde910792923bbae7c871307880", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/13/104838403-GettyImages-494460324.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/ge-warns-2018-could-be-worse-than-expected-for-its-power-business.html", "country": "US", "domain_rank": 767, "title": "GE warns 2018 could be even worse than it expected for its embattled power business", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:58:00.000+02:00", "replies_count": 0, "uuid": "c64f2b3433d74fde910792923bbae7c871307880"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/ge-warns-2018-could-be-worse-than-expected-for-its-power-business.html", "ord_in_thread": 0, "title": "GE warns 2018 could be even worse than it expected for its embattled power business", "locations": [], "entities": {"persons": [{"name": "sebastien bozon", "sentiment": "negative"}, {"name": "john flannery", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "belfort", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "general electric", "sentiment": "negative"}, {"name": "ge", "sentiment": "negative"}, {"name": "ge power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "General Electric warned Wednesday that 2018 will be another challenging period for GE Power and could shape up to be an even worse year than expected for the embattled business unit.\nGE's power unit, which focuses on selling and servicing equipment to power plants, is one of three units the conglomerate is focusing on as it aims to streamline its business. But while executives crowed about the fourth-quarter performance of the other two core units, health care and aviation, they pointed to power as a drag on virtually every financial metric and signaled a rocky 12 months ahead.\n\"We said '17 issues would carry over into '18 in power, but it's still a good franchise in power and we're going to make the most out of that,\" GE Chief Executive John Flannery said on a conference call Wednesday.\nGE Power's bread and butter is selling gas turbines to power plants and fixing the massive equipment when it breaks down. But the market for these pricey turbines has been weak, largely due to the growth of renewable energy supply from wind and solar farms.\nIn 2018, GE is bracing for its worst year of gas turbine installations in about 15 years. The company is restructuring to prepare for orders that could be as low as 30 gigawatts. In 2017, GE anticipates final orders of gas turbines will come in at less than 35 gigawatts.\nProfit in the power segment was down 88 percent in the final quarter of 2017, driven by tough market conditions, business execution mistakes and other charges, executives said.\nGE equipment still produces about a third of the world's electric power, Flannery noted, and the company holds 50 percent market share in advanced power technology.\nFlannery said the company will focus on four things going forward: adjusting the size of GE Power's manufacturing footprint, improving cash and project execution, wringing more value out of its installed base of equipment, and improving management and processes.\nGE Power announced 12,000 layoffs in December and has scaled back 15 manufacturing sites.\nRussell Stokes, president and CEO of GE Power, says his unit has recently increased its ability to monitor outages that its equipment customers experience, increasing visibility from less than 30 percent of its installed base to nearly 80 percent. Servicing that equipment more efficiently represents a $2 billion opportunity, he said Wednesday.\nGE also plays in the renewable energy space, but the outlook there is challenging too. While GE is shipping more megawatts worth of wind turbines, it faces pressure to lower prices.\nThe company expects profits to be down \"significantly\" in the first quarter of 2018 as it ships fewer wind turbines in the United States and continues to face price pressure, Chief Financial Officer Jamie Miller said Wednesday.\nGE shares were down 1 percent Wednesday after the company disclosed an SEC review of its accounting practices .", "external_links": [], "published": "2018-01-24T17:58:00.000+02:00", "crawled": "2018-01-24T18:15:05.019+02:00", "highlightTitle": ""}