{"organizations": [], "uuid": "0a97e303b94ac033a7814b0cf816d903ad6ff738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/22/103572100-GettyImages-470162182.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/stock-market-peak-still-at-least-a-year-away-bank-of-america-survey.html", "country": "US", "domain_rank": 767, "title": "Stock market peak still at least a year away, fund managers say in Bank of America survey", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T16:34:00.000+02:00", "replies_count": 0, "uuid": "0a97e303b94ac033a7814b0cf816d903ad6ff738"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/stock-market-peak-still-at-least-a-year-away-bank-of-america-survey.html", "ord_in_thread": 0, "title": "Stock market peak still at least a year away, fund managers say in Bank of America survey", "locations": [], "entities": {"persons": [{"name": "michael hartnett", "sentiment": "none"}, {"name": "hartnett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of america", "sentiment": "negative"}, {"name": "january bank of america merrill lynch fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Professional investors are going all in on the raging bull market, reducing cash allocations to the lowest level in five years and putting the most money in stocks in two years.\nAs the market looks to continue its best ever start to a year, respondents to the January Bank of America Merrill Lynch Fund Manager Survey are showing that optimism has not dimmed , even after 2017's big 20 percent gain. Stocks were looking at another strong performance Tuesday, judging by early trading action.\nHedge fund managers say their own equity exposure — 49 percent net long — is at the highest since 2006 as the level dedicated to hedging strategies against a possible market downturn falls to its lowest since 2013.\n\"Investors continue to favor equities,\" Michael Hartnett, BofAML's chief investment strategist, said in a statement. \"By the end of Q1, we expect peak positioning to combine with peak profits and policy to create a spike in volatility.\"\nHartnett is far from alone in his forecast for a volatility spike. Most Wall Street strategists issued the same call in their 2018 outlooks , and in fact have been anticipating that the market's smooth ride higher over the past year would come to an end any day now.\nHowever, that's not been the case.\nThe CBOE Volatility Index , a popular measure of investor fear, was last above 20 — its long-term average — in early November 2016. Since then, it's been mostly all oars in the water as even retail investors seem intent on getting into the action.\nguvendemir | Getty Images In 2018 alone, exchange-traded funds have raked in more than $16.5 billion in fresh cash, according to FactSet. Coming in barely two weeks' time, that's well ahead of the $6.5 billion a month pace over the past 12 months.\nPros responding to the BofAML survey say they remain unfazed by the market surge and don't see the top coming until sometime in 2019.\nThat optimism is fueled largely by hopes for global growth , with a net 47 percent saying they expect the economy to be stronger over the next 12 months, a 16 percentage point gain from December.\nThey see far greater risks in the bond market, which they rate the top \"tail risk\" while at the same time rating bets against volatility to be the most crowded trade. In fact, the level of managers overweight stocks compared with government bonds is at its highest level since 2014.\nInvestors rate inflation or a bond crash as the biggest market danger for 2018 , replacing fears of a policy mistake by the Fed or the European Central Bank. Fears of protectionist policies, spurred by some of President Donald Trump 's rhetoric, have diminished to 63 percent of those surveyed, though that's up from the long-term average of 45 percent.\nIn sector allocations, managers say they're moving out of telecom and into tech, industrials and emerging markets. The iShares Core MSCI Emerging Markets fund has pulled in $1.3 billion in creations for 2018, the third most of any ETF.\nThe high optimism among fund managers correlates with other investor surveys .\nThe American Association of Individual Investors saw bullishness take a dip over the past week, but those expecting gains over the next six months outnumber those who think the market will fall by a 48.7 percent to 25.1 percent. The spread is even wider in the Investors Intelligence count of market newsletter authors, with the bull-bear spread at 64.4 percent to 13.5 percent, the biggest gap since April 1986.\nWATCH: Why the bull may be running out steam .\nshow chapters Long-running bull market may enter ‘overshoot’ phase this year 9 Hours Ago | 01:31", "external_links": [], "published": "2018-01-16T16:34:00.000+02:00", "crawled": "2018-01-16T16:45:19.000+02:00", "highlightTitle": ""}