{"organizations": [], "uuid": "746d2017c39d423741377c5096b23d581071e14a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 106}, "facebook": {"likes": 1089, "shares": 1089, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104863972-GettyImages-869865532-bitcoin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/if-you-own-bitcoin-heres-how-much-you-owe-in-taxes.html", "country": "US", "domain_rank": 767, "title": "If you own bitcoin, here’s how much you owe in taxes", "performance_score": 10, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:47:00.000+02:00", "replies_count": 0, "uuid": "746d2017c39d423741377c5096b23d581071e14a"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/if-you-own-bitcoin-heres-how-much-you-owe-in-taxes.html", "ord_in_thread": 0, "title": "If you own bitcoin, here’s how much you owe in taxes", "locations": [], "entities": {"persons": [{"name": "uncle sam", "sentiment": "none"}], "locations": [], "organizations": [{"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook If you own bitcoin, here’s how much you owe in taxes Whether you've used bitcoin as an investment or as a currency, you owe taxes on it. Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs If you own bitcoin, here’s how much you owe in taxes Kyle Walsh, CNBC Published 9:00 a.m. ET Jan. 25, 2018 CLOSE This Billionaire Restaurant Mogul Says He May Start Accepting Bitcoin Time Bitcoin is hardly a risk-free investment. (Photo: Getty Images) CONNECT COMMENT EMAIL MORE Whether you've used bitcoin as an investment or as a currency, you owe taxes on it. As far as Uncle Sam is concerned, bitcoin is not currency. It's property. That means whenever you buy something with bitcoin, it's two transactions, not one. What you're actually doing is selling a property (bitcoin) for a cash value and then using money from that sale to buy a product. So every single purchase you make with bitcoin has to be reported on your taxes. For many, though, bitcoin is just an investment. If you've held those bitcoins for less than a year and sell them, that cash will be taxed as income. If you've held for more than a year, it's taxed as a capital gain — which could run 20%. Adding on transaction and accounting fees could raise costs to 60%, as was the case for one early bitcoin adopter. But here's the problem: Almost no one reports this. More: Cryptocurrency markets: Bitcoin tumbles below $10,000 and is now down 25% on the year From 2013 to 2015, fewer than 900 people each year reported bitcoin transactions to the IRS. That prompted the IRS in 2014 to label cyrptocurrency as property back and to recently serve a summons to Coinbase. In it, the agency called for the records of over 14,000 users who have \"bought, sold, sent or received at least $20,000 worth of bitcoin in a given year.\" A federal court narrowed the scope of the summons but ultimately ruled in favor of the IRS. The tax status of those transactions is still unknown. Moving forward though, there may be some relief. A bipartisan bill, \"The Cryptocurrency Tax Fairness Act,\" was presented to Congress in September. It's seeking to create a tax exemption for crypto transactions under $600. Some remain hopeful for amnesty, but it looks like Uncle Sam is still poised to get a decent cut of the bitcoin action. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CLOSE It’s going to be big ... or, not. Time CONNECT COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-25T14:47:00.000+02:00", "crawled": "2018-01-25T15:07:10.049+02:00", "highlightTitle": ""}