{"organizations": [], "uuid": "2acd6da50179ddf435a075dbbcb6ed3117ca4b73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/16/104656485-RTS167PS-opec-oil.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/one-of-the-legs-propping-up-the-oil-rally-looks-wobbly-says-analyst.html", "country": "US", "domain_rank": 767, "title": "Three legs are propping up the oil rally, and one of them looks wobbly, says analyst", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T20:39:00.000+02:00", "replies_count": 0, "uuid": "2acd6da50179ddf435a075dbbcb6ed3117ca4b73"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/one-of-the-legs-propping-up-the-oil-rally-looks-wobbly-says-analyst.html", "ord_in_thread": 0, "title": "Three legs are propping up the oil rally, and one of them looks wobbly, says analyst", "locations": [], "entities": {"persons": [{"name": "mark keenan", "sentiment": "none"}, {"name": "keenan", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "societe génerale", "sentiment": "none"}, {"name": "societe generale", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices could tumble as much as $8 a barrel in the coming weeks as one of the three legs propping up an unexpected rally looks \"wobbly,\" Societe Generale's Mark Keenan warned on Friday.\nThe rally in oil prices has exceeded many analysts' expectations, leading to a flurry of revised forecasts as benchmark crude futures surged by about $10 a barrel in the last six weeks to their highest levels since early December 2014.\nBrent crude oil touched a three-year high of $71.28 on Thursday, while U.S. crude topped out at $66.66 during the same trading session.\n\"We think of the oil market right now as a three-legged stool and all three of these legs have provided a degree of uplift to prices,\" said Keenan, global commodities strategist and head of research for Asia-Pacific at Societe Génerale.\nThe first leg, the fundamentals of supply and demand, remains positive, he told CNBC Asia's \"Capital Connection.\" OPEC, Russia and other oil-producing nations continue to limit their output in order to shrink global crude stockpiles, while the simultaneous growth in economies around the world is boosting demand for energy.\nThe second, geopolitical landscape, has also been supportive. Tensions in the Middle East; crisis-stricken Venezuela's steadily falling output; and President Donald Trump 's threats to restore sanctions against Iran , OPEC's third largest producer, are some of the risks to the oil market.\nBut the third leg, investor positioning, is the one that looks wobbly to Keenan. Traders have built up \"massive\" long positions, or bets that oil prices will keep rising, while short positions — wagers that futures will fall — are \"nonexistent.\"\nHedge funds recently raised their net long positions in crude and petroleum products to records, according to Reuters. That creates the chance of a \"very dangerous\" price correction, Keenan says.\n\"There's close to a billion barrels of speculative length out there that, when it unwinds, is going to cause the price to move down,\" he said.\nSociete Generale believes Brent crude could tumble from about $70 a barrel to $62 within the first quarter of the year.\nThe most obvious catalyst is a short-term drop in demand for crude oil as refineries throttle back activity for seasonal maintenance, says Keenan. Demand for refined products, which include home heating fuel, should also ease as the United States emerges from a cold spell.\n\"That might creep into the framework in so far as the hedge funds and the speculators that are holding this position might then be suffering a little bit of an opportunity cost in their position. It's not making them any new money and they may start to get out,\" he said.\nKeenan is not the only analyst worried about the widening gap between long and short positions. Analysts earlier this month told CNBC prices look poised to fall due to the \"extreme\" positioning.\nStill, the oil market has kept rallying, drawing support this week from U.S. dollar weakness. That makes commodities sold in dollars more affordable to buyers who transact in other currencies.\nshow chapters Geopolitical tensions biggest bullish risk to oil prices: ClipperData's Matt Smith 8:43 AM ET Wed, 3 Jan 2018 | 02:52", "external_links": [], "published": "2018-01-26T20:39:00.000+02:00", "crawled": "2018-01-26T20:47:48.002+02:00", "highlightTitle": ""}