{"organizations": [], "uuid": "05496c466463437dd1ee379c2bd48cdd5e916e17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/08/13/100959495-100959495_151961327rr.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/investment-banking-boom-is-likely-in-2018-analyst-dick-bove-says.html", "country": "US", "domain_rank": 767, "title": "Investment banking boom is likely in 2018, analyst Dick Bove says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T14:31:00.000+02:00", "replies_count": 0, "uuid": "05496c466463437dd1ee379c2bd48cdd5e916e17"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/investment-banking-boom-is-likely-in-2018-analyst-dick-bove-says.html", "ord_in_thread": 0, "title": "Investment banking boom is likely in 2018, analyst Dick Bove says", "locations": [], "entities": {"persons": [{"name": "dick bove", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC's Jim Cramer has been known to argue the market is seeing a shortage of shares. Quite frankly, this is the most brilliant comment concerning the equity markets anyone has made in at least five years.\nHis outlook on this issue highlights a broad theme in the markets these days: The supply and demand for shares of stock are off-balance. This will likely have broad implications for the market and banks, particularly, this year.\nSupply Think of the nation's equity markets as one company. A company sells shares. These equity shares are in many forms, but all of the company's products are similar in that they are shares.\nIn recent years, however, the company has slowed the production of these shares. In fact, in many product areas, the number of shares has actually declined — in other words, stock buybacks.\nDemand At the same time, demand for shares has risen sharply. The nation's money supply has been growing at a 6.4 percent clip for most of the past decade, yet the economy as measured by nominal gross domestic product has been growing at slightly less than 3 percent annually in the same period.\nThus, excess funds have been building in the banking system. Bank deposits have grown by 7.3 percent per year in the past decade, according to the Federal Reserve. However, since the economy is growing relatively slowly, the banks have failed to put a large portion of their new deposits to work.\nConsider this. At the end of 2017, banks had $13.2 trillion in deposits but only $9.6 trillion in loans. In fact, because the money supply kept growing and the economy did not keep pace, deposits grew by $5 trillion from 2007 to 2017. Yet, loans only grew by $1.9 trillion. So, at present, banks now have $3.66 trillion more in deposits than in loans. This is the biggest gap ever in these figures. To think of this another way, it is 7.6 times greater than this gap was in 2007, when it was only $476 billion.\nSince the banks cannot lend all of these deposits, and because there are high capital costs to keeping them, banks are paying below-market rates for the funds. My estimate, based on numbers from the Federal Deposit Insurance Corporation, is that banks are paying between 50 and 60 basis points for funds today when the effective Federal Funds rate is 1.42 percent.\nIncreasing production More importantly, those shares being produced by the hypothetical company are up 18.4 percent, according to S&P. The differential between holding cash in the bank, or in many other places in the economy, relative to owning shares was substantial.\nThus, as Cramer has perhaps implied, the demand for shares outstripped the supply of this product.\nClassical economists would argue that when the price of a product rises sharply because demand is outstripping supply, the producer of the product will increase the supply. If we move from the hypothetical to a real-world application, the supply of shares can be increased if a number of companies make public offerings or existing firms complete secondary offerings, perhaps to repay their debt.\nInvestment banks, and the bottom line I strongly believe that 2018 will be a year when there is an explosion in new stock offerings, through either initial or secondary offerings. This will be a year when some unicorns go public. It will be a year when some companies swap their relatively high cost debt for low cost equity.\nThis will be a bonanza for investment bankers. This is because investment banking revenues will surge on the offerings, and the increase in investment banking will feed other businesses operated by those firms. Increased investment banking, furthermore, stimulates more loans, more trading, more customer activity and more asset gathering overall.\nInvestors should be aggressively buying stocks like Goldman Sachs and Morgan Stanley to capitalize, as the imbalance between demand for shares and the supply of these units is addressed by the market.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-10T14:31:00.000+02:00", "crawled": "2018-01-10T15:24:15.049+02:00", "highlightTitle": ""}