{"organizations": [], "uuid": "24a3fb84567ce3e045e069eb79a58b0d9e47ad47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/06/104882279-GettyImages-885568560-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/trump-news-trump-goes-to-davos-world-economic-forum.html", "country": "US", "domain_rank": 767, "title": "In Davos, Trump faces the powerful 'establishment' he's repeatedly shredded", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T20:21:00.000+02:00", "replies_count": 0, "uuid": "24a3fb84567ce3e045e069eb79a58b0d9e47ad47"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/trump-news-trump-goes-to-davos-world-economic-forum.html", "ord_in_thread": 0, "title": "In Davos, Trump faces the powerful 'establishment' he's repeatedly shredded", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "blankfein", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "bill clin", "sentiment": "none"}, {"name": "lloyd blankfein", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "jpmorgan chase", "sentiment": "none"}, {"name": "university of texas at austin", "sentiment": "none"}, {"name": "h.w. brands", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump is slated to jet to Switzerland on Wednesday night to push for investment in the United States — while rubbing elbows with the members of the elite global \"establishment\" he has repeatedly thrashed.\nAt the World Economic Forum in Davos, Trump will be forced to balance the anti-globalization populism that propelled him to the White House and his desire to strike business deals with government leaders and executives. No sitting president has attended the event in nearly two decades, partly to avoid the perception at home of close ties to the wealthy individuals who typically attend.\nFor Trump, at least, the chance to go to Davos and take an economic victory lap has few apparent drawbacks, according to political historians and analysts. With partisans at home well entrenched in their views of the president and leaders abroad already skeptical of him, Trump's trip to mingle with the wealthy and powerful appears to carry less risk than it has for past presidents.\n\"There are so many rules that don't apply to Trump. He's done things that are more problematic [than going to Davos] to people that don't like him this week,\" said Ian Bremmer, president of the Eurasia Group, a political risk management firm.\nTrump's plans show chapters Cohn: When the US grows, so does the world 23 Hours Ago | 01:46 Trump will fly to snow-covered Davos overnight Wednesday. A delegation of more than a dozen administration Cabinet officials and advisors, led by Treasury Secretary Steven Mnuchin , has already started to arrive at the event.\nTrump is set to hold bilateral meetings with British Prime Minister Theresa May and Israeli Prime Minister Benjamin Netanyahu, among others. He is scheduled to meet with European business leaders Thursday and give remarks Friday.\nThe president plans to promote the American business environment in the wake of massive corporate tax cuts and his administration's push to trim regulation on businesses. Despite the elite reputation of the gathering, the White House has tried to cast it as another chance for Trump to look out for working-class Americans.\nTrump wants to \"remind the world that we are open for business,\" his chief economic advisor, Gary Cohn , told reporters Tuesday.\n\"We want the world to invest in America and create jobs for hardworking Americans,\" he added.\nTrump and the 'establishment' show chapters Treasury Secretary Mnuchin: I didn’t realize Davos was ‘the global elite’ 10:37 AM ET Tue, 16 Jan 2018 | 01:58 Conferring with the political and business leaders attending the forum would appear to contrast with the core messaging of Trump's presidential campaign. Two of the prominent officials attending this year's forum — Goldman Sachs CEO Lloyd Blankfein and German Chancellor Angela Merkel — appeared in a scathing ad at the end of the Trump campaign in which he pledged to root out corruption in the global \"establishment\" to help overlooked Americans.\nBoth Blankfein and JPMorgan Chase CEO Jamie Dimon on Wednesday praised Trump's effect on the economy .\nA desire for presidents to be seen as looking out for the interests of typical Americans has generally kept them away from the forum.\n\"Since the late 1990s, globalization has left a bad taste in the mouth of a lot of people in the United States,\" said H.W. Brands, a presidential historian and professor of history at the University of Texas at Austin. \"Even presidents broadly in favor of it think it would make for bad photo ops, to get photographed in this place, in the den of globalization.\"\nBill Clinton was the first and only sitting president to go to Davos. Presidents Barack Obama , George W. Bush or George H.W. Bush never made the trip, at least partly due to its reputation as a haven for wealthy elites.\nObama, known for populist pitches of his own and criticism of Wall Street \"fat cats,\" came into office during the global financial crisis. The younger Bush also had tense relationships with some European allies over his handling of the Iraq War.\nMnuchin recently attempted to distance Trump from the perception that the forum was for globalists, saying he \"didn't realize it was the global elite\" who attended Davos.\nThe goals of the economic forum contrast with the nationalism and protectionism Trump has preached as a candidate and in the White House. The theme of this year's event is \"Creating a Shared Future in a Fractured World,\" and one of its goals is to create a \"shared narrative to improve the state of the world.\"\nThe president blamed free trade deals such as the North American Free Trade Agreement for blue-collar job losses. He questioned why the U.S. spends money on wars overseas while its infrastructure suffers and hurts citizens at home. He pulled out of the landmark Paris climate accord, arguing he was elected to represent the people of Pittsburgh, not Paris.\nAll of those arguments are core pieces of his appeal to voters who helped put him in the White House. Yet, experts believe the trip to the epicenter of globalization may not damage Trump with his base at home.\nMost opinion polls have consistently shown roughly 40 percent of Americans support Trump, while at least 50 percent oppose him. Twists and turns in the Russia election meddling investigation, the president's tweeted nuclear threats to North Korea and his widely criticized comments about violence at a white nationalist rally have done little to change voters' opinions.\n\"A lot has happened in the past year. It hasn't fundamentally altered the calculus that he has a pretty solid third of the country behind him and a pretty solid majority of the country deeply opposed to him,\" said Matt Dallek, a political historian and associate professor at George Washington University's Graduate School of Political Management.\nAdditionally, Trump has already faced, and appeared to overcome, concerns about being too close to immense wealth after running a populist campaign. He heard some criticism over his Cabinet choices: for instance, Cohn was Blankfein's right-hand man at Goldman and Mnuchin was a partner at the elite firm. Several other wealthy individuals, including Commerce Secretary Wilbur Ross and Education Secretary Betsy DeVos, serve in the president's Cabinet.\nTrump shrugged off those concerns by saying he would rather have successful people helping him make economic decisions.\nBremmer also notes that bipartisan U.S. lawmakers have often attended the World Economic Forum with little apparent blowback. GOP Sen. Bob Corker of Tennessee, for instance, was in Davos on Wednesday.\n'America First,' but 'not alone' show chapters Cohn: Again, America first, not alone 22 Hours Ago | 01:12 Ahead of Trump's arrival, multiple world leaders at the event warned against protectionism . On Wednesday, Merkel said Germans think \"that shutting ourselves off and isolating ourselves will not lead us into a good future. Protectionism is not the proper answer.\" French President Emmanuel Macron, meanwhile, said \"globalization is going through a major crisis.\"\nInto that group of leaders, Trump brings his \"America First\" message. His presence seems at odds with an event devoted to global integration, experts said.\nAs Trump prepared to leave, the White House tried to counter the perception that his views are incompatible with international cooperation. On Tuesday, Cohn contended that \"America First\" does not mean America \"alone.\"\nMnuchin echoed the sentiment Wednesday. He told reporters in Davos that \"'America first' does mean working with the rest of the world.\"\nCohn also said that Trump believes in trade as long as he deems it \"fair.\"\n\"The president will continue to promote fair economic competition and will make it clear that there cannot be free and open trade if countries are not held accountable to the rules,\" he said.\nObservers said Trump's private comments to world leaders and the tone of his remarks Friday will bear out whether he went to Davos to stir the pot or make nice.\nSaid historian Brands, \"It may be a case of, he's going to stick a finger in the eye of the globalizers right in the lion's den.\"\nWATCH: Cohn says Trump wants everyone at Davos to understand what he's accomplished show chapters Cohn: Trump wants everyone in Davos to understand what he's accomplished 19 Hours Ago | 01:29", "external_links": [], "published": "2018-01-24T20:21:00.000+02:00", "crawled": "2018-01-24T20:36:22.005+02:00", "highlightTitle": ""}