{"organizations": [], "uuid": "82fe0f080df7776da8d3f4a4ea55582b266bda33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Why Shares of Blue Apron Rival HelloFresh Are Surging Today – Fortune", "url": "http://fortune.com/2018/01/30/hellofresh-share-price-blue-apron/", "country": "US", "domain_rank": 1196, "title": "Why Shares of Blue Apron Rival HelloFresh Are Surging Today", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T11:52:00.000+02:00", "replies_count": 0, "uuid": "82fe0f080df7776da8d3f4a4ea55582b266bda33"}, "author": "Claire Zillman, reporter", "url": "http://fortune.com/2018/01/30/hellofresh-share-price-blue-apron/", "ord_in_thread": 0, "title": "Why Shares of Blue Apron Rival HelloFresh Are Surging Today", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "hellofresh", "sentiment": "negative"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "rocket internet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why Shares of Blue Apron Rival HelloFresh Are Surging Today HelloFresh is growing in the U.S., already its biggest market. Bloomberg Bloomberg via Getty Images By Reuters 4:52 AM EST \nGerman meal-kit delivery firm HelloFresh reported a pick up in revenue growth on Tuesday and said it hoped to break even by the end of the year, boosting its shares. \nHelloFresh, which listed on the Frankfurt stock exchange in November, said preliminary fourth-quarter sales rose 58-59% to 250-253 million euros ($309-$313 million) after a rise of 49% in the previous nine months. \nThe company, which competes with struggling U.S. rival Blue Apron, said sales growth had picked up in the United States, its biggest market, with sales more than doubling in constant currency terms. Its international business grew by just under a third. Full results will be published on March 21. \nHelloFresh, majority-owned by German e-commerce group Rocket Internet, also said it had reined in losses and was on track to reach group profitability by the fourth quarter of this year. \nHelloFresh shares, which have performed well since their listing, were up 6.5% by 0908 GMT. \nBy contrast, shares in Blue Apron have tumbled since its own listing in late June, particularly after Amazon.com registered a trademark for a possible rival service. \nBoth firms faces mounting competition from deep-pocketed rivals such as Amazon.com as it moves to increase food delivery services after acquiring the Whole Earth Foods grocery chain in August. U.S. supermarket chain Albertsons acquired meal-kit rival Plated in September. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T11:52:00.000+02:00", "crawled": "2018-01-30T12:00:01.013+02:00", "highlightTitle": ""}