{"organizations": [], "uuid": "7d05ff74ac2ec1cedbf16bd3294016218d14dd9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 108, "shares": 108, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104905685-GettyImages-894967696.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/palestinians-condemn-trumps-threat-to-halt-aid-payments-mixed-reaction-in-israel.html", "country": "US", "domain_rank": 767, "title": "Palestinians condemn Trump's threat to halt aid payments, saying, 'We will not be blackmailed'", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T13:12:00.000+02:00", "replies_count": 0, "uuid": "7d05ff74ac2ec1cedbf16bd3294016218d14dd9c"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/palestinians-condemn-trumps-threat-to-halt-aid-payments-mixed-reaction-in-israel.html", "ord_in_thread": 0, "title": "Palestinians condemn Trump's threat to halt aid payments, saying, 'We will not be blackmailed'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jim lo scalzo", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "hanan ashrawi", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ronald reagan building", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "palestine liberation organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Palestinians condemned as blackmail on Wednesday U.S. President Donald Trump's threat to withhold future aid payments over what he called the Palestinians' unwillingness to talk peace with Israel .\nTrump drew praise from a cabinet minister in Israeli Prime Minister Benjamin Netanyahu's right-wing government but a warning from a former Israeli peace negotiator of the dangers in cutting off financial assistance to the Palestinians.\nOn Twitter on Tuesday, Trump said that Washington gives Palestinians \"HUNDRED OF MILLIONS OF DOLLARS a year and get no appreciation or respect. They don't even want to negotiate a long overdue peace treaty with Israel ... with the Palestinians no longer willing to talk peace, why should we make any of these massive future payments to them?\"\nTrump tweet 1\nTrump tweet 2\nHanan Ashrawi, a member of the Palestine Liberation Organization's executive committee, said in response: \"We will not be blackmailed.\"\nPalestinian anger at Trump is already high over his Dec. 6 recognition of Jerusalem as Israel's capital, a declaration that also generated outrage across the Arab world and concern among Washington's Western allies.\nMajdi Fathi | NurPhoto | Getty Images Palestinians burn posters depicting U.S. President Donald Trump and a U.S. flag and Israeli flag during a protest against Trump's decision to recognize Jerusalem as the capital of Israel, in Gaza City on January 1, 2018. Commenting on Trump's tweets, Nabil Abu Rdainah, a spokesman for Palestinian President Mahmoud Abbas, said: \"Jerusalem is not for sale, neither for gold nor for silver.\"\nAbu Rdainah said the Palestinians were not opposed to returning to peace talks that collapsed in 2014 but only on the basis of establishing a state of their own along the lines that existed before Israel captured the West Bank, East Jerusalem, and the Gaza Strip in the 1967 war.\n\"If the United States is keen about peace and about its interests it must abide by that,\" he said.\nIsrael, which withdrew troops and settlers from the Gaza Strip in 2005, has called the pre-1967 war West Bank boundaries indefensible and has pledged to hold on to all of Jerusalem forever.\nUNRWA funding A report prepared for the U.S. Congress in December 2016 by the U.S. Congressional Research Service said annual U.S. economic support to the West Bank and Gaza Strip has averaged around $400 million since fiscal 2008.\nMuch of the money has gone toward U.S. Agency for International Development-administered project assistance and the rest toward budget support for the Palestinian Authority (PA), which administers limited self-rule in the Palestinian territories under interim peace agreements.\nIsraeli Culture Minister Miri Regev, a member of Netanyahu's Likud party, welcomed Trump's aid comments, saying on Army Radio: \"I am very satisfied ... (Trump) is saying the time has come to stop saying flattering words (to the Palestinians).\"\nBut Tzipi Livni, an Israeli opposition politician and a former peace negotiator, said \"a responsible and serious (Israeli) government\" should quietly tell Trump that it would be in Israel's interest to prevent a \"humanitarian crisis in Gaza\" and to continue to fund Palestinian security forces cooperating with Israel.\nEarlier on Tuesday, Trump's U.N. ambassador disclosed plans to stop funding a United Nations agency that provides humanitarian aid to Palestinian refugees.\n\"The president has basically said he doesn't want to give any additional funding, or stop funding, until the Palestinians agree to come back to the negotiation table,\" Ambassador Nikki Haley told reporters when asked about future U.S. funding for the U.N. Relief and Works Agency (UNRWA)for Palestinian refugees.\nIn an emailed statement, UNRWA spokesman Chris Gunness said: \"UNRWA has not been informed by the United States administration of any changes in U.S. funding to the Agency.\"\nThe United States is the largest donor to the agency, with a pledge of nearly $370 million as of 2016, according to UNRWA's website.\nAccording to UNRWA's website, there are 5.9 million UNRWA refugees and other registered persons eligible for its services, which include education and health care, in the West Bank, the Gaza Strip, Jordan, Lebanon, and Syria.", "external_links": [], "published": "2018-01-03T13:12:00.000+02:00", "crawled": "2018-01-03T13:21:11.002+02:00", "highlightTitle": ""}