{"organizations": [], "uuid": "8d66c84186acfe94e49f5d650e9a1065ec2ba76a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 49, "shares": 49, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/06/104692792-RTX3ETT4.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/united-technologies-will-pay-down-rockwell-collins-debt-faster-ceo.html", "country": "US", "domain_rank": 767, "title": "Under new tax policy United Technologies to pay down debt from Rockwell Collins faster, says CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T00:03:00.000+02:00", "replies_count": 0, "uuid": "8d66c84186acfe94e49f5d650e9a1065ec2ba76a"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/united-technologies-will-pay-down-rockwell-collins-debt-faster-ceo.html", "ord_in_thread": 0, "title": "Under new tax policy United Technologies to pay down debt from Rockwell Collins faster, says CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "United Technologies will be able to pay off its debt sooner than expected as funds freed up by the new tax law flow back to the U.S., United Technologies Chairman and CEO Gregory Hayes told CNBC.\nThe U.S. manufacturer of jet engines typically repatriates about $1 billion a year in funds from overseas, Hayes said Wednesday on \" Power Lunch .\" But under the new tax law, which slashed the corporate rate from 35 percent to 21 percent, the company will be able to bring closer to $3 billion home, which it will use to pay down its debt from the deal to acquire Rockwell Collins .\n\"There's a lot of trapped cash over there,\" Hayes said. \"About $8 billion.\"\nApproximately two-thirds of the company's earnings come from abroad, he said. The CEO estimated the actual profit-and-loss benefit from tax reform is $150 million to $200 million a year.\n\"The real benefit, though, comes from the flexibility of having access to that foreign cash,\" Hayes said. United Technologies will also be less reliant on borrowing money, he noted.\n\"Having access to this cash on a tax-advantage basis, it's a big deal for us,\" he said. \"We've got a lot of flexibility.\"\n\nIn September, the company announced it would purchase Rockwell Collins , an aircraft parts manufacturer, which would be one of the largest acquisitions in aerospace history, for $30 billion. Hayes said the deal is expected to close by mid-2018.\nThe company's original intent was to pay about a billion dollars of the debt this year that it had incurred from the deal, Hayes said.\n\"But now we see a path to be paying that debt down very, very quickly over the next few years,\" he said.\nUnited Technologies will still need to finance between $14 billion and $15 billion this year to complete the transaction, Hayes said. The extra funds from the tax policy will also allow the company to begin buying back some of its shares, which Hayes had initially envisioned as something that wouldn't occur for another four or five years.\nUnited Technologies is a multinational company and the 19th largest public manufacturer in the U.S. The defense contractor reported fourth-quarter profit of $1.60 per share, beating estimates by 4 cents a share. Revenue also topped consensus and United Tech said its organic sales growth in 2017 was its fastest in three years. \n\nAfter the Rockwell deal is complete, Hayes said United Tech will have a $50 billion aerospace business and $30 billion commercial business.", "external_links": [], "published": "2018-01-25T00:03:00.000+02:00", "crawled": "2018-01-25T00:15:25.008+02:00", "highlightTitle": ""}