{"organizations": [], "uuid": "50048a55502791a2aa9f0ebc01637c5f484ea5c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968255-GettyImages-910117480.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/trump-to-tell-davos-that-he-wont-tolerate-trade-abuses-or-intellectual-property-theft.html", "country": "US", "domain_rank": 767, "title": "Trump to tell Davos he won't tolerate trade abuses or intellectual property theft", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T13:40:00.000+02:00", "replies_count": 0, "uuid": "50048a55502791a2aa9f0ebc01637c5f484ea5c4"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/trump-to-tell-davos-that-he-wont-tolerate-trade-abuses-or-intellectual-property-theft.html", "ord_in_thread": 0, "title": "Trump to tell Davos he won't tolerate trade abuses or intellectual property theft", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "davos -   trump", "sentiment": "neutral"}, {"name": "jason alden", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum Trump to tell Davos he won't tolerate trade abuses or intellectual property theft U.S. President Donald Trump will give the main closing address to the World Economic Forum at Davos in Switzerland. The president plans to say his administration will not tolerate intellectual property theft and trade abuses, a senior U.S. official said. \"The United States will no longer tolerate things like the theft of intellectual property or forced technology transfers or industrial subsidies ... and dumping, trade abuses,\" the U.S. official told reporters. Published 8 Hours Ago Reuters Jason Alden | Bloomberg | Getty Images President Donald Trump gestures as he arrives on day three of the World Economic Forum (WEF) in Davos, Switzerland, on Thursday, Jan. 25, 2018. \nU.S. President Donald Trump will urge a top-level gathering of political leaders and chief executives on Friday that his administration will not tolerate intellectual property theft and trade abuses, a senior U.S. official said. \nTrump is due to give the main closing address to the World Economic Forum at the Swiss ski resort of Davos, where outright and veiled criticism of his America First agenda captured headlines ahead of the president's arrival on Thursday. \nThat agenda has included unilateral trade sanctions and threats of more action, particularly against China. \n\"The United States will no longer tolerate things like the theft of intellectual property or forced technology transfers or industrial subsidies ... and dumping, trade abuses,\" the U.S. official told reporters in Davos. \nTrump is due to give his speech at 8 a.m. ET (1300 GMT). \nThe official said Trump's stance on trade should be viewed less as a warning than an explanation his commitment to the international trading system and enforcing \"rules of the road\". \nTrump is the first sitting U.S. president to visit the annual summit since Bill Clinton in 2000. He was greeted on arrival on Thursday by hundreds of curious delegates who snapped pictures as he entered the congress center. \nHe made an immediate impression: he talked up the dollar, going against the grain of previous remarks made by his treasury secretary at Davos, and threatened to withhold aid to Palestinians unless they pursued peace with Israel. show chapters 8 Hours Ago | 21:00 \nBut a thrust of his visit has been to convince business leaders to step up investment in the United States. \n\"A lot of people are coming back to the United States. We are seeing tremendous investment and today has been a very exciting day. Very great day and great for our country. Thank you very much,\" Trump told reporters in Davos on Thursday. \nAfter meeting the prime ministers of Britain and Israel, Trump hosted a dinner with leaders of some of the world's largest firms, including Nestle, SAP and Siemens, Deloitte, and Bayer. Senior members of his cabinet were also present. \nTrump, a real estate mogul and former reality TV star, had never been invited to Davos before. He basked in the praise of several executives, who applauded his tax cuts. \nTwo European executives told Reuters they were staying away from the dinner because they did not want to shake Trump's hand. One of them consulted with his wife and children before deciding to dine elsewhere. \nThose that showed up were treated to a meal of grilled beef tenderloin with green pea puree or fried Swiss pike perch with purple carrot puree. \nTrump gave each corporate leader an opportunity to describe their businesses briefly. Many mentioned the corporate tax cuts that Trump pushed through the U.S. Congress late last year as a positive sign of growth and investment, according to a Reuters reporter who was present. \nHis speech on Friday will follow a week of warnings by European leaders on the dangers of nationalism, isolationism, and protectionism. \nWithout naming Trump, German Chancellor Angela Merkel evoked the build-up to the two world wars and openly questioned whether leaders had learned the lessons from those 20th-century conflicts. \nBefore his trip to Davos, Trump imposed 30 percent tariffs on imported solar panels, among the first unilateral trade restrictions made by the administration as part of a broader protectionist agenda. \nOn Wednesday in Davos, U.S. Treasury Secretary Steven Mnuchin made comments supportive of a weaker dollar. Markets interpreted the remarks as a shift in U.S. policy and sent the dollar sharply lower, sparking concerns from European allies about a trade war. \nEuropean Central Bank chief Mario Draghi took a swipe at Mnuchin's remarks, saying they threatened a decades-old pact between the world's leading economies not to target currencies. \nTrump later told CNBC in an interview that he supported a strong dollar and expected the currency to rise. \n\"The dollar is going to get stronger and stronger and ultimately I want to see a strong dollar,\" he said, adding that Mnuchin's comments had been misinterpreted. \nTrump's decision to come to Davos came as a surprise because he has railed against \"globalists\" and elites, while promoting an \"America First\" agenda that goes down poorly in this bastion of free trade, multilateralism, and capitalism. \nFrench President Emmanuel Macron said he had \"strongly recommended\" that Trump attend the forum during a recent phone conversation, saying he thought it was a good thing for Trump to explain his strategic goals and hear different viewpoints. \nThere is broad concern in European capitals that 2018 could be the year Trump's bark on trade turns into bite, as he considers punitive measures on steel and threatens to end the 90s-era North American Free Trade Agreement with Canada and Mexico. \nPolicymakers have been openly critical of his foreign policy but with the U.S. stock market soaring, corporate tax cuts padding companies' pockets and U.S. consumers spending again, some companies here are quietly applauding the U.S. president. \nTrump used a TV appearance from Davos to laud America's relationship with Britain and sought to smooth over a recent bilateral spat caused by his retweeting of anti-Muslim videos originally posted by a leader of a far-right group. \nSpeaking on ITV's Good Morning Britain show, he was pressed on whether he would apologize for his retweet. He said that if the group was made up of racists then he would. \n\"Here's what's fair, if you're telling me they're horrible people, horrible racist people I would certainly apologize if you would like me to do that,\" Trump said. Playing", "external_links": [], "published": "2018-01-26T13:40:00.000+02:00", "crawled": "2018-01-26T13:50:26.016+02:00", "highlightTitle": ""}