{"organizations": [], "uuid": "ee2424eb921fa7f855d43a015bf43cce41a20d61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968419-EcoSport-Titanium-exterior.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/tiny-suvs-are-selling-like-crazy-and-struggling-ford-wants-in.html", "country": "US", "domain_rank": 767, "title": "Tiny SUVS are selling like crazy and struggling Ford wants in", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T22:26:00.000+02:00", "replies_count": 0, "uuid": "ee2424eb921fa7f855d43a015bf43cce41a20d61"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/tiny-suvs-are-selling-like-crazy-and-struggling-ford-wants-in.html", "ord_in_thread": 0, "title": "Tiny SUVS are selling like crazy and struggling Ford wants in", "locations": [], "entities": {"persons": [{"name": "jim hackett", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "ford motor company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ford badly needs profits, and bets selling more SUVs will bring them — even really tiny ones.\nThe company is rolling out its EcoSport subcompact SUV to dealerships now. With the move Ford wants to claim a piece of the fastest growing segment of the profitable and popular sport-utility market.\nProfits are especially important for Ford right now, which is still very much in the middle of a turnaround, since appointing CEO Jim Hackett in early 2017. The second-largest U.S. automaker is trying to improve its financial fitness and erase a perception that it is behind both rival carmakers and tech firms on the development of new mobility technologies.\nFord shares were down nearly 5 percent on Thursday afternoon. \nSource: Ford Motor Company The Ford EcoSport The EcoSport is another step toward selling cars that will bring in more money. For one thing, subcompact SUVs are popular with buyers looking for a car that offers the ride height and flexible storage of SUVs in a nimbler package. It has been the fastest-growing segment in the U.S. since 2010, Ford said at an event with reporters on Thursday.\nSince 2014 alone, sales of subcompact SUVs have more than tripled. About 425,000 subcompact SUVS sold in in 2017, and Ford expects that number to rise above half a million in 2018. Buick's Encore, for example, is that brand's best-selling model. \nThey also command higher prices than comparable small cars. Average transaction prices for subcompact SUVs such as the EcoSport are $4,500 dollars higher than Ford would get from a subcompact car like the Fiesta, and $2,500 more than the company would get from the compact Focus, Ford said at an event with reporters on Thursday.\nThe EcoSport starts at around $20,000 but there are higher trim versions available, which allow Ford to charge more for the car at relatively little cost. Ford's sales of higher-trim SUVs, such as performance or luxury versions, make up 36 percent of all SUV sales.\nThe cars are attractive to young buyers looking for a versatile entry level car, and older buyers looking to downsize from larger SUV models. About 41 percent of subcompact SUV buyers are aged 45-64, and just over 20 percent are so-called millennials. \nThe segment also attracts increasingly important demographics, such as culturally diverse buyers, and a higher share of women than the overall car market.\nFord released earnings on Wednesday that missed Wall Street expectations , and the company is facing some impatience from investors who are looking for more details on Hackett's plan to improve the company's future. Hackett's appointment generated a great deal of interest and enthusiasm on Wall Street. But the fact that Ford still has much work ahead of it is beginning to sink in. \n\"Ultimately, while we agree with the long-term approach of Hackett, arguably, there won't be much to get excited about with the Ford story until 2019 or perhaps 2020,\" said Barclays analyst Brian Johnson in a research note on Thursday.", "external_links": [], "published": "2018-01-25T22:26:00.000+02:00", "crawled": "2018-01-25T22:38:08.008+02:00", "highlightTitle": ""}