{"organizations": [], "uuid": "74ad251e706a68b2b813af0a3a7b9d87b667075a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/14/104652292-Woman_shopping_clothing.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/why-you-should-keep-old-credit-card-accounts-open.html", "country": "US", "domain_rank": 767, "title": "Here’s why you shouldn’t close old credit cards, even if you don’t use them", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T22:49:00.000+02:00", "replies_count": 0, "uuid": "74ad251e706a68b2b813af0a3a7b9d87b667075a"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/why-you-should-keep-old-credit-card-accounts-open.html", "ord_in_thread": 0, "title": "Here’s why you shouldn’t close old credit cards, even if you don’t use them", "locations": [], "entities": {"persons": [{"name": "greg mcbride", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "bankrate.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:42 AM ET Fri, 25 Aug 2017 | 01:12 SHARES \nIf you still have the very first credit card you opened in high school or college, don't close it. Not even if it's fallen into disuse as you favor newer cards with better perks. \n\"In terms of the average length of your credit history, that card is really helping you,\" Greg McBride, chief financial analyst at Bankrate.com , tells CNBC Make It . \"It's helping your credit score.\" \nYour credit score is determined in part by longevity. While your payment history and amount owed make up the bulk of the score, about 15 percent of it is determined by the length of your credit history, taking into consideration the age of each account and how long it's been since you used each one. \n\"If your credit history is lengthy, lenders have more information to accurately assess creditworthiness,\" Credit Karma explains . \"It's also frequently an indication that you have been able to successfully manage your credit.\" show chapters 10:18 AM ET Fri, 26 May 2017 | 00:58 \nAdditionally, when you close an account, you're also shrinking your available credit, which can harm your credit utilization ratio . \"Now all of the sudden, it looks like you're using more of the available credit that you have remaining,\" McBride says. \nTime is an asset you can never get back, so experts recommend thinking long and hard before closing out your oldest accounts. However, that guideline comes with a few stipulations. \nIf you're choosing to keep an underutilized account open, follow these steps: First, ask yourself if the card is going to tempt you to run up your expenses. If it is, toss it. Boosting your score by a few points is never worth going into debt. Next, make sure the card isn't charging you an annual fee. If it is, contact the issuer. \"See if they can downgrade you to a no-annual-fee card in the portfolio, so it keeps the credit relationship open,\" McBride says. \"You're maintaining the line of credit and maintaining the credit relationship.\" Finally, use it. Even if you can't swipe it much or often, keep the card active. \"If you have to make a token purchase every year or so just to keep that open, do that,\" McBride says.", "external_links": [], "published": "2018-01-19T22:49:00.000+02:00", "crawled": "2018-01-19T23:10:39.019+02:00", "highlightTitle": ""}