{"organizations": [], "uuid": "f12b10c0f54fc9d0f8d77ad72063ca21ee017c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&q=telemedicine&cf=all&output=rss", "section_title": "telemedicine - Google News", "url": "http://fortune.com/2018/01/12/brainstorm-health-daily-01-12-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Serena Williams Childbirth, Telemedicine and Weight Loss, Trump Checkup - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T19:37:00.000+02:00", "replies_count": 0, "uuid": "f12b10c0f54fc9d0f8d77ad72063ca21ee017c64"}, "author": "", "url": "http://fortune.com/2018/01/12/brainstorm-health-daily-01-12-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Serena Williams Childbirth, Telemedicine and Weight Loss, Trump Checkup - Fortune", "locations": [], "entities": {"persons": [{"name": "serena williams", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "serena", "sentiment": "none"}], "locations": [{"name": "vogue", "sentiment": "none"}], "organizations": [{"name": "trump checkup", "sentiment": "negative"}, {"name": "serena williams childbirth", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 \nGood morning and happy Friday, readers! This is Sy. \nTennis legend Serena Williams is widely regarded as one of the greatest athletes on the planet, and perhaps ever. She recently achieved another stunning milestone—saving her own life after giving birth, according to a fascinating profile in Vogue . And Williams’ harrowing experience serves as a high-profile microcosm of the racial inequities which still haunt the American medical system. \nVogue outlines how Williams, who suffers from blood clots and must take anti-clotting medication because of it, knew that something had gone terribly wrong just a day after giving birth to her child: \nThe next day, while recovering in the hospital, Serena suddenly felt short of breath. Because of her history of blood clots, and because she was off her daily anticoagulant regimen due to the recent surgery, she immediately assumed she was having another pulmonary embolism. (Serena lives in fear of blood clots.) She walked out of the hospital room so her mother wouldn’t worry and told the nearest nurse, between gasps, that she needed a CT scan with contrast and IV heparin (a blood thinner) right away. The nurse thought her pain medicine might be making her confused. But Serena insisted, and soon enough a doctor was performing an ultrasound of her legs. “I was like, a Doppler? I told you, I need a CT scan and a heparin drip,” she remembers telling the team. The ultrasound revealed nothing, so they sent her for the CT, and sure enough, several small blood clots had settled in her lungs. Minutes later she was on the drip. “I was like, listen to Dr. Williams!” \nSuch a scrape with death makes for a sensational story when it features an icon; but it’s also the story of millions of women of color across the nation, as ProPublica explores in a searing investigative series on the effect socioeconomics has on motherhood in America . \nOne piece in that series, titled “How Hospitals Are Failing Black Mothers,” carries special poignance given Williams’ ordeal. “It’s been long-established that black women… fare worse in pregnancy and childbirth, dying at a rate more than triple that of white mothers. And while part of the disparity can be attributed to factors like poverty and inadequate access to health care, there is growing evidence that points to the quality of care at hospitals where a disproportionate number of black women deliver, which are often in neighborhoods disadvantaged by segregation,” writes Annie Waldman. \nIndeed, the public data highlights that when it comes to death and disease , from cancer to blood disorders to postpartum complications, the American medical system has a stubborn and long-standing racial gap. \nRead on for the day’s news, and enjoy your weekend. We’ll be back on Tuesday following the Martin Luther King Jr. holiday. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nTelemedicine may actually help you lose weight. A new study suggests telemedicine can help people keep track with their weight loss goals, according to MobiHealthNews. “Our findings suggest that health coaching using a telemedicine-based weight loss program may be effective at reducing clinically significant body weight (more than 5 percent) in obese adults,” wrote the study authors. “The current weight loss program combines three key elements shown to improve weight loss outcomes: a low-calorie diet with a preference for low glycemic carbohydrates, physical activity monitoring, and support for behavior change through a multi-disciplinary approach to treatment.” ( MobiHealthNews ) INDICATIONS \nAstraZeneca scores an expansion for its “PARP” cancer drug. British drug giant AstraZeneca has won Food and Drug Administration (FDA) approval for its cancer drug Lynparza to treat certain types of metastatic breast cancer . It’s a particularly significant label expansion for the drug because it’s part of a new class of treatments called “PARP inhibitors”—and, until now, these kinds of drugs had only been approved for ovarian cancers, suggesting there’s a far bigger market for the treatment type. THE BIG PICTURE \nA presidential checkup. President Donald Trump will be getting a physical exam today, his first medical checkup since assuming the presidency. That’s fairly par for the course, but there’s bound to be some added drama to this presidential physical given the renewed chatter about Trump’s mental fitness (a conversation that some mental health experts have called essential while others have slammed it as unethical and counterproductive to democracy). Back in 2016, I explored the issue at more length, including the “Goldwater rule” adopted by psychiatrists. ( NPR ) REQUIRED READING", "external_links": [], "published": "2018-01-12T19:37:00.000+02:00", "crawled": "2018-01-14T06:07:10.017+02:00", "highlightTitle": ""}