{"organizations": [], "uuid": "0843cda472f50f90ecc5a2c1aa3af6c930f6c252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "President Trump’s Trade Policies are Raising Concerns Among Republicans, Senator Says – Fortune", "url": "http://fortune.com/2018/01/23/donald-trump-trade-gop-solar/", "country": "US", "domain_rank": 1196, "title": "President Trump’s Trade Policies are Raising Concerns Among Republicans, Senator Says", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T04:32:00.000+02:00", "replies_count": 0, "uuid": "0843cda472f50f90ecc5a2c1aa3af6c930f6c252"}, "author": "HelenRegan", "url": "http://fortune.com/2018/01/23/donald-trump-trade-gop-solar/", "ord_in_thread": 0, "title": "President Trump’s Trade Policies are Raising Concerns Among Republicans, Senator Says", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "pat roberts", "sentiment": "none"}, {"name": "roberts", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "senate agriculture committee", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trade President Trump's Trade Policies are Raising Concerns Among Republicans, Senator Says President Donald Trump holds up a Section 201 action after signing it in the Oval Office, at the White House, Jan. 23, 2018, in Washington, DC. Mike Theiler—Pool/Getty Images By Bloomberg 9:32 PM EST \nThe top Republican on the Senate Agriculture Committee said every GOP senator is concerned about the direction President Donald Trump is taking on trade, from slapping tariffs on solar panels to his threats to withdraw from the North American Free Trade Agreement. \n“I do not know of a senator in the Republican conference who has not voiced concern about our trade policy,” Senator Pat Roberts of Kansas said in an interview Tuesday in his Senate office. \nRoberts said the president is in-sync with Republicans on taxes and other issues, but he has “had a more populist view” when it comes to trade that gives many in the GOP pause. \nThat view was on display during the presidential campaign when Trump railed against globalization and what he described as unfair trade deals negotiated by previous administrations. On Monday, the president slapped duties of as much as 30 percent on solar equipment made outside the U.S. and as much as 50% on washing machine imports. At the same time, the sixth round of Nafta negotiations among the U.S., Mexico and Canada are taking place in Montreal this week with Trump showing no sign of softening his stance. \n“Nafta’s moving along pretty well,” Trump said Tuesday at the White House. “I happen to be of the opinion that if it doesn’t work out we’ll terminate it.” Undoing Gains \nRolling back trade deals, Roberts added, would undo some of the economic gains expected from the $1.5 trillion tax reduction Congress passed last month. \n“This effort by the president is meant to help the Rust Belt, which is OK,” Roberts, said. But goods assembled in the U.S. with parts from a trading partner can create jobs in both countries, aiding American interests, he said. “Trade is a national security tool.” \nTrade was a topic at the weekly Republican lunch in the Senate on Tuesday. \n“Based on the discussion we had at lunch today I have the same level of discomfort that Senator Roberts has,” Republican Senator Mike Rounds of South Dakota said. \nRepublican Senator Chuck Grassley of Iowa said that while he supports the president’s attempts to get “a better deal” in trade agreements, there is the potential for backlash. \n“You’ve got to be very cautious about what you do because if you take action against a particular country and it could be these issues or other issues, there’s always a chance for retaliation,” Grassley told reporters at the Capitol. “For a person like me from a rural state, a lot of times that retaliation is in regard to agriculture. And that’s very scary” \nAgriculture, one of the few sectors of the American economy with a trade surplus, has been more supportive of Nafta than other areas, such as manufacturing. \nDeputy White House press secretary Lindsay Walters said the administration has “open lines of communication with partners in Congress on how we can maximize benefits to workers in their states, districts, and the entire country.” \nWhite House economic adviser Gary Cohn earlier Tuesday defended Trump’s decision to impose the tariffs, saying that Trump took into account the potential impact on consumers but it was a matter of making sure the U.S. is not operating at a disadvantage on trade. \n“We are very open to free, fair reciprocal trade,” Cohn said at a White House briefing. “It is hard to argue against that, that we should treat each other equally, that’s our trade policy.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T04:32:00.000+02:00", "crawled": "2018-01-24T04:33:09.008+02:00", "highlightTitle": ""}