{"organizations": [], "uuid": "8bce2c6b35f507efaac629a421864da801940080", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104905468-GettyImages-885568300.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/trump-to-tell-davos-when-the-united-states-grows-so-does-the-world.html", "country": "US", "domain_rank": 767, "title": "Trump tells Davos: We can't have free trade if some countries 'exploit' others", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T15:05:00.000+02:00", "replies_count": 0, "uuid": "8bce2c6b35f507efaac629a421864da801940080"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/trump-to-tell-davos-when-the-united-states-grows-so-does-the-world.html", "ord_in_thread": 0, "title": "Trump tells Davos: We can't have free trade if some countries 'exploit' others", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "denis balibouse", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump tried to toe the line between anti-trade populism and globalism Friday as he wooed global political and business leaders to funnel more money into the American economy.\nAt the World Economic Forum in Davos, Switzerland, Trump warned countries against trying to \"exploit\" other nations through trade, and he reiterated that he would look out for \"America first.\" However, he aimed to reassure the global leaders that \"America first does not mean America alone,\" and said a strong American economy would lift other countries.\nThe president cast the United States as a hospitable business environment — boosted in part by the massive corporate tax cut enacted by Republicans and his administration's attempts to slash regulations on businesses. The globe is \"witnessing the resurgence of a strong and prosperous America,\" he said.\n\"Now is the perfect time to bring your business, your jobs and your investments to the United States,\" Trump told the political and business leaders.\nDenis Balibouse | Reuters President Donald Trump is seen before his speech during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 26, 2018. Trump's decision to come to Davos in the first place raised eyebrows. A sitting American president has not attended the annual event since Bill Clinton in 2000. They did so largely to avoid the perception of rubbing elbows with the world's wealthiest wealthy and most powerful individuals.\nThroughout the week, Trump and the more than a dozen administration officials who accompanied him to Switzerland cast Trump's trip as one devoted to creating more jobs for Americans. He held bilateral meetings with multiple world leaders, and during a dinner Thursday night he encouraged global business executives to invest in the U.S.\nWEF participants were watching Trump's remarks closely. The president has repeatedly bashed multilateral trade agreements and pledged more isolationism than his predecessors, putting him out of place at an event largely devoted to global cooperation.\nWorld leaders including German Chancellor Angela Merkel and French President Emmanuel Macron warned against isolation earlier in the week. Merkel, without mentioning Trump by name, said that \"protectionism is not the proper answer.\"\nTrump issued warnings about trade at some points during his speech. \"The United States will no longer turn a blind eye to unfair trade practices,\" he said.\n\"We cannot have free and open trade if some countries exploit the system at the expense of others.\"\nHowever, he contended that even his \"America first\" brand of populism can help people around the globe. When the U.S. economy grows, \"so does the world,\" Trump said.\nHe said that countries worrying about their citizens first helps them take care of the needs of the \"forgotten.\"\nTrump raised eyebrows on Thursday, when he told CNBC that he would rethink the massive Trans-Pacific Partnership trade agreement if the U.S. got a \"substantially better deal.\" Trump pulled out of the deal last year, bashing it as a job-killer for U.S. workers.\nIt is likely too late for Trump to reconsider joining the deal, which was championed by his predecessor President Barack Obama. This week, the last of the 11 countries that were in the tentative TPP deal agreed to move on without the United States .\nFollowing Trump's remarks, Treasury Secretary Steven Mnuchin told CNBC that Trump prefers bilateral trade deals. But he said he'd \"consider\" a multilateral agreement if it is the best arrangement for the U.S.", "external_links": [], "published": "2018-01-26T15:05:00.000+02:00", "crawled": "2018-01-26T15:28:35.011+02:00", "highlightTitle": ""}