{"organizations": [], "uuid": "735492ceb3a0671759272c70600dfbbbd777d1ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104951507-Bitcoin_Continues_red.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/one-person-caused-bitcoin-to-spike-from-150-to-1000-in-2013.html", "country": "US", "domain_rank": 767, "title": "Researchers find that one person caused bitcoin to spike from $150 to $1,000 in 2013", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T16:41:00.000+02:00", "replies_count": 0, "uuid": "735492ceb3a0671759272c70600dfbbbd777d1ae"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/one-person-caused-bitcoin-to-spike-from-150-to-1000-in-2013.html", "ord_in_thread": 0, "title": "Researchers find that one person caused bitcoin to spike from $150 to $1,000 in 2013", "locations": [], "entities": {"persons": [{"name": "neil gandal", "sentiment": "none"}, {"name": "tali oberman", "sentiment": "none"}, {"name": "john biggs", "sentiment": "none"}, {"name": "jt hamrick", "sentiment": "none"}, {"name": "tyler moore", "sentiment": "none"}], "locations": [], "organizations": [{"name": "berglas school of economics", "sentiment": "none"}, {"name": "tel aviv university", "sentiment": "none"}, {"name": "journal of monetary economics", "sentiment": "none"}, {"name": "tandy school of computer science", "sentiment": "none"}, {"name": "university of tulsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nIn 2013, bitcoin was worth just $150 when suddenly, the price spiked. \nWithin two months, one bitcoin was worth $1,000. Four researchers from the Tandy School of Computer Science at The University of Tulsa and the Berglas School of Economics at Tel Aviv University now believe that this spike was caused by one individual person. \nIn a paper titled \" Price Manipulation in the Bitcoin Ecosystem ,\" published in the Journal of Monetary Economics , Neil Gandal, JT Hamrick, Tyler Moore and Tali Oberman describe the ways in which suspicious activity on the Mt. Gox bitcoin currency exchange impacted the value of the cryptocurrency in 2013. \nAs reported by TechCrunch , their research calls attention to the potential risk of price manipulation and fraud withing cryptocurrencies. \"If bitcoin wants to be taken seriously it probably shouldn't be this easy or legal to manipulate the markets,\" writes John Biggs for the publication. \nUnlike traditional currencies, bitcoin does not have a central authority. Instead, cryptography is used to oversee transactions, manage supply and prevent fraud. Gandal et al. analyzed data that had been anonymously dumped in 2014 after allegations that 650,000 bitcoins had been fraudulently taken. show chapters 5:57 PM ET Fri, 1 Dec 2017 | 00:57 \nThey found that a majority of the price manipulation happened due to two bots with \"??\" listed as the name of the user country. They named these bots \"Markus\" and \"Willy.\" \nMarkus bought and sold bitcoin at seemingly random prices and did not pay transaction fees. Upon further review, they found reason to believe that Markus was not actually paying for the bitcoins he was receiving. Markus acquired a total of 335,898 bitcoins and was active from February 14th, 2013 until September 27th, 2013. \nSeven hours after Markus became inactive, Willy appeared as a group of 49 accounts. Each of these Willy accounts would sequentially purchase $2.5 million worth of bitcoin and then become inactive. Over this period, the price of bitcoin spiked. \nOn days in which this suspicious activity occurred, the USD-BTC exchange rate rose by $20 on average. On the days in which no suspicious activity occurred, the exchange rate saw a slight decline. \nBy analyzing the identification numbers associated with Willy's account the researchers were able to confirm their suspicion that a single actor was responsible for both bots that, over the course of 2013, had acquired approximately 600,000 bitcoins. show chapters 4:14 PM ET Thu, 14 Dec 2017 | 01:10 \n\"We conclude that the suspicious trading activity caused the unprecedented spike in the USD-BTC exchange rate in late 2013, when the rate jumped from around $150 to more than $1,000 in two months,\" they write. \n\"As mainstream finance invests in cryptocurrency assets and as countries take steps toward legalizing bitcoin as a payment system (as Japan did in April 2017), it is important to understand how susceptible cryptocurrency markets are to manipulation.\" \nThe potential for manipulation is one reason that Grant Sabatier, founder of Millenial Money , says that people should not invest in the cryptocurrency — even though it made him a millionaire. \n\"Even though I'm a bitcoin millionaire, I don't recommend that you invest in it today,\" he writes for CNBC Make It . \nOne reason Sabatier is hesitant to suggest others invest is because volatility in the market makes it difficult to accurately estimate bitcoin's value. \n\"Because so many new people are buying it (and so quickly!), it's impossible to accurately value,\" he says. \"When the price of anything fluctuates 20 to 30 percent in one day, it's obviously unstable, so you could lose all of your money very quickly.\" \n\"Most people aren't buying into the value of the technology, they're buying into the hype,\" he argues. \"This is gambling, not investing.\"", "external_links": [], "published": "2018-01-23T16:41:00.000+02:00", "crawled": "2018-01-23T16:53:15.001+02:00", "highlightTitle": ""}