{"organizations": [], "uuid": "51baa1770c7099dc4b1d409fe1d225a840ff5077", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939641-GettyImages-889092374.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/chinas-cyber-watchdog-scolds-ant-financial-over-user-privacy-breach.html", "country": "US", "domain_rank": 767, "title": "One of China's hottest companies was just scolded by Beijing for a privacy breach", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T04:30:00.000+02:00", "replies_count": 0, "uuid": "51baa1770c7099dc4b1d409fe1d225a840ff5077"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/chinas-cyber-watchdog-scolds-ant-financial-over-user-privacy-breach.html", "ord_in_thread": 0, "title": "One of China's hottest companies was just scolded by Beijing for a privacy breach", "locations": [], "entities": {"persons": [], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "mins ago reuters", "sentiment": "none"}, {"name": "cyberspace administration of china", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "moneygram international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China's cyber watchdog scolds Ant Financial over user privacy breach China's cyber watchdog has scolded Alibaba payment affiliate Ant Financial for compromising user privacy That followed after many users of Ant Financial's Alipay service were automatically enrolled in its credit scoring system Published 7 Hours Ago Reuters SHARES \nChina's cyber watchdog has scolded Ant Financial, Alibaba's payment affiliate, for compromising user privacy after many users of its Alipay service were automatically enrolled in its credit scoring system. \nThe Cyberspace Administration of China (CAC) said in a statement it had summoned Ant Financial representatives to a meeting last Saturday and told them they had failed to meet the country's personal information security standards. \nThe rap over the knuckles adds to a tough start to the year for Ant Financial which was recently blocked by U.S. regulators from acquiring MoneyGram International. \nIt is also grappling with new regulations, requiring mobile payment firms to sharply increase the amount of client funds in interest-free reserve accounts, which will likely reduce profits. \nAlipay has a popular end-of-year feature that allows its customers to analyse how they have spent their money over the year. At the end of 2017, the feature began enrolling users who wanted to look at their bills into the credit scoring system, Sesame Credit. \nThat allowed Sesame Credit to collect their data and share the analysis with its partners. Users could only opt out if they unchecked a button on the feature's landing page. \nSesame Credit apologized last week and cancelled the default option. \nCAC said the company should \"step up efforts to conduct a comprehensive investigation of the Alipay platform, carry out special rectifications and take effective measures to prevent similar incidents from recurring.\" \nIt quoted Alipay and Sesame Credit as saying that they had learned a \"profound lesson\" from the incident. \nAnt Financial did not immediately respond to a Reuters request for comment. Related Securities", "external_links": [], "published": "2018-01-11T04:30:00.000+02:00", "crawled": "2018-01-11T04:43:39.002+02:00", "highlightTitle": ""}