{"organizations": [], "uuid": "5ea58550ac4dc2da024d3082c50b689a0a2e1c5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 4}, "vk": {"shares": 0}, "linkedin": {"shares": 59}, "facebook": {"likes": 1358, "shares": 1358, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226134993&w=1200&r=LYNXMPEE0R0Y2", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-trump-5g/trump-national-security-team-sees-building-5g-network-as-option-idUSKBN1FH103", "country": "US", "domain_rank": 408, "title": "Trump national security team sees building 5G network as option", "performance_score": 10, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T01:54:00.000+02:00", "replies_count": 0, "uuid": "5ea58550ac4dc2da024d3082c50b689a0a2e1c5e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-5g/trump-national-security-team-sees-building-5g-network-as-option-idUSKBN1FH103", "ord_in_thread": 0, "title": "Trump national security team sees building 5G network as option", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "peter cooney", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "axios.com", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 11:55 PM / in 2 hours Trump security team sees building U.S. 5G network as option Steve Holland , Pete Schroeder 5 Min Read \nWASHINGTON (Reuters) - President Donald Trump’s national security team is looking at options to counter the threat of China spying on U.S. phone calls that include the government building a super-fast 5G wireless network, a senior administration official said on Sunday. \nThe official, confirming the gist of a report from Axios.com, said the option was being debated at a low level in the administration and was six to eight months away from being considered by the president himself. \nThe 5G network concept is aimed at addressing what officials see as China’s threat to U.S. cyber security and economic security. \nThe Trump administration has taken a harder line on policies initiated by predecessor Barack Obama on issues ranging from Beijing’s role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries. \nThis month AT&T was forced to scrap a plan to offer its customers handsets built by China’s Huawei after some members of Congress lobbied against the idea with federal regulators, sources told Reuters. \nIn 2012, Huawei and ZTE Corp were the subject of a U.S. investigation into whether their equipment provided an opportunity for foreign espionage and threatened critical U.S. infrastructure. \nSome members of the House intelligence committee remain troubled by security threats posed by Huawei and ZTE, according to a congressional aide. \nIssues raised in a 2012 committee report about the Chinese firms have “never subsided,” the aide said, adding that there was newer classified intelligence that recently resurfaced those concerns. \n“We want to build a network so the Chinese can’t listen to your calls,” the senior official told Reuters. \n“We have to have a secure network that doesn’t allow bad actors to get in. We also have to ensure the Chinese don’t take over the market and put every non-5G network out of business.” \nIn Beijing on Monday, Chinese foreign ministry spokeswoman Hua Chunying said China prohibited all forms of hacking, but did not specifically address the 5G network security issue. \n“We believe that the international community should, on the basis of mutual respect and trust, strengthen dialogue and cooperation and join hands in addressing the threat of cyber attacks,” Hua told a regular news briefing. \nMajor wireless carriers have spent billions of dollars buying spectrum to launch 5G networks, and it is unclear if the U.S. government would have enough spectrum to build its own 5G network. \nFurthermore, Accenture has estimated that wireless operators will invest as much as $275 billion in the United States over seven years as they build out 5G. \nLast year, T-Mobile US Inc spent $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction. \nAn AT&T spokesman said they could not comment on something they have not seen, and added, “Thanks to multi-billion dollar investments made by American companies, the work to launch 5G service in the United States is already well down the road.” \nLater this year, AT&T is set to be the first to launch mobile 5G service in 12 U.S. locations, the spokesman said. \nA Verizon spokesman declined to comment. Representatives for Sprint and T-Mobile did not immediately respond to requests for comment. \nAnother option includes having a 5G network built by a consortium of wireless carriers, the U.S. official said. Related Coverage U.S. telco shares fall on 5G network reports despite skepticism \n“We want to build a secure 5G network and we have to work with industry to figure out the best way to do it,” the official said, speaking on condition of anonymity. \nAxios published documents it said were from a presentation from a National Security Council official. If the government built the network, it would rent access to carriers, Axios said. \nA looming concern laid out in the presentation was China’s growing presence in the manufacture and operation of wireless networks. A concerted government push could help the U.S. compete on that front, according to the presentation. \nA 5G network is expected to offer significantly faster speeds, more capacity and shorter response times, which could be utilized for new technologies ranging from self-driving cars to remote surgeries. Telecom companies and their suppliers consider it to be a multibillion-dollar revenue opportunity. Reporting by Steve Holland and Pete Schroeder; Additional reporting by Duston Volz, Suzanne Barlyn and David Shepardson, and Michael Martina in Beijing; Editing by Chris Sanders, Peter Cooney and Clarence Fernandez", "external_links": [], "published": "2018-01-29T01:54:00.000+02:00", "crawled": "2018-01-29T02:00:38.015+02:00", "highlightTitle": ""}