{"organizations": [], "uuid": "78631ff23e2dec1ced7389ebe2e3e81b4636a134", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-gn-store-nord-strategy/denmarks-gn-takes-aim-at-apple-with-wireless-earbuds-idUSKBN1EX01E", "country": "US", "domain_rank": 408, "title": "Denmark's GN takes aim at Apple with wireless earbuds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T03:17:00.000+02:00", "replies_count": 0, "uuid": "78631ff23e2dec1ced7389ebe2e3e81b4636a134"}, "author": "", "url": "https://www.reuters.com/article/us-gn-store-nord-strategy/denmarks-gn-takes-aim-at-apple-with-wireless-earbuds-idUSKBN1EX01E", "ord_in_thread": 0, "title": "Denmark's GN takes aim at Apple with wireless earbuds", "locations": [], "entities": {"persons": [{"name": "julie", "sentiment": "negative"}, {"name": "astrid thomsen", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}], "locations": [{"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "gn", "sentiment": "negative"}, {"name": "integrating amazon", "sentiment": "none"}, {"name": "gn store nord", "sentiment": "none"}, {"name": "min read  copenhagen", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:19 AM / Updated 13 hours ago Denmark's GN takes aim at Apple with wireless earbuds Julie Astrid Thomsen 3 Min Read \nCOPENHAGEN (Reuters) - Denmark’s GN Store Nord is aiming to win a bigger slice of the rapidly growing market for wireless earbuds by introducing a new product challenging Apple’s popular Airpods. \nWireless is expected to account for an increasing share of the $9.6 billion global earphone and headphone market and that means intense competition between tech companies keen to cash in on the trend. \nIntegrating Amazon’s voice control system Alexa and halving the price are among the steps taken by GN to attract new customers with its latest product. \n“We’re expanding our brand to deliver products aiming for a broader segment dominated by Apple,” René Svendsen-Tune, chief executive of GN’s audio division, told Reuters. \nGN is better known as a hearing aid maker but draws on a Danish tradition of innovation stretching back to 1869 when it started life as a telegraph company. \nIn fact, its hearing aid division has benefited from working closely with Apple for years by using bluetooth-like technology that, installed in the ear, allows users to stream voice and music from their iPhones. \nIt will continue that cooperation while competing with the tech giant on the wireless earphone market, Svendsen-Tune said. \nGN launched its first wireless earphones in November 2016. The following month Apple launched its Airpods after dispensing with the plug-in for jack cables in its iPhone 7. \nGN’s original earphones, tailored for athletes with features to track progress and measure heart rate, sold for $370, twice as much as Apple’s equivalent. \n“Apple has helped develop this market with great speed but now we’re launching a new generation,” Svendsen-Tune said, speaking ahead of the launch of the product at the Consumer Electronics Show in Las Vegas. \nIn the first half of 2017 around 900,000 wireless headphone units were sold in the U.S. alone, and since the launch in 2016, Apple has accounted for 85 percent of the sales, according to data from the NPD Group. \nGN said it was in second place but had only a single figure market share. But the market is still evolving and competition is fierce. \n“If we can maintain a second place in 2018, I believe we will have done very well,” Svendsen-Tune said. \nGN’s audio division accounts for 40 percent of the company’s revenue, while the hearing aid division contributes 60 percent. \n($1 = 6.1815 Danish crowns)", "external_links": [], "published": "2018-01-08T03:17:00.000+02:00", "crawled": "2018-01-08T03:30:07.015+02:00", "highlightTitle": ""}