{"organizations": [], "uuid": "d8d1c5e6166f4f45815e20e60111fa02f871fb2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225296182&w=1200&r=LYNXMPEE0O1QI", "site_section": "http://dede-indra.blogspot.com/feeds/posts/default", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-brazil-lula-passport/brazil-court-approves-seizure-of-lulas-passport-source-idUSKBN1FE37D", "country": "US", "domain_rank": 408, "title": "Brazil court approves seizure of Lula's passport: source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T00:48:00.000+02:00", "replies_count": 0, "uuid": "d8d1c5e6166f4f45815e20e60111fa02f871fb2e"}, "author": "", "url": "https://www.reuters.com/article/us-brazil-lula-passport/brazil-court-approves-seizure-of-lulas-passport-source-idUSKBN1FE37D", "ord_in_thread": 0, "title": "Brazil court approves seizure of Lula's passport: source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA (Reuters) - A Brazilian court on Thursday approved the seizure of former President Luiz Inacio Lula da Silva’s passport, the Justice Ministry said, after an appeals court upheld the corruption conviction of the left-wing hero.\nThe decision came on the eve of a planned trip by Lula to Africa. It also came a day after appellate court judges voted to uphold Lula’s convictions on taking a bribe and money laundering and extended his sentence, in a major blow to the popular politician’s plans to run again for the presidency this year. [nL2N1PJ0GU]\nLula’s lawyer Cristiano Zanin said the former president’s passport would be handed in on Friday, but called the decision “shocking” and an unnecessary restriction on his freedom of movement. In a statement, he said that the appellate court had been informed of Lula’s trip to Africa and his plans to return to Brazil on Jan 29.\nFormer Brazilian President Luiz Inacio Lula da Silva reacts as he arrives at the metallurgical trade union while the Brazilian court decides on his appeal against a corruption conviction that could bar him from running in the 2018 presidential race, in Sao Bernardo do Campo, Brazil January 24, 2018. REUTERS/Leonardo Benassatto “He won’t travel now,” Lula spokesman Jose Chrispiniano said, adding that the former leader had planned to attend an African Union conference in Ethiopia.\nJustice Minister Torquoato Jardim, who was informed of the decision by the federal police chief, recommended that Lula be informed of the decision to avoid any problems, the ministry said.\nLula could be arrested as soon as judges make a decision on a final appeal in his case, which is expected to occur in at most two to three months.\nReporting by Ricardo Brito; Additional reporting by Anthony Boadle; Writing by Alexandra Alper; Editing by Leslie Adler and Diane Craft\n ", "external_links": [], "published": "2018-01-26T00:48:00.000+02:00", "crawled": "2018-01-26T00:59:47.009+02:00", "highlightTitle": ""}