{"organizations": [], "uuid": "298e26b5dc3577ef599e8440357a0af471f62076", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925961-Commencement_Address_At_Stanford_University.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/colleges-arent-looking-for-well-rounded-students.html", "country": "US", "domain_rank": 767, "title": "Former Stanford admissions officer: Colleges aren't looking for well-rounded students", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T17:58:00.000+02:00", "replies_count": 0, "uuid": "298e26b5dc3577ef599e8440357a0af471f62076"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/colleges-arent-looking-for-well-rounded-students.html", "ord_in_thread": 0, "title": "Former Stanford admissions officer: Colleges aren't looking for well-rounded students", "locations": [], "entities": {"persons": [{"name": "grace kim", "sentiment": "negative"}, {"name": "kim", "sentiment": "none"}], "locations": [], "organizations": [{"name": "stanford", "sentiment": "negative"}, {"name": "stanford university", "sentiment": "negative"}, {"name": "harvard", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "princeton", "sentiment": "none"}, {"name": "harvard university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Graduating Stanford University students SHARES \nGrace Kim knows what the best colleges are looking for in an application. She herself received a full ride to attend Princeton, earned her Masters at Harvard University and later worked as an admissions officer for Stanford University. Today, she is a College Consultant for LogicPrep, an education company. \nIn all of her experience , she says that being well-rounded is one of the most overrated things that a student can be. \n\"Every university is looking for a dynamic incoming class,\" she tells CNBC Make It . \"We are not necessarily looking for all well-rounded students.\" Grace Kim at her Princeton Graduation \nAccording to Kim, colleges are less interested in finding students who are perfect in every way than they are in finding students who are incredible at what they love to do. \n\"Not every student who is admitted to Stanford or Harvard or Northwestern or any of these schools needs to be good at everything,\" she argues. \"In fact, it's sometimes even more fun when you meet a student who is very angular. A student who, you know, leans very much in one direction.\" \nIf a student can demonstrate that they are extremely talented in a specific area, then a college is more likely to forgive their flaws explains Kim. \"Perhaps if a student is a star in mathematics but not necessarily the strongest writer, we'll give them the benefit of the doubt in that way,\" she says. Courtesy of Logic Prep Grace Kim \nThis preference for specific strengths rather than general excellence is rooted in an interest in building a class of students with varied perspectives and passions . \"They are looking for a well-rounded class even if not each individual student is well-rounded,\" says Kim. \n\"You can think of it like a dinner party. You want to invite people to the party who you know are going to add value to the conversation, people who are going to bring their perspectives and experiences and enrich the dining experience for the people around them,\" she says. \"People who are going to ask interesting questions and really are curious to get to know about the experiences and stories of the people around that dinner table.\" \n\"If you want to get invited to that party, the host has to think that you will be contributing something meaningful,\" she says. And let's be honest — no one wants to go to a dinner party with 2,000 versions of the same generally perfect person. ", "external_links": [], "published": "2018-01-10T17:58:00.000+02:00", "crawled": "2018-01-10T18:15:52.006+02:00", "highlightTitle": ""}