{"organizations": [], "uuid": "085e761c9ff31a7f044b28fc5d335ec7b72aff81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952669-GettyImages-905976974.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/fundstrats-tom-lee-is-even-more-bullish-after-crash.html", "country": "US", "domain_rank": 767, "title": "Tom Lee, bitcoin's earliest and most bullish forecaster on Wall Street, is even more positive after crash", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T16:35:00.000+02:00", "replies_count": 0, "uuid": "085e761c9ff31a7f044b28fc5d335ec7b72aff81"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/fundstrats-tom-lee-is-even-more-bullish-after-crash.html", "ord_in_thread": 0, "title": "Tom Lee, bitcoin's earliest and most bullish forecaster on Wall Street, is even more positive after crash", "locations": [], "entities": {"persons": [{"name": "tom lee", "sentiment": "negative"}, {"name": "jack guez", "sentiment": "negative"}, {"name": "fundstrat", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The first major Wall Street strategist to cover bitcoin predicts the digital currency will more than double in 2018 to $25,000 in the wake of its crash this year that saw it lose 50 percent of its value from a December record.\nFundstrat's Tom Lee is out with his latest report on bitcoin, which moves up a $25,000 price target by four years, from 2022 to the end of this year. Lee's model for valuing bitcoin now predicts it will reach $125,000 by 2022. \n\"We expect bitcoin's major low to be $9,000, and we would be aggressive buyers around that level,\" Lee said in a Thursday report. \"We view this $9,000 as the biggest buying opportunity in 2018.\" \nshow chapters Tom Lee: Bitcoin is still 'king of the hill’ of cryptocurrencies, could more than double in 2018      5:58 PM ET Tue, 9 Jan 2018 | 04:49 Bitcoin dropped more than 30 percent between Monday and Wednesday to below the psychologically key $10,000 level. Its high in December on the Coinbase exchange was above $19,800. Most major cryptocurrencies sold off sharply following reports that raised concerns about stricter regulation on digital currencies in South Korea and China. Prices steadied Thursday, and bitcoin had recovered to $11,785 on Coinbase in morning trading New York time.\nLee's framework for valuing bitcoin takes into account money supply growth, the ratio of alternative currencies such as gold to that money supply and bitcoin's share of those alternatives. The strategist also expects increased interest from institutional investors, and user account growth and usage to spur bitcoin's gains. \nIn July, the former J.P. Morgan Chase chief equity strategist became the first widely followed Wall Street market strategist to issue a report focused on predicting bitcoin's price. Lee co-founded Fundstrat Global Advisors in 2014 and is the firm's head of research.\nHe has stayed mostly bullish on bitcoin in its volatile climb higher. He called bitcoin's one-day plunge on Dec. 22 to $10,400 a buying opportunity, and raised his mid-2018 bitcoin price target to $20,000 from $11,500 that afternoon. \nOn Thursday, Lee also issued price targets for three other digital currencies. He expects ethereum will reach $1,900 by the end of this year, up 90 percent from Thursday's $1,000 levels.\nLee predicts ethereum classic will also soar about 90 percent to reach $60, and Chinese-developed digital currency NEO will rise about 50 percent from Thursday's levels to hit $225 by the end of this year.\nFrom a technical perspective, the Fundstrat report says around $10,000 is an important area of support for bitcoin's price and should mark the lower end of the trading range for 2018. The next areas of support are around $7,500, followed by $5,500, both levels seen in November.\nHowever stunning the figures on these crypto predictions may be, their percentage gains pale in comparison with 2017's massive returns. Bitcoin gained 2,000 percent in the 12 months leading up to its December peak above $19,800 on Coinbase. Ethereum leaped roughly 9,600 percent to above $770, according to CoinMarketCap. And ripple, or XRP, blew both away by soaring well over 35,500 percent to $2.30 at the end of 2017. \nLee adds in his Thursday report that tactical rotations into other cryptocurrencies in 2018 will likely be opportunities for investors to outperform bitcoin's gains.\nWATCH: Bitcoin could be the biggest bubble in history – here's how show chapters Bitcoin could be the biggest bubble in history – here's how      7:26 AM ET Wed, 17 Jan 2018 | 02:00 Disclaimer", "external_links": [], "published": "2018-01-18T16:35:00.000+02:00", "crawled": "2018-01-18T16:40:19.021+02:00", "highlightTitle": ""}