{"organizations": [], "uuid": "fcda00bd1d5dc7f9b876c41133a7005cde1a7797", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104846367-GettyImages-492663408.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/stocks-making-the-biggest-moves-premarket-blk-jpm-hum-antm-dks-axp-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: BLK, JPM, HUM, ANTM, DKS, AXP & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T14:39:00.000+02:00", "replies_count": 0, "uuid": "fcda00bd1d5dc7f9b876c41133a7005cde1a7797"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/stocks-making-the-biggest-moves-premarket-blk-jpm-hum-antm-dks-axp-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: BLK, JPM, HUM, ANTM, DKS, AXP & more", "locations": [], "entities": {"persons": [{"name": "jefferies", "sentiment": "none"}, {"name": "dick", "sentiment": "none"}], "locations": [{"name": "jefferies", "sentiment": "none"}], "organizations": [{"name": "blackrock", "sentiment": "negative"}, {"name": "jp morgan chase", "sentiment": "none"}, {"name": "american express", "sentiment": "none"}, {"name": "humana", "sentiment": "none"}, {"name": "medicare advantage", "sentiment": "none"}, {"name": "anthem", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nBlackrock – The asset management firm reported adjusted quarterly profit of $6.24 per share, beating estimates of $6.02 a share. Revenue beat forecasts and the company also raised its quarterly dividend 15 percent to $2.88 per share.\nJP Morgan Chase – The bank beat estimates by 7 cents a share, with adjusted quarterly profit of $1.76 per share. Revenue also beat forecasts. JPMorgan did take a one-time $2.4 billion charge related to the new tax law.\nHumana – The health-care provider was upgraded to \"buy\" from \"hold\" at Jefferies, based on benefits of tax reform as well as current Medicare Advantage enrollment trends.\nAnthem – Jefferies also upgraded the health insurer's stock to \"buy\" from \"hold,\" expressing confidence in the execution of Anthem's plans by its new CEO.\nDick's Sporting Goods – The sporting goods retailer was upgraded to \"buy\" from \"hold\" at Deutsche Bank, which cites bottoming industry trends, more balanced inventory levels, and reduced risk to margins.\nAmerican Express – JP Morgan Chase downgraded the financial services giant's stock to \"neutral\" from \"overweight,\" based on valuation. American Express stock is up 31 percent over the past 12 months.\nIBM – IBM has replaced Chief Financial Officer Martin Schroeter with Senior Vice President James Kavanaugh. Schroeter is moving to a new role as senior vice president for global markets.\nAdvanced Micro Devices – AMD said its chips are susceptible to the security flaw known as \"Spectre,\" which can let hackers steal sensitive information. AMD had said earlier that the risk was \"near zero\" but maintains there has been no change in its view.\nFiat Chrysler – The automaker will invest more than $1 billion in its Warren, Michigan plant, and will shift production of its Ram pickup trucks from Mexico to that plant in 2020. The move will create 2,500 jobs at the factory.\nFord Motor – Ford is urging 2,900 owners of certain older pickup trucks to stop driving them, after confirming a second death in a truck containing a defective Takata airbag inflator. The defective part is contained in certain 2006 Ford Rangers.\nSinclair Broadcast Group — The Federal Communications Commission has paused its review of Sinclair's purchase of Tribune Media while it examines Sinclair's offer to divest certain assets.\nQualcomm – The chipmaker is close to winning European Union approval for its proposed $39 billion acquisition of NXP Semiconductors , according to The Wall Street Journal.\nFinisar — Chief Executive Jerry Rawls has retired, effective immediately. He'll be replaced at the helm of the fiber optic components maker by Broadcom executive Michael Hurlston.\nKohl's – The retailer was upgraded to \"sector perform\" from \"underperform\" at RBC Capital, which cites several factors including improved comparable store sales.", "external_links": [], "published": "2018-01-12T14:39:00.000+02:00", "crawled": "2018-01-12T14:54:03.007+02:00", "highlightTitle": ""}