{"organizations": [], "uuid": "a005efb3b7e36c7da8c0d31671fdc9e70515c420", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/07/101651533-108006924.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/this-tax-move-trump-used-could-get-wealthy-investors-in-hot-water-with-the-irs.html", "country": "US", "domain_rank": 767, "title": "This tax move Trump used could get wealthy investors in hot water with the IRS", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:45:00.000+02:00", "replies_count": 0, "uuid": "a005efb3b7e36c7da8c0d31671fdc9e70515c420"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/this-tax-move-trump-used-could-get-wealthy-investors-in-hot-water-with-the-irs.html", "ord_in_thread": 0, "title": "This tax move Trump used could get wealthy investors in hot water with the IRS", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jeffrey coolidge", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "irs", "sentiment": "negative"}, {"name": "photodisc", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A generous deduction that has enabled wealthy investors to save millions was left untouched by Washington lawmakers in the recently enacted tax overhaul.\nBut that doesn't mean you won't run afoul of the Internal Revenue Service if you use it.\nThey're known as conservation easements. Basically, these are legal agreements that permanently limit the use of designated land for preservation purposes. The owner continues to control the property, while a limited-time tax deduction is generated based on the value of the land had it been developed. Generally, the limits on the land continue, even it is passed on to heirs or sold .\nHigh-profile deals involving notable figures including President Donald Trump have brought attention to these types of structures.\nTrump, for example, created a preservation easement on his Mar-a-Lago estate in 1993. The property was reportedly appraised at $25 million at that time. An easement that prevented him from selling antiques inside the historic building or adding more buildings to the compound reduced the valuation to $19.25 million. Trump was able to take a tax deduction for the difference — $5.75 million — once the easement was established.\nThe president has reportedly generated more than $100 million in write offs through easement deals, including a $39 million deduction on his Bedminster, New Jersey, golf course.\nDavidoff Studios | Getty Images View towards the pool and spa of the Mar-a-Lago estate, Palm Beach, Florida, February 13, 2017. Investors looking to cash in on this type of deal have turned to syndicated conservation easements, whereby multiple investors participate. They have become a popular way to pursue this tax deduction. These private placements, as they are known, are often opaque transactions, open only to certain high net-worth investors.\nThe IRS, however, has warned that it is looking at these arrangements, particularly where deductions \"significantly exceed the amount invested.\"\nIn December 2016, the agency put out a notice that characterized syndicated conservation easements as \"listed transactions,\" defining them as potential tax avoidance strategies. While avoiding taxes is not as severe as tax evasion in the eyes of the IRS, it can still draw penalties and fines.\nThe labeling of listed status on a transaction by the IRS , however, does not happen frequently, according to the agency. A listed transaction requires additional disclosures to be filed with the IRS. And while the agency does have other disclosure requirements, listing is considered the most serious.\nLast July, then-IRS Commissioner John A. Koskinen wrote to one Senate Finance Committee member that an initial analysis of the disclosures the agency had received showed an average deduction of nine times the initial investment. By that measure, an investor who put in $500,000, for example, would be claiming a $4.5 million deduction.\nTotal deductions nationwide for conservation easements reached $3.2 billion in 2014, up from $1.1 billion in 2013 and $971 million in 2012, according to a 2017 Brookings Institution report .\nDespite the scrutiny, some financial advisors maintain there are quality deals they are finding for their clients. Critics of the transactions say the conservation benefits are limited.\nInvestment opportunity A syndicated conservation easement transaction can be used to offset up to 50 percent of an investor's adjusted gross income in a tax year. The IRS does allow you to carry over contributions that exceed your adjusted gross income. For a qualified conservation transaction, the time limit on those carry-overs is 15 years.\nThe potential tax benefits of these deals has led some financial advisors to pursue these investments on behalf of clients. Certain characteristics need to be in place when sourcing these private transactions — such as top-notch legal and accounting teams.\n\"This, in my opinion, is too sophisticated for a lay person to go into\" without the help of a financial advisor, said Matt Chancey, an investment advisor in Orlando, Florida.\nGetty Images A man practices on the putting green in Bedminster Township, New Jersey. Certified financial planner Larry Breen, founder of Breen Financial Management in Lake Mary, Florida, said there are several requirements that should be in place for it to be worthwhile.\nFirst, while most deals stipulate that participants be accredited investors, who by regulators' definition earn at least $200,000 per year, or $300,000 if they are married, the ideal participant will earn more than $500,000, according to Breen. They also must have clean tax records, he said, because these kinds of deals can draw IRS scrutiny. The offerings are often structured through LLCs, further masking the true owners.\nInvestors also need savvy tax advisors. Both the investor and their advisors need to understand and be comfortable with the tax, legal and property appraisers involved in the deal, Breen said.\nPeople who put their money in these deals also need to know that the syndicated conservation easement will be most likely be audited by the IRS, and they also could be audited individually.\nThe best deals, according to Breen, will include a memorandum that discloses all of the risks involved in the \"private placement,\" a type of non-public sale of securities available to a limited number of investors.\n\"The thing should read like a Stephen King horror novel,\" he said.\nFrom there, the investor has to decide which motivates them more: the risks or rewards tied to the investment.\nThe appraisal of the land is also a crucial part of the deal. Investors want to make sure they have a top-caliber appraiser who applies best practices, according to Breen.\n\"That's the first thing that the IRS is going to challenge,\" he said.\nshow chapters How to avoid a tax audit 5:52 AM ET Mon, 4 April 2016 | 02:26 The conservation benefits should also be a strong driver for making the investment, according to Breen.\n\"There's a lot of people who do care about the future of the planet and want to make sure habitat is set aside so that we stay a biologically diverse planet,\" Breen said.\nBesides the tax break, investors can also benefit from any revenue that comes from the property, Chancey said.\nFor example, a 100-acre property could be divided so that 90 acres is conserved, while 10 acres is devoted to a golf course, Chancey said. Or the whole property could be conserved, while revenue could be generated from licensing or using the property, such as for hunting and fishing.\nBut the revenue component is ancillary, Chancey said.\n\"No one who gets into an easement is expecting to generate revenue from it,\" Chancey said. \"Some of the deals just happen to have a revenue component.\"\n\"There's a lot of people who do care about the future of the planet and want to make sure habitat is set aside so that we stay a biologically diverse planet.\" -Larry Breen, Breen Financial Management The Partnership for Conservation, an advocacy group, argues that current tax incentives have resulted in a dramatic increase in the number of acres conserved.\n\"Land conservation is both a necessary goal and an expensive proposition that cannot fall solely on federal, state and local governments,\" a spokesman for the organization said.\nDeal critics Opponents say the cost to the U.S.", "external_links": [], "published": "2018-01-12T15:45:00.000+02:00", "crawled": "2018-01-12T15:59:57.030+02:00", "highlightTitle": ""}