{"organizations": [], "uuid": "376c30b79ccdace0caed35cf43696865a3ebdc35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-1-sp-cuts-brazil-debt-rating-as-pension-reform-doubts-grow.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-S&P cuts Brazil debt rating as pension reform doubts grow", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T02:20:00.000+02:00", "replies_count": 0, "uuid": "376c30b79ccdace0caed35cf43696865a3ebdc35"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-1-sp-cuts-brazil-debt-rating-as-pension-reform-doubts-grow.html", "ord_in_thread": 0, "title": "UPDATE 1-S&P cuts Brazil debt rating as pension reform doubts grow", "locations": [], "entities": {"persons": [{"name": "lisandra paraguas", "sentiment": "negative"}, {"name": "michel temer", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "brasilia", "sentiment": "none"}], "organizations": [{"name": "standard & poor", "sentiment": "none"}, {"name": "finance ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UPDATE 1-S&P cuts Brazil debt rating as pension reform doubts grow Jake Spring and Lisandra Paraguassu Published 5 Hours Ago SHARES \n(Adds finance ministry comment, administration source quote, context) \nBRASILIA, Jan 11 (Reuters) - Ratings agency Standard & Poor's cut Brazil's credit rating further below investment grade on Thursday as doubts grew about a presidential election in October and a push to trim its costly pension system, seen as vital to closing a huge fiscal deficit. \nS&P lowered its long-term rating for Brazil sovereign debt to BB- from BB previously, with a stable outlook, citing less timely and effective policymaking. S&P also cited a risk of greater policy uncertainty after this year's elections. \nThe decision underscored concerns that a business-friendly reform agenda proposed by the unpopular President Michel Temer may stall this year as a looming presidential race shortens the legislative calendar. \nThe Finance Ministry said in a statement that it would continue to push for an overhaul of Brazil's social security and tax policies, adding that S&P's decision underscored the urgency of those fiscal reforms. \nFinance Minister Henrique Meirelles had met with ratings agencies to try and stave off a downgrade after the government delayed until February a vote on pension reform that had been expected last year. \n\"I think it's a warning of the economic and social consequences of not approving pension reform,\" said Wellington Moreira Franco, secretary-general for President Michel Temer. \nThe move by S&P brings its long-term sovereign rating for Brazil three notches below investment grade. Brazil is rated Ba2 by Moody's Investors Service and BB by Fitch Ratings, both two notches into \"junk\" territory. \nBrazil lost its investment grade rating in 2015 as the country headed into its deepest recession in decades and the government of then-President Dilma Rousseff failed to tame a budget deficit that exploded when a commodities boom faded. \nThe S&P downgrade \"is a negative development but it was expected, particularly after pension reform was delayed. It's not breaking news for markets,\" said Goldman Sachs economist Alberto Ramos in by telephone. \nBrazilian index fund iShares MSCI Brazil ETF slipped 0.3 percent in after-market trading in New York after gaining 1.9 percent during the session. \n\"Regarding the economic effect, we will need to observe the market in the coming days. But this will aid the reform effort,\" a member of Temer's economic team said on condition of anonymity. \nA spokesman for Brazil's central bank declined to comment. \nThe downgrade highlights the stakes heading into this year's wide-open presidential election, with key fiscal measures hanging in the balance and voters seething after years of corruption scandals that tarred major political parties. \nMany in Brazil regarded S&P's decision to award Brazil an investment-grade rating in 2008, then the 14th government to receive the distinction, as validation of the country's growing leadership among emerging markets. \nSince taking office last year, Temer has vowed to regain Brazil's investment grade by cutting red tape, halting growth of public debt and privatizing state firms. \nYet Temer has struggled to close the deficit and was forced to shelve much of his reform agenda last year as he fought corruption charges that sank his approval rating into single digits. (Reporting by Jake Spring and Lisandra Paraguassu; Additional reporting   Paulo, Marcela Ayres in Brasilia and Kanika Sikka in Bengaluru; Editing by Brad Haynes, Sandra Maler and Richard Chang)", "external_links": [], "published": "2018-01-12T02:20:00.000+02:00", "crawled": "2018-01-12T08:15:30.012+02:00", "highlightTitle": ""}