{"organizations": [], "uuid": "cf8d5e19d68d11eddb25ebb52da753ae9b597868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/06/104513551-wb-influential.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/warren-buffett-is-delaying-retirement-heres-how-you-can-too.html", "country": "US", "domain_rank": 767, "title": "Here's how you can put off retirement like Warren Buffett", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:30:00.000+02:00", "replies_count": 0, "uuid": "cf8d5e19d68d11eddb25ebb52da753ae9b597868"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/warren-buffett-is-delaying-retirement-heres-how-you-can-too.html", "ord_in_thread": 0, "title": "Here's how you can put off retirement like Warren Buffett", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "carolyn mcclanahan", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "gallup", "sentiment": "none"}, {"name": "berkshire hathaway inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to work into your 80s like Warren Buffett, you have some planning to do.\nThe 87-year-old Berkshire Hathaway CEO announced two new board appointments last week to nudge the conglomerate toward a succession.\nAt the same time, Buffett acknowledged that he has no imminent plans to retire. Another 10 years at the company might be too much, he said on CNBC, \"but every time I see one of my doctors, I just say, 'Guarantee me five more years.'\"\nLike Buffett, more aging individuals are aspiring to keep working in their golden years. Recent research from Gallup found that 63 percent of working adults plan to work part time beyond age 65, while 11 percent plan to continue working full time. That contrasts with current retirees, of whom 68 percent retired before age 65.\n\"You have to save because you never know when you're going to lose that ability to work.\" -Carolyn McClanahan, Life Planning Partners But planning to continue working indefinitely comes with financial risks.\n\"Many of us are going to be forced into retirement,\" said Scott Hanson, co-founder and senior partner at Hanson McClain Advisors in Sacramento, California. \"Retirement readiness is crucial, regardless of what your plans are.\"\nHere's what you need to consider if you don't want to stop working.\nDon't neglect savings Financial advisor Carolyn McClanahan, director of financial planning at Life Planning Partners in Jacksonville, Florida, said the clients who say they don't want to retire often don't want to rein in their spending.\n\"You have to save because you never know when you're going to lose that ability to work,\" said McClanahan, who is also a physician.\nIf you're planning to work until, say 75, you also need to prepare for the fact that disability insurance typically runs out by age 67, McClanahan said. Because of that, you will need to set aside funds in case you become physically unable to work.\nDavid A. Grogan | CNBC Warren Buffett, Chairman and CEO of Berkshire Hathaway. Adjust your retirement income Individuals who are age 70½ or older generally must take required minimum distributions from their retirement accounts, which will increase your taxable income.\nIf you're still an active participant in your company's 401(k) plan, you do not have to take RMDs from those funds.\nAs such, you may want to consider rolling your individual retirement accounts into your 401(k). That move, which can be done even after age 70½, will prevent you from having to take RMDs on that money, said financial advisor Daniel Lash, a partner at VLP Financial Advisors in Vienna, Virginia.\nWhile tax law permits such a move, not all company 401(k) plans do, cautions IRA expert Ed Slott, founder of Ed Slott & Co. You should check first to make sure your plan allows it. Only pretax IRAs, not Roth IRAs, can be rolled into the plan, Slott noted.\nYou also want to keep in mind that the longest you should delay taking your Social Security benefits is until age 70. \"It wouldn't make sense to defer it and not take the money\" after age 70, Lash said.\nBut because your Social Security benefits are based on your top 35 years of earnings, it is possible that higher income in later years can help boost your benefits, he said.\nPay attention to your health Working longer can mean lower costs on the health-care side, according to McClanahan, as many individuals are able to take advantage of company health plans.\nAt the same time, those who work beyond retirement age will likely face higher Medicare Part B premiums, which are based on your income, Hanson said.\n\"Many of us are going to be forced into retirement. Retirement readiness is crucial, regardless of what your plans are.\" -Scott Hanson, Hanson McClain Advisors You also need to mind your physical health.\nCreate an agreement with the people with whom you work, McClanahan suggested, so they know to raise any issues and ask you to get outside testing if concerns do crop up.\nMake sure your love for your job does not prevent you from taking care of yourself. Eat right, exercise and diversify your activities, McClanahan said.\nBe strategic with your time In the '90s, the trend was to retire earlier and earlier, Hanson recalled, but now that thinking has changed.\n\"There's a lot of people who don't necessarily want to quit working,\" he said. \"They just want control over their time.\"\nshow chapters E. Slott & Company: Know what's in your 401(k) 23 Hours Ago | 03:08 Think of how you can apply the skills you have learned in a new, fresh way , Hanson said. Chances are, you may be able to create a schedule that works for you, with the proliferation of digital job and communication tools and the ability to work from anywhere.\n\"If we can get it to a point where people have some control over their time, what I've found is people aren't in such a rush to retire,\" Hanson said.\nPrepare for the unexpected Be ready to adjust your plans as your goals or work prospects change.\nJohn M. Scherer, a financial planner at Trinity Financial Planning in Middleton, Wisconsin, said he has clients who tell him they plan to work until they are 80.\n\"What if you can't or that changes?\" Scherer said. \"That's great until it doesn't work anymore.\"\nMore from Personal Finance:\nInvesting in Berkshire Hathaway could look different once Warren Buffett steps down\n'Wild west' days are over for cryptocurrencies, as IRS steps up tax enforcement\nThe market may still be rosy, but advisors say investors shouldn't get complacent", "external_links": [], "published": "2018-01-18T15:30:00.000+02:00", "crawled": "2018-01-18T15:56:50.017+02:00", "highlightTitle": ""}