{"organizations": [], "uuid": "df0d61414c7154506b476dcc38c8303d9aeee898", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950279-GettyImages-106403627.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/koreas-to-form-unified-ice-hockey-team-march-together-in-winter-olympics.html", "country": "US", "domain_rank": 767, "title": "Koreas to form unified ice hockey team, march together in Winter Olympics", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T15:25:00.000+02:00", "replies_count": 0, "uuid": "df0d61414c7154506b476dcc38c8303d9aeee898"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/koreas-to-form-unified-ice-hockey-team-march-together-in-winter-olympics.html", "ord_in_thread": 0, "title": "Koreas to form unified ice hockey team, march together in Winter Olympics", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The two Koreas will field a combined women's ice hockey team and march together under one flag at next month's Winter Olympics in the South, Seoul said on Wednesday, after a new round of talks amid a thaw in cross-border ties.\nNorth and South Korea have been talking since last week - for the first time in more than two years - about the Olympics, offering a respite from a months-long standoff over Pyongyang's pursuit of nuclear and missile programmes, although Japan urged caution over the North's \"charm offensive\".\nHandout: South Korean Ministry of Unification Officials from South Korea and North Korea meet to discuss the North's participation in the 2018 Winter Olympics. The two Koreas will compete as a unified team in the Olympics for the first time, though they have joined forces at other international sports events before.\nNorth Korea will send a delegation of more than 400, including 230 cheerleaders, 140 artists and 30 Taekwondo players for a demonstration, a joint press statement released by Seoul's unification ministry said, adding the precise number of athletes will be hammered out after discussions with the IOC.\nPrior to the Games, the sides will carry out joint training for skiers at the North's Masik Pass resort and a cultural event at the Mount Kumgang resort, for which Seoul officials plan to visit the sites next week.\nThe delegation is expected to begin arriving in South Korea on Jan. 25, the statement said.\nThe North will separately send a 150-strong delegation to the Paralympics. Twenty nations meeting in the Canadian city of Vancouver agreed on Tuesday to consider tougher sanctions to press North Korea to give up its nuclear weapons and U.S. Secretary of State Rex Tillerson warned the North it could trigger a military response if it did not choose dialogue.\nJapanese Foreign Minister Taro Kono said the world should not be naive about North Korea's \"charm offensive\" over the Olympics.\n\"It is not the time to ease pressure, or to reward North Korea,\" Kono said. \"The fact that North Korea is engaging in dialogue could be interpreted as proof that the sanctions are working.\"\nThe Kim dynasty: North Korea's secretive rulers Getty Images | JIJI Press | AFP North Korean leader Kim Jong Un has refused to give up development of nuclear missiles capable of hitting the United States in spite of increasingly severe U.N. sanctions, raising fears of a new war on the Korean peninsula. The North has fired test-fired missiles over Japan.\nIn state media this week, the North warned the South of spoiling inter-Korean ties by insisting it gives up its nuclear weapons.\n\"We will work actively to improve North-South Korean relations but will not stand still to actions that are against unification,\" the North's Rodong Sinmun newspaper said.\nThe South's Unification Ministry said the two sides exchanged opinions on several issues, including the size of the North Korean athletics team and joint cultural events.\nIcy reception Seoul has proposed a joint ice hockey team, which triggered an angry response from athletes in the South suddenly being told they may have to play alongside total strangers.\n\"I don't know if it will happen, but a joint team will be a good opportunity for ice hockey to shed its sorrow as a less-preferred sport as many Koreans will take interest,\" South Korean President Moon Jae-in told players during a visit to a training centre.\nThe number of petitions to the presidential Blue House's website opposing a unified team climbed to more than 100 this week, with the most popular petition gaining more than 11,000 votes.\n\"This isn't the same as gluing a broken plate together,\" said one of the signers.\nPaik Hak-soon, the director of the Centre for North Korean studies at Sejong Institute in South Korea, said North Korea was using the cheering squad to draw attention to its apparent cooperative spirit.\n\"Seeing good results in competitions thanks to the cheering squad would enable the North Koreans to say they contributed to a successful Olympics and the South Korean government would likely agree,\" said Paik.\n\"In the end, they are using this old tactic to get to Washington through Seoul.\"\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nOn Tuesday, officials from North and South agreed a 140-person North Korean orchestra would perform in South Korea during the Games. Pyongyang is also planning to send a large delegation in addition to the athletes and orchestra.\nReclusive North Korea and the rich, democratic South are technically still at war because their 1950-53 conflict ended in a truce, not a peace treaty. The North regularly threatens to destroy the South, Japan and their major ally, the United States.\nChina, which did not attend the Vancouver meeting, said on Wednesday the gathering showed a Cold War mentality and would only undermine a settlement of the North Korea problem.", "external_links": [], "published": "2018-01-17T15:25:00.000+02:00", "crawled": "2018-01-17T15:51:07.026+02:00", "highlightTitle": ""}