{"organizations": [], "uuid": "49e4e1f664139c4b9912433e79904ce0f19d0d28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "The Future Is Here: Byton’s New Electric Car Could Replace Your Smartphone – Fortune", "url": "http://fortune.com/2018/01/07/ces-byton-electric-suv-smart/", "country": "US", "domain_rank": 1196, "title": "The Future Is Here: Byton’s New Electric Car Could Replace Your Smartphone", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T05:40:00.000+02:00", "replies_count": 0, "uuid": "49e4e1f664139c4b9912433e79904ce0f19d0d28"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/07/ces-byton-electric-suv-smart/", "ord_in_thread": 0, "title": "The Future Is Here: Byton’s New Electric Car Could Replace Your Smartphone", "locations": [], "entities": {"persons": [{"name": "byton", "sentiment": "negative"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "bmw", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CES 2018 The Future Is Here: Byton's New Electric Car Could Replace Your Smartphone Byton, a Chinese-based electric vehicle company, unveiled its concept SUV on the opening media day at CES 2018. Photo by Kirsten Korosec By Kirsten Korosec 10:40 PM EST \nByton, a new China-based company founded by automotive veterans of BMW (bmwyy) and Infiniti, unveiled Sunday an all-electric SUV loaded with technology that aims to supersize the experience and functionality of a smartphone. \nIf the founders pull this off, drivers and passengers will no longer reach for their smartphone or other smart devices while on the road. Instead, the vehicle will take care of all of their needs with a simply hand gesture or voice command. \nThe all-electric SUV was unveiled on the first media day at CES 2018, the annual tech trade show in Las Vegas. \nThe base version of the car, which starts at about $45,000, will have a 71-kilowatt-hour battery pack that can travel 250 miles on a single charge. Byton says this base model will be able to charge its battery 80% in 30 minutes. A more expensive version, figures the company didn’t provide, will be four-wheel drive and be able to travel 325 miles on a single charge. \nInitially, the vehicles will be sold in China. But by first half of 2020, the SUV will be available in North America. Sales in Europe will follow later that year. \nThe new company, formerly Future Mobility Corporation, was founded by Carsten Breitfeld, the former head of the BMW i8 program, and Daniel Kirchert, the former managing director of Infiniti China and a longtime BMW executive. Not a lot was known about the company until recently. Last month, Byton showed some teaser images and basic information at a North American media introduction event in Santa Clara, California. \nBreitfeld and Kirchert are calling the medium-ish SUV crossover an SIV, or “smart intuitive vehicle.” And there’s good reason. The vehicle, which compared to virtually every other CES concept reveal I’ve been to in recent years, looks decidedly normal. Kirchert told Fortune before the unveiling that what they’re showing is 80% complete. \nAnd it’s loaded with technology, from a sweeping display that takes up the entire dashboard and another touchscreen on the steering wheel, to “smart” connected features that will let future customers use hand gestures and voice commands via Amazon’s Alexa assistant to control aspects of the car. The vehicle will even monitor the driver’s heart rate, weight, oxygen saturation, or blood pressure. \n“We think the “SIV” will be a new category (in automotive), Kirchert told Fortune . “The car is really becoming more of a smart device, allowing the driver and passengers to have their own digital experience, and a seamless kind of experience that doesn’t require you to use your smartphone or other smart devices.” \n“We also think this is very important to get the car and the design of the car ready for the future of autonomous and shared mobility,” Kirchert added. \nThe SUV will come with Level 3 autonomous capabilities. This designation, determined by SAE International, is what’s described as conditional automation. This means that the car can handle most aspects of driving in the right conditions with the expectation that the human driver will respond when asked to intervene. \nLevel 4, which Byton is promising in the future, means the car takes over all of the driving in certain conditions. \nOne of the more interesting concepts is what the company calls Byton Life, a “smart and open digital cloud platform that seamlessly connects all your applications, data and devices.” Byton Life is what the company describes as the technical backbone. It will allow the driver and passengers to integrate third-party services like music and video streaming, and other ecosystems, like syncing to their fitness trackers or wearables. \nIt’s also meant to get smarter and more intuitive about the driver’s needs and wants over time. Information collected is connected to the user’s personal Byton ID and stored in the company’s cloud. When the driver enters the car, facial recognition technology identifies the person and their personal profile. Their preferences and content is downloaded from the cloud. \nByton Life is an open platform, and the company is offering a software development kit, or SDK, for developers to build services for Byton. Courtesy of Byton \nByton is rooted in China, but it has global sales aspirations. Byton’s global headquarters, research and development, local sales and factory are located in China. Its engineering work—basically anything to do with autonomous driving, sensors, and software development—occurs at its North American headquarters in Santa Clara, California. The vehicle platform was designed in Germany. \nByton is working with a number of suppliers, including Bosch for the electric power trains, Faurecia for the interior of the car as well as the seats, and Beijing, China-based BOE for the big screen. Byton is working with two battery supplies as well as an autonomous vehicle technology company, which have yet to be disclosed. \nThe company has raised $320 million from outside investors. Additional sources of funding from lenders will be used to help build the factory in Nanjing. Byton plans to raise additional capital from investors in a Series B round this year, Kirchert told Fortune . \nConstruction on the factory began in September 2017 and the building is expected to be completed by the third quarter of this year. Trial production will begin in early 2019. Kirchert says mass production should be ready by the end of 2019. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-08T05:40:00.000+02:00", "crawled": "2018-01-08T05:40:14.000+02:00", "highlightTitle": ""}