{"organizations": [], "uuid": "95605aa8e59001166cc3acfd4d45c1de3d9345fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/12/104524954-_Y2A6490.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/suze-orman-says-this-one-money-question-drives-her-crazy.html", "country": "US", "domain_rank": 767, "title": "Financial expert Suze Orman: This one question about money always 'makes me crazy’", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T21:01:00.000+02:00", "replies_count": 0, "uuid": "95605aa8e59001166cc3acfd4d45c1de3d9345fe"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/suze-orman-says-this-one-money-question-drives-her-crazy.html", "ord_in_thread": 0, "title": "Financial expert Suze Orman: This one question about money always 'makes me crazy’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "suze orman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:21 AM ET Wed, 28 June 2017 | 01:03 SHARES \nAs a former CNBC host, best-selling author and award-winning financial advisor, Suze Orman prides herself on keeping her cool. Still, there's one question about money that always drives her crazy, she writes in a recent blog post: \"Would I be happier if I had more?\" \n\"I am always floored … when I am talking to groups and I get this question. I try not to get too worked up,\" she says, \"but any of you, who have come to hear me speak, know this when I get a bit animated. \n\"This way of thinking makes me crazy.\" \nMoney alone, she says, will not make you happy. \"Yes, you need to have enough money to pay your basic living costs . But making more money, having more money than that, does not guarantee you will be happier. I know plenty of very wealthy people. They are so not happy .\" show chapters 9:20 AM ET Fri, 27 Oct 2017 | 00:53 \nStudies back up that claim . Experts say that happiness only increases with wealth up to a point : The correlation peaks when you earn $75,000 per year. \"The difference the marginal dollar makes in reducing negative emotions starts to fall off around $70,000, is very low by $160,000 and hits zero around $200,000,\" reports CNBC . \nA recent review from the Harvard Business School asked more than 4,000 millionaires to rank their life satisfaction and happiness. Its findings: Even the super-rich aren't always satisfied. \nThat may be because \"what matters for your well-being is what you're doing with the minutes and days of your life,\" not necessarily how much money you have,\" Elizabeth Dunn, a psychology professor at the University of British Columbia, tells CNBC Make It . \n\"If you have a lot of money and a lot of nice stuff, but you're spending your time doing things that you dislike, then your minute-to-minute happiness and overall happiness is likely to be pretty low.\" show chapters 11:50 AM ET Wed, 28 June 2017 | 01:04 \nBerkshire Hathaway chairman and chief executive officer Warren Buffett, whose net worth is nearing $90 billion, agrees . \n\"I can buy anything, basically,\" Buffett said on PBS Newshour. \"I have been on 400-foot yachts, and I have ... lived the life a little bit with people that have 10 homes and everything.\" Yet Buffett still lives in the same house he bought in 1958. And \"for me,\" he says, \"it's because it's got memories, and people come back, and all that sort of thing.\" \nThere are ways you can strive for happiness and financial success at the same time. For instance, a study of more than 195,000 American workers shows that making friends at work can not only make you happier, it can also make you a better employee. \nAnd building \" rich relationships ,\" like the one Buffett and longtime friend Bill Gates have shared for years, with people you admire who can mentor or encourage you, can help you reach personal, professional and financial goals. \nOverall, though, as Orman writes, happiness doesn't come from making or having money. Instead, it's \"waiting for you in the time you spend with loved ones. [It] comes from celebrating what you have today, and not getting all worked up about what you don't have.\" ", "external_links": [], "published": "2018-01-12T21:01:00.000+02:00", "crawled": "2018-01-12T21:10:53.009+02:00", "highlightTitle": ""}