{"organizations": [], "uuid": "c755c425d99927b90d33e833d7265120b822d965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/14/104841533-GettyImages-494460324r-GE.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/general-electric-reveals-sec-investigation-of-insurance-reserve-review.html", "country": "US", "domain_rank": 767, "title": "General Electric reveals SEC investigation, plans to restate 2016, 2017 results", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T16:08:00.000+02:00", "replies_count": 0, "uuid": "c755c425d99927b90d33e833d7265120b822d965"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/general-electric-reveals-sec-investigation-of-insurance-reserve-review.html", "ord_in_thread": 0, "title": "General Electric reveals SEC investigation, plans to restate 2016, 2017 results", "locations": [], "entities": {"persons": [{"name": "sebastien bozon", "sentiment": "negative"}, {"name": "jamie miller", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}], "locations": [{"name": "belfort", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "general electric", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5 Hours Ago | 03:07 \nThe Securities and Exchange Commission has opened up an investigation of General Electric 's accounting practices in the wake of the conglomerate's review of its insurance business. \nOn Jan. 16, GE revealed it had conducted a review of its GE Capital insurance portfolio and decided to take a $6.2 billion after-tax charge in the fourth quarter of 2017, and contribute $15 billion over the next seven years to shore up the portfolio's reserves. \nThe SEC is investigating both the process that led to the insurance reserve increase and the fourth-quarter charge, Chief Financial Officer Jamie Miller said Wednesday. Additionally, the SEC will look at GE's revenue recognition and its controls for long-term service agreements. \n\"We are cooperating fully with the investigation, which is in very early stages,\" Miller added. \nThe CFO said she expects her team has a strong read on what mistakes were made in previous years, and is not \"overly concerned\" about the probe. \n\"I think we have got a good inventory of what we see,\" she told investors on GE's fourth-quarter earnings conference call. \"And as we go through this, I think our reserves are appropriately set ... If we need to take additional actions in GE Capital, we'll take them. But it's really too early at this point to speculate on how early that could land.\" \nMiller, who took over as finance chief in November, said the company will restate its 2016 and 2017 results and is \"still in the process of finalizing\" the updates. The restatement stems from a need to adjust for new revenue recognition rules for its long-term service contracts. \nGE has a portfolio of long-term agreements in its jet engine and power turbine business. The rule govern when the revenue for these contracts may be recognized. \nThe GE Capital's multibillion dollar insurance charge contributed to the $10 billion loss GE saw from continuing operations in its most recent quarter. \nThe charges was needed because GE was not collecting enough premiums in its long-term care insurance business. Only about a dozen insurers offer such coverage — down from more than 100 in the 1990s. Companies have been hurt by low interest rates and more customers than expected using the benefits available. \nGE was no exception.The company acknowledged in July it was experiencing \"adverse claims\" in its long-term care portfolio. The payouts may continue to be a headache for GE as American life spans rise. \nThe huge conglomerate is trying to right its business, and with a new CEO at the helm, is reviewing its operations closely. Some expect GE could sell or spinoff some of its assets. \nFollowing the release of the earnings report, the company's stock popped as much at 5 percent in premarket trading. Some investors were relieved the fourth-quarter earnings didn't reveal any larger issues about GE's liquidity, despite the fact that many of GE's businesses continue to struggle, especially its power segment. \nAfter news of the SEC investigation broke, the stock retreated and was recently trading down about 1 percent. Michael Sheetz News Associate for CNBC Related Securities ", "external_links": [], "published": "2018-01-24T16:08:00.000+02:00", "crawled": "2018-01-24T16:19:00.001+02:00", "highlightTitle": ""}