{"organizations": [], "uuid": "ffd65bf45b31944fe3855a9aebddfcf59e8b0356", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/22/104124251-20161122-4892-2304.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/billionaire-tilman-fertitta-will-leave-his-fortune-to-his-children.html", "country": "US", "domain_rank": 767, "title": "Why self-made billionaire Tilman Fertitta plans on leaving his entire fortune to his children", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T22:22:00.000+02:00", "replies_count": 0, "uuid": "ffd65bf45b31944fe3855a9aebddfcf59e8b0356"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/billionaire-tilman-fertitta-will-leave-his-fortune-to-his-children.html", "ord_in_thread": 0, "title": "Why self-made billionaire Tilman Fertitta plans on leaving his entire fortune to his children", "locations": [], "entities": {"persons": [{"name": "tilman fertitta", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "bill gates", "sentiment": "none"}, {"name": "fertitta", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "houston rockets", "sentiment": "none"}, {"name": "landry's inc.", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While some billionaires, including Warren Buffett and Bill Gates, have pledged to give most of their vast fortunes to charity instead of their kids , self-made billionaire and host of CNBC's \"Billion Dollar Buyer\" Tilman Fertitta doesn't anticipate doing the same.\n\"I look at things totally differently,\" he tells CNBC Make It . \"I believe that what you've created is a legacy for you and your family.\"\nFertitta is the owner of the NBA's Houston Rockets and CEO of Landry's Inc., one of the largest restaurant corporations in the U.S.\nThough he plans on keeping his estimated $3.8 billion within the family, the hospitality mogul has made sure to instill the value of a dollar in his children.\n\"You try to instill what's right and wrong with your kids,\" he says. \"I don't spoil my kids. My kids go to work every day.\"\nFertitta explains that his children have been working at his company since they graduated from college and he believes that doing so has taught them that they can contribute more to society by continuing to grow the business and create jobs.\n\"That's what makes American capitalism,\" he says.\nHis sentiment lies in contrast with his fellow billionaires. In 2011, Bill and Melinda Gates told the Daily Mail that they are giving their three kids \"a minuscule portion\" of their estimated $94.5 billion .\nGates reiterated this in 2016 when he told he told \"This Morning\" that it's a disservice to kids to give them a large sum of wealth.\n\"It distorts anything they might do, creating their own path,\" he said at the time.\nshow chapters Billionaire Tilman Fertitta meets \"The Bachelor\" stars Catherine and Sean Lowe and says writing handwritten cards is essential to getting ahead 8:39 AM ET Thu, 18 Jan 2018 | 01:02 Billionaire investor Warren Buffett has also stated that he will give a designated sum to his children. This way, they have \"enough money so that they would feel they could do anything, but not so much that they could do nothing,\" he told Fortune in 1986 .\nIn 2015, Buffett told The Washington Post that he would leave each of his three children $2 billion. The remainder of his $92.8 billion fortune will go toward philanthropic causes.\nThough Fertitta doesn't see himself doing the same, he says that he does teach his kids about the importance of philanthropy and how they can make a difference.\nNevertheless, the billionaire says that he'd rather give his money to his kids to manage than someone who didn't grow up with his values and who may not share his thoughts or worldview.\n\"So why other billionaires are doing it, I have no idea,\" he tells CNBC Make It. \"I'm better off letting my own family [decide] what's best.\"\nLike this story? Like CNBC Make It on Facebook .\nSee also:\nSelf-made billionaire Tilman Fertitta says you should still send handwritten thank you cards\nThis self-made billionaire says he's highly successful because he never 'shot for the stars'\nSelf-made billionaire Tilman Fertitta calls this the trait you need to be a successful manager\nshow chapters Why this billionaire restaurateur says he never 'shot for the stars' 8:22 AM ET Wed, 3 Jan 2018 | 01:04 \"Billion Dollar Buyer\" airs on CNBC Wednesdays at 10pm ET/PT.", "external_links": [], "published": "2018-01-23T22:22:00.000+02:00", "crawled": "2018-01-23T22:34:50.011+02:00", "highlightTitle": ""}