{"organizations": [], "uuid": "77ccda02e569980018dda6a71b1976d1155482fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/19/104175819-GettyImages-530066579.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/how-7-millennial-leaders-plan-to-accomplish-their-2018-goals.html", "country": "US", "domain_rank": 767, "title": "Here's how 7 millennial leaders plan to accomplish their goals in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T18:15:00.000+02:00", "replies_count": 0, "uuid": "77ccda02e569980018dda6a71b1976d1155482fe"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/how-7-millennial-leaders-plan-to-accomplish-their-2018-goals.html", "ord_in_thread": 0, "title": "Here's how 7 millennial leaders plan to accomplish their goals in 2018", "locations": [], "entities": {"persons": [{"name": "porter braswell", "sentiment": "none"}, {"name": "tony robbins", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "jopwell jopwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tetra Images | Getty Images SHARES \nIt's the first month of the new year. Are you on your way to achieving your New Year's resolutions, or have you already faltered or given up completely? \nAccording to business and life coach Tony Robbins , 80 percent of people give up on their New Year's resolutions by the second week of February because they don't have a solid plan in place. \nTo help you become part of the percentage that sets clear goals and sticks to them, CNBC Make It talked to seven millennial CEOs and executives about their goals for 2018 and their roadmap for success. \nPorter Braswell, CEO and co-founder of Jopwell : Photo courtesy of Jopwell Jopwell Co-Founder and CEO Porter Braswell \n2018 Goal: To be more present in the moment \nHow he's sticking to this goal: \"While it is so important to multitask efficiently, it is equally important to know how to unplug and focus. That is what I'm working on this year and I'm encouraging my team to prioritize as well. \n\"A close mentor of mine told me to always make sure you give your team your full attention, no matter how hectic it can feel to run a startup. This year, I'm making a concerted effort to put my iPhone away and give those I meet with my undivided focus. This is something I've noticed makes every interaction more meaningful and can go a long way in building lasting relationships.\" \nBeck Bamberger, CEO of BAM Communications : Photo courtesy of BAM Communications BAM Communications CEO Beck Bamberger \n2018 Goal: To regularly measure results \nHow she's sticking to this goal: \"A lot of people write down their goals, but then they file them away and rarely look at them. The old adage, 'What gets measured, gets done' is so relevant to achieving goals. You need a strong habit to review the goals just like brushing your teeth or making your bed. I review my goals every day, at the same time and in the same setting (after I run in the morning, usually about 6:20 a.m., outside, while I'm stretching.) This makes 'forgetting' what my goals are nearly impossible and therefore, I don't lose track of getting them done.\" \nLiz Wessel, CEO of WayUp : Photo courtesy of WayUp WayUp CEO Liz Wessel \n2018 Goal: To be better at delegating assignments \nHow she's sticking to this goal: \"Like many startup founders, I've spent the first few years at WayUp working on things like user support (aka responding to every user's email), sales strategy, product road mapping and more. Recently, we took an exciting step and hired our entire executive team. Now that I have an incredible group of leaders around me, I'm looking forward to managing results and being able to make decisions from a higher level.\" \nAngela Benton, CEO and founder of NewME Inc : Photo courtesy of Angela Benton NewMe Inc. Founder and CEO Angela Benton \n2018 Goal: To focus less on busy-work and more on the tasks that produce meaningful results \nHow she's sticking to this goal: \"I always start with setting strategic goals before setting tactical goals. It's important to know where you're going or where you want to go and it's easy to get caught up in busy-work that isn't actually moving you closer to your goals. \n\"Once I set strategic goals I check in with myself every month to see if the culmination of my work for that month has gotten me closer to where I want to go. If it has, great! If it hasn't, I still have time to regroup and refocus in the coming month. The idea of using this method is that, hopefully, by year's end, you're where you want to be.\" \nJoseph Fasone, CEO of Pilot : Photo courtesy of Joseph Fasone Pilot CEO Joseph Fasone \n2018 Goal: To use my time and my team's time more effectively \nHow he's sticking to this goal: \"Running a fast-growing company, the demands on my time are immense both in and out of the office. My past tendency has been to let these demands —whether it's back-to-back meetings, or a constantly full inbox or dinner with prospective clients — command my schedule. \n\"In 2018, I'm focused on putting systems in place to ensure I am using my time and the time of my team most effectively. Most immediately, I am committed to going into meetings with clear intentions and goals so that my team is equipped to continuously evolve and improve in order to drive innovation where we see it needed most.\" \nJonathan Jackson, Co-founder and head of corporate brand at Blavity : Photo courtesy of Jonathan Jackson Blavity Co-Founder and Head of Corporate Brand Jonathan Jackson \n2018 Goal: To focus less on the small stuff and more on projects that have the most impact \nHow he's sticking to this goal: \"In 2018, I'm focusing on a concept I read about, having a deep year — building in constraints that help me focus on the most impactful things I can be doing. For me, it's less about keeping my resolutions, and more about whether those commitments are actually in line with what I say I value, and what I am hoping to solve. \n\"I set my goals in terms of the impact that I want, and the incremental steps that it will take. Those might be moments of intense focus, others could be [gradual] steps, but all of them are things that actually excite me, which helps me stay focused when I have dips or get off-track.\" \nBrett Adcock, Co-founder of Vettery : Photo courtesy of Brett Adcock Vettery co-founder Brett Adcock \n2018 Goal: Create a better learning environment for staff \nHow he's sticking to this goal: \"As a founder, it can be difficult to take a step back from managing the day-to-day in order to focus on our broader business strategy. My co-founder, Adam, and I have aggressive business goals for 2018 and know that in order to meet them we need to create an environment where our team has opportunities to grow alongside us. This means investing time to teach people to become great managers. If our team is empowered to be a part of the company's growth, it will only lead to all of our success.\" ", "external_links": [], "published": "2018-01-23T18:15:00.000+02:00", "crawled": "2018-01-23T18:40:23.013+02:00", "highlightTitle": ""}