{"organizations": [], "uuid": "1ab7cbf838dacf95934c64f7eadc5d4d4698d249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104951455-IMG_1534r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/cramer-remix-how-i-decide-which-retailers-are-not-buyable.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: How I decide which retailers are not buyable", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T01:59:00.000+02:00", "replies_count": 0, "uuid": "1ab7cbf838dacf95934c64f7eadc5d4d4698d249"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/cramer-remix-how-i-decide-which-retailers-are-not-buyable.html", "ord_in_thread": 0, "title": "Cramer Remix: How I decide which retailers are not buyable", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "j.c. penney", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When CNBC's Jim Cramer evaluates retail companies and their stocks, he likes to go straight to the source.\n\"I shop everywhere and if I shop at a place that I'm not that crazy about, I don't recommend the stock. And I'm not crazy about shopping at J.C. Penney ,\" the \" Mad Money \" host told a caller on Thursday. \"The people are very nice. I just don't find it a very satisfactory experience. So I can't recommend the stock.\"\nEven so, Thursday's broad declines in the major averages didn't stop Cramer from noticing some unusual, positive action in individual stocks.\n\"I'm talking about these multi-day-up extravaganzas, where investors can't buy enough shares in one session after a positive event so they keep coming back, day after day after day, to get their full positions on, no matter how much the stock runs in the interim,\" Cramer said. \"Honestly, I have never seen anything like it, so I've got to point this out and explain it to you.\"\nIBM executive Schroeter positive on blockchain Getty Images Blockchain , a digital record-keeping method that exploded in popularity in conjunction with the cryptocurrency craze, will change the way the world makes transactions, IBM's Martin Schroeter told CNBC on Thursday after earnings .\n\"If you bought IBM stock today, you would have to wait three days for that to clear because it has to go through its process,\" Schroeter, IBM's senior vice president of global markets, told Cramer. \"In a blockchain, ... you can see every transaction instantly, so your trade could clear and go from their account to your account instantly.\"\nBut blockchain isn't all about trading, and certainly not all about trading cryptocurrencies, Schroeter, former CFO of IBM, told Cramer. (Schroeter took on his new role, once held by IBM CEO Ginni Rometty, on Jan. 11, ceding the CFO role to IBM veteran James Kavanaugh.)\nHaving recently partnered with shipping colossus Maersk on a joint venture to apply blockchain software, IBM hopes to establish an efficient \"global trade network\" of manufacturers, shippers, freight forwarders and others, Schroeter said.\nTop 4 market discrepancies Getty Images President Donald Trump returns to the White House following a weekend trip with Republican leadership and members of his cabinet at Camp David, on January 7, 2018 in Washington, D.C. To Cramer, the story of this stock market seems to be all about \"cognitive dissonance.\"\n\"There's just so many examples of investors holding two contradictory opinions at the same time and it has a tendency to color the tape,\" the \"Mad Money\" host.\nCramer's top four contradictions ? Rates, Trump, cryptocurrencies and the stock shortage, he said.\nPPG CEO on self-driving cars Automakers are racing to develop self-driving cars, but the benefits of the trend stretch beyond autos, PPG Industries Chairman and CEO Michael McGarry told Cramer on Thursday.\n\"If you think about the LIDAR and radar that enables autonomous driving, they need to have the costs driven down so this can become a ubiquitous technology,\" McGarry said.\nAs the chief of one of the world's largest makers of paints and coatings, McGarry said his company was seizing on the opportunity to help these automakers drive down their costs with his products.\n\"Coatings will help them enable that technology to work with [fewer] radar and LIDAR units because it'll make the car more visible,\" McGarry told Cramer. \"We can put the LIDAR and radar in the bumpers so they can not be so ugly on the car. So if you think about why the Tesla 3 has such great visibility is because it has the ability to hide a lot of things, and we can enable that.\"\n\"We're certainly pleased to be a leading partner with [Tesla],\" the CEO added.\nLightning round: Stale on VALE In Cramer's lightning round , he zoomed through his take on some callers' favorite stocks:\nVale : \"Look, it's $13. You can wait until it comes back up, but it really is pure commodity and I'm not going to recommend it because my charitable trust lost too much money in the stock. Bad feelings.\"\nHoward Hughes : \"That stock, I feel, I'm not crazy about. Why? Because Bill Ackman is a big shareholder [and] once told me it's going to go to the moon and he's been a seller, so that makes me feel like don't buy, don't buy, don't buy.\"\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-19T01:59:00.000+02:00", "crawled": "2018-01-19T02:36:04.010+02:00", "highlightTitle": ""}