{"organizations": [], "uuid": "c7083d627fea2cb8069f198b9e1cd515b0955aca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Ikea Founder Ingvar Kamprad Dies at 91 – Fortune", "url": "http://fortune.com/2018/01/28/ingvar-kamprad-ikea-founder-dies/", "country": "US", "domain_rank": 1196, "title": "Ikea Founder Ingvar Kamprad Dies at 91", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-28T17:05:00.000+02:00", "replies_count": 0, "uuid": "c7083d627fea2cb8069f198b9e1cd515b0955aca"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/28/ingvar-kamprad-ikea-founder-dies/", "ord_in_thread": 0, "title": "Ikea Founder Ingvar Kamprad Dies at 91", "locations": [], "entities": {"persons": [{"name": "ingvar kamprad", "sentiment": "negative"}, {"name": "kamprad", "sentiment": "none"}, {"name": "ingvar", "sentiment": "none"}, {"name": "ikano", "sentiment": "none"}, {"name": "jesper brodin", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "smaland", "sentiment": "none"}], "organizations": [{"name": "ikea", "sentiment": "negative"}, {"name": "bloomberg billionaires index", "sentiment": "none"}, {"name": "ikea group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 10:05 AM EST \nIngvar Kamprad, whose boyhood business of selling pencils and seeds from his bicycle in Sweden eventually grew into the Ikea furniture chain, has died. He was 91. \n“One of the greatest entrepreneurs of the 20th century, Ingvar Kamprad, has peacefully passed away at his home in Smaland, Sweden, on Jan. 27,” Ikea said in an emailed statement on Sunday. The founder of Ikea, as well as a bank for its customers, Ikano, “was “surrounded by his loved ones,” and died “following a short illness.” \nKamprad had an estimated net worth of $58.7 billion, according to the Bloomberg Billionaires Index, making him the world’s eighth-richest person. The wealth was accumulated by producing furniture for the masses that was affordable and easy to transport. The Ikea flat packs revolutionized the way in which tables, chairs and other items could be stored and shipped, before being assembled by the customer. \n“We are mourning the loss of our founder and dear friend Ingvar,” Jesper Brodin, chief executive officer of the Ikea Group, the largest retailer in the Ikea franchise system, said in a statement. “His legacy will be admired for many years to come and his vision –- to create a better everyday life for the many people -– will continue to guide and inspire us.” Frugal Billionaire \nKamprad was known for driving an old Volvo, recycling tea bags and taking home little packets of salt and pepper from restaurant visits. He was known as “Uncle Scrooge” and “The Miser” in the Swiss village of Epalinges, near Lausanne, where he moved in the 1970s before returning to Sweden a few years ago. He also avoided wearing suits and ties and traveled coach when flying. \nIkea’s corporate culture mirrors Kamprad’s celebration of frugality. Executives of the company travel on low-cost airlines and lodge in budget hotels. Its employees follow a basic pamphlet written by Kamprad in 1976, “The Testament of a Furniture Dealer,” which states that “wasting resources is a mortal sin,” and stipulates Ikea’s “duty to expand.” \nBrodin, who during his career at Ikea worked for 10 years as an assistant to Kamprad, said in a phone interview on Sunday that the billionaire “started as a 17-year-old with two empty pockets, but a ton of entrepreneurship. He used to tell me that he never knew it would become so big.” \nKamprad’s death “will affect us all and we’ll take time to be sad and reflect on what Ingvar achieved,” Brodin said. \nCondolences poured in from politicians, business leaders and royalty. Prime Minister Stefan Lofven said his country had lost a “unique entrepreneur who meant a lot to Sweden’s business community.” \nForeign Minister Margot Wallstrom said Kamprad “pre-eminently put Sweden on the world map. A fantastic entrepreneur who contributed to bringing Sweden out into the world. My thoughts are with his family and relatives.” The Ikea Experience \nEntire families descended on the company’s stores each week and Ikea’s merchandise became ubiquitous. Shoppers drop off their children at Ikea day-care centers, dine at Ikea restaurants and select from among thousands of products ranging from leather sofas to soup ladles. In 2017, 403 Ikea stores in 49 countries received 936 million visitors, and the chain generated sales of 38.3 billion euros ($47.6 billion). \nU.K. style magazine Icon in 2005 named Kamprad the most influential taste-maker in the world, and wrote “if it wasn’t for Ikea, most people would have no access to affordable contemporary design. The company has done more to bring about an acceptance of domestic modernity than the rest of the design world combined.” \nThe name Ikea is made up of the founder’s initials and the first letters of the Elmtaryd farm and Agunnaryd village where he was raised. His flat-pack furniture was invented by Ikea employee Gillis Lundgren in 1956 when he tried to fit a table into the back of a car. Realizing the table was too bulky, Lundgren removed the legs. Storing and selling Billy book shelves or entire kitchens in pieces has let Ikea cut storage space and fill its trucks with more goods. \nThe concept of having customers pick up most of their own furniture in adjacent warehouses and transport it home for self-assembly also helped drive down costs. Childhood Business \nIngvar Feodor Kamprad was born March 30, 1926, near the southern Swedish town of Almhult. His father, Feodor, looked after the family farm and his mother, Berta, ran a lodging house on the property during the summer. At age 5, Kamprad started his business ventures by selling matches to his neighbors. Buying in bulk in Stockholm and selling at a premium in smaller quantities, he got his introduction to a business practice he would cherish at Ikea. \nThe entrepreneur, who was still attending high school in Gothenburg, moved on to fish, Christmas-tree decorations, seeds and pencils, which he sold from his bicycle. Founding Ikea in 1943, Kamprad then started marketing pens, wallets and nylon stockings in the local media, and distributed them using a milk van. He began selling furniture in 1948. \nIn the 1990s, Kamprad found himself under attack when his association with a pro-Nazi group, five decades earlier, came to light. Kamprad apologized to Ikea employees, saying his membership was the “greatest mistake of his life.” \nIkea opened its first store in Almhult, Sweden, in 1958. \nKamprad stepped down as CEO in the late 1980s. He continued to wield power as an adviser to the holding company, and he designed an ownership structure to ensure Ikea’s future survival and independence. An Ikea employee magazine in 2012 revealed that his three sons had been given more active roles at the closely held company. In 2013, he relinquished his role as chairman of Inter Ikea Group. \n“Since 1988 Ingvar Kamprad did not have an operational role within Ikea but he continued to contribute to the business in the role of senior advisor, sharing his knowledge and energy with the Ikea co-workers,” the company said on Sunday. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-28T17:05:00.000+02:00", "crawled": "2018-01-28T17:05:30.001+02:00", "highlightTitle": ""}