{"organizations": [], "uuid": "083240eb3272981b131ce42e2a44ffa92f39a8c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://richinwriters.com/feed", "section_title": "RichInWriters.com", "url": "https://www.cnbc.com/2018/01/12/the-cities-with-the-best-and-worst-credit-scores.html", "country": "US", "domain_rank": 767, "title": "The cities with the best and worst credit scores", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T19:43:00.000+02:00", "replies_count": 0, "uuid": "083240eb3272981b131ce42e2a44ffa92f39a8c1"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/12/the-cities-with-the-best-and-worst-credit-scores.html", "ord_in_thread": 0, "title": "The cities with the best and worst credit scores", "locations": [], "entities": {"persons": [{"name": "madison", "sentiment": "negative"}, {"name": "gen xers", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "sioux falls", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "gen xers", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "experian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "High credit scores are making a comeback.\nA new report from Experian reveals that, in the U.S., the average credit score in 2017 was 675, up two points from 2016. That's the highest average credit score since 2012. Credit scores are starting to bounce back from the financial crisis of 2008 and are now just four points away from the 2007 average of 679.\n\"The trend line that we are seeing is quite promising. With employment and consumer confidence on the rise, we've made great progress as a country since the recession,\" says Michele Raneri , vice president of analytics and new business development at Experian.\n\"The economy is expected to expand at a healthy pace this year supported by access to affordable consumer credit and we believe that credit will continue to rebound. All of the factors point towards a good year for credit in 2018.\"\nStates with the highest and lowest scores When it came to credit scores, though, Experian's report found that some cities fared significantly better than others. The 10 cities with the lowest average Vantage credit scores of 2017, according to Experian, are:\nGreenwood, Mississippi : 624 Albany, Georgia : 626 Harlingen, Texas : 631 Laredo, Texas : 635 Riverside, California : 636 Corpus Christi, Texas : 638 Odessa, Texas : 640 Monroe, Louisiana: 640 Montgomery, Alabama : 640 Shreveport, Louisiana : 640 On the flip side, the cities with the highest average Vantage credit scores in 2017 are:\nMinneapolis, Minnesota : 709 Rochester, Minnesota : 708 Mankato, Minnesota : 708 Wausau, Wisconsin : 706 Green Bay, Wisconsin : 705 Duluth, Minnesota : 704 Sioux Falls, South Dakota : 704 San Francisco, California : 703 La Crosse, Wisconsin : 703 Madison, Wisconsin : 703 Credit card debt is climbing However, while credit scores are climbing, so is credit card debt.\nExperian's report found, on average, Americans' credit card debt crept up 2.7 percent in 2017, from $6,188 to $6,354. Millennials in particular took on much more credit card debt, climbing 10.8 percent from $3,894 to $4,315. Meanwhile, Gen Xers saw an increase of 5.1 percent in credit card debt from $7,372 to $7,750.\nEarlier this week, the Federal Reserve announced that outstanding credit card debt hit a new high in November, increasing by $11.2 billion to $1.023 trillion.\nExperian's wide-ranging report also highlights that non-mortgage debt (which includes auto and student loan debt) is really rising, especially for younger people, and is up 15 percent for Gen Z, 9 percent for millennials and 5 percent for Gen Xers.\nExperian's analysis is based on a statistically relevant sampling of Experian's consumer credit database as of Q2 2017.\nHow to boost your score A recent study from LendEDU found that 25 percent of millennials can't even identify what a credit score is.\nYour credit score is important because it gives potential lenders a good snapshot of your overall financial health. A low score could impact the interest rate you get on major purchases like a home or car. Most credit scores range from 300 to 850, and a good score is typically 700 or above .\nYou can boost your score by decreasing your credit utilization ratio, which can be done by keeping your balances low. Just because that credit is available to you doesn't mean you should max it out every month. Instead, aim to use under 30 percent of your available credit.\nPaying of your balance in full, on time, every time can also help increase your score, as can limiting your applications for new credit.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: Credit card debt hits record high of over $1 trillion—here's a little-known trick that can save you thousands\nshow chapters A good credit score is key to your financial future — here's how to boost it 11:42 AM ET Fri, 25 Aug 2017 | 01:12", "external_links": [], "published": "2018-01-12T19:43:00.000+02:00", "crawled": "2018-01-12T20:04:42.004+02:00", "highlightTitle": ""}