{"organizations": [], "uuid": "83aaca74860a9e7e6ebf24a64bb41e9500e10b48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/23/104548323-RTX39HTO-job-fair-now-hiring.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/solid-us-job-growth-expected-in-december-with-wages-seen-rising.html", "country": "US", "domain_rank": 767, "title": "Solid US job growth expected in December, with wages seen rising", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T13:17:00.000+02:00", "replies_count": 0, "uuid": "83aaca74860a9e7e6ebf24a64bb41e9500e10b48"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/solid-us-job-growth-expected-in-december-with-wages-seen-rising.html", "ord_in_thread": 0, "title": "Solid US job growth expected in December, with wages seen rising", "locations": [], "entities": {"persons": [{"name": "rick wilking", "sentiment": "none"}], "locations": [{"name": "solid us", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "golden", "sentiment": "none"}], "organizations": [{"name": "sears", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Rick Wilking | Reuters A job applicant (L) talks with a recruiter for Sears at a job fair in Golden, Colorado. \nU.S. employers likely maintained a brisk pace of hiring in December while increasing wages for workers amid growing confidence in the economy, which could pave the way for the Federal Reserve to increase interest rates in March. \nNonfarm payrolls probably increased by 190,000 jobs last month, according to a Reuters survey of economists, after a gain of 228,000 in November. Despite the anticipated moderation, employment gains would still be above the monthly average of 170,000 over the past three months. \nHarsh weather in some parts of the country likely contributed to some of the job growth slowdown in December. \nFor all of 2017, the economy is expected to have created around 2 million jobs, slightly below the 2.2 million added in 2016. The Labor Department is due to release its closely watched employment report at 8:30 a.m. ET (1330 GMT) on Friday. \nJob growth surged in October and November after being held back in September by back-to-back hurricanes, which destroyed infrastructure and homes and temporarily dislocated some workers in Texas and Florida . A solid employment report would add to the upbeat assessment of the economy signaled in housing, consumer spending, and manufacturing data. \n\"Fed officials continue to look for signs that the U.S. economy remains on the expansion path, December's employment report should further support such an outlook,\" said Sam Bullard, a senior economist at Wells Fargo Securities in Charlotte, North Carolina. \"We believe the Fed will be in a position to raise rates in March.\" \nJob growth in line with expectations could heighten criticism of a $1.5 trillion package of tax cuts passed by the Republican-controlled U.S. Congress and signed into law by President Donald Trump last month. \nThe fiscal stimulus, which includes a sharp reduction in the corporate income tax rate to 21 percent from 35 percent, is occurring with the economy operating almost at capacity. There are concerns the economy could overheat. \n\"With the tax cuts we get solid GDP growth in the near-term and then a fiscal hangover, which will likely put the economy at a greater risk of recession,\" said Ryan Sweet, senior economist at Moody's Analytics in West Chester, Pennsylvania. Job growth seen slowing \nEconomists expect job growth to slow this year as the labor market hits full employment, which will likely boost wage growth as employers compete for workers. The economy needs to create 75,000 to 100,000 jobs per month to keep up with growth in the working-age population. \nAverage hourly earnings are expected to have risen 0.3 percent in December after gaining 0.2 percent in the prior month. So-called base effects are expected to, however, keep the annual increase in wages at 2.5 percent. Economists are optimistic that annual wage growth will top 3.0 percent by the end of this year. \nThe unemployment rate is forecast to be unchanged at a 17-year low of 4.1 percent. With the December employment report, the Labor Department will incorporate annual revisions to the seasonally adjusted household survey data going back five years. \nThe unemployment rate is derived from the household survey, which means the series is likely to be revised. The jobless rate has declined by seven-tenths of a percentage point since last January. \nEconomists believe it could drop to 3.5 percent by the end of this year. That could potentially unleash a faster pace of wage growth and translate into a much stronger increase in inflation than currently anticipated. \nThat, according to economists, would force the Fed to push through four interest rate increases this year instead of the three it has penciled in. The U.S. central bank raised borrowing costs three times in 2017. \n\"If the unemployment rate declines and wages rise faster, which is likely, the Fed is going to start worrying about wage inflation,\" said Joel Naroff, chief economist at Naroff Economic Advisors in Holland, Pennsylvania. \nEmployment gains were likely broad in December, mirroring the pattern of the previous two months. Construction payrolls probably increased further, reflecting recent strong increases in homebuilding. \nAnother month of steady gains is expected in manufacturing employment. A strong holiday shopping season likely boosted retail payrolls in December. \nMacy's said last month it would hire an additional 7,000 temporary workers for its stores to deal with heavy customer traffic in the run-up to the holiday shopping season. Related Securities", "external_links": [], "published": "2018-01-05T13:17:00.000+02:00", "crawled": "2018-01-05T13:21:03.008+02:00", "highlightTitle": ""}