{"organizations": [], "uuid": "5c030f1b4bd6787cfc9c1751d4b814157ffb13da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Walmart Is Bringing the Fight to Amazon’s Turf: E-books – Fortune", "url": "http://fortune.com/2018/01/25/walmart-ebooks/", "country": "US", "domain_rank": 1196, "title": "Walmart Is Bringing the Fight to Amazon’s Turf: E-books", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T03:20:00.000+02:00", "replies_count": 0, "uuid": "5c030f1b4bd6787cfc9c1751d4b814157ffb13da"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/25/walmart-ebooks/", "ord_in_thread": 0, "title": "Walmart Is Bringing the Fight to Amazon’s Turf: E-books", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "rakuten kobo", "sentiment": "negative"}, {"name": "amazon", "sentiment": "neutral"}, {"name": "walmart", "sentiment": "neutral"}, {"name": "apple", "sentiment": "none"}, {"name": "association of american publishers", "sentiment": "none"}, {"name": "barnes & noble", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:20 PM EST \nAnd the plot thickens. \nWalmart (wmt) is teaming up with e-reader maker Rakuten Kobo to take on a market dominated by arch-rival Amazon.com: (amzn) e-books. \nSometime later this year, Walmart will start selling e-books, audiobooks and Kobo e-readers in the United States, looking to expand a market presence that has been limited to physical books, typically paperback bestsellers, along with a broader selection on line. The move is also a new salvo in its ongoing competition with Amazon, which thanks to its market-leading Kindle, commands about 83% of the U.S. e-books market, according to estimates. Apple (aapl) and bookstore chain Barnes & Noble (bks) are big e-book players too, though they trail far behind. \nBut Walmart is jumping on a declining category: last year, Americans bought about 490 million e-books, or roughly 17% of the book market. Digital books as a percentage of total sales peaked at about 23% five years ago and have since slipped. In the first eight months of 2017, e-book sales fell 5.3% while physical books edged up, according to the Association of American Publishers. Still, for Walmart, the move is consistent with its strategy to aggressively increase its online assortment and compete more directly with Amazon, even on its own turf. Walmart’s U.S. online sales rose 50% in its most recent full quarter . \nKobo, which had tried to make a big U.S. breakthrough at the start of the decade in a partnership with now bankrupt bookseller Borders , offers six million e-books. Its readers, which compete with Amazon’s Kindle and Barnes & Noble’s struggling Nook, will be available at 4,000 Walmart stores. That is likely to boost Kobo’s tiny share of the U.S. e-books market share and turn it into a serious contender. (Kobo, a big presence in markets like Canada and the Japan, sold about 1.25 million books in the U.S. last year.) \nWalmart also announced another key partnership with Kobo’s parent Rakuten, the largest Japanese online retailer. Starting sometime in the summer or early fall, Walmart subsidiary Seiyu, will launch a new online grocery service in Japan. The joint venture will include the creation of a fulfillment center dedicated to grocery delivery as well as equipping Seiyu stores to make deliveries. Walmart operates about 341 stores in Japan. \n“Rakuten is a strong e-commerce business and we’re excited to collaborate wit the top online shopping destination in Japan,” Walmart CEO Doug McMillon said in a statement ahead of a meeting in Tokyo Thursday morning local time with Rakuten CEO Hiroshi Mikitani. \nIt’s not the first time Walmart teams up with a local e-commerce leader in a market it wants to grow in: the company teams up in China with JD.com, and now offers one-hour delivery form 140 stores there. Last quarter, total China sales rose 4%. Walmart offers delivery of online grocery orders in several countries including Britain, Canada, and Mexico. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T03:20:00.000+02:00", "crawled": "2018-01-26T06:13:17.021+02:00", "highlightTitle": ""}