{"organizations": [], "uuid": "dc1320c1676c30df07047acaa58e41e6166aa8dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936720-1-8-2018-montecito-storm-mudslide-5.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/big-storm-kills-five-people-destroys-homes-in-southern-california.html", "country": "US", "domain_rank": 767, "title": "Powerful winter storm kills at least five people, mudslides destroy homes in Southern California", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:21:00.000+02:00", "replies_count": 0, "uuid": "dc1320c1676c30df07047acaa58e41e6166aa8dd"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/big-storm-kills-five-people-destroys-homes-in-southern-california.html", "ord_in_thread": 0, "title": "Powerful winter storm kills at least five people, mudslides destroy homes in Southern California", "locations": [], "entities": {"persons": [{"name": "thomas", "sentiment": "none"}, {"name": "mike eliason", "sentiment": "none"}, {"name": "eliason", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "ojai", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "carpinteria", "sentiment": "none"}, {"name": "creek", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}, {"name": "ventura county", "sentiment": "none"}], "organizations": [{"name": "santa barbara county fire department", "sentiment": "negative"}, {"name": "national weather service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Credit: Santa Barbara County Fire Department Devastation in the Montecito community after big winter storm Tuesday brought heavy rains and caused mudslides in areas near where the massive Thomas fire recently burned. \nA deluge of rain in recent burn areas of Southern California caused mudslides, destroyed homes and wreaked havoc on communities from Santa Barbara to Los Angeles counties and left at least five people dead Tuesday. \nThe five deaths were in the Montecito and Carpinteria areas where a devastating wildfire recently left charred hillsides without vegetation cover to hold the rainfall, according to Mike Eliason, a spokesman with the Santa Barbara County Fire Department. \nWeather forecasters said some of the heaviest rain could fall in some areas where the Thomas and Creek fires recently burned. The National Weather Service said Tuesday morning more than 5 inches of rain was recorded north of Ventura County's Ojai community in the Thomas fire burn area. \nEliason didn't have details on the five deaths in Santa Barbara County. He also indicated there were numerous injuries due to the storm, including to children. https://twitter.com/EliasonMike/status/950787816899751936 \nSanta Barbara fire crews rescued three people early Tuesday from floodwaters and mud flows in the Montecito area northwest of Los Angeles where multimillion-dollar homes owned by prominent celebrities are located. The water flows also swept several homes in the community from their foundation. \nHelicopters also were used to evacuate people trapped in hillside areas of Santa Barbara County where heavy rain made some roads impassible due to flooding. https://twitter.com/EliasonMike/status/950791713035087872 \nAmong the rescues was a 14-year-old girl who had been trapped inside a home that got swept off its foundation, according to Eliason. \n\"The house came to rest up against trees,\" Eliason said. \"She was trapped in there for hours. It took firefighters two hours to cut her out of the house. They just finally rescued her and brought her out.\" \nParts of the busy U.S. 101 freeway that connects Santa Barbara with Ventura also were closed due to flooding caused by overflows from Montecito Creek. \nFlooding debris also covered areas near the Montecito Inn and caused damage to parts of the first floor. Daniel Dreifuss | AP Debris and mud cover the entrance of the Montecito Inn after heavy rain brought flash flooding and mudslides to the area in Montecito, Calif. on Tuesday, Jan. 9, 2018. \nThere also was a ruptured gas line that sparked a fire in the Montecito area. \nThe strong winter storm also brought fears of flashfloods and mudslides to Ventura County, where the Thomas fire — the largest wildfire in California history — destroyed homes and left blackened hillsides vulnerable to the heavy rains. \nIn the LA area, communities where the Creek fire burned had mudflows, including portions of the Sun Valley area. Hundreds of residents in canyon areas near where the fire burned were under mandatory evacuation Tuesday, according to the Los Angeles County Sheriff's Department. \nBurbank city officials also reported mudslides in some higher-elevation areas and \"fast-flowing storm water\" that carried away several vehicles. https://twitter.com/BurbankPD/status/950754503510319104 \nBurbank, located about 12 miles north of downtown LA, suffered brush fires in the Verdugo Mountains last year. \nAlso, there was one fatality from a morning freeway accident in the Los Feliz area although it was unclear if it was related to the rainstorm.", "external_links": [], "published": "2018-01-09T21:21:00.000+02:00", "crawled": "2018-01-09T22:00:23.003+02:00", "highlightTitle": ""}