{"organizations": [], "uuid": "af3c301734e9d4b26c476ae9959de00025907094", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/05/104386126-GettyImages-654123158.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/as-credit-card-debt-hits-record-high-a-trick-can-save-you-thousands.html", "country": "US", "domain_rank": 767, "title": "Credit card debt hits record high of over $1 trillion—but one trick can save you thousands", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T18:16:00.000+02:00", "replies_count": 0, "uuid": "af3c301734e9d4b26c476ae9959de00025907094"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/as-credit-card-debt-hits-record-high-a-trick-can-save-you-thousands.html", "ord_in_thread": 0, "title": "Credit card debt hits record high of over $1 trillion—but one trick can save you thousands", "locations": [], "entities": {"persons": [{"name": "matt schulz", "sentiment": "none"}, {"name": "schulz", "sentiment": "none"}], "locations": [], "organizations": [{"name": "federal reserve", "sentiment": "positive"}, {"name": "creditcards.com", "sentiment": "none"}, {"name": "comparecards.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "littlehenrabi | Getty Images SHARES \nThe Federal Reserve announced on Monday that outstanding credit card debt hit a new high in November, increasing by $11.2 billion to $1.023 trillion. \"This record should serve as a wake-up call to American consumers to make 2018 the year they get their credit card debt under control,\" says Matt Schulz, the senior industry analyst at CreditCards.com . \nOne way to actually make that happen is by using balance transfer cards, which Schulz says can be a \"godsend.\" \nBalance transfer cards , when used correctly, can help you pay off your credit card balance and get rid of your debt. But most Americans who could benefit from them have never used them and most millennials in the red don't even understand how they work, according to a survey from CompareCards.com by Lending Tree . \nThe cards essentially let you move your credit card balance from a high-interest card to one that charges you no interest during a 0 percent introductory period, which typically lasts from six to 21 months, depending on the card. \n\"They can save you anywhere from hundreds to thousands upon thousands,\" Bruce McClary, the vice president of communications for the National Foundation for Credit Counseling , tells CNBC Make It . show chapters 10:18 AM ET Fri, 26 May 2017 | 00:58 \n\"The average household with revolving credit card debt pays $904 in interest a year,\" CNBC reports , citing a finding from NerdWallet. Using a balance transfer card, you temporarily escape those interest payments while you focus on getting out of the red. \n\"The goal is paying off the balance at the lowest possible interest rate without adding new debt back into the mix,\" says McClary. So make sure to first do the math. Figure out how much you need to pay each month to pay off your balance before the 0 percent introductory period is up. \nAccording to a study done by Consumer Intelligence, about a third of people with balance transfer cards fail to do this. That mistake could make your situation worse. Once the introductory period is up, the rate rockets to as high as 25 percent, reports WiseBread . \nAs a former credit counselor, McClary saw this firsthand. \"People took advantage of the balance transfer and ended up continuing their normal spending habits,\" he says. \"Instead of eliminating their debt, they essentially doubled it.\" \nTo ensure you're using a balance transfer card correctly, he also recommends avoiding making purchases with the card, because the 0 percent interest rate doesn't usually apply to new spending. show chapters 7:56 AM ET Mon, 24 July 2017 | 01:10 \nWhen you select a card, consider its one-time balance transfer fee, which ranges from 3 to 5 percent. If you have a large balance, you want to make sure what you will save outweighs that fee. \nAnd if you transfer the balance of multiple old credits cards, don't close them all at once, because that can hurt your credit score, says McClary. Waiting six months between each one you close is a good rule of thumb. \nUltimately, if used with the goal paying off your debt, balance transfer cards can be very effective. \nAnd, with debt hitting a record high in November, now could be an opportune time to try them. The federal funds rate also went up a quarter point last month. As CNBC reports , that hike will raise interest rates for people who carry a balance on their cards. \n\"Your debt will only grow faster and faster unless you take action,\" says Schulz. ", "external_links": [], "published": "2018-01-09T18:16:00.000+02:00", "crawled": "2018-01-09T18:23:46.060+02:00", "highlightTitle": ""}