{"organizations": [], "uuid": "1b976ba8b06a4520ca5145445a746ff3903a56c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/20/104854021-GettyImages-876722966.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/new-insane-etf-proposal-for-bitcoin-generates-worry-on-wall-street.html", "country": "US", "domain_rank": 767, "title": "New 'insane' ETF proposal for bitcoin generates worry on Wall Street", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T21:03:00.000+02:00", "replies_count": 0, "uuid": "1b976ba8b06a4520ca5145445a746ff3903a56c9"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/new-insane-etf-proposal-for-bitcoin-generates-worry-on-wall-street.html", "ord_in_thread": 0, "title": "New 'insane' ETF proposal for bitcoin generates worry on Wall Street", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "sec", "sentiment": "none"}, {"name": "direxion asset management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The latest efforts to expand the way investors can buy bitcoins venture into the often misunderstood and potentially dangerous area of leveraged ETFs.\nA regulatory application from Direxion Asset Management seeks approval for five new funds — one that seeks straight-up correlation with the cryptocurrency, but four others designed to amplify price movements either up or down.\nSuch so-called leveraged funds, which use derivatives to achieve their investment goals, have been on the market for years. With $34.7 billion in assets, the funds make up a small but growing part of the $3.5 trillion ETF industry, according to ETF.com.\nBut the effort by Direxion to bring them into the shadowy world of digital currency is raising some concern on Wall Street. The firm filed its application with the Securities and Exchange Commission on Jan. 4, starting a process that those familiar with it say could take six to nine months.\n\"That would be insane for them to actually approve this. Then they're putting a rubber stamp on it as an asset, and I don't think governments want to go there yet,\" said Michael Cohn, chief investment strategist at Atlantis Asset Management. \"It just seems as though it's not something I'd want to put my clients into in any way, shape or form. You can only be embarrassed.\"\nshow chapters 2018 ETF market predictions 10:54 AM ET Wed, 3 Jan 2018 | 03:38 While it's far too early to tell what kind of chance Direxion has for gaining approval, it's important to understand what the proposed funds are and what they are not.\nTheir names are Direxion Daily Bitcoin Bear 1X Shares, Direxion Daily Bitcoin 1.25X Bull Shares, Direxion Daily Bitcoin 1.5 Bull Shares, Direxion Daily Bitcoin 2X Bull Shares and Direxion Daily Bitcoin 2X Bear Shares. Direxion did not respond to a request for comment.\nIf approved, the latter four shares would use leverage to replicate the daily price movements of bitcoin by 1.25, 1.5 and two times respectively. The bear fund would effectively \"short\" bitcoin, or capitalize on declines in price.\nHowever, the funds wouldn't be tied to the price of bitcoin per se but rather the futures price traded on the Cboe and CME. As such, the Direxion application points out that the funds \"should not be expected to track the performance of the target benchmark for any period longer than one business day.\"\n\"There are a lot of conflicting attitudes about this thing. I don't think the SEC can wrap their arms around this,\" Cohn said. \"It's not an asset class, it's not a currency. It's going to be evolved into a technology. As to whether that technology is viable, that remains to be seen.\"\nIndeed, Merrill Lynch recently raised eyebrows when it slapped a ban on bitcoin trading , while other Wall Street principals such as J.P. Morgan Chase CEO Jamie Dimon and BlackRock CEO Larry Fink have decried it as well.\n\"Can you imagine what a 2X bitcoin put or call is going to do? It's going to be amazing volatility,\" said Nick Colas, a bitcoin watcher and co-founder of DataTrek Research. \"It's eye-watering.\"\nColas said he sees the attempts at leveraging bitcoin as part of traders' quest for volatility, which has been noticeably missing from most of the market but is pretty much a daily fact of life for cryptocurrencies.\n\"This is the analog of the search for volatility,\" he said. \"Obviously, bitcoin does have a lot of volatility on its own. This is an attempt to create a product that has some volatility that leverages that.\"\nHowever, the Direxion efforts could represent just another step in the maturation process for cryptocurrencies, whose popularity has exploded over the past year. The top five offerings alone — bitcoin, ethereum, ripple, bitcoin cash and cardano — have a combined market cap of over half a trillion dollars, according to CoinMarketCap. Some 40 cryptos are worth more than $1 billion each.\nWatchers of the growing space figured it was only a matter of time before bitcoin ETF applications accelerated after the CME and Cboe greenlighted futures trading.\n\"We're seeing different measures and steps and approaches to attempt to further legitimize digital currency. This is part of the reason why I say digital currency is here to stay,\" said Sheila Warren, the World Economic Forum's head of blockchain, which is the technology that powers cryptocurrencies.\n\"Institutional investors and others are going to respond to [the Direxion funds]. That's what's intended,\" she added. \"Is that a good thing or a bad thing? That's a matter of opinion.\"\nWarren said the SEC will apply consumer protection principles when evaluating applications from Direxion and others. The commission thus far has taken a fairly dim view of bitcoin-related ETFs, but that was before futures trading began.\nWith price discovery more attainable, that could push the SEC to take another look. The commission does not comment on ongoing applications.\n\"There's going to be a lot of ETFs getting approved this year,\" said David Drake, founder and chairman of LDJ Capital. \"I don't think it's going to be oversaturated. The market can handle quite a few of them.\"\nDrake said he expects the SEC to be \"very careful\" when reviewing the Direxion application as well as what he expects to be a fairly large flow of other applicants this year.\nWATCH: Direxion isn't the only firm looking to launch bitcoin-related ETFs show chapters Bitcoin expert Brian Kelly launches a suite of crypto ETFs 8:20 PM ET Thu, 4 Jan 2018 | 01:17", "external_links": [], "published": "2018-01-08T21:03:00.000+02:00", "crawled": "2018-01-08T21:30:35.000+02:00", "highlightTitle": ""}