{"organizations": [], "uuid": "e94671c950a75cd3578ccabe47a3d6c5212bf3ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 447}, "facebook": {"likes": 58, "shares": 58, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/30/104871450-Screenshot_AWS_Reinvent_2017_Vogels.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/amazons-poaching-tactic-leads-lemonade-to-consider-ditching-aws.html", "country": "US", "domain_rank": 767, "title": "Amazon's aggressive poaching tactics in Israel have start-ups threatening to abandon AWS", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T00:00:00.000+02:00", "replies_count": 0, "uuid": "e94671c950a75cd3578ccabe47a3d6c5212bf3ad"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/amazons-poaching-tactic-leads-lemonade-to-consider-ditching-aws.html", "ord_in_thread": 0, "title": "Amazon's aggressive poaching tactics in Israel have start-ups threatening to abandon AWS", "locations": [], "entities": {"persons": [{"name": "werner vogels", "sentiment": "negative"}, {"name": "wener vogels", "sentiment": "none"}, {"name": "shai wininger", "sentiment": "none"}, {"name": "wininger", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "screenshot amazon", "sentiment": "negative"}, {"name": "linkedin", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lemonade inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Source: Screenshot Amazon chief technology officer Werner Vogels speaks at the 2017 Amazon Web Services re:Invent conference in Las Vegas. \nAmazon 's aggressive poaching tactics in Israel have the country's start-up community riled up, causing some companies to explore abandoning Amazon's cloud service in retaliation. \nShai Wininger, the co-founder of Lemonade, an insurance start-up that's raised $180 million, took his frustration to social media, writing multiple posts on LinkedIn and Facebook about Amazon's poaching activity. \n\"Just learned that Amazon is actively targeting and trying to poach Lemonade Inc. employees,\" Wininger wrote on LinkedIn . \"I wonder if that's their idea of supporting the start-up ecosystem. Reconsidering Amazon AWS.\" \nWininger later followed up, saying Amazon's poaching of employees from customers, like Lemonade, is a \"breach of confidence.\" He also added the \"obscene amount of money\" being offered to steal his employees could end up damaging the entire Israeli start-up market. \nIn a separate Facebook post , Wininger wrote, \"Game on! Werner Vogels FYI,\" tagging Vogels, Amazon's chief technology officer. \nWininger's complaint is the latest evidence of the growing tension between Amazon and emerging tech companies. Last year, Amazon irked some start-ups after releasing a product that looked and worked almost the same as a device made by Nucleus , one of its Alexa Fund portfolio companies. It could also cripple Amazon's effort to expand its presence in Israel, a start-up powerhouse with some of the world's best technical talent. \nAs Wininger's posts gained traction, Vogels eventually left a comment underneath it, indicating he doesn't support Amazon's poaching from its customers. \n\"Let me dive into this,\" Vogels wrote in the comments section of the Facebook post. \"It may be a sourcing agency vs Amazon proper. I find that sourcing from our customers would be extremely counter-effective.\" Talent war \nAmir Konigsberg, CEO of the Tel Aviv-based start-up Twiggle, said the problem isn't necessarily about Amazon stealing start-up employees, but rather the aggressive nature of its poaching. \nHe pointed out that Amazon has been \"systematically\" reaching out to groups of employees working on specific projects within start-ups, putting them at risk of losing an entire team at once. Konigsberg, who formerly led Google's expansion in Israel, said Amazon is much more aggressive than other multinational companies, like Google or Facebook. \n\"Talent war is fine but you have to remain respectful,\" Konigsberg said, adding Amazon is hurting its relationship with the rest of the Israeli tech community. \"It's very important to keep an equilibrium with how you operate. Apple, Google, and FB all have lots of money, but you haven't seen these kinds of complaints happening about them.\" show chapters 6:31 PM ET Tue, 29 Aug 2017 | 00:58 \nThe bigger problem for Amazon is that it may be hurting itself. \nIn the comments section under Wininger's post, a number of Israeli start-up CEOs said they're considering other cloud vendors because of Amazon's actions. That would add to the flood of companies avoiding AWS, a group that includes a number of big-box retailers like Walmart, Target , and Kroger. \nAmazon did not respond to requests for comment. \n\"We spend nearly $2,000,000 / year on AWS, yet Amazon recruiters are aggressively trying to poach our developers in TLV,\" wrote Liad Agmon, CEO of Tel Aviv-based Dynamic Yield. \"It's a data point I'm seriously considering as part of our internal debate whether to stick with Amazon or switch to Google cloud.\" \nGiven Amazon's massive share in the cloud space, it's hard to imagine this will have a material impact on AWS. But it's at least opening the doors for competitors to reach out with better offers, as one Google Cloud salesperson did on LinkedIn. \n\"Google Cloud would love to have you — shoot me a message,\" the Google representative wrote under Wininger's post. WATCH: AWS CEO say it could become world's largest enterprise company show chapters", "external_links": [], "published": "2018-01-11T00:00:00.000+02:00", "crawled": "2018-01-11T00:26:58.000+02:00", "highlightTitle": ""}