{"organizations": [], "uuid": "9a6879a5adfb621b210136efdece81e9f09e04db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/22/104726196-RTX3G30W-lindsey-graham-healthcare.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/sen-lindsey-graham-i-said-my-piece-to-trump-during-immigration-meeting.html", "country": "US", "domain_rank": 767, "title": "Sen. Lindsey Graham: 'I said my piece' to Trump following his immigration comments", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T21:44:00.000+02:00", "replies_count": 0, "uuid": "9a6879a5adfb621b210136efdece81e9f09e04db"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/sen-lindsey-graham-i-said-my-piece-to-trump-during-immigration-meeting.html", "ord_in_thread": 0, "title": "Sen. Lindsey Graham: 'I said my piece' to Trump following his immigration comments", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "lindsey graham", "sentiment": "negative"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "durbin", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "d-ill.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images Sen. Lindsey Graham (R-SC) attends a meeting with U.S. President Donald Trump and Republican members of Congress in the Roosevelt Room of the White House December 5, 2017 in Washington, DC. \nSen. Lindsey Graham did not deny Friday that President Donald Trump called certain nations \"s---hole\" countries, adding that he \"said [his] piece\" in response to the president's \"comments\" at a meeting with lawmakers. \nThe South Carolina Republican did not rebut an account from Sen. Dick Durbin, D-Ill., of a Thursday meeting on bipartisan immigration legislation that both attended. On Friday, Durbin said that Trump \"repeatedly\" said \"hate-filled things\" at the meeting and called African nations \"s---hole\" countries. \nDurbin added that Graham spoke up in response to Trump's comments and said it took courage to do so. \n\"I appreciate Senator Durbin's statements and have enjoyed working with him and many others on this important issue,\" Graham said in a statement. \"I believe it is vitally important to come to a bipartisan solution to the immigration and border challenges we face today. I am committed to working with Republicans and Democrats to find common ground so we can move forward.\" show chapters 4 Hours Ago | 01:47 \nTrump's comments added uncertainty to already contentious talks about legislation to shield hundreds of thousands of young immigrants from deportation and boost border security measures. They sparked bipartisan backlash to the president, with many lawmakers calling them un-American or unhelpful. \nGraham — one of the most notable Republican advocates for both hawkish national security positions and protections for young undocumented immigrants — had recently backed off criticism of Trump as he pushed for his policy goals. \nTwo other GOP Trump allies who attended the meeting — Sens. Tom Cotton, R-Ark., and David Perdue, R-Ga. – said Friday that they \"do not recall\" Trump \"saying these comments specifically.\" \nIn a tweet Friday morning, Trump said he used \"tough\" language at the meeting. \n\"But this was not the language I used,\" he added, apparently referencing the report of him saying \"s---hole.\" \nTrump also denied saying \"anything derogatory\" about Haitians. Trump tweet 2 \nHere's Graham's full statement on Thursday's meeting: \n\"Yesterday Senator Durbin and I met with President Trump at the White House to discuss our bipartisan proposal on border security and immigration. \n\"Following comments by the President, I said my piece directly to him yesterday. The President and all those attending the meeting know what I said and how I feel. I've always believed that America is an idea, not defined by its people but by its ideals. \n\"The American ideal is embraced by people all over the globe. It was best said a long time ago, E Pluribus Unum – Out of Many, One. Diversity has always been our strength, not our weakness. In reforming immigration we cannot lose these American Ideals. \n\"The American people will ultimately judge us on the outcome we achieve, not the process which led to it. \"I know the bipartisan proposal discussed at the White House can get a lot of support from both sides. As always, I look forward to considering additional ideas that could make the proposal even better. \n\"I appreciate Senator Durbin's statements and have enjoyed working with him and many others on this important issue. I believe it is vitally important to come to a bipartisan solution to the immigration and border challenges we face today. I am committed to working with Republicans and Democrats to find common ground so we can move forward.\"", "external_links": [], "published": "2018-01-12T21:44:00.000+02:00", "crawled": "2018-01-12T21:51:02.005+02:00", "highlightTitle": ""}