{"organizations": [], "uuid": "a2c02a95bce0ed909072a7b05aae247bc3341e2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/15/104844902-20171115-5215-2516.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/regulate-bitcoin-but-dont-ban-says-former-fdic-chair.html", "country": "US", "domain_rank": 767, "title": "Bitcoin is 'something regulators need to deal with but not ban,' says former FDIC chair", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T02:17:00.000+02:00", "replies_count": 0, "uuid": "a2c02a95bce0ed909072a7b05aae247bc3341e2e"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/regulate-bitcoin-but-dont-ban-says-former-fdic-chair.html", "ord_in_thread": 0, "title": "Bitcoin is 'something regulators need to deal with but not ban,' says former FDIC chair", "locations": [], "entities": {"persons": [{"name": "sheila bai", "sentiment": "negative"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "bair", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fdic", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "u.s. federal deposit insurance corporation", "sentiment": "none"}, {"name": "paxos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former FDIC Chair Sheila Bair told CNBC on Thursday that cryptocurrencies such as bitcoin should be more tightly monitored but not banned.\n\"I think some additional regulation would be good, and I argue for that,\" Bair told \"Fast Money.\" \"Especially,\" she continued, \"on anti-money-laundering laws, where I think there are a lot of concerns over use of bitcoin or other digital currencies.\"\nCryptocurrencies fluctuated rapidly this week over regulatory concerns and South Korea' s announcement that it was considering banning digital currency, sending investors into a tailspin and triggering sell-offs. So far about a dozen countries — including France , Bolivia and Russia — have proposed a ban on cryptocurrencies or already have one.\nBitcoin and other digital currencies would benefit from more scrutiny to ensure there's no manipulation or fraud, said Bair, former Federal Deposit Insurance Corporation chair under President George W. Bush during the financial crisis in 2008. Clear disclosures would also help people make informed decisions when investing, she said.\nBut banning the asset class would be a mistake, said Bair, who now serves as a board member for Paxos, a financial firm developing blockchain technology for digital currency. She said she does not own any bitcoin.\nInstead, she said, the digital currency is \"something regulators need to deal with but not ban,\" she said.\n\"We don't ban assets,\" she argued. \"Where does that stop?\"\n\"There are a lot of products out there that ... in a lot of people's minds have questionable value,\" she explained. \"[But] traditionally in the U.S., we've let markets price values and determine what the value is.\"\nThe unpredictable crypto market, of which bitcoin is the most popular, lost approximately $200 billion as a result of sell-offs earlier this week. That represented a third of its value since peak trading in mid-December. Once valued at approximately $19,500 per coin, bitcoin's worth fell below $10,000 at one stage on Tuesday.\nBy Thursday, bitcoin and other cryptocurrencies — including ripple and ethereum — were on the upswing once again. Bitcoin briefly topped $12,000, an increase of more than 30 percent from the day before. But prices were still down more than 40 percent from peak December prices.\nCryptocurrencies' volatile nature and potential for large-scale gains could be what attracts some market watchers.\nBair's biggest concern is that people are investing in something they don't understand. \"I worry that people are getting into this because they're seeing the skyrocketing returns and the tremendous increase in value without really understanding what it is.\"\n— CNBC's Evelyn Cheng contributed to this report.", "external_links": [], "published": "2018-01-19T02:17:00.000+02:00", "crawled": "2018-01-19T02:36:03.000+02:00", "highlightTitle": ""}