{"organizations": [], "uuid": "e4ffece9cd78297f3661bebebe56b97dcc784ab4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933572-GettyImages-902259934.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/is-trump-crazy-wolff-book-says-yes-his-policies-say-no-commentary.html", "country": "US", "domain_rank": 767, "title": "Is Trump crazy? The president should only be judged by his policies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T19:18:00.000+02:00", "replies_count": 0, "uuid": "e4ffece9cd78297f3661bebebe56b97dcc784ab4"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/is-trump-crazy-wolff-book-says-yes-his-policies-say-no-commentary.html", "ord_in_thread": 0, "title": "Is Trump crazy? The president should only be judged by his policies", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "chris kleponis", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "obamacare", "sentiment": "none"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "anti-trump", "sentiment": "none"}], "locations": [{"name": "camp david", "sentiment": "none"}, {"name": "thurmont", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When it comes to defeating Donald Trump , his rivals have so far been stymied at every turn.\nDefeating him at the ballot box didn't work.\nBlocking his key goals in Congress hasn't worked. He just signed into law a tax reform bill that also landed a crippling blow to Obamacare through repeal of the individual mandate.\nHoping to remove President Trump from office by way of special counsel Robert Mueller 's eight-month-long Russian collusion investigation hasn't worked. At least it hasn't worked so far.\nSo enter phase four in the anti-Trump movement's efforts to remove, delegitimize, or at least weaken the duly elected president of the United States: They're making the case that he's crazy.\nThat effort got a major boost in recent days thanks to the release of Michael Wolff's new book \"Fire and Fury.\" The book includes several accounts of President Trump's alleged erratic behavior and general lack of fitness for the job.\nThe most damning thing about the book is that Wolff says many of those accusations about the president came from members of the White House staff and even the cabinet. That's unprecedented.\n\"Judging by the intense scrutiny that comes for a candidate and his or her entire family would any fully sane person ever run for President of the United States?\" Indeed, President Trump's public behavior is totally out of sync with what we've seen from every president before him. He's frequently tweeted angrily against members of his own cabinet and Republican Party. Even in live speeches, he's slung around racial slurs, like calling Senator Elizabeth Warren \"Pocahantas.\"\nAnd there was his disastrous comment that there were some \"fine people\" marching among white supremacists in Charlottesville, Virginia. Beyond his unusual comments and tweets, we also have the massive turnover inside his administration with a record number of positions shuffled through for a first year.\nBut let's take a reality check for a moment. Only a professional psychiatrist who has actually examined a patient can medically deem whether he or she is mentally fit for any job or office.\nYes, the 25 th Amendment to the Constitution allows for the vice president and the cabinet to jointly transfer the powers of the presidency to the vice president, (if the president objects, such a move would also require a two-thirds vote by Congress). But there seems to be no chance of that happening any time soon.\nNo matter how many \"Fire and Fury\" copies are sold and how many news media panels filled with amateur mental health pundits focus on the book's accusations, this is simply another futile path for those obsessed with not accepting the 2016 election results.\nBut as long as the issue of presidential sanity is front-and-center right now, it's not a bad idea to look at what really should serve as the criteria for judging the chief executive's fitness for office. That is, presidential policies.\nIf we look at some of what our past presidents have actually done, the question of presidential sanity should come up often. For example:\nWas it sane for President Obama to release tens of billions of dollars of Iranian money frozen by sanctions back to Iran in return for a promise to not develop nuclear weapons for a decade?\nWas it sane for President George W. Bush to pursue and execute a long war with Iraq instead of conducting a more focused and effective war on radical Islamic terror?\nWas it sane for President George H.W. Bush to support the Kurds in the first Iraq war and then abandon them?\nWas it sane for President Clinton to have a sexual affair with a 22-year old intern right in the White House?\nWas it sane for President Kennedy to support a ragtag bunch of revolutionaries to invade Cuba and then abandon them?\nWas it sane for Presidents Johnson and Nixon to prolong what they knew was an unwinnable war in Vietnam with massive bombing campaigns against North Vietnam and Cambodia?\nFinally, judging by the intense scrutiny that comes for a candidate and his or her entire family would any fully sane person ever run for President of the United States?\nWe can't expect to come to any national agreement on most of the above examples. But at least they would be more productive than debating or pontificating on disputed Quote: s, leaks, and innuendo about any president's personal behavior.\nIt's bad enough that the coverage of every presidential campaign has become dominated by a focus on personality, poll numbers, and all things non-policy related. That's been a major complaint about the presidential election process ever since television played such a big role in John F. Kennedy's 1960 election victory.\nBut now we're seeing coverage of an actual presidency that's focusing mainly on the president's personality. That's dangerous.\nThis is true for both sides of the partisan aisle. For example, the GOP tax bill and its de facto repeal of Obamacare just passed and became law thanks greatly to the Democrats being distracted with non-policy matters like the Russia probe.\nMeanwhile, Republicans who support President Trump's policies are constantly forced to answer questions and criticisms based on his personal behavior. But all this amounts to is an enormous head fake.\nThat's because the hard fact is that President Trump's policies, executive orders, and the bills he's supported are no less sane than any of his predecessors' actual body of work. No matter how unprecedented and salacious the Quote: s in \"Fire and Fury\" are, they don't count as presidential policy. Presidential policy is not only objectively verifiable; it's the only presidential report card that matters.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\n ", "external_links": [], "published": "2018-01-08T19:18:00.000+02:00", "crawled": "2018-01-08T19:22:36.000+02:00", "highlightTitle": ""}