{"organizations": [], "uuid": "c30dcbe96918d30441c1ceccd68524e9c9a4c6e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/28/103977174-GettyImages-605698422.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/beware-the-black-hole-that-is-general-electric-market-watcher-warns.html", "country": "US", "domain_rank": 767, "title": "Beware the ‘black hole’ that is GE, market watcher warns", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "c30dcbe96918d30441c1ceccd68524e9c9a4c6e7"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/beware-the-black-hole-that-is-general-electric-market-watcher-warns.html", "ord_in_thread": 0, "title": "Beware the ‘black hole’ that is GE, market watcher warns", "locations": [], "entities": {"persons": [{"name": "john flannery", "sentiment": "none"}, {"name": "boris schlossberg", "sentiment": "none"}, {"name": "schlossberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "neral electric", "sentiment": "none"}, {"name": "bk asset management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4:29 PM ET Wed, 17 Jan 2018 | 02:59 \nThe stock market is in the midst of one of the hottest bull run's ever, but General Electric is being left out in the cold. \nThe Dow 's oldest component has had a rough go at it. On Wednesday, it suffered its worst three-day decline since mid-November. \nFor one market watcher, the reason for the sell-off is clear: GE's opaque finances across its portfolio of businesses. \n\"I would not be rushing to go buy it simply because of the black hole of the financials side,\" Boris Schlossberg of BK Asset Management told CNBC's \" Trading Nation \" on Wednesday. To Schlossberg, the uncertainty of what liabilities hide on its balance sheet is worrisome. \nGE's troubled finances were made a little more transparent to investors on Tuesday after the company announced plans to book a $6.2 billion after-tax charge for its insurance business in its fourth quarter. John Flannery, CEO of GE since August, told investors he was \"disappointed\" in the charge stemming from its \"legacy portfolio.\" \n\"There's still a lot of unknowns right now and, if anything, these write-offs actually highlight just how much wasn't known up until now,\" said Gina Sanchez of Chantico Global, who also holds a pessimistic outlook on GE. \nThe GE Capital subsidiary said it will suspend its dividend to GE for the foreseeable future. GE's financials businesses are expected to be a red mark on GE's balance sheet over the next few years. Analysts forecast a drop in year-over-year revenue and earnings in the GE Capital core segment in 2017 and 2018. \nEven a recent surge in crude oil is not enough for Sanchez to change her view on GE shares. Oil's gains, which should be \"wind in their sails\" for GE's oil and gas operations, will not give enough of a lift to the company as a whole, Sanchez said. GE's oil and gas operations make up roughly one-tenth of the company's total revenue and earnings. \nGE's recent operational performance should become a little clearer when the company reports earnings. Fourth-quarter earnings are expected to dip for the third year in a row, falling to 30 cents a share, roughly one-third lower than in 2016. Sales are expected to rise by 2 percent. GE is set to report on its fourth quarter on Wednesday. \nUntil then, GE shares are taking a hit — over the past three days, its stock has plummeted almost 9 percent. GE's shares have not seen such a weak performance since mid-November with news the company would cut its dividend shocked markets. That marked just its second dividend cut since the Great Depression. \nThe majority of brokers surveyed by FactSet have a hold rating on the stock and a price target average of $20.71 a share, implying nearly 20 percent upside from Wednesday's levels. Morningstar Equity Research has one of the highest price targets at $26 and Deutsche Bank one of the lowest at $15.", "external_links": [], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T15:57:11.024+02:00", "highlightTitle": ""}