{"organizations": [], "uuid": "ed9bc23252ed815aa470e79b316d72fbcadbe209", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/28/104311507-GettyImages-646451038.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/30/trump-state-of-the-union-will-president-talk-about-russia-scandal.html", "country": "US", "domain_rank": 767, "title": "Trump's State of the Union choice: Tackle the Russia probe head on, or pretend it doesn't exist", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T14:00:00.000+02:00", "replies_count": 0, "uuid": "ed9bc23252ed815aa470e79b316d72fbcadbe209"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/trump-state-of-the-union-will-president-talk-about-russia-scandal.html", "ord_in_thread": 0, "title": "Trump's State of the Union choice: Tackle the Russia probe head on, or pretend it doesn't exist", "locations": [], "entities": {"persons": [{"name": "jim lo scalzo", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "nixon", "sentiment": "none"}, {"name": "richard nixon", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "trump's state", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump faces a big question for his State of the Union address Tuesday night — whether to mention the Russia investigation nagging his administration.\nThen-President Richard Nixon, during his 1974 State of the Union address to Congress, urged an end to the investigation of the Watergate case. Less than eight months later, Nixon resigned in disgrace to avoid being impeached because of his role in trying to cover up the \"third-rate burglary\" that was at the center of the Watergate scandal.\nThen-President Bill Clinton — who was actually facing trial in the Senate on the same day he gave his 1999 State of the Union address after having been impeached by the House — did not mention his own case at all.\nClinton ended up beating the charges — and served out the remainder of his second term.\nTrump now is presented with his own choice in his speech, which begins at 9 p.m. ET: making a case to the American people and to Congress that the time has come to close the probe into whether his presidential campaign colluded with Russia, or avoiding the topic altogether. Modern presidential history provides a variety of examples for Trump to follow.\nOne is Nixon, who in seeking an end to the Watergate probe, sounded a lot like Trump has recently sounded in talking about Robert Mueller 's probe into possible collusion between the Trump campaign and Russia.\nThe president has said Mueller's investigation will find no evidence of collusion. \"The sooner it's worked out, the better it is for the country,\" Trump told The New York Times last month.\nNixon, in his State of the Union in 1974, said: \"I would like to add a personal word with regard to an issue that has been of great concern to all Americans over the past year.\"\n\"I refer, of course, to the investigations of the so-called Watergate affair. As you know, I have provided to the special prosecutor voluntarily a great deal of material,\" Nixon said. \"I believe that I have provided all the material that he needs to conclude his investigations and to proceed to prosecute the guilty and to clear the innocent.\n\"I believe the time has come to bring that investigation and the other investigations of this matter to an end. One year of Watergate is enough.\"\nNixon did not get his wish.\nTweet\nPresident Ronald Reagan, whose own administration was damaged by revelations that it had secretly facilitated the sale of weapons to Iran with some of the proceeds secretly used to fund the Contra rebels in Nicaragua, mentioned that scandal during his 1987 State of the Union.\n\"But though we've made much progress, I have one major regret,\" Reagan said. \"I took a risk with regard to our action in Iran. It did not work, and for that I assume full responsibility.\"\n\"The goals were worthy. I do not believe it was wrong to try to establish contacts with a country of strategic importance or to try to save lives. And certainly, it was not wrong to try to secure freedom for our citizens held in barbaric captivity. But — but we did not achieve what we wished, and serious mistakes were trying — made in trying to do so. We will get to the bottom of this and I will take whatever action is called for.\"\nBut if Trump — or his advisors — want to avoid talking about Russia and Mueller, one example to follow is President John Kennedy, and how he pointedly ignored the topic of Cuba altogether in his State of the Union in 1962.\nJust a year before, Kennedy talked about \"Communist agents seeking to exploit [Latin America's] peaceful revolution of hope have established a base in Cuba, only 90 miles from our shores.\"\n\"Communist domination in this hemisphere can never be negotiated,\" Kennedy warned.\nThree months later, in April 1961, the U.S.-backed invasion of Cuba by Cuban exiles failed miserably at the Bay of Pigs.\nIn January 1962, during his State of the Union address, Kennedy did not utter the word \"Cuba,\" much less the \"Bay of Pigs,\" once — although he referred to Europe 12 times, to communism seven times and to the Dominican Republic once.\nAnd while Trump has delighted in lashing out at Hillary Clinton , whom he defeated in the 2016 election, Clinton's husband may hold the record for the most State of Union addresses that avoided mentioning a significant scandal that was hot at the time of the speech.\nJust days before Clinton gave his 1996 State of the Union, his wife was subpoenaed to testify before a federal grand jury investigating the question of the handling of records from her former law firm. President Clinton did not speak of that issue, which related to independent counsel Kenneth Starr's broader probe of the Clintons' Whitewater land deal.\nNor did the name of Monica Lewinsky pass Clinton's lips in his State of the Union address in 1998, days after news broke that the president had had a sexual relationship with the White House intern.\nA year later, after having been impeached by the House, and on the same day his lawyers opened their defense of him in the Senate, Clinton talked in his State of the Union speech about the economy, a budget surplus of $70 billion and \"solving the so-called Y2K computer problem\" – but nothing about his impeachment.", "external_links": [], "published": "2018-01-30T14:00:00.000+02:00", "crawled": "2018-01-30T15:50:16.014+02:00", "highlightTitle": ""}