{"organizations": [], "uuid": "a3e6d3ced89bdf1ab09dd5bf55edd582bff2e033", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104963201-Katerra-sample.1910x1000.jpeg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/katerra-raises-865-million-from-softbank-vision-fund.html", "country": "US", "domain_rank": 767, "title": "SoftBank pours $865 million into Katerra, a start-up making buildings in a factory", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T14:00:00.000+02:00", "replies_count": 0, "uuid": "a3e6d3ced89bdf1ab09dd5bf55edd582bff2e033"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/katerra-raises-865-million-from-softbank-vision-fund.html", "ord_in_thread": 0, "title": "SoftBank pours $865 million into Katerra, a start-up making buildings in a factory", "locations": [], "entities": {"persons": [{"name": "katerra", "sentiment": "negative"}, {"name": "fritz h. wolff", "sentiment": "none"}, {"name": "michael marks", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}], "locations": [{"name": "katerra", "sentiment": "none"}], "organizations": [{"name": "softbank", "sentiment": "negative"}, {"name": "softbank vision fund", "sentiment": "negative"}, {"name": "wolff co", "sentiment": "none"}, {"name": "flextronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SoftBank Vision Fund is leading another out-sized equity funding round, this time pouring $865 million into Katerra, a high-tech construction company.\nJust three years old, Katerra was co-founded by Chairman Michael Marks, who was previously the CEO of Flextronics and the interim CEO of Tesla , along with Fritz H. Wolff, the executive chairman of real estate investors The Wolff Co.\nKaterra now has 1,300 employees, including 100 architects, and makes buildings in factories, essentially. \nAs Marks elaborated, \"We bring massive amounts of tech to construction. We have our own factories to make the components. We make sub-assemblies there, bring them to a site, move them around on trucks and conveyors and bring the buildings to life. There's no handoff. We do everything.\"\nshow chapters Construction start-up Katerra closes $865 million funding round      2 Hours Ago | 03:20 Katerra has $1.3 billion in backlogged projects, Marks said, with those developments expected to \"go in the ground\" in the next two years, most in 2018.\nCustomers, who are residential and commercial real estate developers, use Katerra when they want to get buildings finished quickly. Katerra appeals to customers who don't want to work with a bunch of disconnected teams, like one manufacturer for cabinets, another for windows, another installer for elevators, and LEED-certified HVAC systems.\nConstruction spending is expected to grow 2 to 7 percent in 2018, overall, with private residential construction seeing the greatest growth, between 6 and 9 percent this year, according to forecasts from the Associated General Contractors of America.\n\"It's not magic,\" Marks said. \"We're Silicon Valley people bringing automation to design, and other aspects of the sometimes antiquated construction industry.\" The series D funding round brings Katerra's post-money valuation to more than $3 billion, he said.\nOn CNBC's Squawk Alley on Wednesday, the chairman said he didn't think SoftBank's big equity investments came with inflated valuations. Instead, the Softbank Vision Fund is deploying capital in a \"thoughtful way,\" Marks said, \"We were hoping for a bigger valuation. But it was fair.\"\n\nCORRECTION: Michael Marks is chairman and co-founder of Katerra. His title was misstated in an earlier version of this article.", "external_links": [], "published": "2018-01-24T14:00:00.000+02:00", "crawled": "2018-01-24T14:25:35.010+02:00", "highlightTitle": ""}