{"organizations": [], "uuid": "7ac20be5ed2f4e9c175444f47c59ac7089b8affc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/27/103337759-GettyImages-82823118.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/free-checking-accounts-still-exist-you-just-need-to-know-where-to-look.html", "country": "US", "domain_rank": 767, "title": "Free checking accounts still exist ... you just need to know where to look", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:22:00.000+02:00", "replies_count": 0, "uuid": "7ac20be5ed2f4e9c175444f47c59ac7089b8affc"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/free-checking-accounts-still-exist-you-just-need-to-know-where-to-look.html", "ord_in_thread": 0, "title": "Free checking accounts still exist ... you just need to know where to look", "locations": [], "entities": {"persons": [{"name": "andrew caballero-reynolds", "sentiment": "none"}, {"name": "betty riess", "sentiment": "none"}, {"name": "greg mcbride", "sentiment": "none"}], "locations": [{"name": "bankrate.com", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's not just Bank of America customers who are shelling out extra cash in fees.\nEarlier this month, Bank of America switched certain customers into accounts that require a $12 monthly fee unless they have a direct monthly deposit of $250 or more or maintain a minimum daily balance of at least $1,500. \n\"This is one of the lowest qualifiers in the industry and a great value,\" said Betty Riess, a spokeswoman for the bank. \nBut customers were decidedly unhappy — as of the latest tally, a Change.org petition protesting the move had 50,000 signers. \nFor those grieving the loss of free or low-cost checking, this is nothing new; banks have been pushing up what they charge customers for years.\n\"The landscape is still one where fees are rising,\" said Greg McBride, Bankrate.com's chief financial analyst. \"I don't expect that's going to change anytime soon.\"\nHowever, \"the availability of free checking with no strings attached still exists,\" he said.\nIn fact, 38 percent of banks and 84 percent of the nation's largest credit unions offer a standalone free checking account (meaning checking accounts with no monthly service fee), according to Bankrate.\nYet Americans are still paying $15 billion in fees, including monthly service charges, the Consumer Financial Protection Bureau has said.\nshow chapters Customers fork over $15 billion in unnecessary bank fees      3 Hours Ago | 01:05 The CFPB was established in 2011 in the wake of the financial crisis to provide consumer protection in the financial sector, but there is no regulatory limit on what banks can charge for service fees on deposit accounts. \nAnd choosing the wrong checking account for your situation could cost you dearly — $750 to be exact — in fees over the course of a single year, according to a separate report from WalletHub .\nNearly everyone could earn more than five times more on deposits, on average, by switching to an online-only bank account, another report by WalletHub found . (Online-only banks save money by forgoing brick-and-mortar branches and that translates into better costs for consumers, according to McBride.)\nBut most don't know that some alternatives to a traditional brick-and-mortar bank have better rates and lower fees. And just 6 percent of people have an online-only bank, WalletHub said.\nFor disgruntled banking customers ready to shop their money around for the best terms, here's how to compare fees and conditions .\nBut before making any moves, be sure to check the fine print and — most important — make sure your account is insured by the FDIC.\nMore from Your Money, Your Future: \nSome Capital One debit card users charged twice for purchases \nWhere to earn the best interest on your money right now \nThere are more 401(k) millionaires than ever", "external_links": [], "published": "2018-01-24T19:22:00.000+02:00", "crawled": "2018-01-24T19:51:48.008+02:00", "highlightTitle": ""}