{"organizations": [], "uuid": "2982419a3b6aeb9994204f96b36658b64264deb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/02/104815131-GettyImages-861017202-california-fire-power.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/world-entering-critical-period-of-intensified-risks-in-2018-wef-says.html", "country": "US", "domain_rank": 767, "title": "World entering 'critical period of intensified risks' in 2018, WEF says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T11:11:00.000+02:00", "replies_count": 0, "uuid": "2982419a3b6aeb9994204f96b36658b64264deb7"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/world-entering-critical-period-of-intensified-risks-in-2018-wef-says.html", "ord_in_thread": 0, "title": "World entering 'critical period of intensified risks' in 2018, WEF says", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "wef", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "kcna", "sentiment": "none"}, {"name": "korean central news agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Extreme weather events and natural disasters are the likeliest global risks to occur in 2018, according to experts surveyed by the World Economic Forum.\nWEF's latest Global Risks Report 2018, published Wednesday, showed that environmental disasters, cybercrime, large-scale involuntary migration and illicit trade were among the most notable risks, in terms of likelihood, facing the world this year.\nAs with previous reports, the top-ranking global risk in terms of impact was the use of weapons of mass destruction. But this was followed in the table of top 10 risks by three environmental risks: Extreme weather events, natural disasters and a failure of climate-change mitigation and adaptation.\nAlmost 1,000 global experts and decision-makers were surveyed on their views on the most significant risks that face the world. The risks ranged from the diverse categories of economic, environmental, geopolitical, societal and technological.\nThe results formed the bulk of WEF's new risks perception survey, which feeds into its global report, and showed a large increase in the number of responses signalling there would be an \"intensification of risks\" in 2018. Indeed, a press release by the organization Wednesday said the world was entering a \"critical period of intensified risks in 2018.\"\nThe experts were asked to prioritize 30 global risks in terms of likelihood and impact and, in fact, all five environmental risks — extreme weather; biodiversity loss and ecosystem collapse; major natural disasters; man-made environmental disasters; and failure of climate-change mitigation and adaptation — were ranked highly on both dimensions.\nFollowing a year in which heatwaves, wildfires and hurricanes were commonplace, \"extreme weather events\" has for the second year in a row been seen as the single most prominent risk for 2018.\nGetty Images A downed power line and the remains of a home and a car are seen in the Larkfield-Wikiup neighborhood following the damage caused by the Tubbs Fire on October 13, 2017 in Santa Rosa, California. Top 5 global risks in 2018 in terms of likelihood: 1) Extreme weather events\n2) Natural disasters\n3) Cyberattacks\n4) Data fraud or theft\n5) Failure of climate-change mitigation and adaptation \nTop 5 global risks in 2018 in terms of impact: 1) Weapons of mass destruction\n2) Extreme weather events\n3) Natural disasters\n4) Failure of climate-change mitigation and adaptation\n5) Water crises\nThe results The World Economic Forum said the results suggested that \"experts are preparing for another year of heightened risk\" and that the trajectory of risks had increased.\n\"When we asked nearly 1,000 respondents for their views about the trajectory of risks in 2018, 59 percent of their answers pointed to an intensification of risks, compared with 7 percent pointing to declining risks.\"\nThe Forum attributed the pessimistic outlook in 2018, at least in part, to a \"deteriorating geopolitical landscape\" particularly with tensions in the Middle East and North Korea ever-present.\nKCNA | Reuters North Korean leader Kim Jong Un guides the launch of a Hwasong-12 missile in this undated photo released by North Korea's Korean Central News Agency (KCNA) on September 16, 2017. It said that 93 percent of respondents said they expect political or economic confrontations between major powers to worsen and nearly 80 percent expect an increase in risks associated with war involving major powers.\nHowever, as in 2017, the environment is by far the greatest concern raised by experts with economic risks featuring less prominently (there are none in the top five on either count of likelihood or impact) although inequality is ranked third in terms of underlying risk drivers.\nStating that the planet is \"on the brink,\" WEF noted that environmental risks have grown in prominence over the 13-year history of the report.\n\"Among the most pressing environmental challenges facing us are extreme weather events and temperatures; accelerating biodiversity loss; pollution of air, soil and water; failures of climate-change mitigation and adaptation; and transition risks as we move to a low-carbon future,\" the report said.\n\"However, the truly systemic challenge rests in the depth of the interconnectedness that exists both among these environmental risks and between them and risks in other countries,\" it added.\nPreceding Davos WEF's survey always precedes the World Economic Forum that takes place in the Alpine resort of Davos, Switzerland, every January.\nThe event takes place over several days and sees over 2,500 participants from around the world attend discussions and seminars covering a wide range of global issues. This year, more than 340 public figures will attend the meeting, including more than 70 heads of state and government, as well as over 1,900 business leaders.\nCommenting on its latest risk report, the Forum said that \"the prospect of strong economic growth in 2018 presents leaders with a golden opportunity to address signs of severe weakness in many of the complex systems that underpin our world, such as societies, economies, international relations and the environment.\"\nSimon Dawson | Bloomberg | Getty Images However, WEF noted that economic risks should not be discounted just because they are not so prominent.\n\"Headline economic indicators suggest the world is finally getting back on track after the global crisis that erupted 10 years ago, but this upbeat picture masks continuing underlying concerns,\" it said.\n\"The global economy faces a mix of long-standing vulnerabilities and newer threats that have emerged or evolved in the years since the crisis. The familiar risks include potentially unsustainable asset prices, with the world now eight years into a bull run; elevated indebtedness, particularly in China; and continuing strains in the global financial system,\" it said.\nAmong the newer challenges facing the economy, it said there was limited \"policy firepower\" in the event of a new crisis, as well as disruptions caused by \"intensifying patterns of automation and digitization.\" On the global trade front, it noted that challenges were being posed by a \"build-up of mercantilist and protectionist pressures against a backdrop of rising nationalist and populist politics.\"\nGetty Images Donald Trump John Drzik, president of Global Risk and Digital at Marsh, which collaborated with WEF on the report, told CNBC Tuesday that there were a number of concerns when it came to economic and political risks.\n\"One is that multilateral institutions and agreements have been waning while the more nationalist politics has taken hold (entailing) more protectionism, less liberal multilateralism so that could be a problem when responding to risk,\" he said.\n\"The other issue is that central banks usually respond (to crisis) by lowering interest rates and there's really nowhere to go with interest rates now (so low) so if there was an economic crisis it would be harder top respond to than the last one,\" he said.\nThis year's WEF is focused on the theme \"creating a shared future in a fractured world\" and headline ", "external_links": [], "published": "2018-01-17T11:11:00.000+02:00", "crawled": "2018-01-17T11:20:37.046+02:00", "highlightTitle": ""}