{"organizations": [], "uuid": "d72e81c24ee97346fb810db69b9925db13901c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948255-RTX49AJB.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/trump-news-white-house-supports-spending-bill-to-avoid-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "White House backs GOP's short-term spending bill — but Lindsey Graham says he's against it", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T21:02:00.000+02:00", "replies_count": 0, "uuid": "d72e81c24ee97346fb810db69b9925db13901c90"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/trump-news-white-house-supports-spending-bill-to-avoid-government-shutdown.html", "ord_in_thread": 0, "title": "White House backs GOP's short-term spending bill — but Lindsey Graham says he's against it", "locations": [], "entities": {"persons": [{"name": "joshua roberts", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "lindsey graham", "sentiment": "neutral"}, {"name": "sarah huckabee sanders", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "reuters donald trump", "sentiment": "neutral"}, {"name": "white house", "sentiment": "neutral"}, {"name": "gop", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump supports Republicans' short-term spending bill, and will pin the blame on Democrats if it fails to pass, press secretary Sarah Huckabee Sanders said Wednesday. \nDemocrats have threatened to oppose a continuing resolution to fund the government if they cannot also pass a plan to protect hundreds of thousands of young undocumented immigrants . But the White House may have blame to put on some of the majority Republicans, too. Sen. Lindsey Graham, R-S.C., said Wednesday that he is against a short-term funding measure. \nSanders said the White House seeks two-year spending legislation, but would prefer a stop-gap measure to a government shutdown. \n\"The president certainly doesn't want a shutdown, and if it happens I think you only have one place to look — and that's the Democrats,\" she told reporters on Wednesday. \nIf Congress cannot pass a funding bill by the end of Friday, parts of the government will run out of money. Republicans control the House, Senate and White House, and can pass a funding bill with only GOP votes in the House. A funding plan will need some Democratic support to pass the Senate. \nEven some Republicans have threatened to vote against it, hurting its chances of passing this week. Graham said Wednesday that he would vote \"no\" on the measure, arguing that Congress has strung together too many short-term funding bills, according to NBC News. \n\"We've just got to let folks in this body know enough is enough,\" he said. \nThe bill introduced by House Republicans would extend government funding through Feb. 16. It would reauthorize the Children's Health Insurance Program for six years and delay some Affordable Care Act taxes .\nWhile Democrats have made extending CHIP a priority, the GOP does not plan to move to pass a bill to shield the immigrants protected by the Obama-era Deferred Action for Childhood Arrivals. Trump ended the program in September with a six-month delay, and those immigrants could start to face deportation after March 5. \nCongressional leaders starting to dole out blame earlier Wednesday. Senate Minority Leader Chuck Schumer, D-N.Y., argued that a shutdown \"will fall squarely on the majority leader's shoulders and the president's shoulders.\" \nSenate Majority Leader Mitch McConnell, R-Ky., suggested Wednesday that Democrats were \"manufacturing a crisis\" on immigration before the March deadline. Ryan accused them of playing politics with immigration. \nBipartisan senators reached a deal last week on protecting the young immigrants, increasing border security funding and revising extended family migration rules and the visa \"lottery\" system. Trump rejected the plan when they presented it to him.", "external_links": [], "published": "2018-01-17T21:02:00.000+02:00", "crawled": "2018-01-17T21:20:06.000+02:00", "highlightTitle": ""}