{"organizations": [], "uuid": "52fda0df80f715ae4b4c88e4548afe941c8f5af1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/15/104169656-GettyImages-460496974.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/us-crude-discount-to-brent-shrinking-raising-questions-on-oil-exports.html", "country": "US", "domain_rank": 767, "title": "US crude's price is catching up to the rest of the world, creating a risk to the export boom", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T21:16:00.000+02:00", "replies_count": 0, "uuid": "52fda0df80f715ae4b4c88e4548afe941c8f5af1"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/us-crude-discount-to-brent-shrinking-raising-questions-on-oil-exports.html", "ord_in_thread": 0, "title": "US crude's price is catching up to the rest of the world, creating a risk to the export boom", "locations": [], "entities": {"persons": [{"name": "harvey", "sentiment": "none"}, {"name": "john kilduff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "gulf coast", "sentiment": "none"}], "organizations": [{"name": "u.s. west texas intermediate", "sentiment": "none"}, {"name": "wti", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. crude's significant discount to international oil prices has been a major factor in booming American exports, but the price difference has narrowed this month, setting up a potential risk to the overseas shipments.\nThe price difference between Brent crude , the international benchmark for oil prices, and U.S. West Texas Intermediate has shrunk by about 40 percent in January to its narrowest in five months. It now stands at roughly $4 a barrel, down from $7 a month ago.\nWhen Brent trades at a premium to WTI, it encourages foreign buyers to buy U.S. crude.\n\"Part of the growth in U.S. exports has been this arbitrage,\" said John Kilduff, founding partner at energy hedge fund Again Capital.\n\"We'll have to see at what point does the export picture start to get restrained as a result of the lower spread. Is that $3 or lower?\"\nThe spread blew out in September, when Hurricane Harvey knocked out about a quarter of U.S. refining capacity along the nation's Gulf Coast refining hub. That reduced demand for crude oil, the main feedstock for making refined fuel such as gasoline, and caused stockpiles to build up.\nIt was around this time that China started placing orders for big purchases of the discounted U.S. crude, according to tanker-tracking firm ClipperData. Shortly after, the U.S. exported a record 2.13 million barrels a day.\nBut U.S. crude stockpiles are now drawing down rapidly, falling last week to their lowest level since February 2015, contributing to an 8.5 percent gain for U.S. crude futures this month alone. By comparison, Brent futures are up nearly 4 percent.\nshow chapters Saudi finance minister: We welcome rising crude prices      5:54 AM ET Fri, 26 Jan 2018 | 00:39 However, analysts say it's not time to worry about U.S. oil exports falling off a cliff. The shipments remain well supported by regional price differences and other factors.\nTom Kloza, global head of energy analysis at Oil Price Information Service, notes that $4 a barrel is a level that one would expect the Brent-WTI spread to roughly average over the course of a year. \nEven at $4 a barrel, there's enough buying incentive among foreign purchasers to keep U.S. exports at about a million barrels a day, said Matt Smith, director of commodity research at ClipperData.\n\"If we start to see those exports dropping off, that will only cause the spread to widen again because production is only going in one direction, which is up,\" he said.\nU.S. crude oil production is projected to soon top 10 million barrels a day, a level not seen since the 1970s. At that point U.S. output would top production from Saudi Arabia, the world's largest exporter.\n\"So the crude is available to be exported,\" Smith said. \"It's just how much depends on how wide the spread is.\"\nOil exports have an additional buffer because what truly matters is the price of light sweet crude on the Gulf Coast — where it's typically exported — to international oil prices, said Andy Lipow, president of Lipow Oil Associates.\nThat Gulf Coast crude trades at a premium to WTI, but that premium has also shrunk recently. The difference between Gulf Coast crude and Brent remains wide enough to keep U.S. exports near record levels, Lipow said.\nThe biggest driver behind falling U.S. stockpiles is a drop in inventories in Cushing, Oklahoma, a major storage hub and the delivery point for WTI, analysts say.\nThose stockpiles are draining more quickly thanks to the opening of the Diamond Pipeline, which carries crude from Cushing to a Valero refinery in Memphis, Tennessee.\nThat reduces the need to ship Gulf Coast crude north, Lipow noted. Consequently, there might soon be more Gulf Coast crude available for export.\nWATCH: Low oil prices have generated high oil demand show chapters Low oil prices have generated high oil demand, says Total CEO      6:04 AM ET Thu, 25 Jan 2018 | 02:49", "external_links": [], "published": "2018-01-29T21:16:00.000+02:00", "crawled": "2018-01-29T22:27:49.008+02:00", "highlightTitle": ""}