{"organizations": [], "uuid": "ebafbcadc9323043e6606e457e7a531ddcd0d7b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/12/102500037-20150309-8492-1119.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/the-critically-important-trait-that-makes-a-ceo-successful.html", "country": "US", "domain_rank": 767, "title": "The ‘critically important’ trait that makes a CEO successful, according to a Stanford econ professor", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T17:30:00.000+02:00", "replies_count": 0, "uuid": "ebafbcadc9323043e6606e457e7a531ddcd0d7b1"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/the-critically-important-trait-that-makes-a-ceo-successful.html", "ord_in_thread": 0, "title": "The ‘critically important’ trait that makes a CEO successful, according to a Stanford econ professor", "locations": [], "entities": {"persons": [{"name": "indra nooyi", "sentiment": "neutral"}, {"name": "nicholas bloom", "sentiment": "none"}, {"name": "john van reenen", "sentiment": "none"}, {"name": "raffaella sadun", "sentiment": "none"}], "locations": [], "organizations": [{"name": "stanford", "sentiment": "neutral"}, {"name": "pepsico", "sentiment": "neutral"}, {"name": "general electric", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "walmart", "sentiment": "none"}, {"name": "harvard business school", "sentiment": "none"}, {"name": "wnyc", "sentiment": "none"}, {"name": "mit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The most successful companies are run by CEOs who have one \"critically important\" trait in common: They pay attention to detail.\n\"They're unbelievably detail-oriented,\" says Stanford economics professor Nicholas Bloom in a WNYC \"Freakonomics Radio\" podcast . \"That's one of the big ingredients of their success.\"\nBloom points to companies like General Electric, McDonald's and Walmart. These companies are so successful, he says, because they focus on having competent managers who pay meticulous attention to detail.\nSuccessful CEOs do a variety of things to ensure that nothing is overlooked, explains Bloom. They collect data, they analyze what's going on, and they have thorough performance reviews.\nThis management practice is what sets them, and their companies, apart from others.\nBloom, along with Harvard Business School economics professor Raffaella Sadun and MIT economist John Van Reenen, studied 12,0000 companies to try to learn what makes some better than others.\nThe researchers found that \"management practices can account for a large fraction of performance differences.\"\nshow chapters Here's what makes up the Jeff Bezos empire      12:48 PM ET Thu, 29 June 2017 | 01:05 Sadun says on the podcast that most people have this idea that CEOs are sitting in an office thinking \"blue-sky\" thoughts.\n\"We tend to think about the CEO sitting in an ivory tower, deciding what the organization will do, and then, boom! They make a decision and the decision just happens and everybody's happy,\" she says.\nBut that's not the case. The Harvard business professor explains that successful CEOs spend very little time thinking alone or being in their \"solitary office and looking outside the window.\"\nAlthough they do spend time strategizing and looking at the bigger picture, most of their work focuses on detail-oriented operational aspects of their job, says Sadun. These include things like quality control, making sure products are delivered on time and monitoring and tracking employee performance.\nPepsiCo. CEO Indra Nooyi oversees more than 26,000 employees globally and over 100 brands and trademarks. Yet she still makes it a priority to go to the grocery store every week to see how her company's products look on the shelves.\n\"I'm not just a CEO. I'm also a consumer, I am a shopkeeper, I'm a gatekeeper of my family,\" she tells \"Freakonomics Radio.\" \"So I look at our business through a different lens and then I come back and I talk to my people about what I saw was good, and what wasn't really good.\"\nSadun notes that many in the business world fail to prioritize these smaller tasks, including her MBA students. However, not doing so could lead to \"massive\" challenges.\nStanford professor Bloom agrees. \"Often they get over-excited about the big-picture, sexy stuff of long-term strategy and, kind of, skip over the small details, which turn out to be critically important.\"\nLike this story? Like CNBC Make It on Facebook . \nSee also: \nThe 50 most innovative companies to work for in 2018 \nLyft HR exec: This is the No. 1 trait you should show employers during a job interview \nRichard Branson says the 3 skills all successful CEOs need are not taught in schools \nshow chapters This entrepreneurship professor has studied over 30,000 business pitches—here's what he's learned      5:36 PM ET Mon, 23 Oct 2017 | 01:35", "external_links": [], "published": "2018-01-19T17:30:00.000+02:00", "crawled": "2018-01-19T17:34:16.005+02:00", "highlightTitle": ""}