{"organizations": [], "uuid": "e287ec7c20c49836e51bf120003e8e87a0c9fc77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/29/103504107-GettyImages-496536466r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/tony-fadell-apple-google-facebook-twitter-got-people-tech-addicted.html", "country": "US", "domain_rank": 767, "title": "Ex-Apple exec: Apple, Google, Facebook, Twitter got us addicted to tech and they have to fix it", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T19:51:00.000+02:00", "replies_count": 0, "uuid": "e287ec7c20c49836e51bf120003e8e87a0c9fc77"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/tony-fadell-apple-google-facebook-twitter-got-people-tech-addicted.html", "ord_in_thread": 0, "title": "Ex-Apple exec: Apple, Google, Facebook, Twitter got us addicted to tech and they have to fix it", "locations": [], "entities": {"persons": [], "locations": [{"name": "california", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "twitter", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "jana partners llc", "sentiment": "none"}, {"name": "calstrs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A former top Apple executive and serial tech entrepreneur, Tony Fadell, says thanks to Apple, Google , Facebook and Twitter , consumers are addicted to technology — and those same big tech companies are \"the only ones\" who can treat consumers from that addiction.\nFadell, who made his case via a 10-installment Twitter storm on Monday, tells CNBC Make It via Twitter that, though these consequences were unintended, the companies \"are in the position to give us the info to help us understand our usage habits & the ability to control/monitor them w/ tools. Now it's time to fix…\"\nHe also acknowledged via Twitter the irony of sharing his criticisms on one of the platforms he was blaming.\nFadell says on his own LinkedIn page that he was an \"advisor to the CEO\" at Apple from November 2008 to March of 2010, during which time Steve Jobs was the CEO. ( Jobs resigned in August 2011 .) Also, Fadell was the Senior Vice President in charge of the iPod division from Jan 2001 through March 2010. He has been called one of the \"fathers of the iPod\" for his work on the personal music player. Fadell also founded and was the CEO of home regulation system Nest and the marketing company Fuse.\nFadell recommends big tech turn over usage data to third parties who can build apps to monitor the amount of time being spent looking at screens.\nRead the salient points:\nUK adults spend 8+ hrs on screens/day, children 6.5 hrs. Don't ignore the link betw social media use & depression. 34% of people checked Facebook in the last 10 minutes.\nAdmitting you have an addiction is Step 1.\nWe need to control our own environment & we need information:\nApple Watches, Google Phones, Facebook, Twitter - they've gotten so good at getting us to go for another click, another dopamine hit. They now have a responsibility & need to start helping us track & manage our digital addictions across all usages - phone, laptop, TV etc.\nThey're the only ones who can do this -\nThey need to give access to that information to 3rd-party apps, so that we can manage & limit our time on them, control notifications, etc. There will a lot of great startups that will create useful tools to help us become balanced - digital & analog - again…\nWith (or without) these tools, it's up to us to act:\nThe comments from Fadell come as consumer addiction to technology is top of mind.\nTwo prominent investors in Apple — Jana Partners LLC and the California State Teachers' Retirement System, or Calstrs — sent a letter to the Cupertino-based tech behemoth on Saturday pointing out the extent to which young people are addicted to their smartphones. (Jana Partners LLC and the California State Teachers' Retirement System, or Calstrs own $2 billion worth of Apple stock.)\n\"More than 10 years after the iPhone's release, it is a cliché to point out the ubiquity of Apple's devices among children and teenagers, as well as the attendant growth in social media use by this group. What is less well known is that there is a growing body of evidence that, for at least some of the most frequent young users, this may be having unintentional negative consequences,\" the letter says.\nApple has responded to the letter. Since 2008, parental controls have been available for many Apple products, the company points out.\n\"Apple has always looked out for kids, and we work hard to create powerful products that inspire, entertain, and educate children while also helping parents protect them online. We lead the industry by offering intuitive parental controls built right into the operating system,\" Apple says in a statement shared with CNBC Make It .\n\"We think deeply about how our products are used and the impact they have on users and the people around them. We take this responsibility very seriously and we are committed to meeting and exceeding our customers' expectations, especially when it comes to protecting kids.\"\nApple did not respond to the claim that adults are also addicted to their technology.\nTwitter declined to comment.\nFacebook and Google had not responded to request for comment by the time this story was published.\nFadell pressed Apple to respond to the claim for adults, too.\nIndeed, Adam Alter, an associate professor at the Stern School of Business at New York University, wrote a book, \" Irresistible: The Rise of Addictive Technology and the Business of Keeping Us Hooked, \" making the case that in addition to kids, adults are addicted to technology.\n\"We're biologically prone to getting hooked on these sorts of experiences. If you put someone in front of a slot machine, their brain will look qualitatively the same as when they take heroin. If you're someone who compulsively plays video games — not everyone, but people who are addicted to a particular game — the minute you load up your computer, your brain will look like that of a substance abuser,\" Alter tells the New York Times . \"I find it interesting that the late Steve Jobs said in a 2010 interview that his own children didn't use iPads.\"\nAlter uses himself as an example: \"I'm addicted to email. I can't stop checking it. I can't go to bed at night if I haven't cleared my inbox. I'll keep my phone next to my bed, much as I try not to,\" says Alter.\n\"The technology is designed to hook us that way. Email is bottomless. Social media platforms are endless. Twitter? The feed never really ends. You could sit there 24 hours a day and you'll never get to the end. And so you come back for more and more,\" he tells the Times.\nAnd according to Fadell's tweets, it's not hard to implement tools that would allow consumers to moderate their usage. He knows it, and so does Apple, he says.\nThx to my friends @apple for your 1st response. It's not about only kids, adults need them for themselves too. U & I know it's technically EASY to build usage info & control tools. Looking fwd to many bold announcements @ WWDC in June on this imprtnt topic\nThis story has been updated to include a response from Tony Fadell and Twitter.\nSee also:\nHow Amazon founder Jeff Bezos went from the son of a teen mom to the world's richest person, his wealth topping $105 billion\n8 ways artificial intelligence is going to change the way you live, work and play in 2018\nTony Robbins: This is the difference between people who stick to their New Year's resolutions and those who don't\nshow chapters This CEO wants to put a computer chip in your brain 10:35 AM ET Wed, 12 April 2017 | 01:15 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-10T19:51:00.000+02:00", "crawled": "2018-01-10T20:27:43.006+02:00", "highlightTitle": ""}