{"organizations": [], "uuid": "2147c2f040d3829862b6156116e7ee50fca1e725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/walmart-layoffs-amazon-competition.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&h1=en&topic=b&output=rss", "section_title": "Business - Google News", "url": "http://fortune.com/2018/01/25/wal-mart-headquarter-job-cuts-amazon/", "country": "US", "domain_rank": 1196, "title": "Walmart Is Cutting Up to 500 Corporate Jobs This Week - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T23:27:00.000+02:00", "replies_count": 0, "uuid": "2147c2f040d3829862b6156116e7ee50fca1e725"}, "author": "", "url": "http://fortune.com/2018/01/25/wal-mart-headquarter-job-cuts-amazon/", "ord_in_thread": 0, "title": "Walmart Is Cutting Up to 500 Corporate Jobs This Week - Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 25, 2018 \nWal-Mart Stores Inc. is cutting 400 to 500 jobs at headquarters this week, the latest effort to streamline a retail empire under threat from Amazon.com Inc. \nThe layoffs will hit the company’s marketing, human resources, merchandising, real estate, logistics and finance divisions, the Bentonville, Arkansas-based chain said. The company is informing most of those affected on Thursday, and they will have 60 days to find a new role. \nThe cuts extend a busy month for the world’s largest retailer, which also shut 63 Sam’s Club warehouses and reorganized that unit’s purchasing division. But even as it makes cuts, the company has taken steps to retain employees — like boosting its hourly wage and creating new roles focused on its online grocery business. Chief Executive Officer Doug McMillon is betting that a leaner organization can better battle Amazon, and has said Wal-Mart “is not where we want to be” in terms of reducing corporate expenses. \n“We’ve been looking at our structure for some time as we explore ways to operate more effectively,” the company said in an emailed statement on Thursday. “Those efforts continue. We’re committed to handling every transition smoothly and ensuring everyone is treated as fairly and respectfully as possible.” \nWhile the threat from Amazon hasn’t abated, Wal-Mart is handling it better than most retailers. In the third quarter, same-store sales in its home market rose the most in more than eight years. \nOverall, the holiday shopping season was the best for U.S. retailers since the Great Recession. Wal-Mart reports its fourth-quarter results on Feb. 20. \nThe Wall Street Journal previously reported on the layoffs. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-25T23:27:00.000+02:00", "crawled": "2018-01-26T00:32:37.010+02:00", "highlightTitle": ""}