{"organizations": [], "uuid": "bae77ce2f773e376fb96ec746e5742118a1013cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "U.S. Senate Approves Jerome Powell to Succeed Janet Yellen as Fed Chair – Fortune", "url": "http://fortune.com/2018/01/23/jerome-powell-federal-reserve-janet-yellen/", "country": "US", "domain_rank": 1196, "title": "U.S. Senate Approves Jerome Powell to Succeed Janet Yellen as Fed Chair", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T03:45:00.000+02:00", "replies_count": 0, "uuid": "bae77ce2f773e376fb96ec746e5742118a1013cf"}, "author": "Reuters", "url": "http://fortune.com/2018/01/23/jerome-powell-federal-reserve-janet-yellen/", "ord_in_thread": 0, "title": "U.S. Senate Approves Jerome Powell to Succeed Janet Yellen as Fed Chair", "locations": [], "entities": {"persons": [{"name": "jerome powell", "sentiment": "negative"}, {"name": "janet yellen", "sentiment": "negative"}, {"name": "ben bernanke", "sentiment": "none"}, {"name": "yellen", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}, {"name": "mike crapo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Senate Approves Jerome Powell to Succeed Janet Yellen as Fed Chair Jerome Powell on Capitol Hill in Washington, DC, on Nov. 28, 2017. Saul Loeb—AFP/Getty Images By Reuters 8:45 PM EST \nThe U.S. Senate on Tuesday confirmed Federal Reserve Governor Jerome Powell as the next head of the central bank, succeeding Janet Yellen, a move likely to provide continuity in U.S. monetary policy with the economy growing now for nine years straight. \nThe Republican-controlled Senate voted 84-13 to approve the 64-year-old lawyer to a four-year term as Fed chair beginning early next month. \nIt was the most lopsided of recent Fed chair votes, signaling both Powell’s bipartisan appeal and the ebbing of some of the tensions raised by the central bank’s aggressive response to the 2007-2009 financial crisis and recession. \nControversy over those Fed policies led to a narrower 56-26 vote margin when Yellen became chair in 2013, and a 70-30 vote when former chair Ben Bernanke was named to a second term. \nPowell will be “central to ensuring a safe and sound financial system while supporting a vibrant, growing economy,” banking committee chairman and Idaho Republican Mike Crapo said on the Senate floor. “He will play a key role in rightsizing federal regulations and alleviating unnecessary burdens.” \nPowell takes over as chair with U.S. monetary policy on a steady course toward gradually higher interest rates and a smaller balance sheet. \nHowever, a debate is brewing within the central bank about whether it needs to rethink its approach to inflation and whether the recent massive tax overhaul legislation will affect the U.S. economy. \nPowell must also decide how far to accommodate a push by the Trump administration to roll back some post-crisis financial regulations. \nThe potential for financial deregulation advocated by the Trump administration prompted the most pointed opposition to Powell, a former executive at the Carlyle Group private equity firm whose credentials as Fed chair are rooted in his understanding of markets. Powell is not an economist by training. \n“We need a Fed chair who can stand up to Wall Street,” said Senator Elizabeth Warren, a Democrat. “That person is not Governor Powell.” \nThe 12 votes against Powell included both Democrats and some conservative Republicans. \nPowell, 64, was nominated by Trump in November as a largely uncontroversial pick whose monetary policy views are closely aligned with Yellen’s. \nHe has served on the Fed’s board since 2012 and over time became supportive of the consensus forged by Yellen for gradual interest rate increases and a slow decrease in the asset holdings the Fed accumulated while fighting the crisis, without abandoning a willingness to take extraordinary steps again if a crisis recurs. \nDuring a Senate hearing on his nomination in November, Powell said he would “respond decisively,” if necessary, to future problems. \nPowell has never dissented on a monetary policy decision during his nearly six years at the Fed, though recently released transcripts of central bank deliberations during 2012 showed his discomfort at the time with the Fed’s massive bond-buying program. \nHe later came to see Yellen’s go slow approach as important to helping the jobs market recover and to share her concerns that low inflation justified a cautious approach to raising interest rates. \nWhile interest rates have been rising, they remain low in the context of a 4.1 percent unemployment rate, and on an inflation-adjusted basis still hover around zero. \nThe Fed raised interest rates three times last year and policymakers indicated last month they would likely raise them three times more this year as part of their gradual campaign to put policy on a more normal footing. \nInitially tapped for the Fed board by then-President Barack Obama as a moderate Republican, Powell emerged over the fall as Trump’s choice to lead the Fed from a slate of possible nominees that included both Yellen and some who might have pursued a sharp policy shift. \nThe Senate confirmation vote was originally 85-12, but Democratic Senator Dianne Feinstein changed her vote to a “no.” Aides to Feinstein were not immediately available to comment on the senator’s decision. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T03:45:00.000+02:00", "crawled": "2018-01-24T03:45:27.000+02:00", "highlightTitle": ""}