{"organizations": [], "uuid": "68ec2edeef7aa2de5cc1a94a2cc7b37118700354", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/14/102185969-487288615.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/davos-2018-cancer-can-be-spotted-by-technology-before-it-occurs.html", "country": "US", "domain_rank": 767, "title": "Cancer could soon be spotted by technology 'several months' before it occurs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T11:51:00.000+02:00", "replies_count": 0, "uuid": "68ec2edeef7aa2de5cc1a94a2cc7b37118700354"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/davos-2018-cancer-can-be-spotted-by-technology-before-it-occurs.html", "ord_in_thread": 0, "title": "Cancer could soon be spotted by technology 'several months' before it occurs", "locations": [], "entities": {"persons": [{"name": "henrik kettunen", "sentiment": "negative"}, {"name": "rajeev suri", "sentiment": "none"}, {"name": "suri", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "nokia", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The chief executive of Nokia said biomarkers spotted by wearable devices can predict cancer Rajeev Suri said his team is working on a scanning sleeve for patients to wear He predicts 5G will enable connected ambulances and remote surgery Henrik Kettunen | Bloomberg | Getty Images \nThe chief executive of Nokia said he believes technology can spot cancer \"several months\" before it occurs. \nSpeaking at a panel at the World Economic Forum in Switzerland, Rajeev Suri outlined his vision for the future of medical treatment which included remote surgeries, 5G ambulances, and miniaturized wearable scanners. \n\"With these sort of products, you can start to prevent stuff before it occurs and we think through biomarkers you can even figure out cancer several months before it occurs,\" he said Wednesday . \n\"Think about how important that is when every month and every day is important to a cancer patient,\" Suri added. \nNokia has placed a big bet on technology and how it can shape the future of health care by devoting a new research team to the area. The Nokia chief executive said with the advent of 5G internet connectivity, remote surgery could be made possible as there would almost be no time lag in the data flying across the world. Check out the world leaders and celebrities who are at Davos this year CNBC takes a look at some of the top names scheduled to return to the snowy mountains of Davos, Switzerland next week. \n\"Imagine a doctor in Chicago doing an operation for someone in Taiwan using robotic surgery. You want the doctor to feel immediate feedback to what the robot is experiencing,\" he said. \nSuri said one product under development at Nokia is a wearable sleeve that has chips able to scan specific information like cholesterol, lactic acid levels or glucose. \nThe CEO said wearing such a device would \"fill the void\" between doctor appointments and allow medical professionals access to continuous information. \nSuri added that his firm was working with China Mobile Research Institute on a 5G ambulance that could save people in emergency situations. \n\"Imagine someone who has had a heart attack on the street and they are picked up by an ambulance with 5G connectivity, hi-definition scanners and cameras ... You start taking a scan in the ambulance so all of that data is transferred to the surgery before the patient arrives and a diagnosis is already underway.\" Click to show more \nData is a real-time snapshot *Data is delayed at least 15 minutesGlobal Business and Financial News, Stock Quotes, and Market Data and Analysis \nData also provided by ", "external_links": [], "published": "2018-01-24T11:51:00.000+02:00", "crawled": "2018-01-24T12:04:23.009+02:00", "highlightTitle": ""}