{"organizations": [], "uuid": "fd44548584312c8618efb79c34e6e48ed768a327", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/05/14/100736652-20130512-0228-142.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/macys-is-about-to-close-more-stores.html", "country": "US", "domain_rank": 767, "title": "Macy's is about to close more stores", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T23:13:00.000+02:00", "replies_count": 0, "uuid": "fd44548584312c8618efb79c34e6e48ed768a327"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/macys-is-about-to-close-more-stores.html", "ord_in_thread": 0, "title": "Macy's is about to close more stores", "locations": [], "entities": {"persons": [{"name": "macy", "sentiment": "negative"}, {"name": "adam jeffery", "sentiment": "none"}, {"name": "wedn", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "herald square", "sentiment": "none"}], "organizations": [{"name": "macy's", "sentiment": "neutral"}, {"name": "cnbc macy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Report Macy's is about to close more stores In early 2017, Macy's posted disappointing holiday sales and simultaneously released the locations of more than 60 stores it planned to close last year. Macy's also said at the time it would close 34 more stores \"over the next few years\" as leases or operating covenants expired, or as sale transactions were completed. Those closures are beginning to roll out in 2018 as Macy's looks to generate much-needed cash from its real estate. Adam Jeffery | CNBC Macy's flagship store in Herald Square, New York City. \nLittle by little, Macy's is beginning to close some of the roughly 30 stores it previously announced were on the chopping block. So far, 11 stores have been identified for closure, and four of those stores' teams have been notified, the company told CNBC Wednesday. \nAbout this same time last year, Macy's posted disappointing holiday sales and simultaneously released the locations of more than 60 stores it planned to close in 2017. Additionally, the company said at the time it would close 34 more stores \"over the next few years\" as leases or operating covenants expired, or as sale transactions were completed (making 100 closures in total). \nBusiness Insider said Wednesday that more closures were coming in 2018 from that group of 34 locations. An official announcement has yet to be made from the department store chain, but one is expected to come later this week based on the timing of past press releases. \nAmong the closures is reported to be a Macy's location at Fountain Place in Cincinnati, Ohio, where the retailer is headquartered, according to the Cincinnati Enquirer . \nMacy's shares closed Wednesday down 3.7 percent on the news after rallying for most of the day Tuesday . \n\"Macy's, Inc. has been reviewing its real estate portfolio across the country to see if there are opportunities to improve the use of our assets,\" Macy's told CNBC in a statement. \n\"While closing a store is always a difficult decision because of the impact on our customers, our associates and the community, we deeply appreciate the loyalty of our customers and associates,\" the company added. \nThe Cincinnati-based retailer has said it wants to focus on its best real estate while investing more in its web operations, in a push to win more shoppers online. \n\"We're getting better and better at this because, as we've closed more stores, we've learned a lot about how to retain sales in other stores,\" CFO Karen Hoguet said on a call with analysts and investors, discussing the closures of 2017. \nMeantime, Macy's is testing smaller versions of its off-price concept, Macy's Backstage, inside some of its existing stores, which appeals to customers looking for more of a \"treasure hunt\" shopping experience. The department store chain, like its peers, has been forced to revise its massive floor plans, as fewer shoppers venture to America's malls to ring up purchases. \nHaving faced pressure before from activist investor Starboard ( which sold its stake in the company in 2017 ) to separate its real estate from its retail business, Macy's has still been taking steps to make money from those assets. \nManagement updated analysts and investors this past November , saying Macy's would continue to explore opportunities with Brookfield Asset Management on about 50 properties, including the department store chain's flagship Herald Square location in New York. \nMacy's has also struck deals in the past with some of its landlords, including General Growth Properties , to sell locations and generate cash in a pinch. \nAhead of this year's key holiday shopping season, Macy's, like many of its retail peers, was touting its ability to lure shoppers into its stores, where it has been making bigger investments in customer service and loyalty. \nCEO Jeff Gennette has already told CNBC the company started the holiday season on a strong note compared with 2016. Promotions were also less severe, he said, which should be helping profit margins. Top-selling items included coats, boots, sweaters and fragrances. \nAs of its fiscal third quarter, Macy's operated roughly 860 stores under various brands, including Macy's, Macy's Backstage, Bloomingdale's, and Bluemercury. \nShares of the department store chain have fallen more than 25 percent over the past 12 months. \n— CNBC's Courtney Reagan contributed to this reporting. Lauren Thomas News Associate for CNBC Related Securities ", "external_links": [], "published": "2018-01-03T23:13:00.000+02:00", "crawled": "2018-01-03T23:35:59.000+02:00", "highlightTitle": ""}