{"organizations": [], "uuid": "e8a3cfccef7a433c872f3be92f2fd4ff3c091866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/16/104657187-IMG_7864r-joseph-papa.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/valeant-ceo-looking-for-boost-from-price-hikes-seven-key-products.html", "country": "US", "domain_rank": 767, "title": "Valeant CEO looks to boost performance with price hikes and seven key products", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:50:00.000+02:00", "replies_count": 0, "uuid": "e8a3cfccef7a433c872f3be92f2fd4ff3c091866"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/valeant-ceo-looking-for-boost-from-price-hikes-seven-key-products.html", "ord_in_thread": 0, "title": "Valeant CEO looks to boost performance with price hikes and seven key products", "locations": [], "entities": {"persons": [{"name": "joseph papa", "sentiment": "negative"}, {"name": "papa", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:56 \nValeant CEO Joseph Papa projects \"single digit pricing increase\" on certain drugs and $1 billion portfolio of key products will help the drug maker fight debt and exclusivity challenges. \n\"We received an approval for, really, what we think are seven fabulous products,\" Papa said on CNBC's \"Power Lunch.\" \"If all of these products get approved, we think it is going to be an over $1 billion opportunity.\" \nPapa took the reins of an embattled Valeant in 2016, amid accusations of fraud and price gouging in the company. \nSince then, he said he's put innovation at the forefront of a campaign to calm the tide of media attention and raise revenue in the face of mounting debt and the estimated $700 million lost from drug competition. \n\"When I started, it was about was 18 months ago, it was all about putting together a plan for multiple years. And what we said is we have to come out with new innovation,\" Papa said. \"We have been fortunate to do that to offset and some of the declines of loss of exclusivity that were going to happen.\" \nPapa is expected to discuss Valeant's recent performance and future Wednesday at the J.P. Morgan Healthcare Conference. A copy of Papa's presentation , published in advance online, identified seven significant products as Vyzulta, Lumify, and Ultra for Bausch + Lomb; Siliq, Duobrii and Jemdel from Ortho Dermatologics; and Relistor for Salix Pharmaceuticals. They are projected to raise more than $1 billion over the next five years \nPapa also said he anticipates the company will continue with price hikes, but with added awareness of its former reputation as a price gouger. Just last week, Valeant increased pricing on a number of drugs about 9 percent, an amount Papa called \"appropriate.\" \n\"We took a very appropriate response for what we needed to for pricing,\" Papa said, referring to the hike. \"We will continue with our patient access and pricing committee's stay to what we would refer to as a a single digit pricing increase.\" Chloe Aiello News Associate for CNBC.com Playing", "external_links": [], "published": "2018-01-09T21:50:00.000+02:00", "crawled": "2018-01-09T23:50:57.003+02:00", "highlightTitle": ""}