{"organizations": [], "uuid": "d8d5a59a9de1bc6fa15e292498cb11e141ed0ae6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938544-GettyImages-510811508.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/minneapolis-fed-proposes-massive-regulation-change-for-big-banks.html", "country": "US", "domain_rank": 767, "title": "Minneapolis Fed proposes massive regulation change for big banks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T18:16:00.000+02:00", "replies_count": 0, "uuid": "d8d5a59a9de1bc6fa15e292498cb11e141ed0ae6"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/minneapolis-fed-proposes-massive-regulation-change-for-big-banks.html", "ord_in_thread": 0, "title": "Minneapolis Fed proposes massive regulation change for big banks", "locations": [], "entities": {"persons": [{"name": "neel kashkari", "sentiment": "none"}, {"name": "chris goodney", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "venture capital minneapolis fed", "sentiment": "negative"}, {"name": "minneapolis fed", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "federal reserve bank of minneapolis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Minneapolis Fed proposes massive regulation change for big banks The Minneapolis Fed proposed a set of sweeping rules Wednesday that would increase capital requirements for big banks and tax shadow banks. The branch's president, Neel Kashkari, has been a vocal critic of major institutions, saying they continue to represent a systemic threat 10 years after the financial crisis. In the current deregulatory environment, the proposals stand little chance of getting approved. Chris Goodney | Bloomberg | Getty Images Neel Kashkari, president of the Federal Reserve Bank of Minneapolis \nThe Minneapolis Federal Reserve proposed a set of sweeping new regulations Wednesday aimed at reducing the risk big banks pose to the economy. \nAt the core of the recommendations are higher capital requirements for the nation's largest financial institutions, as well as a reduction in burdens for smaller regional and community banks. The proposals also take aim at so-called shadow banks — nonbank lenders — which are targeted for sharp taxes on the bigger firms. \nIn total, the proposal offers a contrast with the current regulatory aims of the White House, which is seeking to reduce many of the banking rules imposed by the Dodd-Frank reforms, adopted in the wake of the 2008 financial crisis. Incoming Fed Chairman Jerome Powell also has indicated that a lighter touch is likely for regulations. \n\"With today's strong economy, now is the perfect time to act to strengthen our financial system,\" Minneapolis Fed President Neel Kashkari said in a statement. \"We must not wait, and we must not go backwards. If we wait until the next crisis to implement these reforms, it will be too late.\" \nHowever, the proposals are non-binding and likely face a high bar for approval. \n\"Kashkari's approach to bank capital is simplistic in the extreme. He doesn't seem to understand that we've already de-risked the banking system to a large degree,\" said Christopher Whalen, head of Whalen Global Advisors, an investment banking and consulting services firm for institutional investors. \"What he's proposing is unnecessary and I doubt it would ever get any support in Washington.\" \nKashkari has long railed against big banks, arguing that even the sweeping Dodd-Frank bill did not end the issue of too big to fail. \nUnder the proposal released Wednesday, banks with assets of more than $250 billion — the top 13 institutions — would be required to issue equity equaling 23.5 percent of risk-weighted assets, with a leverage ratio of 15 percent, or nearly double the current 8 percent requirement. Doing so would reduce the chances of a public bailout from 67 percent to 39 percent, according to the Fed branch's calculations. \nThe plan also would call on the Treasury secretary to declare that large banks \"are no longer systemically important,\" a vital provision that would determine whether those institutions would get a publicly funded rescue. Those banks that aren't certified, and thus open to bailouts, would be required to increase their capital ratios to as high as 38 percent. \n\"Kashkari has been banging on this drum for a while. His solution is looking for a problem,\" said Whalen, who added that he would like to publicly debate Kashkari on the proposal. Whalen pointed out that Kashkari already has run for governor of California, and may have future political ambitions. \"I don't think Mr. Kashkari's proposal has any chance of success. He's clearly playing to a progressive audience, which also doesn't understand any of these things.\" \nKashkari was not availble for reaction to Whalen's comments. \nDuring a presentation Tuesday, Kashkari acknowledged that he has been politically active but said he and his family have settled in Minnesota and he is enjoying his job. \nAlso under his proposal, shadow banks also would come under increased scrutiny, with those having assets greater than $50 billion subject to a 1.2 percent tax on borrowings. Those that the Treasury secretary refuses to certify as systemically important would face a 2.2 percent tax. \nFinally, the Minneapolis plan calls for a reduction in \"unnecessary regulatory burden\" on community banks. \n\"The plan would fundamentally change the nature of community bank supervision, effectively limiting supervision to those aspects of community banking that pose real risk,\" the Fed branch said. \nThe proposals follow a two-year review by the Minneapolis Fed that sought to address the \"continuing risk\" posed by too big to fail institutions. \n\"After witnessing the economic devastation from the 2008 financial crisis, I am committed to working with other policymakers to strengthen our financial system and reduce the danger of a future crisis,\" Kashkari said. \nWATCH: Kashkari explains his position on interest rates . show chapters", "external_links": [], "published": "2018-01-10T18:16:00.000+02:00", "crawled": "2018-01-10T18:36:17.018+02:00", "highlightTitle": ""}