{"organizations": [], "uuid": "23b8287bb35798906ec62f3452af76c79b249e49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/12/104894234-GettyImages-684377042.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/advisors-heres-how-to-assess-your-portfolio-in-a-bull-market.html", "country": "US", "domain_rank": 767, "title": "The market may still be rosy, but advisors say investors shouldn't get complacent.", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T16:24:00.000+02:00", "replies_count": 0, "uuid": "23b8287bb35798906ec62f3452af76c79b249e49"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/advisors-heres-how-to-assess-your-portfolio-in-a-bull-market.html", "ord_in_thread": 0, "title": "The market may still be rosy, but advisors say investors shouldn't get complacent.", "locations": [], "entities": {"persons": [{"name": "lynn ballou", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "lafayette", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "none"}, {"name": "ep wealth advisors", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks are off to a strong start for 2018 — yet financial advisors say now isn't the time to get complacent.\nThe Dow briefly surpassed 26,000 for the first time Tuesday, and the S&P 500 and Nasdaq also hit record highs. That is, before U.S. stocks pulled back sharply in the afternoon on fears of a possible government shutdown, marking the Dow's biggest reversal since Feb. 10, 2016.\nUp markets represent a prime opportunity to stress-test your portfolio against future volatility and downturns, said certified financial planner Lynn Ballou, regional director at EP Wealth Advisors in Lafayette, California. Make sure you're comfortable with all the investments you're holding.\n\"We get lulled into complacency in times like this, … then we kick ourselves if there's a market correction,\" she said.\nAs part of that analysis, examine allocations to make sure they're in line with your time horizon and risk tolerance. That favorable stock performance may mean your portfolio has gotten more aggressive over time.\n\"If you're talking about a short-term goal of four years or less, I don't care how appetizing the market looks. Cash is your best friend.\" -Douglas Boneparth, Bone Fide Wealth \"Ask, 'Has my portfolio become unbalanced, because my equities have completely taken over the garden?'\" Ballou said. \"It's time to do some pruning and take some money off the table.\"\nGauging your tolerance for risk is especially key. For more risk-averse investors, forgoing some gains now might be preferable to the pain and panic of a market downturn, said certified financial planner Mark LaSpisa, president of Vermillion Financial Advisors in South Barrington, Illinois.\n\"The real question is, for the person that hasn't experienced a correction in the past nine years, how are they going to react?\" he said.\nDepending on your goals, strategically shifting your investments could help reduce risk and still meet return your objectives, LaSpisa said. For example, he said, an investor who only needs 3 percent to 5 percent to meet retirement income obligations — and has already benefitted from several years of above-average returns — may not need to chase double-digit returns or stay in riskier investments to achieve that goal.\nNorm Betts | Barcroft Images | Barcroft Media | Getty Images \"Why are we reaching for that return if it's not needed?\" LaSpisa said.\nKeep goal timelines in mind, too, both for current investments and money you're thinking of investing, said Douglas Boneparth, a certified financial planner and president of Bone Fide Wealth in New York.\n\"Long-term goals, the ones that are seven, 10 years plus … it's easier to remain unemotional because you have time on your side,\" he said.\nThose long-term investors can benefit from dollar-cost averaging, he said, continuing regular contributions into their retirement accounts, 529s and the like. But it's a different story for goals you need to fund on a short timeline.\n\"If you're talking about a short-term goal of four years or less, I don't care how appetizing the market looks,\" Boneparth said. \"Cash is your best friend.\"\nMore from Your Money, Your Future:\nThe best and worst states to retire \n5 key differences between Roth and traditional IRAs \nStudent loan nightmare: Some borrowers have to start over", "external_links": [], "published": "2018-01-17T16:24:00.000+02:00", "crawled": "2018-01-17T16:50:06.005+02:00", "highlightTitle": ""}