{"organizations": [], "uuid": "ecee17f7d1814882b39e34d93fcd88cfd0927d3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/10/104835933-GettyImages-118788349.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/bank-of-america-raises-its-2018-stock-market-forecast.html", "country": "US", "domain_rank": 767, "title": "Bank of America raises its 2018 market forecast after S&P 500 surpasses initial target in January", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T19:28:00.000+02:00", "replies_count": 0, "uuid": "ecee17f7d1814882b39e34d93fcd88cfd0927d3a"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/bank-of-america-raises-its-2018-stock-market-forecast.html", "ord_in_thread": 0, "title": "Bank of America raises its 2018 market forecast after S&P 500 surpasses initial target in January", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "bank of america", "sentiment": "negative"}, {"name": "s&p", "sentiment": "negative"}, {"name": "getty images  bank of america merrill lynch", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of America Merrill Lynch strategists say this could be a record year for merger activity, and corporate spending should help continue to fuel stock market gains.\nThe strategists Tuesday raised their target for the S&P 500 and said the long-awaited 'great rotation' of funds out of bonds and into stocks that would signal the end of the bull market still has yet to occur. Stocks valuations are elevated but are relatively cheap by a wide margin, compared to bonds, they say.\nThe strategists, among a few in CNBC's survey at the low end of Wall Street's range, have raised their S&P 500 target to 3,000 from 2,800, and are now in line with the median which had been at 2,975. \n\"While 2017 saw building optimism, 2018 may be the year of euphoria . While valuations have overshot fair value, sentiment is likely to be the most important driver of returns —typical of late stage bull markets,\" they wrote. They put fair value for year end 2018 at 2,636, and they have a long term S&P target of 3,500 by year end 2025.\nSince the start of the year, stocks have been hitting new highs, while bonds have been weaker. The 10-year yield was as high as 2.66 percent last week, the highest since 2014. On Tuesday, it was at 2.61 percent.\nThe tax bill has helped, leading to strong above average earnings revisions. \"With a strong pickup in earnings from repatriation and a lower corporate tax rate amid a sales recovery, we expect corporations to accelerate spending across all categories in 2018,\" they wrote.\nThey see two big potential surprises in corporate spending. They said merger activity could create a record year for mergers and acquisitions, and companies could spend excess cash to pay down their debt to reduce high debt levels as interest rates rise. They also expect debt reduction to be the biggest item that companies spend repatriation proceeds on, as a result of the tax law change requiring corporations to pay U.S. taxes on past profits kept overseas.\nBuybacks will be a top area, but there is also a strong case for capex.\nThe strategists note that the BofA monthly global fund managers' survey shows cash positions dropped to a five-year low of 4.4 percent, a contrarian indicator. They also point out that their own sell side indicator which reflects Wall Street strategists jump in equity allocation recommendations has risen by 5 points, also a contrarian indicator.\n\"But no need to panic yet — these indicators are still not at the extreme levels of bullishness that typically coincide with the end of bull markets,\" they wrote. They do expect more volatility, however, and recommend buying high quality stocks.", "external_links": [], "published": "2018-01-23T19:28:00.000+02:00", "crawled": "2018-01-23T19:35:01.032+02:00", "highlightTitle": ""}