{"organizations": [], "uuid": "665539e18c029a043bd6e95933e4718ec1295918", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Technology Is Everywhere. Tech Jobs? Not So Much. – Fortune", "url": "http://fortune.com/2018/01/07/hiring-tech-jobs-cities-talent/", "country": "US", "domain_rank": 1196, "title": "Technology Is Everywhere. Tech Jobs? Not So Much.", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-07T14:00:00.000+02:00", "replies_count": 0, "uuid": "665539e18c029a043bd6e95933e4718ec1295918"}, "author": "Vauhini Vara", "url": "http://fortune.com/2018/01/07/hiring-tech-jobs-cities-talent/", "ord_in_thread": 0, "title": "Technology Is Everywhere. Tech Jobs? Not So Much.", "locations": [], "entities": {"persons": [{"name": "kevin mershon", "sentiment": "negative"}, {"name": "mershon", "sentiment": "none"}], "locations": [{"name": "bakersfield", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "kern county", "sentiment": "none"}], "organizations": [{"name": "san jose state university", "sentiment": "none"}, {"name": "kern innovation and technology community", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Vauhini Vara 7:00 AM EST \nKevin Mershon, a 32-year-old entrepreneur in Bakersfield, Calif., has spent much of his adult life trying to persuade ambitious, technically oriented friends to stay in Bakersfield. He was raised there, went to college at San Jose State University to study computer science, then dropped out and—to the puzzlement of some friends—came home. Since then, he has become the acting director of Kern Innovation and Technology Community, an organization trying to build a tech community in Kern County, Bakersfield’s home, and the managing partner of Start With Bakersfield , a venture capital firm that invests in local startups. Yet despite all his pro-Bakersfield arguments (cheaper housing! chances to network with local power brokers!), Mershon keeps watching people leave for techier cities. It’s a chicken-and-egg problem of the highest order. Technical people won’t stay in Bakersfield because not enough companies will hire them or invest in their startups, and companies and investors won’t come to Bakersfield because they find the local tech talent unimpressive. Other cities have so much momentum that Mershon has concluded that Bakersfield and similar places are bound to fall further behind. “It’s just insurmountable,” he says. \nMershon’s pessimism is borne out by evidence. The latest comes from the Brookings Institution, which studied a database of computer skills (from database entry to coding software) used in various occupations, then made a map of “digital scores” for U.S. metropolitan areas. Bakersfield tied with Las Vegas for the lowest average score among large cities, while San Jose scored the highest. What is most striking is that, though people like Mershon have been laboring for years to bridge the digital gap between cities like San Jose and those like Bakersfield, it doesn’t seem to be fully working. The Brookings researchers ranked cities’ scores from 2002, then looked at how much each of those cities had improved as of 2016. They found that, in general, the cities whose scores used to be lowest have been closing the gap with the ones that used to be stronger, as technology infiltrates all kinds of occupations, from nursing to construction work. But when it comes to the highly digital employment that tends to be well-paid, like computer programming, San Jose and San Francisco are even further ahead now than they used to be. Nicolas Rapp \nStartups depend on venture capital funding, and that kind of investment is getting more concentrated in Silicon Valley—so that’s where startups tend to put their roots and start hiring. Also, because both startups and more established tech companies hire a relatively small number of super-talented, creative employees—the kind who can come up with moneymaking innovations—they tend to hire in the places, like San Francisco and San Jose, where those would-be employees are known to gravitate. Both these effects are compounded by the fact that tech has become a winner-take-all market, with companies like Google (googl) and Apple (aapl) consolidating their power—giving an advantage to the cities where they’re based. People benefit from “living and working in the right place,” says Mark Muro, a senior fellow at Brookings. “That’s always been true, but digital technologies have really amplified that effect.” \nIt’s an unsettling conclusion. People understand that a lot of well-paid blue-collar laborers and office workers have found their jobs automated into extinction, but we have consoled ourselves with the thought that all this change will create new jobs for the people who have been displaced. The Brookings finding confirms that while some technical jobs are going to some of the cities that have been most hollowed out, the best ones aren’t. Mershon, in Bakersfield, has started to feel that he should be encouraging the city’s brightest residents to leave town after all, to give them a shot at doing well. He consoles himself with the thought that Start With Bakersfield could at least invest in some of them before sending them off to become successful entrepreneurs elsewhere. \nA version of this article appears in the Jan. 1, 2018 issue of Fortune with the headline, “A Revolution of Have and Have-Nots.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-07T14:00:00.000+02:00", "crawled": "2018-01-07T14:00:54.001+02:00", "highlightTitle": ""}