{"organizations": [], "uuid": "04036538d30578dc545ff6dcd6a573a0358dc9a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962053-_sites_default_files_images_104009645-Untitled-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/democrats-warn-russia-trying-to-influence-mueller-investigation.html", "country": "US", "domain_rank": 767, "title": "Russia is attempting to influence Mueller investigation in an 'ongoing attack,' Democrats say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T20:11:00.000+02:00", "replies_count": 0, "uuid": "04036538d30578dc545ff6dcd6a573a0358dc9a8"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/democrats-warn-russia-trying-to-influence-mueller-investigation.html", "ord_in_thread": 0, "title": "Russia is attempting to influence Mueller investigation in an 'ongoing attack,' Democrats say", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "jack dors", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "dianne feinstein", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "schiff", "sentiment": "none"}, {"name": "jack dorsey", "sentiment": "none"}, {"name": "feinstein", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "square", "sentiment": "negative"}, {"name": "cnbc facebook", "sentiment": "negative"}, {"name": "senate intelligence committee", "sentiment": "none"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two top Democrats sent a plea for help on Tuesday to the CEOs of Twitter and Facebook , warning of Russia-linked social media accounts' attempts to influence investigations into Russian election meddling.\n\"It is critically important that the Special Counsel's investigation be allowed to proceed without interference from inside or outside the United States,\" said Sen. Dianne Feinstein and Rep. Adam Schiff , both of California, in the letter, referring to the probe by Robert Mueller .\nFeinstein is a member of the Senate Intelligence Committee. Schiff is the ranking member of the House Intelligence Committee. Both committees are conducting their own investigations into Russian interference during the 2016 presidential election.\nshow chapters Here are some explosive allegations from the latest testimony on the Trump dossier 12:51 PM ET Fri, 19 Jan 2018 | 00:37 The letter, addressed to Facebook CEO Mark Zuckerberg and Twitter CEO Jack Dorsey , follows an admission from a Facebook product manager that there's no assurance that the social media site is even good for democracy.\n\"I wish I could guarantee that the positives are destined to outweigh the negatives, but I can't,\" Samidh Chakrabarti wrote Monday .\nBoth companies have found themselves at the center of a national conversation about the increasing role of social media in politics — and their vulnerability to influence from foreign actors.\nNumerous U.S. spy agencies have unanimously agreed that Russia attempted to influence the outcome of the 2016 presidential election, in part through a deliberate campaign of false news stories on social media.\nshow chapters Trump: 'No collusion' happening between me and Russia 5:04 PM ET Wed, 10 Jan 2018 | 01:36 President Donald Trump has shown some reluctance to recognize the intelligence agencies' conclusions. In November, Trump said he believes the findings of the agencies \"as currently led\" by his appointees.\nThe Democrats' warning to the tech leaders cites real-time analytics from the website Hamilton 68 as evidence for their concern . The site , named after one of the Federalist papers authored by founding father Alexander Hamilton, claims to track 600 Twitter accounts \"linked to Russian influence operations.\"\nThe House Intelligence Committee last week allowed members of Congress to read a memo allegedly detailing abuses of the Foreign Intelligence Surveillance Act (FISA) by the FBI . A number of Republicans who read the memo expressed shock and outrage in public comments, though the still-classified memo prohibited them from naming specific allegations\n\"The facts contained in this memo are jaw-dropping and demand full transparency,\" Rep. Matt Gaetz, R-Fla., said Friday.\nshow chapters 'Fire and Fury' author Michael Wolff: I don't know if Trump colluded with Russia 2:57 PM ET Tue, 9 Jan 2018 | 02:19 In due course, the hashtag #releasethememo went viral. Among the 600 monitored accounts, use of the hashtag increased by nearly 300,000 percent in just over two days , Hamilton 68's analytics showed.\n\"If these reports are accurate, we are witnessing an ongoing attack by the Russian government through Kremlin-linked social media actors directly acting to intervene and influence our democratic process,\" Feinstein and Schiff said.\nA source familiar with the situation, however, told CNBC that the majority of engagement for the hashtag appears to be \"organic in nature,\" driven more by prominent conservatives than by Russian influence.\nHannity tweet\nTrump Jr. tweet\nThe California Democrats requested that the two companies conduct their own investigation into the scope of the Russian influence campaign — and that they submit a public report to Congress by Friday.\nThey also urged the CEOs to deactivate accounts deemed to have been involved in the alleged campaign.\nA Twitter spokesperson said the company \"is committed to addressing malicious activity on our platform,\" and takes the accusations seriously. Facebook received the letter, a spokesperson told CNBC in an email.\nRep. Devin Nunes, R-Calif., chairman of the House Intelligence Committee, did not immediately respond to a request for comment.\nRead the full letter: WATCH: If Russia probe goes near Trump's finances, 'he's sunk,' 'Fire and Fury' author Michael Wolff says\nshow chapters If Russia probe goes near Trump's finances, 'he's sunk,' 'Fire and Fury' author Michael Wolff says 2:43 PM ET Tue, 9 Jan 2018 | 01:09", "external_links": [], "published": "2018-01-23T20:11:00.000+02:00", "crawled": "2018-01-23T20:27:59.020+02:00", "highlightTitle": ""}