{"organizations": [], "uuid": "be1aaef1dc65ce46277d8b0c45b19b0f42e72738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939218-GettyImages-903485042.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/trumps-racial-provocations-helped-to-vault-him-to-the-white-house.html", "country": "US", "domain_rank": 767, "title": "Trump's racial provocations, so shocking in the White House, helped get him there", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T23:08:00.000+02:00", "replies_count": 0, "uuid": "be1aaef1dc65ce46277d8b0c45b19b0f42e72738"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/trumps-racial-provocations-helped-to-vault-him-to-the-white-house.html", "ord_in_thread": 0, "title": "Trump's racial provocations, so shocking in the White House, helped get him there", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "brendan smialowski", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "erna solberg", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Brendan Smialowski | AFP | Getty Images President Donald Trump speaks during a news conference with Prime Minister of Norway Erna Solberg at the White House in Washington, DC on January 10, 2018. \nIn a large, diverse country, campaigns span a broad array of interests and motivations. But the political foundation of Donald Trump 's presidency was racial grievance. \nTrump has repeatedly appealed to unhappy whites with his denunciation of Mexican immigrants, his defense of white supremacist protesters, and his attacks on black athletes protesting for racial justice. Thursday's Oval Office excoriation of \"s---hole countries\" in Africa and the Caribbean simply followed that pattern . (Trump appeared to deny making the comment on Friday, although some senators in the room at the time pushed back against him ). \nAs a candidate and as president, Trump has sounded plenty of race-neutral themes, including the call for tax cuts that culminated in landmark legislation last month. But some political science research has shown that his blunt race-tinged messages were the reason he vaulted past an experienced lineup of rivals to win the 2016 Republican nomination and then the White House. \nEmily Ekins, director of polling at the libertarian Cato Institute, identified five groups of Trump voters as part of a broader Democracy Fund study of the 2016 election. Key to his emergence, she concluded, was the 20 percent segment she called \"preservationists,\" who stood out for their \"nativist and ethno-cultural conception of American identity.\" \n\"American Preservationists comprise the core Trump constituency that propelled him to victory in the early Republican primaries,\" Ekins wrote. \nShe characterized them as having low levels of education, income and political information, watching lots of television, and offering strong professions of Christian faith combined with infrequent church attendance. With many of them disabled and on Medicaid, they display hostility toward Wall Street, support for redistribution of wealth, and concern about their government retirement benefits. \nTheir economic views help explain Trump's pledge not to touch Social Security and Medicare benefits. Their social views explain where they found kinship with him. \n\"They are far more likely to have a strong sense of their own racial identity,\" Ekins wrote. \"They take the most restrictionist approach to immigration – staunchly opposing not just illegal but legal immigration as well, and intensely supporting a temporary Muslim travel ban. \n\"They feel the greatest amount of angst over race relations. They believe that anti-white discrimination is as pervasive as other forms of discrimination.\" \nIn some ways, the emergence of a Republican nominee with Trump's instincts and support base represents the logical conclusion to decades of political evolution in a steadily diversifying nation. \nAs late as 1960, Republican candidate Richard Nixon drew a third of the black vote. But after Democratic president Lyndon Johnson won enactment of civil rights legislation over the opposition of Republican rival Barry Goldwater in 1964, voting patterns changed. \nNo Republican has reached 20 percent of the black vote since; no Democrat has carried a majority of whites. The \"Solid South,\" once controlled by Democratic segregationists rooted in the old Confederacy, switched parties to become a Republican redoubt. \nAn evolution toward social tolerance among younger Americans, on issues including sexuality as well as race, points toward diminished relevance of identity divisions over the long run. But anxiousness among whites – who have shrunk to 70 percent of the electorate from over 90 percent in the 1960s – will offer a tempting target for Trump-like Republicans as America becomes a majority-minority nation over the next three decades. \n\"By making questions of national identity more salient, Donald Trump succeeded in winning over 'populists' who had previously voted for Democrats,\" analyst Lee Drutman wrote in another part of the Democracy Fund study. \nTrump's success, which accelerated pre-existing trends, has given Republicans more blue-collar support and Democrats more allies among better-educated, more affluent suburbanites. That blurs some historic partisan splits over economics, while sharpening those the president continues to inflame. \n\"The primary conflict structuring the two parties,\" Drutman observed, \"involves questions of national identity, race and morality.\"", "external_links": [], "published": "2018-01-12T23:08:00.000+02:00", "crawled": "2018-01-12T23:23:20.009+02:00", "highlightTitle": ""}