{"organizations": [], "uuid": "5dfd78720814c76f8b7e04dd8c26388c14ec1a08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864902-RTX3K7Y6-jerome-powell.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/powell-taking-over-as-fed-chairman-at-time-of-economic-calm.html", "country": "US", "domain_rank": 767, "title": "Powell taking over as Fed chairman at time of economic calm", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:32:00.000+02:00", "replies_count": 0, "uuid": "5dfd78720814c76f8b7e04dd8c26388c14ec1a08"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/powell-taking-over-as-fed-chairman-at-time-of-economic-calm.html", "ord_in_thread": 0, "title": "Powell taking over as Fed chairman at time of economic calm", "locations": [], "entities": {"persons": [{"name": "jerome powell", "sentiment": "negative"}, {"name": "powell", "sentiment": "negative"}, {"name": "joshua roberts", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "senate banking, housing and urban affairs committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Powell taking over as Fed chairman at time of economic calm The Senate confirmed Jerome Powell to head the U.S. central bank. Powell will inherit an economy on a roll, a booming stock market and unemployment at a 17-year low. Janet Yellen will step down as Fed chairman on Feb. 3. Published 5 Hours Ago SHARES Joshua Roberts | Getty Images Jerome Powell testifies before the Senate Banking, Housing and Urban Affairs Committee on his nomination to become chairman of the U.S. Federal Reserve in Washington, November 28, 2017. \nIt would seem like a pretty good time to take over as chairman of the Federal Reserve. \nJerome Powell has won Senate confirmation to head the U.S. central bank, inheriting an economy on a roll, a booming stock market and unemployment at a 17-year low. \nHe will succeed Janet Yellen , the first woman to serve as Fed chairman, when her term ends on Feb. 3. The position is considered the government's most power economic job. \nBut while the immediate horizon appears clear, Powell faces the risk that today's sturdy economy, low inflation and rising stock market could reverse course in the coming months or years, forcing him to come up with the right remedies. \nOne of the biggest threats could come from inflation, which over the past six years has been extremely low. Some forecasters, however, worry that the days of benign inflation readings could be coming to an end, especially if tight labor markets lead to accelerating wage gains. \nThere is also the concern that the stock market, which has been soaring to record highs, could get thrown into reverse if investors begin to worry about rising interest rates. \nYellen and other Fed officials have emphasized that they hope to remain on a course of gradual rate hikes but they have warned that if inflation does start to accelerate, they may be forced to apply the brakes more forcefully by raising interest rates more quickly. \nThat is the type of scenario that in the past has brought an end to economic recoveries. And this expansion is already the third longest in U.S. history. But for the moment, those threats remain just that — threats. In fact, some Fed officials are not convinced that inflation is on the verge of picking up steam and in fact, they have argued that the central bank may need to slow down rather than accelerate its rate hikes. \nThat is the economic landscape that Powell inherits following his confirmation for the chairman's job by a Senate vote of 84-13 on Tuesday. \nPresident Donald Trump tapped Powell for the job after deciding against offering Yellen a second four-year term as chair despite widespread praise for her performance since succeeding Ben Bernanke. \nPowell, 64, has served for 5½ years on the Fed's board. A lawyer and investment manager by training, he will be the first Fed leader in 40 years without an advanced degree in economics. Many expect him to follow Yellen's cautious approach to interest rates. \nPowell, viewed as a centrist, enjoyed support from Republicans and Democrats. \nThe 13 senators who voted against Powell's nomination included four Republicans, eight Democrats and Sen. Bernie Sanders, an independent who votes with the Democrats. \nOne of the dissenters, Sen. Elizabeth Warren, D-Mass., said she was concerned that Powell \"will roll back critical rules that help guard against another financial crisis.\" \nDuring the presidential race, Trump was critical of the role the Fed played in implementing the Dodd-Frank Act, the 2010 law that tightened banking regulations after the 2008 financial crisis. Trump and many Republicans in Congress contended that the stricter regulations were too burdensome for financial institutions and were a key reason why economic growth since the Great Recession ended in 2009 had been lackluster. \nPowell has signaled that he favors ways to make bank regulations less onerous, especially for smaller community banks. \nTrump will be able to essentially remake the Fed's board during his first two years in office. He has already filled the key post of vice chairman for regulation with Randal Quarles. The president has also nominated Marvin Goodfriend, a conservative economist, for another vacancy on the board. \nIn addition, he can fill three more vacancies on the seven-member board, including the key spot of Fed vice chairman, which has been vacant since Stanley Fischer left in October. \nAll told, the vacancies will have given Trump the ability to fill six of the seven board positions with his own choices. Lael Brainard will remain the lone board member not to have been chosen by Trump. \nPowell, known as a collegial consensus-builder, could help serve as a steadying force for the U.S. economy as well as a unifying figure among the central bank's policymakers. As a Fed governor, Powell has never dissented from a central bank decision. \nEducated at Princeton University with a law degree from Georgetown, Powell, known as Jay, spent many years in investment management — at Dillon Read and then at the Carlyle Group. His work there made him one of the wealthiest figures to serve on the Fed board: His most recent financial disclosure form places his wealth at between $19.7 million and $55 million. And based on how government disclosures are drafted, his wealth may actually be closer to $100 million. ", "external_links": [], "published": "2018-01-24T17:32:00.000+02:00", "crawled": "2018-01-24T17:37:53.015+02:00", "highlightTitle": ""}