{"organizations": [], "uuid": "7c32f10cf27e70db0c8dcb4163df2bb3ce3e1338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 20}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934911-GettyImages-470284604.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000018/device/rss", "section_title": "China", "url": "https://www.cnbc.com/2018/01/08/tesla-is-a-threat-to-china-electric-car-maker-nio-cfo-louis-hsieh.html", "country": "US", "domain_rank": 767, "title": "Tesla is a 'threat,' but we're 'more than up to the challenge,' Chinese start-up says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T06:57:00.000+02:00", "replies_count": 0, "uuid": "7c32f10cf27e70db0c8dcb4163df2bb3ce3e1338"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/tesla-is-a-threat-to-china-electric-car-maker-nio-cfo-louis-hsieh.html", "ord_in_thread": 0, "title": "Tesla is a 'threat,' but we're 'more than up to the challenge,' Chinese start-up says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "12 Hours Ago | 02:52 \nTesla is gearing up to manufacture its cars in China, but one of its primary competitors there says it isn't sweating the competition. \nLouis Hsieh, CFO of Chinese electric vehicle start-up Nio, told CNBC Tuesday that he firmly believes his company is up to the challenge posed by Elon Musk's barrier-breaking car company. \nChina has always been seen as an attractive market: The sheer number of potential consumers has made it difficult for major companies to ignore the country. Tesla is no different, striking a deal last year to build a factory there. \n\"I think it's the right step for them, it would reduce their manufacturing and delivery cost,\" Hsieh said when asked if he felt Tesla would become a threat. \"We think that it will be a very competitive market and they need to be here as it's the largest car market in the world. And while it is a threat to us, we think we are more than up to the challenge.\" \nNio has told investors that it is targeting sales between 20,000 to 30,000 units within 9 months of 2018. So far, the start-up looks to be on track: Hsieh said Nio has already sold out of its first batch of 10,000 orders for the ES8 all-electric sport utility vehicle , which was only launched on Dec. 16. The local advantage \nNio enjoys an advantage over Tesla due to government support. Hsieh said Tesla has been seeking subsidies or tariff reliefs from China, but he predicted the company will not qualify. \nNio is subsidized approximately $48,000 Chinese yuan ($7,380) per car from the Chinese government, with additional cuts on a localized city-by-city basis. Johannes Eisele | AFP | Getty Images Tesla car dealership in Shanghai taken on March 17, 2015. \nWhen asked about the profitability of his company's vehicles, Hsieh said: \"On a gross margin basis, our vehicles will be profitable.\" \n\"Out of the box, they will be profitable. We will not sell the vehicles for less than we make it for,\" he added. \nThat said, he was also pragmatic in his assessment, noting that it will take Nio several more years to become profitable on a profit and loss basis. \nNio's ES8 is currently retailing for half the price of the Tesla model X. The competition heats up \nMajor manufacturers and established foreign car makers such as GM , Volkswagen, BMW and Mercedes are also eyeing the electric car market in China. \nHsieh said those companies could eventually become competitors to Nio, but the threat is currently only theoretical. \n\"Yes, they will be ... but you could ask me this in 2019 or 2020 because we are not here yet,\" he said. \"Everyone is announcing cars but no one has delivered a car except for Tesla and now, hopefully us in the next couple months.\" \nAnother Chinese start-up, Byton, has recently announced its entry into the market. Hsieh expressed less optimism about that company's target, predicting its goal of releasing an electric car by 2019 will be delayed. What does the future hold for Nio? \nHsieh also offered a glimpse into the company's future, highlighting plans for entry into the U.S. market in 2020. \n\"It will probably be our third car ... we plan to release one car every year,\" he said, adding that this would take place on a designated \"Nio Day\" every December. \nWhile there have been talks about an eventual U.S. initial public offering , Hsieh declined to comment to CNBC on the matter. Andrew Wong Special to CNBC Related Securities", "external_links": [], "published": "2018-01-09T06:57:00.000+02:00", "crawled": "2018-01-09T09:47:49.803+02:00", "highlightTitle": ""}