{"organizations": [], "uuid": "158c13a881653575dd1fd86a4adba8df7ee30f6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 40}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/10/101102402-20131009-6573-349.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/its-starting-to-feel-a-little-bit-like-2006-barclays-ceo-warns.html", "country": "US", "domain_rank": 767, "title": "It's starting to feel a little bit like 2006, Barclays CEO warns", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T11:05:00.000+02:00", "replies_count": 0, "uuid": "158c13a881653575dd1fd86a4adba8df7ee30f6f"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/its-starting-to-feel-a-little-bit-like-2006-barclays-ceo-warns.html", "ord_in_thread": 0, "title": "It's starting to feel a little bit like 2006, Barclays CEO warns", "locations": [], "entities": {"persons": [{"name": "speaki", "sentiment": "negative"}, {"name": "jes staley", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "barclays ceo", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sudden changes in volatility and monetary policy could spark an \"interesting\" period for stock markets in the next couple of years, the CEO of Barclays warned Thursday.\nSpeaking at the World Economic Forum in Davos, Jes Staley noted that financial conditions are somewhat reminiscent of the run-up to the global financial crash of 2008.\n\"Asset values such as the stock market are at all-time highs, every major industry around the world last year grew by more than 20 percent, volatility is at an historic low. And almost even more concerning than that — a lot of what's driving that low in volatility is people are selling short volatility,\" he said, implying that traders are betting that volatility could push even lower.\n\"So if you've got a lot of short positions at an all-time low level and something snaps, the velocity of recovery could be quite something to watch,\" he said.\nThe most common measure used to assess volatility in the U.S. is the VIX index, which has been persistently at low levels for the past year. This means that investors are relatively calm about the economic backdrop. However, many wonder if this is the calm before the storm and a market correction is around the corner. Even more so when people are selling \"a lot of\" short volatility, which indicates they do expect nervousness to pick up in the future.\nScott Eells | Bloomberg | Getty Images Staley told CNBC that given the high level of debt across the world, in particular among emerging markets where dollar-denominated debt has grown dramatically, many economies could be at risk if there were sudden changes in financial conditions.\n\"If interest rates were to move quickly, volatility was to move quickly it could be an interesting financial market in the next couple of years,\" he warned, earlier adding that \"this feels a little bit like 2006.\"\nWith central banks raising interest rates, debt levels increasing, and with a pick up in volatility, borrowing costs would also grow and could ultimately hurt many economies. Staley also argued that global economic growth and monetary policy need to re-balance in order to prevent a distortion in the markets.\n\"Global economic growth across the board is doing great at roughly 4 percent, unemployment rates in the U.K. and in the U.S. are at almost record lows. All that feels great,\" he said. But the current \"incredibly accommodating\" monetary policy is going to be \"built in everybody's equation,\" he added.\nshow chapters British government has not been blind to the importance of London: Barclays CEO 13 Hours Ago | 02:10", "external_links": [], "published": "2018-01-25T11:05:00.000+02:00", "crawled": "2018-01-25T11:12:42.010+02:00", "highlightTitle": ""}