{"organizations": [], "uuid": "8d7b77666e5b945c99205400d730deb9a671b9d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/02/104257630-GettyImages-94640674.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/chinas-middle-class-is-boosting-demand-for-avocados.html", "country": "US", "domain_rank": 767, "title": "Avocado sales could more than double this year, boosted by demand from China's middle class", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T21:47:00.000+02:00", "replies_count": 0, "uuid": "8d7b77666e5b945c99205400d730deb9a671b9d2"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/chinas-middle-class-is-boosting-demand-for-avocados.html", "ord_in_thread": 0, "title": "Avocado sales could more than double this year, boosted by demand from China's middle class", "locations": [], "entities": {"persons": [{"name": "susana gonzalez", "sentiment": "negative"}, {"name": "barnard", "sentiment": "none"}, {"name": "steve barnard", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "oxnard", "sentiment": "none"}, {"name": "michoacan", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "uruapan", "sentiment": "none"}, {"name": "jalisco", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "san lorenzo packing company", "sentiment": "negative"}, {"name": "california-based mission produce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Avocado sales to China are expected to more than double this year as demand continues to grow for the fruit from the country's expanding middle-class population.\n\"It appears to just double every year, from what we've seen,\" Steve Barnard, president of Oxnard, California-based Mission Produce, the world's largest distributor of avocados. \"It maybe more than double this year.\"\nAnd, the pace of growth shows no sign of slowing as more health-conscious consumers in the world's most populous nation show an interest in the \"heart-healthy\" avocados, executives say. The fruit also appeals to \"young, trendy people,\" said Barnard.\nOne big beneficiary of the growing demand is Mexico , the global leader in avocado production. Even through the U.S. market remains lucrative, avocado marketers in the Mexican state of Jalisco recently hosted a Chinese delegation in hopes of grabbing a piece of the action that now is dominated by the neighboring state of Michoacan.\n\"The Chinese market has been growing at a very fast pace,\" said Ramon Paz, an advisor for the Avocado Producers and Exporting Packers Association of Mexico (APEAM). \"Our numbers show big growth but the total absolute numbers are still modest compared to other markets like the U.S. But of course the potential is huge.\"\nAccording to Chicago-based researcher Technomic, \"Avocado has evolved into a trending ingredient worldwide and has particular resonance in China — where it's commonly known as butter fruit — due to its somewhat exotic positioning.\"\nMost of the demand in China is from \"urban consumers\" in the largest cities of Shanghai, Beijing and Guangzhou, said Paz. He said Chinese millennials who have traveled overseas also are helping to grow the market.\nStill, Paz said the U.S. market remains a priority market for Mexican shippers for several reasons, including shorter transportation time, reduced risks and generally more favorable payment arrangements too. That said, he also indicated that demand for avocados also is strong in Japan and parts of Europe.\nMexico plans to ship 1.8 billion pounds of avocados to the U.S. in the current 2017-18 season, which runs from July 1, 2017 to June 30, 2018, according to Paz. By comparison, Latin American countries as a group shipped about 76 million pounds of avocados last season to China.\nEven so, there's a risk that with all the Latin American avocados going to China it could one day increase the cost to American consumers. Mexican-grown avocados account for almost 80 percent of the creamy fruit sold in the U.S. market.\n\"It could affect it, yes, because it's pulling product out of Chile, Peru or Mexico that would would be available to ship here,\" said Barnard. And he added, \"The Chinese pay pretty good — you get a premium.\"\nThe wholesale prices of avocado in the United States more than doubled last fall due to supply hiccups in Mexico. Supplies from Mexico ended up about 20 percent below the average last season and California's harvest was about half its usual amount, according to Paz.\n\"When you see 20 percent less, it has an impact in the market,\" said Paz. \"We had a short crop basically because avocados have a tendency to produce more one year and less the next year. This year the Mexican crop is back to normal and California is forecasting a regular crop, although they had some problems with the recent wildfires.\"\nDespite last year's higher prices, demand didn't fall off as Americans appear to be willing to pay more for their avocado and guacamole. Paz estimates avocado demand in the U.S. is growing about 10 to 12 percent per year.\nExecutives say there's also demand for avocados coming from other parts of Asia as well as Europe along with countries such as Argentina, which in the past two years has increased exports by around 50 percent from Chile.\n\"Between the nutrition and the health benefits and the versatility of use, avocados is obviously one of the fastest-growing produce items in the world as far as consumption,\" said Barnard.\nMission, which is privately held, grows, packs and ships avocados all over the world and has production operations in Chile, Peru, Mexico, Colombia, Guatemala and the United States.\nSaid Barnard, \"As someone right in the middle of it, we're continuing to increase supply because we don't see this thing slowing down any.\"\nBarnard believes the retail prices of avocados in the U.S. will average \"significantly lower\" in 2018 compared with 2017. \"If you get it down to around a dollar apiece for a medium-sized fruit, the stuff will fly off the shelves.\"\nPer capita consumption in the U.S. of avocados is around 7 pounds per person, up from 4 pounds in 2010, according to the U.S. Department of Agriculture. And produce executives say China is just a fraction of that amount today but if it approached the American levels it would be about 10 times the amount of fruit produced in the world.\nSource: Mission Produce Display of the avocados at a fruit store in China. Meantime, more avocados entering the Chinese market this year will get sent to ripening rooms in large distribution centers to allow the green fruit to become ready-to-eat. A drawback before the ripening rooms was Chinese consumers having to wait for the fruit to ripen before consuming it.\n\"The ripe fruit is growing much faster than unripe fruit, for obvious reasons — same as it does here,\" said Barnard. \"We put a ripening distribution center over there last March, and we're already adding a second one.\"\nMission Produce sends full containers of avocados packed either in Mexico, Chile or Peru to China and then refrigerates it. \"Upon demand, we'll ripen it and ship it out to the customers,\" said Barnard.\nThe ripening process for avocados is similar to bananas shipped green from Latin America that are then put into special ripening rooms to make them ideal for eating. Nature's ripening process is stimulated by using ethylene, which is a natural gas, along with ideal heat, humidity and airflow.\nMission first started selling into the Chinese market about four years ago and has two local partners for its ripe avocado brand, Mr. Avocado, in the Asian country. The U.S. company's joint venture partners include Chinese importer Lantao and a local retailer Pagoda, operator of 2,500 fruit-shop outlets.\n\"I have been in those fruit shops and you see a little bit of everybody buying,\" said Barnard. \"You see mothers and college kids. They eat pretty healthy over there — a lot of vegetables. And the fruit just adds another variable to the diet.\"\nThe Mr. Avocado brand has been using social media advertising in China to spread awareness of avocados and their health benefits. They also are doing suggestions on how to eat the fruit.\nInterestingly, the Chinese also have some avocados grown within their borders in regions such as Guangxi, located north of Vietnam. There also have been state-run farms doing trial plantings over the decades, even before significant demand existed in the domestic market.\n\"They have some trials in the south,\" said Barnard. \"We're monitoring it.\"\nHe said the Chinese \"have a big learning curve to go over\" to launch large-scale avocado production and also would face logistical challenges since production is \"in the middle of nowhere.\"\nThe avocado plant found in China is largely a tropical variety and similar to th", "external_links": [], "published": "2018-01-10T21:47:00.000+02:00", "crawled": "2018-01-10T23:12:37.020+02:00", "highlightTitle": ""}