{"organizations": [], "uuid": "5fb63a33e55de9f92353456fb1cd917e15121c6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/08/101096492-120773487.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/cramer-too-many-stocks-and-too-little-cash-can-set-you-up-for-failure.html", "country": "US", "domain_rank": 767, "title": "Cramer says owning too many stocks and too little cash can set you up for failure", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T01:54:00.000+02:00", "replies_count": 0, "uuid": "5fb63a33e55de9f92353456fb1cd917e15121c6a"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/cramer-too-many-stocks-and-too-little-cash-can-set-you-up-for-failure.html", "ord_in_thread": 0, "title": "Cramer says owning too many stocks and too little cash can set you up for failure", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Every morning at his old hedge fund, CNBC's Jim Cramer would spend a few hours going over the mistakes he made the day before.\n\"I would analyze every losing trade — you don't need to analyze the winners, they take care of themselves — [and] I'd try to figure out how I could've made more money or, much more importantly, lost less money,\" the \" Mad Money \" host said.\nAfter a few years of this routine, something finally dawned on him.\n\"I realized that good performance could be linked directly to having fewer positions,\" Cramer said. \"When we owned fewer stocks, we tended to make more money.\"\nEver since, Cramer hasn't bought a stock without taking a different one off the table, even for his ActionAlertsPlus.com charitable trust.\nLimiting your holdings can be a great tool for investors that don't have the time or the drive to do their homework for 20 or 30 different companies, Cramer said.\nThat said, not owning too many stocks comes with a price, too.\n\"It can be constraining,\" Cramer acknowledged. \"You'll end up selling some stocks that are good for stocks that aren't as good. I know that. Hindsight's 20-20. But take it from me: as someone who's owned stocks for 40 years, it's far more likely that you'll be selling marginal companies in order to get bigger in better ones.\"\nCramer's rule of thumb is that if you're an individual investor and own more than 10 stocks, you might want to consider paring back.\nWhat should you do with the leftover money? Heed another key Cramerism and keep some cash on hand.\n\"Cash is for winners,\" the \"Mad Money\" host said. \"You don't like the market? You don't like any sectors? Then sell stock, raise cash.\"\nAfter decades in the business, Cramer has found that putting cash to work when the market's low is often a much better strategy than buying put options or shorting stocks.\nInvestors don't need to bend themselves backwards to hedge against risk. Sometimes, it can be as simple as selling some stocks and getting some cash on hand.\n\"Go sit on the sidelines – nothing wrong with that – [and] wait for the situation to improve. Believe me, it's never the wrong call when you don't like the tape or you can't find anything that truly makes sense for you,\" Cramer concluded. \"The bottom line? Always be careful not to own too many stocks, and not to have too little cash.\"\nWATCH: Cramer on the benefits of having cash on the sidelines show chapters Cramer says owning too many stocks and too little cash can set you up for failure 18 Hours Ago | 06:08 ", "external_links": [], "published": "2018-01-26T01:54:00.000+02:00", "crawled": "2018-01-26T02:11:17.024+02:00", "highlightTitle": ""}