{"organizations": [], "uuid": "be1e7574cef770c1048852d743ce23b89cb15415", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104910223-GettyImages-895774708.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/us-army-files-complaint-against-nhl-team-vegas-golden-knights.html", "country": "US", "domain_rank": 767, "title": "The US Army files a complaint about the team name and colors of NHL's Vegas Golden Knights", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T21:11:00.000+02:00", "replies_count": 0, "uuid": "be1e7574cef770c1048852d743ce23b89cb15415"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/us-army-files-complaint-against-nhl-team-vegas-golden-knights.html", "ord_in_thread": 0, "title": "The US Army files a complaint about the team name and colors of NHL's Vegas Golden Knights", "locations": [], "entities": {"persons": [{"name": "marc-andre fleury", "sentiment": "none"}, {"name": "james neal", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "nhl", "sentiment": "negative"}, {"name": "us army", "sentiment": "negative"}, {"name": "national hockey league", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "t-mobile arena", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "vegas golden knights", "sentiment": "none"}, {"name": "tampa bay lightning", "sentiment": "none"}, {"name": "army golden knights", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Vegas Golden Knights, in its inaugural season as a National Hockey League team, is in first place in the Western Conference. Its home games sell out, its merchandise flies off the shelves, and two players, Marc-Andre Fleury and James Neal, are going to the All-Stars.\nBut all is not golden. The U.S. Army has just filed a formal complaint about the Vegas Golden Knights' name and team colors, saying they are too similar to those of the Army's parachute team.\n\"We strongly dispute the Army's allegations that confusion is likely between the Army Golden Knights parachute team and the Vegas Golden Knights major-league hockey team,\" the Vegas Golden Knights said in a statement to CNBC. \"Indeed, the two entities have been coexisting without any issues for over a year (along with several other Golden Knights trademark owners)….\"\nThe NHL told CNBC, \"We believe the underlying rationale of the Army's opposition isn't valid as a legal matter, and we intend to fully support Vegas' efforts to clarify their rights.\"\nFor its part, the Army said the complaint is part of a dispute resolution.\n\"The U.S. Army has been working with the team and the NHL for over a year to resolve any potential trademark issues,\" Alison Bettencourt, director of public affairs for the Army Marketing and Research Group, told CNBC. \"The legal action taken on Wednesday is part of the normal legal process and was necessary to protect the U.S. Army's rights as we continue to resolve any potential trademark disputes.\"\nStaff Sgt. Christopher S. Muncy | US Air National Guard United States Army Parachute Team conducts jump over Washington D.C. It's not the first time the Vegas team has encountered a backlash against its name. The College of St. Rose in Albany, New York, has been using the name Golden Knights since 2002. In 2004, it was granted a federal trademark.\nIn 2016, the U.S. Patent and Trademark Office rejected the hockey team's attempt to register for a trademark, on the basis that it would likely cause confusion with the previously registered Golden Knights mark.\nJulian Perlman, a litigation partner at Phillips Nizer LLP in New York, advises companies on issues of trademark and copyright protection. The Army, he said, doesn't \"want people thinking that this Vegas expansion team has the endorsement [of] or association with the Army's parachute team.\"\nBut Perlman predicted it would be a tough battle for the Army. \"If they were going to litigate this case and try to stop them from using the mark, they would have to show evidence of confusion.\"\nIndeed, in its statement to CNBC, the Vegas Golden Knights organization said, \"We are not aware of a single complaint from anyone attending our games that they were expecting to see the parachute team and not a professional hockey game.\"\nPerlman interpreted the Army's statement as an indication that it's actively negotiating with the NHL expansion team. \"Perhaps they're well on their way to a resolution, but it hasn't gotten completely hammered out. They still have to protect their rights.\" And part of protecting those rights is adhering to the process.\nPerlman said the vast majority of trademark disputes are settled without the intervention of the USPTO.\nStill, it might sting the owner of the Golden Knights, Bill Foley, who told CNBC in December how proud he was of his association with the military as a graduate of the United States Military Academy at West Point. He also served in the U.S. Air Force, and reportedly was actively working to get the Golden Knights parachute team to perform in Las Vegas, in connection with the launch of the hockey team.\nIt might be of some comfort to the Vegas Golden Knights as they work through the process of the application for a federal trademark to know the Army's Golden Knights don't have a trademark either.", "external_links": [], "published": "2018-01-12T21:11:00.000+02:00", "crawled": "2018-01-13T00:30:37.000+02:00", "highlightTitle": ""}