{"organizations": [], "uuid": "88a3447e50b3222555dbc9cd17d1f27b4027d02d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962559-GettyImages-842949768.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/how-to-use-siri-to-tell-you-music-sports-and-business-news.html", "country": "US", "domain_rank": 767, "title": "You can now ask Siri to recite music, sports and business news -- here's how", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T22:56:00.000+02:00", "replies_count": 0, "uuid": "88a3447e50b3222555dbc9cd17d1f27b4027d02d"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/how-to-use-siri-to-tell-you-music-sports-and-business-news.html", "ord_in_thread": 0, "title": "You can now ask Siri to recite music, sports and business news -- here's how", "locations": [], "entities": {"persons": [{"name": "siri", "sentiment": "negative"}, {"name": "todd haselton", "sentiment": "negative"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "npr", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You can now ask Siri to recite music, sports and business news -- here's how SHARES Todd Haselton | @robotodd Published 25 Mins Ago iOS 11.2.5, a new update available today for iPhones and iPads, lets you ask Siri to recite the news. Unlike earlier versions, you can now get sports, music and business news, too. Here's how to ask Siri to tell you the news. UberImages | Getty Man listening to a podcast \nApple rolled out an update for iPhones and iPads on Tuesday, iOS 11.2.5, which lets you ask Siri to play a variety of news content. \nIt builds on a feature introduced in the last update, iOS 11.2.2, which let you ask Siri to recite the news but was limited to content from select sources. Now you can ask it to play music, sports and business news, too. \nHere's how. First, make sure you're updated to iOS 11.2.5. Todd Haselton | CNBC \nYou can do this by visiting Settings > General > Software Update. Next, ask Siri to play the news. Todd Haselton | CNBC Siri plays the news. \nSimply say \"Siri, play new news,\" and it will default to playing news from NPR in the United States, but you can say \"switch to The Washington Post,\" \"switch to Fox news\" or \"switch to CNN,\" too. The feature is currently only supported in the U.S., UK and Australia. Now ask Siri to play sports, business or music news Todd Haselton | CNBC Siri plays music news. \nYou can switch it up, too, by saying \"Siri, play me sports news,\" or \"Siri, play me music news,\" and it will pull from ESPN and Apple Music, respectively. It also defaults to CNBC if you ask for business news. It'll automatically play the latest podcast from the Apple's podcast application. Coming soon to HomePod Getty Images A prototype of Apple's new HomePod is displayed during the 2017 Apple Worldwide Developer Conference (WWDC) at the San Jose Convention Center on June 5, 2017 in San Jose, California. \nThe feature is almost certainly one that was developed for Apple's smart HomePod speaker, so expect it to appear there when the device launches early next month .", "external_links": [], "published": "2018-01-23T22:56:00.000+02:00", "crawled": "2018-01-23T23:15:05.029+02:00", "highlightTitle": ""}