{"organizations": [], "uuid": "72315776c7d38afd33d1847c06377291f11172fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 473, "shares": 473, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104964753-P1040335.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/speakeasy-with-john-harwood-bill-kristol-on-age-of-trump.html", "country": "US", "domain_rank": 767, "title": "Bill Kristol was once the voice of the Republican Party. Now he's one of Trump's biggest opponents", "performance_score": 4, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "72315776c7d38afd33d1847c06377291f11172fe"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/speakeasy-with-john-harwood-bill-kristol-on-age-of-trump.html", "ord_in_thread": 0, "title": "Bill Kristol was once the voice of the Republican Party. Now he's one of Trump's biggest opponents", "locations": [], "entities": {"persons": [{"name": "tucker carlson", "sentiment": "negative"}, {"name": "bill kristol", "sentiment": "neutral"}, {"name": "harwood", "sentiment": "none"}, {"name": "barry goldwater", "sentiment": "none"}, {"name": "lyndon johnson", "sentiment": "none"}, {"name": "kristol", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "republican party", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Before Donald Trump came along, Bill Kristol exemplified virtually all the leading elements of the modern Republican Party.\nAfter watching his father, Irving, help found the neoconservative movement, he joined the Reagan administration as an aide to Education Secretary William Bennett, a leading figure on the cultural right. Later, as chief of staff to Vice President Dan Quayle, he pressed President George H.W. Bush from the right on taxes.\nIn 1993, at the newly minted Project for the Republican Future, he helped direct the party's successful effort to block President Bill Clinton 's health-care plan. He launched the conservative magazine The Weekly Standard and became a commentator for Fox News. He staunchly backed President George W. Bush 's Iraq War and promoted Sarah Palin for the vice presidency in 2008.\nPat Anastasi | CNBC Bill Kristol speaks with CNBC'S John Harwood at the Mayflower Hotel's Edgar Bar & Kitchen in Washington, D.C. Now, at 65, Kristol has made a radical break. Alarmed at Trump's policies and methods, he has become a leading voice of Republican opposition. That has damaged old friendships and made new ones. Kristol now offers analysis on MSNBC. He is re-examining old assumptions about fellow conservatives and Republicans — and contemplating new possibilities for progress in the political center.\nWe talked over beers at the Mayflower Hotel near the White House — the same hotel where he and others decided a quarter-century ago to launch the magazine he still serves as editor-at-large. What follows is a condensed, edited transcript of our conversation.\nCNBC's John Harwood: Your dad once said that \"a neoconservative was a liberal who had been mugged by reality.\" What happened to you?\nBill Kristol: I'm a conservative who's been mugged by Trump. But I still think I'm a conservative. I'm trying to uphold what was true about conservatism. I consider myself a Reagan conservative.\nHarwood: You don't think your politics have changed?\nKristol: No, not much. I mean, pro-American leadership in the world. Anti-America First. Pro free trade pretty much. Moderate on immigration. Limited government, constitutional government.\nIn terms of the conservative movement, I do think it would be foolish to deny that Trump has exposed certain aspects of that movement as less healthy than I thought or hoped.\nHarwood: What has Trump exposed about conservatism?\nKristol: It's a big movement. So maybe one shouldn't be surprised. But there are parts that I think were suppressed before that have come more to the fore. Some bigotry, some close-mindedness, some intolerance, backward-looking aspects of the movement.\nTo the credit of the Republican Party and the conservative movement, people have been expelled or marginalized. Pat Buchanan in the '90s. Ron Paul, Rand Paul in the first decade of this century. Bill Buckley famously expelled the Birchers in 1964. It's been a movement that's tried to maintain its boundaries.\nBut it turned out there were elements there that Trump appealed to. He's an effective demagogue. And then the rationalization of Trump, acceptance of Trump by so many Republicans and some conservatives, including conservatives I worked with and respect, has been disturbing to me.\nHarwood: Through your father, who was part of a movement that had a big effect on the nature of the two-party system, you were present at the creation of the Democratic and Republican parties as we knew them to develop during our lifetimes. How would you chart that journey?\nKristol: There are obviously a lot of aspects and elements. But I just think Trump matters a lot. That is, as, if Trump had run in 2015 and lost the way other outside businessmen ran and lost, the way demagogues I would say like Buchanan or Ron Paul ran and lost, and Marco Rubio or Jeb Bush or Scott Walker or any of these people had been the nominee, I think anyone would have said, \"You know what? Actually, what's striking is the continuity of the party.\"\nIf he won the nomination and then lost, it could have been, \"OK, well, that was sort of a weird year. He lost.\" You just can't underestimate the importance of one person winning the nomination, and then especially winning the presidency, and especially then not accommodating to the norms that one expected a president to accommodate to.\nAnd then having so many people — senators, congressmen, some conservative leaders — deciding, \"OK, well, those norms didn't matter as much, and Trump won, so we're just signing on to a populist demagogue.\"\nRead more from John Harwood's interview with Bill Kristol:\nKristol on Sarah Palin\nKristol on businesses kissing up to Trump\nKristol on Fox News\nHarwood: You talked about bigotry. An important event in the development of the two parties as they exist today was the break that occurred in the mid-'60s when Barry Goldwater went one way and Lyndon Johnson went another on civil rights. Was that the origin of what became the Trump cultural appeal on immigration and on race?\nKristol: Yes, and clearly the party's more Southern. But I think it's unfair to say that for 50 years this has been sort of just racism or bigotry. There are absolutely legitimate arguments on some of these policy issues for limited government — not having racial preferences or limiting them in public institutions and so forth. One hoped those were arguments people were making on principle. Some of them, it turns out, were making them on bigotry.\nImmigration is the one that surprised me the most. I have no problem with a serious, positive debate. The undertones which have now become almost the overtones of that debate have been distressing. And unfortunately, in this case, it all kind of came together to become the mainstream of the party, at least for a while. Now if you pluck Trump out, would it go back to looking what it looked like? I mean, maybe.\nHarwood: Our politics may not snap back to what it was, just because he passes from the scene?\nKristol: I think it's unlikely. One almost never goes back to the way it was. You'd be in a new place, which maybe would be a good place.\nBut it could also be the case, unfortunately, that you are in a bit of a downward spiral here, and that Trump's incivility just leads to other incivility and that becomes the new norm. That you denigrate your opponents in personal terms in a way that really wasn't that common at the presidential level.\nThat as president, you attack individuals in the FBI as traitors. That you attack your own Cabinet members publicly. That you just demean.\nHarwood: There are a lot of boundaries that are getting crossed that were never crossed before.\nKristol: Absolutely. It's very hard to imagine you just snap your fingers and those boundaries magically reappear.\nHarwood: You were part of a movement that changed the establishment but ultimately became what one would call the Republican establishment. Do you feel at all responsible for the creation of the conditions that produced this?\nKristol: A little bit. It was a mistake to — I was critical of the 2013 immigration bill. The Iraq War didn't go the way I and many others hoped. It was reasonable of voters to say, \"Well, gee, that didn't work out too well. There were no weapons of mass destruction.\"\nThe 2008 financial crisis — that wasn't supposed to happen. Sarah Palin, one of my more famous failures, I guess you'd say. I thought Palin as McCain's VP would be a way to almost channel a certain kind of populism into what I would say is a healthy conservatism.\nI probably need to spend more time really thinking about what happened over the last three or four years. Having said all that, I do think one can over explain these things and over-interpret these things. Just Trump himself is a huge phenomenon.\nDemocracies have always been susceptible to demagoguery. That's why the founders wrote about demagogues. And it just turned out that Trump was a very effective demagogue coming along at the right time in the right circumstances. Didn't have to happen, but it happened.\nI don't think it necessarily reveals that the whole culture is totally bankrupt, or conservatism is deeply, fatally flawed, or we've degenerated into just a celebrity culture where anything goes, or we're post-truth. Having said that, once you have a president who has all these characteristics, then you do begin to move in that direction.\nHarwood: What's it been like for you, as someone steeped in a world that is now largely very pro-Trump, to be a high-profile critic of him? Have you had friendships that changed, or disappeared? What's it been like?\nKristol: It's been fine, honestly. It's a perfectly reasonable question to ask. It's been great being at The Weekly Standard, great being able to say my piece. I think I'm saying the right thing.\nThere have been friendships that are, they haven't been blowups, but they're people I see much less of than I saw two years ago. Other people whom I, you know, I strangely respect.\nHarwood: Are you goofing on Twitter when you say \"I'm with her,\" and…\nKristol: \"My inner liberal\"\nHarwood: Yeah, all that stuff.\nKristol: Semi-goofing. I actually do think that there is a greater possibility for a centrism in reaction to Trump on the one hand and [Sen. Bernie] Sanders on the other.\nHarwood: You're becoming a third-way guy?\nKristol: I'm slightly more open to third way-ism than I was before. In the American context, it has its practical limits, and as an intellectual matter, you don't want to just be splitting the difference and all that. But would it be healthy for the country if there were more honest attempts to work out some deals on some issues, some compromises, and not to turn everything into a bloody trench warfare and an emblem of the culture war? Yes.\nThis is the great irony. I was involved in the \"reformicon\" effort in 2013-2014, which was explicitly, \"we can't just Xerox Reagan.\" In the spirit of Reagan actually we could rethink things — maybe we need to think more about job-training programs, earned income tax credit, adjust the tax code.\nThat all got blown up. What we now have is a weird combination of Trumpism and complacent Republican orthodoxy. The reforming spirit has disappeared for now. But I think it'll come back.\nHarwood: You think we're on the way to a new party?\nKristol: Less unlikely than I would have said two or three years ago. It never seems to quite happen. But I do think a Trump-Republican variety or Sanders-Warren Democratic Party leaves an unbelievable, huge opening in the middle for an independent presidential ticket.\nI don't know whether we get a new party, just some independent candidates, some reshuffling within the parties. It's a very fluid moment. I mean, it's such a cliche to say \"uncharted waters,\" but it really is. We've never had a president like Trump.\nDisclosure: MSNBC and CNBC are divisions of NBCUniversal.", "external_links": [], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T14:10:57.085+02:00", "highlightTitle": ""}