{"organizations": [], "uuid": "8e871f5e2beeb50c3ae8d2273b1e27ff2bcab1e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104963209-GettyImages-908295802.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/28/india-budget-2018-may-spend-more-money-on-farmers.html", "country": "US", "domain_rank": 767, "title": "India's ruling party may shore up votes by pushing more money toward farmers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T02:17:00.000+02:00", "replies_count": 0, "uuid": "8e871f5e2beeb50c3ae8d2273b1e27ff2bcab1e4"}, "author": "", "url": "https://www.cnbc.com/2018/01/28/india-budget-2018-may-spend-more-money-on-farmers.html", "ord_in_thread": 0, "title": "India's ruling party may shore up votes by pushing more money toward farmers", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "neeraj singh", "sentiment": "none"}, {"name": "basant panchmi", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "amritsar", "sentiment": "none"}], "organizations": [{"name": "bharatiya janata party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Support for India's ruling political party has been fading outside urban areas — and that could mean good things coming for farmers.\nNARINDER NANU/AFP/Getty Images January 21, 2018: Indian farmer Neeraj Singh walks through his mustard field on the outskirts of Amritsar on the eve of Basant Panchmi, a festival that celebrates the onset of spring. New Delhi is likely to focus attention on rural areas in its upcoming annual budget, set for release on February 1, in an attempt to shore up political support there.\nLarge swaths of the farming community — who make up the bulk of India's population — are growing disillusioned with Prime Minister Narendra Modi's Bharatiya Janata Party, as reflected by December's Gujarat state election . Although the BJP secured a narrow victory in the bellwether state, rural residents there overwhelmingly voted for the opposition Congress party, which aggressively painted Modi as anti-poor and anti-farmer.\nThose results have the BJP worried. Four other states with big agrarian populations — Rajasthan, Madhya Pradesh, Chhattisgarh and Karnataka — are scheduled to hold elections this year, and the BJP may not be as lucky in those areas.\nMalaise among farmers runs deep, said Kunal Kundu, an economist at Societe Generale. Two years of drought have bitten into profits, which are believed to have fallen further last year despite a normal monsoon. Protests among farmers have risen sharply nationwide, Kundu explained.\nTo offset this discontent, Finance Minister Arun Jaitley is widely expected to promote initiatives aimed at boosting rural growth when he announces the federal budget next month.\nSyed Zafar Islam, the BJP's national spokesperson for political and economic affairs, told CNBC that he did not wish to speculate on New Delhi's upcoming budget. But he noted that farmers' wages have improved since Modi came to power and that the government was committed to addressing concerns of the rural community.\n\"Fifty percent of the population stays in rural areas, so this is a huge priority for the government to improve the economic well being of farmers and masses through more rural roads, irrigation projects, rural housing, and better price realization for farmers,\" Islam said.\nPro-farmer policies Analysts have called for Modi's administration to enact a set of reforms known as the Model Agricultural Produce and Livestock Marketing Act, which is designed to loosen rules on where farmers can sell their products. The act aims to double farmers' income by 2022.\nExisting regulations \"restrict farmers' ability to sell produce outside designated wholesale markets, leaving them at the mercy of traders who often made profits at the expense of farmers,\" explained Kundu. \"The new act could help reduce the price spread by enabling direct contact between farmers and consumers or other end users.\"\nshow chapters India will have a $5 trillion economy by 2025, PM Modi says 9:17 AM ET Wed, 24 Jan 2018 | 01:58 The government has only one year left in its current term, so it's politically crucial for them to boost popularity ratings .\nNew Delhi could also take other steps, such as boosting funds for crop insurance, spending more on rural infrastructure, or increasing price supports for produce when market prices fall, according to Shailesh Kumar, senior South Asia analyst at political consultancy Eurasia Group.\n\"While this will be politically driven, it will produce economic dividends,\" he said in a recent note.\nBut those steps could fuel inflation , a major headache for policymakers.\nHigher consumer prices can be a game-changer during elections, so \"Modi will cautiously expand support for the agrarian economy to avoid causing a spike in broader inflation that would negatively affect his political future,\" Kumar continued.\nTo keep food prices in check, New Delhi has imposed controls in recent years that have hurt agricultural producers.", "external_links": [], "published": "2018-01-29T02:17:00.000+02:00", "crawled": "2018-01-29T02:24:09.036+02:00", "highlightTitle": ""}