{"organizations": [], "uuid": "b187ddb703644735933ff0a53a5def58a3152ee0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/29/102299160-Mall.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/enough-with-the-doom-and-gloom-retail-real-estate-has-bright-spots.html", "country": "US", "domain_rank": 767, "title": "Enough with the doom and gloom. Retail and its real estate have bright spots", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T13:00:00.000+02:00", "replies_count": 0, "uuid": "b187ddb703644735933ff0a53a5def58a3152ee0"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/enough-with-the-doom-and-gloom-retail-real-estate-has-bright-spots.html", "ord_in_thread": 0, "title": "Enough with the doom and gloom. Retail and its real estate have bright spots", "locations": [], "entities": {"persons": [{"name": "brian sozzi", "sentiment": "positive"}, {"name": "deborah weinswig", "sentiment": "none"}, {"name": "tj maxx", "sentiment": "none"}, {"name": "kohl", "sentiment": "none"}, {"name": "dick", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "sporting goods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Brian Sozzi The malls came alive this holiday season, and that is a good sign on the economy for 2015. \nRetail isn't just decades-old apparel brands and antiquated shopping malls. \nThe future for many industry names is bright and booming, despite dire headlines. And malls and shopping centers are taking on a new image of their own, bringing in experiential tenants and living spaces as department stores and other big-box anchors scale back. \n\"Store closures grabbed the headlines and drove the retail apocalypse narrative in 2017 and into 2018,\" said Deborah Weinswig, managing director of FGRT (formally Fung Global Retail & Technology). \nHowever, \"total in-store sales continued to grow, yielding an uplift in sales densities across US retail,\" she said. \"Moreover, occupancy rates in open-air shopping centers and superregional malls [more than 800,000 square feet in size] proved resilient.\" \nOpen-air centers in particular, which could be anchored by names like Dick's Sporting Goods , Whole Foods Market, Kohl's , Dollar Tree or TJ Maxx , are considered one of the \"most resilient retail real estate segments,\" according to FGRT. Retailers located there haven't been fleeing or breaking leases, as is the case at some regional malls, which tend to be about 400,000 to 800,000 square feet. \nMeanwhile, the top retail real estate owners in the U.S. — Simon Property Group , General Growth Properties , Kimco Realty , Brixmor Property Group and DDR — have maintained occupancy rates at or above 95 percent. That means less than 5 percent of spaces throughout their properties (a mix of malls and strip centers) are vacant. \n\"GGP and others have been dialing down their exposure to apparel specialty stores, and a number of these companies have focused on grocery-anchored centers or sought to bring in more grocery tenants to their existing centers,\" Weinswig wrote. \nFor now, grocery stores look to be a safe haven for real estate developers hoping to diversify their assets. But there's also a growing concern this trend could reverse as more shoppers opt to order their groceries online. \nNonetheless, the majority of store closures in 2017 stemmed from so-called softline retailers, which includes apparel brands, FGRT found in its report. In turn, regional malls have suffered the most from their peer group as names like Rue21, Ascena Retail Group and Gymboree shutter locations. \nWhile department stores also trimmed back, grocers, warehouse retailers and variety dollar stores have expanded across the country and are still filling in the gaps. \nThen, a fresh batch of tenants is changing the landscape even further. \nLawrence Group, a real estate developer with offices in St. Louis, just revealed it will be bringing Alamo Drafthouse and Punch Bowl Social, an upscale cinema and \"eatertainment\" venue, to anchor a massive mixed-use development called City Foundry STL in the city's historic midtown district. \n\"A lot of the retailers that we are talking to right now are saying, 'Once you deliver the food and entertainment tenants, then we are interested,'\" Lawrence Group Chief Executive Officer Steve Smith told CNBC. \"That's led us to landing some of these names (i.e. Alamo and Punch Bowl) earlier in the process.\" \nLocal food-and-beverage options coming to the site include a German beer hall and steakhouse lounge. The better blueprint for many retail real estate developers today is more dining, less apparel, a touch of experiential tenants, and popular brands such as Warby Parker, Lululemon , Untuckit and Ulta . \nOn the whole, St. Louis' midtown area — chiefly home to warehouses and other industrial spaces — is being reborn, with retail playing a major role in shaping the surrounding community. The same can be said for many retail redevelopment projects happening across the U.S. \n\"Retail follows rooftops,\" Smith said. And right now in St. Louis, residential space is sprawling. \nFor the remainder of this year, Weinswig expects purchases made at physical stores to strengthen so long as overall retail sales accelerate — online sales, led by internet behemoth Amazon , are still just a sliver of that total. \n\"Offline sales are made largely through physical stores,\" she said. Meanwhile, \"a number of major shopping-center owners are pivoting away from apparel specialist stores. ... Some are focusing on bringing in grocery and everyday-goods retailers, which are less vulnerable to e-commerce migration.\" \n(Note: Commercial real estate services group CBRE's Paul Fusz and Andrew Turf are handling retail leasing for City Foundry STL.) ", "external_links": [], "published": "2018-01-24T13:00:00.000+02:00", "crawled": "2018-01-24T13:56:35.011+02:00", "highlightTitle": ""}