{"organizations": [], "uuid": "19d5f06add06efc5787ac922aba060dafd7813f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 82, "shares": 82, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/01/103044729-GettyImages-172088752.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/gop-actions-may-make-graduate-school-too-costly-for-many.html", "country": "US", "domain_rank": 767, "title": "GOP actions may make graduate school too costly for many students", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "19d5f06add06efc5787ac922aba060dafd7813f5"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/gop-actions-may-make-graduate-school-too-costly-for-many.html", "ord_in_thread": 0, "title": "GOP actions may make graduate school too costly for many students", "locations": [], "entities": {"persons": [{"name": "jonathan fansmith", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "columbia university", "sentiment": "none"}, {"name": "public service loan forgiveness", "sentiment": "none"}, {"name": "american council on education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fewer people may pursue doctoral and master degree programs due to a one-two punch of Republican-introduced legislation and the new tax code, policy experts say.\n\"You're seeing a broader-based attack on higher education as it is now,\" said Jonathan Fansmith, director of government relations at the American Council on Education. \"It's a wholesale onslaught.\"\nIn a rewrite of the Higher Education Act, House Republicans propose to restrict how much graduate students can borrow and the ways in which they can repay their loans. The bill , called the Prosper Act and introduced by Rep. Virginia Foxx, R-N.C., would also end federal work study for graduate students and all student loan forgiveness plans . At the same time, the bill would make the FAFSA form, which students use to apply for financial aid, easier to understand and available on mobile apps.\nThe House Committee on Education and the Workforce approved the legislation, but it still needs to go pass the full House and Senate.\n\"They'll either not go because they have a gap they can't fill, or they'll replace federal loans with much more expensive private loans. \" -Barmak Nassirian, American Association of State Colleges and Universities Michael Woeste, a spokesman for the committee, said the legislation won't discourage people from attending graduate school , but rather make them better realize the financial undertaking .\n\"People weighing their graduate school options have to consider debt obligations and the prospects for a good-paying job after graduation,\" Woeste said. \" Too often, students do not make informed decisions in this regard.\"\nHere are some of the ways the proposed legislation and recent tax code changes could affect both current and future grad students.\nBorrowing Currently, graduate students can take out federal loans up to their cost of attendance. Under the bill, however, they'd be limited to a federal loan of $28,500 a year.\n\"It's a wholesale onslaught. \" -Jonathan Fansmith, American Council on Education That cap will force many graduate students to make a harsh choice, said Barmak Nassirian, director of federal relations and policy analysis at the American Association of State Colleges and Universities.\n\"They'll either not go because they have a gap they can't fill, or they'll replace federal loans with much more expensive private loans,\" he said.\nRepayment and forgiveness While there are roughly six ways to repay student loans now, the bill would narrow those options to two: A 10-year standard plan or an income-based repayment plan — at 15 percent of their income for as long as it takes to repay the loan, with interest.\nThe bill abolishes all loan forgiveness options. Most troubling to education policy experts and graduate students is the ending of the popular Public Service Loan Forgiveness program. More than half a million people have signaled interest in this kind of forgiveness, in which former students who work in certain public service jobs can have their loans cancelled after 10 years of on-time payments.\n\"If you don't have the people who are trained as rehabilitation counselors and health technicians, you're not going to be able to get people through the crisis.\" -Beth Buehlmann, Council of Graduate Schools \"We've always had ways to incentivize people to go into service occupations,\" said Beth Buehlmann, vice president for public policy at the Council of Graduate Schools. \"I think that incentive will be lost. We may see some areas that are not served as well.\"\nShe said public service jobs that require post-undergrad degrees are needed now more than ever.\n\"We have an opioid crisis,\" Buehlmann said , by way of example . \"If you don't have the people who are trained as rehabilitation counselors and health technicians, you're not going to be able to get people through the crisis.\"\nJames Alyson, 34, said he would have never gone to graduate school to become a speech language pathologist in public schools if the Public Service Loan Program didn't exist. At the Kent School District in Washington state, he has helped children with autism and other learning disabilities improve their communication.\n\"To get this degree, that's required for this job, it wouldn't have been worth it,\" Alyson said. \"I wouldn't be able to repay it.\"\nHero Images/Getty Images He said most of his classmates in graduate school were in the same boat, and are today working in public schools and hospitals.\n\"Some people had rich parents, but everyone else was banking on Public Service Loan Forgiveness,\" he said.\nFederal work study The bill's elimination of federal work study could also put graduate school further out of reach for many people — and make the labor market less equitable, Buehlmann said.\n\"It's a supplement to individuals who are low-income, and in many cases first-generation graduate students,\" she said. \"It allows employers to begin to see the potential of diversifying the workforce.\"\nA scientist tests samples at Karius' lab in Silicon Valley. Tax code changes Although education activists were relieved that the final tax bill, the Tax Cuts and Jobs Act , did not include a number of provisions that would have buried graduate students in additional expenses , including taxing their tuition waivers, some policy experts say the new law will still do harm.\n\"We are very alarmed by the macro economic consequences of the tax code, that may disproportionately affect higher education,\" said Nassirian, of the American Association of State Colleges and Universities.\nSteven Bloom, director of government relations at the American Council on Education, said he was working seven days a week while the new tax code was being put together.\n\"It was a very busy time for us,\" Bloom said.\nExperts say the doubling of the standard deduction will discourage people from itemizing on their tax returns. As a result, fewer people may be inclined to contribute charitable donations to schools.\n\"The institutions that have graduate students are going to see a decline in those dollars, which they use for financial aid, money to devote to research, building new labs and upgrading technology,\" Bloom said.\nAlexRaths | Getty Images The tax code also caps state, local and property taxes deduction at $10,000. Americans' tolerance for high taxes might erode in certain places, and states could be pressured to lower their levies, Bloom said.\nData from the American Council on Education shows that when state funding declines, public schools become more expensive for students.\n\"In the competition for state funding priorities, higher education has lost out,\" Bloom said. \"The cap will potentially feed that trend.\"\nThe law also imposes a 1.4 percent tax on endowments at certain expensive colleges.\n\"It's hard to understand the endowment tax as anything other than a punishment for institutions, because it doesn't accomplish anything but take away money from those schools,\" Bloom said.\n\"If you say you believe in maintaining access to higher education, why would you propose these things in the first place?\" he added. \"It doesn't make sense.\"\nNassirian said these changes represent a huge attitude shift toward higher education in America.\nIndeed, there has been a stark divide between the parties' view on education. While the percent of Democrats who believe that colleges and universities have a positive affect on the direction of the country increased to 72 percent from 65 percent over the last seven years, it dropped to 36 percent from 58 percent among Republicans, according to Pew Research .\nIn December, Moody's investment outlook downgraded higher education from stable to negative, citing \"uncertainty at the federal level.\"\nNassirian warned of the consequences of fewer people pursuing advanced degrees.\n\"Graduate school is where we super-specialize,\" Nassirian said. \"If you take that out, you're going to miss a lot of expertise.\"\nMore from Personal Finance:\nHere are the new tax brackets in the GOP plan\nTax bill leaves your 401(k) unchanged — for now\nTime to start repaying that college debt", "external_links": [], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T16:50:07.000+02:00", "highlightTitle": ""}