{"organizations": [], "uuid": "9109692a992f3beeed4ae8542cc4d1e488838ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://search.cnbc.com/rs/search/all/view.rss?partnerId=2000&keywords=agriculture&sort=date&minimumrelevance=0.2&pubtime=30&pubfreq=d&categories=exclude", "section_title": "CNBC.com", "url": "https://www.cnbc.com/2018/01/02/reuters-america-grains-u-s-wheat-rallies-as-temperatures-fall-corn-soy-firm.html", "country": "US", "domain_rank": 767, "title": "GRAINS-U.S. wheat rallies as temperatures fall; corn, soy firm", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-02T22:10:00.000+02:00", "replies_count": 0, "uuid": "9109692a992f3beeed4ae8542cc4d1e488838ae0"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/reuters-america-grains-u-s-wheat-rallies-as-temperatures-fall-corn-soy-firm.html", "ord_in_thread": 0, "title": "GRAINS-U.S. wheat rallies as temperatures fall; corn, soy firm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GRAINS-U.S. wheat rallies as temperatures fall; corn, soy firm Mark Weinraub SHARES \n(Updates with closing prices, adds details) \nCHICAGO, Jan 2 (Reuters) - U.S. wheat futures rallied 1.7 percent to their highest in nearly four weeks on Tuesday on concerns about sub-zero temperatures damaging the dormant crop in crucial growing areas of the United States, traders said. \nThe gains in wheat spurred increases in corn futures. Soybeans also closed higher after trading both sides of unchanged during the session. \nTraders were also digesting the latest export data from the U.S. Agriculture Department on the first trading day of 2018. \nWheat notched its biggest daily percentage gain since Nov. 22 as much of the crop was not protected by a blanket of snow to mitigate the freezing conditions. \n\"Damage occurred in about a quarter of the hard red wheat belt in the central Plains, with about 5 percent of the soft red wheat belt in the Midwest seeing impacts,\" Don Keeney, senior agricultural meteorologist for Radiant Solutions, said in a note. \nChicago Board of Trade soft red winter wheat for March delivery settled up 6-1/2 cents at $4.33-1/2 a bushel. Prices peaked at $4.36-1/4, matching a level last seen on Dec. 5. \nCBOT March corn futures ended 2-1/2 cents higher $3.53-1/4 a bushel. \nCBOT March soybeans gained 3 cents to close at $9.64-3/4 a bushel. \nOngoing concerns that heat in Argentina will limit the size of that country's harvest supported soybean prices. \n\"While Argentina did receive good coverage over the past week, temperatures could top 100 degrees (Fahrenheit) (37.8 C) again in some areas by the end of the week before rains return,\" said Bryce Knorr, analyst at Farm Futures. \nA shortfall in South American crop production could boost demand for U.S. exports and help alleviate the glut of domestic supplies following the recent bumper harvest. \nUSDA said on Tuesday morning that weekly U.S. soybean export inspections were 1.139 million tonnes, in line with forecasts for 1.1 million to 1.3 million tonnes. \nCorn export inspections were 683,898 tonnes, also in line with trade estimates that ranged from 575,000 to 800,000 tonnes. Export inspections of wheat totalled 274,506 tonnes, below estimates for 300,000 to 600,000 tonnes. (Reporting by Mark Weinraub; Editing by Frances Kerry and Lisa Shumaker)", "external_links": [], "published": "2018-01-02T22:10:00.000+02:00", "crawled": "2018-01-03T01:08:57.150+02:00", "highlightTitle": ""}