{"organizations": [], "uuid": "9f89815d0991b93a30e01034094295b74e079ba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104949213-Alvin_Kamara.1910x1000.jpg", "site_section": "http://sports.yahoo.com/nfl/rss.xml", "section_title": "NFL on Yahoo! Sports - News, Scores, Standings, Rumors, Fantasy Games", "url": "https://www.cnbc.com/2018/01/17/saints-running-back-alvin-kamara-used-his-signing-bonus-to-buy-wings.html", "country": "US", "domain_rank": 767, "title": "NFL star rookie Alvin Kamara took his bonus and bought chicken wings—here's why it was smart", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T17:44:00.000+02:00", "replies_count": 0, "uuid": "9f89815d0991b93a30e01034094295b74e079ba7"}, "author": "CNBC", "url": "https://www.cnbc.com/2018/01/17/saints-running-back-alvin-kamara-used-his-signing-bonus-to-buy-wings.html", "ord_in_thread": 0, "title": "NFL star rookie Alvin Kamara took his bonus and bought chicken wings—here's why it was smart", "locations": [], "entities": {"persons": [{"name": "alvin kamara", "sentiment": "negative"}, {"name": "sean gardner", "sentiment": "negative"}, {"name": "kamara", "sentiment": "none"}], "locations": [{"name": "louisiana", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "new orleans saints", "sentiment": "negative"}, {"name": "mercedes-benz superdome", "sentiment": "none"}, {"name": "washington redskins", "sentiment": "none"}, {"name": "sports illustrated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NFL player Alvin Kamara is having a great season. The New Orleans Saints running back is on the short list for \"Rookie of the Year\" and earned $1.4 million in cash in 2017.\nThe rookie also became one of the league's most watched players, proving \"more productive per touch\" than any other running back in the last 25 years, Sports Illustrated reports .\nYet, despite all of his success, Kamara says he's the same person he was before he got famous. \"Ain't nothing changed,\" he told Sports Illustrated . \"I'm still here.\" In fact, what he did with his signing bonus was both simple and responsible. First, he tucked most of it away for later. Then he hit up his favorite wing spot.\n\"I got my signing bonus and I put that s--- in the bank and I went and got some motherf---ing wings,\" he says.\nshow chapters Dallas Cowboys running back Alfred Morris drives a $2 car      9:47 AM ET Thu, 19 Oct 2017 | 00:49 Kamara keeps himself down-to-earth in other ways as well. He lives in downtown New Orleans and walks home from games at the Superdome. When dealerships offer him free cars, he says no. And when one Twitter fan extended an offer to gift Kamara a yacht, he declined.\n\"Even if I wanted a boat, what the f--- am I going to do with a boat right now?\" he told Sports Illustrated.\nAlthough the average person doesn't spend their days fielding offers for free cars, Kamara's choice to put the majority of his bonus in the bank is a smart move anyone can emulate. Kamara treated himself to wings instead of going overboard with an expensive impulse purchase such as a house or a luxury car.\nshow chapters Ex-NFL player and actor Nnamdi Asomugha still drives the 20-year-old car he took to prom      4:24 PM ET Tue, 31 Oct 2017 | 01:02 While a bonus, tax return or other windfall can feel like free money, putting funds to work instead of blowing them on something unnecessary sets you up for a successful future. That money could be used to build an emergency fund , pay down debts or chip away at larger savings goals .\nEven if you've already gotten out of debt and saved up for a rainy day, there are several other ways a bonus check can be put to work to multiply its future payoff. Here are three options to consider.\nBulk up your retirement accounts Ideally you're already putting money into your 401(k) retirement account if you have the option, but, if possible, you'll also want to get in the habit of increasing your contributions consistently. A bonus is a great opportunity.\nIt's smart to consider alternate retirement savings accounts too, such as a Roth IRA , traditional IRA and/or health savings account .\nDirect your extra money towards one of those options. Bonus points if you set up automatic contributions so your account continues to grow over time.\nshow chapters This NFL starting quarterback drives a dented van he bought from his grandma for $5,000      11:38 AM ET Fri, 17 Nov 2017 | 00:52 Open a 529 plan If you have kids, you may want to consider opening a tax-advantaged 529 savings plan to start putting money away for their education. College costs are already out of control and are only getting more expensive .\nA 529 plan allows a parent to contribute up to $14,000 a year — $28,000 for a couple — for each of their children's college educations. Use your holiday bonus to make your first contribution, or add to an existing plan.\nshow chapters NFL player who retired to get a PhD from MIT drives a used hatchback      4:18 PM ET Fri, 3 Nov 2017 | 01:00 Invest in yourself One of the best investments you can make is in yourself . Take your bonus and use it to further your education by enrolling in a course, attending a business conference or investing in books.\nAdditionally, invest in your health . Consider making room in your budget for a gym membership, exercise classes or a fitness-magazine subscription. Thinking about tomorrow isn't the easiest thing to do, but your future self will thank you.\nOf course, it's also okay to reward yourself for doing good work and making smart decisions. Kamara's chicken wings were well-earned in more ways than one.\nDon't miss: \nAthletes who win the World Series earn 130% more than those who win the Super Bowl The simple reason why Bill Gates is no longer the richest person in the world Here's the best credit card if you love to travel show chapters Ex-NFL player and actor Nnamdi Asomugha still drives the 20-year-old car he took to prom      4:24 PM ET Tue, 31 Oct 2017 | 01:02", "external_links": [], "published": "2018-01-17T17:44:00.000+02:00", "crawled": "2018-01-17T17:53:38.013+02:00", "highlightTitle": ""}