{"organizations": [], "uuid": "e8cec9eb729e1d3479a31a207a9985d10eb276c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/03/22/100582650-micron-industries-silicon-waffer-gettyp.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/chipmaker-and-semiconductor-stocks-could-see-a-repeat-of-2017-gains.html", "country": "US", "domain_rank": 767, "title": "Red-hot chip stocks could see a repeat of 2017 gains", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T22:30:00.000+02:00", "replies_count": 0, "uuid": "e8cec9eb729e1d3479a31a207a9985d10eb276c0"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/chipmaker-and-semiconductor-stocks-could-see-a-repeat-of-2017-gains.html", "ord_in_thread": 0, "title": "Red-hot chip stocks could see a repeat of 2017 gains", "locations": [], "entities": {"persons": [{"name": "kim forrest", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nvidia", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "micron technology", "sentiment": "none"}, {"name": "fort pitt capital", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "smh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "show chapters Semiconductor stocks surge      7:00 PM ET Fri, 19 Jan 2018 | 03:38 It's been an unpredictable start to the year for chipmakers.\nWhile some like Nvidia have seen double-digit gains, others such as Micron Technology have glitched out.\nBut, the group could reboot after a mixed start, according to one stock analyst.\n\"All signs point to yes for semiconductors,\" Kim Forrest of Fort Pitt Capital told CNBC's \" Trading Nation \" on Friday. \"Things are not getting simpler. They're getting more connected and I think anything that helps with that is something that investors should take a look at.\"\nAlready this year, the space as a whole has outpaced broader markets' performance. The SMH semiconductor ETF is up 10 percent for the year to date, while the XLK Technology ETF (in which semiconductors have a 14 percent weighting) has risen 6.7 percent. The S&P 500 has climbed 5.6 percent during the same period.\nGains in 2018 would continue years of outperformance among semiconductor stocks. The SMH rose 36 percent in 2017, its second straight year exceeding the S&P 500. Meanwhile, the XLK advanced 32 percent, a ninth year in the green. Both outpaced the S&P 500's 20 percent gain in 2017.\nThe outperformance has made individual names in the space expensive, though. Take Nvidia for example – its shares have surged 20 percent since the beginning of the year, quadruple gains by the S&P, putting its price-earnings ratio at 50 times forward earnings.\n\"I'm not a fan of Nvidia to buy now,\" said Forrest. \"If you have it, you should hold it because it could grow into its PE.\"\nOthers in the space are comparably cheap. Micron Technology currently has a PE ratio of five times forward earnings.\nMicron has underperformed the rest of the group in recent months even after rocketing 88 percent higher over 2017. Since hitting its highest levels since 2000 in November, its shares have pulled back roughly 14 percent.\nShould it add to those losses, it would raise concerns over the health of the broader semis space, according to Matt Maley , equity strategist at Miller Tabak.\n\"On a technical basis, it's forming what you call a symmetrical triangle,\" Maley told \"Trading Nation.\" If it breaks lower, \"it would be a yellow warning flag, not a red flag, but a warning flag for the group.\"\n\nMicron has fallen more days than it has risen in 2018 so far. Even so, its shares have added nearly 4 percent since the beginning of the year. Its peers AMD , Nvidia, and Texas Instruments have all seen double-digit percentage increases this year, while NXP Semiconductors and Broadcom have had gains in the low single-digits.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-22T22:30:00.000+02:00", "crawled": "2018-01-22T23:00:15.013+02:00", "highlightTitle": ""}