{"organizations": [], "uuid": "3380bc6eb443778b60535f9e1c649c44e75f0455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/10/104763596-RTX28DX5-bull.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/us-stocks-will-likely-run-higher-for-another-11-years.html", "country": "US", "domain_rank": 767, "title": "US stocks will likely run higher for another 11 years, Wall Street's Tom Lee says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T21:11:00.000+02:00", "replies_count": 0, "uuid": "3380bc6eb443778b60535f9e1c649c44e75f0455"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/us-stocks-will-likely-run-higher-for-another-11-years.html", "ord_in_thread": 0, "title": "US stocks will likely run higher for another 11 years, Wall Street's Tom Lee says", "locations": [], "entities": {"persons": [{"name": "tom lee", "sentiment": "negative"}, {"name": "kai pfaffenbach", "sentiment": "negative"}, {"name": "rob sluymer", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "fundstrat global advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 02:27 \nThe U.S. stock market will likely run higher for another 11 years, according to Tom Lee, a widely followed Wall Street market strategist. \n\"Both [Fundstrat technical strategist Rob Sluymer and I] think it's more like 2029 is the peak of this equity market cycle and then, the S&P is 6,000 to 15,000,\" said Lee, head of research at Fundstrat Global Advisors, on CNBC's \" Halftime Report \" on Friday. \n\"So I think it's just important to be long-term oriented right now.\" Kai Pfaffenbach | Reuters \nThat view is based on Lee's analysis of economic data such as housing starts and auto sales that indicate the economy is likely only in the middle of the global business cycle. He also expects that funds will flow out of bonds into stocks in search of better returns, especially since many bonds still have negative yields, meaning investors essentially are paying for their investments. \n\"The allocation should be going up in equities,\" Lee said. \"Basically no S&P company makes you pay them to own it.\" \nSuch optimistic comments contrast with those of most market watchers, who say stocks are likely close to the end of their yearslong rally. The S&P 500 is trading near all-time highs and in its second-longest bull market on record, a period without a drop of at least 20 percent from a recent high. \nLee has a year-end target on the S&P 500 of 3,025, about 8 percent above Friday's levels and toward the higher end of the range of market strategists surveyed by CNBC. \n\"We've had so much caution since '09 that animal spirits have been depressed,\" Lee said. \n\"Last year, 2017, was probably the first time in nine years that I thought institutions were actually bullish,\" Lee said, adding that he doesn't particularly find any Fundstrat institutional clients that optimistic on stocks right now since they did so well last year. \nBefore co-founding Fundstrat in 2014, Lee was the top stock strategist at J.P. Morgan. He was one of the few on Wall Street to predict that President Donald Trump 's election win in 2016 would cause a rally in stocks rather than a sell-off. Lee is also the only widely followed Wall Street strategist to issue a price target on bitcoin , which he sees at least doubling this year.", "external_links": [], "published": "2018-01-19T21:11:00.000+02:00", "crawled": "2018-01-19T21:26:40.042+02:00", "highlightTitle": ""}