{"organizations": [], "uuid": "69b1cb9a8a46362bfe789c7b50c142ce40f4aea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/23/104301066-GettyImages-623874284.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/ignore-the-bad-housing-starts-number-demand-optimism-are-high.html", "country": "US", "domain_rank": 767, "title": "Ignore the bad housing starts number. Builder optimism and buyer demand are high", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T17:48:00.000+02:00", "replies_count": 0, "uuid": "69b1cb9a8a46362bfe789c7b50c142ce40f4aea1"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/ignore-the-bad-housing-starts-number-demand-optimism-are-high.html", "ord_in_thread": 0, "title": "Ignore the bad housing starts number. Builder optimism and buyer demand are high", "locations": [], "entities": {"persons": [], "locations": [{"name": "west", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "san rafael", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "northeast", "sentiment": "none"}], "organizations": [{"name": "census bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ignore the bad housing starts number.\nSome will blame the weather. Others will claim the data is too volatile month-to-month. Bottom line, December's steep drop in single-family housing starts is not indicative of what is really going on at construction sites across the nation.\nThis winter's chill was both brutal and early, and that was a factor, despite seasonal adjustments in the Census Bureau's reading. Starts fell hardest in the Northeast and South, where temperatures were significantly below normal. They were flat in the West, where weather is not a factor.\nThere is optimism among home builders and a sharp rise in demand from home buyers. The December drop in starts is likely an aberration, but builders clearly need to ramp up production more than they already have. Sales of newly built homes in November, which measure only the single-family market, spiked more 17 percent for the month and were up close to 27 percent compared to 2016. Demand is expected to rise with the improving economy.\n\"The economy is really strong right now. The unemployment rate is so low and people are getting raises, and that's going to give them the confidence to buy homes, too,\" said John Burns, CEO of John Burns Real Estate Consulting.\nThe severe lack of existing homes for sale also gives the builders a long runway for demand. Newly built homes come at a price premium, but today's first-time buyers are, in general, older and wealthier than in previous generations.\nBuilders are now starting to build more speculative homes – that is, homes that don't have a buyer yet, because demand is so strong. They did that a lot during the last housing boom, then all but shut down speculative construction during and after the recession.\n\"The builders are shifting to the lower price points and entry-level, but their entry-level buyer is a more affluent entry-level buyer, somebody who went to college, got married in their thirties, buying in communities that are 800 thousand dollars instead of a million two,\" Burns added.\nHome builder sentiment jumped to the highest level in 20 years following the passage of the Republican tax plan in December and only fell off slightly in January, mostly because of rising costs for land and labor.\nIn other words, builders are thrilled to increase production and disappointed that they can't put up homes fast enough. That was reflected in a solid increase in single-family building permits, which are an indicator of future construction.\n\"Because of the increase in single family permits, I'll give the single family start figure a pass,\" wrote Peter Boockvar, chief investment officer at Bleakley Advisory Group. \"The question for housing now is how it responds with this continued rise in interest rates.\"\nMortgage rates have moved to the highest level in nine months and continue to push higher this week, as the yield on the 10-year Treasury , which these rates loosely follow, continues to break new ceilings. Historically, when rates rise, home prices usually moderate, but that is unlikely to be the case this year, as the strong demand and weak supply make the housing market more competitive than ever.\nWhile December's read on construction was low, the final numbers for 2017 are now in and pretty solid. Starts rose to the highest level since 2007, with much-needed single-family leading the charge. The highest in a decade, however, is still lower than average and far lower than needed.\n\"The pace of housing starts averaged just 1.2 million for the year, far short of the historical average of 1.5 million starts,\" Redfin chief economist Nela Richardson wrote in response to the Census report. \"Given the three-year drought in inventory and surging homebuyer demand, a pace of 2 to 3 million starts would be reasonable and appropriate. The market is in dire need of starter homes and homes near transit in major job centers.\"\nThe boom in multifamily apartment construction is now waning, which is probably positive, given that most of it was on the high end, which is now oversupplied in several major markets. There does, however, need to be more apartment construction in smaller, cheaper markets, where demand is high and rents are still rising.\n\"New construction last year would have been even higher had it not been for a sharp slowdown in multifamily permits and starts,\" said Ralph McLaughlin, Trulia's chief economist. \"While we applaud new multifamily construction in helping moderate rents over the past few years, we see the slowdown as a healthy retreat that will continue this year.\"", "external_links": [], "published": "2018-01-18T17:48:00.000+02:00", "crawled": "2018-01-18T18:10:14.004+02:00", "highlightTitle": ""}