{"organizations": [], "uuid": "c15ed01b0b752f794ce0f6c0b6575437071d5907", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970680-GettyImages-51602604.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/david-rubenstein-why-bill-gates-jeff-bezos-have-been-so-successful.html", "country": "US", "domain_rank": 767, "title": "David Rubenstein: Bill Gates and Jeff Bezos can do one thing that most entrepreneurs can't", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T19:21:00.000+02:00", "replies_count": 0, "uuid": "c15ed01b0b752f794ce0f6c0b6575437071d5907"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/david-rubenstein-why-bill-gates-jeff-bezos-have-been-so-successful.html", "ord_in_thread": 0, "title": "David Rubenstein: Bill Gates and Jeff Bezos can do one thing that most entrepreneurs can't", "locations": [], "entities": {"persons": [{"name": "jeff be", "sentiment": "negative"}, {"name": "david rubenstein", "sentiment": "negative"}, {"name": "bill gates", "sentiment": "negative"}, {"name": "jeff bezos", "sentiment": "negative"}, {"name": "rubenstein", "sentiment": "none"}], "locations": [], "organizations": [{"name": "honda", "sentiment": "negative"}, {"name": "the carlyle group", "sentiment": "none"}, {"name": "wnyc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The world's two richest people Bill Gates and Jeff Bezos can do one thing that most company founders can't and it's contributed to their success over the years: Run their own businesses, according to billionaire David Rubenstein.\n\"Running companies is different than getting them off the ground,\" says Rubenstein in a WNYC \"Freakonomics Radio\" podcast . \"Some great entrepreneurs are not really good at managing companies.\"\nRubenstein, who is the co-founder of private equity firm The Carlyle Group, says that even when founders do retain their CEO positions, it is relatively uncommon for them to be able to run the company well. \n\"It's a rare person, like Bill Gates, who was an entrepreneur and also was a very effective CEO for many, many years,\" he says.\nIn fact, he continues, most company founders typically don't last in the CEO position after the first five years.\n\"It's just a different skill set, and very few people have the skill set that Jeff Bezos exhibited or Bill Gates exhibited,\" Rubenstein tells the podcast. \"It just usually doesn't happen.\"\nGates held the CEO position at Microsoft for nearly 25 years before turning it over to his college friend Steve Ballmer in 2000 .\nIn a 2017 interview with WSJ Magazine , Gates credited Microsoft's success to spending many late nights in the office during the company's formative years. This drive, he said, was fueled by his rivalry with Apple founder Steve Jobs.\nGetty Images Apple CEO Steve Jobs holds up the new iPhone that was introduced at Macworld on January 9, 2007 in San Francisco, California. \"Early on we were speed nuts, staying all night [at the office, thinking], 'Oh, you're five percent slower as a programmer? You don't belong here.' It was very hard-core,\" he told the magazine.\nIn the same interview, Microsoft's current CEO Satya Nadella discussed Gates' leadership style at Microsoft, noting that the billionaire has a way of making people want to do their best.\n\"Bill is a galvanizing force,\" said Nadella, who has held the CEO title since 2014 . \"Whenever somebody meets with Bill, they want to do their best work. You can't replicate that.\"\nAmazon founder Jeff Bezos has held the CEO position since the retail giant's 1996 launch, nearly 22 years ago.\nWhat started as a small e-commerce site has expanded rapidly in recent years, with Amazon's purchase of the grocery chain Whole Foods last year. The retail giant's success has also made Bezos' the richest person in recent history .\nThe self-made billionaire's annual shareholder letters help illustrate the philosophy that has made him successful as a CEO: build culture, empower people, obsess over customers, focus on the long term and take risks.\nIn his first annual letter, over ten years ago, the billionaire writes you must be willing to gamble if you want to be successful.\n\"Failure and invention are inseparable twins,\" he wrote. \"To invent you have to experiment, and if you know in advance that it's going to work, it's not an experiment.\"\nLike this story? Like CNBC Make It on Facebook . \nSee also: \nJeff Bezos says he learned this critical business skill while visiting his grandfather as a child \nBillionaire Jeff Bezos says being smart isn't enough—you also need this to be successful \nJeff Bezos' wife would rather have a child with 9 fingers than one who can't do this \nshow chapters Jeff Bezos’ wife would rather have a child with 9 fingers than one without this skill      8:30 AM ET Tue, 21 Nov 2017 | 00:47", "external_links": [], "published": "2018-01-26T19:21:00.000+02:00", "crawled": "2018-01-26T19:26:14.019+02:00", "highlightTitle": ""}