{"organizations": [], "uuid": "11c91df0aa39208c3b477aeb33bb70c877ec1ed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/01/103350109-GettyImages-480659696.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/bank-of-america-customers-protest-new-requirements-for-free-checking.html", "country": "US", "domain_rank": 767, "title": "Bank of America customers protest new requirements for free checking", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T19:33:00.000+02:00", "replies_count": 0, "uuid": "11c91df0aa39208c3b477aeb33bb70c877ec1ed0"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/bank-of-america-customers-protest-new-requirements-for-free-checking.html", "ord_in_thread": 0, "title": "Bank of America customers protest new requirements for free checking", "locations": [], "entities": {"persons": [{"name": "kevin mccoy", "sentiment": "negative"}, {"name": "patrick t. f", "sentiment": "negative"}, {"name": "mel san", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "negative"}, {"name": "bloomberg | getty images  some bank of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Some Bank of America customers are protesting a rule change that makes it harder for consumers with low balances to continue receiving free checking.\nThis month, the banking giant switched e-banking customers into accounts that require a $12 monthly fee unless they have a direct monthly deposit of $250 or more or maintain a minimum daily balance of at least $1,500.\nArguing that the requirements are beyond the financial reach of many lower-income individuals and families, bank customers have launched a Change.org petition that asks Bank of America to drop the requirements. The petition had drawn more than 46,000 signers as of Tuesday.\n\"Bank of America was known to care for both their high income and low income customers. This is what made Bank of America different,\" wrote Mel San, who launched the petition. \"I urge you to let Bank of America realize that this is unfair to their customers that have been loyal to them for years.\"\nRead more from USA Today:\nThe best banks and credit unions for 2018 \nBitcoin: If currency crashed, plunge would harm its investors but not economy \nTrump's 30% tariff on imported solar panels may cost jobs \n\nThe protest comes as some U.S. banks examine appropriate charges for basic checking accounts that run up maintenance costs but also provide a source of income through overdraft fees.\nCharlotte, N.C.-based Bank of America, the nation's largest bank by deposits, stopped offering the basic, e-banking accounts to new customers in 2013 and started switching existing customers to regular checking accounts more recently. The bank said the e-banking accounts were not designed to target lower-income customers.\nA small segment of the bank's customers had remained in the e-banking accounts until recent weeks, drawn in part by the knowledge they would only face an $8.95 monthly fee if they used bank tellers for routine transactions.\nAccording to the bank, students under age 24 are eligible for an exemption that would enable them to continue their e-banking accounts. But others are being switched to regular accounts. The bank said it does not break out numbers of customers by specific types of service.\n\"Our Core Checking account provides full access to all our financial centers, ATMs, mobile and online banking and offers several ways to avoid a monthly fee, including a monthly direct deposit of $250, which equates to $3,000 annually,\" said Betty Riess, a Bank of America spokeswoman. \"This is one of the lowest qualifiers in the industry and a great value.\"\nDuring a conference call with Wall Street analysts last week, Paul Donofrio, Bank of America's chief financial officer, said the U.S. banking industry has had little to no increases in deposit rates for traditional banking in recent years.\nAsked when that might change as banks face lower income and profits from some other banking services, Donofrio said: \"my guess is we're getting close to that point.\"\n\"We just don't know, though,\" added Donofrio.\"All I can tell you is that we're going to balance our customer needs, and we're going to balance the competitive marketplace with our shareholders' interests and we're going to do the right thing for all the parties.\"", "external_links": [], "published": "2018-01-23T19:33:00.000+02:00", "crawled": "2018-01-23T19:46:24.064+02:00", "highlightTitle": ""}