{"organizations": [], "uuid": "1c3ab9c7b875b5b671592cc5eca36ed2228bf16b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 54}, "facebook": {"likes": 220, "shares": 220, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961995-rsz_1eric_fanelli_hockey_portrait_1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/how-fanelli-hockey-makes-100000-a-year-selling-used-gear.html", "country": "US", "domain_rank": 767, "title": "How this hockey dad turned $750 in used equipment into a $100,000-a-year side gig", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:21:00.000+02:00", "replies_count": 0, "uuid": "1c3ab9c7b875b5b671592cc5eca36ed2228bf16b"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/how-fanelli-hockey-makes-100000-a-year-selling-used-gear.html", "ord_in_thread": 0, "title": "How this hockey dad turned $750 in used equipment into a $100,000-a-year side gig", "locations": [], "entities": {"persons": [{"name": "eric fanelli", "sentiment": "negative"}, {"name": "fanelli", "sentiment": "none"}, {"name": "andrea kramar eric fanelli", "sentiment": "none"}], "locations": [{"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "university of connecticut", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 Hours Ago | 02:49 SHARES \nSome businesses have an inauspicious start; Eric Fanelli's has a particularly unfortunate one: His cat peed on his hockey gear. But the search to replace his ruined paraphernalia would lead the Connecticut dad to launch a side hustle that now nets him over $100,000 a year. \nIt started with the hockey pants. Fanelli came across a used pair from the University of Connecticut's team at a local sports store. At $65, they were half the price of new ones — and arguably cooler. \n\"[Selling] used hockey equipment from schools? That's kind of neat,\" Fanelli recalls thinking in the store. \"It was kind of like a light bulb went off and I was like, 'I think I could do this [too].'\" \nBut how he would build his own business wasn't entirely clear. As a 44-year-old father of three daughters, aged 3, 7 and 9, who works as a full-time salesman at a transport company and coaches high school hockey, time to do anything else was hard to come by. CNBC | Andrea Kramar Eric Fanelli has cut down on his time playing in two hockey leagues to focus on his side hustle as a hockey equipment reseller. \nIn the precious hours he could find, Fanelli leaned into his hockey network to meet equipment managers at colleges in the Northeast. His pitch was simple: \"I'll give you money for gear you no longer use.\" He told them the story of how his life revolved around hockey — he was a player as a kid and in college at Southern New Hampshire University, and now he was coaching. That he always wanted to own his own hockey business. \n\"The head coach of the Boston University women's team thought my story was interesting,\" Fanelli says. For his first purchase, in 2015, Fanelli drove two hours from Connecticut to Boston to buy spare gloves, pads and jerseys. He paid $750. CNBC | Mary Stevens Eric Fanelli pulls down a used practice jersey he's sold on Sideline Swap from his Rocky Hill, Connecticut warehouse. \n\"I didn't have any business checks or anything like that,\" he remembers. \"Having three little girls, my wife had checks from the movie 'Frozen' so that's what I gave the guy and he kind of laughed at me.\" \nFrozen checks aside, he had just started his business, Fanelli Hockey, with inventory from one of the best collegiate hockey programs in the country. And it didn't hurt that the team had made an appearance at the national championship in 2013. \n\"I kind of marketed it as 'Today's a great day to buy some BU gear' on Facebook and before you knew it, it was all sold,\" for a profit of about $350, he says. Trips to other schools like Brown and Princeton soon followed, before Fanelli made the jump to buying gear from professional teams. A jersey from the Manchester Monarchs, the minor league affiliate of the Los Angeles Kings, for example, could buy for about $25 and re-sell for $65. \nTrip after trip, his house looked more and more like a sporting goods store with sticks and goalie pads scattered about. \"I didn't have a warehouse at that point so my basement was the storage facility,\" he says. \nWhen the hassle of listing items on Facebook became too much work six months in, he started selling on Sideline Swap , an online marketplace for sports gear. He saw his sales climb from just a few thousand in his first year to over $250,000 in 2017. CNBC | Mary Stevens Fanelli and his daughter work together in his basement to pack up a hockey stick he's sold. \nWhen the opportunity to buy $30,000 worth of used gear from the University of Michigan came up in July, Fanelli took out a loan with his credit card company (a promotional interest rate made it cost-effective). He flew to Ann Arbor, rented a truck and then drove 12 hours straight back home to unload his haul in his basement in the middle of the night. \n\"That is the hardest part when I leave for a weekend,\" says Fanelli, who also coaches his daughters' hockey teams between his once-a-month sourcing trips. \"I'm leaving the kids and that that's precious time that I'd like to get back with them, but they understand the sacrifice that I'm trying to make for everybody to do this full-time.\" \nNow, Fanelli spends 30 hours a week on the business, taking pictures of inventory, uploading descriptions and listing items to sell from the 1600-square-foot warehouse he had to lease late last year. He knows jumping ship on his day job would mean giving up perks like 401(k)-matching, a car allowance and healthcare to name a few. But Fanelli still plans to do it — for him, those comforts pale in comparison to building out a brand with his name attached to it. \n\"The pride behind that is pretty amazing,\" he says, adding it's shared by his kids. \"They have fun with it and they help me package quite a few items over the weekend.\" CNBC | Andrea Kramar Fanelli waits for his daughter to board the bus to school before heading to his day job and his warehouse. \nAnd perhaps even more important is the flexibility that his business could one day bring if sales continue to grow. Setting his own hours would mean having the luxury of being more present in his family's life. \n\"You know, being able to get my kids on the bus every day … having myself there when they get home from school and helping with their homework is just something that kind of fuels me.\" \nFor now, Fanelli estimates he's about $2,000 in additional sales per month from making the jump — a figure he says could be just a few months away at his current trajectory. \n\"I'm getting closer and closer every month to doing this as … my dream job,\" he says. ", "external_links": [], "published": "2018-01-25T16:21:00.000+02:00", "crawled": "2018-01-25T16:50:07.001+02:00", "highlightTitle": ""}