{"organizations": [], "uuid": "87d63515295fe71bb4ed592b86d61a4e2bce5a61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/23/104789412-GettyImages-159242135.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/why-saudi-aramco-is-trying-to-make-vehicle-engines-more-efficient.html", "country": "US", "domain_rank": 767, "title": "Why Saudi Aramco, the world's largest oil company, is trying to make vehicle engines more efficient", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T18:46:00.000+02:00", "replies_count": 0, "uuid": "87d63515295fe71bb4ed592b86d61a4e2bce5a61"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/why-saudi-aramco-is-trying-to-make-vehicle-engines-more-efficient.html", "ord_in_thread": 0, "title": "Why Saudi Aramco, the world's largest oil company, is trying to make vehicle engines more efficient", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "aramco", "sentiment": "none"}, {"name": "saudi aramco cto ahmad al khowaiter", "sentiment": "none"}, {"name": "detroit auto show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Electric vehicle purchases are expected to surge in the coming years, but making conventional, gas-powered cars and trucks more efficient will be the most effective way of driving down emissions in the near term, Saudi Aramco's chief technology officer said.\nAramco, the world's largest oil company, is investing in technologies that will allow the internal combustion engine to burn gasoline more efficiently. Much of that research is being done at a research facility near Detroit.\nThe initiative comes at a time when several European countries, China and California have announced plans to ban the use, sale or production of vehicles with combustion engines under the hood. In Norway, that deadline is 2025 , while in many other areas the prohibition won't come until 2040.\nHowever, the internal combustion engine will continue to propel most of the world's vehicles for the foreseeable future, Saudi Aramco CTO Ahmad Al Khowaiter told CNBC on the sidelines of the Detroit Auto Show.\n\n\"Electric vehicles have a role to play, but we believe the most effective means to bring down emissions is to actually improve the efficiency of the internal combustion engine,\" he said.\nThe number of electric vehicles grew to about 2 million in 2016, a nearly 60 percent rise from the previous year, according to the International Energy Agency.\nBut that is still just 0.2 percent of all cars on the road, and hybrid-electric vehicles, which include gas engines, accounted for about 40 percent of all electric vehicles in 2016.\nStill, fuel efficiency standards are getting tougher around the world, said Khowaiter, who believes there are many opportunities to increase the combustion engine's efficiency.\nAramco has worked with European and American automakers to advance gasoline compression ignition, a technology that allows gas-powered engines to roughly match the efficiency of diesel engines.\nAsked whether he's worried about a U.S. ban on the internal combustion energy, Khowaiter said polices that attempt to pick winners are often counterproductive.\n\"We believe policy should be technology agnostic. Let the best technology win because that usually serves the best purpose for policy,\" he said.\nSaudi Aramco is planning to take a portion of the company public in what is widely expected to be the world's biggest ever share offering. The initial public offering is part of Crown Prince Mohammed bin Salman's plans to create the world's largest sovereign wealth fund and diversify Saudi Arabia 's oil-dependent economy.\nKhowaiter declined to comment on the IPO.", "external_links": [], "published": "2018-01-16T18:46:00.000+02:00", "crawled": "2018-01-16T18:55:15.019+02:00", "highlightTitle": ""}