{"organizations": [], "uuid": "47506d23a509ba0ea8a893a84f4d16ec3be24ad9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926284-co-foundersRESIZED.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/how-2-students-built-multimillion-dollar-couch-in-a-box-company-burrow.html", "country": "US", "domain_rank": 767, "title": "How 2 students turned their idea for an affordable couch-in-a-box into a multimillion-dollar company", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T18:06:00.000+02:00", "replies_count": 0, "uuid": "47506d23a509ba0ea8a893a84f4d16ec3be24ad9"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/how-2-students-built-multimillion-dollar-couch-in-a-box-company-burrow.html", "ord_in_thread": 0, "title": "How 2 students turned their idea for an affordable couch-in-a-box into a multimillion-dollar company", "locations": [], "entities": {"persons": [{"name": "stephen kuhl", "sentiment": "neutral"}, {"name": "kabeer chopra", "sentiment": "neutral"}, {"name": "chopra", "sentiment": "none"}, {"name": "kuhl", "sentiment": "none"}], "locations": [{"name": "wharton", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "franklin mortgage & investment company", "sentiment": "none"}, {"name": "university of pennsylvania", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kabeer Chopra (left) and Stephen Kuhl (right), co-founders of Burrow. SHARES \nAt the start of the fall semester in 2015, University of Pennsylvania classmates Stephen Kuhl and Kabeer Chopra were grabbing drinks at The Franklin Mortgage & Investment Company, a Philadelphia speakeasy. The friends were griping about something many college students, urban-dwellers and couch potatoes can relate to — the hefty price and hassle that comes with buying a new couch. \nHaving moved to the area to attend Wharton business school, Kuhl had recently purchased a sofa and was frustrated by the experience — there was the two-hour round-trip trek in a rented van to a New Jersey IKEA, the $600 price tag and the two-and-a-half hours spent putting it together. \nChopra was equally fed up by a saga involving a West Elm couch: He waited for a sale to buy one and was then told that for the medium-gray fabric he wanted, he would have to wait 12 weeks for delivery. Instead he settled for a color that was in stock: orange. To avoid paying for shipping, Chopra went to the store with a dolly and wheeled it home himself, pushing it for two blocks along a city sidewalk. \n\"We were talking about these experiences with each other and we thought, 'You know, maybe there's a better way to do this,'\" Kuhl, now 30, tells CNBC Make It . \"There are so many companies that have improved the experience in buying products by selling them directly to customers online…Why can't we do that with couches?\" \nInspired, Kuhl and Chopra decided to use the idea as a project for their entrepreneurship class. They spent their first semester at Wharton researching why a convenient, affordable and high-quality couch didn't exist, and found that the problem was the high cost of shipping such big, bulky items, which couldn't be stacked on top of each other. \nThe issue seemed surmountable, so the pair decided to look for a solution. \nWorking between classes from Chopra's apartment or at Huntsman Hall on campus, Kuhl drew elementary sketches of what a more delivery-friendly couch might look like: It would need cushions that could be compression sealed; a hinge in the couch would allow the backrest to fold down; and the legs would need to be removable. Plus the modules of the couch would have to be easily assembled without any tools, while still being sturdy. \nSome of Kuhl's original sketches \nKuhl and Chopra hired a furniture designer as well as an engineering firm that had experience making everything from Apple products to helicopters to create prototype after prototype. \n\"We reverse-engineered a high-quality couch to ship in compact boxes that fit within the FedEx and UPS commercial weight guidelines,\" Kuhl says. \n\"Instead of having a couch that costs several hundred dollars to ship from the factory to the warehouse to the retail store to the customer,\" he explains, they designed one that could ship anywhere in the U.S., straight from the factory, for less than $100. Getting creative about money \nIf only turning their dream into a reality was as affordable as their couches were meant to be. \n\"Neither Kabeer or I had any money,\" Kuhl says of his co-founder, also 30. \"We were accruing a lot of debt in business school, so we knew early on we had to get a lot of outside capital.\" \nIn the spring of 2016, they started with an initial round of funding from friends and family, raising $330,000. \nIt was an unusually painless experience. \"It kind of led me into a false sense of 'Oh, fundraising is easy,' because a lot of my friends and former bosses were just like, 'Look, you wouldn't be asking me for money unless you really believe in this, and I believe that you will do everything in your power to make this successful,'\" he recalls. \"So that was very rewarding.\" \nThe business partners were also able to attract the interest of Y Combinator — a start-up accelerator — early on, which invested $120,000. \nStill, Kuhl and Chopra had to be frugal. So they worked with people who believed in the vision enough to be \"financially flexible\": They found a law firm to do their basic start-up legal work that was willing to be paid at a later date. And their furniture designer agreed to a small sum up front. \n\"Starting a company is an exercise in being super creative about getting things accomplished with little to no money,\" Kuhl says. Couch-in-a-box becomes a reality \nBurrow , a name that they liked because it invoked a sense of comfort and coziness, was on its way. \nFor the next year, the co-founders were faced with balancing business school and their budding business. They spent the summer of 2016 splitting time between Y Combinator in California and making trips to their manufacturing facility in Mexico. \nAfter months of work, the entrepreneurs delivered 15 prototypes, mostly to people they knew. Kuhl recalls baggage-checking the very first couch, a three-seater, in a box on a plane from Mexico City and delivering it in an UberXL. \n\"The very first one delivered in late July, which is we were really proud of,\" Kuhl says. \"Kabeer was told he had to wait 12 weeks for the couch he wanted from West Elm. From the time we incorporated Burrow in April 2016 to when we delivered in late July of 2016, that was 12 weeks. We were proud of that.\" \nThe partners decided on a core design in October of 2016 and Burrow officially launched in April 2017. \nBurrow couches, which you order online, are modular, so they can be made bigger or smaller by adding or subtracting pieces. Prices range from $495 for an armchair to $1,745 for a four-seater with a chaise. Customers can pick from five different colors, and the couches feature a built-in hidden USB charging port as well as reversible cushions. Shipping is free, and Burrow says after your order ships via UPS, you'll receive your couch, packed in neat little boxes, in roughly two to five business days. \nThey already have new products in the pipeline, including a design with wooden legs. With sales growing 20 percent month after month, they've found their customer base tends toward professionals in their 20s and 30s in urban settings, but they have buyers as old as 60. \nOf course, not everything has been easy. Kuhl says that when they were taking pre-orders, they ran into numerous supply and distribution delays. \n\"At one point, Kabeer got a call from our factory [in Mexico] that something was on fire, the machine was on fire,\" says Kuhl. Though it turned out ok, \"That's just not something you want to hear when you're on a bus from New York to Philly,\" he says of Chopra, who was commuting from the company's headquarters in Manhattan back to school. Stephen Kuhl (left) and Kabeer Chopra (right), co-founders of Burrow. \nThere was also a fiasco with a box supplier who failed to deliver on-time. Late boxes meant a shipment of couches might be delayed too. So Kuhl sprang into action. \n\"I was down in Mexico at the time, and I literally had to make boxes by hand just to get this one shipment out the door in time,\" Kuhl says. \nWhen in a crunch, Kuhl says that communication has been key. Burrow always stays transparent with customers about the business's growing pains. \n\"Some things you can solve, and some th", "external_links": [], "published": "2018-01-09T18:06:00.000+02:00", "crawled": "2018-01-09T18:15:47.062+02:00", "highlightTitle": ""}