{"organizations": [], "uuid": "7f05788ae066be5d669b406bf939c2a13efdbff1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/21/104295553-Starbucks.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/starbucks-to-boost-pay-and-benefits-after-us-lowers-corporate-taxes.html", "country": "US", "domain_rank": 767, "title": "Starbucks to boost worker pay and benefits after US lowers corporate taxes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T13:13:00.000+02:00", "replies_count": 0, "uuid": "7f05788ae066be5d669b406bf939c2a13efdbff1"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/starbucks-to-boost-pay-and-benefits-after-us-lowers-corporate-taxes.html", "ord_in_thread": 0, "title": "Starbucks to boost worker pay and benefits after US lowers corporate taxes", "locations": [], "entities": {"persons": [{"name": "ramin talaie", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "starbucks", "sentiment": "positive"}, {"name": "walmart", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Starbucks will give domestic employees pay raises, company stock, and expanded benefits. The enhanced compensation is worth of more than $250 million, the company said. Starbucks is known for giving its workers more generous pay and benefits than other mass-market restaurants and retailers. \nStarbucks will use some of the savings from the new U.S. corporate tax cuts to give domestic employees pay raises, company stock and expanded benefits with a combined worth of more than $250 million, the company said on Wednesday. \nWith the announcement, the world's biggest coffee chain joins companies like Walmart , Apple , Comcast , and American Airlines in sharing their tax savings with employees. \nStarbucks is known for giving its workers, which it calls \"partners,\" more generous pay and benefits than other mass-market restaurants and retailers. \n\"Investing in our partners has long been our strategy, and due to the recent changes in U.S. tax law, we are able to accelerate some significant partner investments,\" Chief Executive Kevin Johnson said in a letter to employees. \nStarbucks declined to say how much it expected its tax bill to drop under the new plan, and said executives would give details on its earnings call on Thursday. \nCredit Suisse analyst Jason West recently estimated that Starbucks' global tax rate could fall to about 24-25 percent from around 33 percent, which would drive roughly $425 million in annual tax savings. \nSeattle-based Starbucks said it will give hourly and salaried employees, who received pay raises in January, a second wage increase in April. \nIt is giving additional stock grants to eligible employees on April 16. Coffee shop workers will receive a grant of at least $500 and store managers will receive $2,000 grants. \nStarting July 1, all employees will accrue paid time off to care for themselves and loved ones when they are ill. Starbucks said the national benefit was designed to match or exceed the benefits some partners were already due under existing city or state-mandated paid sick leave laws. \nStarbucks also expanded its parental leave policy for cafe workers, giving non-birth parents up to six weeks of paid leave when welcoming a new child. \n( Disclosure: Comcast is parent of NBCUniversal and CNBC. ) Click to show more \nData is a real-time snapshot *Data is delayed at least 15 minutesGlobal Business and Financial News, Stock Quotes, and Market Data and Analysis \nData also provided by ", "external_links": [], "published": "2018-01-24T13:13:00.000+02:00", "crawled": "2018-01-24T13:34:50.027+02:00", "highlightTitle": ""}