{"organizations": [], "uuid": "ec581637aa2cbab6e4f31ccf96a84ceff2537672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/07/104932669-GettyImages-890941934_1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/apple-falls-as-iphone-x-order-cut-reports-mount.html", "country": "US", "domain_rank": 767, "title": "Apple shares are falling on fears of plunging iPhone X demand", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T16:06:00.000+02:00", "replies_count": 0, "uuid": "ec581637aa2cbab6e4f31ccf96a84ceff2537672"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/apple-falls-as-iphone-x-order-cut-reports-mount.html", "ord_in_thread": 0, "title": "Apple shares are falling on fears of plunging iPhone X demand", "locations": [], "entities": {"persons": [{"name": "sergii kharchenko", "sentiment": "negative"}, {"name": "narci chang", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "j.p. morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 Hours Ago | 02:00 \nApple shares are dropping Monday after a report that the company ordered a drastic cut in iPhone X production. \nNikkei reported Monday that the tech giant told its suppliers to reduce iPhone X production to 20 million units for the first quarter from the more than 40 million units target Apple gave in November. The news agency cited weaker-than-expected sales results at the end of the holiday season as the reason for the move. \nApple shares are down 1.9 percent Monday after the report. The stock has dropped 4.9 percent since Jan. 22, wiping out $45 billion in shareholder value in the past week. \nThe Nikkei article follows several recent reports from Wall Street and other media outlets pointing to weak iPhone X demand. \nJ.P. Morgan analyst Narci Chang wrote a research note to clients on Tuesday predicting iPhone X production will drop 50 percent in the March quarter versus the December quarter. She reduced her forecast for iPhone X production to 20 million units for the first quarter from 30 million units. \n\"We recently picked up more signs of weakening iPhone X orders,\" she wrote. \nTaiwan's Economic Daily also reported in late December that Apple reduced its sales forecast for the iPhone X. \nAs a result some Wall Street analysts are getting worried enough over iPhone demand to downgrade the tech giant's shares this month. Longbow Research lowered its rating on Apple shares to neutral from buy on Jan. 17, predicting the company will ship fewer iPhones than expected in fiscal 2018. \nAtlantic Equities then reduced its rating on Apple shares to neutral from overweight on Jan. 22. The firm predicted weaker-than-expected sales for the company's March quarter. \nInvestors are taking notice of the deteriorating sentiment over the company's fundamentals. \nThe company did not immediately respond to a request for comment.", "external_links": [], "published": "2018-01-29T16:06:00.000+02:00", "crawled": "2018-01-29T16:10:33.021+02:00", "highlightTitle": ""}