{"organizations": [], "uuid": "1efbad41a9d70697abe1e6b37c886cd96e0ba557", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950323-Screen-Shot-2018-01-17-at-8.39.15-AM.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/democrats-flip-wisconsin-district-that-trump-won-by-17-points.html", "country": "US", "domain_rank": 767, "title": "Democrats flip Wisconsin district that Trump won by 17 points", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T15:55:00.000+02:00", "replies_count": 0, "uuid": "1efbad41a9d70697abe1e6b37c886cd96e0ba557"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/democrats-flip-wisconsin-district-that-trump-won-by-17-points.html", "ord_in_thread": 0, "title": "Democrats flip Wisconsin district that Trump won by 17 points", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "positive"}, {"name": "patty schachtner", "sentiment": "positive"}, {"name": "barack obama", "sentiment": "none"}, {"name": "adam jarchow", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "schachtner", "sentiment": "none"}], "locations": [{"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "tedx | youtube patty schachtner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Democrat has been elected to represent a traditionally conservative Wisconsin senate district where voters overwhelmingly supported in 2016, in an upset that Democrats suggest could lead to more Republican losses in the state.\nPatty Schachtner's victory in the 10th Senate District late Tuesday could be a sign of hope for Democrats, who have been pushed to the brink of irrelevancy after seven years of Republican control of both legislative houses and the governor's office.\nSchachtner, who entered the race in northwestern Wisconsin as the clear underdog, said her win suggests voters are tired of negative politics.\n\"People sent a message tonight: We don't want to be negative anymore,\" she said. \"Change it up. I ran a positive campaign. ... My message has always been be kind, be considerate and we need to help people when they're down.\"\nSchachtner's victory doesn't change the balance of power in the state Senate. Republicans will go into the fall campaign season with an 18-14 majority and one vacancy.\nBut Schachtner said the victory \"certainly could be\" a bad sign for Republicans elsewhere in the state this year.\nWisconsin Democratic Party chair Martha Laning underscored that sentiment, posting on Facebook that a \"change is coming!!!\"\nRep. Adam Jarchow tweeted his concession to Schachtner on Tuesday night, when returns were nearly complete across five northwestern Wisconsin counties and Schachtner was leading by more than 1,600 votes.\nThe district has trended red for years, and every county in the district voted for Trump in 2016. Republican Sheila Harsdorf held the Senate seat for 16 years before she resigned in November to become Gov. Scott Walker's agriculture secretary. Jarchow is in the middle of his third term representing the area in the Assembly and had built a formidable base.\nBut Democrats banked that an anti-Trump backlash could even the playing field. Republicans sensed it, too. Conservative groups Americans for Prosperity and the Republican State Leadership Committee ran ads supporting Jarchow, and Republican state Sen. Leah Vukmir, who is running for U.S. Senate, traveled to the district to campaign for him.\nIt wasn't enough, even in a district that Barack Obama lost by 6 points in 2012 and Hillary Clinton lost by 17 to Trump.\nSchachtner, the St. Croix County medical examiner and a Somerset school board member, said for now she's focused on serving her new constituents.", "external_links": [], "published": "2018-01-17T15:55:00.000+02:00", "crawled": "2018-01-17T16:07:47.008+02:00", "highlightTitle": ""}