{"organizations": [], "uuid": "2dcf52525d5d774d2ac5cc8c112f3847ccf2e017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-tech-ces-toyota/toyota-unveils-self-driving-concept-vehicle-for-rides-deliveries-idUSKBN1EX1XE", "country": "US", "domain_rank": 408, "title": "Toyota unveils self-driving concept vehicle for rides, deliveries", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T19:31:00.000+02:00", "replies_count": 0, "uuid": "2dcf52525d5d774d2ac5cc8c112f3847ccf2e017"}, "author": "", "url": "https://www.reuters.com/article/us-tech-ces-toyota/toyota-unveils-self-driving-concept-vehicle-for-rides-deliveries-idUSKBN1EX1XE", "ord_in_thread": 0, "title": "Toyota unveils self-driving concept vehicle for rides, deliveries", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "negative"}, {"name": "pizza hut", "sentiment": "none"}, {"name": "mazda motor corp", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "min read  las vegas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "toyota motor corp", "sentiment": "none"}, {"name": "didi chuxing technology co", "sentiment": "none"}, {"name": "alexandria sage", "sentiment": "none"}, {"name": "uber technologies inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 35 PM / Updated 17 minutes ago Toyota unveils self-driving concept vehicle for rides, deliveries Alexandria Sage 3 Min Read \nLAS VEGAS (Reuters) - Toyota Motor Corp announced on Monday a self-driving electric concept vehicle that it will tailor for companies to use for tasks like ride hailing and package delivery, underscoring how automakers are no longer simply building cars but also providing services to go with them. \nThe world’s second-biggest carmaker said it plans to begin testing the e‐Palette concept vehicle in various regions, including the United States, in the early 2020s. It will come in three sizes: a bus-sized vehicle, a shuttle and a small delivery vehicle sized to run on sidewalks. \nToyota said at the CES global technology conference in Las Vegas that it will work with companies including Amazon.com Inc, Chinese ride-hailing company Didi Chuxing Technology Co, Pizza Hut, Mazda Motor Corp and Uber Technologies Inc[UBER.UL] to build the vehicle and its hardware and software support and develop connected mobility products. \nAfter intense research and development in self-driving technology, automakers are beginning to unveil clearly defined autonomous vehicle strategies and looking to apply the technology to uses like ride services, shuttle services and package deliveries. \nToyota took longer than rivals to warm to the idea of autonomous vehicles, but has committed $1 billion through 2020 to develop advanced automated driving and artificial intelligence technology. It plans to begin testing cars that can drive themselves on highways around 2020. \n“This announcement marks a major step forward in our evolution towards sustainable mobility, demonstrating our continued expansion beyond traditional cars and trucks to the creation of new values including services for customers,” said Toyota President Akio Toyoda in a statement. \nThe vehicle features an open control interface enabling Toyota’s partner companies to install their own automated driving system. Toyota’s so-called “guardian” technology will then act as a safety net, the company said. \nCarmakers, tech companies and other service providers have partnered on self-driving projects over past two years, due to the difficulty and high cost of developing such technology alone. Reporting By Alexandria Sage; Editing by Meredith Mazzilli", "external_links": [], "published": "2018-01-08T19:31:00.000+02:00", "crawled": "2018-01-08T19:42:59.007+02:00", "highlightTitle": ""}