{"organizations": [], "uuid": "1c5359cc68ac182345ed9e16157e307df4fa79a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958719-GettyImages-500342214.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/the-patriots-and-eagles-will-square-off-in-super-bowl-52.html", "country": "US", "domain_rank": 767, "title": "The Patriots to face off with the Eagles at Super Bowl LII", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T12:59:00.000+02:00", "replies_count": 0, "uuid": "1c5359cc68ac182345ed9e16157e307df4fa79a4"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/the-patriots-and-eagles-will-square-off-in-super-bowl-52.html", "ord_in_thread": 0, "title": "The Patriots to face off with the Eagles at Super Bowl LII", "locations": [], "entities": {"persons": [{"name": "brady", "sentiment": "none"}, {"name": "fletcher cox", "sentiment": "none"}, {"name": "rob gronkowski", "sentiment": "none"}, {"name": "tom brady", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "foxboro", "sentiment": "none"}], "organizations": [{"name": "eagles", "sentiment": "negative"}, {"name": "gillette stadium", "sentiment": "none"}, {"name": "lombardi trophy", "sentiment": "none"}, {"name": "jacksonville jaguars", "sentiment": "none"}, {"name": "pittsburgh steelers", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Brady and the New England Patriots are going back to the Super Bowl in search of a sixth title.\nThey'll face a Philadelphia Eagles team looking for their first Lombardi Trophy.\nBrady led the Patriots (15-3) back from a 10-point, fourth-quarter deficit to beat the Jacksonville Jaguars 24-20 in the AFC championship game Sunday.\nStarting his 36th playoff game, Brady shook off an injury to his right hand and the loss of top target Rob Gronkowski to rally the Patriots to their record 10th Super Bowl appearance.\nThe Patriots will try to match the Pittsburgh Steelers' six Super Bowl trophies when they face the Eagles (15-3) on Feb. 4 in Minneapolis.\nNick Foles, the backup QB who was thrust into the starting role when Carson Wentz blew out his left knee last month, led the Philadelphia to a 38-7 rout of the Minnesota Vikings in the NFC championship game.\nFoles threw for 352 yards and three touchdowns, showing poise and moxie in going 26 for 33.\nThe Vikings were hoping to become the first NFL team to serve as host to a Super Bowl in its own stadium, but they followed up their \"Minneapolis Miracle \" with a \"Flop in Philly.\"\nSo, they'll clear out their lockers long before the Eagles and Patriots and their fans take over U.S. Bank Stadium for Super Bowl 52 in two weeks.\nThe Patriots and Eagles, who last won an NFL title in 1960, several years before the first Super Bowl, met in the Super Bowl after the 2004 season with the Patriots prevailing 24-21.\nHours after Brady's game-winning 4-yard TD pass to Danny Amendola with 2:48 remaining in Foxborough, the Eagles won for the fourth time in five tries under Foles.\nIt started out ominously, however.\nThe Vikings celebrated Kyle Rudolph's 25-yard touchdown catch from Case Keenum on their opening drive by mimicking the Olympic sport of curling for their TD celebration.\nIt was the Eagles who had all the fun after that.\nPatrick Robinson's spectacular 50-yard interception return got Philadelphia started. Then Foles and his offence tore up the league's stingiest scoring defence, with long TD throws to Alshon Jeffery and Torrey Smith. LeGarrette Blount had an 11-yard scoring run when things were decided in the first half, and the Eagles were headed to an NFL title game the Vikings (14-4) hoped to be in at their own stadium.\n\"You know everyone was against us,\" Foles said. \"Coming out here and stick together and (we) come away with an amazing victory against a great team.\"\nBlake Bortles and the stingy Jaguars (12-7) led New England 20-10 early in the fourth quarter, but couldn't hold against the defending champions.\nThe NFL's second-ranked defence kept Brady and the Patriots at bay for most of the game, but lost linebacker Myles Jack and defensive tackle Marcell Dareus on consecutive plays on New England's winning drive.\nIt was New England's 13th win in 14 games since their 2-2 start. Their only stumble since September was a 27-20 loss at the Dolphins on Dec. 11.\nBrady, wearing a black bandage on his right hand after needing stitches to close a cut that happened on a play during practice earlier in the week, showed no signs of being hampered.\nAnd, with the game — and the season — possibly on the line, the Patriots star came up big again.\n\"I've had a lot worse,\" Brady said. \"I didn't know that on Wednesday. It was a crazy injury. Wednesday, Thursday, Friday was a little scary. Then I started getting some confidence and today we did just enough to win.\"\nBrady finished 26 of 38 for 290 yards and two touchdowns to Amendola.\nIt's the eighth Super Bowl appearance for Brady and coach Bill Belichick, who have won five times — including last year's 34-28 overtime rally against the Falcons.\n\"It's pretty amazing,\" Brady said. \"Just to be on a team that wins these kinds of games, it's just a great accomplishment.\"", "external_links": [], "published": "2018-01-22T12:59:00.000+02:00", "crawled": "2018-01-22T14:54:31.021+02:00", "highlightTitle": ""}