{"organizations": [], "uuid": "91c7b860ce626bd33ccbc30a4334fc7f46696dc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/27/103747664-DSC_3174.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/huge-interest-in-robinhood-crypto-has-skeptics-worried-about-a-bubble.html", "country": "US", "domain_rank": 767, "title": "People show huge interest in Robinhood Crypto, but skeptics worry it will just fuel the bubble", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T23:37:00.000+02:00", "replies_count": 0, "uuid": "91c7b860ce626bd33ccbc30a4334fc7f46696dc7"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/huge-interest-in-robinhood-crypto-has-skeptics-worried-about-a-bubble.html", "ord_in_thread": 0, "title": "People show huge interest in Robinhood Crypto, but skeptics worry it will just fuel the bubble", "locations": [], "entities": {"persons": [{"name": "vlad tenev", "sentiment": "negative"}, {"name": "joe saluzzi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "coinbase", "sentiment": "none"}], "organizations": [{"name": "robinhood crypto", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "robinhood", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Just over 24 hours since no-fee stock trading app Robinhood announced it would roll out free digital currency trading in February, 530,000 and counting have signed up to \"get early access.\"\nThat surge of interest has quickly brought out the critics: skeptics of bitcoin 's skyrocketing price and Robinhood's ability to provide fair prices for customers.\n\"I think it's buyer beware,\" said Joe Saluzzi, co-founder and partner at Themis Trading. \"It's not a stock. It's not a security.\"\nFor all the worries about it being a \"bubble,\" bitcoin has become a big business. As its price soared 2,000 percent in the 12 months through mid-December to above $19,000, Coinbase, the leading U.S. marketplace for trading major cryptocurrencies, more than doubled its userbase to over 13 million. \nRobinhood announced Thursday it is planning to use the same method it used to undercut online stock brokers by rolling out free bitcoin and ethereum trading in five states beginning in February. \nAnd again, critics aren't sure that's a viable business model. \n\"Isn't this 100% about embedding the fees in either the bid-ask spread, currency exchange or both?\" Bill Gurley, general partner at Benchmark Capital, asked in a Thursday afternoon tweet.\n\"Almost certainly,\" replied Union Square Ventures partner Fred Wilson tweeted Thursday afternoon. He noted he was biased as an investor and board member at Coinbase, \"but I would prefer to know the fees vs. having them buried.\"\nRobinhood co-founder Vlad Tenev responded by emphasizing Robinhood Crypto's aim of just breaking even, and said customers will see an estimated purchase price. \nThe bigger worry is that if bitcoin is a bubble, Robinhood making it easier to buy bitcoin will only fuel the mania. \nSaluzzi pointed out that even though Coinbase's fees are \"enormous\" compared to the stock industry, they work because people are \"beating down the door to get in\" and expect \"400 to 500 percent return.\"\nIn about two hours Friday afternoon, the waitlist on Robinhood Crypto jumped by more than 40,000 to 573,000. \nThe company has many other significant advantages over existing digital currency exchanges, some say. Users will also be able to manage their crypto, stock, options and ETFs trading from the same platform.\n\"Now there's one brokerage you can use for all of your investing,\" said Ryan Gilbert, partner at Propel Venture Partners, which is indirectly a minority investor in Coinbase. Gilbert is also personally invested in funds that have investments in Robinhood. \"It has done more to empower investors in the bitcoin space than any of their competitors could dream of doing.\"\nCoinbase didn't immediately respond to a CNBC.com request for comment on this article.\nRobinhood also brings some sense of credibility to cryptocurrency trading since its stock-and-options trading arm is a member of the Financial Industry Regulatory Authority (FINRA) and the Securities Investor Protection Corporation (SIPC). Robinhood Crypto isn't a member and its website points out that \"cryptocurrencies are not stocks and your cryptocurrency investments are not protected by either FDIC or SIPC insurance.\"\nBut if Coinbase was able to become a leading U.S. cryptocurrency exchange with high fees, it's unclear what could stop Robinhood Crypto's growth.\nLeigh Drogen, the founder and CEO of Estimize, a six-year-old company that collects and publishes financial estimates for data such as earnings, says Robinhood Crypto may ultimately pressure competitors to lower fees. \"They will burn this industry to the ground, cause a race to the bottom in fees, and take whatever is left.\"\nAnd Robinhood's slow phase-out in five states — Coinbase is in at least 36 — shouldn't be much of a deterrent to quality growth, Drogen said.\n\"They are the masters of the wait list.\"", "external_links": [], "published": "2018-01-26T23:37:00.000+02:00", "crawled": "2018-01-26T23:57:57.002+02:00", "highlightTitle": ""}