{"organizations": [], "uuid": "bf2b84112b6786d01129597fc4052fbbed81cee1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104911551-GettyImages-874216492-mcconnell.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/how-democrats-can-neutralize-gop-tax-law-commentary.html", "country": "US", "domain_rank": 767, "title": "How Democrats can neutralize GOP tax law", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T21:24:00.000+02:00", "replies_count": 0, "uuid": "bf2b84112b6786d01129597fc4052fbbed81cee1"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/how-democrats-can-neutralize-gop-tax-law-commentary.html", "ord_in_thread": 0, "title": "How Democrats can neutralize GOP tax law", "locations": [], "entities": {"persons": [{"name": "andr", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "jennifer flynn", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "michael kink", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "neutral"}, {"name": "mins ago getty images senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Republicans managed in the last throes of 2017 to push through a tax bill that was both widely loathed and widely predicted to hurt the economy. Democrats across the country are expected to use the law as a weapon against Republican opponents come the midterm elections.\nBut we can do more than just oppose the law. This is also an opportunity for governors, mayors, and state and local lawmakers to craft responses that both lessen the damage and provide a launching pad for better, fairer fiscal policies that win broad popular support.\nNew York Governor Andrew Cuomo made a good start this week . To lessen the damage, he proposed a still-deductible state payroll tax and new public charities that could offset GOP-imposed tax burdens on the middle class. And he targeted new assessments on big corporations that got windfall gains from the unpopular GOP tax bill.\nMore governors must fight for fairness. In states like New York, California, New Jersey, Illinois, Massachusetts and Pennsylvania, for example, billionaires and huge multinational corporations will enjoy a trillion-dollar windfall from the GOP tax bill.\nDemocratic Governors like Cuomo and Jerry Brown should make sure the super-wealthy and the biggest corporations continue to pay their fair share. And progressive lawmakers in Illinois and Massachusetts should challenge GOP Governors Bruce Rauner and Charlie Baker to follow suit or explain why they won't.\nThere are a number of policy options on the menu to protect working families, mitigate the worst effects of the tax bill, and make state tax codes more fair.\n\"Democratic Governors like Cuomo and Jerry Brown should make sure the super-wealthy and the biggest corporations continue to pay their fair share.\" First, states can close loopholes that Congress refuses to close.\nA perfect example is the carried-interest loophole, which allows hedge fund billionaires and private equity titans to pay lower tax rates than teacher and truck drivers. Campaign cash and furious lobbying kept the loophole alive, despite Trump's promises to kill it.\nState legislation has been or will be introduced in ten states to tax carried interest at the state level until Congress takes action – Governor Cuomo included it in his budget proposal, Governor Murphy is set to follow, and lawmakers in other states are pushing bills forward.\nThose bills should pass this year, and they will raise billions for urgent public needs – including tax relief for working people hit by the new GOP tax laws.\nSecond, every state in the country should calculate the windfall that's coming to the biggest corporations and the richest families and take back a reasonable percentage of the ill-gotten gains.\nCorporations that don't invest in jobs and pay raises for their front-line workers should be penalized. Congress and Trump claim it will happen, but they didn't put any real teeth behind their assertions.\nThe first governors and lawmakers who propose a \"money-back guarantee\" for taxpayers to take tax breaks and subsidies away from big corporations that don't create jobs will deserve every bit of the massive applause they'll get.\n\"Clawback\" or \"recapture\" provisions can and will raise billions more to invest in our public schools, affordable, quality healthcare, clean-energy mass transit infrastructure and the safety net for seniors and the very poor.\nThird, every state in the country should consider inheritance taxes, land taxes and stock-transfer taxes to reduce extreme inequality and broaden economic prosperity.\nState lawmakers should increase inheritance taxes on the heirs and heiresses of billionaires who get new tax breaks under the GOP tax plan – and they won't have to touch any family farms or small business owners.\nWe should make the wealthiest landowners in the biggest cities pay their share for infrastructure and mass-transit improvements that benefit them as well as the broader public.\nAnd we should crack down on dangerous high frequency trading on Wall Street by imposing a small stock-transfer tax , known as the \"Robinhood tax\" that will hit the wildest speculators and the \"flash boys\" – not the small investor .\nFinally, activists from all over the country can and will hold the GOP Senators and House members who voted for this plan accountable.\nThe GOP tax bill marked a victory for the insiders, the system-riggers and the huge campaign contributors – but it also provided a first-hand view of how the super-rich and multinational corporations use their wealth and power to get even more wealth and power.\nAfter passage of the bill, no lawmakers should get to vote for the interests of lobbyists and billionaires, hurt their constituents, and still keep their seat in a vigorous, functioning democracy.\nPeople power can fight back.\nAnd when we take action at the state and local levels, then vote out those who looted our government, we will be taking big, important steps towards undoing the GOP tax scams and rebuilding an economy that works for everyone.\nCommentary by Jennifer Flynn, the director of Healthcare Justice at the Center for Popular Democracy and Michael Kink, the executive director of the Strong Economy for All Coalition. Follow them on Twitter @jenniferflynn and @mkink .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-17T21:24:00.000+02:00", "crawled": "2018-01-17T22:07:22.000+02:00", "highlightTitle": ""}