{"organizations": [], "uuid": "c3f965c5e688bfabdc74fbb752aab544a192bcaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962337-GettyImages-648175144.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/us-news-world-report-the-top-10-best-countries-in-the-world.html", "country": "US", "domain_rank": 767, "title": "These are the top 10 best countries in the world", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T21:55:00.000+02:00", "replies_count": 0, "uuid": "c3f965c5e688bfabdc74fbb752aab544a192bcaa"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/us-news-world-report-the-top-10-best-countries-in-the-world.html", "ord_in_thread": 0, "title": "These are the top 10 best countries in the world", "locations": [], "entities": {"persons": [], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here are the top 10 best countries as detailed in the 2018 U.S. News & World Report: 10. Netherlands \nAlso in the top 10 best countries for: most business-friendly, most modern, entrepreneurship, quality of life, best countries to headquarter a corporation, raising kids, travel alone, most transparent countries, green living, women. 9. France \nAlso in the top 10 best countries for: cultural influence, power, heritage & richest traditions, most influential, education, starting a career. 8. United States \nAlso in the top 10 best countries for: cultural influence, entrepreneurship, power, most forward-looking, most influential, education. 7. Australia \nAlso in the top 10 best countries for: cultural influence, most modern, quality of life, most-forward looking, best countries to headquarter a corporation, raising kids, traveling alone, green living, investing in, education, retiring comfortably, women. 6. Sweden \nAlso in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, quality of life, best countries to headquarter a corporation, raising kids, transparency, green living, education, retiring comfortably, women. 5. Japan \nAlso in the top 10 best countries for: cultural influence, entrepreneurship, power, up & coming economies, most-forward looking, most influential, green living, education. 4. United Kingdom \nAlso in the top 10 best countries for: cultural influence, entrepreneurship, power, starting a business, most forward-looking, most influential, transparency, education, starting a career. 3. Germany \nAlso in the top 10 best countries for: most modern, entrepreneurship, quality of life, power, most forward-looking, headquartering a corporation, most influential, transparency, green living, education, women. 2. Canada \nAlso in the top 10 best countries for: most business-friendly, most modern, entrepreneurship, quality of life, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, retiring comfortably, women. 1. Switzerland \nAlso in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, quality of life, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, retiring comfortably, women. \nAlong with the country rankings, respondents were also asked to share their opinions of major world leaders for the first time in the survey's three-year history. Although their opinions weren't factored into the countries' rankings, the results provided insight on their current issues. \nAlphabet executive chairman Eric Schmidt was the most respected business leader, according to the report. \nIn terms of global leaders, nearly 60 percent of respondents disapproved of U.S. president Donald Trump. Second to Trump was Russian president Vladimir Putin, who had a 44 percent disapproval rate. \nCanada's Prime Minister Justin Trudeau and Germany's chancellor Angela Merkel were the most respected leaders.", "external_links": [], "published": "2018-01-23T21:55:00.000+02:00", "crawled": "2018-01-23T22:09:58.002+02:00", "highlightTitle": ""}