{"organizations": [], "uuid": "3c87166006e91ee0ac74accafd2cf247a635e1a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "A Year Ago, Davos Thought Trump Would Be a Normal President – Fortune", "url": "http://fortune.com/2018/01/21/donald-trump-davos-world-economic-forum/", "country": "US", "domain_rank": 1196, "title": "A Year Ago, Davos Thought Trump Would Be a Normal President", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T05:48:00.000+02:00", "replies_count": 0, "uuid": "3c87166006e91ee0ac74accafd2cf247a635e1a7"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/21/donald-trump-davos-world-economic-forum/", "ord_in_thread": 0, "title": "A Year Ago, Davos Thought Trump Would Be a Normal President", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dav", "sentiment": "none"}, {"name": "davos man", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Year Ago, Davos Thought Trump Would Be a Normal President President Donald Trump in Washington,DC on Jan. 19, 2018. Brendan Smialowski—AFP/Getty Images By Bloomberg 10:48 PM EST \nIf there was one message that echoed through the mountains ringing Davos a year ago, it was that the business world could ignore Donald Trump’s tweets. \nOnce in office, Trump would act more like a conventional American president and his torrent of Twitter taunts would surely slow, according to many of the executives who gathered in the Swiss town for the World Economic Forum just as he was inaugurated in 2017. The thousands of 140-character rants Trump has sent since then — including one calling himself a “very stable genius” to defend his mental health — show how wrong they were. The mostly male corporate and political personalities who descend on the Alpine resort each year don’t have a great track record at foretelling the future. \nTrump will be the center of attention at Davos again in the coming days, this time as the first sitting U.S. president in two decades to attend. As he takes his protectionist agenda straight to the internationalist elite, here’s a look back at the projections that didn’t come true (and those that did). What Davos Man got wrong about Trump… \nChitchat at Davos last January centered on Trump’s controversial campaign pledges to impose a travel ban on a number of predominately Muslim countries, to upend the North American Free Trade Agreement and to build a wall at the Mexican border. \n“What somebody’s saying is not necessarily what they’re going to do,” David Cote, chief executive officer of Honeywell International Inc. (hon) , said at the time. Companies needn’t fret over the president’s “one-liners” and instead focus on Trump’s cabinet nominees, added JPMorgan Chase & Co. (jpm) CEO Jamie Dimon: “I think that these very rational people will be very thoughtful when they go about the actual policy.” \nLast month, the U.S. Supreme Court allowed Trump’s travel ban to take effect pending appeal. Trump, meanwhile, reiterated his threat to pull out of Nafta even this month, saying that doing this could generate cash to build the southern wall. We must have Security at our VERY DANGEROUS SOUTHERN BORDER, and we must have a great WALL to help protect us, and to help stop the massive inflow of drugs pouring into our country! \n— Donald J. Trump (@realDonaldTrump) January 16, 2018 …and what he got right \nCorporate executives were correct to suggest Trump would be on their side and that the economy would continue to do well during his first year. “There seems to be a sense that we need to help corporate America,” Tom Farley, president of exchange operator NYSE Group, said at the time. \nGoldman Sachs Group Inc. (gs) CEO Lloyd Blankfein said Trump’s manifesto would be stimulative for the economy. Growth did, in the end, accelerate to a projected 2.3 percent versus 1.5 percent — although it’s hard to say how much of that was due to Trump-era policies. Goldman Sachs economists predict his fiscal policy will boost U.S. growth by 0.6 percentage point in 2018. The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bosses, will soon be kicking in and will speak for themselves. Companies are already making big payments to workers. Dems want to raise taxes, hate these big Cuts! \n— Donald J. Trump (@realDonaldTrump) December 21, 2017 \nAt last year’s gathering, Trump was unofficially represented by hedge fund manager Anthony Scaramucci, who would later last just 10 days as the White House communications director. Scaramucci’s forecast that Trump would push through a tax overhaul was spot on: he recently signed a bill that cut U.S. corporate tax to 21 percent from 35 percent. \nLess successful were Scaramucci’s predictions that Trump’s inauguration speech would be Reagan-esque and the new president would offer great hope for globalism. Stock Slump? \nBillionaire investor George Soros, who called Trump a “con man,” made a gloomy prediction that the stock market rally would soon come to an end. He was wrong: The Standard & Poor’s 500 Index has rallied more than 20 percent in the past year. \n“Uncertainty is at a peak, and actually uncertainty is the enemy of long-term investment,” Soros said in Davos. “I don’t think the markets are going to do very well. Right now they’re still celebrating. But when reality comes, it will prevail.” \nOthers proved more prescient. Credit Suisse Group AG CEO Tidjane Thiam said equities would have a reasonable year and Luke Ellis of Man Group Plc said it was a good time to buy cheap securities. Dollar Rally? \nDavos delegates were also amiss when it came to the dollar, which did the opposite to what they said it would. \nUBS Group AG (ubs) Chairman Axel Weber, for one, expected the then-rallying dollar would gain a further 10 percent in the following 10 to 15 months. Credit Suisse’s Thiam agreed the U.S. currency would keep strengthening, although he put a limit on how high it could go. \nIn the end, the Bloomberg Dollar Spot Index dropped 8.5 percent in 2017 as the greenback slid among all but one of its 16 major peers. Oil’s Trajectory \nLooking back at the last retreat, top executives from oil companies and trading houses showed greater foresight on the crude price trajectory than policy makers from major producing nations. \nThe general view among industry pundits was that price swings would remain relatively low, with oil trading between $50 and $60 a barrel — exactly what unfolded. “We are climbing very, very slowly out of a very tough period for the industry,” said BP Plc CEO Bob Dudley.Less predictive were ministers betting on a quicker recovery for oil and the wider energy industry. The most notable example was Saudi Arabia’s Khalid Al-Falih, who wrongly forecast that OPEC was likely to phase out production cuts by mid-2017 thanks to accelerating oil demand growth and disappointing U.S. shale output. Not only did the cartel extend the cuts through year-end, it recently stretched them out to the end of 2018. Deal-Making \nWhen it came to doing business in the Trump era, Moelis & Co. (mc) Chairman Ken Moelis was correct to predict that chief executive officers would scale back deal-making while awaiting clarity on the new administration’s policies. The volume of North American mergers and acquisitions fell 23 percent to $1.2 trillion, with some blaming Trump-related uncertainty. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T05:48:00.000+02:00", "crawled": "2018-01-22T05:48:32.003+02:00", "highlightTitle": ""}