{"organizations": [], "uuid": "8bd662aaf7961ead2e40fff957ec95fce5ec7306", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/01/104812058-GettyImages-867898026-nfl-kneeling.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/football-protests-could-hurt-super-bowl-lii-viewership.html", "country": "US", "domain_rank": 767, "title": "Football protests could hurt Super Bowl LII viewership", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T23:30:00.000+02:00", "replies_count": 0, "uuid": "8bd662aaf7961ead2e40fff957ec95fce5ec7306"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/football-protests-could-hurt-super-bowl-lii-viewership.html", "ord_in_thread": 0, "title": "Football protests could hurt Super Bowl LII viewership", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "nfl", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Football protests could hurt Super Bowl LII viewership Two new surveys commissioned by CNBC take the pulse of football fans. Half of Americans say they'll watch the big game. About a fifth say they won't watch because of the politics. Published 19 Mins Ago SHARES \nThe politicization of football this season may hurt Super Bowl LII viewership, according to two new surveys commissioned by CNBC. \nJust over half of U.S. adults plan to watch the big game this year, according to a survey conducted this week by Fluent , a data-driven marketing firm. Of the respondents who said they won't watch the game but did last year, a quarter said it's because football has gotten too political. Another 20 percent said they won't watch the Super Bowl because of President Donald Trump's past comments regarding the NFL. \nThat would mean millions of people could skip the game because of the politics . \nThis season, the NFL had a unique and unexpected opponent: the president of the United States. Trump took to Twitter dozens of times to criticize the NFL, players and even the commissioner. Trump's criticism of the league was sparked by former 49ers quarterback Colin Kaepernick who led a leaguewide movement of players kneeling during the national anthem. Trump tweet 1 \nThe Fluent survey indicates that the president may not be alone in his sentiment. Of those surveyed, 44 percent of those who identified themselves as \"huge football fans\" agreed with Trump, saying they disapproved of NFL players protesting during the game. In contrast, nearly a third of respondents said they believed the football field is an appropriate place for political protests. \nAt the peak of the protests (during the NFL season's third week) more than 150 players protested, according to ESPN . Protests died down each week after that. \nWhether or not Trump is to blame for the NFL's troubles, the league has taken a hit this year. Viewership ratings are down significantly. Across the board, the NFL has seen a decline of 8.7 percent this year (though \"NBC Sunday Night Football\" is still the most-watched program on television) and the playoffs ratings have hit new lows as well. Trump tweet 2 \nRoughly the same number of Americans plan to watch the Super Bowl this year as last year, according to a separate survey this week by Reconnect Research . The company conducted a telephone survey of Americans and found that 44 percent said they watched last year's Super Bowl, and 43 percent said they plan to watch this year. Plus an extra 3 percent of people who weren't sure. \nOf note, many people think Trump's effect is bigger on other people than themselves . Reconnect Research's survey showed that 21 percent of Americans said they are watching less football this year because of Trump's comments against the league. But 27 percent of people think his comments made other people watch less football. \nIn total, 63 percent of people said they've been watching less football this year compared with the past few years, but a minority of those people blamed the anthem protests and Trump's comments. \nOne in 8 people, or about 12.5 percent, plan to watch the Super Bowl to see who will protest this year. Super Bowl LII takes place on Feb. 4, and will air on NBC. \nFluent conducted an online survey of 3,170 adults (ages 18 and up) living in the United States on Jan. 15, 2018. Respondents were randomly selected and data was weighted to the U.S. Census 2010 population distribution. The survey has a margin of error of 1.7. \nReconnect Research's poll results are based on a telephone survey completed by 648 people living in the United States on Jan. 17, 2018. Respondents were randomly selected and the survey has a margin of error of 3.9. \nDisclosure: NBC and CNBC are owned by Comcast's NBCUniversal unit.", "external_links": [], "published": "2018-01-18T23:30:00.000+02:00", "crawled": "2018-01-18T23:50:09.013+02:00", "highlightTitle": ""}