{"organizations": [], "uuid": "b8f617766c1aad42bda94317dae4e8063d03df83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/11/104765706-GettyImages-166667247.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/jj-attracts-chinese-interest-for-diabetes-business-in-potential-3b-to-4b-deal-sources.html", "country": "US", "domain_rank": 767, "title": "J&J attracts Chinese interest for its diabetes business in a potential $3B to $4B deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T14:23:00.000+02:00", "replies_count": 0, "uuid": "b8f617766c1aad42bda94317dae4e8063d03df83"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/jj-attracts-chinese-interest-for-diabetes-business-in-potential-3b-to-4b-deal-sources.html", "ord_in_thread": 0, "title": "J&J attracts Chinese interest for its diabetes business in a potential $3B to $4B deal", "locations": [], "entities": {"persons": [{"name": "scott eells", "sentiment": "none"}], "locations": [{"name": "new brunswick", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "animas", "sentiment": "none"}], "organizations": [{"name": "modern medicine j&j", "sentiment": "negative"}, {"name": "j&j", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "lifescan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "calibra medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Modern Medicine J&J attracts Chinese interest for diabetes business in potential $3B to $4B deal: Sources Chinese bidders are circling Johnson & Johnson's diabetes care business in a deal that could fetch up to $4 billion. J&J last year said it was evaluating options for its diabetes care companies, specifically LifeScan, Animas, and Calibra Medical. Among the potential bidders is a consortium being formed by Shenzhen-listed Sinocare. Published 8 Hours Ago SHARES Scott Eells | Bloomberg | Getty Images \nChinese bidders are circling a diabetes care business owned by the world's largest health-care company Johnson & Johnson in a deal that could fetch up to $4 billion, five people with direct knowledge told Reuters. \nNew Brunswick, N.J.-based J&J said in January last year it was evaluating options for its diabetes care companies, specifically LifeScan, Animas, and Calibra Medical. One option was a sale of the business, it said. \nChinese interest in the J&J unit comes as the market for diabetes care in China is expected to grow rapidly. Almost one in three of the world's diabetes sufferers lives in China, according to World Health Organization estimates. \nAmong the potential bidders is a consortium being formed by Shenzhen-listed Sinocare, which develops and manufactures blood sugar monitoring systems, and China Jianyin Investment (JIC), a unit of sovereign wealth fund China Investment Corp. The group has hired an advisor to work on a bid, according to two sources. \n\"The evaluation of potential strategic options for LifeScan Inc. and Calibra Medical Inc. is ongoing and we do not have an announcement regarding these businesses at this time,\" J&J said in a statement in response to Reuters request for comment. \nThe company has hired Goldman Sachs to work on the sale, according to three of the people. The bank declined to comment. \nSinocare's investors relations office said it could not confirm the information when contacted by Reuters. JIC and CIC did not respond to requests for comment. The sources declined to be identified. \nAsia accounts for more than 60 percent of global diabetes cases, with increasing levels of wealth, unhealthy diets, and more sedentary lifestyles sparking \"diabetes epidemics\" in the region, according to BMI Research. \nGeorge Lin, chief financial officer of Hua Medicine, a diabetes-focused drug developer, told Reuters on Wednesday that according to the most recent market research there were more than 110 million diabetes patients in China alone. \n\"The market right now in the world is already close to $50 billion,\" he said, referring to diabetes drugs. \"In China, it is expected to grow from $6.6 billion in 2016 to $20 billion by 2025. This is a very large, fast-growing market.\" \nLin left a senior role at Bank of America/Merrill Lynch to join Hua in December. \nIt is not yet clear if potential Chinese buyers are interested in the whole of J&J's diabetes care business or one or more of the member companies. \nSinocare, which has a market capitalization of about $1.8 billion, in 2015 teamed up with Citic Securities to bid for Bayer's diabetes devices business that was eventually sold to Japan's Panasonic Healthcare, majority-owned by U.S. investment firm KKR . \nJIC, wholly owned by CIC, mainly invests in the industrial manufacturing, consumption and information technology sectors, according to its website. \nCIC's vice-chairman and president, Tu Guangshao, said at a panel discussion during the Asian Financial Forum in Hong Kong this week that it would look for more investment opportunities in the healthcare industry. \nThe sale of the diabetes business has also attracted interest from global private equity players, according to the people with knowledge of the process. But analysts said China could offer a tonic to J&J's struggling diabetes care unit and a turnaround opportunity for regional investors. \nRevenues at J&J's diabetes care unit have been falling since 2012, a Reuters study of the company's financial results found. In the first nine months of 2017, sales slid 7.7 percent year-on-year. In 2016, it suffered a similar decline. \nIn October, Animas Corp, the diabetes care unit that makes insulin pumps, said it would shut its business in the United States and Canada amid increased competition and after failing to find a buyer. \nAny sale by J&J of its diabetes device units would fit with a drive to exit from lower-margin, commoditized categories such as glucose meters and strips, but analysts said Asian buyers may be able to squeeze more out of the assets. \n\"Could a Chinese company extract more value from this than a multinational? It's possible because they have different expectations of profitability than multinationals so they can be happy with lower margins,\" said Franck Le Deu, Hong Kong-based senior partner at consultancy McKinsey. \n\"One complication of being in diabetes for a Chinese company is that you need a broad portfolio to be able to compete, and a broad footprint because it's a very dispersed market,\" he added. \"So the investment levels needed to be competitive in diabetes are quite high, it's not an easy game to play.\" Related Securities", "external_links": [], "published": "2018-01-17T14:23:00.000+02:00", "crawled": "2018-01-17T14:42:06.000+02:00", "highlightTitle": ""}