{"organizations": [], "uuid": "04fe802ab4624891c9dc044810ec410237497be5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/11/104765781-IMG_7526.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/blackrock-larry-fink-gop-tax-law-will-largely-do-wonderful-things.html", "country": "US", "domain_rank": 767, "title": "BlackRock CEO Larry Fink: GOP tax law will do 'wonderful things,' adding 1% to economic growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T14:30:00.000+02:00", "replies_count": 0, "uuid": "04fe802ab4624891c9dc044810ec410237497be5"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/blackrock-larry-fink-gop-tax-law-will-largely-do-wonderful-things.html", "ord_in_thread": 0, "title": "BlackRock CEO Larry Fink: GOP tax law will do 'wonderful things,' adding 1% to economic growth", "locations": [], "entities": {"persons": [{"name": "larry fink", "sentiment": "negative"}, {"name": "fink", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "blackrock", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BlackRock chief Larry Fink told CNBC on Friday that the Republican tax overhaul law is largely going to help Americans, and should add about 1 percent annually to economic growth, at least in the first few years.\n\"Overall, it's going to do wonderful things, especially for small businesses,\" he said on \"Squawk Box.\"\nBut Fink said he does not like some of the provisions. \"I'm still unhappy related to a few of the components of the tax bill; the state taxes.\"\nDuring the tax reform debate, Fink had predicted the bill would not pass if it were to include a proposal to end the unlimited state and local tax deductions known as SALT.\nThe end result was a SALT cap of $10,000 for a combination of state and local taxes including property taxes that filers can deduct from their federal returns.\nTo help mitigate that change, the Tax Cuts and Jobs Act almost doubles the standard income tax deduction to $12,000 for individuals and $24,000 for married couples.\nBut for many residents in high-tax states, that accommodation won't be enough to keep their tax bills from increasing.\nFink also said that GOP tax writers should have eliminated the carried interest loophole, arguing that it's \"an unfair tax advantage.\"\nCarried interest is a rule in the tax code that lets the managers of some types of private investment funds — hedge funds, private equity, venture capital, real estate and other types of vehicles — pay a lower rate than most individuals. Carried interest has been U.S. law for more than 50 years as an incentive for long-term investment.\nTop Trump economic advisor Gary Cohn said last month after the Republican tax bill was finalized that he regretted that carried interest was not cut.\n\"We would have cut carried interest,\" Cohn told Axios at the time . \"We probably tried 25 times.\"\nAsked about the importance of companies possibly being incentivized to bring back some of the nearly $3 trillion held overseas, Fink said, \"Bringing money back is to me is not that significant.\"\nMeanwhile, the U.S. corporate tax cut is a problem for Mexico because the rate is now lower in America, Fink said. Companies that had domiciled in Mexico for tax reasons are going to make their new tax homes in the U.S., he predicts.\nOn the markets, Fink said BlackRock is still \"quite bullish\" on stocks.\nThe BlackRock chairman and CEO also said retirement savers, even as old as 50 , should mostly be in stocks rather than bonds. That advice is counter to conventional asset allocation wisdom that long-term investors should have a portion of their portfolios in bonds.\nFink's comments came shortly after BlackRock reported better-than-expected quarterly earnings and revenue, and said that assets under management exceeded $6 trillion.\nMorning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address Disclaimer", "external_links": [], "published": "2018-01-12T14:30:00.000+02:00", "crawled": "2018-01-12T14:54:05.000+02:00", "highlightTitle": ""}