{"organizations": [], "uuid": "16e1725b1bc7e72884c347b008fe96009787cb39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 36, "shares": 36, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/11/104703067-GettyImages-646470372.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/doomsday-clock-board-says-were-the-closest-to-annihilation-since-1953.html", "country": "US", "domain_rank": 767, "title": "The Doomsday Clock timekeepers say we're now the closest to global annihilation since 1953", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T19:26:00.000+02:00", "replies_count": 0, "uuid": "16e1725b1bc7e72884c347b008fe96009787cb39"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/doomsday-clock-board-says-were-the-closest-to-annihilation-since-1953.html", "ord_in_thread": 0, "title": "The Doomsday Clock timekeepers say we're now the closest to global annihilation since 1953", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "soviet union", "sentiment": "none"}], "organizations": [{"name": "universal images group", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The world is the closest it's been to total annihilation since the early days of the Cold War, the Bulletin of the Atomic Scientists warned Thursday.\nThe group of scientists, analysts and researchers moved the hands on the Doomsday Clock 30 seconds closer to midnight on Thursday, largely because of growing risks from the North Korean nuclear crisis and climate change.\nThe decline of U.S. diplomacy under the Trump administration and threats to democracy from online misinformation campaigns also convinced the experts to move the time line forward.\n\"In 2017, world leaders failed to respond effectively to the looming threats of nuclear war and climate change, making the world security situation more dangerous than it was a year ago\" -Bulletin of the Atomic Scientists The Bulletin, which has tracked the risk of nuclear apocalypse since 1947, says the world is now just two minutes from the symbolic hour of global destruction. That is the shortest window since 1953, the year the Soviet Union first tested hydrogen bombs.\n\"In 2017, world leaders failed to respond effectively to the looming threats of nuclear war and climate change, making the world security situation more dangerous than it was a year ago — and as dangerous as it has been since World War II,\" the Bulletin said in a statement.\nThe Bulletin's science and security board consults with its board of sponsors, which includes 15 Nobel laureates, each year to decide whether to adjust the clock or leave it unchanged. It has issued a new warning in each of the last four years, moving the hands forward three times during that period.\nshow chapters If President Trump were to order a nuclear strike, here’s what would happen 3 Hours Ago | 01:33 In its latest update, the boards highlighted continuing tension between the United States and Russia, China's muscular posturing in the South China Sea, India and Pakistan's atomic arms race, and President Donald Trump 's threat to scrap the 2015 Iran nuclear deal.\nLast year, the Bulletin also moved the clock forward 30 seconds. It noted the \"rise in strident nationalism worldwide in 2016\" and specifically called out then President-elect Trump. It also noted his \"disturbing comments\" about nuclear weapons and his history of casting doubt on the scientific consensus on climate change.\nTrump singled out for criticism The Bulletin on Thursday once again directed specific barbs at Trump.\nThe statement criticized the president for a \"downward spiral of nuclear rhetoric\" he engaged in with North Korean dictator Kim Jong Un , failing to offer a credible alternative to the Iran nuclear deal and staffing his administration with climate change deniers.\n\"In the past year, U.S. allies have needed reassurance about American intentions more than ever,\" the members of the boards said.\n\"Instead, they have been forced to negotiate a thicket of conflicting policy statements from a U.S. administration weakened in its cadre of foreign policy professionals, suffering from turnover in senior leadership, led by an undisciplined and disruptive president, and unable to develop, coordinate, and clearly communicate a coherent nuclear policy.\"\nThe White House did not immediately return a request for comment.\nWorld 'lucky' to avoid catastrophe The latest Doomsday Clock warning echoed a report by risk consultancy Eurasia Group earlier this month, which said 2018 could see a disastrous geopolitical event that rivals the 2008 financial crisis. That report said Trump has stoked divisions among citizens and unraveled the global order, contributing to a state of \"geopolitical depression.\"\nBeatrice Fihn, executive director of the 2017 Nobel Peace Prize winning International Campaign to Abolish Nuclear Weapons, said the world has been lucky to avoid catastrophe, pointing to recent false alarms about missile strikes in Hawaii and Japan.\n\"A security based on luck is reckless and foolish; it's exactly what the nuclear states have now. 122 nations voted for the nuclear ban Treaty and other nations need to join the process so we can stop flirting with our own destruction and destroy the Doomsday Clock once and for all,\" she said in a statement.\nThe Bulletin offered several steps to wind back the Doomsday Clock, including nuclear negotiations between the United States and Russia, engagement with North Korea by a host of nations and greater efforts to reduce greenhouse gas emissions.\nWATCH: These fallout shelters won't save you if there's a nuclear attack show chapters These fallout shelters won't save you if there's a nuclear attack 2:29 PM ET Fri, 6 Oct 2017 | 02:58", "external_links": [], "published": "2018-01-25T19:26:00.000+02:00", "crawled": "2018-01-25T19:47:12.000+02:00", "highlightTitle": ""}