{"organizations": [], "uuid": "60eb027879e2d851f07f03f771d130050e10df9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "This Mobile Carrier Has the Fastest Network, According to New Study – Fortune", "url": "http://fortune.com/2018/01/22/mobile-opensignal-tmobile-verizon/", "country": "US", "domain_rank": 1196, "title": "This Mobile Carrier Has the Fastest Network, According to New Study", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T08:00:00.000+02:00", "replies_count": 0, "uuid": "60eb027879e2d851f07f03f771d130050e10df9c"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/22/mobile-opensignal-tmobile-verizon/", "ord_in_thread": 0, "title": "This Mobile Carrier Has the Fastest Network, According to New Study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "fastest network", "sentiment": "negative"}, {"name": "t-mobile", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "opensignal", "sentiment": "none"}, {"name": "sprint", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 1:00 AM EST \nThe big wireless carriers have another data point to use in their battle for bragging rights over which one has the best mobile network. And this time, T-Mobile came out on top. \nIt had the fastest network overall in the fourth quarter, according to OpenSignal, which measures mobile data speeds via an app test used by tens of thousands of ordinary consumers. Nationally, T-Mobile customers who used the test had an average download speed of 19.4 megabits per second on 4G connections, followed by Verizon at 17.8 Mbps, AT&T at 13.3 Mbps and Sprint at 12 Mbps. \nT-Mobile also led six months ago in OpenSignal’s tests, when Verizon and AT&T were facing a serious challenge from increased usage due to their new unlimited data plans. \n“T-Mobile has clearly taken advantage of Verizon’s 4G speed challenges,” OpenSignal wrote in its report covering tests conducted in the fourth quarter. “While last year the two were tied in LTE speed, T-Mobile is now clearly locked into the lead spot of OpenSignal’s 4G speed rankings.” \nAfter introducing unlimited data plans over the past two years, all of the carriers have been spending to improve their 4G LTE networks, some by adding more cellular transmitters and some by adding connections in new spectrum bands. T-Mobile has been doing both, adding thousands of smaller cell sites while putting online new airwave licenses it won last year in the 600 MHz band. The carriers are also preparing to deploy the next generation of even faster equipment, known as 5G. \nIn the OpenSignal report, T-Mobile (tmus) also held the top position as having the most available 4G network. Its customers were able to get a 4G connection 93.1% of the time, ahead of Verizon customers at 92.7%, AT&T at 87% and Sprint at 85.7%. \nGet Data Sheet , Fortune’s technology newsletter. \nAT&T had the most responsive network, however. OpenSignal’s app measures latency, or the time it takes for a phone to request data from the network and get a response. AT&T customers’ average latency was 58.2 milliseconds, T-Mobile’s was 59.7, Sprint’s was 69.6, and Verizon’s was 70. \nThe crowd-sourced rankings from OpenSignal reflect the real world experiences of customers, unlike the more carefully planned and scheduled tests done by other firms. But that also means that the app-based tests may not be representative of the experience of the average customer at each carrier, either. Rootmetrics, which performs more formal, repeated tests, has put Verizon on top in the past . \nIn the middle of last year, OpenSignal said it saw evidence that new unlimited plans were causing slowdowns on Verizon (vz) and AT&T (t) . But by the end of 2017, the two major carriers were speeding up again. \n“We found Verizon and AT&T 4G speeds dropped steadily in our measurements from February to August as the increased data demand of unlimited plans taxed their LTE network capacity,” the firm noted in its report. Only in September did both operators manage to arrest the downward trend, which was most likely the result of 4G capacity upgrades on both networks. Verizon’s 4G speeds started trending back upwards, rising to 15.9 Mbps in November in our tests. In this report, which includes an additional month of data, we saw more evidence of a big Verizon end-of-year push in 4G speed.” \nSprint (s) was in last place in the report, but it has been making huge gains, OpenSignal said. Its average speed increased by 3 Mbps and its availability average rose by nine percentage points from the prior test. “Sprint still sits in last place in both categories, but it has gone a long way to bridging the big gap between itself and its competitors,” the firm said. \nSprint, in a statement, emphasized its improvements. “We’re proud of the progress we’ve made and we know we still have work to do,” the company noted. “This year we’re dramatically increasing our network investment. We have an aggressive plan to improve coverage, reliability and speed, giving Sprint customers a significantly better network experience in markets all across the country.” \nOpenSignal said the conclusions in its latest report were derived from over 5.9 billion speed test measurements on more than 237,000 mobile devices from October 1 through December 30, 2017. \n(Update: This story was updated on January 22 to add Sprint’s comments.) SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T08:00:00.000+02:00", "crawled": "2018-01-22T08:00:25.011+02:00", "highlightTitle": ""}