{"organizations": [], "uuid": "a93d3121fa6b2d1dca410df9cc6060f4359906d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/10/104890072-GettyImages-887657576.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/what-hodl-whale-and-other-cryptocurrency-slang-terms-mean.html", "country": "US", "domain_rank": 767, "title": "'HODL,' 'whale' and 5 other cryptocurrency slang terms explained", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T16:39:00.000+02:00", "replies_count": 0, "uuid": "a93d3121fa6b2d1dca410df9cc6060f4359906d6"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/what-hodl-whale-and-other-cryptocurrency-slang-terms-mean.html", "ord_in_thread": 0, "title": "'HODL,' 'whale' and 5 other cryptocurrency slang terms explained", "locations": [], "entities": {"persons": [{"name": "jamie foxx", "sentiment": "negative"}, {"name": "saddington", "sentiment": "none"}, {"name": "peter saddington", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "dan kitwood", "sentiment": "none"}], "locations": [{"name": "bitcoin pub", "sentiment": "none"}, {"name": "reddit", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "hodl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "46 Mins Ago | 01:36 SHARES \nIn recent months, everyone from celebrities like Jamie Foxx to businessmen like Warren Buffett have been weighing in on bitcoin and other cryptocurrencies. \nWith the growing attention, jargon that was once just used for inside jokes in early cryptocurrency chatrooms and on Reddit threads has now become a part of the dialogue. \nYou may see bitcoin enthusiasts on Twitter say something like, \"Don't listen to FUD, just HODL your bitcoin and head to the moon.\" \nSo what does that mean? To make sense of such crypto-slang, CNBC Make It asked Peter Saddington, a serial entrepreneur and early bitcoin investor who runs a bitcoin community called The Bitcoin Pub, to break it down. Saddington first purchased bitcoin in November 2011 when one coin only cost $2.52. \nHere he explains what HODL and six other terms mean. Dan Kitwood | Getty Images 1. HODL \nExample: \"Stay strong, HODL even when the price drops.\" \nIn early bitcoin forums, someone posted a message that spelled the word \"hold\" wrong, and readers interpreted it as an acronym \"hold on for dear life,\" Saddington explains. \"Now, it's become a meme of sorts, so that when the prices are highly volatile, bitcoin buyers say 'HODL!'\" Saddington describes himself as \"a long-term HODLER.\" 2. FUD \nExample: \"If someone tells you bitcoin is a bubble, they just have FUD.\" \nThis one is simple, Saddington says. FUD means \"fear, uncertainty and doubt.\" Bitcoin followers advise to HODL your coins despite the FUD of those outside the community. 3. Sats \nExample: \"How many sats are you buying at this price?\" \n\"Sats\" is short for \"satoshis,\" a term derived from the first name of bitcoin's mysterious creator , Satoshi Nakamoto. It refers to the smallest fraction of a bitcoin that can be sent, which is 0. 1 of a bitcoin. Instead of looking at bitcoin in terms of a dollar value, \"real traders look at sats, or satoshis,\" says Saddington. 4. Whale \nExample: \"There must be a whale behind this coin's movement.\" \n\"A whale is someone who owns a lot of cryptocurrency,\" Saddington says. \"According to statistics and the addresses that you can find online — because bitcoin isn't truly anonymous; you can actually find the whales — these are the people who own a ton of bitcoin. We're talking about like hundreds of thousands of bitcoin or more.\" \nIf a \"whale\" sells a lot of their stake, it can cause the price of a cryptocurrency to dip by flooding supply, he explains. 5. Pump and dump \nExample: \"This coin's chart looks like it was a pump and dump.\" \n\"Pump and dumpers are people who often say, 'Hey, let's all of us together pump this coin,' which means buy the coin, create the demand in the market, the coin will go up in value,\" Saddington says. Then, everyone \"dumps\" the coin and sells. \nThese schemes are often orchestrated through apps like Slack or Telegram, he adds, and advises curious chatroom readers to beware of such gimmicks. An investigation into \"pump and dump\" schemes by Business Insider found the practice to be an \"open secret among many cryptocurrency traders.\" 6. Bagholders \nExample: \"I think this coin is going to sell off, and someone's going to be left as the bagholder.\" \n\"A bagholder, essentially, is a very unfortunate soul who at the end of the day — maybe from a pump and dump — who got 'held with the bag,' which means they wanted to sell at a higher price, but the market moved too fast,\" Saddington says. Then, that person is left with \"a coin they don't want at a price they can't sell it [at].\" 7. Mooning \nExample: \"Ripple is mooning!\" \nIf something is \"mooning,\" that means a coin's price is experiencing a spike. \"That is often what you'll see on Twitter, or social media sites,\" he says. \"That is one term that I don't enjoy.\" \nCrypto-watchers will often get excited about minor bumps in price and boast that their coin is headed \"to the moon,\" Saddington says, sometimes only in an effort to inflate the price for their own gain. \n\"I think mooning is one of those terms I'd like to remove from the general vernacular,\" he says. ", "external_links": [], "published": "2018-01-23T16:39:00.000+02:00", "crawled": "2018-01-23T16:53:46.010+02:00", "highlightTitle": ""}