{"organizations": [], "uuid": "0cabe11340c0f9086312b565035330488f8718d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958767-GettyImages-908495166.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/us-government-workers-awake-to-third-day-of-shutdown-as-a-senate-vote-looms.html", "country": "US", "domain_rank": 767, "title": "US government workers awake to third day of shutdown as a Senate vote looms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T13:06:00.000+02:00", "replies_count": 0, "uuid": "0cabe11340c0f9086312b565035330488f8718d9"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/us-government-workers-awake-to-third-day-of-shutdown-as-a-senate-vote-looms.html", "ord_in_thread": 0, "title": "US government workers awake to third day of shutdown as a Senate vote looms", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds of thousands of federal workers will wake up on Monday with the U.S. government still shut down and the Senate expected to try again to restore federal funding, if only temporarily, and work on resolving a dispute over immigration.\nAmid uncertainty about whether federal employees should report to work in the morning, senators were set to vote at midday on a funding bill to get the lights back on in Washington and across the government until early February.\nSupport for the bill was uncertain, after Republicans and Democrats spent all day on Sunday trying to strike a deal, only to go home for the night short of an agreement.\nSenate Majority Leader Mitch McConnell said late on Sunday that an overnight vote on a measure to fund government operations through Feb. 8 was canceled and would instead be held at 12 p.m. (1700 GMT) on Monday.\nshow chapters Government shutdown enters third day as lawmakers fail to secure deal 5 Hours Ago | 01:12 Up until Monday, most federal workers were not directly affected by the shutdown that began at midnight on Friday.\nMany were still awaiting notification on whether they are \"essential\" employees or not, which would determine whether they must report to their offices.\nEven late on Sunday, the federal Office of Personnel Management was providing little guidance. It said on its website that \"federal government operations vary by agency.\"\nThe Department of Defense published a memo on its site detailing who does and does not get paid in a shutdown and saying that civilian employees were on temporary leave, except for those needed to support active-duty troops.\nThe Department of Interior, led by Secretary Ryan Zinke, offered no guidance on its website, which still had a \"Happy Holidays from the Zinke Family\" video near the top of the site. The department oversees national parks and federal lands.\nThe State Department website said: \"At this time, scheduled passport and visa services in the United States and at our posts overseas will continue during the lapse in appropriations as the situation permits.\"\n'Dreamers' drama The U.S. government had not previously been shut down since 2013, when about 800,000 federal workers were put on furlough. The impasse preventing passage of a needed funding bill centered on former Democratic President Barack Obama's health-care law.\nThe problem this time focused on immigration policy, principally President Donald Trump's order last year ending an Obama program called Deferred Action for Childhood Arrivals (DACA), which gave legal protections to \"Dreamer\" immigrants.\nshow chapters Government shutdown closes Statue of Liberty to visitors over the weekend 5 Hours Ago | 01:58 The \"Dreamers\" are young people who were brought to the United States illegally as children by their parents or other adults, mainly from Mexico and Central America, and who mostly grew up in the United States.\nTrump said last year he would end DACA on March 5 and asked Congress to come up with a legislative fix before then that would prevent the Dreamers from being deported.\nDemocrats have withheld support for a temporary funding bill to keep the government open over the DACA issue. McConnell extended them an olive branch on Sunday, pledging to bring immigration legislation up for debate after Feb. 8 so long as the government remained open.\nSenate Democratic leader Chuck Schumer objected to that plan and it was unclear whether McConnell's pledge would be enough for Democrats to support a stopgap funding bill.\nCongress failed last year to pass a complete budget by Oct. 1, the beginning of the federal fiscal year, and the government had since been operating on a series of three stopgap spending bills.\nRepublicans control both the House of Representatives and the Senate, where they have a slim 51-49 majority. But most legislation requires 60 Senate votes to pass, giving Democrats leverage in that chamber.\nTrump earlier this month told a bipartisan Senate working group that he would sign whatever DACA legislation was brought to him. The Republican president then rejected a bipartisan measure and negotiations stalled.\nMcConnell had previously insisted that the Senate would not move to immigration legislation until it was clear what could earn Trump's support.\nRepublican Senator Jeff Flake , who is involved in bipartisan immigration negotiations, said McConnell's statements on Sunday indicated progress in negotiations and he urged his Democratic colleagues to approve another stopgap bill.", "external_links": [], "published": "2018-01-22T13:06:00.000+02:00", "crawled": "2018-01-22T14:53:44.001+02:00", "highlightTitle": ""}