{"organizations": [], "uuid": "445ef9f6d326f3ae8f44613622d810b0f59c31ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/24/104605386-parks_and_rec_holding_hands.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/annie-mckee-2-steps-you-can-take-if-youre-miserable-at-work.html", "country": "US", "domain_rank": 767, "title": "2 simple steps you can take if you’re miserable at work", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T19:23:00.000+02:00", "replies_count": 0, "uuid": "445ef9f6d326f3ae8f44613622d810b0f59c31ba"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/annie-mckee-2-steps-you-can-take-if-youre-miserable-at-work.html", "ord_in_thread": 0, "title": "2 simple steps you can take if you’re miserable at work", "locations": [], "entities": {"persons": [{"name": "annie mckee", "sentiment": "none"}, {"name": "mckee", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:19 AM ET Thu, 4 Jan 2018 | 01:14 SHARES \nFor many people, going to work is simply a way to make a living, unhappily trudging through each day to make ends meet. But happiness expert and bestselling author Annie McKee wants people to escape this harmful cycle. \n\"If you have adopted that mindset that says, 'Work is grueling, just be happy you have a job, that you're getting a paycheck, it's a good company,' but you're not actually happy, you don't have to accept that,\" McKee tells CNBC Make It . \n\"Everyone deserves to be happy at work because if we're not happy at work, we're not happy in life,\" she adds. show chapters 11:05 AM ET Fri, 15 Dec 2017 | 01:04 \nAs a leadership adviser for Fortune 500 companies and governments around the world, McKee has spent decades researching effectiveness and happiness at work. She details portions of this research in her latest book: \" How to Be Happy at Work: The Power of Purpose, Hope, and Friendship .\" \n\"There are three ways to tell if things are not well,\" McKee says. \"There are physical clues that tell us something is wrong, emotional clues based on how we feel on a daily basis over time and clues from the health of our relationships.\" \nIf you have seen your unhappiness at work taking a toll on other areas of your life, such as your sleeping patterns, nutrition or family relationships, McKee recommends that you follow these two steps to regain a sense of purpose and happiness. Step one: Reflect \nOnce you understand you aren't happy at work, the first thing McKee recommends that you do is carve out some time for deep reflection and introspection. Ask yourself, \"What is causing me to feel sad or unhappy at work?\" \n\"It's far too easy to habitually tell yourself, 'I'm sad because don't like my manager' or 'I'm sad because didn't get promotion'\" McKee says. \"And while those things might be true, there's almost always something deeper than that.\" show chapters 1:00 PM ET Tue, 20 Dec 2016 | 01:25 \nMcKee further recommends that you be honest with yourself and ask if there is something about your own mindset and life that may be contributing to your unhappiness at work. \n\"Have you gotten trapped by overwork? Has your ambition gotten out of control? Have you chosen jobs and work projects because you think you should or because you actually want to?\" McKee says. \"Don't get caught in these traps.\" Step two: Find a friend \nWhether it's at work or outside of work, McKee suggests finding a friend to discuss this state of being with. \n\"Find someone who you can really talk with, who can really tell you the truth about what they see in you, whether it's the strengths or some developmental areas they see in you,\" McKee says. show chapters 12:22 PM ET Tue, 21 Nov 2017 | 00:59 \nYour friend can help you decide if you seem to fit in with your current workplace or if the job is not the right fit for you. \n\"Talking with a friend as if they were your [career] coach could also help you see your attitude about work from a different perspective,\" McKee says. \"And be open to all possibilities. Maybe you need to change your mindset, maybe you need to change what you do on a daily basis\" \n\"We have a lot more freedom than we like to think we do,\" she adds.", "external_links": [], "published": "2018-01-10T19:23:00.000+02:00", "crawled": "2018-01-10T19:47:45.000+02:00", "highlightTitle": ""}