{"organizations": [], "uuid": "2040d5d8d3fd256f46c3abd645365e6df8933660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104951153-GettyImages-813951340.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001135/device/rss/rss.html", "section_title": "Stock Picks", "url": "https://www.cnbc.com/2018/01/18/theres-no-evidence-tasers-reduce-police-use-of-firearms-new-study-shows.html", "country": "US", "domain_rank": 767, "title": "There's 'no evidence' Tasers reduce police use of firearms, new study shows", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T22:48:00.000+02:00", "replies_count": 0, "uuid": "2040d5d8d3fd256f46c3abd645365e6df8933660"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/theres-no-evidence-tasers-reduce-police-use-of-firearms-new-study-shows.html", "ord_in_thread": 0, "title": "There's 'no evidence' Tasers reduce police use of firearms, new study shows", "locations": [], "entities": {"persons": [{"name": "researc", "sentiment": "negative"}, {"name": "jeffrey grogger", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "university of chicago", "sentiment": "none"}, {"name": "jesse winter | toronto star | getty images police", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "chicago police department", "sentiment": "none"}, {"name": "axon enterprise", "sentiment": "none"}, {"name": "taser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There is \"no evidence\" that the adoption of Tasers reduces police use of firearms, according to a study released this week from the University of Chicago.\nWhile the latest study found that the electric shock weapon reduces the rate of police injury, it also determined that police use of firearms remained unchanged. The team studied data from the Chicago Police Department starting in 2010, when the city's police force began issuing Tasers to patrol officers. Their findings were released by the National Bureau of Economic Research on Monday.\nMany cities have recently decided to give Tasers a second chance after police use of force led to public unrest in Baltimore, Chicago and Ferguson, Missouri. Precincts have started adopting or increasing their use of less-than-lethal force – including pepper spray and Tasers – in an effort to reduce injury and death while still giving police options when facing would-be assailants.\nAxon Enterprise , formerly Taser International and the maker of Taser, offers a wide range of law enforcement technologies in additional to its flagship product, including cameras and law enforcement software. The publicly-traded company changed its name to Axon in 2017, adopting the title of its police body camera segment as a part of its shift into software services. The company is based in Scottsdale, Arizona and its shares have jumped 525 percent since 2010.\nBut whether Tasers are truly reducing law enforcement's use of deadly force remains questionable in a nation where 20 percent of arrests entail some use of force. The definitions of force, as spelled out in the research, range from verbal (classified as no force), to physical holds that don't involve pain (minor), to kicking or chokeholds (major) and firearms. \n\nUniversity of Chicago Professor Jeffrey Grogger found in the study that \"police injuries fell, but neither injury rates nor the number of injuries to civilians were affected.\" \nOf the 36,112 use-of-force incidents studied, 30,641 involved more than minor use of force while 733 involved firearms. Following a re-training of patrol officers in 2012, cops frequently substituted Tasers for minor, intermediate, and major uses of force. The only exception to this rule were guns: police officers did not make meaningful switches from guns to Tasers.\n\"We find no substitutions between Tasers and firearms,\" Grogger told CNBC. We found that Tasers led to \"reductions in injuries to cops, and that's a good thing, but I think it would be better if the distribution of injury reduction was better split between cops and suspects.\"\n\"The idea of Taser, and if you go to Axon's homepage, they basically tell you that this is a device that temporally disables suspects,\" Grogger added. \"The Taser is supposed to be a weapon that allows the cop to take possession of the suspect without serious injury to the cop or the suspect.\"\nAccording to the company's website, Taser technology is designed to target the body's nervous system and motor movement , making the weapon \"an alternative far superior to using firearms in many contexts.\" The site adds that Tasers have saved nearly 200,000 lives, with over 3.6 million uses in the field worldwide.\nImportantly, the researchers did find a reduction in total use of force despite the unaffected firearm numbers after 2012. And for its part, Axon pushed back on the University of Chicago's findings, telling CNBC that the Taser is one of the safer options available to law enforcement.\n\"If we can prevent incidents from escalating to deadly force, that's a win,\" said Axon spokesman Steve Tuttle. \"What we do see is that they tend to stop violent situations to rise to a deadly force confrontation because they're so effective.\"\nThe company came under fire in 2015 after a Washington Post investigation found that, on average, one person per week died in incidents in which police used Tasers that year.\nThe link between the electric weapon and serious injury remains unclear; some people may hurt themselves in a fall after being Tasered while other risk factors include hypertensive heart disease or drug use, leading some to conclude that the problem has more to do with officer accountability.\nThe company has issued warnings to police, encouraging officers to show restraint when using Tasers on people with mental illnesses.\nTuttle cited a 2009 U.S. Department of Justice-funded study that concluded that more than 99 percent of 1,201 field uses of Taser weapons resulted in no significant injuries. That study, led by William Bozeman, M.D., of Wake Forest University School of Medicine, found that Tasers \"appear to be very safe, especially when compared to other options police have for subduing violent or combative suspects … [though] that is not to say that injuries and deaths are impossible.\"\nThe finding \"doesn't surprise me because when you look at other tools available to cops, they haven't performed well. That's where we fit in,\" added Tuttle. \"We did not provide Tasers to replace firearms and if you ask any expert in the field, they'll tell you that you don't bring a knife to a gun fight.\"", "external_links": [], "published": "2018-01-18T22:48:00.000+02:00", "crawled": "2018-01-18T22:59:21.002+02:00", "highlightTitle": ""}