{"organizations": [], "uuid": "4ea02829e771f085ef001e510a962eaaa9baab04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/02/104257557-IMG_0154r.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/bill-miller-a-rush-out-of-bonds-is-about-to-propel-stocks-significantly-higher.html", "country": "US", "domain_rank": 767, "title": "Bill Miller: A rush out of bonds is about to 'propel stocks significantly higher'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T23:10:00.000+02:00", "replies_count": 0, "uuid": "4ea02829e771f085ef001e510a962eaaa9baab04"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/bill-miller-a-rush-out-of-bonds-is-about-to-propel-stocks-significantly-higher.html", "ord_in_thread": 0, "title": "Bill Miller: A rush out of bonds is about to 'propel stocks significantly higher'", "locations": [], "entities": {"persons": [{"name": "bill miller", "sentiment": "negative"}, {"name": "dan mescon", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}], "locations": [], "organizations": [{"name": "venture capital", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "miller value partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hedge fund manager Bill Miller warned clients that a rush out of bonds is about to \"propel stocks significantly higher.\"\n\"I believe that if rates rise in 2018, taking the 10-year treasury above 3 percent, that will propel stocks significantly higher, as money exits bond funds for only the second year in the past 10,\" Miller wrote in a letter dated Jan. 23. \"Bonds, in my opinion, have entered a bear market, but one that is likely to be benign for the next year or so.\"\nMiller founded Miller Value Partners in 2016 after 35 years as a manager at Legg Mason. There, he managed a fund that beat the S&P 500 for 15 consecutive years through 2005.\nGiven the positive outlook on global economic growth and \"partially\" appreciated tax cuts, Miller now forecasts an end to the great bull market in bonds.\n\"Bonds have outperformed stocks for an entire generation and have done so with lower volatility and greater inherent safety due to their contractual payouts,\" Miller added. \"That era is now over in my opinion and stocks will revert to their historic return premium over bonds as global economies grow.\"\nStocks have been on a tear over the past 12 months, with the S&P 500 up roughly 24 percent as tax cuts and low yields drove equities higher. But bonds have recently been showing signs of weakness, with growing national debt concerns and a synchronized global recovery spurring yields upward. \nMiller's firm manages $2.2 billion, including separate accounts for high net worth individuals. He recently made headlines after investing half of his MVP 1 fund in bitcoin. He offered an update on his thinking on bitcoin in his letter.\n\"One consequence of increased geopolitical dislocation might be another very large increase in Bitcoin's value, as it is increasingly seen as isolated and insulated from the conventional economic system,\" he explained. \"I think all investors would prefer more stability and less drama, except perhaps those whose only investment are cryptoassets or gold.\"\nTo be sure, Miller isn't the only Wall Street veteran who's turned bearish on bonds. Bill Gross declared earlier this month that after more than two decades, the bond bear market has begun. Gross noted that key trend lines were broken in the 5-year and 10-year, confirming a bear market.", "external_links": [], "published": "2018-01-25T23:10:00.000+02:00", "crawled": "2018-01-25T23:28:58.008+02:00", "highlightTitle": ""}