{"organizations": [], "uuid": "08cefd284ba157f5838cfcb0fae20b8504c82541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "http://www.bostonherald.com/sites/default/files/styles/full/public/media/2018/01/05/gettyimages-854793518.jpg?itok=qTn2N1Bv", "site_section": "http://www.bostonherald.com/feed", "section_title": "Boston Herald - Boston Herald", "url": "http://fortune.com/2018/01/05/congress-healthcare-entitlements-reform/", "country": "US", "domain_rank": 1196, "title": "The GOP May Attempt Major Health Care or Welfare Cuts—Without Any Democratic Votes", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "08cefd284ba157f5838cfcb0fae20b8504c82541"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/05/congress-healthcare-entitlements-reform/", "ord_in_thread": 0, "title": "The GOP May Attempt Major Health Care or Welfare Cuts—Without Any Democratic Votes", "locations": [], "entities": {"persons": [{"name": "paul ryan", "sentiment": "negative"}, {"name": "sy mukherjee", "sentiment": "negative"}, {"name": "angerer", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lea", "sentiment": "none"}, {"name": "axios", "sentiment": "none"}], "locations": [{"name": "camp david", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "gop may attempt major health care", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sy Mukherjee, FORTUNE   Drew Angerer — Getty Images Speaker of the House Paul Ryan (R-WI) speaks during a news conference to discuss their plans for tax reform, September 27, 2017 in Washington, DC. comments \nA game time decision on Congress’ next big legislative push—including whether or not to use a special procedural pathway in the Senate that would nix the need for any Democratic votes—may come down to what President Donald Trump tells Republican leadership during a meeting this weekend at Camp David. Two major policy interests under consideration are another go at health care reform or big cuts to entitlements and welfare, Axios reports . \nThe main question may center on the use of “reconciliation” in the U.S. Senate. This procedural tool would allow the chamber to pass certain kinds of legislation which affects the federal budget—including spending on programs like Obamacare, Medicare, Medicaid, welfare, and Social Security—with a simple majority. (This is the same method that the Senate used to pass the GOP tax bill at the end of last year.) \nBut Republican Senate Majority Leader Mitch McConnell is reportedly at odds with GOP House Speaker Paul Ryan on whether or not to use reconciliation and pass another major bill without any Democratic votes. McConnell has voiced support for more bipartisan collaboration on significant legislation in 2018; Ryan and other House conservatives have urged a more combative approach. \nReconciliation’s tactical appeal in the Senate is clear. The GOP holds just a one-seat majority in the chamber after the surprise victory of Democrat Doug Jones in last year’s Alabama special election; that means they can lose just one Republican vote, even under reconciliation (Vice President Mike Pence would cast a tie-breaker in the case of a 50-50 split). \nBut the politics are more complicated. For one, reconciliation is a budgetary vehicle, and passing a budget is no mean feat given the intra-party disagreements among Republicans. And McConnell and his fellow GOP Senators may not be excited at the prospect of passing deeply unpopular cuts to popular programs like Medicaid, Medicare, and welfare on a party-line vote immediately after passing a deeply unpopular tax bill on a party-line vote. A bipartisan approach to reforming entitlements could, politically at least, help spread the blame around. Trump’s opinion may shape the path forward given the disagreements between McConnell and Ryan. Related Articles", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-06T09:07:43.018+02:00", "highlightTitle": ""}