{"organizations": [], "uuid": "e5a04e0dea9b865bfb908b5c2f8c30426d2da377", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 28}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104971177-GettyImages-515908392.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/steve-wynns-reputation-will-likely-not-recover-says-vegas-reporter.html", "country": "US", "domain_rank": 767, "title": "Steve Wynn's reputation will likely not recover if sexual harassment charges check out: Ralston", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-27T02:23:00.000+02:00", "replies_count": 0, "uuid": "e5a04e0dea9b865bfb908b5c2f8c30426d2da377"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/steve-wynns-reputation-will-likely-not-recover-says-vegas-reporter.html", "ord_in_thread": 0, "title": "Steve Wynn's reputation will likely not recover if sexual harassment charges check out: Ralston", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "negative"}, {"name": "ralston", "sentiment": "none"}, {"name": "jon ralston", "sentiment": "none"}, {"name": "wynn", "sentiment": "none"}], "locations": [{"name": "wynn las vegas", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "ralston", "sentiment": "negative"}, {"name": "wynn resorts", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nevada independent", "sentiment": "none"}, {"name": "politico", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "18 Hours Ago | 05:06 \nSteve Wynn 's reputation will likely not recover if sexual harassment allegations check out, said veteran Las Vegas reporter Jon Ralston. \n\"There is no bigger name in the casino business than Steve Wynn,\" said Ralston, who has been covering business and politics in Nevada for 30 years and has interviewed Wynn himself multiple times over the years. \n\"His name is synonymous, not just because that casino says 'Wynn' on top of it,\" Ralston told CNBC Friday night on \" Fast Money .\" \"Steve Wynn is the biggest name in the history of Nevada gaming.\" \n\"He is the man behind that [empire] and it's hard to believe that it would not take a hit if something happens to him,\" Ralston said. \nHowever, the reporter, who is also the founder and editor of the independent news site The Nevada Independent and a regular contributor to Politico, admitted he doesn't know enough about the \"internal workings\" of Wynn Las Vegas resorts and whether the company would be able to survive if Wynn's reputation was damaged. \nStocks of Wynn Resorts fell 10 percent on Friday after The Wall Street Journal broke the story earlier that day about the 76-year-old billionaire casino mogul and CEO of Wynn Las Vegas, reporting several allegations sexual misconduct from Wynn that may span decades. \nWynn released a statement saying, \"\"the idea that I ever assaulted any woman is preposterous. … We find ourselves in a world where people can make allegations, regardless of the truth, and a person is left with the choice of weathering insulting publicity or engaging in multi-year lawsuits. It is deplorable for anyone to find themselves in this situation.\" \nWynn blamed his ex-wife Elaine for stirring up trouble. The couple is currently in the middle of a lawsuit. But Ralston said the Journal more likely began an investigation because of the current political environment and things like the #MeToo movement, Ralston said. \n\"The divorce certainly is nasty,\" Ralston said. \"There certainly is no love lost between the two of them. But here is what I do know. In this new atmosphere of sexual harassment being a big deal in the political, social consciousness of this country, the Wall Street Journal started working on pieces just as we have and many other news organizations have. There have always been rumors about sexual harassment in the context of the casino business. My guess is they started working on this story based on that. Not based on being fed information by Elaine Wynn.\" \nThe Journal did not respond to a request for comment. In its story, the Journal said it contacted more than 150 past and present employees and found dozens that told stories of sexual misconduct. Many people who spoke said they were worried talking to the media would hurt future job prospects because Wynn is so well-connected in Las Vegas. \n\"Some of these kinds of rumors or allegations have been out there before,\" Ralston said, referencing the Nevada Independent columnist John L. Smith who wrote a book that alluded to \"some of this stuff.\" \n\"It's going to be very, very difficult for him to get away from that [Wall Street Journal article] even though he has said he never assaulted a woman,\" Ralston said. Kellie Ell News Associate for CNBC Playing", "external_links": [], "published": "2018-01-27T02:23:00.000+02:00", "crawled": "2018-01-27T02:36:04.000+02:00", "highlightTitle": ""}