{"organizations": [], "uuid": "f0b929ef8368c128ba43d5b6b2535f35d30f0548", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/08/31/101959838-499573393.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/hong-kong-exchanges-and-clearing-ceo-on-saudi-aramco-chinese-investors.html", "country": "US", "domain_rank": 767, "title": "Saudi Aramco will list in Hong Kong eventually, says the city's stock exchange chief", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T09:39:00.000+02:00", "replies_count": 0, "uuid": "f0b929ef8368c128ba43d5b6b2535f35d30f0548"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/hong-kong-exchanges-and-clearing-ceo-on-saudi-aramco-chinese-investors.html", "ord_in_thread": 0, "title": "Saudi Aramco will list in Hong Kong eventually, says the city's stock exchange chief", "locations": [], "entities": {"persons": [{"name": "charles li", "sentiment": "none"}, {"name": "li", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "saudi aramco", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "15 Hours Ago | 04:14 \nThe potential to reach the vast Chinese investing public will eventually bring Saudi Aramco to list in Hong Kong , even if the oil giant skips over the special administrative region for its first public offering, said Charles Li, chief executive of Hong Kong Exchanges and Clearing . \n\"A deal in Hong Kong with the possibility of accessing, either now or later, the Chinese investing public works wonders for Saudi Arabia , for China , for Hong Kong and for everybody else,\" Li told CNBC on Wednesday. \n\"So, I don't see any reason why it shouldn't be here, it may not be here right away, it may not be here on the first go, but it will be here,\" he added. \nHong Kong is competing against exchanges in New York and London — and potentially elsewhere — for what is expected to be the world's largest IPO. Saudi Aramco, valued at $1 trillion to $2 trillion, is widely expected to float around 5 percent of its shares. \nThe energy company earlier told CNBC that it is fully prepared to launch its IPO in the second half of 2018, but the exact timing and the decision on where to list will depend on its sole shareholder: the government of Saudi Arabia. \nA win for Hong Kong would be a welcomed boost for the city that recently lost its crown as the global IPO leader. The financial center raised $15.6 billion through new listings in 2017, coming in third after New York and Shanghai, according to a report by EY . In 2016, Hong Kong had topped the league with $25.2 billion in proceeds, EY said. d3sign | Getty Images | Getty Images Hong Kong is competing against New York and London for the IPO of Saudi Aramco. \nThe stock exchange in Hong Kong has since announced an overhaul of its listing rules to lure a greater number of IPOs. The changes that will take place this year include the introduction of dual-class shares and easier entry for bio-tech companies and firms seeking a secondary-listing in Hong Kong, Li said. \nA dual-class structure is one that gives shares held by company founders and executives larger voting rights compared to those owned by minority holders. Major tech companies such as Facebook and Alibaba use such a format, but the structure has escalated concerns about corporate governance and protection for minority investors. \nLi acknowledged there may be some risks in allowing dual-class shares, but added that he did not expect protection for minority investors to diminish. \n\"Every protection that we have — we're arguably the most aggressive protector in that space — will be there,\" he said.", "external_links": [], "published": "2018-01-24T09:39:00.000+02:00", "crawled": "2018-01-24T10:11:49.006+02:00", "highlightTitle": ""}