{"organizations": [], "uuid": "49b82f2f46cb3374c7c230e43f3653a1311a1525", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938427-handshake.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/financial-services-industry-needs-to-regain-consumer-trust.html", "country": "US", "domain_rank": 767, "title": "Financial services firms need to step up to serve — not exploit — to regain consumer trust", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "49b82f2f46cb3374c7c230e43f3653a1311a1525"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/financial-services-industry-needs-to-regain-consumer-trust.html", "ord_in_thread": 0, "title": "Financial services firms need to step up to serve — not exploit — to regain consumer trust", "locations": [], "entities": {"persons": [{"name": "wells", "sentiment": "none"}], "locations": [], "organizations": [{"name": "social security", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "negative"}, {"name": "vanity fair", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Blend Images-JGI/Jamie Grill | Getty Images Only when financial leaders step up to serve customers will we see trust restored in financial services. It's not difficult to see that the financial services industry is broken.\nWhen I got my start in finance, I knew that most Americans held a negative view of the industry. I felt it, too. I used to say that my job was, in short, \"to help banks make more money.\" I never liked that idea. I'd rather the industry make money for people rather than off people.\nBanking, investing, lending, insurance — it all seems to project an aura of questionable trust. And unfortunately, the industry's trajectory doesn't seem to be turning around anytime soon.\nIt's time for financial services firms to make a pledge to do well by the customers. In fact, this should be a collective New Year's resolution.\nWe've all read far too many headlines about financial companies betraying customers' trust. The most heinous in recent memory was perhaps Bernie Madoff's Ponzi scheme. A recent example is the Wells Fargo situation , where accounts were created on behalf of customers, without authorization.\nMistakes of negligence don't help, either. The fact that hackers were able to penetrate Equifax — one of the three bureaus entrusted with maintaining consumer credit reports — causes consumers to question whether they can trust the financial industry with their privacy … and whether their money is safe.\nWhen compared to the energy sector, consumer packaged goods, food and beverage, and technology, financial services is the least trusted industry in consumers' eyes, according to Edelman's 2017 consumer trust survey. There's a reason for this: Financial service companies today are still not focused on serving customers first and foremost.\nMore from Investor Toolkit:\nWhy some fear is good for investors\nAdvisors turn to life coaches and counselors", "external_links": [], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T15:33:07.033+02:00", "highlightTitle": ""}