{"organizations": [], "uuid": "9c567a6acb7f460a953c27ccf6062d606ed1d1af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "5 Key Things to Know About Haiti After Donald Trump’s Insult – Fortune", "url": "http://fortune.com/2018/01/12/5-key-things-to-know-about-haiti-after-donald-trumps-insult/", "country": "US", "domain_rank": 1196, "title": "5 Key Things to Know About Haiti After Donald Trump’s Insult", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-13T00:22:00.000+02:00", "replies_count": 0, "uuid": "9c567a6acb7f460a953c27ccf6062d606ed1d1af"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/12/5-key-things-to-know-about-haiti-after-donald-trumps-insult/", "ord_in_thread": 0, "title": "5 Key Things to Know About Haiti After Donald Trump’s Insult", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 12, 2018 \nPresident Donald Trump referred to Haiti and other nations as “shithole countries” during immigration talks with lawmakers on Thursday, according to the Washington Post . \n“Why are we having all these people from shithole countries come here?” Trump reportedly said about Haiti in addition to El Salvador and African nations. He reportedly singled out Haiti further in his remarks, asking “Why do we need more Haitians? Take them out.” \nTrump’s slur was widely condemned by Democratic lawmakers, along with some Republican lawmakers. Many called the remarks racist including a United Nations human rights official. \nOn Friday, Trump denied the comments, tweeting that his language was “tough” but that he did not use the words attributed to him in news reports. “I never said anything derogatory about Haitians other than Haiti is, obviously, a very poor and troubled country,” Trump added. \nHere’s what you need to know about Haiti, which is indeed impoverished, rocked by natural disasters, and a frequently beset by political upheaval. But it also has a rich culture and has played an important role in American history. Haiti’s history \nChristopher Columbus landed on the island (now called Hispaniola) in 1492, and during colonization, most of the native population was wiped out. In 1697, the western third of the island was given to the French , who prospered from the export of sugar, coffee, cacao and more. Most of the agricultural work was done by slaves brought from Western Africa, who made up the majority of the population. \nThe Haitian Revolution, a series uprisings occurring between 1791 and 1804 by both freed men and slaves, ended French colonial rule. However the legacy of poverty from slavery shapes the island even to this day. \nIn 1825 Haiti was forced to pay France an “independence debt” of 150 million gold francs, under the threat of invasion, which The Guardian notes was “ten times the fledgling black nation’s total annual revenues.” Haiti helped with the American Revolution \nNearly 500 free black men from Haiti recruited by a French admiral participated in the 1779 Siege of Savannah, fighting with colonists against British. They were known as the Chasseurs Volontaires, and they were recruited with the hope that by serving in the military they’d be recognized as citizens of the French empire, according to Ozy . The siege failed and the Chasseurs were ultimately exiled. Haiti’s troubled economy \nHaiti’s economy has lagged due to the legacy of slavery, poverty, natural disasters, corruption, U.S. occupation, and political turmoil. In 2016 Haiti’s GPD per capita was $1,800. It is the poorest nation in the Western Hemisphere, according to the CIA’s World Factbook , with 60% of the population living below the poverty line. Haitian immigration to the U.S. \nThere were 676,000 Haitian immigrants living in the U.S. in 2015—up from 587,000 in 2010. Around 58,000 Haitians remained in the U.S. after the 2010 earthquake through temporary protected status (TPS), a policy rescinded by the Trump administration in 2017 that required them to leave the U.S. by July 2019. \nU.S. Department of Homeland Security established the Haitian Family Reunification Parole (HFRP) in 2014. The program “will allow certain eligible Haitians with already approved family-based immigrant visa petitions an opportunity to enter the United States up to two years in advance of their visa eligibility dates,” according to the State Department . Through this, approximately 5,000 Haitians are eligible to legally immigrate to the U.S. annually. Haiti’s response to Trump’s remarks \nHaiti denounced Trump’s remarks in a statement from President Jovenel Moise’s administration. “The Haitian government condemns in the strongest terms these abhorrent and obnoxious remarks which, if proven, reflect a totally erroneous and racist view of the Haitian community and its contribution to the United States,” the statement read. Haiti’s 2010 earthquake \nTrump’s comments came just a day before the Jan. 12 anniversary of the calamitous 7.0 earthquake that struck Haiti in 2010, killing hundreds of thousands of people. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-13T00:22:00.000+02:00", "crawled": "2018-01-13T00:22:52.010+02:00", "highlightTitle": ""}