{"organizations": [], "uuid": "1b414447060d1c7436bbc9765e3627e2c5abf65b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104972995-GettyImages-683141914.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19834788/device/rss/rss.xml", "section_title": "Asia Top News and Analysis", "url": "https://www.cnbc.com/2018/01/28/first-official-belt-and-road-bond-issued-on-shanghai-exchange.html", "country": "US", "domain_rank": 767, "title": "First official Belt and Road bond issued on Shanghai exchange", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T05:02:00.000+02:00", "replies_count": 0, "uuid": "1b414447060d1c7436bbc9765e3627e2c5abf65b"}, "author": "", "url": "https://www.cnbc.com/2018/01/28/first-official-belt-and-road-bond-issued-on-shanghai-exchange.html", "ord_in_thread": 0, "title": "First official Belt and Road bond issued on Shanghai exchange", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "hongshi", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "shanghai stock exchange", "sentiment": "none"}, {"name": "hongshi holding group", "sentiment": "none"}, {"name": "csrc", "sentiment": "none"}, {"name": "mins ago reuters lintao zhang", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The first official Belt and Road bond in China's domestic market has introduced a new financing instrument for the massive infrastructure initiative but offered few advantages for the issuer.\nHongshi Holding Group, a privately owned cement maker, printed the $300 million yuan ($47 million) three-year corporate bond on the Shanghai Stock Exchange on January 19. Proceeds are earmarked for the purchase of equipment for a $300 million yuan cement plant in Laos with an expected daily capacity of 5,000 tons.\nThe new Belt and Road bond category has the blessing of the China Securities Regulatory Commission, the regulator of the exchange-traded bond market, and the Shanghai bourse was quick to tout the achievement as a sign of its support for President Xi Jinping's signature economic initiative.\nMarket participants, however, were less impressed.\n\"It is just a new label under the CSRC,\" said a source close to Hongshi's deal. \"It does not seem to bring pricing benefit for issuers and it doesn't guarantee that the proceeds can be used offshore.\"\nHongshi, rated AAA by China Chengxin, priced the three-year notes at par to yield 6.34%. The offering was 2.67 times covered, according to a press release from the SSE.\nAfter multiple self-labelled BRI and Silk Road bonds from Chinese banks and corporate issuers, both offshore and onshore, in the past few years, the official label suggests that China's regulators are seeking more control over the use of the term.\nThe National Development and Reform Commission, the country's main economic planner, said last year it would provide better guidelines to curb risks associated with the infrastructure programme.\nHongshi's Laos project is listed as a key Belt and Road initiative by the NDRC in Zhejiang Province, where Hongshi is based, according to the bond prospectus.\nPolitical game Market participants said the new BRI bond category seemed like an attempt to show the CSRC's support for the government initiative, but that the format was unlikely to become mainstream because of restrictions on cross-border capital flows.\n\"We don't feel BRI bonds will go big as offshore use of the proceeds remains an issue,\" said another Shenzhen-based syndicate banker.\nHowever, bankers said the BRI label would speed up approvals from CSRC.\nSSE highlighted Hongshi's issue in the press release as another example of the bourse's active promotion of the role of capital markets in funding projects related to China's massive Belt and Road infrastructure initiative.\nIn March last year, Russian aluminium producer UC Rusal privately placed $1 billion yuan of three-year non-call two notes on the SSE. It was the first bond offering at the exchange from one of the countries touched by the Belt and Road initiative, SSE said.\nShenzhen Stock Exchange, the other domestic bourse under the CSRC's supervision, is also set to embrace its first BRI bonds.\nLast month, Asia's biggest warehouse operator, Global Logistic Properties (GLP), announced that it had obtained approval from the CSRC to issue up to $12 billion yuan of Belt and Road corporate bonds in Shenzhen.\nProceeds would be used to repay debt linked to GLP's recent acquisition of logistics assets in Europe, it said.\nThe National Association of Financial Market Institutional Investors, the main regulator of corporate bonds in the far larger interbank bond market, has yet to create a similar category.\nHowever, NAFMII earlier announced Panda bond offerings from issuers including China Merchants Group and GLP as supportive of Belt and Road projects.\n\"Hongshi is already a frequent issuer in the interbank bond market, but we did not put the Belt and Road label on its previous deals,\" said a source familiar with Hongshi's offerings in the interbank bond market. \"We were told not to overuse the term 'Belt and Road'.\"\nGuotai Junan Securities was sole lead underwriter on Hongshi's offering.", "external_links": [], "published": "2018-01-29T05:02:00.000+02:00", "crawled": "2018-01-29T05:48:09.009+02:00", "highlightTitle": ""}