{"organizations": [], "uuid": "5c884a79569d894db278d197708f80ceadb2ce97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Koch Brothers Like Trump Plan for Dreamers – Fortune", "url": "http://fortune.com/2018/01/28/koch-brothers-immigration-daca/", "country": "US", "domain_rank": 1196, "title": "Koch Brothers Like Trump Plan for Dreamers", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-28T18:39:00.000+02:00", "replies_count": 0, "uuid": "5c884a79569d894db278d197708f80ceadb2ce97"}, "author": "Alana Abramson", "url": "http://fortune.com/2018/01/28/koch-brothers-immigration-daca/", "ord_in_thread": 0, "title": "Koch Brothers Like Trump Plan for Dreamers", "locations": [], "entities": {"persons": [{"name": "charles", "sentiment": "none"}, {"name": "david koch", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brian hook", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}], "organizations": [{"name": "koch brothers like trump plan", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "seminar network", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "deferred action for childhood arrival program", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Koch Brothers Like Trump Plan for Dreamers Demonstrators, many of them recent immigrants to America, protest the government shutdown and the lack of a deal on DACA (Deferred Action for Childhood Arrivals) outside of Federal Plaza on Jan. 22, 2018 in New York City Spencer Platt—Getty Images By Alana Abramson 11:39 AM EST \nAs a record-breaking 550 influential conservative donors prepared to gather in California for their annual winter retreat, the network overseen by Charles and David Koch highlighted its preferences for an immigration bill in Congress — parts of which differ from the plan the White House laid out last week. \nThe network praised the portion of the White House’s framework that would provide legal status for the recipients of the Deferred Action for Childhood Arrival Program — and others who might be eligible, which the White House said would total 1.8 million people. “Immigrants are essential to the success of our country and addressing the plight of the dreamers is a top priority for this network,” said Brian Hook, co-chairman of the Seminar Network. \nBut officials from the network also emphasized that they want to see additional compromise in the final piece of legislation Congress will ultimately hand to President Donald Trump, specifically when it comes to reducing the number of immigrants, a point on which they differ with the White House. The White House proposal would limit family sponsorship and eliminate the visa lottery system, although it would reallocate those visas. \n“We cannot support arbitrary cuts to future legal immigration levels,” said Daniel Garza, president of The LIBRE Initiative, which is backed by the Koch brothers. “We welcome a debate about whether our current legal immigration policy properly balances family and skills-based migration. But that broad debate should not distract from the immediate goal of providing certainty to Dreamers and enhancing security.” \nJorge Lima, the Executive Director of the LIBRE Initiative, said that in addition to working with both chambers of Congress and the White House on a bill, his organization would mobilize its grassroots efforts to hammer home their principles to elected officials and individual communities. \n“It’s everything we do — [communications] grassroots, government affairs, and putting all of that behind the ability to make a difference here,” he said. \nTiming wise, he said it is crucial that Congress pass legislation by March 5, which is when the DACA program, which has provided undocumented immigrants who came to the country as minors with their parents to apply for renewable work permits, will officially expire. (Former President Barack Obama established the program under executive order in 2012, but the Trump administration announced last September it was revoking the order, and that Congress had six months to pass a legislative solution). \n“We know that come March 5 you’re [going to] have a lot of uncertainty for DREAMers whose status has now thrown into question,” Lima said, noting the disruption would extend beyond the dreamers. “We’re asking Congress to act as soon as possible before the March 5 deadline.” \nThe network is planning to spend $20 million this year on advocating for the tax reform bill Trump signed into law ahead of the midterm elections. Officials said on Saturday in a briefing with reporters that spending on policy and politics could total up to $400 million by the end of 2018. When asked how much money would be spent on immigration advocacy, Lima declined to give a monetary figure, but said the advocacy efforts would be “as big of a deal” as tax reform. \n“It’s valuable to know the dollar sign but that doesn’t mean it’s less or more critical on the issue,” he said. “We think that now we can make a big deal on this issue and to do that most efficiently and best as we can.” \n(Disclosure: Time Inc., TIME and Fortune’s parent company, has agreed to be acquired by Meredith Corp. in a deal partially financed by Koch Equity Development, a subsidiary of Koch Industries Inc.) SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-28T18:39:00.000+02:00", "crawled": "2018-01-28T18:39:29.128+02:00", "highlightTitle": ""}