{"organizations": [], "uuid": "fe2eb02206171b315912b6c91a4ec9619f3f7766", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Toyota Is Finally Adding Apple CarPlay – Fortune", "url": "http://fortune.com/2018/01/15/toyota-adds-apple-carplay/", "country": "US", "domain_rank": 1196, "title": "Toyota Is Finally Adding Apple CarPlay", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-15T22:48:00.000+02:00", "replies_count": 0, "uuid": "fe2eb02206171b315912b6c91a4ec9619f3f7766"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/15/toyota-adds-apple-carplay/", "ord_in_thread": 0, "title": "Toyota Is Finally Adding Apple CarPlay", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "negative"}, {"name": "north american international auto show", "sentiment": "none"}, {"name": "android auto", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toyota has famously avoided Apple CarPlay and Android Auto, two in-car software platforms that bring the functionality and feel of a smartphone to the vehicle's central screen.\nBut Toyota appears to be a holdout no more. At least for the upcoming 2019 Toyota Avalon.\nThe new Avalon, the flagship of Toyota’s portfolio, was unveiled Monday at the North American International Auto Show in Detroit. The new vehicle, the fifth-generation Avalon that Toyota has produced, has a bolder looking exterior and new 3.5-liter V6 or the Toyota Hybrid System II engine. Unlike other Toyota vehicles, this one was designed and manufactured in the United States.\nThe 2019 Toyota Avalon will come in four grades: the athletic and all-new XSE, the Touring, the more opulent XLE, and Limited. Hybrid versions are available in the XLE, Limited, and XSE grades. And all come standard with Apple Carplay.\nToyota made no mention of adding Android Auto however. Meaning Google won’t be part of the automaker’s ecosystem just yet--if ever.\nTwo words: Apple. CarPlay. Finally, we know… #NAIAS #Avalon pic.twitter.com/FbKDVyZHz9 \n— Toyota USA (@Toyota) January 15, 2018 \n\nGoogle's Android Auto and Apple CarPlay (AAPL, +1.15%) are two rival software platforms that integrate the smartphone with the car's infotainment system. The in-car software platform brings the functionality and feel of a smartphone--and all those apps--to the vehicle's central screen. Once users connect their smartphone into the car's USB port ( or wirelessly ), the phone's maps and navigation, music, and selected apps are integrated onto the central screen.\nA number of automakers have adopted the platforms. But Toyota, which isn’t keen on giving too much control to third-parties like Apple or Google, has resisted.\nTwo years ago, Toyota committed to using software developed by Ford Motor Co . in its cars to give drivers command and control of smartphone apps through dashboard buttons, display screens, and voice recognition tech. Ford announced in January 2016 Toyota agreed to adopt the company's SmartDeviceLink technology, an open source version of Ford AppLink. SDL is maintained by Livio, a subsidiary of Ford.\nThe companies went a step further and in 2017 formed the SmartDeviceLink (SDL) Consortium , an organization that aims to accelerate the deployment of open source software that will give consumers more options in how they connect and control their smartphone apps. Mazda Motor (MZDAY, +0.28%) , PSA Group, Fuji Heavy Industries (FUJHY, +0.48%) , and Suzuki Motor (SZKMY, +0.95%) , were the first automaker members of the consortium. Suppliers Elektrobit (EBTTF, +0.00%) , Harman (HAR, +0.00%) , Luxoft (LXFT, +0.26%) , QNX, and Xevo also joined the nonprofit organization.\nToyota announced last week during the annual tech trade show CES that Amazon’s digital assistant Alexa would be available in some Toyota and Lexus cars. Toyota customers will be able to use Alexa for more complex tasks like providing driving directions, reading news, and controlling Internet-connected home gadgets while they drive.", "external_links": [], "published": "2018-01-15T22:48:00.000+02:00", "crawled": "2018-01-15T22:49:00.004+02:00", "highlightTitle": ""}