{"organizations": [], "uuid": "0f463cadcd2f7e0f191f2b7127c9295a70a4f3ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/11/103627925-IMG_3504.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/kohls-to-partner-with-grocer-convenience-store-to-fill-vacant-space.html", "country": "US", "domain_rank": 767, "title": "Kohl's ready to partner with grocer or convenience store to fill vacant store space", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T19:14:00.000+02:00", "replies_count": 0, "uuid": "0f463cadcd2f7e0f191f2b7127c9295a70a4f3ce"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/kohls-to-partner-with-grocer-convenience-store-to-fill-vacant-space.html", "ord_in_thread": 0, "title": "Kohl's ready to partner with grocer or convenience store to fill vacant store space", "locations": [], "entities": {"persons": [{"name": "kohl", "sentiment": "negative"}, {"name": "nicole o'hara", "sentiment": "negative"}, {"name": "mansell", "sentiment": "none"}, {"name": "kevin mansell", "sentiment": "none"}], "locations": [{"name": "jersey city", "sentiment": "none"}, {"name": "menomonee falls", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "icr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kohl's plans to partner with retailers like grocery stores or convenience stores to lease the white space left by the roughly 300 stores it has \"right-sized\" over the past several years, CEO Kevin Mansell told CNBC at ICR's conference this week.\nThe department store has created operationally smaller, more profitable stores within its roughly 87,000-square-foot boxes. That downsizing leaves unused footage, which Mansell said would benefit from traffic-generating retailers like those that sell food.\n\"If we had our preference, we are going first after well-capitalized companies, and preferably ones that have high traffic in grocery and convenience,\" Mansell said.\nThe Menomonee Falls, Wisconsin-based retailer has already identified \"a whole list of partners\" to roll out across a number of its stores.\n\"We are more apt to identify strong partners and then build a pathway with them through this pilot phase.\"\nFor potential Kohl's partners, the department store brings with it strong real estate, big parking lots and its own traffic. A food and apparel duo would be able to compete against a number of retailers employing similar strategies, like Target and even Walmart .\nNot all of Kohl's roughly 300 right-sized stores will necessarily lease space, at least at the onset. Kohl's may partner with several retailers in group rollouts and it could also partner with some as a one-off. Kohl's would consider partnerships with competitors, Mansell said.\nHe declined to say whether Whole Foods is one of its in-store partners. Kohl's already has a partnership with Whole Food's new owner, Amazon , through which it sells Amazon products and accepts its returns. \n\"It's not about Whole Foods, Aldi, or anybody else … we want a partner, ideally in food or convenience, to help drive traffic,\" said Mansell. The company plans to announce news about these efforts on its next earnings call, which is scheduled for March 1.\nRetailers are increasingly looking to unlikely bedfellows to broaden their offerings and rethink their store space. As in-store sales decline, smaller stores help retailers more profitably maintain their physical presence. Having stores helps with marketing and alleviating the cost of shipping and returns. Partners, meanwhile, can bring in new traffic.\nLord & Taylor-owner the Hudson's Bay Co. recently signed a deal with WeWork to lease some of its retail space to the office-sharing company.\nKohl's has said its smaller store concepts have allowed it to improve profitability and lower its inventory levels. The latter is important as it lessens the risk of unsold clothes, which hurt profit margins.\nLike its peers, it has also been opening stand-alone small-store concepts. This past quarter, it opened four new 35,000-square-foot stores, bringing the total up to 12. Target has plans to open 130 of its small-format stores by 2019 . European grocer Lidl, which is embarking on a U.S. expansion, recently shifted its focus to include smaller-format stores.\nBeyond focusing on improving the profitability of its store space, Kohl's has been focusing on other initiatives, which could include acquisitions, Mansell said. Potential deals are unlikely to include department store peers. \n\"Kohl's is not taking anything off the table. We have a healthy balance sheet and we can actually act,\" said Mansell, who plans to retire in May . \nBut, he said, any deal would have to generate more traffic to Kohl's stores. \"To just a bolt on a business, what does that do?\"", "external_links": [], "published": "2018-01-10T19:14:00.000+02:00", "crawled": "2018-01-10T19:35:24.044+02:00", "highlightTitle": ""}