{"organizations": [], "uuid": "8791bbfe6fa6482f3714e62a6395b31ec23c50fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 105, "shares": 105, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976231-Untitled-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/30/cramer-centene-is-the-way-to-play-amazons-health-care-move.html", "country": "US", "domain_rank": 767, "title": "Cramer says Centene is the way to play the Amazon-Berkshire-JP Morgan health care move", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T01:13:00.000+02:00", "replies_count": 0, "uuid": "8791bbfe6fa6482f3714e62a6395b31ec23c50fc"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/cramer-centene-is-the-way-to-play-amazons-health-care-move.html", "ord_in_thread": 0, "title": "Cramer says Centene is the way to play the Amazon-Berkshire-JP Morgan health care move", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}], "locations": [], "organizations": [{"name": "centene", "sentiment": "negative"}, {"name": "amazon-berkshire-jp morgan", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "mins ago cnbc.com  when amazon", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Amazon , Berkshire Hathaway and J.P. Morgan announced a partnership to cut costs and improve services across the health care industry, CNBC's Jim Cramer had to weigh in.\nThe joint venture, organized by Amazon's Jeff Bezos , Berkshire Hathaway's Warren Buffett and J.P. Morgan's Jamie Dimon , will aim to be \"free from profit-making incentives and constraints,\" the companies said on Tuesday.\n\"It's bad enough that the most important man in finance, the most important man in retail and the best investor alive are teaming up to tackle the problems of our health care system, but even worse for the industry, they're doing it for free,\" the \" Mad Money \" host said. \"It is very hard to compete with someone who doesn't care about turning a profit.\"\nThe initiative elevates the discussion around rising health care costs in the United States, which Cramer said the three titans view as \"the ultimate tax on the system.\"\nIn May 2017, Buffett said that in 50 years, health care has gone from being 5 percent of U.S. gross domestic product (GDP) to 17 percent with few solutions in sight to curb surging costs.\n\"Now that's going to change,\" Cramer said. \"Now there is something on the horizon, a company of his own creation with the most technologically savvy provider of what people want and the smartest banker of our time.\"\nThe \"Mad Money\" host also noted the analyst community's eerily calm reaction to the deal. No analyst covering health care retailers like CVS or in-the-line-of-fire middlemen like Express Scripts wants to come out and slash the estimates for those companies right away, he said.\n\"But I bet the analysts who actually cover Jeff, Jamie and Warren's companies — Amazon, J.P. Morgan and Berkshire Hathaway — would view this coalition with a very different, awestruck attitude. I'll tell you, if these guys were coming after my business, I'd be terrified,\" Cramer said.\nSome analysts were able to compose sound defenses, including that UnitedHealth's Optum service is already tackling costs and that the middlemen save costs by buying as a group.\nBut Cramer came back with some retorts: the incumbent companies are still not as digitally savvy as this new player will be, and their teams of government lobbyists won't be of any use when it comes to Bezos, Buffett or Dimon.\nWhat does that mean for investors? Cramer's answer was somewhat complicated, particularly for investors who can't wait to get in on the action.\nEven leading players like UnitedHealth aren't safe from being in the \"penalty box\" for some time, he said.\n\"You need a health care company that's survived every onslaught imaginable,\" Cramer said. \"You need a road warrior with a stock that you'll want to load up on into weakness if Amazon talks about this effort on its Thursday night conference call, or the non-profit comes up with a name or a chief executive.\"\nInvestors also need a stock that is cheap with positive prospects that are supported by the technicals, the \"Mad Money\" host said.\n\"In short, you need Centene ,\" he said. \"Centene's an expert at providing its clients with high-quality care at the lowest possible costs, and yet it's been making its shareholders a fortune.\"\nCentene, a large, enterprise-facing provider of Medicare and Medicaid, was even blessed by technician Marc Chaikin as one of the best health care stocks on Monday, Cramer added.\nStill, Cramer maintained that buyers should time their investments wisely.\n\"I don't like to enter a blast zone on the first day of a sell-off, especially when there are still plenty of stocks outside the blast zone that have come down,\" the \"Mad Money\" host said. \"So if you want health care exposure, I suggest waiting until the group's a little less radioactive. But if you just can't resist, if you need to pick one up this week, I'd say buy Centene.\"\nWATCH: Cramer talks investment strategy and health care news show chapters Cramer reveals the way to play the Amazon-Berkshire-JP Morgan health care move 21 Hours Ago | 13:07 Disclosure: Cramer's charitable trust owns shares of J.P. Morgan.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-31T01:13:00.000+02:00", "crawled": "2018-01-31T01:16:44.016+02:00", "highlightTitle": ""}