{"organizations": [], "uuid": "3a31780aff4a037819cd9cfa1328bbb137276586", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/29/103345831-GettyImages-507411894.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/dow-stock-boeing-is-up-over-100-percent-in-one-year-and-some-say-the-run-isnt-over.html", "country": "US", "domain_rank": 767, "title": "Dow stock Boeing is up over 100% in one year, and some say the run isn't over", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T20:20:00.000+02:00", "replies_count": 0, "uuid": "3a31780aff4a037819cd9cfa1328bbb137276586"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/dow-stock-boeing-is-up-over-100-percent-in-one-year-and-some-say-the-run-isnt-over.html", "ord_in_thread": 0, "title": "Dow stock Boeing is up over 100% in one year, and some say the run isn't over", "locations": [], "entities": {"persons": [{"name": "ari wald", "sentiment": "none"}, {"name": "wald", "sentiment": "none"}], "locations": [], "organizations": [{"name": "boeing", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "oppenheimer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "21 Hours Ago | 03:35 \nBoeing shares have been on fire. \nEven after falling on Friday and the previous session, the stock is the best-performing Dow component this year, up 14 percent year to date and on pace for its fifth straight positive month. Its rise over the last year has soared into triple-digit gains. \nThis meteoric price action is making some market watchers hesitant about buying the stock at this juncture, but say the shares could keep surging still. \nThe stock is overbought, said Ari Wald, head of technical analysis at Oppenheimer, but \"I just don't think that's a bad thing. I see this as a terrific example of the persistence of market leadership. The rules for momentum investing — and we are momentum investors — is to let your winners run. Make sure you have the big winners to offset your smaller losses. We'd rather be selling our losers.\" \nWald said Thursday on CNBC's \" Trading Nation \" that if investors are concerned about overbought conditions given the stock's run, \"you've been out of this thing for the last 100 percent. If you're putting new money to work, indeed, it's not tactically attractive here.\" \nThe technical analyst said he sees the stock as \"extended\" and due for a pause, but there are \"no signs that this is the top in Boeing just yet.\" \nThe aerospace giant is trading at 28 times forward earnings, according to FactSet, up from just 17 times forward earnings one year ago. Meanwhile, the S&P 500 is trading at nearly 18.5 times forward earnings. \n\"It's a little rich for us. We think if you're trying to get in, you might be too late to the party at this time,\" said Mark Tepper, president and CEO at Strategic Wealth Partners, also on \"Trading Nation.\" \nTepper said that while Boeing has shown strong international growth, particularly in India and China, and boasts a strong fundamental backdrop on several fronts like increased passenger and freight traffic, the stock's current valuation does not look attractive. \nBoeing shares were down 1 percent midday Friday.", "external_links": [], "published": "2018-01-19T20:20:00.000+02:00", "crawled": "2018-01-19T20:27:29.004+02:00", "highlightTitle": ""}