{"organizations": [], "uuid": "343d44efe07ef583c99f8a7bea524fe05f258c9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223347064&w=1200&r=LYNXMPEE0I0RJ", "site_section": "http://drudgereportfeed.com/rss.xml", "section_title": "Drudge Report Feed", "url": "https://uk.reuters.com/article/uk-germany-politics-merkel/slowly-germany-begins-to-ponder-life-after-merkel-idUKKBN1F81EB", "country": "US", "domain_rank": 408, "title": "Slowly, Germany begins to ponder life after Merkel...", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T15:58:00.000+02:00", "replies_count": 0, "uuid": "343d44efe07ef583c99f8a7bea524fe05f258c9b"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics-merkel/slowly-germany-begins-to-ponder-life-after-merkel-idUKKBN1F81EB", "ord_in_thread": 0, "title": "Slowly, Germany begins to ponder life after Merkel...", "locations": [], "entities": {"persons": [{"name": "merk", "sentiment": "negative"}, {"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "paul carrel", "sentiment": "none"}, {"name": "paul ziemiak", "sentiment": "none"}, {"name": "christian democra", "sentiment": "none"}, {"name": "andreas rinke", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "christian democrats", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 12:51 PM / Updated 6 hours ago Slowly, Germany begins to ponder life after Merkel Paul Carrel , Andreas Rinke 6 Min Read \nBERLIN (Reuters) - She has not faced a credible challenge to her rule as German chancellor for more than 12 years. Now, members of Angela Merkel’s conservatives are starting to look ahead to potential alternatives to lead their party and country. \nMerkel’s immediate fate depends on the Social Democratic Party (SPD), which votes on Sunday on whether their leaders should pursue coalition negotiations with her Christian Democrats after striking a preliminary deal last week. \nA “no” vote could force fresh elections as well as renewed debate on the issue of succession. \nInterviews by Reuters with more than a dozen party lawmakers indicate that the coalition talks have brought pressure from Merkel’s party for new faces to be included in the next cabinet and prompted early conversations on a succession plan. \n“We need to talk about how the Union can renew itself,” said Paul Ziemiak, who chairs the youth wing of the Union of Merkel’s Christian Democrats (CDU) and the Christian Social Union (CSU), which run together in national elections on the same ticket. \nMerkel herself decided to seek a fourth term only after long reflection, and said in November 2016 she was seeking to stay on “if health allows”. In 1998 she was quoted as saying: “I don’t want to be a half-dead wreck when I leave politics.” On the other hand, she has not ruled out running for a 5th term. \nThe departure of Merkel, whose time in office has overlapped with four French presidents and four British prime ministers, risks creating a leadership vacuum in the European Union at a critical and uncertain time. \nTo smooth the transition, many in the CDU favour the idea of a gradual transition. That could involve handing the party chairmanship over first. \nOthers want Merkel to go sooner, however, frustrated with her handling of the refugee crisis, which hurt the party in Sept. 24’s national election. Lamenting their loss of support to the far right, they complain she lacks the common touch. \nOne CDU lawmaker, who admired Merkel’s mastery of detail but complained she lacks empathy, said that handing over the chancellorship early would strengthen her successor and the party in the next election, due in 2021. \n“Tactically, a chancellor has an incumbency advantage. That means there could be a change within the legislative period,” the lawmaker said. SUPERCHARGED DEBATE \nThe succession debate has been supercharged by the inclusion of a clause in the preliminary coalition deal with the SPD that envisages a review of the next government’s progress after two years to assess whether any changes to its mission are needed. \n“A good time for Merkel to resign,” one CDU lawmaker, speaking on condition of anonymity, said of the review. FILE PHOTO - Junge Union Deutschlands (Young Union of Germany) chairman Paul Ziemiak speaks during the Christian Democratic Union (CDU) party congress in Karlsruhe, Germany December 14, 2015. Junge Union Deutschlands is the youth organisation of CDU and its Bavarian sister party Christian Social Union (CSU). REUTERS/Kai Pfaffenbach \nThe risk of a handover at that point is that the SPD, if it agrees to govern with the conservatives, could pull the plug on the coalition and force fresh elections. But the situation also could come to a head far sooner. \nSunday’s SPD vote is an immediate hurdle. If fresh elections are held, a small minority of lawmakers on the right of the CDU and in the CSU hope she would not run again for chancellor, according to those who spoke to Reuters. \nOthers reject this idea. \n“We are not of the view that if the SPD votes ‘no’ on Sunday, that this is the fault of the Union or the chancellor,” said Detlef Seif, deputy EU spokesman for Merkel’s conservative parliamentary bloc. \nMerkel has said she would run again for chancellor in the event of new elections. Voters still respect her, polls show. FILE PHOTO - German Deputy Finance Minister Jens Spahn speaks during an interview with Reuters in Berlin, Germany October 4, 2016. REUTERS/Joachim Herrmann \nA Forsa poll published on Thursday showed support for Merkel’s CDU/CSU bloc rose to 34 percent, slightly above its election result of 32.9 percent. Support for the SPD slipped to 18 percent, below the 20.5 percent it achieved in the election. \nMany conservatives favour an orderly transition. \n“I think a sensible succession arrangement must be found within the Union, but not at the moment given all that the chancellor has achieved, and not in the middle of a legislative period,” said Seif. \nOne way, discussed by some other CDU lawmakers, of achieving an orderly handover would see Merkel relinquish the CDU party chair to a designated successor in 2020 while remaining chancellor, a scenario which would allow the person to raise their profile. \nMerkel has in the past said she believes the party chair and chancellorship should be held by the same person. \nThe CDU botched its last leadership handover. \nLate chancellor Helmut Kohl handed over the chairmanship to Wolfgang Schaeuble after his defeat at the 1998 election, only for them both to be compromised by a party funding scandal. Merkel then took over as leader, calling for a new start. \nSchaeuble, highly respected by conservatives for imposing fiscal discipline on the euro zone during his time as finance minister, is perhaps the only CDU figure who could lead a putsch to oust Merkel. A trusted, if awkward, ally for Merkel, he is unlikely to do so. \nYounger contenders are circling, notably deputy finance minister Jens Spahn. \n“Germans love orderly processes, but when it comes to handing over the chancellorship it doesn’t happen,” said Carsten Nickel at advisory firm Teneo Intelligence. “I think there will be a lot of movement in the CDU in the next four years.” Editing by Sonya Hepinstall", "external_links": [], "published": "2018-01-19T15:58:00.000+02:00", "crawled": "2018-01-19T16:03:54.012+02:00", "highlightTitle": ""}