{"organizations": [], "uuid": "9b9c1c0ee30cecae2567e4edfddbcc1c49182f42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/19/103316126-GettyImages-501173806.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/tiffanys-2017-holiday-sales-jump-8-percent.html", "country": "US", "domain_rank": 767, "title": "Tiffany's holiday sales jump 8 percent, boosted by growth in China and Europe", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T14:32:00.000+02:00", "replies_count": 0, "uuid": "9b9c1c0ee30cecae2567e4edfddbcc1c49182f42"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/tiffanys-2017-holiday-sales-jump-8-percent.html", "ord_in_thread": 0, "title": "Tiffany's holiday sales jump 8 percent, boosted by growth in China and Europe", "locations": [], "entities": {"persons": [{"name": "tiffany", "sentiment": "negative"}, {"name": "alessandro bogliolo", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "europe shares getty images  tiffany & co.", "sentiment": "neutral"}, {"name": "tiffany", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook Tiffany's holiday sales jump 8%, boosted by growth in China and Europe Tiffany reported an 8% increase in net revenue during the 2017 holiday season. Total same-store sales were up 5%. Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Tiffany's holiday sales jump 8%, boosted by growth in China and Europe Lauren Thomas, CNBC Published 8:26 a.m. ET Jan. 17, 2018 CLOSE Companies have found a new way to find out valuable information about consumers. The answers may now be in your footsteps. Buzz60 Source: PIxabay. (Photo: The Motley Fool) CONNECT COMMENT EMAIL MORE Tiffany & Co. on Wednesday reported an 8% increase in net revenue during the holiday season, fueled by higher sales of fine jewelry, watches, and a new home and accessories collection. Total same-store sales were up 5% during the November and December months, the company said. In the U.S. alone, same-store sales rose 6 percent. The strongest performance for Tiffany stemmed from the Asia-Pacific region and Europe, where sales grew by a double-digit percentage. The retailer has been opening new stores overseas, and local customers are beginning to spend more there. Building on the holiday momentum, Tiffany raised its earnings outlook for fiscal 2017. The changes don't yet include any effects from new tax legislation. \"This recent return to growth in worldwide comparable store sales ... is consistent with our commitment to generate solid and sustainable growth in sales, operating margin and earnings that is at least comparable to our industry peers over the long-term,\" Chief Executive Officer Alessandro Bogliolo said in prepared remarks. More: Giant 910-carat diamond mined in southern Africa kingdom of Lesotho \"While we are encouraged with the holiday sales results, we believe that the preceding negative comparable store sales trend can only be reversed on a sustainable basis by continuing to evolve our product offerings and customer experience and also by stepping up certain strategic spending in our business,\" Bogliolo added. Tiffany now expects net sales worldwide to increase by roughly 4% in fiscal 2017, and adjusted net earnings will rise by, at a minimum, a high-single-digit percentage from a year ago. The company also on Wednesday provided a preliminary outlook for fiscal 2018 and is calling for a mid-single-digit percentage increase in total sales. Meantime, Tiffany said it will spend more in the upcoming fiscal year on technology, marketing, and store presentations to reach growth objectives over the long term. In turn, the company is expecting earnings to be flat to slightly down from fiscal 2017's figure. Earnings are expected to get a boost, however, \"in an amount yet to be determined, from an expected lower effective income tax rate resulting from the recent revisions to the U.S. tax code,\" the company said. More details will be provided on March 16, when Tiffany is set to report fourth-quarter and full-year results. Tiffany shares fell slightly in premarket trading Wednesday on the news, having climbed more than 30% from a year ago. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CLOSE There are new shopping trends for 2018 that Forbes.com contributors expect to see. Elizabeth Keatinge (@elizkeatinge) has more. Buzz60 CONNECT COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-17T14:32:00.000+02:00", "crawled": "2018-01-17T14:42:05.009+02:00", "highlightTitle": ""}