{"organizations": [], "uuid": "3e037dd392772ca24e73f85877c50b4dbef1ea45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/04/104633828-GettyImages-822254598-bitcoin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/hedge-fund-managers-reap-3175-percent-profit-off-bitcoin-in-2017.html", "country": "US", "domain_rank": 767, "title": "Hedge fund managers reap 3,175% profit off bitcoin in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:51:00.000+02:00", "replies_count": 0, "uuid": "3e037dd392772ca24e73f85877c50b4dbef1ea45"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/hedge-fund-managers-reap-3175-percent-profit-off-bitcoin-in-2017.html", "ord_in_thread": 0, "title": "Hedge fund managers reap 3,175% profit off bitcoin in 2017", "locations": [], "entities": {"persons": [{"name": "donat sorokin", "sentiment": "none"}], "locations": [{"name": "oktyabrskaya square", "sentiment": "none"}, {"name": "yekaterinburg", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "tass", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Hedge fund managers reap 3,175% profit off bitcoin in 2017 The HFR Cryptocurrency Index rose 88 percent in December and 3,175 for all of 2017. A similar blockchain index posted respective returns of 88 percent and 2,690 percent. That performance was part of a larger trend that saw hedge funds up every month of the year for a total return of 8.5 percent, its best since 2013. SHARES Donat Sorokin | TASS | Getty Images A girl poses for a photograph on a stone sphere monument that unidentified persons have painted with the white Bitcoin cryptocurrency symbol in Oktyabrskaya Square, Yekaterinburg, Russia. \nFor hedge funds, 2017 ended with a clean sweep — positive returns in every month that resulted in the best total performance in four years. \nThat kind of a winning streak hasn't happened since 2013 and was part of a 14-month run of monthly growth that resulted in a gain of 8.5 percent for the HFRI Fund Weighted Composite Index, an industry barometer of total hedge fund performance. The index rose 0.9 percent for December. \nThe relatively strong overall performance for the year, though, was dwarfed by returns from the HFR Blockchain and HFR Crypotcurrency indexes, the latest additions to the hedge fund universe. \nLaunched publicly in December, the indexes tracks managers who are investing in bitcoin, ethereum and others in the cryptocurrency space, as well as companies involved in blockchain and related technologies. \nThe blockchain index surged 88.5 percent in December and would have risen 2,690 percent for the year. Separately, the cryptocurrency Index rose 88.4 percent in December and 3,175 percent for all of 2017. \n\"The powerful combination of surging global equity markets, dynamic M&A trends, commodity volatility and divergent interest rate cycles has created an exciting opportunity set for hedge funds coming into 2018,\" HFR President Kenneth J. Heinz said in a statement. \n\"Developing opportunities in risk parity, blockchain and cryptocurrency trading, each of which have posted outstanding performance in 2017, are likely to further complement and contribute to record industry growth in 2018,\" he added. \nOf course, hedge funds continue to underperform the broader market. The S&P 500 was up about 19 percent for 2017 — 21.8 percent including dividends. \nFor hedge funds, fundamental growth proved to the best strategy for the year, with an 18.9 percent gain. Health care rose 17 percent. \nBetting against the market proved to be the worst strategy, with the HFR Short Bias index down 10.2 percent. \nWATCH: The clamor for bitcoin ETFs continues . show chapters", "external_links": [], "published": "2018-01-09T21:51:00.000+02:00", "crawled": "2018-01-09T22:00:13.025+02:00", "highlightTitle": ""}