{"organizations": [], "uuid": "df9fe3dd3ce5e5a8d2139e739d9aafe1c0395962", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 113, "shares": 113, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Government Shutdown Starts as Senate Democrats Block GOP Funding Plan – Fortune", "url": "http://fortune.com/2018/01/20/us-government-shutdown-2018/", "country": "US", "domain_rank": 1196, "title": "Government Shutdown Starts as Senate Democrats Block GOP Funding Plan", "performance_score": 1, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T15:58:00.000+02:00", "replies_count": 0, "uuid": "df9fe3dd3ce5e5a8d2139e739d9aafe1c0395962"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/20/us-government-shutdown-2018/", "ord_in_thread": 0, "title": "Government Shutdown Starts as Senate Democrats Block GOP Funding Plan", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. government officially entered a partial shutdown early Saturday as Senate Democrats and a handful of Republicans blocked a bill to fund the government after the two parties failed to break their deadlock over immigration.\nThe shutdown began one year from the day President Donald Trump was inaugurated. Trump and his aides were typically defiant, with his press secretary calling Democrats \"obstructionist losers, not legislators\" and saying there would be no immigration negotiations until the shutdown was lifted.\nThe White House and federal agencies spent Friday mapping out the government closure, with a goal of as little disruption as possible. Mail will continue to be delivered; airport control towers will be staffed; and the Interior Department hopes to keep the national parks open.\nHaving stumbled into a shutdown few seemed to want, lawmakers in both parties seemed eager to keep it brief. As the midnight deadline passed, Republican senators kept haggling with Democrats over a compromise that would re-open the government as soon as this weekend, with a new funding cutoff date of Feb. 8.\nSaturday Session But it was uncertain whether they could act that quickly. The Senate adjourned until noon on Saturday, and there could be a vote on the shorter funding window if Democrats agree. Any new legislation will require another vote in the House, which also will be in session on Saturday.\nFinancial markets shrugged off the shutdown drama in Washington. U.S. stocks rose to all-time highs after a report that regulators are close to further easing banking rules. All major equity indexes gained and the S&P 500 rose 0.4 percent to a record 2,810.31.\nThe House agreed on funding for the government through Feb. 16, but it got blocked in the Senate, despite leaving the vote open for a full two hours, in the face of mostly unified Democratic opposition. Four Republican Senators, Lindsey Graham, Jeff Flake, Rand Paul and Mike Lee, voted against moving forward with House bill, though for different reasons.\nSenate Majority Leader Mitch McConnell voted \"no\" at the last minute as a procedural maneuver that would give him a chance to bring the measure up for a vote again.\n'Cynical Decision' \"What we've just witnessed on the floor was a cynical decision by Senate Democrats to shove aside millions of Americans for the sake of irresponsible political games,\" McConnell said after the voting was finished.\nBoth parties immediately began trying to tag the other with the blame, as competing hashtags showed up on Twitter: #TrumpShutdown and #SchumerShutdown, named for the top Senate Democrat, Charles Schumer of New York.\n\"Senate Democrats own the Schumer Shutdown,\" White House press secretary Sarah Huckabee Sanders said in her statement. \"We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands.\"\nDivisions Democrats want legislation to protect undocumented immigrants brought to the U.S. as children and Republicans are setting conditions for border security and enforcement.\nSchumer said after the vote that when he met with Trump at the White House earlier Friday, they appeared to have reached the \"outline of a deal\" on issues including immigration and health care. Instead, he said, Trump folded when he got pushback from Republicans.\n\"He backed off at the first sign of pressure,\" Schumer said on the Senate floor.\nWhite House officials from Trump down had put on an optimistic front early in the day.\n\"Excellent preliminary meeting in Oval with @SenSchumer,\" the president wrote on Twitter, less than seven hours before the midnight deadline.\nThe White House Budget Director Mick Mulvaney predicted Republicans and Democrats would strike an agreement before the weekend was out to provide temporary funding for the government that would let federal agencies open on schedule Monday.\n\"I think there's a deal in the next 24 hours,\" Mulvaney said on CNN.\nIf there's not, both sides were ready to place blame.\nBlaming Trump Schumer blamed the standoff on Trump's inability to set a clear path and the failure of Republican congressional leaders to deliver on immigration. He said the president is the \"single driving force in scuttling bipartisan deals in Congress.\"\nOne potential way out would be significant progress on immigration among congressional Democrats and Republicans and the White House. Members of Trump's administration, including Chief of Staff John Kelly and Homeland Security Secretary Kirstjen Nielsen, have been shuttling between meetings at the Capitol where members of both parties have been working on a getting a deal.\nDemocrats have been demanding that Congress act now to protect the young immigrants who are shielded under the Obama-era Deferred Action for Childhood Arrivals program, which Trump plans to end on March 5. Republicans want to pair that issue with stronger border security and restrictions on other immigration programs.\nThe House earlier voted 230-197 largely along party lines to pass a bill that would have continued government financing at current levels until Feb. 16. It included a six-year extension of funding for the Children's Health Insurance Program and a delay in implementation of three taxes imposed by the Obama-era Affordable Care Act.\nRepresentative Charlie Dent, a moderate Republican from Pennsylvania, said there's no mystery about what is needed to resolve the impasse, since these issues had been on the table since September.\n\"Leadership here is going to have to allow a vote on a bipartisan DACA bill — take the bull by the horns and do it,\" Dent said, using the acronym for the immigration program at the center of the standoff. \"Because we're not going to remove ourselves from this treadmill of continuing resolutions until we have a bipartisan budget agreement. And we will not have a bipartisan budget agreement until there is an agreement on DACA.\"\n", "external_links": [], "published": "2018-01-20T15:58:00.000+02:00", "crawled": "2018-01-20T15:59:08.002+02:00", "highlightTitle": ""}