{"organizations": [], "uuid": "5322c8c304816af4b41239c0c68b0e80dca8ac9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/01/101077241-182585928r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/government-shutdown-2018-myths-legends-and-lies-commentary.html", "country": "US", "domain_rank": 767, "title": "Government shutdown myths, legends and lies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T17:22:00.000+02:00", "replies_count": 0, "uuid": "5322c8c304816af4b41239c0c68b0e80dca8ac9c"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/government-shutdown-2018-myths-legends-and-lies-commentary.html", "ord_in_thread": 0, "title": "Government shutdown myths, legends and lies", "locations": [], "entities": {"persons": [{"name": "emmanuel dunand", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With the deadline for a government shutdown looming and no deal in the Senate in sight, the big political question a lot of people are asking is: \"Who will take the blame if the government does actually shut down?\"\nThat's the wrong question. History tells us so.\nThe right question is: \"If there is a government shutdown and one party is blamed for it by most voters, will they do anything about it at the ballot box?\"\nThat's the better question because the facts tell us no one party has ever really had to pay an electoral price even when they've been fingered as the primary culprits in the always unpopular government shutdown game.\nThe 16-day government shutdown in September 2013 was a public relations disaster for the Republicans in Congress. At least that's what just about all the polls said. Then the public went to the polls just about a year later and … handed the GOP not only broader control of the House but a majority in the Senate for the first time in six years.\nShutdown fallout? Not so much.\nBut what about those two government shutdowns in late 1995 and then early 1996 that the Republican Congress also took the blame for? Didn't that lead to major political punishment for the GOP, then-House Speaker Newt Gingrich and 1996 Republican presidential nominee Bob Dole?\nThat's not really what happened. In the 1996 congressional elections, the GOP actually won a net gain of two seats in the Senate and only lost two seats in the House. Picking up a greater Senate majority is much more valuable to any political party, especially if the only tradeoff is losing two seats out of 435 total in the House. And yes, Dole lost to Clinton in the presidential election but blaming Dole's loss on the government shutdown is a colossal stretch.\nBut what about the markets? Don't they take a big hit when the government shuts down?\nNope.\n\"The government shutdown in September 2013 was a public relations disaster for the Republicans in Congress. Then the public went to the polls a year later and … handed the GOP not only broader control of the House but a majority in the Senate for the first time in six years.\" The last three government shutdowns have resulted in gains, yes gains, for the broader markets. That includes a healthy 3.1 percent gain for the S&P 500 during the 2013 shutdown.\nThe solid and consistent historical data should do more than throw cold water on the so-called \"vital\" question of who takes the blame for a shutdown. It should also help both parties decide to stop being such duplicitous cowards when it comes to budget issues.\nThe Democrat duplicity is currently on display as they keep trying to play both sides of this shutdown battle. One the one hand, many Democrats are insisting that any budget include a deal on the Deferred Action on Childhood Arrivals program, known as DACA, that will protect immigrants who were brought here illegally as children.\nOn the other hand, many Democrats are pushing out the message that since the Republicans have the White House and majorities in both houses of Congress, the decision to shut down the government is all on them.\nThat argument is weak on the facts, since you need 60 votes in the Senate to pass a budget bill. Still, it appears the Democrats are betting the general public is ignorant of that.\nIgnorance or no ignorance, the Democrats need to decide which message they want to send. Are they making a sacrifice for the Dreamers, or are they just going to blame the GOP for another shutdown?\nSince we know taking the blame for a shutdown isn't really so bad, a good argument could be made that the Democrats risk nothing politically if they triple down on the theatrics and \"gamble everything\" to help the Dreamers. Polls show the majority of Americans are sympathetic to the Dreamers cause.\nSo what's stopping the Democrats from doing that?\nProbably the same polls that say a plurality of Dreamer supporters don't think the fight for them is worth a government shutdown.\nThat explains the duplicitous Democrat messaging right now.\nDon't let the Republicans off the hook so fast, either. The GOP is supposedly the party in favor of spending cuts. But these stopgap bills just string wasteful spending along indefinitely. If being blamed for causing a shutdown is the only fear forcing those hawks to begrudgingly vote for the continuing resolutions, then worrying about election punishment is still a bad excuse.\nThe only real argument against a shutdown is that it does unfairly inconvenience a lot of Americans who don't deserve the hassle. Whether it's government worker furloughs, held-up mortgage approvals, or shuttered national parks, shutdowns are still an embarrassing sign of dysfunction.\nKnowing what we know about the true political fallout, the only solution is to keep budget negotiations to budget matters and leave the ideological and immigration battles to another forum.\nIn other words, our elected officials should do their jobs.\nWhat a novel concept.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-19T17:22:00.000+02:00", "crawled": "2018-01-19T17:34:14.031+02:00", "highlightTitle": ""}