{"organizations": [], "uuid": "eaada10884c18d569b76cfcbf2de082a200a228f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937030-22780661_10155748295288834_1302316940391294396_n.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/newmans-own-facing-sale-of-company-after-tax-relief-struck-from-new-law.html", "country": "US", "domain_rank": 767, "title": "An obscure tax law might force Newman's Own to put itself up for sale", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T18:10:00.000+02:00", "replies_count": 0, "uuid": "eaada10884c18d569b76cfcbf2de082a200a228f"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/newmans-own-facing-sale-of-company-after-tax-relief-struck-from-new-law.html", "ord_in_thread": 0, "title": "An obscure tax law might force Newman's Own to put itself up for sale", "locations": [], "entities": {"persons": [{"name": "newman", "sentiment": "negative"}, {"name": "forrester", "sentiment": "none"}, {"name": "bob forrester", "sentiment": "none"}, {"name": "paul newman", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "newman's own foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 Hours Ago | 01:53 \nNewman's Own, the popular purveyor of philanthropic pasta sauce, will be forced to put itself up for sale or pay crushing fines this year due to an obscure provision in the tax code. \nThe household brand is facing a tax bill of up to 200 percent on the majority of its business — a penalty so steep company executives say it would effectively put them out of business. The only alternative, they say, is for the private foundation established by the late Hollywood legend Paul Newman to relinquish control of the company that bears his name. \n\"It's not a possibility — it's an absolute certainty that we would have to divest,\" Bob Forrester, chief executive of the Newman's Own Foundation, told CNBC. \nOn Wednesday, Forrester is slated to meet with lawmakers in hopes of a securing a last-minute legislative fix, potentially as part of any deal to fund the government past Jan. 19. Newman's Own had hoped to tuck a solution into the Republicans' sweeping tax plan that passed late last year, but it was dropped over fears that the provision did not comply with procedural rules in the Senate. Previous attempts to exempt Newman's Own from the hefty fines have garnered bipartisan support. \n\"It ultimately fell victim to the Senate's strict budget rules that guided our tax reform effort,\" Sen. John Thune , R-S.D., said in a statement to CNBC. \"I remain a strong supporter of this protection.\" \nThis is not the future that Newman, the late blue-eyed Hollywood heartthrob and star of \"Cool Hand Luke\" and other hits, envisioned when he established the company more than 30 years ago. The business was a side gig for the master of marinara, a way to create a permanent and ongoing source of funding for Newman's philanthropic work. From the start, the Hollywood star donated all of the company's profits to charities. In 2005 Newman's private foundation was set up and now it distributes the money. \nThe model was a success for decades. Newman's Own is now a $500 million enterprise, executives say. Its pasta sauces are a staple on grocery store shelves across the country, from the original traditional marinara to the zesty Sockarooni. The company's lineup includes salad dressing, lemonade and pet food. \nThe company's profits have allowed the foundation to expand its footprint around the world. It donated more than $30 million to more than 600 charities last year, with much of its giving focused on improving nutrition, helping children with life-threatening diseases and supporting veterans. \n\"It's not a tax break,\" Forrester said. \"This is more more like clemency, if you will. It allows us to continue to be in business and pay our corporate taxes.\" \nBut the model broke down after Newman died nearly a decade ago. U.S. tax law prohibits private foundations from owning more than a 20 percent stake in a for-profit company after the founder's death. The penalty for not complying is a 200 percent fine on the value of any additional holdings. \n\"The call it a tax … but the intent is obvious,\" said Jeff Brown, head of government affairs for the foundation. \nThe 1969 law was designed to target tax avoidance, but Newman's Own executives say no one envisioned at the time that anyone would want to start a company that gave away all its money – until Paul Newman came along. \nSince then, his work has inspired other entrepreneurs to establish similar models. About two dozen smaller philanthropic businesses are working with Newman's Own to urge lawmakers to find a solution. Robert and Ann Sacks run Fetch Eyewear in Portland, Oregon, and donate the proceeds to their nonprofit animal shelter, Pixie Project. The couple has appealed to Ron Wyden , Democratic U.S. senator from Oregon. \n\"The spirit is the same,\" Ann Sacks said. \"That got us involved with the Newman's Foundation to change the private foundation tax law.\" \nThe company had a five-year grace period after Newman's death to comply with the law. Once that was over, executives requested and received an additional five-year extension to come up with a solution. \nNow, time is almost expired. The deadline is in November, and executives say they must make a decision on the fate of the company by the end of the first quarter to meet it. \nThe law does not allow any more extensions. \n\"The problem that we have, obviously, is we don't have a lot of time,\" Forrester said.", "external_links": [], "published": "2018-01-10T18:10:00.000+02:00", "crawled": "2018-01-10T18:36:17.025+02:00", "highlightTitle": ""}