{"organizations": [], "uuid": "237936eba2501fdfb382d84f4b39f2ba0d1d1811", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/25/reuters-america-insight-protein-plight-brazil-steals-u-s-soybean-share-in-china.html", "country": "US", "domain_rank": 767, "title": "INSIGHT-Protein plight: Brazil steals U.S. soybean share in China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T08:00:00.000+02:00", "replies_count": 0, "uuid": "237936eba2501fdfb382d84f4b39f2ba0d1d1811"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/reuters-america-insight-protein-plight-brazil-steals-u-s-soybean-share-in-china.html", "ord_in_thread": 0, "title": "INSIGHT-Protein plight: Brazil steals U.S. soybean share in China", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "general administration of customs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INSIGHT-Protein plight: Brazil steals U.S. soybean share in China Karl Plume Reuters SHARES \nCHICAGO, Jan 25 (Reuters) - U.S. soybean growers are losing market share in the all-important China market because the race to grow higher-yielding crops has robbed their most prized nutrient: protein. \nDeclining protein levels make soybeans less valuable to the $400 billion industry that produces feed for cattle, pigs, chickens and fish. And the problem is a key factor driving soybean buyers from the U.S. to Brazil, where warmer weather helps offset the impact of higher crop yields on protein levels. \nA decade ago, the United States supplied 38 percent of soybeans to China, the world's top importer, compared to 34 percent from Brazil. Now, Brazil supplies 57 percent of Chinese imports compared to 31 from the United States, according to China's General Administration of Customs. \nSoybeans are by far the most valuable U.S. agricultural export, with $22.8 billion in shipments in 2016. Declining protein levels and market share pose another vexing problem for soy farmers already reeling from a global grains glut and years of depressed prices. \nThe U.S. soybean industry also faces rising competition from a growing number of synthetic and organic alternative feeds that provide more protein for less money. \nThese are troubling trends for the $41 billion U.S. soybean sector, but the industry's response has yet to take on much urgency. That's because the erosion of protein levels has come over many years, and many industry players still have short-term economic incentives to prioritize higher yields over higher protein. \n(For graphic on soybean yield, protein content and market share, see: http://tmsnrt.rs/2CXgKQE) \nProtein levels have fallen as biotechnology and other breeding advances have pushed yield per acre to record highs, which dilutes protein content. But U.S. farmers can still make more money producing higher volumes of lower-protein crops because they only get an additional 3 to 5 cents a bushel for higher-protein beans. \nOver the long term, however, falling protein levels could have dire consequences for the U.S. industry as a whole - especially in China, which buys two-thirds of all soybeans traded in the world market to feed its vast livestock operations. \n\"China needs soybeans, and we're at risk of becoming a residual supplier if we don't work on protein improvements,\" said North Dakota farmer Jared Hagert, a director and past chairman of the United Soybean Board (USB), an industry association. \nHIGHER YIELDS, LOWER PROTEIN \nThe USB and other industry advocates are starting to take the protein problem seriously. The industry group will spend $5.6 million in fiscal year 2018 on research and other efforts to boost protein, up from $3.7 million last year. \nThey face a tough task. Like many farmers, the agribusiness giants that develop seed technology, such as Monsanto Co and DowDuPont Inc, have little incentive to focus on raising protein levels. \nSeed developers have had great success boosting yields through traditional breeding methods and genetic engineering to make crops use less water, tolerate weed killers and grow better in colder or drier climates. But they have yet to crack the genetic code that would raise protein content without hurting yield, seed breeders said. \nAt DowDuPont, scientists have identified some promising leads in boosting protein without hurting crop yields, said Steve Schnebly, senior research manager with the agriculture division of DowDuPont. But any commercially viable solution could be two decades away, he said, and isn't a company priority. \n\"Our major objective to our farmer customers is maximum yield,\" Schnebly said. \nMonsanto, the world's largest seed producer, currently has no genetic research projects focusing on elevating protein, spokeswoman Christi Dixon said in a written statement. \n\"Market potential and demand doesn't warrant the R&D investment,\" she said. \nThe protein decline coincides with a rise of cheaper and more abundant alternative feeds available to livestock and poultry producers. They include distillers grains, a byproduct of the ethanol production process, and synthetic amino acids that are mixed with corn to mimic soymeal. \nJeff Knott, a swine nutrition consultant and owner of Minnesota-based Ideal Animal Nutrition, creates recipes with such alternatives for hog feed used by producers in several Midwest states. \n\"Compared to 20 years ago, we're probably feeding 70 percent less soybean meal than we used to,\" he said. \"And it's all economically driven.\" \nLOWER PROTEIN, LOWER EXPORTS \nBrazilian soybean producers use the same genetically modified seeds as their U.S. counterparts, and have also seen a reduction in protein content. \nBut Brazilian growers retain an crucial edge in protein thanks to warmer weather and longer days. The nation's soybeans contain 37 percent protein on average, according to data from Embrapa, the government's agriculture research agency. \nThat compares to 34.1 percent for U.S. crops in 2017 - a record low, according to the U.S. Soybean Export Council. \nThe protein shortfall in this season's crop has prompted U.S. processors such as Bunge Ltd to cut the amount of protein they can guarantee in soymeal they sell. \nBrazil's three-percentage-point protein advantage is plenty enough to sway many buyers, especially when combined with the nation's recent efforts to expand production and reduce shipping delays. Since overtaking the United States as the world's top soybean exporter in 2013, Brazil has boosted production by about 40 percent. \nExpanded port capacity in northern Brazil and lower freight costs have widened the country's advantage in China, said a Brazilian trader with a large exporting company. \n\"Brazil's soybeans on average have less impurities and higher protein content,\" said the trader, who requested anonymity because he was not authorized to speak publicly. \"Some destinations will pay a premium for that.\" \nProtein is paramount for Chinese importers, two managers at soy crushing plants and one soy meal buyer at a pig producer told Reuters in interviews. \n\"Feed producers mainly consider the cost of the soy meal - the price, and the amount of protein it contains,\" said a swine feed buyer who asked not to be named because he was not authorized to speak. \"With more supplies from Brazil ... we don't necessarily need to buy beans from the U.S.\" \nSCRAMBLING FOR SOLUTIONS \nThe United Soybean Board has launched a pilot project at a small number of processors and grain elevators - facilities that store and load grain for shipping - to record and analyze the protein content of soybeans delivered by local farmers. \nThe effort aims to provide highly localized data in the hope that farmers will select seed varieties that produce higher-protein crops and that soybean buyers will pay them a premium. \nOther USB efforts include financing genetics research to boost protein, including studies by researchers at the University of Illinois and by scientists at DuPont Pioneer. \n\"We've got to be cognizant as to what kind of product we are providing the end user,\" said Hagert, the USB director. \nAnother study - conducted by the University of Wisconsin and paid for by the Illinois Soybean Association and the U.S. Soybean Export Council - suggests that farmers can better compete with synthetic alternatives by planting beans with a specific amino acid balance. \nSuch soybeans can save hog feeders up to $3 a head and save chicken producers 7 cents a bird, said the study's lead author, John Osthus. \n\"Right now, there are synthetic amino acid companies that are undermining U.S. market share,\" Osthus said. \"If we don't do something about this, we're missing a huge market opportunity.\" \n(Additional reporting by Ana Mano in Sao Paulo and Dominique Patton and Hallie Gu in Beijing; Editing by Simon Webb and Brian Thevenot)", "external_links": [], "published": "2018-01-25T08:00:00.000+02:00", "crawled": "2018-01-25T14:57:43.001+02:00", "highlightTitle": ""}