{"organizations": [], "uuid": "108a2d6038fc8e614239a1c8d3cf287c0a56ffc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/03/102236935-RTR3DAQF.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss", "section_title": "Finance", "url": "https://www.cnbc.com/2018/01/26/gunmaker-remington-turns-to-debt-restructuring-advisors-report.html", "country": "US", "domain_rank": 767, "title": "Gunmaker Remington turns to debt restructuring advisors: Report", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T20:14:00.000+02:00", "replies_count": 0, "uuid": "108a2d6038fc8e614239a1c8d3cf287c0a56ffc5"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/gunmaker-remington-turns-to-debt-restructuring-advisors-report.html", "ord_in_thread": 0, "title": "Gunmaker Remington turns to debt restructuring advisors: Report", "locations": [], "entities": {"persons": [{"name": "remington", "sentiment": "negative"}, {"name": "sandy hook", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "cape elizabeth", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "hour ago reuters joel page | reuters", "sentiment": "none"}, {"name": "spurwink rod", "sentiment": "none"}, {"name": "remington outdoor company", "sentiment": "none"}, {"name": "lazard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Guns and Weapons Gunmaker Remington turns to debt restructuring advisors: Report Remington Outdoor Company is working with investment bank Lazard on options to restructure its $950 million of debt. A combination of slow sales and the abandonment of some investors following the use of a Remington firearm in the Sandy Hook shooting have left the company in a weak position. Remington's capital structure is currently unsustainable. Published 1 Hour Ago Reuters Joel Page | Reuters A shooter takes aim with a Remington Model 700 SPS Varmint rifle at the Spurwink Rod and Gun Club in Cape Elizabeth, Maine. \nRemington Outdoor Company, one of the largest U.S. makers of firearms, is working with investment bank Lazard on options to restructure its $950 million debt pile, people familiar with the matter said on Friday. \nPrivately held Remington has faced doubts about its ability to refinance its debt next year amid sluggish sales. It was abandoned by some of its investors after one of its Bushmaster rifles was used in the Sandy Hook elementary school shooting in Connecticut in 2012 that killed 20 children and six adults. \n\"We are very concerned that Remington will be unable to refinance debt that comes due in April 2019 given its weak operating performance and high financial leverage,\" Kevin Cassidy, a Moody's Investors Service Inc analyst, wrote in a research note last month. \nRemington is working with Lazard to examine a range of options to boost its finances, and there is no certainty about which course of action the company will choose, the sources said, asking not to be identified because the matter is confidential. \nRemington did not respond to a request for comment, while its private equity owner, Cerberus Capital Management LP, and Lazard declined to comment. \nAfter the shooting, Cerberus tried unsuccessfully to sell Remington, then known as Freedom Group, after coming under pressure from some of its private equity fund investors. \nCerberus Chief Executive Stephen Feinberg also considered a bid for Remington to stoke interest in the gunmaker from other potential acquirers, Reuters reported in 2012. In 2015, Cerberus offered a mechanism to its fund investors that wanted to drop Remington, such as the California State Teachers' Retirement System, to sell their stakes back to the company. \nThe families of the victims at Sandy Hook also sued Remington. That case is ongoing. \nRemington's capital structure is currently unsustainable given its weak operating performance, significant volatility in the demand for firearms and ammunition, and high debt load, according to Moody's. \nThe armsmaker's sales have declined in part because of receding fears that guns will become more heavily regulated by the U.S. government, according to credit ratings agencies. President Donald Trump has said he will \"never, ever infringe on the right of the people to keep and bear arms.\" \nThe Madison, North Carolina-based gun manufacturer faces a maturity of an approximately $550 million term loan in 2019. Remington also has $250 million of bonds that come due in 2020, and are trading at a significant discount to their face value at 22 cents on the dollar, according to Thomson Reuters data, indicating investor concerns about repayment. \nThe term loan maturing next year is also trading at a significant discount to full value, at around 55 cents on the dollar, the sources said. \nPotential reputational risk associated with owning Remington could also complicate the company's negotiations with its creditors, because in a debt restructuring companies often offer equity as an incentive for debt forgiveness, the sources said. Remington's creditors include Franklin Templeton Investments, according to regulatory filings from late last year. They did not immediately respond to requests for comment. \nRemington's sales plunged 27 percent in the first nine months of 2017, resulting in a $28 million operating loss. \nColt's Manufacturing Co LLC, a competitor of Remington, emerged from bankruptcy in 2016 following falling sales of its sports rifles and the loss of military contracts. Related Securities", "external_links": [], "published": "2018-01-26T20:14:00.000+02:00", "crawled": "2018-01-26T22:11:37.007+02:00", "highlightTitle": ""}