{"organizations": [], "uuid": "f4685909494c2c6a28ab7078f9df5140c2ebc25d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950764-38811751555_81b6529dd8_or.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/coming-to-a-grocery-store-near-you-self-driving-carts-smart-shelves.html", "country": "US", "domain_rank": 767, "title": "Coming to a grocery store near you: Self-driving shopping carts and smart shelves", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T20:23:00.000+02:00", "replies_count": 0, "uuid": "f4685909494c2c6a28ab7078f9df5140c2ebc25d"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/coming-to-a-grocery-store-near-you-self-driving-carts-smart-shelves.html", "ord_in_thread": 0, "title": "Coming to a grocery store near you: Self-driving shopping carts and smart shelves", "locations": [], "entities": {"persons": [{"name": "mike mcnamara", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "national retail federation", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "national reta", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. grocers are playing catch-up. \nHeld back by razor-thin profit margins, which have made investing difficult, grocery retailers lagged behind their peers in Europe and parts of Asia in making strides with technology that reduces the time shoppers spend navigating aisles, ringing up purchase and bagging items. \nThen Amazon showed up and acquired Whole Foods. Now, there's more pressure to roll out projects that may have been in a pilot phase — or try new things entirely. \n\"The technology is more mature now, and these things are becoming easier to do,\" Mike McNamara, the executive vice president, chief information and digital officer for Target , told CNBC. \nHe said retailers have complained that the technology for such innovations as speeding up checkout has been bulky and visually unpleasant. \"You have to design something that's practical,\" he said.\nThe future of America's grocery stores will include more scanning devices, smart shelves with digital displays and self-driving shopping carts. The Innovation Lab at The National Retail Federation's Big Show this year featured a slew of companies showing off their ideas that would revamp the grocery shopping experience. \nStart-up SwiftGo was previewing a device to weigh an item as it's placed into a cart, ensuring everything is accounted for as a shopper scans food and drinks, and checks out from a mobile app. As more companies look to add \"scan and go\" options inside their stores, theft remains a major issue of concern, but weight scales in carts offer one way to mitigate that challenge. SwiftGo had also added red lights to grocery carts that would light up to notify employees when it appeared a customer hadn't scanned an item to pay for it. \n\nFocal Systems showed off grocery carts equipped with a tablet to help a shopper navigate the store, locate relevant promotional offers, and automatically pay without a cashier. Anheuser-Busch InBev and other food brands are also working with Focal Systems to monitor out-of-stock items, by accessing the images taken from cameras on the sides of shopping carts. \nTarget's partnership with Zebra , which sells scanning devices and label printers, among other items, was highlighted at the Big Show. The big-box retailer is also working with payment platform Verifone , which can help a retailer \"save the sale\" on the floor of a store with portable credit card readers. \n\"All around the world people want to save money and they want to save time,\" Walmart CEO Doug McMillon said during a keynote speech at the event. \"We want to foster a culture that supports change and helps us go along the journey we're all on, which will lead to even more change in the future.\" \nSource: Walmart Walmart's scan and go technology. Walmart and Kroger are some of the biggest names currently testing some variation of a \"scan and go\" option for shoppers, with plans to roll out that technology to 500 additional stores combined in 2018. \nMeanwhile, Kroger (which owns Harris Teeter, Fred Meyer and Roundy's) is in the midst of rolling out Kroger Edge, a new shelving system for its grocery stores. The company is planing to outfit hundreds of stores with digital screens that will be able to instantly update an item's price or feature other information. Eventually, the technology will link to shoppers' phones to help them navigate the store. \nThen, just this week it was announced that New York-based Fairway Market chose FutureProof Retail, a line-free checkout provider, to power its mobile app, which will allow shoppers to scan and pay for groceries on their phones, the company said. \nBuilding on this trend, more companies and namely grocery chains will be piloting similar technology in 2018. \nWalmart's Lori Flees, who serves as the senior vice president of the company's Store No. 8 incubator group, said the company will make a bigger push in grocery and fresh food this year, with automation and personalization in mind. \nAs options like buy online, pick up in store become more popular for grocery shopping, technology goes hand-in-hand with that, she said, and will start to roll out on a grander scale across the country.", "external_links": [], "published": "2018-01-17T20:23:00.000+02:00", "crawled": "2018-01-17T20:35:20.003+02:00", "highlightTitle": ""}