{"organizations": [], "uuid": "9717b771cb944ceb8f120898d288804bf9251dae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938944-Gitanjali_Rao_Winner_2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/this-12-year-old-won-25000-for-a-gadget-that-helps-detect-lead.html", "country": "US", "domain_rank": 767, "title": "This 12-year-old won $25,000 for an invention that helps detect lead in water", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T20:07:00.000+02:00", "replies_count": 0, "uuid": "9717b771cb944ceb8f120898d288804bf9251dae"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/this-12-year-old-won-25000-for-a-gadget-that-helps-detect-lead.html", "ord_in_thread": 0, "title": "This 12-year-old won $25,000 for an invention that helps detect lead in water", "locations": [], "entities": {"persons": [{"name": "gitanjali rao", "sentiment": "negative"}, {"name": "rao", "sentiment": "none"}, {"name": "andy king", "sentiment": "none"}], "locations": [{"name": "flint", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:15 SHARES \nTwelve-year-old scientist Gitanjali Rao has been inventing since she was in kindergarten. Rao says that she has more than eight inventions, but it was Tethys — a 3D printed device that harnesses carbon nanotubes and a mobile app to test water for lead contamination in as little as 10 seconds — that won her the title of America's Top Young Scientist, and $25,000. \nRao says she was inspired to begin work on Tethys when she learned about communities in Michigan dealing with the devastating effects of lead-contaminated water. \n\"I was originally inspired by the Flint water crisis,\" she tells CNBC Make It . After talking about the issue with her family, Rao put herself in the shoes of those who were affected by contaminated water. \"I was thinking about how they felt when they actually found out that there was lead in their water — that would be a really scary thought.\" Andy King, courtesy of Discovery Education Gitanjali Rao \nShe considered the seriously troubling side effect of lead exposure, including rashes, headaches, nausea, seizures, and even death, and set out to use her inventing experience to try help. \n\"It started with like a way to remove lead from water, and then I realized that that's a step too far and I need to take it back and think about the detection before the prevention,\" says Rao. \nAfter researching water quality detection techniques, the precocious pre-teen found that she would need some hard-to-find supplies, including carbon nanotubes, chloride and lead acetate. Fortunately, Rao's parents lent a helping hand. \n\"My parents mostly helped me with like transportation to get lead, to get carbon nanotubes,\" she says. \"They were just overall really supportive of the choice that I made to solve this big problem. My parents like me to think outside the box, in that they want me to be aware of the world's situations that are going on.\" Andy King, courtesy of Discovery Education Tethys \nShe submitted a video application to the Discovery Education 3M Young Scientist Challenge and was selected as one of the 10 finalists. After months of perfecting her theoretical concept and her physical prototype, Rao traveled with her parents to the 3M headquarters in Minnesota and gave a five-minute speech in front a panel of judges, followed by a five-minute question and answer session. \nBrian Barnhart, a school superintendent and one of the judges, told ABC , \"It's not hyperbole to say she really blew us out of the water.\" Rao was named America's Top Young Scientist and handed a check for $25,000. \nScience is not Rao's only passion. \"I actually love business,\" she says. \"I like inventing, I like researching but I also like marketing.\" She's developing a business model that she hopes will make Tethys financially accessible for all families. \n\"I would like to make it commercially available, after performing last-minute tests, so that it is in everybody's hands, because I think it's important to test our water,\" she says. \"Currently, the device costs $20, but when it's manufactured in bulk, it will cost significantly less.\" show chapters 5:32 PM ET Thu, 13 Oct 2016 | 01:15 \nNow that Rao has some prize money in her pocket, she plans to invest in her business, her community and her education. \n\"With most of it, I plan to continue evolving my device, like manufacturing chemically doped carbon nanotubes and again performing more false/positive tests,\" says Rao. \"And with the rest of it, I plan to give back to the organizations that I volunteer for, such as Children's Kindness Network, and I would also love to put some of it into college funds.\" \n\"When I grew up I want to be an epidemiologist or a geneticist,\" she says. In the meantime, Rao finds joy and pride in being an inventor — and is keeping busy in seventh grade. \n\"I think that being an inventor-slash-scientist is pretty much like a superhero,\" she says. \"What do superheroes do? They save the world. They save lives. And what do scientists do? They could potentially save the world, they could potentially save lives. So we are pretty much superheroes.\" ", "external_links": [], "published": "2018-01-10T20:07:00.000+02:00", "crawled": "2018-01-10T20:27:52.134+02:00", "highlightTitle": ""}