{"organizations": [], "uuid": "4b127ca2255ea52f6ded0fb5a962cbed382e93ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://richinwriters.com/feed", "section_title": "RichInWriters.com", "url": "https://www.cnbc.com/2018/01/03/richard-branson-how-to-come-up-with-a-successful-business-idea.html", "country": "US", "domain_rank": 767, "title": "Richard Branson’s simple trick to come up with an idea for a successful business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T18:22:00.000+02:00", "replies_count": 0, "uuid": "4b127ca2255ea52f6ded0fb5a962cbed382e93ab"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/03/richard-branson-how-to-come-up-with-a-successful-business-idea.html", "ord_in_thread": 0, "title": "Richard Branson’s simple trick to come up with an idea for a successful business", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "neutral"}, {"name": "branson", "sentiment": "none"}], "locations": [{"name": "virgin atlantic", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "virgin group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to become your own boss in 2018, coming up with a business idea is the first step. If that feels daunting, billionaire serial entrepreneur Richard Branson has advice: Start by asking yourself what you could do to make your own life better or easier.\n\"Entrepreneurship in its truest form is about identifying a gap in the market and creating a product of use to fill that hole and make people's lives better,\" writes Branson in a blog post on Tuesday .\n\"Often the best way to find this gap is to look around you — are there services that could be improved or a product that could make something easier?\" says Branson, who is currently worth more than $5 billion, according to Forbes .\nYou can start by solving a small problem — it doesn't mean the business itself will be limited.\nTweet: It's never been a better time to be an entrepreneur - opportunities are getting bigger as the world is getting smaller\n\"My advice to aspiring entrepreneurs thinking of starting their own business is: start small but always think big,\" says Branson. \"Technology also has allowed companies to think bigger than just selling to their local community and puts the world at their fingertips,\" Branson says.\nBranson follows his own advice: He himself is very active on social media. Branson has 12 million followers on Twitter, for example.\n\"I've always been one to put myself out there in order to drive awareness for Virgin and with the rise of social media it has never been easier.\"\nBut you have to have specific awareness of who you are selling to and what want: \"There is never a one-size-fits-all answer to business and being flexible and adaptable is a key skill needed for success,\" Branson says.\nshow chapters Richard Branson: What I learned when Coke ran me out of business 1:01 PM ET Tue, 7 Feb 2017 | 01:07 \"In order to succeed in many different regions and across cultures, we have to vary the business model and mould it to fit. For example Virgin Active has many different health clubs around the world, but they vary in sutble ways in Johannesburg compared to London. The products that work for Virgin Money customers in Australia are going to be different to the ones customers want in South Africa. Even starting three airlines — Virgin Atlantic , Australia and America — required different touches depending on where they were based and flying to.\"\nCurrently, Branson's Virgin Group includes 60 businesses with 69,000 employees who serve 53 million customers across the globe.\nHe encourages others to become entrepreneurs. \"[They] are the lifeblood of the economy that drive innovation, create jobs and push humanity forward,\" says Branson. \"It's never been a better time to be an entrepreneur — opportunities are getting bigger as the world is getting smaller.\"\nSee also:\nThis is what motivates billionaire Richard Branson (Hint: It's not money)\nBillionaire Richard Branson weighs in on free cash handouts—there's a 'real danger' tech will replace jobs\nIf billionaire Richard Branson were 20 again, here's what he would do\nshow chapters Billionaire Richard Branson says he's never been motivated by money — here's why 3:02 PM ET Wed, 18 Oct 2017 | 01:16 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-03T18:22:00.000+02:00", "crawled": "2018-01-03T18:37:07.029+02:00", "highlightTitle": ""}