{"organizations": [], "uuid": "3f5f70c66dbfc3aef89766120bd60740e39fc64e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/01/103835271-AX0A0251.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/cramers-game-plan-jp-morgan-set-the-benchmark-now-watch-the-banks.html", "country": "US", "domain_rank": 767, "title": "Cramer's game plan: JP Morgan set the benchmark. Now watch the banks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-13T01:13:00.000+02:00", "replies_count": 0, "uuid": "3f5f70c66dbfc3aef89766120bd60740e39fc64e"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/cramers-game-plan-jp-morgan-set-the-benchmark-now-watch-the-banks.html", "ord_in_thread": 0, "title": "Cramer's game plan: JP Morgan set the benchmark. Now watch the banks", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "mad money", "sentiment": "negative"}, {"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "jp morgan", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After hours of marveling at the tape's incessant march higher, CNBC's Jim Cramer took a step back to check the market layout.\n\"What's driving it? ... Same as always: [a] stock shortage — it's really been acute in the industrials — 401(k) money being thrown at the market, animal spirits, a stronger consumer, tax reform, deregulation and a general revaluation higher,\" the \" Mad Money \" host said. \"Who's doing the leading? Once again, it's Boeing , it's Caterpillar , it's Adobe , it's Alphabet , it's Apple , and it's Netflix .\"\nCertainly, the layout can change. On Friday, shares of frequent market leader Facebook were taken down after CEO Mark Zuckerberg said he wanted to change its News Feed to promote \"meaningful social interactions.\"\nBut Facebook's 4 percent decline failed to jolt the broader market. Instead, a strong earnings report from J.P. Morgan propelled its stock and the market to new highs , erasing worries that one-time charges would make the numbers look worse than expected.\n\"J.P. Morgan's a terrific place to actually start the discussion for next week's game plan because it did set a benchmark that other banks, which all report next week, I think are going to find hard to beat,\" Cramer said.\nWith that in mind, the \"Mad Money\" host turned to the stocks and events he'll be watching next week:\nTuesday: Citigroup, UnitedHealth, CSX Citigroup : Citigroup's chief financial officer said in December that the bank could take a $20 billion hit because of the newly passed tax law , which could weigh on its Tuesday morning earnings report.\n\"I believe its buyback has been so aggressive that the company will actually still end up showing some excellent earnings growth, even as it's clear from J.P. Morgan's numbers that fixed income trading — a big revenue generator for both J.P. Morgan and Citi — was much worse than even thought,\" Cramer said. \"Citi will be hard-pressed to top J.P. Morgan, but it's no slouch.\"\nUnitedHealth : Cramer expected \"still one more blowout quarter\" from the massive health insurer, packed with insight from its rapidly growing data-driven business.\nCSX : Railroad operator CSX will report its earnings after the bell. Shares of the transport play have recovered bountifully since its late CEO Hunter Harrison passed away in December, but Cramer wasn't sold on the stock.\n\"If the rails have a weak link, it will be CSX because it has run so much,\" he said.\nWednesday: Bank of America, Goldman Sachs, ASML Holdings Bank of America : Bank of America may not have J.P. Morgan's global \"tentacles,\" but with the largest deposit base in the United States, it's the top beneficiary of rising interest rates , Cramer said ahead of its Wednesday earnings report.\nGoldman Sachs : Cramer was hopeful that Goldman would find a way to deliver a positive earnings report despite lower than expected trading volumes in the fourth quarter.\n\"It's a much more trading-oriented investment bank, and lately, the markets have lacked the kind of volatility that translates into terrific profits,\" he said. \"I'm more concerned here, though, that [CEO] Lloyd Blankfein , who's steered the bank through the hardest of times, may decide to hang up his spurs and devote the rest of his life to charity, which would be par for this incredibly good man's course. I say, not yet, please.\"\nASML : Cramer wanted this oft-overlooked semiconductor equipment maker's earnings report to give investors more details on whether there's too much new semiconductor capacity on the market.\n\"If we hear that orders are through the roof from this equipment maker or that anyone's canceling them because they've been through the roof, I could see the commodity chipmakers like Micron disappointing with some weak stock action,\" he said.\nThursday: Morgan Stanley, PPG Industries, IBM Morgan Stanley : Cramer didn't envy Morgan Stanley CEO James Gorman for having to report earnings after the rest of the big banks set the bar.\n\"I think [the results will] be excellent. But by this point, will anybody really care?\" Cramer wondered. \"Aren't we more likely to see a wave of profit-taking once all the big banks have reported? You know what, that's actually a reasonable bet. Let's keep our eyes open.\"\nPPG : Industrial coatings maker PPG will report earnings before Thursday's bell, and Cramer expected a good report.\n\"I also think [PPG] could be on the verge of a value-enhancing merger,\" the \"Mad Money\" host said. \"If I owned it, I would certainly stay long. If it gets weak earlier this week, I would buy it.\"\nIBM : Cramer advised investors to listen to IBM's conference call, led by CFO Martin Schroeter, before reacting to the computer giant's after-the-bell earnings report.\n\"[The headline numbers] can often be hard to understand until Schroeter explains them,\" he said. \"[IBM] just started a new mainframe cycle and that, historically, has been good news for the company. Plus, Warren Buffett seems to have stopped selling shares, thank heavens, and that's good news for the stock.\"\nFriday: Schlumberger Oilfield service company Schlumberger will report earnings on Friday coupled with one of Cramer's favorite conference calls in the industry.\nSince Schlumberger CEO Paal Kibsgaard called oil's bottom last quarter, the price of crude has rocketed to multi-year highs , so Cramer was eager to hear his insights.\nFinal thoughts \"Here's the bottom line: you have to respect the fact that we're in a once-in-a-lifetime move where even when a mega-cap stock like Facebook gets slammed, it has no pin action whatsoever on the rest of the market,\" Cramer said. \"You know what we've got here, don't you? We've got a beast. Still, on Tuesday, the beast is going to come in real hungry after a couple days off. I bet it gets fed once again.\"\nWATCH: Cramer's finance-filled game plan show chapters Cramer's game plan: JP Morgan set the benchmark. Now watch the banks 21 Hours Ago | 14:13 Disclosure: Cramer's charitable trust owns shares of Apple, Alphabet, Facebook, J.P. Morgan, Citigroup and Schlumberger.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-13T01:13:00.000+02:00", "crawled": "2018-01-13T01:50:27.037+02:00", "highlightTitle": ""}