{"organizations": [], "uuid": "b04baab6ab4e5e12e89e045118da034eafd5056f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220595722&w=1200&r=LYNXMPEE0817E", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-tech-ces-ford/ford-wants-to-wire-cities-to-ease-congestion-idUSKBN1EY24B", "country": "US", "domain_rank": 408, "title": "Ford wants to wire cities to ease congestion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T19:40:00.000+02:00", "replies_count": 0, "uuid": "b04baab6ab4e5e12e89e045118da034eafd5056f"}, "author": "", "url": "https://www.reuters.com/article/us-tech-ces-ford/ford-wants-to-wire-cities-to-ease-congestion-idUSKBN1EY24B", "ord_in_thread": 0, "title": "Ford wants to wire cities to ease congestion", "locations": [], "entities": {"persons": [{"name": "josep", "sentiment": "neutral"}, {"name": "rich strader", "sentiment": "none"}, {"name": "madra", "sentiment": "none"}, {"name": "marcy klevorn", "sentiment": "none"}, {"name": "klevorn", "sentiment": "none"}, {"name": "jim hackett", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "neutral"}, {"name": "mobility product solutions", "sentiment": "none"}, {"name": "min read  las vegas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}, {"name": "alexandria sage", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS (Reuters) - Ford Motor Co ( F.N ) plans to offer cities networks and technology to smooth the flow of goods and people as ride hailing and automated delivery services are making congestion worse, the U.S. automaker’s top executives said on Tuesday.\nIn addresses at the CES technology show here, Chief Executive Jim Hackett and Marcy Klevorn, executive vice president for mobility, said Ford wants to build a “transportation mobility cloud” and technology that would allow cities, fleet operators and others to use a shared platform to manage vehicles and connect people to different types of transportation.\n“Nobody else is talking about providing an open community like this for mobility,” Klevorn said. She asked CES attendees to work with Ford to develop systems to improve “transit choreography.”\nIn a blog post, Rich Strader, Ford’s vice president for Mobility Product Solutions, and Sunny Madra, CEO of Ford’s software partner, Autonomic, said the common technology platform could be used to build applications or run fleets of connected vehicles.\nSlideshow (6 Images) Cities could re-route traffic away from congested streets, or make sure that self-driving cars are not cruising around searching for passengers, exacerbating traffic jams, Strader and Madra wrote.\nRide services companies and advocates of self-driving vehicles have argued that the shift away from human-driven, personal vehicles would result in less congestion. Auto industry executives talk of a world with “zero congestion.”\nA study of New York City traffic released in December concluded that 59 percent more ride hailing cars and cabs were operating in the city center in 2017 than in 2013. One-third of those vehicles were empty, according to the report by consultant Bruce Schaller, a former New York City transportation official.\nNew York officials are weighing various proposals to counter the trend, including assessing fees on ride services companies.\nCities such as London are also considering or instituting new fees aimed at curbing traffic.\nReporting by Joe White; Editing by Richard Chang\n ", "external_links": [], "published": "2018-01-09T19:40:00.000+02:00", "crawled": "2018-01-09T19:50:43.043+02:00", "highlightTitle": ""}