{"organizations": [], "uuid": "1557b6590816c164e993f391e0645d1c89f7dccd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968276-GettyImages-910117208.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/foreign-leaders-worried-about-ripple-effect-of-us-tax-code-overseas.html", "country": "US", "domain_rank": 767, "title": "Trump wants to talk taxes in Davos. But the rest of the world is less enthusiastic", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T21:23:00.000+02:00", "replies_count": 0, "uuid": "1557b6590816c164e993f391e0645d1c89f7dccd"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/foreign-leaders-worried-about-ripple-effect-of-us-tax-code-overseas.html", "ord_in_thread": 0, "title": "Trump wants to talk taxes in Davos. But the rest of the world is less enthusiastic", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "fabrice coffrini", "sentiment": "negative"}, {"name": "trump", "sentiment": "neutral"}, {"name": "scott morrison", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "bill morneau", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The overhaul of America's tax code is being met with consternation abroad, as foreign leaders face growing pressure to slash their own tax rates and warn that key provisions in the new U.S. law could violate international treaties.\nEurope's most powerful finance ministers have alerted Treasury Secretary Steven Mnuchin that they have \"significant concerns\" with the law and fear it could lead to distortions in trade and investment. In Australia, Treasurer Scott Morrison estimates that the reduction in the U.S. corporate tax rate could dampen his country's economic growth by 1 percent. Canada's finance minister acknowledged Wednesday that America's move is forcing officials to take a hard look at their own tax laws.\n\"We need to do our homework,\" Finance Minister Bill Morneau told reporters at the World Economic Forum in Switzerland. \"We are doing the analysis to look at ensuring that our situation for corporations continues to be competitive.\"\nThe simmering tension over taxes is just one of many potential flashpoints between world leaders and President Donald Trump as they convened Thursday in the snowy mountain resort of Davos for the annual gathering of the global elite. There are new U.S. tariffs on solar energy and washing machines , reports of disparaging comments about African nations and loose talk by Mnuchin about the strength of the dollar .\nBut Trump's main mission is to tout the benefits of the sweeping new tax plan on an international stage – the record highs of the stock markets, the steady drumbeat of big companies announcing employee bonuses and the billions of dollars in investment that Trump promises will return to America.\n\"The economy is doing very well,\" Trump told reporters Wednesday as he prepared for departure. \"I am going to Davos to get them to bring back a lot of money.\"\nThat is exactly what is making other countries worried.\nThe new law dramatically reduced the U.S. corporate tax rate from 35 percent to just 21 percent – from the highest statutory rates in the world to one of the lowest. France's rate is 34 percent. Japan, Mexico and Germany are at 30 percent. Norway's is 24 percent.\nSonja Gibbs, a senior director at the Institute of International Finance, said the salvo from the United States could set off a race to the bottom to cut tax taxes that ultimately leads to higher global debt and, potentially, market instability. Already, business groups in Canada are calling for their government to follow suit, and officials in China have announced measures to shore up their tax system.\n\"The concern is certainly very widespread,\" Gibbs said. \"I don't think there is a national capital anywhere in the world that isn't thinking about this right now.\"\nSpeaking in Davos on Thursday, Mnuchin pushed back against the notion that the United States had sparked a tax-cutting frenzy.\n\"We're not looking for a race to the bottom,\" he said. \"We restructured around having a system that encourages our companies to do business in tax havens that had very low rates. We've transformed the system away from that to encourage people to invest in the U.S., bring jobs to the U.S., and we couldn't be more pleased with that.\"\nConcerns beyond corporate tax cuts It's not only the corporate rate that concerns other countries, however. The new law also introduced a new and untested method for taxing foreign earnings of American companies that officials say might run afoul of agreements under the World Trade Organization.\nUnder America's old regime, foreign earnings were subject to the headline corporate tax rate of 35 percent – but only once it was brought back to the United States. That system resulted in a buildup of more than $2 trillion in deferred offshore earnings and encouraged complicated schemes, such as earnings stripping and inversions, to avoid paying U.S. taxes.\nThe new law institutes a one-time mandatory repatriation tax on that stockpile. In the future, overseas earnings generally will not be subject to U.S. tax – but with a significant exception. The law creates a new global minimum tax of 10.5 percent on earnings above so-called \"routine profits,\" which are defined as 10 percent of a company's tangible assets. The provision is intended to target industries such as tech and pharmaceuticals that can easily shift income to minimize their tax burden.\nIn addition, new rules aimed at protecting America's tax base impose a minimum 10 percent tax on income that U.S. companies earn from doing business with foreign firms. The move is supposed to prevent foreign multinationals from claiming large deductions for products manufactured or consumed in America and then booking the profits overseas.\nPossible retaliation But analysts say the system is overly complicated and has not been vetted in the real world. As Congress scrambled to produce a bill in the final weeks of 2017, lawmakers left many of the thorny implementation questions to Treasury to sort out – a process that could take years.\n\"If it turns out this law is written in a way that actually has real teeth and for that reason ends up discriminating against foreign investors, you could very well see this being added to the WTO or other international forum,\" said Jacob Funk Kirkegaard, a senior fellow at the Peterson Institute for International Economics.\nIn December, finance ministers from Germany, France, the United Kingdom, Spain and Italy sent a letter to Mnuchin, congressional leadership and top White House officials warning that the measure \"would impact on genuine commercial arrangements which pose minimal risk to the U.S. tax base.\"\n\"We also see the possibility that some of the proposed measures could constitute unfair trade practice and may discourage non-U.S. financial institutions from operating in the U.S.,\" the letter read.\nThe European Commission followed up with a similar letter to Mnuchin a day later. A person familiar with the exchange said the EC has not yet received a reply. A commission representative said it \"will reflect on all possible measures that may need to be taken if the bill enters into force as agreed.\"\n\"All options are on the table,\" she said.", "external_links": [], "published": "2018-01-25T21:23:00.000+02:00", "crawled": "2018-01-25T21:30:49.023+02:00", "highlightTitle": ""}