{"organizations": [], "uuid": "2dc4913391448d1c8527aea0bbcaca034b814aaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/02/102469561-GettyImages_460657582.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/31/why-nfl-players-and-other-athletes-are-going-vegan.html", "country": "US", "domain_rank": 767, "title": "NFL players' surprising new performance hack—going vegan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T18:19:00.000+02:00", "replies_count": 0, "uuid": "2dc4913391448d1c8527aea0bbcaca034b814aaf"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/why-nfl-players-and-other-athletes-are-going-vegan.html", "ord_in_thread": 0, "title": "NFL players' surprising new performance hack—going vegan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Tennessee Titans play the Jacksonville Jaguars in December 2014. SHARES \nWhen you think of what NFL players eat , you might imagine hulking athletes tearing into juicy steaks and scarfing fattening food. Perhaps it's not so far from the truth: ESPN recently reported it takes nearly 600 pounds of beef to feed the Buffalo Bills for a week, and that's not even counting chicken (700 pounds) and fish. \nAnd who can forget that hot dog-and-Cheetos dinner Jacksonville Jaguars' Jalen Ramsey once tweeted? Tweet \nHowever, for an increasing number of players, that's changing. With quarterback Tom Brady headed to his eighth Super Bowl with the New England Patriots on Sunday, others in the league have taken notice of his healthy habits. As the Boston Globe points out : \"It's a movement being led by Tom Brady, who dominated the league in his late 30s and is still going strong at 40, thanks to his vegetable-based diet and flexibility training over muscle mass.\" Getty Images | Kevin C. Cox Tom Brady \nAnd now, there's a new performance hack taking hold in the NFL — going vegan. Brady himself teamed up with vegan meal delivery service Purple Carrot to create a meatless, dairy-free TB12 performance meal plan in 2016. (Though not vegan, his personal diet is reportedly 80 percent plant-based .) And this season, the Tennessee Titans had a reported 11 team members go vegan (\"with varying levels of commitment,\" according to ESPN ). The team made it all the way to the playoffs for the first time in a decade, reports SI.com . \nLinebacker Derrick Morgan went vegan nearly a year ago. Defensive tackle Jurrell Casey and defensive lineman DaQuan Jones took the leap too. But linebacker Wesley Woodyard needed a little more convincing. \n\"Y'all crazy with this vegan thing,\" was Woodyard's initial reaction, reports ESPN . \"I'm from LaGrange, Georgia. I'm going to eat my pork.\" \nBut soon he was convinced, and better for it. \"My energy level's gone up,\" Woodyard, recently told the Associated Press . \"And it's just putting in good fuel to your body. And of course, it's always hard to keep weight on [during the season]. But it's worth it for me staying on top of my health.\" \nThe Titans players are convinced a plant-based diet \"helps them lose weight, recover faster and, believe it or not, play better,\" according to ESPN . \nOther professional athletes have made the switch to vegan or vegetarian diets in the past year or so, too. The list includes NBA stars Damian Lillard, Kyrie Irving, Wilson Chandler, Al Jefferson, Garrett Temple, Enes Kanter JaVale McGee and Jahlil Okafor, according to Bleacher Report . \nVeganism has also been championed for years by tennis player Venus Williams and snowboarder Hannah Teter . The 300-pound vegan \nIn the NFL, former lineman David Carter was one of the first to go vegan in 2014 while he was still playing. Now, he's an advocate for plant-based diets, going by the nickname, The 300 lb. Vegan . Carter, 30, says the reason for his switch in diet stemmed from health concerns. \n\"I was young, 22, 23, dealing with old-man illnesses at a really young age,\" Carter tells CNBC Make It . \"I was playing a professional sport where you're supposed to be touted as one of the strongest guys, the world's top athletes and all this, but [I was] taking high blood pressure medication...painkillers, anti-inflammatories....a long list.\" \nCarter was also struggling with painful tendinitis. \n\"It was hard for me to do bench press, it was hard for me to do push-ups,\" Carter says. \"Even lifting my body out of the bathtub, it felt like someone was taking a knife to my elbows and twisting that knife around and it was excruciating pain.\" \nThe athlete was inspired to switch his diet after seeing the documentary, \"Forks Over Knives,\" which \"examines the profound claim that most, if not all, of the degenerative diseases that afflict us can be controlled or even reversed, by rejecting animal-based and processed-foods,\" according to its website . \n\"I was drinking a milkshake while I was watching the documentary and poured it out,\" Carter tells SI.com . \nThe film touched on the idea that body inflammation is linked to the consumption of animal products, and Carter says it \"completely changed\" how he thought about eating. \nBut even if you're not an athlete or dealing with disease, Carter says going vegan can help with \"just overall discomfort from eating unhealthy foods and the effect that has on your body,\" he says. \"[I]t's just a lot easier for you to function during work because your body is functioning better.\" How veganism can boost productivity \nCarter may be right. A study published in 2015 in the American Journal of Health Promotion found that a plant-based diet can boost physical health and emotional well-being, and revealed that an 18-week dietary intervention program boosted employee productivity. \nIn the study, researchers with the non-profit Physicians Committee for Responsible Medicine placed GEICO employees that had a BMI of 25 or above, or had been previously diagnosed with type 2 diabetes, on a low-fat, glycemic, high-fiber vegan diet. \nThe study found that participants experienced a boost in overall productivity and measurable improvements in anxiety, depression, fatigue and general health, based on their responses to a questionnaire. They opted for carbohydrate-rich foods like brown rice, steel cut oats and rye bread, which the study notes helps regulate serotonin levels in the brain. \n\"Depression is related to inflammation in the body and low levels of serotonin,\" one of the researchers of the study, Dr. Ulka Agarwal, writes in a blog post . \"Plant-based foods naturally lower inflammation in the body because they are naturally low in fat and high in antioxidants. High vegetable intake increases the amount of B vitamins in the diet, which have been found to affect mood.\" \nA similar study by the same author, Neal Barnard, published in the Annals of Nutrition & Metabolism in 2010, also linked work productivity to veganism, revealing similar results . The study found that a worksite vegan nutrition program can improve health-related quality of life and work productivity. Harnessing the power of a plant-based diet \nIf the idea of a strict vegan diet feels overwhelming, start small. \nMeatless Mondays have become increasingly popular. Some New York City schools have even implemented Meatless Monday initiatives, offering all-veggie menus on the first day of the school week. \nRestaurant chain TGI Friday's has also hopped on the plant-based bandwagon, and recently launched a new partnership with the Meatless Mondays campaign to promote its new vegan entree, Beyond Burger. \n\"Our research shows that choosing meatless options, even one day a week, can help make a difference in our personal health and the health of our planet,\" says Dana Smith, Meatless Monday campaign director. TWEET \nKarina Inkster, a vegan fitness and nutrition coach who has been vegan for 15 years, also recommends changing your diet in stages, starting with a shift in mindset. Focus on the over 350 vegan foods you are able to eat, instead of focusing on what you're cutting out. \n\"It works way better to think about the abundance of food you can eat,\" Inkster tells CNBC Make It. \"How many plant-based foods can you cram into your diet? Which then automatically crowds out the animal products, versus thinking about what you can't eat anymore.\" \nAnother trick? \n\"Veganize your meals by time of day,\" Inkster explains. \"So start just by veganizing your breakfast. What can you have instead of eggs? A tofu scramble that still has protein in it.\" If that doesn't sound appetizing, \"maybe oatmeal with nuts and seeds and fruit on it.\" \nThen, Inkster recommends moving on to packing vegan lunches for work and having vegan snacks available. Finally, try tackling dinner, which Inkster notes often takes the most work for people. \n\"Generally people want to create new habits as they go along,\" Inkster says. ", "external_links": [], "published": "2018-01-31T18:19:00.000+02:00", "crawled": "2018-01-31T18:41:11.005+02:00", "highlightTitle": ""}