{"organizations": [], "uuid": "b73072bd2b51322de8cb284dd39ca618a4334629", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Why Intel’s Stock Price Just Jumped 9% to Its Highest Price Since 2000 – Fortune", "url": "http://fortune.com/2018/01/26/intel-stock-price-meltdown-spectre/", "country": "US", "domain_rank": 1196, "title": "Why Intel’s Stock Price Just Jumped 9% to Its Highest Price Since 2000", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T17:21:00.000+02:00", "replies_count": 0, "uuid": "b73072bd2b51322de8cb284dd39ca618a4334629"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/26/intel-stock-price-meltdown-spectre/", "ord_in_thread": 0, "title": "Why Intel’s Stock Price Just Jumped 9% to Its Highest Price Since 2000", "locations": [], "entities": {"persons": [{"name": "brian krzanich", "sentiment": "none"}], "locations": [], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "none"}, {"name": "advanced micro devices", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 10:21 AM EST \nIntel was on a roll, powering past the competition to sell more chips for servers and data centers, until news of the Spectre and Meltdown security attacks surfaced earlier this month. \nThe weaknesses, which were seen as hurting Intel more than competitors Advanced Micro Devices and Nvidia , spooked investors. Intel’s stock price dropped rapidly from $46.85 on January 2, the day before the first security issues hit , to as low as $42.50 a week later, a 9% decline. \nThe stock had been recovering somewhat since then, but after a series of reassurances, promises and good results in Thursday’s fourth quarter earnings release , Wall Street says all is forgiven. Intel shares jumped as much as 9% to a high of $49.41 on Friday morning. That’s the highest price since before the Internet bubble popped back in 2000. The positive sentiments about future sales extended to Intel’s competitors, as shares of AMD (amd) gained 4% and Nvidia (nvda) rose 2%. \nThe first promise came right up front from Intel CEO Brian Krzanich on a call with analysts, as he assured investors that correcting the security flaws was a top priority. “Security has always been a priority for us and these events reinforce our continuous mission to develop the world’s most secured products,” he said. “This will be an ongoing journey, but we’re committed to the task and I’m confident we’re up to the challenge.” \nIntel has had mixed success addressing the security issues so far, with some patches slowing performance and another that had to be withdrawn after causing PC crashes. But critically for investors, Krzanich said the company hasn’t seen any impact on sales and wouldn’t be reducing its sales forecast as a result. “We had a forecast we checked in as we go through the first few weeks of the year and it hasn’t really changed that as we looked at it,” he told the analysts. Fixing the flaws won’t have a “material impact” on spending or product costs, either, he said. \nGet Data Sheet , Fortune’s technology newsletter. \nThe second helpful data point came as Intel explained how the recent corporate tax cuts would bolster its bottom line this year. Lower taxes will add 28 cents per share to Intel’s earnings in 2018, leading to $3.55 per share in adjusted profits CFO Bob Swan said. Revenue is forecast to grow 4% (excluding the divested McAfee unit) to $65 billion, he said. That will happen even as Intel’s PC chip business continues to shrink, but sales of chips for servers and data centers are expected to increase at a percentage rate in the “mid teens,” Swan said. \nThe good news prompted several analysts to raise their price targets on Intel (intc) . Stacy Rasgon at Bernstein Research, a noted bear on the stock, pushed his target up to $38 from $34. Morgan Stanley’s Joseph Moore, who also has been less-than-enthusiastic about Intel, hiked his target to $43 from $39. And Vijay Rakesh at Mizuho Securities, who actually recommends buying Intel shares, raised his target to $52 from $47. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T17:21:00.000+02:00", "crawled": "2018-01-26T17:25:37.009+02:00", "highlightTitle": ""}