{"organizations": [], "uuid": "7f81c9867df0c540f230961138baf548d0316332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/25/104240131-GettyImages-455494530.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/immigration-deal-needs-e-verify-to-really-work-commentary.html", "country": "US", "domain_rank": 767, "title": "An immigration deal in DC needs E-Verify to really work", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T22:20:00.000+02:00", "replies_count": 0, "uuid": "7f81c9867df0c540f230961138baf548d0316332"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/immigration-deal-needs-e-verify-to-really-work-commentary.html", "ord_in_thread": 0, "title": "An immigration deal in DC needs E-Verify to really work", "locations": [], "entities": {"persons": [{"name": "charles ommanney", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jeff flake", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}, {"name": "arizona republic", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "numbersusa", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "sunland park", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "diversity visa lottery", "sentiment": "none"}, {"name": "gang of six", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A ray of hope is emerging in the D.C. immigration battles.\nFirst, the Arizona Republic newspaper says the so-called \"Gang of Six\" senators led by Arizona Republican Jeff Flake have made a new immigration deal offer that includes eliminating the Diversity Visa Lottery program and allocating $18 billion in additional border security with an immediate $1.6 billion in funding for the new border wall.\nThat's closer to a deal President Donald Trump could and should sign.\nThe second ray of hope comes from an unexpected source. The usually 100 percent anti-amnesty NumbersUSA organization announced support for the most of the details in the new Gang of Six offer provided it adds a provision to make E-Verify mandatory for all U.S. employers .\nE-Verify is the federal database that allows employers to check and confirm the status of potential employees. It's also the one thing that would make winners of not just the \"Dreamer\" children of illegal immigrants, but Democrats, congressional Republicans, and the White House too.\nHere's how:\nFirst off, the American people support the idea. An ABC News Washington Post poll showed that 79 percent of respondents support requiring employers to verify immigration status. But as of now, the Society for Human Resource Management says fewer than 10 percent of U.S. employers are using the E-Verify system. So, this is something where a noticeable difference can be made in a hurry.\nDreamers will win with E-Verify because it will provide the most economically tangible benefit of their hard-won legal status.\nRepublicans win with E-Verify as it gives them cover for approving amnesty for the Dreamers with the hard right base. If NumbersUSA is okay with it, it's not likely any significant numbers of GOP voters will object.\nAvoiding any pushback for helping the Dreamers is a big plus for the Republicans as they need to heed poll after poll that shows strong support for those children and young adults. The added plus for the GOP is that pushing for E-Verify will prove they're not the slaves of their service industry corporate donors. Left-leaning critics have long criticized the GOP for allegedly helping big business use illegal immigration to keep wages low.\nOf course, the harder case to make is proving that backing E-Verify is a good move for the Democrats. Here are two key reasons it is.\nFirst, it would be one of the first things Democrats have done to show they're actually learning a valuable lesson from the 2016 election results. The fact is, a crucial part of their voting base likely supports E-Verify and all the ideas behind it. Rank-and-file union members have long suspected that illegal immigrants hurt their wages and employment prospects.\nThat suspicion is a key reason why Trump did so well among those rank-and-file union voters in 2016. Union leadership may not officially support E-Verify, but even AFL-CIO chief Richard Trumka praised President Trump last year for mentioning the effect illegal immigration has on wages.\nIf the Democrats want to win back those union voters, supporting E-Verify is a great way to do it. The party can continue to waste time trying to blame Hillary Clinton 's loss on Russian collusion, but they lost to Trump in 2016 mostly because they failed to win blue collar union states such as Michigan, Pennsylvania, and Wisconsin. Backing E-Verify is a way to get them back.\nSecond, the Democrats also have polls to worry about that make supporting E-Verify a good move. It's true most voters support the Dreamers and generally don't like the idea of mass deportations, but it's also true that voters support the rule of law. A recent survey that shows that 80 percent of voters oppose the idea of sanctuary cities proves that point. Democrats ignore that sentiment to their great peril.\nMost importantly, E-Verify gives us the lowest cost tool to reduce illegal border crossings in the first place. That's because the lure of potential jobs is just as much of an incentive to cross the border as lax security.\nWe learned that when illegal immigration fell off significantly in the Great Recession years of 2007 to 2009. By contrast, the noticeable uptick in the U.S. economy this year has actually encouraged a spike in illegal southern border crossing that began this summer and is continuing even now.\nWe can keep spending billions on new border walls, ICE raids, and detention centers. Or we can implement a popular program like E-Verify and get the same results at a small fraction of the cost.\nIt's not often that a far-right or far-left group adds any real hope to a policy debate in Washington. But the push for E-Verify is a win/win/win for the left, right, and everyone in between.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-17T22:20:00.000+02:00", "crawled": "2018-01-17T22:50:49.003+02:00", "highlightTitle": ""}