{"organizations": [], "uuid": "98e999af098cc5d82a9e13a02e73216f58f24724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104878016-GettyImages-474801438-costco.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/us-retail-sales-rise-while-core-sales-are-revised-sharply-higher.html", "country": "US", "domain_rank": 767, "title": "US retail sales rise, while core sales are revised sharply higher", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T15:32:00.000+02:00", "replies_count": 0, "uuid": "98e999af098cc5d82a9e13a02e73216f58f24724"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/us-retail-sales-rise-while-core-sales-are-revised-sharply-higher.html", "ord_in_thread": 0, "title": "US retail sales rise, while core sales are revised sharply higher", "locations": [], "entities": {"persons": [{"name": "daniel acker", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "east peoria", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "costco wholesale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. retail sales increased in December as households bought a range of goods and figures for the prior month were revised higher, suggesting the economy exited 2017 with strong momentum.\nThe Commerce Department said on Friday that retail sales rose 0.4 percent last month. Data for November was revised to show sales gaining 0.9 percent instead of the previously reported 0.8 percent increase.\nRetail sales in December rose 5.4 percent from a year ago.\nThey advanced 4.2 percent in 2017 compared to 3.2 percent in 2016. Economists polled by Reuters had forecast retail sales increasing 0.4 percent in December.\nSales last month were supported by a 1.2 percent jump in receipts at gardening and building material stores. Sales at auto dealerships rose 0.2 percent. Sales at service stations were unchanged last month.\nExcluding automobiles, gasoline, building materials and food services, retail sales increased 0.3 percent last month after an upwardly revised 1.4 percent surge in November. These so-called core retail sales correspond most closely with the consumer spending component of gross domestic product . They were previously reported to have increased 0.8 percent in November.\nLast month's increase in retail sales and the sharp upward revision to November data bolsters economists' expectations of an acceleration in consumer spending in the fourth quarter. Consumer spending, which accounts for more than two-thirds of U.S. economic activity, increased at a 2.2 percent annualized rate in the third quarter.\nThe economy grew at a 3.2 percent pace during that period. Spending could get a modest lift from a $1.5 trillion package of tax cuts passed by the Republican-controlled U.S. Congress and signed into law by President Donald Trump last month.\nThe bulk of the tax relief is skewed toward high-income households, who economists say have a low propensity to consume.\nLast month, sales at electronics and appliance stores fell 0.2 percent. Receipts at clothing stores declined 0.3 percent. Sales at online retailers soared 1.2 percent.\nReceipts at restaurants and bars rose 0.7 percent, the biggest gain since January. Sales at sporting goods and hobby stores dropped 1.6 percent, the biggest decline since November 2016.", "external_links": [], "published": "2018-01-12T15:32:00.000+02:00", "crawled": "2018-01-12T15:38:44.004+02:00", "highlightTitle": ""}