{"organizations": [], "uuid": "c11e2197899144e6ddfc1d43618628029348790e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/07/21/101853172-Satya-Nadella.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/microsoft-says-meltdown-and-spectre-fixes-will-slow-some-pcs-down-significantly.html", "country": "US", "domain_rank": 767, "title": "Microsoft says Meltdown and Spectre fixes will slow some PCs down significantly", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T19:01:00.000+02:00", "replies_count": 0, "uuid": "c11e2197899144e6ddfc1d43618628029348790e"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/microsoft-says-meltdown-and-spectre-fixes-will-slow-some-pcs-down-significantly.html", "ord_in_thread": 0, "title": "Microsoft says Meltdown and Spectre fixes will slow some PCs down significantly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "microsoft", "sentiment": "negative"}, {"name": "getty images  microsoft", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech Guide Microsoft says Meltdown and Spectre fixes will slow some PCs down significantly Microsoft said most Windows 7 and Windows 8 users relying on older chips will notice the performance impact of updates to protect against Meltdown and Spectre. The company also said Windows Server performance will be degraded if customers choose to install updates that are meant to protect against untrusted code. SHARES Getty Images \nMicrosoft on Tuesday provided new details on the performance impact of updates to protect against recently disclosed security vulnerabilities. In certain cases, performance on Windows will be significantly slowed by patches for the Meltdown and Spectre vulnerabilities . \nSome people have found that their servers and PCs are performing differently after installing updates, so the news shouldn't come as a big surprise. Still, the new information doesn't line up perfectly well with what Intel said last week when the vulnerabilities were first officially announced. \"Any performance impacts are workload-dependent, and, for the average computer user, should not be significant,\" the chipmaker said . \nMicrosoft expects most people using Windows 7 and Windows 8 on chips that are from 2015 or older will notice performance degradations, Terry Myerson, executive vice president for Microsoft's Windows and Devices Group, wrote in a blog post . The company did not publish specific performance benchmarks to back up the claims. \nSome people using Windows 10 with Intel Haswell chips or anything older will notice performance impacts, Myerson wrote. But those people running Windows 10 on Skylake, Kaby Lake or newer Intel chips probably won't notice performance issues, although internally run benchmarks show single-digit slowdowns, Myerson wrote. \nThe case is different for Windows Server, Microsoft's operating system for servers. Should customers choose to install updates to protect against issues stemming from untrusted code running on those machines, there will be a more significant performance impact, Myerson wrote. \"This is why you want to be careful to evaluate the risk of untrusted code for each Windows Server instance, and balance the security versus performance tradeoff for your environment,\" he wrote. \nAt this point, Microsoft has provided Meltdown and Spectre patches for 41 of the 45 versions of Windows through Windows Update, Myerson wrote. \nIntel stock went down after Microsoft released the news. It traded as low as $43.75, about 2 percent lower than opening price, falling from about $44.34 per share immediately after the announcement. Microsoft stock initially faltered but then reversed its decline. \nLater on Tuesday Intel offered new details on PC performance impacts because of security updates. \n\"Based on our most recent PC benchmarking, we continue to expect that the performance impact should not be significant for average computer users. This means the typical home and business PC user should not see significant slowdowns in common tasks such as reading email, writing a document or accessing digital photos,\" Intel said in a statement . The testing on PCs with the latest Intel silicon found an impact of 6 percent or less, the company said. \nIntel said it's still trying to get a sense of performance changes for chips used in data centers. Jordan Novet Technology Reporter for CNBC.com Related Securities ", "external_links": [], "published": "2018-01-09T19:01:00.000+02:00", "crawled": "2018-01-09T19:08:57.001+02:00", "highlightTitle": ""}