{"organizations": [], "uuid": "a48ef68d5f0411db6a6de0b0092c21e31142314e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 115, "shares": 115, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104967724-Sanctuary_-_Crypto_panel.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/cryptocurrencies-not-yet-in-dotcom-bubble-territory-experts-say.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrencies not yet in 'dotcom bubble territory,' experts say", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:40:00.000+02:00", "replies_count": 0, "uuid": "a48ef68d5f0411db6a6de0b0092c21e31142314e"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/cryptocurrencies-not-yet-in-dotcom-bubble-territory-experts-say.html", "ord_in_thread": 0, "title": "Cryptocurrencies not yet in 'dotcom bubble territory,' experts say", "locations": [], "entities": {"persons": [{"name": "nic cary", "sentiment": "none"}, {"name": "muirhead", "sentiment": "none"}, {"name": "richard muirhead", "sentiment": "none"}, {"name": "joe lubin", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "ethereum", "sentiment": "none"}, {"name": "blockchain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "cnbc cryptocurrencies", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "blockchain", "sentiment": "none"}, {"name": "fabric ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cryptocurrencies are not in \"dotcom bubble territory\" in terms of market capitalization, a venture capitalist said at the World Economic Forum (WEF) on Thursday.\nDuring a CNBC panel at The Sanctuary in Davos, Switzerland, Richard Muirhead, a general partner at Fabric Ventures, Ethereum co-founder Joe Lubin and Blockchain co-founder Nic Cary discussed the future of cryptocurrencies.\nMany digital coins saw huge price rises in 2017, with some business leaders calling the space a bubble .\nMarket capitalization refers to the value of all cryptocurrencies in existence. This currently stands at about $544 billion, according to data from Coinmarketcap.com, a website that tracks cryptocurrency prices.\nMuirhead said that during the famous dotcom bubble, where the stock price of internet firms soared, the market cap of companies was \"several trillions.\" In comparison, cryptocurrencies are just over a half a trillion.\n\"The prices might have become a little bit more speculative than perhaps they could be, but you know we see an increasing number of high quality teams coming along and... building interesting applications. And I think it does take time... we have to be patient,\" he said.\nshow chapters Expect to see more nations get comfortable with cryptocurrencies: Blockchain's Cary 6 Hours Ago | 02:57 \"We are still not in the kind of dotcom bubble territory in terms of the overall market capitalization. Some of us believe this particular wave is perhaps more impactful than the one back at the turn of the century.\"\nLubin and Cary both struck a positive note. Lubin, who is also the CEO of blockchain firm Consensys, talked about a number of applications being built on the distributed ledger technology. Blockchain underpins many cryptocurrencies.\nHe gave examples of blockchain technology being used to create new solutions from identity to fundraising for companies.\n\"All those fundamental elements are being put together by us and many other companies around the world... that's going to be exponential,\" Lubin said.\nCary said he is seeing more people transacting in cryptocurrencies, which will support its growth.\n\"You have to look at the fundamentals,\" he said. \"To us, we are seeing increases in transaction volume and to me that's one of the first indicators that more people are using this in their daily lives and that's really interesting to me.\"\nStill, not all at Davos were convinced on cryptocurrencies. Stephen Poloz, governor of the Bank of Canada, called bitcoin trading \"gambling\" in an interview with CNBC .", "external_links": [], "published": "2018-01-25T16:40:00.000+02:00", "crawled": "2018-01-25T17:21:03.019+02:00", "highlightTitle": ""}