{"organizations": [], "uuid": "178e48147ddac71f3ce1824958fe8026dd9bd89a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936915-GettyImages-56179886.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000116/device/rss", "section_title": "Retail", "url": "https://www.cnbc.com/2018/01/09/childrens-place-ceo-we-have-the-dream-customer-millennial-moms.html", "country": "US", "domain_rank": 767, "title": "Children's Place CEO: We have the 'dream customer'—millennial moms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T01:21:00.000+02:00", "replies_count": 0, "uuid": "178e48147ddac71f3ce1824958fe8026dd9bd89a"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/childrens-place-ceo-we-have-the-dream-customer-millennial-moms.html", "ord_in_thread": 0, "title": "Children's Place CEO: We have the 'dream customer'—millennial moms", "locations": [], "entities": {"persons": [{"name": "jim cramer", "sentiment": "none"}, {"name": "elfers", "sentiment": "none"}, {"name": "jane elfers", "sentiment": "none"}], "locations": [], "organizations": [{"name": "jim cramer children's place", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "children's place", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Children's Place has undergone transformations in various key areas including inventory, distribution and digital channels under President and CEO Jane Elfers.\nAs she steers the company towards international success, Elfers told CNBC on Tuesday that the company's digital efforts are being driven by a crucial customer demographic: millennials.\n\"We have the dream customer. We have a 28-year-old millennial mom customer who's pushing us from a digital point of view even faster than we can push ourselves,\" Elfers told \" Mad Money '\" Jim Cramer. \"You look at some of the other traditional retailers or traditional department stores, they have a much older core customer. We have the sweet spot.\"\nAs North America's No. 1 children's specialty apparel retailer, The Children's Place is one of few companies in its industry that has skirted the looming threat of e-commerce.\nElfers said that by partnering with Amazon in 2014, the company was not only able to skip playing e-commerce defense, but bolster its overall sales strategy.\nAfter all, one of The Children's Place's main drivers is the need for parents to bring their growing kids to the physical stores to try on clothes, she said.\n\"I think the combination of having 1,000 brick-and-mortar stores and a really robust e-commerce business is really part of the key to the success of The Children's Place,\" Elfers said. \"They bring the kids in, the kids get to pick what they want, and then that kind of feeds on itself and they go back and also buy on e-commerce.\"\nElfers recalled that when she took over as CEO of the company in 2010, e-commerce accounted for about 9 percent of the business. In 2018, e-commerce sales would climb to almost 23 percent, she told Cramer.\nAnother understated tailwind for the retailer could come from stabilizing birth rates in the United States, the CEO said, speaking from ICR's annual investment conference.\nBirth rates, which had been dropping since the 2008 financial crisis, started to curb their losses in 2016, a sign that they might reverse in 2017 and rise in 2018, Elfers said.\nAnd it's not just the physical customers that count to Elfers; she hoped younger generations' tech-y habits would help make the No. 1 children's specialty apparel retailer in North America the No. 1 children's specialty apparel retailer in the world.\n\"When you think about the Gen Z customer that's coming up, she's already shopping or he's already shopping in our stores with their mom,\" the CEO said. \"In 10 years from now, you can imagine how savvy they'll be digitally. So for us, it's just the perfect combination.\"\nWatch Jane Elfers' full interview here: show chapters Children's Place CEO: We have the 'dream customer'—millennial moms      21 Hours Ago | 07:58 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-10T01:21:00.000+02:00", "crawled": "2018-01-10T01:27:13.001+02:00", "highlightTitle": ""}