{"organizations": [], "uuid": "c5c1124220b1905b797c4fd5d06514943ee9a16a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/20/104540349-GettyImages-502194322.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/banking-restrictions-on-the-pot-industry-may-benefit-security-business.html", "country": "US", "domain_rank": 767, "title": "Restricted banking access for the marijuana industry may spell a boom for security business", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T18:29:00.000+02:00", "replies_count": 0, "uuid": "c5c1124220b1905b797c4fd5d06514943ee9a16a"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/banking-restrictions-on-the-pot-industry-may-benefit-security-business.html", "ord_in_thread": 0, "title": "Restricted banking access for the marijuana industry may spell a boom for security business", "locations": [], "entities": {"persons": [{"name": "jeff s", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11:31 AM ET Wed, 10 Jan 2018 | 01:35 \nIndustry reaction has been mixed since Attorney General Jeff Sessions rescinded Obama-era guidelines on enforcing marijuana laws Jan. 4. Some entrepreneurs express concern and fear, while others carry on with business as usual. \nBut one thing insiders agree on is the move will make it more difficult for cannabis companies to find and secure banking relationships, without which businesses are left with a ton of cash on hand. \nDespite being legal for recreational or medicinal use in more than half the country, marijuana is still a Schedule I drug and therefore illegal at the federal level. In 2013, Barack Obama 's administration issued the Cole Memorandum, which essentially directed federal law enforcement to allow businesses that are legal under state laws to operate. The memo also signaled banks could do business with these companies so long as they were in compliance with federal guidelines, although many have been hesitant. \nIn rescinding this policy, Sessions said future prosecutions of businesses and individuals who sell pot in states where it has been legalized will be left up to individual U.S. attorneys. \n\"The real sticking point here will be banking. Before, banks were very reluctant to do business based on the loosely defined Cole Memo,\" said Matt Karnes, founder of industry analyst firm GreenWave Advisors. \"This raises more uncertainty, and I think there is going to be a pullback.\" \nIn a November 2017 report, GreenWave found that about 5 percent, or 368, of all financial institutions in the U.S. are on record with the Financial Crimes Enforcement Network (FinCEN), but only 1 percent are actually servicing these businesses. Many are credit unions and local and community banks. Karnes also said many marijuana businesses conceal the true nature of their business when establishing relationships, and once they are found out, the account is shut down. \n\"In the last report from FinCEN, 3,800 accounts were opened, but 3,700 were shut down. It's very short-lived,\" he said. \nA report from Reuters Wednesday also indicated the action taken by Sessions came as a surprise to FinCEN, which was flooded with calls from banks on how to proceed. CNBC reached out to both the Department of Justice and FinCEN for comment but did not immediately receive a response. Boom for security businesses? \nMore cash on hand for the foreseeable future means ancillary companies that specialize in security but don't touch the plant may see an increase in business. \nDallas-based Sapphire Risk Advisory Group offers security solutions for more than 100 cannabis companies in 18 states and Canada. Managing partner Tony Gallo said he received calls from clients old and new in the past week seeking advice and new business in the wake of Sessions' action. \n\"Our clients are concerned about whether their security is adequate at this time in their locations, whether it's a grow facility or dispensary. And then new clients that are looking to come on board wanted to know what kind of security they're going to be required to have going forward,\" Gallo said. \nGallo anticipates banks will further retreat, which means his business stands to benefit. About 70 percent of the businesses he works with have banking relationships, he said. \n\"I think the banking and insurance industries have been very hesitant to conduct business in the cannabis arena prior to the Cole Memo coming out, and I think they will continue to be. It will probably get worse. That then sends messages to bad people that these locations will have a large amount of cash on hand,\" he said. \"That's the concern a lot of our clients had — safeguarding their cash now that they may have trouble going to the bank.\" Industry still primed for growth \nOne thing that hasn't shifted since Sessions' action are the growth projections firms have put forward for the industry. \nMarijuana Business Daily estimates medicinal and recreational sales will hit $6 billion in the U.S. this year and will triple in the next four to five years, fueled primarily by a new recreational market in California. \nThe more bullish GreenWave is projecting $12.8 billion this year and more than $30 billion by 2021, assuming there is a medicinal or recreational market in every state nationwide. Both groups said they are not changing their projections just yet. \n\"Basically you have a freight train moving at 200 miles per hour, and Jeff Sessions is trying to jump out of a bush and stick out his leg to slow this down,\" said Chris Walsh, vice president of editorial for Marijuana Business Daily. \"It is going to run him over. So I think it might have some type of a chilling effect in some areas, but in general, the industry is going to be moving and growing quickly and will continue to move forward.\"", "external_links": [], "published": "2018-01-11T18:29:00.000+02:00", "crawled": "2018-01-11T22:02:39.019+02:00", "highlightTitle": ""}