{"organizations": [], "uuid": "98206207ecc8f7168cda9cb462773a10a8c223d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104819458-GettyImages-177217171.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/dow-stock-nike-is-testing-a-key-level-and-it-could-be-very-bullish.html", "country": "US", "domain_rank": 767, "title": "Dow stock Nike is testing a key level, and it could be very bullish", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T14:56:00.000+02:00", "replies_count": 0, "uuid": "98206207ecc8f7168cda9cb462773a10a8c223d7"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/dow-stock-nike-is-testing-a-key-level-and-it-could-be-very-bullish.html", "ord_in_thread": 0, "title": "Dow stock Nike is testing a key level, and it could be very bullish", "locations": [], "entities": {"persons": [{"name": "matt maley", "sentiment": "none"}, {"name": "maley", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nike", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "miller tabak", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3:30 PM ET Fri, 19 Jan 2018 | 02:41 \nNike 's sprint past a record high isn't done yet, according to one market watcher. \nOn Friday, Nike raced ahead of its peers, crossing the finish line to score a new closing high. \n\"If the stock can break above the $67 level, or $67.10 level (where we're standing right now), that's going to be very bullish on a technical basis,\" Matt Maley , equity strategist at Miller Tabak, told CNBC's \" Trading Nation \" on Friday. \nNike shares surged 4.8 percent on Friday, settling at $67.21, in its best one-day performance since November 2015. \nNike's stock performance since last summer has Maley feeling more bullish in its prospects for 2018. According to his analysis, Nike's dips to the $50 level in October 2016 and 2017 formed a \"double bottom\" that created a key support level for its shares. \nThe stock then rallied back to $60 and exceeded it, a key breakout level in its performance. Nike shares have not fallen below $60 since Dec. 1. In Monday's premarket, it dropped just below $67. \n\"Whenever you get a nice double bottom followed by a nice higher high, that's always a positive development,\" Maley said. \nMaley's charts are more positive than the bulk of Wall Street forecasts. Analysts surveyed by FactSet have an average $66.40 price target on Nike shares, roughly 0.7 percent below current levels. DA Davidson has one of the highest price targets at $78 and Susquehanna Financial Group one of the lowest at $57. Most analysts have an overweight or buy rating on the stock. \nKim Forrest, senior portfolio manager at Fort Pitt Capital, sees a promising future for Nike as it speeds up its development cycle and introduces new product lines, but she's far less bullish on Nike in the near term. \n\"These products are probably not going to hit the shelves until late in this quarter and early next quarter,\" Forrest told \"Trading Nation.\" \"This quarter has a big question mark over it. If they disappoint, down goes the stock.\" \nFor its February-ended quarter, analysts anticipate earnings will dip to 52 cents a share, down from 68 cents in the same period a year earlier. Sales are expected to rise by nearly 5 percent year on year. Nike reports earnings on March 22, the tailend of the current reporting season. \nNike shares rallied on Friday after two analyst firms made moves on the stock: Wedbush upgraded its rating to outperform from neutral and Telsey Advisory Group raised its price target to $71 from $68. Wedbush based its upgrade on an expected return to growth in North America in fiscal 2019. Telsey anticipates an overall improvement in the sporting goods space after the first quarter.", "external_links": [], "published": "2018-01-22T14:56:00.000+02:00", "crawled": "2018-01-22T16:46:50.044+02:00", "highlightTitle": ""}