{"organizations": [], "uuid": "7c2caf842e21f9831b89b4d7188a58c130cd92e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/20/104786231-RTS1GH0Y.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/steve-bannon-reportedly-gets-subpoenaed-to-testify-in-russia-investigation.html", "country": "US", "domain_rank": 767, "title": "Steve Bannon reportedly gets subpoenaed to testify in Russia investigation", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T18:52:00.000+02:00", "replies_count": 0, "uuid": "7c2caf842e21f9831b89b4d7188a58c130cd92e7"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/steve-bannon-reportedly-gets-subpoenaed-to-testify-in-russia-investigation.html", "ord_in_thread": 0, "title": "Steve Bannon reportedly gets subpoenaed to testify in Russia investigation", "locations": [], "entities": {"persons": [{"name": "steve bannon", "sentiment": "negative"}, {"name": "bannon", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "the new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former White House chief strategist Steve Bannon was subpoenaed last week to testify before a grand jury in special counsel Robert Mueller's investigation into Russian efforts to influence the 2016 election, The New York Times reported Tuesday. \nThe move marks the first time Mueller's team has used a subpoena to try to get information from a person close to President Donald Trump , the newspaper reported. Citing a \"person with direct knowledge of the matter,\" the Times said Bannon may be able to skip grand jury testimony if he answers questions in a different setting. \nThe special counsel's office declined to comment to CNBC, and Bannon's attorney did not immediately respond to a CNBC request for comment. \nThe report came as Bannon answered questions Tuesday in a closed-door session with the House Intelligence Committee. It is one of multiple congressional panels also investigating Russia's role in the election and whether Moscow coordinated with the Trump campaign. \nBannon was the Trump campaign's chief executive in the final months of the 2016 election. \nComments attributed to Bannon in Michael Wolff's book \"Fire and Fury: Inside the Trump White House\" sparked more questions about the Russia investigation — and a feud between Bannon and the president. Bannon called a June 2016 meeting that included the president's eldest son Donald Trump Jr. , Trump campaign chairman Paul Manafort and a Russian lawyer \"treasonous.\" \nBannon also said there was \"zero\" chance that the younger Trump did not bring the meeting attendees to see his father in Trump Tower. \nThe White House has repeatedly defended Trump Jr.'s decision to take the meeting, during which he expected to get dirt on his father's opponent Hillary Clinton . \nAfter Bannon's remarks were published, Bannon's top financial backers, the Mercer family, pulled away from him, and he stepped down from Breitbart News . \nHe apologized for his comments and said they were aimed at Manafort, not the president's son.\nRead the Times report here.", "external_links": [], "published": "2018-01-16T18:52:00.000+02:00", "crawled": "2018-01-16T18:55:13.024+02:00", "highlightTitle": ""}