{"organizations": [], "uuid": "46ee41267aeb6fe56ef5700c15725c286cf4a2ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930207-GettyImages-187672144.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/opec-producer-angola-scraps-kwanza-dollar-peg.html", "country": "US", "domain_rank": 767, "title": "Despite rising oil prices, one OPEC producer has announced new measures to protect foreign reserves", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T16:32:00.000+02:00", "replies_count": 0, "uuid": "46ee41267aeb6fe56ef5700c15725c286cf4a2ff"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/opec-producer-angola-scraps-kwanza-dollar-peg.html", "ord_in_thread": 0, "title": "Despite rising oil prices, one OPEC producer has announced new measures to protect foreign reserves", "locations": [], "entities": {"persons": [{"name": "simon dawson", "sentiment": "negative"}, {"name": "jose massano", "sentiment": "none"}, {"name": "archer mangueira", "sentiment": "none"}], "locations": [{"name": "angola", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "luanda", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "sonangol", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Angola, OPEC producer and one of sub-Saharan Africa's largest economies, unveiled two economic overhauls this week.\nCentral bank Governor Jose Massano and Finance Minister Archer Mangueira announced Wednesday that the country was to scrap its currency peg to the U.S. dollar, and instead allow the Angolan kwanza to trade within a band against the U.S. currency. The limits of the band are yet to be defined.\nThis decision was made due to the \"macroeconomic fundamentals of the Angolan economy, and particularly the decreasing trend of international reserves,\" it emerged in a central bank statement Thursday, as reported by Reuters.\nIt was also announced that Angola is to refinance its external debt, which stands at $38 billion, according to Reuters.\nThe falling price of oil in recent years has been blamed for Angola's depleted foreign reserves. Oil accounts for roughly 90 percent of government revenue.\nWhile oil prices are now moving upwards, there has been \"little evidence of the pressure on reserves subsiding,\" Cobus de Hart, senior economist at South Africa-based research firm NKC African Economics, told CNBC.\nHe added that the exact reason for this was unclear, but suggested that \"factors such as debt repayments and the partial clearance of FX backlogs may be playing a role.\"\n\"Tighter FX liquidity was a key contributor to rising inflation during the September to October period as it led to increased domestic product shortages,\" de Hart wrote in a note Thursday. This week, the Angolan central bank opted to hold interest rates at 18 percent.\nAngola elected its first new president in 38 years last August , with Joao Lourenco named successor to Jose Eduardo dos Santos. But the dos Santos family still retains some influence over the country's economy, with the former president's son Jose Filomeno chairman of the country's sovereign wealth fund.\nAlthough the kwanza policy shift could concern investors over the short-term, Jane Foley, head of FX strategy at Rabobank, told CNBC: \"If the new president's efforts at reforming the economy prove to be successful, investors could be reassured and the currency would be more likely to find its feet.\"", "external_links": [], "published": "2018-01-05T16:32:00.000+02:00", "crawled": "2018-01-05T16:51:02.006+02:00", "highlightTitle": ""}