{"organizations": [], "uuid": "9404cc709792a1642b368e8e5e52c669194323f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/08/104451949-_Y2A5024.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/what-warren-buffett-is-looking-for-in-berkshire-hathaways-next-ceo.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett is closer to naming a successor—he's looking for this key trait", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T19:33:00.000+02:00", "replies_count": 0, "uuid": "9404cc709792a1642b368e8e5e52c669194323f3"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/what-warren-buffett-is-looking-for-in-berkshire-hathaways-next-ceo.html", "ord_in_thread": 0, "title": "Warren Buffett is closer to naming a successor—he's looking for this key trait", "locations": [], "entities": {"persons": [{"name": "ajit jain", "sentiment": "negative"}, {"name": "gregory abel", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "negative"}, {"name": "hathaway", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "charlie munger", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warren Buffett SHARES \nOn Wednesday, Warren Buffett appointed Gregory Abel and Ajit Jain to the Berkshire Hathaway board as vice chairs, hinting that one of them is the most likely candidate to eventually take over. \nBuffett told CNBC that this is \"part of a movement to succession over time,\" although both the billionaire and his partner Charlie Munger will continue in their respective roles and be in charge of significant investment decisions for the company. \nThis isn't the first time that the 87-year-old has dropped hints about the future of his company. At the Berkshire Hathaway 2017 Annual Shareholders Meeting Buffett shared one key qualification he's looking for in Berkshire's next CEO: The new boss shouldn't be in it for the money . show chapters 9:21 AM ET Tue, 13 Dec 2016 | 00:53 \n\"I actually would hope that we have somebody that's ... already very rich — which they should be if they've been working a long time — and really is not motivated by whether they have 10 times as much money than they and their families can need or a 100 times as much,\" he said. \nIdeally, Buffett said, his successor \"might even wish to perhaps set an example by engaging for something far lower than actually what you could say their true market value is.\" \nAlthough he said he couldn't blame a CEO for wanting to be paid market value, if the new boss chose to go that route, the company would likely \"pay them a very modest amount and then have an option, which increased in striking price annually.\" \nAs Buffett went on to explain, this strategy would keep the CEO's compensation in line with how the company is doing and reflect the same surges the shareholders feel. Eric Francis | Getty Images Warren Buffett (L) and Berkshire-Hathaway partner Charlie Munger \nBuffett, along with longtime business partner Charlie Munger, also discussed compensation consultants , who advise corporate boards on how to best pay employees. Neither Buffett nor Munger is a fan. \n\"I have avoided all my life compensation consultants. I hardly can find the words to express my contempt,\" Munger said. \nBuffett agreed. \"If the board hires a compensation consultant after I go, I will come back — mad,\" he said. \nIt seems clear that Buffett and Munger want their future CEO to be motivated by passion, the work and the good of the company — not a paycheck. \nThis is an updated version of a previously published article . ", "external_links": [], "published": "2018-01-10T19:33:00.000+02:00", "crawled": "2018-01-10T19:47:52.000+02:00", "highlightTitle": ""}