{"organizations": [], "uuid": "2edd12cc0c626c9a4030ef69f06d4c6516de040b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961752-9I9B0521.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/ebay-ceo-get-used-to-shopping-with-your-voice.html", "country": "US", "domain_rank": 767, "title": "EBay CEO: Get used to shopping with your voice", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T17:05:00.000+02:00", "replies_count": 0, "uuid": "2edd12cc0c626c9a4030ef69f06d4c6516de040b"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/ebay-ceo-get-used-to-shopping-with-your-voice.html", "ord_in_thread": 0, "title": "EBay CEO: Get used to shopping with your voice", "locations": [], "entities": {"persons": [{"name": "alexa", "sentiment": "none"}, {"name": "wenig", "sentiment": "none"}, {"name": "devin wenig", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "ebay", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "capgemini", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As retail is getting personal , shoppers are also adapting to ordering items online with voice technology — no keyboard required.\n\"The way humans interface with computers is changing fast,\" eBay Chief Executive Officer Devin Wenig told CNBC Tuesday from the World Economic Forum in Davos, Switzerland. \"It's moving from text to images and voice.\"\nWenig said his company has been spending \"a lot of time\" to rally behind the movement toward voice shopping. EBay is already partnering with Google , where users can shop ebay.com, among other retailer's websites, via their Home devices.\n\"I don't think the world will be in ... [ Amazon ] Alexa or Google Home,\" he added. \"That will be one way people shop, and there will be many others.\"\nMany major retailers including Target and Walmart are also partnering with Google (their websites can be shopped via Google Home), which is in a constant battle with Amazon to win over brands. Meanwhile, Amazon is touting more private-label lines, such as Wickedly Prime and Mama Bear, through its Echo devices.\nThe argument for voice shopping has been it creates a faster and more seamless shopping experience for consumers. To be sure, it's taken years for Google and Amazon to try to perfect the process, and there remains room for improvement.\nA query for \"peanut butter\" using Amazon's Alexa platform, for example, could result in your Echo device reading off — search result by search result — all the brands available on Amazon.com, and negligible details about each one. It's not exactly time-saving. Shopping for apparel using voice is also tricky unless a shopper can visualize those items.\nAccording to a new report from consulting group Capgemini, roughly 25 percent of respondents would prefer using a voice assistant to shop today over a website. Within the next three years, though, that percentage jumps to 40 percent.\n\"Conversational Commerce, consumer purchase of products and services via voice assistants such as Google Assistant, Amazon's Alexa, and Apple's Siri, will revolutionize how consumers and brands interact in ways not witnessed since the dawn of e-Commerce,\" said Mark Taylor. Capgemini's chief experience officer.\n\"It promises to be a curator of services and experiences that intelligently meet needs and engage consumers emotionally — anytime, anywhere,\" he added.\nFor the most part, consumers still use their voice-activated devices today to seek information (\"Alexa, what's the weather?\") or play music. But retailers are looking to change that, with purchases using voice of electronics, apparel and groceries on the rise.", "external_links": [], "published": "2018-01-23T17:05:00.000+02:00", "crawled": "2018-01-23T17:15:49.012+02:00", "highlightTitle": ""}