{"organizations": [], "uuid": "75ce4087ca5e1550c5d9daee35049d06f35c907c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/08/104828906-stranger-things-sweatshirt.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/netflix-2018-marketing-budget-to-hit-2-billion.html", "country": "US", "domain_rank": 767, "title": "Netflix increases marketing budget to $2 billion. Here’s why its CEO would rather not spend anything", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T18:50:00.000+02:00", "replies_count": 0, "uuid": "75ce4087ca5e1550c5d9daee35049d06f35c907c"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/netflix-2018-marketing-budget-to-hit-2-billion.html", "ord_in_thread": 0, "title": "Netflix increases marketing budget to $2 billion. Here’s why its CEO would rather not spend anything", "locations": [], "entities": {"persons": [{"name": "reed hastings", "sentiment": "none"}, {"name": "greg peters", "sentiment": "none"}, {"name": "kelly bennett", "sentiment": "none"}, {"name": "dustin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "netflix", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"Stranger Things,\" \"13 Reasons Why\" and \"Bright\" were big hits on Netflix in 2017, and the company has credited marketing — as well as the content itself — for their success.\nAs well as spending between $7.5 billion and $8 billion on shows, Netflix will increase its marketing expenditure to $2 billion this year, up from $1.28 billion in 2017, the company said in a shareholder letter published Monday.\nBut in spite of a healthy budget, Netflix Chief Executive Reed Hastings would actually rather not spend any money on marketing at all. \"Our sort of Holy Grail dream is that the service was so good at promoting the new content in such relevant ways that we wouldn't have to spend externally,\" he said on the company's fourth quarter earnings call Monday.\nGreg Peters is Netflix's chief product officer — the man in charge of optimizing the streaming site's recommendation algorithm that encourages people to watch more shows — while Kelly Bennett is its chief marketing officer, responsible for spending that cool $2 billion budget.\nSource: Netflix Stranger Things' Dustin wearing a Brontosaurus sweatshirt crashes website. \"So think of it as there's a little bit of competition between Greg and Kelly Bennett's spending to see who can drive the growth of the titles most effectively,\" Hastings said on the call.\nHastings added that Netflix wants to improve \"free\" promotion for the site's shows.\n\"As we are right now, it still is a really good financial investment to increase on the marketing and that may continue to be so,\" he said. \"But we're always also trying to improve the product in the organic reach, social and PR of the title marketing, where you end up having to spend less on paid marketing.\"\nNetflix is known for its use of data to suggest content to viewers and Hastings said it experiments with how best to market shows as well.\n\"But we really, as you can understand, steer by the data where we're doing these city-level, country-level experiments to see what are the efficient ways and productive ways to get, say, 'Bright' viewing very large, or a title that we recently had 'The End Of The F--king World' and it's been incredible for us with not much marketing and then we're boosting on it,\" he said.\nshow chapters Netflix surpasses $100 billion market cap for first time as stock hits all-time high 6 Hours Ago | 01:26 Asked whether Netflix would run ads on its site, Hastings said not. \"It is a core differentiator and again we're having great success on the commercial-free path. That's what our brand is about. So we're going to continue to expand the relevance of a commercial free service around the world and make that so popular that consumers are very used to and appreciate Netflix.\"\nTraditional or \"linear\" TV is being disrupted by services such as Netflix and Amazon Prime, and in turn there is also fierce competition among streaming sites. Disney is to remove its content from Netflix in 2019 and has also agreed to buy some 21st Century Fox assets, including Hulu, another Netflix rival. But Hastings said he would subscribe to Disney's service .\n\"I think, in particular, Disney, with its strength of brand and unique content, will have some real success. I know I'll be a subscriber of it for my own personal watching. The same way as many Disney and Fox executives also subscribe to Netflix,\" he said on the earnings call.\nDisclosure: Comcast, which owns CNBC parent NBCUniversal, is a co-owner of Hulu.", "external_links": [], "published": "2018-01-23T18:50:00.000+02:00", "crawled": "2018-01-23T19:02:49.000+02:00", "highlightTitle": ""}