{"organizations": [], "uuid": "347098639a0797d181ff2394cb45123eb003d6f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/16/104346526-RTX31BW8.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/make-america-great-again-etf-outperforms-the-stock-market.html", "country": "US", "domain_rank": 767, "title": "'Make America Great Again' ETF, pegged to Trump’s agenda, outperforms the stock market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T20:41:00.000+02:00", "replies_count": 0, "uuid": "347098639a0797d181ff2394cb45123eb003d6f1"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/make-america-great-again-etf-outperforms-the-stock-market.html", "ord_in_thread": 0, "title": "'Make America Great Again' ETF, pegged to Trump’s agenda, outperforms the stock market", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "lambert", "sentiment": "none"}], "locations": [{"name": "point bridge capital", "sentiment": "none"}], "organizations": [{"name": "williams companies", "sentiment": "negative"}, {"name": "fti", "sentiment": "neutral"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "An exchange-traded fund that tracks companies that support President Donald Trump and the Republican Party is beating the stock market, according to Hal Lambert, founder and managing director of Point Bridge.\nThe Point Bridge GOP Stock Tracker ETF trades on the Bats exchange under the ticker symbol MAGA, the acronym for Trump's 2016 campaign slogan \"Make America Great Again.\"\nThe MAGA ETF, which launched on Sept. 6, has gained about 13.7 percent as of Friday's close. That compares with a return of nearly 11.3 percent for the S&P 500 over the same period.\nThe fund uses Federal Election Commission data and screens components in the S&P for companies whose campaign contributions from employees and political action committees donate significant money to support Republicans running for office.\n\"These are all based on political contributions of companies in the S&P 500. It's the top political contributors to Republicans,\" Lambert said Monday on CNBC's \" Squawk Box. \" \"It's about 21 percent industrials, it's about 20 percent financials and about 17 percent oil and gas.\"\nPoint Bridge GOP Stock Tracker ETF\nTop Holdings\n1.Freeport-McMoRan (FCX)\n2.Apache (APA)\n3.Marathon Oil (MRO)\n4.TechnipFMC (FTI)\n5.Williams Companies (WMB)\nSince the November 2016 election, Trump has not been shy about taking credit for the stock market's performance, saying the market has created \"tremendous benefits for our country.\"\n@realDonaldTrump: The Stock Market has been creating tremendous benefits for our country in the form of not only Record Setting Stock Prices but present and future Jobs, Jobs, Jobs. Seven TRILLION dollars of value created since our big election win!\nLambert, formerly a director at Credit Suisse, founded Point Bridge Capital in 2013. A Republican donor, he also served on Trump's inaugural committee.\nHe said he believes people should have knowledge of which companies are donating to certain parties.\n\"Money matters,\" Lambert said. \"If you want policies that are Republican policies, which I think are the best for the economic growth, you want to support companies that are heavily supporting Republicans to get elected.\"\nLambert also said he saw an immediate bump on stocks after the GOP's tax plan passed.\n\"The tax reform is huge,\" Lambert said. \"Clearly, the equities are benefiting from the Trump agenda. And the economic growth for 2018 looks to be set up very nicely.\"\nMorning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address", "external_links": [], "published": "2018-01-08T20:41:00.000+02:00", "crawled": "2018-01-08T20:46:21.022+02:00", "highlightTitle": ""}