{"organizations": [], "uuid": "09b01771d9987678fed00e285db3ebc846111e03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/27/104245337-RTX2XSP8.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/stocks-making-the-biggest-moves-premarket-cmcsa-ge-utx-swk-ual-wfc-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: CMCSA, GE, UTX, SWK, UAL, WFC & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T15:03:00.000+02:00", "replies_count": 0, "uuid": "09b01771d9987678fed00e285db3ebc846111e03"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/stocks-making-the-biggest-moves-premarket-cmcsa-ge-utx-swk-ual-wfc-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: CMCSA, GE, UTX, SWK, UAL, WFC & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "ual", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "negative"}, {"name": "swk", "sentiment": "negative"}, {"name": "ge", "sentiment": "negative"}, {"name": "general electric", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "united technologies", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "stanley black & decker", "sentiment": "none"}, {"name": "united tech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Traders work on the floor of the New York Stock Exchange. \nCheck out which companies are making headlines before the bell: \nComcast – The NBCUniversal and CNBC parent reported adjusted fourth-quarter profit of 49 cents per share , 2 cents a share above estimates. Revenue topped forecasts, as well, and Comcast announced a 21 percent dividend increase. The company also said it would repurchase at least $5 billion in stock this year. \nGeneral Electric – GE fell 2 cents a share shy of estimates, with adjusted quarterly profit of 27 cents per share . Revenue also missed expectations, however GE said its cash flow was improving and it gave an earnings forecast for 2018 that falls largely above Street forecasts. \nUnited Technologies – The defense contractor reported fourth-quarter profit of $1.60 per share, beating estimates by 4 cents a share. Revenue also beat consensus and United Tech said its organic sales growth in 2017 was its fastest in three years. \nStanley Black & Decker – The tool maker came in 4 cents a share above estimates at an adjusted $2.18 per share. Revenue also beat forecasts and the company made upbeat comments about this year as it integrates recent acquisitions. \nValeant Pharmaceuticals – Goldman Sachs initiated coverage on the drugmaker with a \"sell\" rating. Goldman said Valeant has made progress in executing growth initiatives, reducing debt, and moving past legal issues, but adds that Valeant still faces litigation risk and a highly levered balance sheet. \nUnited Continental – United reported adjusted quarterly profit of $1.40 per share , 6 cents a share above estimates. The United Airlines parent's revenue came in just slightly above forecasts, however the shares are under pressure after United said it planned to increase capacity in a move which could impact its profit margins by keeping price wars in place. That's hurting shares of other airline stocks like Delta Air Lines , JetBlue , American Airlines Group , and Southwest Airlines . \nWells Fargo — The bank increased its share buyback program by 350 million shares. \nTexas Instruments – Texas Instruments matched Street forecasts, with adjusted quarterly profit of $1.09 per share. Revenue was in line with forecasts, as well. Revenue growth was the slowest in four quarters amid expectations that increasing demand for automotive-related chips would drive growth. \nSirius XM – Sirius XM added $2 billion to its stock buyback program, bringing the satellite radio operator's buyback program to a total of $12 billion since it was begun in 2013. \nValero Energy – The energy producer increased its quarterly dividend to 80 cents per share from 70 cents, and also approved a stock buyback program worth up to $2.5 billion. \nCapital One – Capital One reported adjusted quarterly earnings of $1.59 per share, missing the consensus estimate of $1.88 a share. The credit card issuer's revenue was slightly below forecasts. Results were impacted by credit losses, and the company reported an overall loss on a $1.77 billion charge related to the recent tax law change. \nCree – Cree lost 1 cent per share for its latest quarter, compared to expectations of a 1 cent per share profit. The maker of lighting products did see revenue beat forecasts. The company said strategic moves are beginning to take hold and that it sees meaningful upside in future results. \nQualcomm – The chipmaker was hit with a $1.2 billion fine by European regulators for paying Apple to exclusively use Qualcomm chips in its products. \nFacebook – Facebook bought Boston-based Confirm for an undisclosed amount. Confirm specializes in identification authentication technology. \nMicrosoft – Microsoft was rated \"buy\" in new coverage at Nomura/Instinet, saying the software giant is poised to benefit from the business world's digital transformation trend. Peter Schacknow Senior Producer, CNBC Related Securities ", "external_links": [], "published": "2018-01-24T15:03:00.000+02:00", "crawled": "2018-01-24T15:06:40.000+02:00", "highlightTitle": ""}