{"organizations": [], "uuid": "444aac9aaa87101a5d322d3da218a6285621ccea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/06/103615292-GettyImages-450824074.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/jeff-bezos-and-8-other-ceos-are-speaking-up-for-dreamers.html", "country": "US", "domain_rank": 767, "title": "Jeff Bezos donated $33 million to pay 'dreamers'' tuition. Here are 8 other CEOs who've spoken up", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T19:03:00.000+02:00", "replies_count": 0, "uuid": "444aac9aaa87101a5d322d3da218a6285621ccea"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/jeff-bezos-and-8-other-ceos-are-speaking-up-for-dreamers.html", "ord_in_thread": 0, "title": "Jeff Bezos donated $33 million to pay 'dreamers'' tuition. Here are 8 other CEOs who've spoken up", "locations": [], "entities": {"persons": [{"name": "jeff bezos", "sentiment": "negative"}, {"name": "mike kane", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bezos", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mackenzie", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "amazon.com inc", "sentiment": "negative"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When President Donald Trump announced in September that his administration would be ending the Deferred Action for Childhood Arrivals (DACA) Program, hundreds of the world's most influential business leaders spoke up. Over 400 CEOs, founders and business leaders signed a letter urging Trump to preserve the DACA program and protect undocumented immigrants brought to the U.S. as children, known as \"dreamers.\"\nToday, Amazon CEO Jeff Bezos underscored his support with a $33 million donation to an organization that provides scholarships for dreamers. \nTheDream.Us , a nonprofit working toward college access for dreamers, announced that Bezos and his wife MacKenzie's donation will fund 1,000 scholarships. Since dreamers are not eligible for federal financial aid, donations like Bezos' are particularly valuable.\nshow chapters Here's what makes up the Jeff Bezos empire      12:48 PM ET Thu, 29 June 2017 | 01:05 \"My dad came to the U.S. when he was 16 as part of Operation Pedro Pan,\" Bezos said in a statement . \"He landed in this country alone and unable to speak English. With a lot of grit and determination — and the help of some remarkable organizations in Delaware — my dad became an outstanding citizen, and he continues to give back to the country that he feels blessed him in so many ways.\"\nTo qualify for the DACA, dreamers must register with the government, pass multiple background checks and pay taxes. Over 97 percent of the 800,000 dreamers are in school or the workforce and many serve in the armed forces. President Trump has given lawmakers until March 5th to craft a new immigration plan, but Congressional Democrats and Republicans are still at an impasse.\nThis week, Bezos and 100 other business leaders co-signed a letter to Congress calling for immediate legal relief for dreamers. \"The imminent termination of the DACA program is creating an impending crisis for workforces across the country,\" states the letter. \nHere is what eight other powerful CEOs have said about the importance of defending dreamers: \nMarc Benioff, CEO of Salesforce DACA=LOVE. CEOs ❤️ DACA! pic.twitter.com/AWASUeJoOD \n— Marc Benioff (@Benioff) September 5, 2017 Brian Chesky, CEO of AirBnb Dreamers belong in our country, our companies and in our communities. I’m proud to support them https://t.co/VNud3AcytU \n— Brian Chesky (@bchesky) September 1, 2017 Tim Cook, CEO of Apple 250 of my Apple coworkers are #Dreamers . I stand with them. They deserve our respect as equals and a solution rooted in American values.\n— Tim Cook (@tim_cook) September 3, 2017 Dara Khosrowshahi, CEO of Uber It's against our values to turn our backs on #DREAMers . Everyone deserves a chance to work, study and contribute - the #AmericanDream !\n— dara khosrowshahi (@dkhos) September 5, 2017 Aaron Levie, CEO of Box Congress must act immediately to allow Dreamers to stay. This should be priority # 1 given the confusion and stress ending DACA will cause.\n— Aaron Levie (@levie) September 5, 2017 Satya Nadella, CEO of Microsoft Dreamers make our country & communities stronger. We stand for diversity and economic opportunity for everyone. https://t.co/gRCr8VWwcN \n— Satya Nadella (@satyanadella) September 5, 2017 Sundar Pichai, CEO of Google Dreamers are our neighbors, our friends and our co-workers. This is their home. Congress needs to act now to #DefendDACA . #WithDreamers \n— Sundar Pichai (@sundarpichai) September 5, 2017 Mark Zuckerberg, CEO of Facebook This is an update of a post that appeared previously. \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: \n5 tricks for paying for college in 2018 This 12-year-old won $25,000 for an invention that helps detect lead in water Bill Gates is spending $1.7 billion to fix the US education system—here's how show chapters The plan for Bill and Melinda Gates' $1.7 billion investment in America's public education system      10:21 AM ET Mon, 30 Oct 2017 | 01:16", "external_links": [], "published": "2018-01-12T19:03:00.000+02:00", "crawled": "2018-01-12T19:25:12.009+02:00", "highlightTitle": ""}