{"organizations": [], "uuid": "a3b1e2dc390c5339b49b5e3a2fe95e07d8d9c315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/20/102205513-10039963.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/robot-math-smartphones-lead-researchers-to-drug-breakthrough.html", "country": "US", "domain_rank": 767, "title": "How robot math and smartphones led researchers to discover new cancer drug", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T20:07:00.000+02:00", "replies_count": 0, "uuid": "a3b1e2dc390c5339b49b5e3a2fe95e07d8d9c315"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/robot-math-smartphones-lead-researchers-to-drug-breakthrough.html", "ord_in_thread": 0, "title": "How robot math and smartphones led researchers to discover new cancer drug", "locations": [], "entities": {"persons": [{"name": "michel tcherevkoff", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "university of washington's institute for protein design", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Robotic movement can be awkward.\nFor us humans, a healthy brain handles all the minute details of bodily motion without demanding conscious attention. Not so for brainless robots – in fact, calculating robotic movement is its own scientific subfield.\nMy colleagues here at the University of Washington's Institute for Protein Design have figured out how to apply an algorithm originally designed to help robots move to an entirely different problem: drug discovery. The algorithm has helped unlock a class of molecules known as peptide macrocycles, which have appealing pharmaceutical properties.\nOne small step, one giant leap Roboticists who program movement conceive of it in what they call \"degrees of freedom.\" Take a metal arm, for instance. The elbow, wrist and knuckles are movable and thus contain degrees of freedom. The forearm, upper arm and individual sections of each finger do not. If you want to program an android to reach out and grasp an object or take a calculated step, you need to know what its degrees of freedom are and how to manipulate them.\nThe more degrees of freedom a limb has, the more complex its potential motions. The math required to direct even simple robotic limbs is surprisingly abstruse ; Ferdinand Freudenstein, a father of the field, once called the calculations underlying the movement of a limb with seven joints \" the Mount Everest of kinematics .\"\nshow chapters Check out this robotic hand with a human touch      3:18 PM ET Wed, 4 Jan 2017 | 00:47 Freudenstein developed his kinematics equations at the dawn of the computer era in the 1950s. Since then, roboticists have increasingly relied on algorithms to solve these complex kinematic puzzles. One algorithm in particular — known as \"generalized kinematic closure\" — bested the seven-joint problem, allowing roboticists to program fine control into mechanical hands.\nMolecular biologists took notice.\nMany molecules inside living cells can be conceived of as chains with pivot points, or degrees of freedom, akin to tiny robotic arms. These molecules flex and twist according to the laws of chemistry. Peptides and their elongated cousins, proteins, often must adopt precise three-dimensional shapes in order to function. Accurately predicting the complex shapes of peptides and proteins allows scientists like me to understand how they work.\nMastering macrocycles While most peptides form straight chains, a subset, known as macrocycles, form rings. This shape offers distinct pharmacological advantages . Ringed structures are less flexible than floppy chains, making macrocycles extremely stable. And because they lack free ends, some can resist rapid degradation in the body — an otherwise common fate for ingested peptides.\n\nMacrocycles have a circular 'main chain' (shown as thick lines) and many 'side chains' (shown as thin lines). The macrocycle on the left — cyclosporin — evolved in a fungus. The one on the right was designed on a computer. Source: Ian Haydon/Institute for Protein Design \n\nNatural macrocycles such as cyclosporin are among the most potent therapeutics identified to date. They combine the stability benefits of small-molecule drugs, like aspirin, and the specificity of large antibody therapeutics, like herceptin. Experts in the pharmaceutical industry regard this category of medicinal compounds as \"attractive, albeit underappreciated.\"\nMore from The Conversation:\nUS life expectancy just dropped for the second year in a row \nNew study reveals why some people are more creative than others \nWhat gig economy workers can learn from the success of romance writers \n\"There is a huge diversity of macrocycles in nature — in bacteria, plants, some mammals,\" said Gaurav Bhardwaj, a lead author of the new report in Science, \"and nature has evolved them for their own particular functions.\" Indeed, many natural macrocycles are toxins. Cyclosporin, for instance, displays antifungal activity yet also acts as a powerful immunosuppressant in the clinic, making it useful as a treatment for rheumatoid arthritis or to prevent rejection of transplanted organs.\nA popular strategy for producing new macrocycle drugs involves grafting medicinally useful features onto otherwise safe and stable natural macrocycle backbones. \"When it works, it works really well, but there's a limited number of well-characterized structures that we can confidently use,\" said Bhardwaj. In other words, drug designers have only had access to a handful of starting points when making new macrocycle medications.\nTo create additional reliable starting points, his team used generalized kinematic closure — the robot joint algorithm — to explore the possible conformations, or shapes, that macrocycles can adopt.\nAdaptable algorithms As with keys, the exact shape of a macrocycle matters. Build one with the right conformation and you may unlock a new cure.\nModeling realistic conformations is \"one of the hardest parts\" of macrocycle design, according to Vikram Mulligan, another lead author of the report. But thanks to the efficiency of the robotics-inspired algorithm, the team was able to achieve \"near-exhaustive sampling\" of plausible conformations at \"relatively low computational cost.\"\nThe calculations were so efficient, in fact, that most of the work did not require a supercomputer, as is usually the case in the field of molecular engineering. Instead, thousands of smartphones belonging to volunteers were networked together to form a distributed computing grid, and the scientific calculations were doled out in manageable chunks.\nWith the initial smartphone number-crunching complete, the team pored over the results — a collection of hundreds of never-before-seen macrocycles. When a dozen such compounds were chemically synthesized in the lab, nine were shown to actually adopt the predicted conformation. In other words, the smartphones were accurately rendering molecules that scientists can now optimize for their potential as targeted drugs.\nThe team estimates the number of macrocycles that can confidently be used as starting points for drug design has jumped from fewer than 10 to over 200, thanks to this work. Many of the newly designed macrocycles contain chemical features that have never been seen in biology.\nTo date, macrocyclic peptide drugs have shown promise in battling cancer, cardiovascular disease, inflammation and infection. Thanks to the mathematics of robotics, a few smartphones and some cross-disciplinary thinking, patients may soon see even more benefits from this promising class of molecules.\nCommentary by Ian Haydon, a doctoral student in biochemistry at the University of Washington. He is also a contributor at The Conversation , an independent source of news and views from the academic and research community. \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-16T20:07:00.000+02:00", "crawled": "2018-01-16T20:17:41.034+02:00", "highlightTitle": ""}