{"organizations": [], "uuid": "6fee2d1d6ba0fbe232c3b1b014333ba9e30f7d1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959392-RTX4HT1Z.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001135/device/rss/rss.html", "section_title": "Stock Picks", "url": "https://www.cnbc.com/2018/01/22/cramer-blink-and-youll-miss-this-markets-windows-of-opportunity.html", "country": "US", "domain_rank": 767, "title": "Cramer: Blink and you'll miss this market's windows of opportunity", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T01:11:00.000+02:00", "replies_count": 0, "uuid": "6fee2d1d6ba0fbe232c3b1b014333ba9e30f7d1b"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/cramer-blink-and-youll-miss-this-markets-windows-of-opportunity.html", "ord_in_thread": 0, "title": "Cramer: Blink and you'll miss this market's windows of opportunity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC's Jim Cramer knows that buying stocks on weakness in a market this strong is no easy task.\n\"Even in this market, this beast of a market, you do get the occasional buying opportunity. It does exist, but the window closes so fast that if you blink you'll miss it,\" the \" Mad Money \" host said. \"Still, if you're ready to pounce, you can pick up some high-quality stocks at discounted prices.\"\nExhibit A? The government shutdown, which started at midnight on Saturday and ended with a deal struck on Monday afternoon.\nThe major averages slid from their highs at Monday's opening bell as investors processed what the shutdown meant for equities. But Cramer struggled to link it to any tangible effects.\n\"Historically, if we have a delay in tax refund checks from the IRS, it would cause weak year-over-year comparisons for the dollar store chains, the auto parts retailers, anything where consumers will have to postpone their spending. That's been the pattern,\" Cramer said. \"But if you had a chance to pick those stocks up into weakness today because it was the pattern, you had to take it.\"\nMany of the dollar store and auto parts stocks held strong, resuming their marches higher shortly after the market opened; shares of Dollar General even hit a 52-week high.\n\"In other words, the shutdown gave you that brief window, that brief chance to buy the stocks of companies that could be hurt only temporarily,\" the \"Mad Money\" host said.\nExhibit B was the stock of Schlumberger , the world's biggest oilfield services company. When oil prices recently broke through the $60 benchmark, shares of Schlumberger surged with them.\nCramer has long lauded Schlumberger CEO Paal Kibsgaard for running a good business and accurately calling the most recent top and bottom for oil prices.\nBut some investors soured on Schlumberger after it reported earnings without any meaningful upside surprise and Kibsgaard forecast that the next quarter would be difficult for the company.\nThen, seemingly out of nowhere, Kibsgaard predicted that the second and third quarters would be very strong thanks to various international drivers like increased drilling outside the country.\n\"Today, Halliburton , a major oil service competitor, crushes the number and Schlumberger's stock tacks on another 3 [basis points],\" Cramer said. \"You blink, you miss the whole darned thing.\"\nExhibit C was Goldman Sachs , an investment bank that just reported earnings. Cramer was surprised at how well it did despite the 50 percent drop in bond trading revenue, a major driver for the business.\nStill, Cramer knows Goldman to be a company that reinvents itself, so he remained bullish on its trajectory.\n\"The rest of Goldman's businesses are on fire, so it's not like they even need to do that much reinventing. Yet the stock sells for less than 11 times earnings — it's the cheapest I've ever seen it on a price-to-earnings basis,\" he said. \"My advice last week was that you should wait two days after the quarter was announced as the insiders always depress the stock with their traditional selling as the window opens, and then you had to buy. Now the window's closed, boom, it's off to the races.\"\nCramer hoped that Goldman would explore the advantages of the cryptocurrency market, predicting that if the bank did, its stock could rally 10 percent.\n\"But even without any catalysts, Goldman Sachs' stock is just too cheap to ignore,\" he said.\nSo as investors search for good buys in a market where buying opportunities are scant, Cramer strongly recommended they focus on doing their homework and staying calm when high-quality stocks drop for low-quality reasons.\n\"Finding bargains in this beast of a bull market is a real and rigorous high wire act where the wire's thin, there's no net and you only have a few seconds to think,\" the \"Mad Money\" host said. \"But if you're prepared ahead of time, you can profit from these intraday pullbacks and you can rack up some terrific wins.\"\nWATCH: Cramer finds windows of opportunity across the market show chapters Cramer: Blink and you'll miss this market's windows of opportunity 19 Hours Ago | 12:10 Disclosure: Cramer's charitable trust owns shares of Schlumberger.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-23T01:11:00.000+02:00", "crawled": "2018-01-23T02:21:39.060+02:00", "highlightTitle": ""}