{"organizations": [], "uuid": "63a125dd77e2fecfb6a0c4461ad5c0367adbacf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/31/102141293-113215716r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/interest-rates-shoot-higher-amid-worries-the-central-bank-easy-money-party-is-over.html", "country": "US", "domain_rank": 767, "title": "Interest rates shoot higher amid worries the central bank easy money party is over", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T23:40:00.000+02:00", "replies_count": 0, "uuid": "63a125dd77e2fecfb6a0c4461ad5c0367adbacf1"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/interest-rates-shoot-higher-amid-worries-the-central-bank-easy-money-party-is-over.html", "ord_in_thread": 0, "title": "Interest rates shoot higher amid worries the central bank easy money party is over", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Interest rates shoot higher amid worries the central bank easy money party is over Treasury yields jumped amid speculation global central banks will remove easy policies. The speculation started with the Bank of Japan, but all central banks are expected to take a tighter stance towards monetary policy. The U.S. 10-year yield rose to 2.55 percent, the highest since March. 6 Hours Ago | 06:37 \nThe bond market is getting a wake-up call from global central banks that the post-financial crisis era of easy money and super low interest rates is coming to an end. \nIn what was a sizzling move for the Treasury market, the 10-year yield zipped higher Tuesday amid talk that the Bank of Japan could finally be ready to wind down its easy policies. The 10-year yield broke above the key 2.50 percent level and was trading as high as 2.55 percent, the highest since March. \nThe 10-year is key since it is a benchmark that mortgages and many other consumer and business loans are based on. \nStrategists said as the market fixated on the Bank of Japan, the European Central Bank was also a focus. The ECB cut its bond buying in half as of last week, and there is increasing speculation it could cut back altogether before the end of the year. Both central banks are well behind the Fed which has already raised interest rates five times and has been unwinding its balance sheet. \nWhile still down the road, moves to limit easing would put both of those central banks closer to the time when they begin to adjust interest rates to more normal levels. The Bank of Japan Tuesday bought fewer longer duration bonds than it has been purchasing, sparking the speculation its program is coming to an end. However, strategists said the changes could be more technical than an indication the central bank is about to change course. \n\"I have argued the Bank of Japan and ECB set long end interest rates in this county as much as the Fed does. Our long end interest rates can move higher. I think the 10-year Treasury is going to hit significantly higher interest rates than they are now,\" said Rick Rieder, global chief investment officer, fixed income at BlackRock. \"We think the 10-year this year is going to 3 percent. I still hold to that.\" \nThe 10-year yield has run up quickly and was trading at 2.44 percent at the beginning of the year. \n\"For what has been a very low volatility market, this is a big day,\" said Rieder. The 10-year was at 2.54 percent in late trading. \nThe U.S. 10-year yield has been in a flattening trend —moving closer to the 2-year yield, which has been rising on the prospect of Fed interest rate hikes. But the 10-year has also been held down because of low interest rates in other part of the world that make U.S. yields look more attractive. Yields move opposite price. \n\"I think it started with Japan. Obviously, they're not making any huge shifts in their monetary policy, but this is a movement in that direction of removing some of the accommodation. It's taken global central banks many years to build this up. It's not going to be removed very quickly. Nonethess, it's going to put upward pressure on rates,\" said Charlie Ripley, senior investment strategist for Allianz Investment Management. \nRieder said the market move also comes as inflation appears to be picking up and more Treasury and global sovereign debt is coming to market. Meanwhile, those major central bank bond purchases by the Fed and others are slowing down. \n\"There's at least $1 trillion reduction between the Fed and the ECB this year. That's significant,\" said Peter Boocvkar, chief investment officer at Bleakley Financial Group. \nMark Cabana, head of U.S. short rate strategy at Bank of America Merrill Lynch said there were other factors that impacted yields Tuesday. \"We also had China come out and suggest they're going to stop relying on a counter cyclical factor in their fixing of the yuan. On net, that means China needs to rely less on intervention in order to support the yuan and that would mean on net, less U.S. dollars and less U.S. dollar investment,\" like Treasurys, said Cabana. \nCabana said Tuesday's move was significant but whether it indicates a turn in the market is yet to be seen. \"It's too soon to tell. The fact we have broken above 2.50 clearly is certainly something we''ve not done for almost a year and it very well may be leading to higher overall levels of rates,\" he said. \nCabana said Fed officials may also have contributed to the market move with talk of moving to a policy of price level targeting rather than using a target for inflation. The difference would be the target price levels would be set for a specific period of time. Cabana said the result could be fewer near term rate increases as inflation builds up. Patti Domm CNBC Markets Editor Related Securities ", "external_links": [], "published": "2018-01-09T23:40:00.000+02:00", "crawled": "2018-01-10T00:10:19.004+02:00", "highlightTitle": ""}