{"organizations": [], "uuid": "5ff8833a0856d1d3b6cf2500668c925a1b4a20e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/25/104795230-GettyImages-72249621.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/30/bitcoin-boom-to-give-amd-earnings-a-boost-says-mkm-partners.html", "country": "US", "domain_rank": 767, "title": "Bitcoin boom to give AMD earnings a boost, says MKM Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T15:11:00.000+02:00", "replies_count": 0, "uuid": "5ff8833a0856d1d3b6cf2500668c925a1b4a20e8"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/bitcoin-boom-to-give-amd-earnings-a-boost-says-mkm-partners.html", "ord_in_thread": 0, "title": "Bitcoin boom to give AMD earnings a boost, says MKM Partners", "locations": [], "entities": {"persons": [{"name": "ruben roy", "sentiment": "none"}, {"name": "roy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "mkm partners", "sentiment": "none"}, {"name": "nvidia", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "advanced micro devices", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A sharp run-up in digital currency values didn't just benefit crypto traders in the final months of 2017. Advanced Micro Devices will likely get a share of the riches, according to MKM Partners analyst Ruben Roy.\nRoy has turned more bullish on AMD on the calculation investors have yet to price in a boost from the cryptocurrency markets. The chipmaker is scheduled to report earnings after Tuesday's closing bell.\n\"The near-term numbers both for December and the guide for March are going to be quite good,\" Roy told CNBC's \" Trading Nation \" on Monday. \"I think the setup for crypto is quite good.\"\nRecent channel checks by MKM suggest strong demand for processing chips, especially graphics chips, used in cryptocurrency mining. Chipmakers such as AMD and Nvidia have seen increased sales of high-powered chips in recent years as cryptocurrency mining and trading have grown in popularity. Some of the most popular cryptocurrencies, including bitcoin and ethereum, at least doubled their price in the fourth quarter.\nMKM Partners expects a nearly 14 percent quarter-on-quarter decline in AMD sales, a shallower drop than previously expected and slightly higher than consensus. Earnings estimates of 5 cents a share are in line with consensus — it would mark the company's third straight quarter of profitability, its best streak since 2014.\nIn a note Monday, Roy also hiked the company's fair value estimate to $14.50 a share from $13 and increased earnings estimates through to 2019. A $14.50 price target implies 9 percent upside for AMD from Monday's close. For 2019, Roy anticipates 45 percent earnings growth and a 10 percent sales increase on 2018 estimates.\nRoy still has his reservations on the stock, though. He maintains a neutral rating on AMD shares and said his view would change when he sees the company taking a larger chunk of market share. AMD's market share is little changed even after introducing Ryzen, a new brand of central processing units, and its Vega graphics processing unit chips last year, said Roy.\n\"From a longer term perspective what it will take for us to get more positive on the stock, I think we need to see AMD take some of these new products that I mentioned and start to get some meaningful market share,\" he said.\nMKM Partners' estimates are largely in line with its peers. Most brokerage firms surveyed by FactSet have a hold rating on AMD shares with an average target price of $14.23. Rosenblatt Securities holds the highest price target at $22, while Morningstar Equity Research has the lowest at $9.\nAMD shares were down slight in Tuesday's premarket, trading at $13.24. On Monday, they were sharply higher for the second session in a row, adding to its already steep ascent this year. Its shares have risen nearly 30 percent in January — more than four times the gains on the S&P 500 . AMD is the best performer on the SMH semiconductor ETF , bypassing major competitor Nvidia .\nAMD's 2018 gains are a welcome rebound after a weak back half to 2017. The Semiconductors ETF rose 36 percent over 2017, while AMD fell 9 percent in its worst 12-month performance since 2014. AMD shares fell 24 percent from August through to December, while the Semiconductors ETF increased 14 percent.\nshow chapters Crypto mining could drive this chip stock 23 Hours Ago | 03:56 Vote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-30T15:11:00.000+02:00", "crawled": "2018-01-30T15:50:20.042+02:00", "highlightTitle": ""}