{"organizations": [], "uuid": "0ffc563a1148f0986205c0c77269d217b35155ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970800-GettyImages-511195524.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/japanese-cryptocurrency-exchange-loses-more-than-500-million-to-hackers.html", "country": "US", "domain_rank": 767, "title": "Japanese cryptocurrency exchange loses more than $500 million to hackers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T19:55:00.000+02:00", "replies_count": 0, "uuid": "0ffc563a1148f0986205c0c77269d217b35155ba"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/japanese-cryptocurrency-exchange-loses-more-than-500-million-to-hackers.html", "ord_in_thread": 0, "title": "Japanese cryptocurrency exchange loses more than $500 million to hackers", "locations": [], "entities": {"persons": [{"name": "coincheck", "sentiment": "none"}], "locations": [{"name": "logmi", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "nem coin  hackers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hackers stole several hundred million dollar's worth of one lesser-known cryptocurrency from a major Japanese exchange Friday. \nCoincheck said that around 523 million of the exchange's NEM coins were sent to another account around 3 a.m. local time (1 p.m. Thursday, ET), according to a Google translate of a Japanese transcript of the Friday press conference from Logmi . The exchange has about 6 percent of yen-bitcoin trading, ranking fourth by market share on CryptoCompare\nThe stolen NEM coins were worth about 58 billion yen at the time of detection, or roughly $534.8 million, according to the exchange. Coincheck subsequently restricted withdrawals of all currencies, including yen, and trading of cryptocurrencies other than bitcoin. \nBloomberg first reported the hack. A CNBC email sent to Coincheck's listed address bounced back.\nCryptocurrency NEM, which intends to help businesses handle data digitally, briefly fell more than 20 percent Friday before recovering to trade about 10 percent lower near 85 cents, according to CoinMarketCap. Most other major digital currencies, including bitcoin , traded little changed on the day.\nCoincheck management said in the press conference that it held the NEM coins in a \"hot\" wallet, referring to a method of storage that is linked to the internet. In contrast, leading U.S. exchange Coinbase says on its website that 98 percent of its digital currency holdings are offline , or \"cold\" storage.\nThe Japanese exchange said it did not appear that hackers had stolen other digital currencies. \nThe Coincheck hack follows news in December that a South Korean cryptocurrency exchange called Youbit lost 17 percent of its digital assets. Its parent Yapian filed for bankruptcy. \nIn another high-profile case, Tokyo-based Mt. Gox filed for bankruptcy in 2014 and said it lost 750,000 of its users' bitcoins and 100,000 of the exchange's own . The company was the largest bitcoin exchange at the time.\nMorgan Stanley analysts estimated in mid-December that more than $630 million in bitcoin has been lost to hackers.", "external_links": [], "published": "2018-01-26T19:55:00.000+02:00", "crawled": "2018-01-26T20:04:36.002+02:00", "highlightTitle": ""}