{"organizations": [], "uuid": "0b40a2ca917727ab9ddbb6f987077b6cddea6a08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104818765-GettyImages-864125128-tim-cook.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/corporations-may-dodge-billions-in-us-taxes-through-new-loophole.html", "country": "US", "domain_rank": 767, "title": "Corporations may dodge billions in US taxes through new loophole", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T17:20:00.000+02:00", "replies_count": 0, "uuid": "0b40a2ca917727ab9ddbb6f987077b6cddea6a08"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/corporations-may-dodge-billions-in-us-taxes-through-new-loophole.html", "ord_in_thread": 0, "title": "Corporations may dodge billions in US taxes through new loophole", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}, {"name": "daniel acker", "sentiment": "none"}, {"name": "stephen shay", "sentiment": "none"}, {"name": "shay", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "taxes corporations", "sentiment": "negative"}, {"name": "apple, inc", "sentiment": "none"}, {"name": "harvard law school", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A loophole in the new U.S. tax law could allow multinational corporations like Apple to avoid paying billions of dollars in taxes on profits stashed overseas, according to experts.\nStemming from a Republican overhaul of international business taxes, the loophole involves the tax rates—15.5 percent or 8 percent—that companies must pay on $2.6 trillion in profits they are holding abroad.\nBy manipulating their foreign cash positions, a determining factor under the new law, a U.S. multinational could potentially save money by shifting profits to the lower rate from the higher one, according to Stephen Shay, a senior lecturer at Harvard Law School.\nThe savings could amount to more than $4 billion in Apple's case alone, he said.\nAn Apple spokesman declined to speak on the record about Shay's analysis. U.S. Treasury Department and Internal Revenue Service officials did not respond to Reuters' queries seeking comment.\n\"This is clearly the result of rushed legislation,\" said Shay, formerly a top Treasury Department tax official.\nThe sweeping Republican tax law was President Donald Trump 's first major legislative triumph since he took office almost a year ago. Rushed through Congress, and approved over the unanimous opposition of Democrats, it took effect this month, delivering tax cuts and tax code changes that large, U.S.-based multinationals had sought for years.\nOne of those changes was a one-time tax break on about $2.6 trillion in profits that multinationals have socked away overseas in recent years under a \"deferral\" rule that let companies hold profits offshore tax-free, as long as the money was not brought into the United States, or repatriated.\nThere is no such deferral under the new law and accumulated overseas profits will now be taxed at either 15.5 percent for cash holdings or at 8 percent for more illiquid investments.\nBoth rates are far below the 35 percent rate that would have been charged on repatriated foreign profits before the law was passed, and below a new 21 percent corporate income tax rate.\nTo knock their taxes even lower, experts said, multinationals could have leeway to shift foreign earnings into the 8 percent tax bracket and out of the 15.5 percent bracket.\n\"Even before the legislation was unveiled in November, multinationals were planning to convert cash to non-cash assets, although it wasn't entirely clear what would constitute cash for this purpose,\" said Reuven Avi-Yonah, a leading tax expert at the University of Michigan Law School.\nThe loophole that makes the bracket-shifting possible involves a formula for calculating how much foreign earnings are subject to the higher tax rate. The benchmark is a company's foreign cash position, calculated as the greater of either the average of the past two tax years, or the cash balance at the end of the last tax year begun before Jan. 1, 2018.\nCompanies would pay the 15.5 percent rate on sums up to the calculated foreign cash position. Anything over that would get the 8 percent rate.\nShay said some multinationals could reduce their cash positions, and the amount of money subject to the higher rate, through legitimate distributions including dividend payments.\nHe estimated Apple could have as much as $289 billion in foreign cash at the end of its current fiscal year on Sept. 30. Averaged across the last two tax years, the figure would be $234 billion.\nTo avoid paying 15.5 percent on the higher of those two figures, he said, Apple could distribute some of its cash through dividends or other means. Reducing its 2018 position by $55 billion to the lower, two-year average would save the company more than $4 billion in taxes, according to Shay.\nThe new law says transactions meant principally to reduce taxes due on foreign profits can be disregarded by U.S. tax authorities. But tax experts said this anti-abuse measure does not apply automatically and that corporate tax lawyers could argue it does not apply to legitimate corporate actions.", "external_links": [], "published": "2018-01-12T17:20:00.000+02:00", "crawled": "2018-01-12T17:26:58.004+02:00", "highlightTitle": ""}