{"organizations": [], "uuid": "dcc32fcbb657a5a36c9381a279eddaa86a5477e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "The DJ Who Groped Taylor Swift Has Landed a New Job in Mississippi – Fortune", "url": "http://fortune.com/2018/01/31/dj-groped-taylor-swift-new-job-sexual-harassment/", "country": "US", "domain_rank": 1196, "title": "The DJ Who Groped Taylor Swift Has Landed a New Job in Mississippi", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T13:06:00.000+02:00", "replies_count": 0, "uuid": "dcc32fcbb657a5a36c9381a279eddaa86a5477e8"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/31/dj-groped-taylor-swift-new-job-sexual-harassment/", "ord_in_thread": 0, "title": "The DJ Who Groped Taylor Swift Has Landed a New Job in Mississippi", "locations": [], "entities": {"persons": [{"name": "taylor swift", "sentiment": "negative"}, {"name": "mueller", "sentiment": "none"}, {"name": "melinda gates", "sentiment": "none"}, {"name": "larry fuss", "sentiment": "none"}, {"name": "david mueller", "sentiment": "none"}], "locations": [{"name": "mississippi", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "jackson & jonbob", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the latest sign that sexual harassment isn't always career-ending, the DJ who groped Taylor Swift has landed a new job. \nJust six months after a jury sided with Taylor Swift, DJ David Mueller has been named the new co-host of the morning show Jackson & Jonbob at a Mississippi radio station. The station's CEO Larry Fuss has defended the decision, while admitting that \"maybe a tiny bit\" of the hiring decision came from a desire for publicity. \nRead: Melinda Gates on Stopping Harassment in Tech: ‘We Need LPs to Step Up’ \nSwift had alleged that Mueller groped her bare butt following a 2013 meet and greet at a Denver radio station. Mueller sued the artist for $3 million, claiming defamation and blaming her for his firing from the station. Swift countersued for a symbolic $1 to show other women \" you can always say no ,\" claiming assault and battery. She won a civil trial by jury. \nYet despite the highly public nature of the case, Mueller has escaped relatively unscathed. And Mueller isn't the only man involved in a sexual abuse or harassment case who has landed on his feet--at least temporarily--in recent months. \nRead: Wynn Resorts Loses $3.5 Billion After Sexual Harassment Allegations Surface About Steve Wynn \nAs recently as this week, news has emerged that a Reuters editor was able to get a senior position at Newsweek months after a subordinate at Reuters filed a complaint accusing him of sexually harassing her (he was subsequently put on leave from Newsweek when the Reuters case came to light) . The Red Cross, too, reportedly forced an executive out after he was accused of sexual harassment--and then failed to disclose that information when he went on to get a job at Save the Children . ", "external_links": [], "published": "2018-01-31T13:06:00.000+02:00", "crawled": "2018-01-31T13:07:07.006+02:00", "highlightTitle": ""}