{"organizations": [], "uuid": "bb2d4bfff8ae37e62f6d3723e6732158d4628a2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952919-RTX3KLLO.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/new-health-division-to-protect-workers-objecting-to-doing-abortions.html", "country": "US", "domain_rank": 767, "title": "Feds to create unit to protect health workers objecting to doing abortions, treating transgendered", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T17:38:00.000+02:00", "replies_count": 0, "uuid": "bb2d4bfff8ae37e62f6d3723e6732158d4628a2e"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/new-health-division-to-protect-workers-objecting-to-doing-abortions.html", "ord_in_thread": 0, "title": "Feds to create unit to protect health workers objecting to doing abortions, treating transgendered", "locations": [], "entities": {"persons": [{"name": "eric hargan addr", "sentiment": "negative"}, {"name": "jonathan ernst", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "hhs", "sentiment": "negative"}, {"name": "reuters acting secretary of health and human services", "sentiment": "negative"}, {"name": "department of health and human services", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The federal Department of Health and Human Services is creating a \"Conscience and Religious Freedom Division\" as part of an effort to protect health workers who object on moral grounds to performing abortions or treating transgender people.\nThe division, whose details were announced Thursday morning, is being met with strong objections from some health-worker organizations, as well from as abortion-rights and LGBT activists.\nThe announcement comes a day before President Donald Trump is set to become the first sitting president to address the anti-abortion March for Life in Washington. \nHHS said the new division, which will be contained within its existing Office for Civil Rights, will specialize \"in enforcement of and compliance with laws that protect conscience and the free exercise of religion, and that prohibit coercion and religious discrimination,\" according to the agency's website.\n\"President Trump promised the American people that his administration would vigorously uphold the rights of conscience and religious freedom. That promise is being kept today,\" said acting HHS Secretary Eric Hargan. \"The Founding Fathers knew that a nation that respects conscience rights is more diverse and more free, and OCR's new division will help make that vision a reality.\"\nHHS' civil rights office is headed by Richard Severino, a long-time advocate for religious groups and a critic of providing services to transgender patients to help them transition.\n\"Laws protecting religious freedom and conscience rights are just empty words on paper if they aren't enforced,\" Severino said in a statement.\n\"No one should be forced to choose between helping sick people and living by one's deepest moral or religious convictions, and the new division will help guarantee that victims of unlawful discrimination find justice,\" he added.\n\"For too long, governments big and small have treated conscience claims with hostility instead of protection, but change is coming and it begins here and now.\"\nDavid Christensen, vice president of government affairs of the Family Research Council, praised the action in comments to The Washington Post .\n\"We think the Trump administration should set an example in enforcing the multiple conscience laws that have been passed since the 1970s to prevent the government from punishing people who have objections to participating in abortions,\" he told the Post.\nBut Dr. Ben Brown, an OB-Gyn in Chicago and a fellow with Physicians for Reproductive Health, told CNBC he objected, saying it could have a negative effect on patients by leading to unnecessary delays in urgent care needs.\n\"And that causes harm,\" Brown said.\nOn Wednesday night, the left-leaning Center for American Progress released a new report and survey that the group said shows how the Trump administration's move \"will result in blatant discrimination that prevents LGBT people from getting the care they need.\"\n\"Among transgender people, 29 percent of those surveyed said a doctor or health care provider refused to see them because of their gender identity,\" the center said. \"Another 12 percent said a health care provider refused to give them care related to gender transition.\"\nThe survey also found that 8 percent of LGBTQ respondents who had visited a doctor or health-care provider in the prior year said that a provider refused to see them because of their actual or perceived sexual orientation.\n\"All people who need medical care should be able to see their doctor without worrying about being mistreated, harassed, or denied service outright,\" the report said.\n\"The Affordable Care Act (ACA) helped address this issue by prohibiting health care providers and insurance companies from engaging in discrimination. As a result of several court rulings and an Obama administration rule, LGBTQ people are explicitly protected against discrimination in health care on the basis of gender identity and sex stereotypes. However, conservative forces and the Trump-Pence administration are seeking to make it easier for health care providers to discriminate against LGBTQ people and women.\"", "external_links": [], "published": "2018-01-18T17:38:00.000+02:00", "crawled": "2018-01-18T17:44:33.008+02:00", "highlightTitle": ""}