{"organizations": [], "uuid": "e7f8878d78fee4908380480690037f3364b5758c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 35, "shares": 35, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952669-GettyImages-905976974.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/sec-devoting-significant-portion-of-resources-for-catching-cryptocurrency-scams.html", "country": "US", "domain_rank": 767, "title": "SEC devoting 'significant' portion of resources for catching cryptocurrency scams", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T18:02:00.000+02:00", "replies_count": 0, "uuid": "e7f8878d78fee4908380480690037f3364b5758c"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/sec-devoting-significant-portion-of-resources-for-catching-cryptocurrency-scams.html", "ord_in_thread": 0, "title": "SEC devoting 'significant' portion of resources for catching cryptocurrency scams", "locations": [], "entities": {"persons": [{"name": "j. christopher giancarlo", "sentiment": "none"}, {"name": "jack guez", "sentiment": "none"}, {"name": "jay clayton", "sentiment": "none"}], "locations": [], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold SEC devoting 'significant' portion of resources for catching cryptocurrency scams \"The SEC is devoting a significant portion of its resources to the ICO market,\" commission chairman, Jay Clayton, and J. Christopher Giancarlo, chairman of the Commodity Futures Trading Commission, write in a commentary piece in The Wall Street Journal. The commentary piece also makes it clear the SEC isn't making much distinction between security and utility tokens, and that securities law applies to at least some cryptocurrencies. \"The SEC will vigorously pursue those who seek to evade the registration, disclosure and antifraud requirements of our securities laws,\" the piece says. SHARES Jack Guez | AFP | Getty Images \nThe U.S. Securities and Exchange Commission wants to bring sales of new digital tokens, or initial coin offerings, under its authority. \n\"The SEC is devoting a significant portion of its resources to the ICO market,\" commission chairman, Jay Clayton, and J. Christopher Giancarlo, chairman of the Commodity Futures Trading Commission, wrote in a commentary piece published late Wednesday in The Wall Street Journal. \n\"Through statements, reports and enforcement actions the SEC has made it clear that federal securities laws apply regardless of whether the offered security—a purposefully broad and flexible term—is labeled a 'coin' or 'utility token' rather than a stock, bond or investment contract.\" \nInitial coin offerings, or ICOs, are fundraisers for projects based on the same blockchain technology as digital currency bitcoin . The token sales took off last summer and have raised more than $3.7 billion, more than twice the venture capital investment in blockchain projects, according to estimates from Ernst & Young . But the firm also found that more than 10 percent of ICO funds have been lost to hackers, and U.S. residents are officially banned from participating in many token sales. \nICO investors buy new coins in the expectation they will either rise in price like an investment asset, or at least provide a \"utility\" — access to a new technological platform. While the developers agree that investment assets may require SEC oversight, they have tended to make the case for why utility tokens do not. \nBut the commentary piece makes it clear the SEC isn't making much distinction, and that securities law applies to at least some cryptocurrencies. \n\"The SEC will vigorously pursue those who seek to evade the registration, disclosure and antifraud requirements of our securities laws,\" the piece said. \"In addition, the SEC is monitoring the cryptocurrency-related activities of the market participants it regulates, including broker-dealers, investment advisers and trading platforms.\" \nThe SEC has become tougher on initial coin offerings. In July, the commission used a case study to indicate that securities law may apply to digital coin offerings and issued an investor warning. In September, the SEC launched a cyber unit to increase enforcement on cyber-based threats to retail investors, including ICO fraud. The commission has also temporarily suspended trading in some tiny stocks due to questions about the companies' claims around initial coin offerings or other token-related announcements. \nBut increased SEC oversight doesn't necessarily spell doom for ICOs, which are banned completely in China. Several leaders in the digital currency world expect increased regulation on cryptocurrencies and related business models will help the industry to mature. \n\"The willingness to pursue the commercialization of innovation is one of America's great strengths,\" the commission chairmen said, noting that \"some of the dot-com survivors are among the world's leading companies today.\" \n\"This longstanding, uniquely American characteristic is the envy of the world. Our regulatory efforts should embrace it.\" ", "external_links": [], "published": "2018-01-25T18:02:00.000+02:00", "crawled": "2018-01-25T18:21:12.006+02:00", "highlightTitle": ""}