{"organizations": [], "uuid": "e328649fa4b1a73b254cdc4da383180c769afc0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104878135-GettyImages-464260886-dominos-pizza.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/cold-weather-warms-up-shares-of-dominos-pizza-and-vf-corp.html", "country": "US", "domain_rank": 767, "title": "Cold weather burst could lift shares of Domino's Pizza and North Face maker, history shows", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T23:24:00.000+02:00", "replies_count": 0, "uuid": "e328649fa4b1a73b254cdc4da383180c769afc0d"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/cold-weather-warms-up-shares-of-dominos-pizza-and-vf-corp.html", "ord_in_thread": 0, "title": "Cold weather burst could lift shares of Domino's Pizza and North Face maker, history shows", "locations": [], "entities": {"persons": [{"name": "craig warga", "sentiment": "negative"}, {"name": "kensho", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "jersey city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "domino's pizza and north face", "sentiment": "neutral"}, {"name": "netflix", "sentiment": "none"}, {"name": "national weather service", "sentiment": "none"}, {"name": "home depot", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "vf corp", "sentiment": "none"}, {"name": "autozone", "sentiment": "none"}, {"name": "north face", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Craig Warga | Bloomberg | Getty Images An employee takes an order on the phone at a Domino's Pizza in Jersey City, New Jersey. \nCold weather may be unbearable for some people, but it usually means more money for investors in Netflix and North Face maker VF Corp. \nCNBC analysis using Kensho found that Netflix and VF Corp . shares have averaged a gain of 35 percent and 7 percent, respectively, between Nov. 30 and March 31 over the past 10 years. The analysis also found that both stocks have traded positive 80 percent and 100 percent, respectively, in that time period. \nOther stocks that have kept investors warm during the cold winter include Home Depot, Domino's Pizza and Autozone . Both Home Depot and Autozone have averaged a return of 11 percent during the last 10 winters, while Domino's has averaged a 24 percent gain. \nThe East Coast of the U.S. is experiencing frigid conditions and temperatures are expected to drop further throughout the week. \nThe National Weather Service issued winter storm watches and warnings on Wednesday from north central Florida through Eastern New England. The service also said an area of low pressure will move up the Atlantic Coast Thursday and Friday. Here's what to buy if it gets really cold \nCNBC found that some travel and retail stocks tend to outperform the market when the U.S. is hit by cold wave, which is a rapid fall in temperature during a 24-hour period. \nPriceline shares have gained an average of 9.1 percent one month after an official cold wave (as determined by the National Weather Service) strikes since 1997, while Royal Caribbean climb an 7.9 percent. The cold weather likely gets people to travel to warmer locales or at least start planning to do so. \nOther stocks that perform well following such weather events are Target and Macy's. Target's average return after a cold wave is 6.6 percent, while Macy's averages a return of 6.3 percent. Warm winters could hurt department stores by leaving a lot of cold weather clothes inventory on the books. The S&P 500 meanwhile, has averaged a return of 2.2 percent in these instances dating back to 1997. \nNatural gas stocks, meanwhile, have lagged the market after a cold wave hits the U.S. \nShares of Concho Resources has averaged a decline of 15.2 percent after the last five cold waves dating back to 1997. Newfield Exploration, Chesapeake Energy, and Transocean have also averaged declines of more than 10 percent. Anadarko Petroleum shares, meanwhile, have fallen an average of 9 percent, according to Kensho. \nWhen there is frigid weather, sometimes natural gas companies are forced to close down their wells. \nDisclosure: NBCUniversal, parent of CNBC, is a minority investor in Kensho. \n—CNBC's Dominic Chu and Gina Francolla contributed to this report.", "external_links": [], "published": "2018-01-03T23:24:00.000+02:00", "crawled": "2018-01-03T23:36:02.027+02:00", "highlightTitle": ""}