{"organizations": [], "uuid": "9a709ea8ea4d48cbb762ff911514f5842d4db1da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/31/103906188-GettyImages-583805636.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/stocks-making-the-biggest-moves-premarket-juno-celg-aig-hal-bivv-adm-dnkn-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: JUNO, CELG, AIG, HAL, BIVV, ADM, DNKN & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T14:44:00.000+02:00", "replies_count": 0, "uuid": "9a709ea8ea4d48cbb762ff911514f5842d4db1da"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/stocks-making-the-biggest-moves-premarket-juno-celg-aig-hal-bivv-adm-dnkn-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: JUNO, CELG, AIG, HAL, BIVV, ADM, DNKN & more", "locations": [], "entities": {"persons": [{"name": "hal", "sentiment": "negative"}, {"name": "archer daniels midland", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "celg", "sentiment": "negative"}, {"name": "adm", "sentiment": "negative"}, {"name": "aig", "sentiment": "negative"}, {"name": "bunge", "sentiment": "none"}, {"name": "halliburton", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sanofi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nCheck out which companies are making headlines before the bell: \nAIG – The insurance company announced a deal to buy Bermuda-based reinsurer Validus for $5.56 billion in cash or $68 per share . AIG said the deal would be immediately accretive to its earnings. \nHalliburton – The oilfield services company reported adjusted quarterly profit of 53 cents per share , seven cents a share above estimates. Revenue beat forecasts, as well, and Halliburton made optimistic comments about the coming year, based in part on more solid commodity pricing. \nBioverativ – Bioverative is soaring in premarket trading after the U.S. hemophilia treatment specialist agreed to be bought by French drugmaker Sanofi for $11.6 billion in cash, or $105 per share. \nArcher Daniels Midland – The grain processor is proposing a buyout of agricultural commodities supplier Bunge , according to The Wall Street Journal and Reuters. Bunge – which has also drawn interest from Swiss agriculture company Glencore – is said to be keeping its options open. Glencore is prevented from making a new offer for Bunge until next month, stemming from a previous standstill agreement. \nDunkin' Brands – William Blair upgraded the restaurant operator's stock to \"outperform\" from \"market perform,\" saying the company has put enough innovations in place to drive sales higher. \nHarley-Davidson – Wells Fargo upgraded the motorcycle maker's stock to \"outperform\" from \"market\" perform. Wells Fargo doesn't feel the secular decline in motorcycle sales has ended, but said investors may not be appreciating the benefits of tax reform to the company. \nTwitter — Twitter executive Anthony Noto has been offered the CEO job at Social Finance, according to a source who spoke to CNBC. Noto is currently in talks with SoFi about the job, according to people familiar with the matter. The paper said Noto may turn down that offer and that Twitter might make an extra effort to keep him, given that CEO Jack Dorsey is splitting his time between Twitter and Square . \nWal-Mart – The retailer is in talks with a number of buyout firms to sell a major stake in its Brazilian operations, according to Reuters citing people familiar with the matter. \nXerox – Xerox is being pushed to explore a sale by investor Carl Icahn and major Xerox shareholder Darwin Deason, according to the Wall Street Journal. Icahn and Deason together control more than 15 percent of the office equipment maker's shares. \nUBS – UBS is proposing a dividend increase and new share buyback program, even as the Swiss bank takes a multibillion writedown relating to the new U.S. tax law. \nMicrosoft – Microsoft sales in Russia are being crimped by new restrictions related to U.S. sanctions against that country, according to a Reuters report. \nApple – Apple was downgraded to \"neutral\" from \"overweight\" at Atlantic Equities, citing signs of softening iPhone demand. \nEli Lilly – The drugmaker's stock was downgraded to \"underperform\" from \"neutral\" at Credit Suisse, which points to concerns about the outlook for diabetes treatments Trulicity and Humalog. Peter Schacknow Senior Producer, CNBC Related Securities", "external_links": [], "published": "2018-01-22T14:44:00.000+02:00", "crawled": "2018-01-22T14:54:16.083+02:00", "highlightTitle": ""}