{"organizations": [], "uuid": "a397290584cac726be7ec76eb17894ab2940a63e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://search.cnbc.com/rs/search/all/view.rss?partnerId=2000&keywords=agriculture&sort=date&minimumrelevance=0.2&pubtime=30&pubfreq=d&categories=exclude", "section_title": "CNBC.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-grains-soybeans-steady-after-3-day-drop-as-usda-report-nears.html", "country": "US", "domain_rank": 767, "title": "GRAINS-Soybeans steady after 3-day drop as USDA report nears", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T15:02:00.000+02:00", "replies_count": 0, "uuid": "a397290584cac726be7ec76eb17894ab2940a63e"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/reuters-america-grains-soybeans-steady-after-3-day-drop-as-usda-report-nears.html", "ord_in_thread": 0, "title": "GRAINS-Soybeans steady after 3-day drop as USDA report nears", "locations": [], "entities": {"persons": [{"name": "naveen thukral publishe", "sentiment": "negative"}, {"name": "gus trompiz", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "usda", "sentiment": "negative"}, {"name": "u.s. department of agriculture", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAINS-Soybeans steady after 3-day drop as USDA report nears Gus Trompiz and Naveen Thukral Published 6 Hours Ago \n* Soybeans tick up after three-day fall \n* USDA expected to raise U.S. soy stocks outlook on Friday \n* Wheat eases after gains on expected fall in U.S. acreage \n* Subdued grain market also eying weekly U.S. export sales \n(Updates with European trading, changes byline/dateline) PARIS/SINGAPORE, Jan 11 (Reuters) - Chicago soybean futures edged higher on Thursday as the market paused following three sessions of declines and ahead of U.S. government crop data expected to show rising stocks. Wheat dipped for the first time in three sessions as traders weighed up the prospect of a further drop in U.S. wheat sowings against stiff export competition in a well supplied global market. Corn was almost unchanged. Grain markets are bracing for crop reports from the U.S. Department of Agriculture on Friday, with analysts notably expecting the USDA to boost U.S. soybean stocks after a record-large harvest and faltering exports. Investors were also awaiting weekly U.S. export sales data at 1330 GMT for an update on overseas demand. The Chicago Board Of Trade most-active soybean contract edged up a quarter of a cent to $9.55-1/4 a bushel by 1244 GMT. On Wednesday, prices hit their lowest since Dec. 22 at $9.51-3/4. \"U.S. soybean exports are surprisingly slow and I think it is because of quality issues,\" said one India-based agricultural commodities analyst at an international bank. \"It is difficult for U.S. soybean exports to recover now as Brazilian new-crop supplies will hit the market at the beginning of February.\" Brazilian soybean output is expected to reach 114 million tonnes in 2017/18, almost matching last year's record crop, consultancy AgRural said. CBOT wheat inched down 0.5 percent to $4.32-1/4 a bushel, consolidating after a near-one week high touched during the previous session. Corn ticked up 0.1 percent to $3.49-1/4 a bushel. Expectations that the USDA will peg U.S. winter wheat seedings below last season's level in its first estimate on Friday have lent some support to wheat prices following recent weather concerns in the U.S. Plains. However, weather risks were not seen as severe enough to shake up a global market with large inventories and strong export competition led by Russia. Farming agency FranceAgriMer lowered its forecast for French soft wheat exports outside the EU this season for a third straight month on Wednesday, predicting 9.3 million tonnes versus 9.5 million last month. \"This number looks optimistic considering the current pace of shipments and the large volumes exported by Russia, added to the high competitiveness of Argentinian origins,\" consultancy Agritel said in a note. \nPrices at 1244 GMT \nLast Chang Pct End Ytd Pct e Move 2017 Move CBOT wheat 432.25 -2.00 -0.46 427.00 1.23 CBOT corn 349.25 0.25 0.07 350.75 -0.43 CBOT soy 955.25 0.25 0.03 961.75 -0.68 Paris wheat Mar 161.00 0.00 0.00 159.00 1.26 Paris maize Mar 158.75 -0.50 -0.31 157.75 0.63 Paris rape Feb 354.50 -3.00 -0.84 347.75 1.94 WTI crude oil 63.93 0.36 0.57 60.42 5.81 Euro/dlr 1.20 0.00 0.42 \nMost active contracts - Wheat, corn and soy US cents/bushel, Paris futures in euros per tonne \n(Reporting by Naveen Thukral in Singapore and Gus Trompiz in Paris; editing by Richard Pullin and David Evans)", "external_links": [], "published": "2018-01-11T15:02:00.000+02:00", "crawled": "2018-01-11T21:24:30.010+02:00", "highlightTitle": ""}