{"organizations": [], "uuid": "c54114c0b079f327100aff850fce0b316a2dcb4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/12/23/101292651-178663804.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/rolls-royce-shares-jump-as-commercial-marine-unit-goes-on-the-block.html", "country": "US", "domain_rank": 767, "title": "Rolls-Royce shares jump as commercial marine unit goes on the block", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T16:42:00.000+02:00", "replies_count": 0, "uuid": "c54114c0b079f327100aff850fce0b316a2dcb4a"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/rolls-royce-shares-jump-as-commercial-marine-unit-goes-on-the-block.html", "ord_in_thread": 0, "title": "Rolls-Royce shares jump as commercial marine unit goes on the block", "locations": [], "entities": {"persons": [{"name": "warren east", "sentiment": "none"}, {"name": "ralph orlowski", "sentiment": "none"}, {"name": "warren west", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "getty images  britain", "sentiment": "none"}], "organizations": [{"name": "rolls-royce", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Britain's Rolls-Royce said on Wednesday it was considering the sale of its commercial marine business, which has been hit by weak demand in offshore oil and gas markets, as part of a restructuring of the company into three core units.\nShares in the company jumped after it said the loss-making unit could be sold. They were trading up 7.2 percent at 1330 GMT.\nThe announcement came as part of a restructuring of the aero-engine maker into civil aerospace, defense and power systems units, with naval marine and nuclear submarines consolidated into defense and civil nuclear into power systems.\nChief Executive Warren East said the latest overhaul would enable the company to respond quicker to meet the needs of its customers, both in the wide body civil aviation market and in defense, as well as reduce costs.\n\"It will create a Defense operation with greater scale in the market, enabling us to offer our customers a more integrated range of products and services,\" he said.\n\"It will also strengthen our ability to innovate in core technologies and enable us to take advantage of future opportunities in areas such as electrification and digitalization.\"\nRolls-Royce had responded to the downturn in oil and gas markets since 2015 by reducing the number of sites in its marine business from 27 to 15, and cutting the unit's workforce by 30 percent to 4,200, with the majority now based in the Nordic region.\nNonetheless, the marine unit generated a loss of 27 million pounds on sales of 1.1 billion pounds in 2016, with the bulk of the business supplying equipment and vessel design across the oil and gas, merchant and other commercial markets.\nEast said the business \"responded admirably\" to the downturn by cutting its cost base, and had also carved out an industry-leading position in ship intelligence and autonomous shipping.\n\"It is only right that we consider whether its future may be better served under new ownership,\" he said.", "external_links": [], "published": "2018-01-17T16:42:00.000+02:00", "crawled": "2018-01-17T16:50:07.005+02:00", "highlightTitle": ""}