{"organizations": [], "uuid": "fc4a92de9dab59113f166421552bd6dca80c403c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/27/103973226-GettyImages-563574597.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/02/one-big-biotech-stock-looks-poised-for-a-breakout-in-2018-technician.html", "country": "US", "domain_rank": 767, "title": "One big biotech stock looks poised for a breakout in 2018, technician says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-02T21:15:00.000+02:00", "replies_count": 0, "uuid": "fc4a92de9dab59113f166421552bd6dca80c403c"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/one-big-biotech-stock-looks-poised-for-a-breakout-in-2018-technician.html", "ord_in_thread": 0, "title": "One big biotech stock looks poised for a breakout in 2018, technician says", "locations": [], "entities": {"persons": [{"name": "gordon", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "todd gordon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "biogen", "sentiment": "none"}, {"name": "amgen", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "spdr s&p biotech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This year could prove to be another big year for biotech stocks after an impressive run in 2017.\nThe SPDR S&P Biotech exchange-traded fund ( XBI ), was among the best-performing U.S.-listed ETFs last year, with a 43 percent annual gain. The only ETF that outperformed it was the iShares U.S. Home Construction ETF.\nA handful of the names in the XBI saw double-digit and even triple-digit gains: Shares of Biogen and Amgen jumped 22 percent and 19 percent, respectively, while Juno Therapeutics surged 142 percent.\nAmgen appears to be setting up for a bigger breakout in 2018, said Todd Gordon, technician and founder of TradingAnalysis.com.\n\"Amgen looks to be pretty well-poised here, hanging just above the $200 region. We have a long-term consolidation. If you wanted to do a little bit of Elliott wave analysis, you would say this was a wave 4, moving up to wave 5, which should carry up into the $220 to $240 region in 2018,\" Gordon said Friday on CNBC's \" Trading Nation ,\" referring to a classic technical analysis theory. \"So I'd say, watch Amgen.\"\nOn a longer-term chart of the XBI, Gordon said its underperformance relative to technology stocks was beginning to show signs of a bottom, so the broader space could continue seeing strength.\nFrom a fundamental perspective, this year's winners could be last year's laggards, said Larry McDonald, publisher of the Bear Traps Report. For McDonald, names such as Celgene , Gilead and Regeneron — which were laggards last year, either barely positive or negative on the year — should see turnarounds in the months ahead.\n\"I think that's the way to play biotech in the first half of 2018. The dogs of 2017 should be the substantial outperformers in the first half of 2018,\" he said Friday on \"Trading Nation.\"\nWhile the risks surrounding policy impacting drug pricing — and by extension, stocks' performance — have been concerns in years prior, McDonald doesn't think that will be a huge factor this year as the Trump administration focuses on tax reform, housing policy and immigration.\n\"We're not going to see much in terms of moving the needle until 2019, coming out of Washington, for healthcare and for the biotech sector,\" he said.\nThe XBI began 2018 on a high note, rising more than 1 percent on Tuesday.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-02T21:15:00.000+02:00", "crawled": "2018-01-02T21:52:26.001+02:00", "highlightTitle": ""}