{"organizations": [], "uuid": "00531afa2dca74ee64825416f1607d90b4157ac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 534, "shares": 534, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222891596&w=1200&r=LYNXMPEE0H04E", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/south-koreas-financial-regulator-says-considering-shutting-down-all-virtual-currency-exchanges-idUSKBN1F706T", "country": "US", "domain_rank": 408, "title": "South Korea's financial regulator says considering shutting down all virtual currency exchanges", "performance_score": 5, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T03:49:00.000+02:00", "replies_count": 0, "uuid": "00531afa2dca74ee64825416f1607d90b4157ac9"}, "author": "", "url": "https://www.reuters.com/article/us-southkorea-bitcoin/south-koreas-financial-regulator-says-considering-shutting-down-all-virtual-currency-exchanges-idUSKBN1F706T", "ord_in_thread": 0, "title": "South Korea's financial regulator says considering shutting down all virtual currency exchanges", "locations": [], "entities": {"persons": [{"name": "choi jong-ku", "sentiment": "none"}, {"name": "dahee kim", "sentiment": "none"}, {"name": "michael perry", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "financial services commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:49 AM / Updated 17 hours ago South Korea considers shutting down domestic cryptocurrency exchanges Dahee Kim , Cynthia Kim 3 Min Read \nSEOUL (Reuters) - South Korean policymakers joined the global chorus of virtual-coin critics on Thursday, saying Seoul is considering shutting down domestic virtual currency exchanges as the new breed of market exposes users to speculative frenzy and crime. \nThe country’s tough stance comes as policymakers from the United States to Germany struggle to come up with stricter regulation against money laundering and other crimes. \nResponding to questions in parliament, South Korea’s chief of the Financial Services Commission said: “(The government) is considering both shutting down all local virtual currency exchanges or just the ones who have been violating the law.” \nSeparately, Bank of Korea Governor Lee Ju-yeol told a news conference that “cryptocurrency is not a legal currency and is not being used as such as of now.” \nRegulators around the world are still debating how to address risks posed by cryptocurrencies, as bitcoin, the world’s most popular virtual currency, soared more than 1,700 percent last year. \nPrices have plummeted since South Korea announced last week it may ban domestic cryptocurrency exchanges. On Wednesday, bitcoin slid 18 percent. \nAccording to Bithumb, South Korea’s second-largest virtual currency exchange, the nation’s bitcoin trading price stood at 15,697,000 won ($14,690.69) as of 0314 GMT on Thursday. \nOn the Luxembourg-based Bitstamp exchange, bitcoin was traded at $11,750. \nHong Nam-ki, minister of the office for government policy co-ordination, said that opinions on cryptocurrency trading are sharply divided within the government, but vowed to make a decision on regulations during Thursday’s parliamentary session. \nSouth Korea’s justice minister said last week the ministry was preparing a bill to ban cryptocurrency trading, which sent bitcoin prices sharply lower and threw the market into turmoil. \nThe shift toward tighter regulation sparked strong reaction from many South Koreans, thousands of whom signed a petition on the website of the presidential Blue House to stop a ban on cryptocurrency trading. \nOn Thursday, the BOK governor said the central bank had begun looking into the market’s impact on the economy. \n“We have started looking at virtual currency from a long-term standpoint, as central banks could start issuing digital currencies in the future. This sort of research has begun at the Bank of International Settlements and we are part of that research.” Additional reporting by Christine Kim; Editing by Sam Holmes and Jacqueline Wong", "external_links": [], "published": "2018-01-18T03:49:00.000+02:00", "crawled": "2018-01-18T04:09:23.008+02:00", "highlightTitle": ""}