{"organizations": [], "uuid": "cf7ee9158bbd4ab2a9eacc600b1e7c6060da7ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104947930-GettyImages-840964198.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/vanguard-wisdomtree-ishares-etfs-may-beat-sp-500-in-2018.html", "country": "US", "domain_rank": 767, "title": "If you want to beat S&P 500 in 2018, these 4 international ETFs may do it", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T13:19:00.000+02:00", "replies_count": 0, "uuid": "cf7ee9158bbd4ab2a9eacc600b1e7c6060da7ad0"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/vanguard-wisdomtree-ishares-etfs-may-beat-sp-500-in-2018.html", "ord_in_thread": 0, "title": "If you want to beat S&P 500 in 2018, these 4 international ETFs may do it", "locations": [], "entities": {"persons": [{"name": "gary hershorn", "sentiment": "negative"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "negative"}, {"name": "getty images  home", "sentiment": "neutral"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "s&p capital iq", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home stock market bias remains strong in the United States, but more investors opened portfolios to international equities last year. Roughly $150 billion went into international exchange-traded funds in 2017, compared to just $16 billion the year before. Investors who diversified overseas were rewarded with performance in both developed markets ex-U.S. and emerging markets that rivaled returns from the Dow and S&P 500. The MSCI All Country World Index finished last year up about 21.5 percent, outperforming the S&P 500's 19 percent return, according to S&P Capital IQ data.\nWith the backdrop for global growth continuing to be positive — with relatively low interest rates and strong consumer confidence — the case for global equities remains strong, in particular for investors yet to make the move at all. So far, the All Country World Index has outperformed the S&P 500 in January by more than one percentage point and, if the experts are right — Goldman Sachs and JP Morgan research predicts greater gains for emerging markets than the S&P 500 in 2018 — global stocks could again beat the U.S. market. Even if the performance doesn't match last year's torrid pace, international stock diversification helps .\nOne of the easiest ways to own global stocks is through ETFs, which are inexpensive, broadly diversified and easy to buy and sell.\n\"Rather than finding the best ideas yourself or paying a premium to someone else to potentially find the best stocks, you can use an ETF to cover the globe extremely inexpensively,\" said Todd Rosenbluth, senior director of ETF and mutual fund research at CFRA Research.\nThey are also more tax efficient than mutual funds because turnover is low, creating fewer taxable events, like the triggering of capital gains.\nshow chapters Global growth pushes emerging markets to best year since 2009 2:51 PM ET Wed, 27 Dec 2017 | 01:22 But which ones should you buy? There are so many ETFs to choose from, and just because a hot sector or country ETF did well — such as the WisdomTree China ex-State Owned Enterprises fund ( CXSE ) and the Kranshares CSI China Internet ETF ( KWEB ), up 79 percent and 67 percent, respectively, in 2017 — doesn't mean they will do it again.\nInstead, investors should buy funds that will do well over the long term, Rosenbluth said. They should have relatively low expense ratios and provide diversified exposure to markets that would be difficult for investors to navigate on their own.\nFor investors looking to add global exposure to their portfolios in 2018 — and still strong returns at a low cost — then consider starting with these four funds, recommended by experts at Morningstar and CFRA Research.\nVanguard Total International Stock ETF (VXUS) Investors looking for broad-based international exposure should consider this Vanguard favorite, said Alex Bryan, Morningstar's director of passive strategies. It has $321 billion in assets under management and holds stocks of all sizes in about 48 countries.\nWhile Japan and the U.K. are the two largest country holdings in VXUS — at 17.7 percent and 12.3 percent of its assets, respectively — the rest of its assets are fairly spread out around the world. \"It blankets the whole market outside of the U.S.,\" said Bryan.\nInvestors will know many of its top 10 holdings, including Tencent , Nestlé , Royal Dutch Shell , Samsung and HSBC . But with 6,267 holdings, there will be a fair number of unfamiliar stocks, too. \"It's widely diversified,\" Bryan said.\nHe's a fan of its 0.11 percent expense ratio. \"The best reason to own this is for its low cost,\" Bryan said, adding that its fee is lower than some of its peers in the foreign large blend category.\nIts 25 percent return in 2017, according to S&P Capital IQ, wasn't too shabby,either. If the global economy continues to do well then this ETF, which is already up 5.2 percent in 2018, could see even better returns in 2018, according to Bryan.\niShares EDGE MSCI Multifactor Intl ETF (INTF) This ETF only came to market two years ago, but with $503 million in assets, it has quickly become a go-to fund for savvier international investors.\nIt's different than the typical global ETF in that it's a smart-beta option , which means it targets stocks with specific characteristics. In this case, that's developed nation companies in the mid-cap and large-cap markets with relatively low valuations (AXA, with a $65 billion market cap, is its largest holding) and strong price momentum. The stocks are also selected based on the quality of being fiscally disciplined companies with a record of rewarding shareholders through dividends. Or to put it in technical terms, quality is based on return on equity (higher is better), debt/equity (lower is better) and earnings growth variability (lower is better). \"This combination of characteristics has historically experienced higher returns over time,\" Bryan said.\nThe Morningstar ETF expert likes this fund because each characteristic works well at different times, which adds another layer of diversification and reduces the risk of longer periods of underperformance. INTF owns stocks in more than 13 countries, including Japan, the U.K, France, Australia and Canada. Top holdings include Hitachi , AXA and Michelin .\nMore from Global Investing Hot Spots:\nChinese private fund investments near a staggering $2 trillion\nCentral banks across globe have bitcoin bubble fever, too\nThe last stock market boom left in the world that doesn't rely on internet\nIt helps that the ETF has performed well against comparable non-smart-beta peers — in 2017 it returned nearly 24 percent, while the iShares MSCI EAFE ETF ( EFA ) climbed by 21 percent, according to S&P Capital IQ. Its expense ratio of 0.30 percent is competitive with more traditional international funds. But the decision shouldn't come down to fund fee alone.\n\"This is for someone who's looking to beat the market and who would choose a more complex strategy and can understand what they're getting,\" Bryan said.\niShares Core Emerging Markets ETF (IEMG) This emerging market fund, which has nearly $46 billion, is ideal for anyone who wants exposure to fast-growing parts of the world but don't want to take on specific country risk. With a 0.14 percent expense ratio, it's cheap, but it's also a strong performer, posting a 34 percent return in 2017.\nRosenbluth likes this ETF because of what's in it ­­­— \"a lot of great non-U.S. companies,\" he said. Its biggest holding, accounting for 4.91 percent, is Tencent Holdings , a high-flying Chinese internet company that's up 122 percent over the past 12 months. It also holds Samsung Electronics , Alibaba Group , Taiwan Semiconductor and several other quickly growing firms.\nWhile this is more diversified than owning a country fund, it does have 28 percent of its assets in China and another 15 percent in South Korea, so you are taking on some more localized risk with this ETF, but that's also why it's doing so well.\n\"It's outperforming because it has exposure to South Korea, which is outperforming the broader emerging market index,\" said Rosenbluth. \"If you want broad emerging market exposure in a low-cost manner, this is a great product to consider.\"\nWisdomTree Emerging Markets SmallCap Dividend Fund (DGS) Investors who want to get a little more granular in their international investing may want to try this small-cap emerging markets dividend fund. With $1.67 billion in assets, m", "external_links": [], "published": "2018-01-18T13:19:00.000+02:00", "crawled": "2018-01-18T13:37:38.041+02:00", "highlightTitle": ""}