{"organizations": [], "uuid": "6f580766922098df7e4ead1f76921cfa5d0b9c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/13/104838601-GettyImages-566064835.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/the-one-action-that-helps-richard-branson-achieve-success.html", "country": "US", "domain_rank": 767, "title": "The one simple action that helps self-made billionaire Richard Branson achieve success", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T18:12:00.000+02:00", "replies_count": 0, "uuid": "6f580766922098df7e4ead1f76921cfa5d0b9c9c"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/the-one-action-that-helps-richard-branson-achieve-success.html", "ord_in_thread": 0, "title": "The one simple action that helps self-made billionaire Richard Branson achieve success", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "branson", "sentiment": "none"}], "locations": [{"name": "virgin trains and virgin america", "sentiment": "none"}], "organizations": [{"name": "pst  branson", "sentiment": "none"}, {"name": "virgin group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For those trying to fulfill their full potential this year, Virgin Group founder and billionaire Richard Branson shares what he does to meet his goals: taking down notes.\n\"I can't tell you where I'd be if I hadn't had a pen on hand to write down my ideas (or more importantly, other people's) as soon as they came to me,\" he wrote in a recent blog post .\n\"Some of Virgin's most successful companies have been born from random moments,\" Branson wrote. \"If we hadn't opened our notebooks, they would never have happened.\"\nDon’t be afraid to dream big in #2018\nA post shared by Richard Branson (@richardbranson) on Jan 3, 2018 at 1:24am PST\nBranson attributed the rise of Virgin's most successful companies, such as Virgin Trains and Virgin America , to his knack for opening up his notebook and writing down the random thoughts that led to those companies' creation.\nThe business mogul warns that \"if you don't write your ideas down, they could leave your head before you even leave the room.\"\nIn Branson's experience, most people in leadership roles don't take notes. In fact, he finds that a lot of people think writing notes is below them, \"but everyone should be doing it as it can greatly improve what you do,\" he said.\nshow chapters This is why self-made millionaire Marcus Lemonis doesn’t make New Year’s resolutions 11:28 AM ET Sat, 30 Dec 2017 | 01:01 Branson recalled a recent time he was in South Africa speaking with the manager of one of his properties. As a result of not taking down notes during their conversation, the manager failed to take action on what he and Branson had previously discussed.\n\"If you don't write things down it's really easy to forget what was said – and often in business, it's the little things that make a big difference to your customer,\" Branson said. \"Keep a notebook in your back pocket to scribble down thoughts or feedback and make sure you follow through on them in a timely fashion.\"\nBranson said he has always made lists of things he wants to achieve as it helps him make sense of his ideas and track his progress.\nFor 2018, Branson's goal is to continue preparing for his space travels through his company Virgin Galactic, according to the post:\nGet unbelievably fit so I'm ready for a trip into space. I'll be doing lots of trekking and biking to get me into top shape. When I finished the Virgin Strive Challenge in 2016 I felt like a 25-year-old again – I hadn't felt that good in 40 years. I'll also be doing some centrifuge g-force training so I'm as acclimatized as I can be for the journey.\nWhile sharing your goals with your family and friends is helpful, Branson noted it's ultimately up to you to follow through. Another trick to making goals is to set both short-term and long-term ones so you can feel a sense of accomplishment along the way, Branson wrote.\n\"If you set daily goals and work through your list every day, you can mark off every completed task with a satisfying tick,\" Branson explained. \"This helps keep you motivated to aim for the big targets.\"\nThat \"satisfying tick\" is one way Branson recommends that you \"celebrate all the little wins,\" but more importantly, continue writing more lists after you meet your goals.\n\"No matter how big, small, simple or complex an idea is, get it in writing. But don't just take notes for the sake of taking notes, go through your ideas and turn them into actionable and measurable goals,\" Branson said.\nLike this story? Like CNBC Make It on Facebook .\nDon't miss:\nThe top 25 US companies to work for if you want to be happier\nHere's how former US president Barack Obama spent his first day out of office nearly a year ago\nshow chapters Richard Branson: This is the most important skill to be successful 9:39 AM ET Thu, 19 Oct 2017 | 00:52 Video produced by Andrea Kramar", "external_links": [], "published": "2018-01-19T18:12:00.000+02:00", "crawled": "2018-01-19T18:23:20.003+02:00", "highlightTitle": ""}