{"organizations": [], "uuid": "4a143d5c8cffc006e73542e8abd616b9942f22da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "All-male CES, Golden Globes, Rebekah Mercer: Broadsheet Dec. 5th – Fortune", "url": "http://fortune.com/2018/01/05/golden-globes-broadsheet-dec-5/", "country": "US", "domain_rank": 1196, "title": "All-male CES, Golden Globes, Rebekah Mercer: Broadsheet Dec. 5th", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T15:24:00.000+02:00", "replies_count": 0, "uuid": "4a143d5c8cffc006e73542e8abd616b9942f22da"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/05/golden-globes-broadsheet-dec-5/", "ord_in_thread": 0, "title": "All-male CES, Golden Globes, Rebekah Mercer: Broadsheet Dec. 5th", "locations": [], "entities": {"persons": [{"name": "rebekah mercer", "sentiment": "negative"}, {"name": "reese witherspoon", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "golden globes", "sentiment": "none"}], "organizations": [{"name": "golden globes", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "All-male CES, Golden Globes, Rebekah Mercer: Broadsheet Dec. 5th Photograph by Getty Images By Kristen Bellstrom 8:24 AM EST \nGood morning, Broadsheet readers! CES still doesn’t have any female keynote speakers, Rebekah Mercer is cutting off Steve Bannon, and Time’s Up will meet the Golden Globes on Sunday. Have a cozy weekend. EVERYONE'S TALKING \n• A golden opportunity . The headlines are full of entertainment news today (more on that below…) and why not? This Sunday is the Golden Globes, one of the most-watched awards shows of the year. Typically the Globes are considered the “fun show,” where celebrities help themselves (liberally) to the champagne, cut loose, and occasionally even go off script. \nBut with the #MeToo movement rocking the entertainment industry, this weekend will likely be a very different type of affair. As part of the Time’s Up initiative that we’ve been covering all week , the actors (both male and female) will be wearing black on the red carpet. While that might seem like a frivolous form of protest, Reese Witherspoon, one of the organizers, told the New York Times : “A show of solidarity at an awards show is one very small piece. It really is a statement that women are deeply unified, we always have been, and that we stand up for those who can’t speak up.” And as Eva Longoria pointed out in the same article, the dresses provide a point of entry to use those typically banal pre-show interviews to talk about real topics like sexual harassment. \nOf course, while harassment and abuse are the most acute problems faced by women in Hollywood, the Globes also point to another critical issue: Despite a number of female-fronted hits, not a single woman was nominated in the best director category this year. And that’s not a fluke: A new study finds that from 2007 to 2017, there’s been no measurable change in the percentage of major movies directed by women or people of color. \nSo while I like watching a tipsy celebrity give a goofy speech as much as the next girl, I’m looking forward to seeing Hollywood seize this moment to get serious. ALSO IN THE HEADLINES \n• CES needs women . Unbelievably, major consumer electronics show CES, which kicks off next week in Las Vegas, will not have any female keynote speakers—for the second year in a row. Not a good look, especially for an industry that is already under fire for its treatment of women. Fast Company \n• Kaplan’s on the case . In this essay from her excellent RaceAhead newsletter ( subscribe here ), my colleague Ellen McGirt looks at the first test case to make use of another aspect of Time’s Up, the crowdfunded legal defense fund: Melanie Kohler, who has been sued for defamation by Brett Ratner after alleging that he sexually assaulted her. Kohler is now being defended by Roberta Kaplan, who successfully argued before the Supreme Court to overturn the Defense of Marriage Act. Fortune \n• A real hero . Denis Mukwege is the founder and lead doctor of the Panzi Foundation in the Democratic Republic of Congo. His hospital has has treated more than 50,000 survivors of sexual violence and over 37,000 patients with gynecological injuries since 1999—and provides survivors with the mental, educational, legal, and financial tools to rebuild their lives. ", "external_links": [], "published": "2018-01-05T15:24:00.000+02:00", "crawled": "2018-01-05T15:24:52.006+02:00", "highlightTitle": ""}