{"organizations": [], "uuid": "a315d6e1157b4e53db47f3ee190dd62eb0f919e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Are You Eating Sustainable Fish? Blockchain May Provide the Answer – Fortune", "url": "http://fortune.com/2018/01/03/blockchain-cryptocurrency-sustainable-fish/", "country": "US", "domain_rank": 1196, "title": "Are You Eating Sustainable Fish? Blockchain May Provide the Answer", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T14:16:00.000+02:00", "replies_count": 0, "uuid": "a315d6e1157b4e53db47f3ee190dd62eb0f919e4"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/03/blockchain-cryptocurrency-sustainable-fish/", "ord_in_thread": 0, "title": "Are You Eating Sustainable Fish? Blockchain May Provide the Answer", "locations": [], "entities": {"persons": [], "locations": [{"name": "fiji", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "wwf", "sentiment": "none"}, {"name": "viant", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Are You Eating Sustainable Fish? Blockchain May Provide the Answer Courtesy: WWF By Jeff John Roberts 7:16 AM EST \nEco-conscious diners can rely on restaurants to tell them their fish comes from a sustainable source, but it can be hard to know for sure. \nThat’s why a new certification system, launched by blockchain company Viant and the World Wild Fund for Nature, is intriguing: It provides a step-by-step way to verify a fish’s journey from the ocean to the market to the dinner plate. \nThe new initiative, announced in late December, is the latest example of how blockchain technology—a type of software that creates a permanent, tamper proof ledger—can transform supply chains and preserve the integrity of the food supply. \nIn the case of sustainable fish, you can see the beginning of the process in the photo above. The picture shows a wild yellowfin tuna caught off the waters of Fiji, which has been tagged with a QR code supplied by Viant. \nThe code means the fish is ready to be be logged into Viant’s blockchain system, which will record its progress to Los Angeles and allow groups like the WWF and its partner SeaQuest to verify the harvest is from a sustainable fishery. \n“It’s immutable, verifiable proof that the yellowfin tuna you got in a restaurant was caught in Fiji, went through X distributor and arrived at the restaurant you’re now eating it today,” said Taylor Mulvihill, co-founder of Viant. \nMulvihill added it is up to the participants to decide what they want to upload to the blockchain and how they want to track the shipment. In the case of the tuna, for instance, the first recording to the blockchain could be a video of the fish being caught, while the distributors could use RFID instead of a QR code to access the ledger. \nAll of this is a reminder that, despite so much silly hype around blockchain right now—the restaurant chain Hooters’ effort to rebrand as a blockchain outfit is just the latest example—the technology is making real progress on the ground. \nIn the case of Viant, which built its Ethereum-based blockchain platform with the help of Microsoft Azure (msft) and the Brooklyn-based incubator ConsenSys, the fish tracking tool is just one use of its technology. \nViant is also providing its tracking services to pharma giant GlaxoSmithKline, which will use it to improve transparency in the licensing process, and to oil and gas companies. Mulvihill says Viant was operating in stealth during a year long trial period, but that all of its users are paying customers. \nViant is not the only one using blockchain technology to remake the supply chain process. Other notable examples include Walmart (wmt) and other retailers, which are using IBM’s Hyperledger Fabric (ibm) to improve food safety safety. \nThere are also promising niche cases. These include a gem service called Everledger that has inscribed more than one million diamonds to a blockchain, helping to eliminate counterfeits and conflict stones. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T14:16:00.000+02:00", "crawled": "2018-01-03T14:16:51.001+02:00", "highlightTitle": ""}