{"organizations": [], "uuid": "0a8a0d5d71c8cad9de1557f38dddb08499c7baa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/18/104661419-GettyImages-633191646.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/bannon-is-gone-but-gop-still-has-to-deal-with-trump-unpopularity.html", "country": "US", "domain_rank": 767, "title": "Bannon may be gone, but Republicans still have to contend with Trump's unpopularity", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "0a8a0d5d71c8cad9de1557f38dddb08499c7baa9"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/bannon-is-gone-but-gop-still-has-to-deal-with-trump-unpopularity.html", "ord_in_thread": 0, "title": "Bannon may be gone, but Republicans still have to contend with Trump's unpopularity", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "breitbart", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "getty images white house", "sentiment": "negative"}, {"name": "republican congressional", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In Michael Wolff's new book, trash talk went both ways. Steve Bannon said Donald Trump \"lost his stuff\"; the president observed of his disheveled ex-strategist: \"Guy looks homeless.\"\nAnd now, politically speaking, he is.\nBreitbart News, the outrage-stoking far-right website that Bannon made his personal power base, cut ties with him today . Bannon's savage portrayal of the White House made the outcome inevitable. In this civil war, Breitbart and its financiers had no choice but to side with the president of the United States.\nThat represents welcome news for Republican Congressional leaders who never shared Bannon's initial enthusiasm for Trump. After being deposed as chief White House strategist a few months ago, Bannon returned to Breitbart and vowed to lead a 2018 insurrection against \"establishment\" Republicans he described as thwarting the president's nationalist \"Make America Great Again\" agenda.\nBannon's insurrection suffered one painful defeat when his candidate for U.S. Senate in Alabama, accused child molester Roy Moore, lost a race Republicans thought they couldn't lose. Now Bannon has lost the backing of the Mercer family's billions that he had counted on for weaponry.\nThat hardly solves the political problems Republicans face this year as they try to hold their House and Senate majorities. Early polling shows Democrats with powerful momentum, despite a strong economy, booming financial markets, and the freshly-enacted tax-cut law.\nThat's partly due to political tides that nearly always recede for the party that holds the White House. And it's partly due to Trump's extraordinary unpopularity, which has repelled key blocs of the electorate including young people, women and college-educated whites.\nA growing number of Republican lawmakers are choosing to retire rather than trying to ride out the 2018 storms. For those vulnerable Republicans intent on staying, strategies for mitigating the damage are limited.\nOne option is distancing themselves from the president, as some embattled members did when Bill Clinton, George W. Bush and Barack Obama faced midterm political troubles. But doing so risks splintering their base with primary challenges from the Trump loyalists on the right, even with Bannon marginalized.\nWolff's book \"Fire and Fury,\" depicting Trump as uninformed, unstable and childlike, has amplified public discussion of the president's fitness for office. \"Never Trump\" conservative intellectuals sought to drive home that message throughout the 2016 campaign, as retiring Republican Sens. Bob Corker and Jeff Flake have in recent months.\nBut so far, neither GOP Congressional leaders nor rank-and-file party loyalists have picked up the theme. Barring devastating developments soon from special counsel Robert Mueller 's Russia investigation, Trump isn't going anywhere.\nAnd that makes the GOP's choice on standing by Trump much like Breitbart's between Bannon and the president: not much of a choice at all.", "external_links": [], "published": "2018-01-10T02:00:00.000+02:00", "crawled": "2018-01-10T02:16:45.003+02:00", "highlightTitle": ""}