{"organizations": [], "uuid": "4874c92f7aaa0878d9310cf5ad2117403b7aae23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965598-GettyImages-583551810.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/planned-parenthood-chief-cecile-richards-will-step-down-from-post.html", "country": "US", "domain_rank": 767, "title": "Planned Parenthood chief Cecile Richards will step down from abortion rights, contraception group", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T23:17:00.000+02:00", "replies_count": 0, "uuid": "4874c92f7aaa0878d9310cf5ad2117403b7aae23"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/planned-parenthood-chief-cecile-richards-will-step-down-from-post.html", "ord_in_thread": 0, "title": "Planned Parenthood chief Cecile Richards will step down from abortion rights, contraception group", "locations": [], "entities": {"persons": [{"name": "cecile richards", "sentiment": "negative"}, {"name": "timothy a. clary", "sentiment": "negative"}, {"name": "cecile", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "planned parenthood", "sentiment": "none"}, {"name": "guttmacher institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Planned Parenthood President Cecile Richards reportedly will step down from her post after more than a decade of heading the group, a leader in the abortion and contraceptive rights movement.\nRichards' planned departure, which was first reported by BuzzFeed News and since has been confirmed by NBC News, comes a year after President Donald Trump took office with an agenda hostile to abortion access in general and Planned Parenthood in particular.\nIn a statement emailed to CNBC, a spokeswoman for Planned Parenthood said, \"Cecile plans to discuss 2018 and the next steps for Planned Parenthood's future at the upcoming board meeting.\" That meeting is scheduled for next week.\nPlanned Parenthood provides abortions to more people than any other provider in the United States. A third of the nation's more than 900,000 abortions annually are performed at Planned Parenthood clinics , according to the data from Planned Parenthood and the Guttmacher Institute.\nThe group receives more than $500 million in federal funding for nonabortion health services — such as cancer screenings, contraception and testing for sexually transmitted diseases — it offers women, notably in underserved rural areas.\nHowever, Congress for decades has barred any federal money from being used to fund abortions provided by Planned Parenthood.\nAccording to the group's annual report in 2017, \"Planned Parenthood Federation of America (PPFA) supports 59 independently incorporated affiliates that operate 661 health centers across the U.S., which have seen 2.5 million patients this year.\"\nTrump, in a September 2016 letter to anti-abortion advocates , wrote, \"I am committed to ... Defunding Planned Parenthood as long as they continue to perform abortions, and reallocating their funding to community health centers that provide comprehensive health care for women.\"\nLast spring, Trump signed a law that cut back some funding protections for Planned Parenthood services .\nBut bills that sought to repeal and replace Obamacare, which also would have temporarily cut off federal funds to Planned Parenthood, failed to win passage last year.\nRichards' mother, the late Ann Richards, served as governor of Texas.", "external_links": [], "published": "2018-01-24T23:17:00.000+02:00", "crawled": "2018-01-24T23:35:10.053+02:00", "highlightTitle": ""}