{"organizations": [], "uuid": "b29d1bc3cd80eb45017a60ca8a081ceaacc6f180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Satire: Chuck Schumer: ‘You Try Negotiating With the Greatest Dealmaker of All Time’ – Fortune", "url": "http://fortune.com/2018/01/23/satire-chuck-schumer-you-try-negotiating-with-the-greatest-dealmaker-of-all-time/", "country": "US", "domain_rank": 1196, "title": "Satire: Chuck Schumer: ‘You Try Negotiating With the Greatest Dealmaker of All Time’", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T00:11:00.000+02:00", "replies_count": 0, "uuid": "b29d1bc3cd80eb45017a60ca8a081ceaacc6f180"}, "author": "Matt Negrin", "url": "http://fortune.com/2018/01/23/satire-chuck-schumer-you-try-negotiating-with-the-greatest-dealmaker-of-all-time/", "ord_in_thread": 0, "title": "Satire: Chuck Schumer: ‘You Try Negotiating With the Greatest Dealmaker of All Time’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Satire: Chuck Schumer: 'You Try Negotiating With the Greatest Dealmaker of All Time' Pool Independent Still Pool photo ©2017 Consolidated News Photos All Rights Reserved January 23, 2018 \nHi folks, Chuck Schumer (Senate minority leader) here. \nA lot of you are upset with me for giving in and reopening the government. You’re saying I caved and handed President Donald Trump a victory without fighting for DACA, or any principle at all. Well let me tell you, that is wrong. I mean, have you ever tried negotiating with Donald Trump? He’s the greatest dealmaker of all time. \nRight off the bat the cards were stacked against me. He’s a master negotiator (just look at all his successful casinos, which I know are successful because he mentioned this often in our negotiations). And little old me? I’m just a guy from New York trying to make it in the big city, Washington DC. What do I know about dealmaking? Allow me to offer some insight into my dealings with the president so you might understand just how hard it was. \nFirst of all, I couldn’t even get a meeting with him at first. That’s a brilliant tactic on his part—make himself unavailable, so he seems disinterested in a deal. I didn’t see that coming. I tried to meet with him in the morning, but his staff said he was sleeping. Even in the early afternoon, still sleeping. Then around lunchtime, I thought it would be OK, but he was taking his twice-daily cheeseburger bath. By this point the shutdown had been in effect for more than 12 hours and I could tell he was trying to wear me down, and it was working. \nOnce I finally got him on the phone by telling the White House switchboard operator I was a Fox News morning show host, the president played another genius card from his Svengali deck of negotiating: pretending not to know what I was talking about. “DACA,” I said. He replied, “What’s that?” I could tell he was playing hardball, make me existentially define the very issue I had chosen to make the fulcrum of this high-stakes showdown. He caught me flat-footed and there was nothing I could do. I even tried bringing up other issues to chip away at, hoping to reach common ground—a short-term CR, border security—you know, things that all presidents know about. But he continued to play dumb. The art of the deal at work in front of my very eyes. \nFinally I decided my only remaining chance was to make inroads with his staff in the hopes that they could negotiate on my behalf. So I made a call to Stephen Miller on Sunday night. Unfortunately the president had anticipated my move, and he must have told his adviser exactly how to handle my overture, because Mr. Miller refused to even start negotiations with me. Instead, he picked up the phone, called me a wonderfully dealmakey epithet, and hung up. A tip of the hat to you, sir. \nOut of options and cleanly defeated by the greatest negotiator to ever walk this earth, I resigned myself to the reality that I would have to give in to the president’s brilliantly ambiguous demands. I would like to thank the president for this Master Class in negotiating, even if I came out on the losing side. And if there’s any consolation for me it’s that I now have unbridled confidence in our president to negotiate with our nation’s foremost adversaries like Russia and North Korea. \nAlways eager to learn, ", "external_links": [], "published": "2018-01-24T00:11:00.000+02:00", "crawled": "2018-01-24T00:11:47.000+02:00", "highlightTitle": ""}