{"organizations": [], "uuid": "170268937d5cb262320476210c397e1d9e5d6cd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/15/104109196-GettyImages-156803516.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/tax-reform-will-boost-business-travel-bank-of-america-says-upgrades-american-airlines.html", "country": "US", "domain_rank": 767, "title": "Tax reform will boost business travel, Bank of America says; upgrades American Airlines", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T17:32:00.000+02:00", "replies_count": 0, "uuid": "170268937d5cb262320476210c397e1d9e5d6cd6"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/tax-reform-will-boost-business-travel-bank-of-america-says-upgrades-american-airlines.html", "ord_in_thread": 0, "title": "Tax reform will boost business travel, Bank of America says; upgrades American Airlines", "locations": [], "entities": {"persons": [{"name": "airli", "sentiment": "negative"}, {"name": "michael nagle", "sentiment": "none"}, {"name": "andrew didora", "sentiment": "none"}, {"name": "didora", "sentiment": "none"}], "locations": [{"name": "queens", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "laguardia airport", "sentiment": "none"}], "organizations": [{"name": "american airlines venture capital tax", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}, {"name": "american airlines inc", "sentiment": "none"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "mcdonnell douglas", "sentiment": "none"}, {"name": "united continental", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "united continental holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Michael Nagle | Bloomberg | Getty Images An American Airlines Inc. McDonnell Douglas MD-82 plane sits parked at a gate while a United Continental Holdings plane taxis down the runway at LaGuardia Airport in the Queens borough of New York. \nTax reform should boost business travel this year, according to Bank of America Merrill Lynch, and that in turn will boost shares of the country's biggest airlines, including American Airlines, United Continental and Delta, the investment bank said. \n\"We view tax reform as a significant positive for corporate spending (banks, media companies and even airlines have given $1,000 one-time bonuses to employees), and we believe this can drive a pickup in corporate travel pricing,\" wrote analyst Andrew Didora.­­ \"Since 2014, we estimate corporate pricing is down 14 percent. ... This coupled with strong international fundamentals should create a solid backdrop for the legacy airlines that are more levered to corporate travel than domestic, leisure-oriented airlines.\" \nThe analyst changed his tune on American Airlines , upgrading the company to buy from underperform, and reiterated his buy ratings on Delta and United . American and United traded higher Tuesday following the bullish call. Delta initially rose but then headed into negative territory. \nGiven that those airlines generate roughly two-thirds of their revenue from business travel, any recovery in corporate pricing as a result of the Republican tax plan should disproportionately benefit those companies, Didora said. \nAll three underperformed the S&P 500 in 2017, though United disappointed the most, plagued with public relations problems throughout the year. Some extra cash as a result of revived corporate travel could be the key for improving equity prices. \n\"In a scenario in which corporate prices returned to the same levels as four years ago, corporate revenues could grow 15 percent, driving a strong fundamental backdrop for the industry and an even better outlook,\" added Didora. \nThe new tax law includes a corporate tax rate of 21 percent, down from 35 percent in an effort to make the U.S. more competitive globally. The law is expected to free up cash in a slew of industries, including industrials and financials. \nThough more bullish on some names, the analyst did issue some downgrades as well. Cutting his rating on Southwest and Alaska to neutral from buy and downgrading JetBlue to underperform from buy, Didora noted that domestic travel could suffer at the hands of international and business trips. \n\"We believe Southwest is the highest quality airline in the group with a very conservative balance sheet and low earnings volatility,\" he said. \"However, we expect business travel and international markets to outperform Southwest's largely domestic-oriented system in 2018.\" \nThe same assessment applied to Alaska, which Didora called \"an exceptionally well-run airline\" despite its focus on domestic travel. \nShares of Alaska and Southwest fell Tuesday, down 0.5 percent and 1 percent respectively. JetBlue was up slightly. \n— CNBC's Michael Bloom contributed to this report.", "external_links": [], "published": "2018-01-09T17:32:00.000+02:00", "crawled": "2018-01-09T17:39:09.008+02:00", "highlightTitle": ""}