{"organizations": [], "uuid": "b074134cb92232a67ffc32b2e2312a22db4dab90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/07/104696311-RTX3F69W-paul-ryan.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/paul-ryan-i-have-confidence-house-will-pass-bill-to-avoid-shutdown.html", "country": "US", "domain_rank": 767, "title": "Ryan confident House will pass bill to avoid shutdown, but doubt grows in Senate", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T18:39:00.000+02:00", "replies_count": 0, "uuid": "b074134cb92232a67ffc32b2e2312a22db4dab90"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/paul-ryan-i-have-confidence-house-will-pass-bill-to-avoid-shutdown.html", "ord_in_thread": 0, "title": "Ryan confident House will pass bill to avoid shutdown, but doubt grows in Senate", "locations": [], "entities": {"persons": [{"name": "ryan", "sentiment": "negative"}, {"name": "paul ryan", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "house", "sentiment": "negative"}, {"name": "senate cnbc.com shares  house", "sentiment": "neutral"}, {"name": "senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The threat of a federal government shutdown surged ahead of a rapidly approaching weekend deadline as doubts emerged about a last-minute spending plan passing both chambers of Congress.\nHouse Speaker Paul Ryan said Thursday that he had \"confidence\" the House would pass a bill to avoid a government shutdown – a measure the White House said President Donald Trump supports. \nYet Ryan's comment came as doubts emerged about the Senate's ability to approve the short-term funding legislation his chamber hopes to pass Thursday. As several Senate Democrats and even some Republicans said they would oppose another stopgap spending plan, third-ranking GOP Sen. John Thune said he was \"concerned\" the bill would not have 60 votes to pass the Senate, according to Politico .\nThe outlet and NBC News also reported that Senate Majority Leader Mitch McConnell was preparing to keep the chamber in session all weekend in the event a shutdown happens, with the intention of forcing Democrats from states that backed Trump into politically perilous votes. Some of those Democrats, like Claire McCaskill of Missouri and Joe Manchin of West Virginia, face tough re-election bids this year. \nGetty Images Speaker of the House Paul Ryan (R-WI) answers questions on the possibility of a government shutdown at the U.S. Capitol on January 18, 2018 in Washington, DC. Ryan, like Trump and McConnell, put the burden on Senate Democrats to back the proposal — which would extend government funding to Feb. 16 and reauthorize the Children's Health Insurance Program for six years — and avert a government shutdown. Republicans control the House, Senate and White House, and the House can pass a spending plan with only GOP votes. \nWhile Ryan projected confidence, he faces some resistance within his own membership. Mark Meadows, leader of the conservative Freedom Caucus, told media outlets that the group is largely opposed to the continuing resolution.\nSherman tweet \nThe GOP may have to go it alone in the House. House Minority Leader Nancy Pelosi, D-Calif., said \"we'll be opposing\" the continuing resolution, which she called a \"bad idea\" and \"wrong.\" She added that majority Republicans will \"own\" a shutdown. \nThe Senate, meanwhile, will need support from nine Democrats, if all Republicans back the legislation. Virginia Democrats Mark Warner and Tim Kaine, among others, announced their opposition to the bill.\n\"If the Senate Democrats want to shut the government down, if the Senate Democrats want to deny funding for our troops, if the Senate Democrats want to stop funding CHIP for unrelated issues — that's a choice they would make, I don't think it's a good choice for them to make — but that would be their decision to make,\" Ryan told reporters on Thursday. \nMeanwhile, Republican Sens. Rand Paul of Kentucky, Lindsey Graham of South Carolina and Mike Rounds of South Dakota also said they would oppose the funding bill as crafted by the House. \nDemocrats have threatened to oppose the plan if they cannot also pass a bill this week protecting hundreds of thousands of young immigrants from deportation. The Deferred Action for Childhood Arrivals program, which President Donald Trump ended in September, will start to phase out on March 5. \nShortly before Ryan spoke, Trump said a shutdown \"could happen\" and also said \"it's up to the Democrats\" to avoid it. \nEarlier, Trump's tweet about CHIP added more confusion to the already contentious scramble to keep the government funded. Trump said \"CHIP should be part of a long term solution, not a 30 Day, or short term, extension!\"\nLater Thursday, a White House spokesman clarified Trump's position: \"The President supports the continuing resolution introduced in the House. Congress needs to do its job and provide full funding of our troops and military with a two year budget caps deal. However, as the deal is negotiated, the President wants to ensure our military and national security are funded. He will not let it be held hostage by Democrats.\" \nRyan on Thursday said Trump's tweet is \"not causing us problems at all.\" He added that Trump understands how CHIP works. \nWhile Republicans have looked to pin the blame on Democrats for a possible shutdown, Senate Minority Leader Chuck Schumer said Wednesday that a shutdown \"will fall squarely on the majority leader's shoulders and the president's shoulders.\"\nNegotiations on an immigration bill that would protect immigrants shielded by DACA and meet Republican demands to boost border security and tweak extended family migration and the visa \"lottery\" system hit a snag last week when Trump rejected a deal reached by bipartisan senators.", "external_links": [], "published": "2018-01-18T18:39:00.000+02:00", "crawled": "2018-01-18T18:49:08.000+02:00", "highlightTitle": ""}