{"organizations": [], "uuid": "f4e88704bef790649b39e0463231a7bf4cdcd13c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962064-RTX4HIBH.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/at-davos-ceos-must-address-income-inequality-commentary.html", "country": "US", "domain_rank": 767, "title": "At Davos, CEOs must address income inequality", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T20:15:00.000+02:00", "replies_count": 0, "uuid": "f4e88704bef790649b39e0463231a7bf4cdcd13c"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/at-davos-ceos-must-address-income-inequality-commentary.html", "ord_in_thread": 0, "title": "At Davos, CEOs must address income inequality", "locations": [], "entities": {"persons": [{"name": "bart van ark", "sentiment": "none"}, {"name": "denis balibouse", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "swiss alps", "sentiment": "none"}], "organizations": [{"name": "congress hall", "sentiment": "none"}, {"name": "conference board published 11 mins ago", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "conference board", "sentiment": "none"}, {"name": "reuters activity", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Global leaders of all backgrounds are gathering at the World Economic Forum in Davos that began on Tuesday. Without a doubt, the business community heads in with much greater optimism than they had at least year's convening.\nWhat a difference a year—and a global economic revival—can make to what CEOs have on their minds.\nIn late 2016, the dark cloud of a global recession ranked as the greatest fear of respondents to The Conference Board's annual survey of top business executives. One year later, not all CEOs have broken into a happy dance with three percent (or better) global economic growth predicted for 2018. But, the latest Conference Board C-Suite Challenge Survey shows that \"global recession\" dropped to 19th on their list of \"hot-button issues.\"\nDefensive tactics such as controlling baseline costs, managing currency risk, and raising capital reserves – challenges so prominent 12 months earlier – have taken a backseat to growth-oriented ones including talent, digitization, and innovation.\nMoreover, the results reveal a touch of greater social consciousness in the collective minds of business leaders. Admittedly, the CEO community alone may not be able to achieve the worthy theme and goal of this year's meeting, Creating a Shared Future in a Fractured World . However, in light of that theme, the findings from three survey topics should encourage executives to lead the narrative and advance solutions at this global gathering.\n\"This year, CEOs expressed heightened concern over the potential impact of income inequality on social and business environments.\" First, growth is good, but the benefits need to be better spread around. This year, CEOs expressed heightened concern over the potential impact of income inequality on social and business environments. It has risen to seventh on our global list of hot-button issues, up from 18 th in 2017; it ranks even higher in China and the rest of emerging Asia. And chief human resource officers in our survey rank it as their fifth-highest hot-button issue.\nWhy does increasing concern about inequality make sense to business leaders? The potential impact of income inequality on employee engagement and morale may well have an impact on productivity. And wage increases may be needed not only to attract high-quality workers, but also to avoid a large consumer class with limited purchasing power.\nSecond, business leaders realize they must develop stronger and more value-driven cultures. In their eyes, achieving this requires building more engaged, productive, innovative, customer-centric and ultimately more productive, more profitable, and more socially aware organizations.\nInclusive and engaging cultures go a long way toward addressing 2018's top-voted CEO concern: the ability to attract and retain talent. The premium placed on talent comes as no surprise, since executives must navigate increasingly tight labor markets, exacerbated by a faster pace of digital transformation. In other words, what has often been seen as the \"soft stuff\" no longer seems so soft.\nThird, one of the most critical themes centers on communications. Business leaders are vowing to better and more effectively communicate within their organizations - up, down, and across. Being more open, transparent, and inclusive starts at the top, and is critical to building a culture where everyone can be heard, feel safe, and have their ideas count.\nWhen deliberating and applying their business acumen at this week's conference, business leaders might think of the Greek philosopher Plutarch as their guiding light. He once said that \"An imbalance between rich and poor is the oldest and most fatal ailment of all republics.\"\nWhile Plutarch was sounding the alarm about financial inequity, a sense of inequity also extends to the workplace and the environment. Judging from this year's theme, the WEF believes creating a shared future lies within reach.\nWhile it may not be in the sole purview of CEOs to re-unite an uncertain and fragmented world community, it is in their power to address the issues that divide their own workplaces. A commitment to inclusion, fairness, upskilling through training and development, and worker engagement would be a step in that direction.\nCommentary by Bart van Ark , executive vice president, chief economist, and chief strategy officer at The Conference Board and co-author, with Charles Mitchell , of C-Suite Challenge 2018 . Follow him on Twitter @bart_ark .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-23T20:15:00.000+02:00", "crawled": "2018-01-23T20:28:10.004+02:00", "highlightTitle": ""}