{"organizations": [], "uuid": "6da5cf5e7fb68cbc820c068722a080a25e174d93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/18/reuters-america-rising-brazilian-ethanol-prices-open-window-for-u-s-imports.html", "country": "US", "domain_rank": 767, "title": "Rising Brazilian ethanol prices open window for U.S. imports", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:59:00.000+02:00", "replies_count": 0, "uuid": "6da5cf5e7fb68cbc820c068722a080a25e174d93"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/reuters-america-rising-brazilian-ethanol-prices-open-window-for-u-s-imports.html", "ord_in_thread": 0, "title": "Rising Brazilian ethanol prices open window for U.S. imports", "locations": [], "entities": {"persons": [{"name": "marcelo teixeira pu", "sentiment": "negative"}, {"name": "michael hirtzer", "sentiment": "negative"}, {"name": "tarcilo rodrigues", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bioagencia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rising Brazilian ethanol prices open window for U.S. imports Michael Hirtzer and Marcelo Teixeira Published 12 Hours Ago Reuters SHARES \nCHICAGO/SAO PAULO, Jan 18 (Reuters) - U.S. ethanol exports to Brazil will spike during the coming months as high gasoline prices and low ethanol supplies drive up demand in the South American country, according to two traders and two brokers active in the market. \nThe southward flow comes as a setback to Brazil's efforts to curb foreign shipments. Its government in September slapped a 20 percent tariff on U.S. ethanol imports above a quota of 150 million liters (40 million gallons) per quarter but is considering reversing the decision due to supply struggles. \nSales of U.S. ethanol to Brazil so far in January would already surpass that quarterly quota, said a U.S. fuel trader with direct knowledge of the deals. \n\"Even with the 20 percent tariff, the arbitrage is pretty wide open into the northeast (of Brazil). They are going to keep pulling because they need the barrels,\" the trader said. \nTarcilo Rodrigues, a partner at Bioagencia brokerage in Sao Paulo, said U.S. producers could ship as much as 450 million liters of ethanol in the December-January-February quarter - triple the quota and roughly matching record-large volumes seen in the same period a year ago. \n\"I believe this is a situation that will persist at least until April, when mills start processing the new center-south cane crop and local ethanol prices tend to fall,\" Rodrigues said. \nBrazilian brokers quoted U.S. ethanol delivered at local ports at around 1.95 reais per liter ($2.29 per gallon) after transportation costs and all taxes and the 20 percent import charge. That is cheaper than similar Brazilian product, pegged at around 2.15 reais per liter ($2.53 per gallon). \nU.S. corn-based ethanol futures on Thursday of $1.34 per gallon have recovered from the decade-low of $1.25 hit last month. \nBrazilian gasoline prices are up more than 20 percent since July due to rising oil prices. That boosted demand for cheaper ethanol as a substitute. But since Brazil is between cane crops, most local mills will not produce more ethanol for a few months. \nMartinho Ono, a director at Sao Paulo-based ethanol brokerage SCA Etanol do Brasil, said some sugar and ethanol makers in Brazil are converting anhydrous ethanol - the type primarily produced in the United States - into the hydrous variety more common in Brazil. \nSo-called flex-fuel cars in Brazil operate on gasoline or hydrous ethanol. (Reporting by Michael Hirtzer in Chicago and Marcelo Teixeira in Sao Paulo; Editing by Alistair Bell)", "external_links": [], "published": "2018-01-18T20:59:00.000+02:00", "crawled": "2018-01-19T09:28:27.000+02:00", "highlightTitle": ""}