{"organizations": [], "uuid": "ac61ee1ec3744902b6c2c3f63baad982f8942e34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965447-GettyImages-103604082.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/yougov-president-donald-trumps-tweet-about-mark-cuban-was-disliked.html", "country": "US", "domain_rank": 767, "title": "President Trump's least popular tweet of 2017 was about Mark Cuban", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T21:44:00.000+02:00", "replies_count": 0, "uuid": "ac61ee1ec3744902b6c2c3f63baad982f8942e34"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/yougov-president-donald-trumps-tweet-about-mark-cuban-was-disliked.html", "ord_in_thread": 0, "title": "President Trump's least popular tweet of 2017 was about Mark Cuban", "locations": [], "entities": {"persons": [{"name": "mark cuban", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "mark cuban donald trump jr.", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "trump tower", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump has tweeted thousands of messages to his 47.1 million followers over the course of his first year in the White House. Some tweets have been received better than others. \nOne of the most negatively received tweets was about fellow billionaire Mark Cuban, according to a report by UK based data company YouGov.\nYouGov analyzed 2,063 tweets Trump sent between Feb. 4, 2017 and Jan. 19, 2018 and asked a sample of 1,000 Americans to rate them on a five-point scale to create a \"score,\" ranging from +200 to -200. The results were recorded in YouGov's tweet index , a sort-able list of tweets and their rankings. Overall, 38 percent of Trump's tweets received a net positive score.\nThe tweet with the lowest score was a Feb. 12, 2017 tweet from Trump that said, \"I know Mark Cuban well. He backed me big-time but I wasn't interested in taking all of his calls. He's not smart enough to run for president!\"\nTweet \nIt received an overall score of -81. According to YouGov, Democrats gave the tweet a score of -134, Independents gave it a score of -79 and Republicans gave it -18.\nCuban, who is worth $3.3 billion according to Forbes , told CNBC in October that he was \" actively considering \" a run for the presidency, but added that he most likely wouldn't run out of consideration for his family.\nIf he did run, he would run as a \"Republican before Democrat and most likely Independent,\" he said at The New York Times DealBook Conference in November. \nTrump has tweeted about Cuban several times before, calling him \"dopey,\" a \"jerk\" and an \"a--hole.\" \nTweet \nIn 2016, Cuban endorsed Democratic presidential nominee and former Secretary of State Hillary Clinton at a rally in his hometown of Pittsburgh and has been critical of Trump before. After Trump tweeted about protests by NFL players, Cuban said that Trump should consider reading instead.\n\"Instead of getting on his phone and tweeting, just read a book. You know, just chill,\" Cuban told CNBC. \nHe's also suggested he could lead the nation better than Trump.\n\"Based off what's happening in the White House, based off what's happening in the country and the world, we need better leadership. And I think I could do a better job,\" Cuban said in October .\n\"But there's a lot more to it than just thinking you can do a better job, and so I'm not ready to make the commitment.\"\nDon't miss: Mark Cuban says quitting this one common bad habit made him more successful \nLike this story? Like CNBC Make It on Facebook ! \nshow chapters Mark Cuban: If I lost everything and had to start over, here's what I would do      9:22 AM ET Fri, 24 March 2017 | 00:47", "external_links": [], "published": "2018-01-24T21:44:00.000+02:00", "crawled": "2018-01-24T21:56:54.021+02:00", "highlightTitle": ""}