{"organizations": [], "uuid": "3cc31b112fc09123956c18ccac9cd9ca0f65c651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/18/104661874-RTS19PQA-vladimir-putin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/tech-firms-let-russia-hunt-for-vulnerabilities-in-software-widely-used-by-the-us-government.html", "country": "US", "domain_rank": 767, "title": "Tech firms let Russia probe software widely used by U.S. government", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T16:42:00.000+02:00", "replies_count": 0, "uuid": "3cc31b112fc09123956c18ccac9cd9ca0f65c651"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/tech-firms-let-russia-hunt-for-vulnerabilities-in-software-widely-used-by-the-us-government.html", "ord_in_thread": 0, "title": "Tech firms let Russia probe software widely used by U.S. government", "locations": [], "entities": {"persons": [{"name": "sym", "sentiment": "negative"}, {"name": "alexander zemlianichenko", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "sap", "sentiment": "negative"}, {"name": "symantec", "sentiment": "none"}, {"name": "reuters vladimir putin  major", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mcafee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech firms let Russia hunt for vulnerabilities in software widely used by the US government SAP, Symantec and McAfee allowed Russian authorities to hunt for vulnerabilities in software. The practice potentially jeopardizes the security of U.S. government computer networks. Russian authorities say the reviews are necessary to detect flaws that could be exploited by hackers. Published 6 Hours Ago Alexander Zemlianichenko | POOL | Reuters Vladimir Putin \nMajor global technology providers SAP , Symantec and McAfee have allowed Russian authorities to hunt for vulnerabilities in software deeply embedded across the U.S. government, a Reuters investigation has found. \nThe practice potentially jeopardizes the security of computer networks in at least a dozen federal agencies, U.S. lawmakers and security experts said. It involves more companies and a broader swath of the government than previously reported. \nIn order to sell in the Russian market, the tech companies let a Russian defense agency scour the inner workings, or source code, of some of their products. Russian authorities say the reviews are necessary to detect flaws that could be exploited by hackers. \nBut those same products protect some of the most sensitive areas of the U.S. government, including the Pentagon, NASA, the State Department, the FBI and the intelligence community, against hacking by sophisticated cyber adversaries like Russia. \nReuters revealed in October that Hewlett Packard Enterprise software known as ArcSight, used to help secure the Pentagon's computers, had been reviewed by a Russian military contractor with close ties to Russia's security services. \nNow, a Reuters review of hundreds of U.S. federal procurement documents and Russian regulatory records shows that the potential risks to the U.S. government from Russian source code reviews are more widespread. \nBeyond the Pentagon, ArcSight is used in at least seven other agencies, including the Office of the Director of National Intelligence and the State Department's intelligence unit, the review showed. Additionally, products made by SAP, Symantec and McAfee and reviewed by Russian authorities are used in at least eight agencies. Some agencies use more than one of the four products. \nMcAfee, SAP, Symantec and Micro Focus , the British firm that now owns ArcSight, all said that any source code reviews were conducted under the software maker's supervision in secure facilities where the code could not be removed or altered. The process does not compromise product security, they said. Amid growing concerns over the process, Symantec and McAfee no longer allow such reviews and Micro Focus moved to sharply restrict them late last year. \nThe Pentagon said in a previously unreported letter to Democratic Senator Jeanne Shaheen that source code reviews by Russia and China \"may aid such countries in discovering vulnerabilities in those products.\" \nReuters has not found any instances where a source code review played a role in a cyberattack, and some security experts say hackers are more likely to find other ways to infiltrate network systems. \nBut the Pentagon is not alone in expressing concern. Private sector cyber experts, former U.S. security officials and some U.S. tech companies told Reuters that allowing Russia to review the source code may expose unknown vulnerabilities that could be used to undermine U.S. network defenses. \n\"Even letting people look at source code for a minute is incredibly dangerous,\" said Steve Quane, executive vice president for network defense at Trend Micro , which sells TippingPoint security software to the U.S. military. \nWorried about those risks to the U.S. government, Trend Micro has refused to allow the Russians to conduct a source code review of TippingPoint, Quane said. \nQuane said top security researchers can quickly spot exploitable vulnerabilities just by examining source code. \n\"We know there are people who can do that, because we have people like that who work for us,\" he said. Opening the door \nMany of the Russian reviews have occurred since 2014, when U.S.-Russia relations plunged to new lows following Moscow's annexation of Crimea. Western nations have accused Russia of sharply escalating its use of cyber attacks during that time, an allegation Moscow denies. \nSome U.S. lawmakers worry source code reviews could be yet another entry point for Moscow to wage cyberattacks. \n\"I fear that access to our security infrastructure — whether it be overt or covert — by adversaries may have already opened the door to harmful security vulnerabilities,\" Shaheen told Reuters. \nIn its Dec. 7 letter to Shaheen, the Pentagon said it was \"exploring the feasibility\" of requiring vendors to disclose when they have allowed foreign governments to access source code. Shaheen had questioned the Pentagon about the practice following the Reuters report on ArcSight, which also prompted Micro Focus to say it would restrict government source code reviews in the future. HPE said none of its current products have undergone Russian source code review. \nLamar Smith, the Republican chairman of the House Science, Space and Technology Committee, said legislation to better secure the federal cybersecurity supply chain was clearly needed. \nMost U.S. government agencies declined to comment when asked whether they were aware technology installed within their networks had been inspected by Russian military contractors. Others said security was of paramount concern but that they could not comment on the use of specific software. \nA Pentagon spokeswoman said it continually monitors the commercial technology it uses for security weaknesses. No pencils allowed \nTech companies wanting to access Russia's large market are often required to seek certification for their products from Russian agencies, including the FSB security service and Russia's Federal Service for Technical and Export Control (FSTEC), a defense agency tasked with countering cyber espionage. \nFSTEC declined to comment and the FSB did not respond to requests for comment. The Kremlin referred all questions to the FSB and FSTEC. \nFSTEC often requires companies to permit a Russian government contractor to test the software's source code. \nSAP HANA, a database system, underwent a source code review in order to obtain certification in 2016, according to Russian regulatory records. The software stores and analyzes information for the State Department, Internal Revenue Service, NASA and the Army. \nAn SAP spokeswoman said any source code reviews were conducted in a secure, company-supervised facility where recording devices or even pencils are \"are strictly forbidden.\" \n\"All governments and governmental organizations are treated the same with no exceptions,\" the spokeswoman said. \nWhile some companies have since stopped allowing Russia to review source code in their products, the same products often remain embedded in the U.S. government, which can take decades to upgrade technology. \nSecurity concerns caused Symantec to halt all government source code reviews in 2016, the company's chief executive told Reuters in October. But Symantec Endpoint Protection antivirus software, which was reviewed by Russia in 2012, remains in use by the Pentagon, the FBI, and the Social Security Administration, among other agencies, according to federal contracting records reviewed by Reuters. \nIn a statement, a Symantec spokeswoman said the newest version of Endpoint Protection, released in late 2016, never underwent a source code review and that the earlier version has received numerous updates since being tested by Russia. The California-based company said it had no reason to believe earlier reviews had compromised product security. Symantec continued to sell the older version through 2017 and will provide updates through 2019. \nMcAfee also announced last year that it would no longer allow government-mandated source code reviews. \nThe cyber firm's Security Information and Event Management (SIEM) software was reviewed in 2015 by a Moscow-based government contractor, Echelon, on behalf of FSTEC, according to Russian regulatory documents. McAfee confirmed this. \nThe Treasury Department and Defense Security Service, a Pentagon agency tasked with guarding the military's classified information, continue to rely on the product to protect their networks, contracting records show. \nMcAfee declined to comment, citing customer confidentiality agreements, but it has previously said the Russian reviews are conducted at company-owned premises in the United States. 'You can't trust anyone' \nOn its website, Echelon describes itself as an official laboratory of the FSB, FSTEC, and Russia's defense ministry. Alexey Markov, the president of Echelon, which also inspected the source code for ArcSight, said U.S. companies often initially expressed concerns about the certification process. \n\"Did they have any? Absolutely!!\" Markov wrote in an email. \n\"The less the person making the decision understands about programming, the more paranoia they have. However, in the process of clarifying the details of performing the certification procedure, the dangers and risks are smoothed out.\" \nMarkov said his team always informs tech companies before handing over any discovered vulnerabilities to Russian authorities, allowing the firms to fix the detected flaw. The source code reviews of products \"significantly improves their safety,\" he said. \nChris Inglis, the former deputy director of the National Security Agency, the United States' premier electronic spy agency, disagrees. \n\"When you're sitting at the table with card sharks, you can't trust anyone,\" he said. \"I wouldn't show anybody the code.\" Related Securities", "external_links": [], "published": "2018-01-25T16:42:00.000+02:00", "crawled": "2018-01-25T16:50:07.002+02:00", "highlightTitle": ""}