{"organizations": [], "uuid": "148fdbeeb1f3238bab7c41388591c8edd3e90b20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104944147-Untitled-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/shari-redstone-explores-adding-new-cbs-directors-wsj.html", "country": "US", "domain_rank": 767, "title": "Shari Redstone reportedly explores adding new CBS directors in push to merge with Viacom", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T12:37:00.000+02:00", "replies_count": 0, "uuid": "148fdbeeb1f3238bab7c41388591c8edd3e90b20"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/shari-redstone-explores-adding-new-cbs-directors-wsj.html", "ord_in_thread": 0, "title": "Shari Redstone reportedly explores adding new CBS directors in push to merge with Viacom", "locations": [], "entities": {"persons": [{"name": "shari redstone", "sentiment": "negative"}, {"name": "shari", "sentiment": "none"}, {"name": "leslie moonves", "sentiment": "none"}, {"name": "sumner redstone", "sentiment": "none"}], "locations": [], "organizations": [{"name": "viacom", "sentiment": "negative"}, {"name": "cbs", "sentiment": "negative"}, {"name": "wsj shari redstone", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "viacom inc", "sentiment": "none"}, {"name": "national amusements", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "redstones", "sentiment": "none"}, {"name": "national amusements inc", "sentiment": "none"}, {"name": "cbs corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shari Redstone, a controlling shareholder of CBS , has discussed adding new directors to the CBS board as she renews her push to merge the company with Viacom , The Wall Street Journal reported on Wednesday.\nShari Redstone and Sumner Redstone , her ailing 94-year-old father, together control both CBS and Viacom Inc through their privately owned movie theater company, National Amusements Inc. The Redstones failed in an attempt to merge the two companies in 2016.\nShari Redstone, who is vice chair of the CBS board, has had exploratory conversations with CBS Chief Executive Leslie Moonves and directors about recombining the companies, sources have told Reuters.\nWhile Moonves is receptive to a combination, he has some reservations, sources have told Reuters.\nSpokesmen for CBS and Viacom declined to comment.\nCBS is looking to replace several of its directors at its annual shareholders meeting in May, and Shari Redstone is gathering names of possible candidates, according to The Wall Street Journal.\nShari Redstone's push to revisit a CBS merger with Viacom has become more pressing in light of Walt Disney's planned acquisition of a majority of Twenty-First Century Fox's assets, the sources told Reuters.\nA combined CBS, which owns cable networks including Showtime and The Movie Channel as well as the CBS TV Network and CBS TV Studios, and Viacom, whose businesses include Paramount Pictures, Nickelodeon Movies and MTV Films, would have more negotiating leverage with cable and satellite companies.\nIn addition, Shari Redstone does not want to wait for the verdict on the U.S. Department of Justice's lawsuit to block AT&T's $85 billion acquisition of Time Warner , which is set to go to trial in March, the sources told Reuters. The Justice Department is suing to block that deal on the grounds that it is anti-competitive.\nIf that deal were to fall through, it would mean both AT&T and Time Warner may look for other companies to combine with, sources have said.\nViacom's new CEO, Bob Bakish, has improved relations with distributors, found financing for Paramount Pictures after Chinese investors dropped out and shuffled programming.\nEven so, Viacom's stock is trading around $32 a share, below the $35-$38.80 range it was trading at when it and CBS explored a merger in late 2016.\nIt is unclear if the valuation and corporate governance issues that caused the deal to fail in 2016 remain.\nSome analysts said they believe the selloff in Viacom, along with the consolidation in the media space, should prompt CBS to revisit the deal.\n\"We think now is as good a time as any to reexamine why we continue to believe this deal is the most logical and appropriate transaction to take place within our media coverage universe,\" MoffettNathanson analysts wrote this week.", "external_links": [], "published": "2018-01-18T12:37:00.000+02:00", "crawled": "2018-01-18T12:55:07.015+02:00", "highlightTitle": ""}