{"organizations": [], "uuid": "4d2f7e8299e6fb55b490fd1130694a962f5258d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/10/104209701-GettyImages-462072980.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/top-european-officials-are-slamming-mnuchins-comments-on-a-weaker-dollar.html", "country": "US", "domain_rank": 767, "title": "Top European officials are slamming Mnuchin's comments on a weaker dollar", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "4d2f7e8299e6fb55b490fd1130694a962f5258d6"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/top-european-officials-are-slamming-mnuchins-comments-on-a-weaker-dollar.html", "ord_in_thread": 0, "title": "Top European officials are slamming Mnuchin's comments on a weaker dollar", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "fabrice coffrini", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "benoit coeure", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "davos - world economic forum top", "sentiment": "negative"}, {"name": "executive board", "sentiment": "none"}, {"name": "g-7", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "afp / getty images", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Another top official at the European Central Bank has made a thinly veiled swipe at the Trump administration, following comments by Treasury Secretary Steven Mnuchin that caused the dollar to slump against the euro.\nThe greenback tanked to a three-year low Wednesday after Mnuchin said a weaker dollar is beneficial for the country . The dollar slide is causing jitters in Europe, where a stronger euro could impact export-focused companies and jeopardize ECB plans to reduce monetary stimulus.\n\"We've seen lots of volatility being created recently by different statements — I think that's not helpful,\" Benoit Coeure, executive board member of the ECB, said Friday at a panel at the World Economic Forum in Davos.\n\"Any discussion on the exchange rates should be sent back to where it belongs, which is multilateral bodies, which is G-7 and G-20,\" he said.\n\"Volatility isn't helpful, and if that would reach a point where this would create any unwanted consequence for us, any unwanted tightening of monetary policy, we would have to reassess,\" Coeure added.\nThe euro has risen in the last few months due to the economic recovery in the region, but the appreciation has also been largely fueled by a weaker dollar. A stronger euro could affect inflation in the euro zone — which the ECB has tried to support in the last few years — potentially prompting a change in its policy.\nshow chapters ECB President Draghi: We don't target exchange rates 10:08 AM ET Thu, 25 Jan 2018 | 02:46 Speaking Thursday at an ECB press conference, the central bank's president, Mario Draghi , also subtly hinted at Mnuchin's comments on Wednesday, without directly naming the U.S. Treasury secretary.\n\"When someone says that basically a good exchange rate is good for exporters and it's good for the economy and it's good, that means it's targeting the exchange rate,\" Draghi said when asked about Mnuchin's comments, according to Reuters. He also he referred to a communique agreed by IMF members last year that denounced competitive devaluations.\nPresident Donald Trump told CNBC in an exclusive interview Thursday that Mnuchin was misinterpreted and that he himself would like a strong currency.\nMnuchin told CNBC on Friday that his comments on Wednesday were taken out of context. He said he wasn't trying to talk down the dollar. He said the U.S. has a long-term interest in a strong dollar.", "external_links": [], "published": "2018-01-26T15:00:00.000+02:00", "crawled": "2018-01-26T15:05:25.022+02:00", "highlightTitle": ""}