{"organizations": [], "uuid": "307bd1d07107fae6c74944694990209c098b5d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 57, "shares": 57, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939476-GettyImages-903512344.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/how-you-can-help-victims-of-the-california-mudslides.html", "country": "US", "domain_rank": 767, "title": "Oprah shows how California mudslides struck her neighborhood—here's how to help local victims", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T01:02:00.000+02:00", "replies_count": 0, "uuid": "307bd1d07107fae6c74944694990209c098b5d68"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/how-you-can-help-victims-of-the-california-mudslides.html", "ord_in_thread": 0, "title": "Oprah shows how California mudslides struck her neighborhood—here's how to help local victims", "locations": [], "entities": {"persons": [{"name": "oprah", "sentiment": "negative"}, {"name": "piffero", "sentiment": "none"}, {"name": "jessica piffero", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "red cross", "sentiment": "none"}, {"name": "red cross  the american red cross", "sentiment": "none"}, {"name": "american red cross", "sentiment": "none"}, {"name": "santa barbara city college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nIf you're interested in helping with local relief efforts, here are two charities you can send donations to: Donate to the American Red Cross \nThe American Red Cross had more than 50 people spend the night at its shelter at Santa Barbara City College, American Red Cross spokesperson Jessica Piffero tells CNBC Make It . tweet \n\"Red Cross volunteers are also providing those impacted with a safe place to stay, hot meals and health services. The organization's crisis counselors are supporting a family assistance center at a local church, where families wait to hear about their loved ones,\" Piffero said. tweet \nIts emergency response vehicle team also went out with first responders to provide blankets and water as residents are rescued from the landslide. \nPiffero says the quickest way to help people affected by disasters unfolding in California through Red Cross is to text the word REDCROSS to 90999 to make a $10 donation, call 1-800-RED CROSS or donate right from the Red Cross website . The local Red Cross shelter for central California can be reached at (805) 987-1514. Donate to Direct Relief \nSanta Barbara, California-based charity Direct Relief helps disaster victims across the world by providing medicine and medical supplies. In light of the recent natural disaster, the organization's CEO Thomas Tighes says that the disaster is now literally in his front and back yard. \n\"As search and rescue efforts continue, Direct Relief is coordinating its response with the Santa Barbara County Public Health and Emergency Services Departments, as well as the National Voluntary Organizations Active in Disaster,\" Tighes tells CNBC Make It in a statement. A post shared by Direct Relief (Official) (@directrelief) on Jan 9, 2018 at 12:04pm PST \nDirect Relief has staff on the group sending medical support as the situation develops, but assures that donations directed toward the Southern California disaster are applied to same day assistance. \n\"When separated from medication needed to manage diabetes, hypertension or asthma, a person can fall into medical crisis rapidly, resulting in an emergency room visit or worse,\" Tighes says. \"Direct Relief is committed for as long as it takes to help the Santa Barbara and Montecito community recover from these tragic events.\" \nThe quickest way for your donation to assist Direct Relief is by donating directly on their website and directing your donation to the \"Southern California Fires & Mudslides\" on its drop-down menu. ", "external_links": [], "published": "2018-01-11T01:02:00.000+02:00", "crawled": "2018-01-11T01:43:38.001+02:00", "highlightTitle": ""}