{"organizations": [], "uuid": "72e40474e0b1fa6688f0f74cd5804623ab5efd39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "http://www.bostonherald.com/sites/default/files/styles/full/public/media/2018/01/20/sundance-film.jpg?itok=nfD-ikkT", "site_section": "http://www.bostonherald.com/feed", "section_title": "Boston Herald - Boston Herald", "url": "http://fortune.com/2018/01/20/moviepass-says-it-will-start-acquiring-films-directly/", "country": "US", "domain_rank": 1196, "title": "MoviePass says it will start acquiring films directly", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "72e40474e0b1fa6688f0f74cd5804623ab5efd39"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/20/moviepass-says-it-will-start-acquiring-films-directly/", "ord_in_thread": 0, "title": "MoviePass says it will start acquiring films directly", "locations": [], "entities": {"persons": [{"name": "robin marchant getty", "sentiment": "neutral"}, {"name": "david z. morris", "sentiment": "neutral"}, {"name": "robin marchant/getty images", "sentiment": "none"}, {"name": "mitch lowe", "sentiment": "none"}], "locations": [{"name": "helios", "sentiment": "none"}, {"name": "pierpont place", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "moviepass", "sentiment": "neutral"}, {"name": "matheson analytics", "sentiment": "none"}, {"name": "zions bank", "sentiment": "none"}, {"name": "moviepass ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Z. Morris, FORTUNE Saturday, January 20, 2018 Credit: Robin Marchant Getty Images SALT LAKE CITY, UT - JANUARY 19: Guests attend the Salt Lake Opening Night Reception Presented By Zions Bank during the 2018 Sundance Film Festival at Pierpont Place on January 19, 2018 in Salt Lake City, Utah. (Photo by Robin Marchant/Getty Images) comments \nMoviePass, the startup that is now subsidizing the moviegoing habits of 1.5 million subscribers , is shopping for movies to call its very own. \nVariety reports that MoviePass, a subsidiary of Helios and Matheson Analytics, is creating a subsidiary, MoviePass Ventures, to acquire films in conjunction with distributors, and is on the lookout at the Sundance Film Festival. In a statement , MoviePass CEO Mitch Lowe said that the move was in part so that MoviePass could share in the sizeable uptick in moviegoing that it is helping generate. \nMoviePass subscribers can see one film a day in almost any U.S. theater, for a fee that dropped to just $9.95 in August of last year. On the face of it, that’s a money-losing proposition, since MoviePass currently pays full price for all of its customers’ tickets. The company says it will eventually turn a profit through various strategies including leveraging user data. \nGet Data Sheet , Fortune’s technology newsletter. \nDropping its monthly fee generated a massive surge in interest and subscribers, and MoviePass makes the eye-opening claim that it is now purchasing about 3% of all the movie tickets sold in the U.S. That alone is stunning: if you conservatively estimate that half of those tickets would never have been sold if the attendee wasn’t using MoviePass to essentially get in free, the service has grown overall U.S. box office by at least 1.5%. That gives it serious, if not particularly targeted, leverage to squeeze money out of the film business. \nMore specifically, MoviePass claims it is purchasing more than 10% of the tickets for particular films. MoviePass says it is using “a series of levers within its app . . . to impact a consumer’s selection of a particular independent film,” to the benefit of mid-budget critical favorites like Three Billboards Outside of Ebbing, Missouri and Call Me By Your Name . \nIf MoviePass really is able to actively nudge audiences to see particular films, it may both have a way to generate marketing revenue, and a motivation to invest in films itself. It’s difficult, though, to see exactly how MoviePass’s extremely straightforward app – little more than a table of movie times – is actively influencing users’ movie choices. And smaller indie films were always the most likely to benefit from MoviePass, since they offer less of the visual wizardry that compels moviegoers to pay $12 each to see something like Thor: Ragnarok on the big screen. Related Articles", "external_links": [], "published": "2018-01-20T02:00:00.000+02:00", "crawled": "2018-01-21T01:25:28.015+02:00", "highlightTitle": ""}