{"organizations": [], "uuid": "0866445b623fd95518a23bf09f8a959d4bde815b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941410-GettyImages-118010484.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/david-rosenberg-fed-taking-on-role-of-serial-bubble-blower.html", "country": "US", "domain_rank": 767, "title": "David Rosenberg: Fed taking on role of 'serial bubble blower' and it won't 'end well'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T21:39:00.000+02:00", "replies_count": 0, "uuid": "0866445b623fd95518a23bf09f8a959d4bde815b"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/david-rosenberg-fed-taking-on-role-of-serial-bubble-blower.html", "ord_in_thread": 0, "title": "David Rosenberg: Fed taking on role of 'serial bubble blower' and it won't 'end well'", "locations": [], "entities": {"persons": [{"name": "david rosenberg", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "rosenberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "gluskin sheff", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The latest leg of the bull market in stocks could have a familiar impetus — a Federal Reserve unlikely to rock the boat, particularly while many of its members are still learning the vagaries of central banking.\nWith Jerome Powell about to take over as chairman and most of the seven-member Fed board of governors to be new appointees, the tendency will be toward safe decisions and away from anything likely to unsettle Wall Street, said David Rosenberg, chief economist and strategist at Gluskin Sheff.\n\"The bull market continues unabated and is taking on a speculative tone in the process,\" Rosenberg said in his daily note to clients Thursday. \nThose observations came the same day as stocks set still new records as the ninth anniversary of the current bull market approaches in two months. Major indexes posted gains better than 0.5 percent in afternoon trading.\nIn his note, Rosenberg wondered whether the Fed will \"remain a serial bubble blower.\" \nThe criticism is familiar: Through low interest rates and trillions of dollars in bond buying, the Fed has created a credit bubble of low-cost cash coursing through the economy and, more particularly, risk assets like stocks and corporate bonds.\nRosie Hallam | Barcroft Media | Getty Images Though the Fed has been in a slow rate-hiking pace since December 2015 — the December 2017 increase was the sixth in the current cycle — its benchmark funds rate remains targeted at just 1.25 percent to 1.5 percent.\nRosenberg said the latest run-up in stocks may be due to a market that believes the new Fed, with Powell at the helm, won't be in a hurry to raise rates. A hawkish central bank has been near the top of most Wall Street strategists' lists of what could go wrong in 2018.\n\"The elephant in the living room remains the central banks,\" Rosenberg wrote. \"The prevailing view is that balance sheet tapering will be mild and that Jerome Powell will prove to be a dove. This may well be the most important psychological driver for the market — that a new and inexperienced Fed will not take the punchbowl away in the coming year.\"\nRosenberg, however, worries about valuations promoted by a Fed policy that is misguided particularly when it comes to inflation. The Fed's targets 2 percent inflation growth as a sign of healthy and sustainable economic growth, but has failed to reach that level despite a decade of historically accommodative policy.\nWhile inflation is not showing up in the traditional indicators like personal consumption expenditures and the Consumer Price Index, Rosenberg said it is elsewhere — \"art, equities, corporate credit, real estate, cryptocurrencies, commodities, precious metals. Let me know if I have left anything out.\"\nRecent comments from investor Jeremy Grantham warning of a market \"melt-up\" or final push of cash into stocks, followed by a meltdown, caught Rosenberg's eye.\n\"So Jeremy Grantham could well be onto something in his recent blow-off thesis,\" he wrote. \"But he is also intimating that we are heading into the final bubble phase and those don't end well.\"", "external_links": [], "published": "2018-01-11T21:39:00.000+02:00", "crawled": "2018-01-11T22:02:38.005+02:00", "highlightTitle": ""}