{"organizations": [], "uuid": "5ba44c575b73229b657f902b86c98d87228a9d8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/23/103412652-RTX287KI.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/04/stocks-making-the-biggest-moves-in-premarket-trading-snap-tsla-dpz-roku-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves in premarket trading: SNAP, TSLA, DPZ, ROKU & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-04T15:24:00.000+02:00", "replies_count": 0, "uuid": "5ba44c575b73229b657f902b86c98d87228a9d8a"}, "author": "", "url": "https://www.cnbc.com/2018/01/04/stocks-making-the-biggest-moves-in-premarket-trading-snap-tsla-dpz-roku-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves in premarket trading: SNAP, TSLA, DPZ, ROKU & more", "locations": [], "entities": {"persons": [{"name": "cowen", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brian krzanich", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york stock exchange", "sentiment": "negative"}, {"name": "tsla", "sentiment": "negative"}, {"name": "cowen", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cvs health", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell :\nTesla — The electric car maker released fourth-quarter auto delivery numbers that fell short of many Wall Street estimates. The company also pushed back production targets for its Model 3 sedan.\nIntel — CEO Brian Krzanich told CNBC the company will start rolling out fixes for a widespread issue regarding its processors. The Register had reported there is a security flaw with Intel processors, noting it will require a significant security update of Linux and Microsoft Windows operating systems to work around it.\nSnap — The social media company's stock was downgraded to underperform from market perform at Cowen. \"Per our recent ad buyer survey, SNAP was lowest Social platform in key attributes like ROI, data and user targeting,\" Cowen said. The analysts also trimmed their price target on Snap to $11 from $12.\nCVS Health — CVS said it expects fiscal 2018 cash flow to increase by $1.2 billion as a result of the tax bill signed by President Donald Trump last month. \"With the financial flexibility that tax reform provides, the company anticipates making strategic investments in future areas of growth in its business,\" CVS said in a release.\nDomino's Pizza — Credit Suisse upgraded Domino's shares to outperform from neutral and raised its price target to $220 from $205. The analysts said in a note that the stock has pulled back about 12 percent from its recent highs \"despite significant upside to forward earnings.\"\nWalgreens Boots Alliance — Walgreens reported quarterly earnings and revenue that beat analyst expectations. The company also raised the lower end of its bottom line guidance for fiscal 2018.\nRoku — Shares of Roku fell more than 6 percent after analysts at Morgan Stanley downgraded them to underweight. The analysts noted \"the market has overreacted\" since Roku released better-than-expected third-quarter earnings. Shares are up about 200 percent since the results came out.\nRite Aid — Rite Aid shares dropped 5.7 percent after the company reported weaker-than-expected quarterly revenue. Rite Aid also posted a same-store sales decline of 2.5 percent.\nWestern Digital — Shares of the data storage company were downgraded to market perform from outperform at BMO Capital Markets and slashed their price target to $85 from $120. \"With flash supply-demand balance on the horizon, we see limited upside for gross margins and revenue growth,\" the analysts said.\nMastercard — Mastercard's stock was upgraded to buy from neutral at Mizuho, with analysts saying stronger economic conditions would benefit payment volumes \"and overall transactional activity.\nWorld Wrestling Entertainment — Wells Fargo upgraded WWE's stock to outperform from market perform, noting it \"checks all of the boxes for us and we believe it has a clear path of catalysts through 2018.\" WWE shares rose 3.4 percent before the bell.", "external_links": [], "published": "2018-01-04T15:24:00.000+02:00", "crawled": "2018-01-04T16:30:50.001+02:00", "highlightTitle": ""}