{"organizations": [], "uuid": "cdd75ad6fad8fcea53decff11cac7188b9702fba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/17/104591437-GettyImages-813676680-bull.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/cramers-5-cardinal-rules-of-engagement-with-the-bull-market.html", "country": "US", "domain_rank": 767, "title": "Cramer's 5 cardinal rules of engagement with the bull market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T01:10:00.000+02:00", "replies_count": 0, "uuid": "cdd75ad6fad8fcea53decff11cac7188b9702fba"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/cramers-5-cardinal-rules-of-engagement-with-the-bull-market.html", "ord_in_thread": 0, "title": "Cramer's 5 cardinal rules of engagement with the bull market", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "neutral"}, {"name": "cramer", "sentiment": "neutral"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Even after Tuesday's massive stock market reversal — the biggest in roughly 10 months — CNBC's Jim Cramer maintained that he liked the market.\nBut the \" Mad Money \" host acknowledged that there are \"rules of engagement for dealing with a bull market that's in beast mode,\" so he wanted to highlight those for investors.\n1. Take a profit Cramer's No. 1 rule is one of his most common sayings: no one ever got hurt taking a profit.\nIn a rallying market like this one, investors tend to forget that their gains aren't really winnings until they ring the register. That can burn them when the market takes a hit.\n\"In this red-hot bull market, there are hundreds of stocks that you own with outsized gains where you'd be foolish not to do some profit-taking. I'm not saying you should sell the whole position — I like this market too much,\" Cramer said. \"I just want you to understand that profits on paper don't count; it's not a real gain until you've taken something off the table.\"\n2. Keep an eye out Rule No. 2? You never know when an unexpected geopolitical or market-moving event might happen, so be prepared.\nFor example, Cramer has been guiding that Commerce Secretary Wilbur Ross might recommend that President Donald Trump use Article 232 of the Trade Expansion Act to prevent Chinese steel dumping.\nThe article reserves the right to protect key domestic industries, in this case steel, for national security purposes. By invoking it, the United States would effectively push back against China's practice of artificially suppressing steel prices.\nThe move would \"be a huge positive for the domestic steelmakers, but there's so much collateral damage. It will hurt the stocks of our international companies that do a lot of business in the People's Republic as investors start worrying about Chinese retaliation,\" Cramer said. \"Something you need to keep in mind is this retaliation.\"\n3. Don't be greedy Cue one of Cramer's best-known aphorisms: \"Bulls make money, bears make money, and pigs get slaughtered.\"\nWhile this rule applies more loosely for those saving for retirement, investors using their mad money should have some cash on the sidelines to be able to buy in at lower stock prices, Cramer said.\n\"These days, the conventional wisdom is that the only real money that ever goes into the stock market is retirement money. That's supposed to go into index funds and it's never supposed to be touched, no matter what,\" he said. \"I'm not telling you to mess with your 401(k), but if you do own individual stocks in your discretionary portfolio ... I'm saying take something off the table!\"\n4. Don't fall in love Cramer has tried to explain Rule No. 4 — don't fall in love with your investments — to cryptocurrency buyers time and time again.\n\"I fear for my life whenever I use the words ' bitcoin ' and 'sell' in the same sentence,\" the \"Mad Money\" host said. \"Still, the darned thing is in free-fall and the cryptomaniacs aren't doing themselves any favors by getting so attached emotionally to it.\"\nInstead, Cramer recommended investors stay humble, stay on top of their investments and, most of all, stay detached.\n5. Stay diversified Finally, different areas of the market may have their heydays at different times, which is why investors must stay diversified, Cramer said.\nFor example, after the market reversed on Tuesday, the drug and health insurance stocks were still able to log strong gains. But the industrial stocks, red-hot just last week, were taken down along with last week's other winners, the oil and retail names.\nFinal thoughts \"Here's the bottom line: do not be greedy, take some profits [and] stay diversified, since you never know what's going to come from left field and send us lower,\" the \"Mad Money\" host concluded. \"Simple rules to live by. Don't screw it up.\"\nWATCH: Cramer's 5 'rules of engagement' with the bull show chapters Cramer's 5 cardinal rules of engagement with the bull market      20 Hours Ago | 11:09  ", "external_links": [], "published": "2018-01-17T01:10:00.000+02:00", "crawled": "2018-01-17T02:15:04.000+02:00", "highlightTitle": ""}