{"organizations": [], "uuid": "8336dcc4e4965ff331dcc64028e91f53f4a9e3c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/14/104587505-RTX3AOXE.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/2018s-unbridled-stock-surge-may-signal-the-overshoot-phase-of-this-bull-market-is-underway.html", "country": "US", "domain_rank": 767, "title": "2018's unbridled stock surge may signal the 'overshoot' phase of this bull market is underway", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T14:49:00.000+02:00", "replies_count": 0, "uuid": "8336dcc4e4965ff331dcc64028e91f53f4a9e3c7"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/2018s-unbridled-stock-surge-may-signal-the-overshoot-phase-of-this-bull-market-is-underway.html", "ord_in_thread": 0, "title": "2018's unbridled stock surge may signal the 'overshoot' phase of this bull market is underway", "locations": [], "entities": {"persons": [{"name": "joseba etxaburu", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The fast start for stocks this year is hinting that the upside \"overshoot\" of this bull market might be underway.\nThere's no formal or objective definition of such a phase. It's more about the tenor and rhythm of the market than a level or moment.\nAn overshoot period riding on public enthusiasm and confidence is not the same as a bubble, or a mere short-term sugar rush. It's when a bull market most acts and feels like one — though the gains it creates often don't survive the next bear market, whenever that might come.\nStocks were probably in an overshoot for nearly three years from 1997 to early 2000, as the market doubled before collapsing back to early-1997 levels over two years. And the equity market never really got to this phase before the 2007 credit-bubble peak.\nA decent characterization of an overshoot is when stocks accelerate upward from already-high levels, as public eagerness to chase equities pushes the market up faster than the fundamentals are improving, and investors extrapolate good economic trends well into the future.\nSound like the current market moment?\n\nWe've certainly seen acceleration, with stocks up more than 4 percent in two weeks. As strong as 2017 was, it was an orderly climb taken in small steps. This year, the Dow industrials have had three 0.8 percent gains in the first nine trading sessions; it averaged fewer than one such gain per month last year.\nAnd the public wants in.\n\"Panic buying is a difficult term to define. Panic selling is easier, because everyone can see the market imploding to the downside at a rapid pace,\" said Larry McMillan of McMillan Analysis. \"When panic occurs on the upside, it is much tamer and less volatile. But what we've seen since the turn of the new year could certainly be qualified as panic buying.\"\nNew money flowed into equity mutual funds and ETFs at the sixth-highest pace on record in the latest week measured, says Bank of America Merrill Lynch.\nStrategists at BAML have been calling for the peak of a crescendo of bullishness to arrive and say it's close but not here yet: \"Investors are unambiguously long and likely will stay so until rates go up and/or [earnings] go down. ... Peak positioning is on its way, but we expect asset prices to overshoot first,\" they told clients Friday.\nThe market's acceleration is also favoring juicier stocks, and that's raising the market's metabolism so far in 2018.\nHere are two ETFs, one tracking riskier and more cyclical \"high-beta\" stocks and the other defensive \"low-volatility\" names. Notice how high-beta lifted off versus low-vol last fall. This is helped by rising rates, stronger economic growth and aggressive risk appetites:\n\n\nThis helps explain the increased vigor of the market, with wider daily moves than last year's methodical grind. Note that the S&P 500 volatility index (VIX) is up slightly this year even with stocks climbing nearly every day. This hints that traders see the chance for a jumpier tape to come — and, eventually, the end of the longest ever streak without a 5 percent pullback. From what level that might begin is anyone's guess.\nThe \"overshoot\" dynamics are also evident in the way stocks have been rising faster than profit forecasts. Since the tax-cut law passed on Dec. 20, S&P 500 projected earnings growth for 2018 has climbed by 2 percent, atop already-healthy expectations of 11 percent gains, according to FactSet.\nThe S&P 500 itself has climbed 4 percent since Dec. 20 — doubling the penciled-in boost from lower taxes. This extends a trend of stocks getting richer even as earnings rebound:\n\nSource: FactSet \nOf course, bulls can plausibly argue that analysts are slow in updating their numbers for the tax windfall. Could be, but even here the market running ahead to price in estimate gains resembles \"overshoot\" behavior.\nStrategist Binky Chadha of Deutsche Bank, a staunch bull for some time, says, \"After strong, uninterrupted rally, much is now priced in at the market level.\" He adds: \"S&P 500 trailing multiple at 20.8x, are well above historical averages and in our reading also somewhat above levels implied by their historical drivers, partly reflecting immediate pricing in of future tax cut benefits.\"\nValuation is an atmospheric condition with big implications for future returns, but little influence on how the market acts for months or years at a time. For now, the demand for stocks even at rich prices is swamping supply.\nThe Ned Davis Research Crowd Sentiment Poll — a composite of several ways to track investor attitudes — hit an all-time high last week. A measure of upside momentum known as the relative strength index surged to heights seen only a few times since the 1990s.\nAll of this says the market is running quite hot at the moment and has stretched to a point where a rest would make sense and not much would be needed to prompt a quick air pocket.\nBut mostly these stats — combined with the broad strength among most stocks and solid credit conditions — tell us the market is in a sturdy uptrend and the first setback won't likely be a serious, or lasting, downturn.\nFor a decisive market break, the economy would have to disappoint dramatically, the Fed would need to get more aggressive or credit markets would have to sour — and perhaps create one of those \"financial accidents\" that sometimes strike an overconfident and over-extended investment community and rudely interrupt a bull market's overshoot phase.", "external_links": [], "published": "2018-01-16T14:49:00.000+02:00", "crawled": "2018-01-16T15:03:21.006+02:00", "highlightTitle": ""}