{"organizations": [], "uuid": "687c164873b22df3139463a7183d6cb6665455e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/24/102862266-GettyImages-464850319-delta-american.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/delta-american-resume-flying-each-others-stranded-passengers.html", "country": "US", "domain_rank": 767, "title": "Phew! Delta and American agree to fly each other's stranded passengers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:34:00.000+02:00", "replies_count": 0, "uuid": "687c164873b22df3139463a7183d6cb6665455e2"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/delta-american-resume-flying-each-others-stranded-passengers.html", "ord_in_thread": 0, "title": "Phew! Delta and American agree to fly each other's stranded passengers", "locations": [], "entities": {"persons": [{"name": "andrew harrer", "sentiment": "neutral"}, {"name": "eric phillips", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "neutral"}, {"name": "delta", "sentiment": "neutral"}, {"name": "american airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The two largest U.S. airlines have found an ally to prevent passengers from getting stranded: Each other.\nAmerican Airlines , the biggest U.S. carrier, and the No. 2 airline, Delta , on Wednesday are resuming an agreement that allows the airlines to rebook their passengers on each other's flights during travel disruptions.\nThe decision comes after costly and highly visible travel chaos in recent years, from computer failures to power outages to bad weather , all made more noticeable to the public through social media.\nDelta and American had an agreement until 2015 that allowed them to rebook each other's passengers. Delta said that so-called interline agreement was scrapped after more American passengers were sent to Delta than vice versa.\nshow chapters Are airline stocks set to soar on earnings?      22 Hours Ago | 03:04 \"At that rate the industry agreement was no longer mutually beneficial,\" Eric Phillips, Delta's senior vice president of revenue management, said in September 2015, when that agreement was halted.\n@ AmericanAir (2/3) so basically you've forced my hand and I've had to pay out of pocket to get on a Delta flight (since you won't book the people you've screwed on another airline with availability!) because I need to get to LAX today instead of >24 hrs later \nThe new agreement stops short of a traditional interline pact because it won't allow travel agencies to book itineraries that include both airlines.\n\"This is strictly an irregular-operations ticketing and baggage reaccommodation agreement,\" said Delta spokesman Morgan Durrant. \"A true interline means things like fare combinability for travel agency and third-party sales. That's not what this is.\"\nBoth Delta and American have similar agreements with other airlines, such as United . \nThe new agreement is \"a tool that will give our employees more options to reaccommodate customers whose flights are canceled during weather and other uncommon scenarios when Delta flights are canceled,\" Durrant said.\nThe agreement could end up both saving airlines money and tamping down social-media outcry during travel disruptions, instead of having passengers stranded and possibly due compensation.\nWhile the agreement will allow airlines to ticket passengers on the other's planes, \"our priority will be always to keep customers on American or our alliance and joint-business partners,\" said American spokesman Matt Miller.\nWATCH: Delta's $12 billion Airbus order show chapters Delta's $12 billion Airbus order      1:17 PM ET Thu, 14 Dec 2017 | 03:07", "external_links": [], "published": "2018-01-24T19:34:00.000+02:00", "crawled": "2018-01-24T19:51:42.000+02:00", "highlightTitle": ""}