{"organizations": [], "uuid": "8468704f89fe52b3a897055e452cb75bfd95e67d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-gopro-redundancies/gopro-lowers-fourth-quarter-revenue-forecast-cuts-more-than-250-jobs-idUSKBN1EX1DX", "country": "US", "domain_rank": 408, "title": "GoPro lowers fourth quarter revenue forecast, cuts more than 250 jobs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T16:16:00.000+02:00", "replies_count": 0, "uuid": "8468704f89fe52b3a897055e452cb75bfd95e67d"}, "author": "", "url": "https://www.reuters.com/article/us-gopro-redundancies/gopro-lowers-fourth-quarter-revenue-forecast-cuts-more-than-250-jobs-idUSKBN1EX1DX", "ord_in_thread": 0, "title": "GoPro lowers fourth quarter revenue forecast, cuts more than 250 jobs", "locations": [], "entities": {"persons": [{"name": "laharee chatterjee", "sentiment": "none"}, {"name": "savio d'souza", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "techcrunch", "sentiment": "none"}, {"name": "gopro inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:18 PM / Updated 19 minutes ago GoPro says open to sale but not actively pursuing Greg Roumeliotis , Laharee Chatterjee 3 Min Read \n(Reuters) - GoPro Inc ( GPRO.O ) would be willing to partner with a larger sector player but is not actively engaged in a sale, the action camera-maker said on Monday, as its shares partly rebounded from earlier heavy losses. \nThe comments followed reports by several media outlets, including Reuters, that GoPro had hired J.P. Morgan to help it with a sale process, as the one-time Wall Street favorite battles falling demand for its sports cameras and drones. \nThe company’s shares, which fell as much as 33 percent to a record low of $5.04 on Monday, recouped some of their losses after the sale talks were first reported by CNBC. \n“We’ve always been clear that we are open to any opportunity that will help us scale our mission. JP Morgan is our banker, but there is no active engagement to sell,” GoPro said in emailed comments to Reuters. \n“It is our responsibility to scale the business, so if the right opportunity presented itself, it’s something we would consider,” it added. \nJ.P. Morgan declined to comment. \nEarlier in the day, the company lowered its fourth-quarter revenue forecast, following weak demand for its cameras in the holiday season, and announced a plan to exit the drone business. \nThe company has suffered a decline in demand for its eponymous cameras and Karma drones - mostly used by sports junkies and travel enthusiasts - for several quarters. \nFurthermore, it forecasts that tough regulatory hurdles in Europe and the United States will likely reduce the market for drones in the years ahead. Its exit from the drone business will take place after selling the existing Karma inventory, it added. \nThe company cut the price of its latest HERO6 cameras to $399 from $499 this week, a decision that it said would hurt revenue by around $80 million in the fourth quarter. \nMorgan Stanley said in a research note on Monday that the price cut would make earnings growth difficult in fiscal 2018. \nThe move followed weak demand for existing camera models. \n“Despite significant marketing support, we found consumers were reluctant to purchase HERO5 Black at the same price it launched at one year earlier,” Chief Executive Nick Woodman said in a statement alongside results. \nThe company now expects fourth-quarter revenue of $340 million, compared with its November projection of $470 million, plus or minus $10 million. It also said it plans to cut more than 250 jobs as it restructures. GoPro had 1,254 employees as of Sept. 30. \n“Cutting costs is a good move, although now it’s about if the company can turn this ship around themselves,” Daniel Ives, analyst at GBH Insights, said. \nWoodman will reduce his 2018 cash compensation to $1, the company said. Reporting by Laharee Chatterjee in Bengaluru and Greg Roumeliotis in New York; Editing by Maju Samuel and Rosalba O'Brien", "external_links": [], "published": "2018-01-08T16:16:00.000+02:00", "crawled": "2018-01-08T16:32:33.003+02:00", "highlightTitle": ""}