{"organizations": [], "uuid": "c07e35878f3e838910d131842a4efe4654409e69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965022-GettyImages-887887136-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/to-get-daca-deal-trump-and-schumer-need-to-keep-it-simple-commentary.html", "country": "US", "domain_rank": 767, "title": "There's only one way to get a DACA deal: 'Keep it simple, stupid'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:50:00.000+02:00", "replies_count": 0, "uuid": "c07e35878f3e838910d131842a4efe4654409e69"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/to-get-daca-deal-trump-and-schumer-need-to-keep-it-simple-commentary.html", "ord_in_thread": 0, "title": "There's only one way to get a DACA deal: 'Keep it simple, stupid'", "locations": [], "entities": {"persons": [{"name": "saul loeb", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "kentucky", "sentiment": "none"}], "organizations": [{"name": "congressional", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What do you call people who refuse to learn from failures, mistakes and very public embarrassments?\nPoliticians.\nThat's what it looks like after the brief government shutdown that the public blamed on both the Democrats and President Trump. Instead of that debacle bringing both sides closer to an immigration deal, they are now further apart than ever.\nSenate Minority Leader Chuck Schumer made that clear Tuesday when he said the Democrats are reversing their previous compromise decision to support up to $25 billion for President Donald Trump 's border wall and security enhancements. President Trump quickly countered with:\nTrump tweet\nNow it appears both sides are running to the comfort of their more extreme corner.\nIt seems like a long time ago that Trump was promising that the adult children of illegal immigrants, or \"Dreamers,\" had nothing to worry about and the same Trump was saying that he'd \"take the heat\" for accepting the immigration compromises made by bipartisan congressional leaders.\nSo, what changed?\nThe answer depends on whom you ask.\nDemocrats say things changed when Trump backed away from those conciliatory words about the Dreamers when he rejected the so-called Gang of Six's compromise deal.\nThe White House says that rejection happened because that deal was worse than anything Trump imagined when he made those comments because it \"would not secure our border, encouraged more illegal immigration, increased chain migration, and retained the visa lottery system.\"\nSo what will it take for both sides to strike a deal?\nThe answer to that one is easier: Keep it simple, stupid.\nThe DACA deal has been elusive in part because the Democrats have tried to use the popularity of the Dreamers as a chip to advance their broader immigration agenda.\nSupport is so strong for the plight of the Dreamers in most polls , that you can see why opportunistic Democrats with loftier goals would try to use them as leverage to achieve them.\nThe satirical Onion website best captured the reality of the Democrats' intentions regarding the Dreamers with this comedic headline:\n\" Cory Booker, Kamala Harris, Elizabeth Warren Assure Dreamers They'll Never Stop Fighting For The 2020 Nomination \"\nBut support for the Dreamers isn't invulnerable. The polls also show that voters don't think their fight is worth a government shutdown. The Democrats overplayed their hand.\nTrump risks doing the same thing. Dreamers are now angrily protesting the Democrats' failure to secure their immigration status, with one protest even showing up at Schumer's private home.\nBut if Trump tries to use that pressure to squeeze more than the previously agreed-to funding for his border wall and security, he too would be overreaching.\nThat brings us back to the simplicity solution.\nSen. John Thune, a member of the GOP Senate leadership, is one of the more important voices asking both sides to simply keep the deal to the Dreamers and a reasonable funding amount for the wall and border security. \"Narrower gets it done,\" according to Thune – and he's right.\nThis wisdom should enter the heads of people like Schumer and the president before the Feb. 8 deadline for a DACA vote. Dreamers and their advocates need to pressure Schumer to stop using them to grab more than just securing their legal status.\nAnd Schumer needs to convince them that getting a path to full citizenship is worth waiting for in return for not worrying about losing their jobs and college scholarships or getting deported.\nMeanwhile, the White House needs to convince immigration hardliners that getting money for border security and the wall is good enough for now. A plan to curb existing chain migration and ending the visa lottery can wait until the Dreamers' issues are settled because the threat of their popularity makes it too hard to win those battles now.\nThe deal that can and should work now is simple: Dreamers get amnesty and Trump gets $25 billion for the wall. Have a nice day.\nA wider immigration battle can take place later once the budget is passed and shutdowns and the plight of the sympathetic Dreamers are no longer looming over everything.\nThe clear lesson of the last week is that shutdowns don't work, political greed is counterproductive, and you can't serve your supporters by using them for political blackmail. Anyone can see this now, except perhaps Chuck Schumer and some of the staunchest anti-illegal immigration hardliners.\nThey now have about two weeks to get a grip on reality.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-24T19:50:00.000+02:00", "crawled": "2018-01-24T20:11:29.002+02:00", "highlightTitle": ""}