{"organizations": [], "uuid": "f598a0752858fe2ca4d4d6065ae72754e27371e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941856-GettyImages-903554694-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/trump-ends-1st-year-with-lowest-average-approval-rating.html", "country": "US", "domain_rank": 767, "title": "Trump ends 1st year with lowest average approval rating", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T18:34:00.000+02:00", "replies_count": 0, "uuid": "f598a0752858fe2ca4d4d6065ae72754e27371e5"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/trump-ends-1st-year-with-lowest-average-approval-rating.html", "ord_in_thread": 0, "title": "Trump ends 1st year with lowest average approval rating", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "oval office", "sentiment": "none"}], "organizations": [{"name": "gallup", "sentiment": "negative"}, {"name": "mins ago getty images", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This is a record not to be coveted: Donald Trump is wrapping up a year in office with the lowest average approval rating of any elected president in his first term.\nThat's according to polling by Gallup, which shows that Trump has averaged just a 39 percent approval rating since his inauguration. The previous low was held by Bill Clinton , whose first-year average stood 10 points higher than Trump's, at 49 percent.\nRecent surveys show most Americans view Trump as a divisive figure and even question his fitness for office. One relative bright spot for Trump is his handling of the economy, though even there his ratings are not as high as might be expected given a relatively strong economy.\nWhat the polls show about how Americans view their president a year into his term:\nUnusual unpopularity Trump's current approval rating in Gallup's weekly poll is comparable to his average rating, standing at just 38 percent, with 57 percent saying they disapprove.\nThe persistence of Trump's first-year blues is unprecedented for a president so early in his term. Americans usually give their new presidents the benefit of the doubt, but Trump's \"honeymoon period,\" to the extent he had one, saw his approval rating only as high as 45 percent.\nSince then, Trump has spent more time under 40 percent than any other first-year president.\nPresidents have recovered from periods of low popularity before. For example, Clinton's rating fell to just 37 percent in June 1993 before quickly regaining ground, and he went on to win re-election. Harry S. Truman held the approval of less than 40 percent of Americans for significant chunks of his first term and was also re-elected. He went on to set Gallup's lowest-ever approval mark, at just 22 percent in 1952.\nTrump's lowest point in Gallup's weekly polling — 35 percent — remains higher than those of several earlier presidents. Truman, Richard Nixon and Jimmy Carter all had their ratings dip under 30 percent.\nStrong suits There aren't many bright spots for Trump, but there are some. For one, most Republicans continue to approve of him — 83 percent of registered voters who identify as Republicans, according to a recent Quinnipiac poll.\nThe same poll found that most voters overall find Trump to be intelligent and a strong person.\nAnd positive ratings for Trump's handling of the economy have tended to run higher than his overall job ratings.\nIn a December poll by the Associated Press-NORC Center for Public Affairs Research, Trump's rating on handling the economy was 8 percentage points higher than his overall approval, though even that stood at just 40 percent in the survey, which was a particularly negative one for Trump.\nIn the Quinnipiac poll, voters were more likely to say Trump is helping the economy than hurting it, 37 percent to 29 percent. On the other hand, more said President Barack Obama deserves the credit than Trump does, 49 percent to 40 percent.\nOn the issues Aside from the economy, surveys have suggested few policy bright spots for Trump.\nHealth care has been a consistent low point. Seven in 10 Americans in the December AP-NORC poll said they disapproved of Trump's handling of the issue, even as 85 percent called the issue very important to them personally.\nIn another AP-NORC poll conducted late in 2017, just 23 percent of Americans said he has kept the promises he made while running for president, while 30 percent said he's tried and failed and 45 percent said he has not done so at all. More than half said the country is worse off since Trump became president.\nThat poll was conducted before the passage of a tax bill that Trump signed into law in late December, but there's little sign that the law will have an immediate positive impact. A Gallup poll conducted in January found that just 33 percent of Americans approved of the legislation.\nCharacter concerns But it may be character more than policy that's driving negative opinions of Trump. In the January poll by Quinnipiac University, most voters said Trump is not level-headed, honest or even fit to serve as president.\nAnd the AP-NORC poll conducted in December found that two-thirds of Americans thought the country has become even more divided as a result of Trump's presidency.\nIn a July Gallup poll that asked those who disapproved of Trump for their reasons why, most cited his personality or character over issues, policies or overall job performance. That stood in stark contrast to Gallup's polling on Obama in 2009 and George W. Bush in 2001, when far fewer cited such concerns about personality or character as reasons for their negative opinions.", "external_links": [], "published": "2018-01-16T18:34:00.000+02:00", "crawled": "2018-01-16T18:55:15.015+02:00", "highlightTitle": ""}