{"organizations": [], "uuid": "d3836aca2aa65391019dbde567fa72b3dc6564c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104818498-GettyImages-864097706-tim-cook.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/ios-11-point-3-includes-business-chat-heres-why-thats-a-big-deal.html", "country": "US", "domain_rank": 767, "title": "Apple's new Business Chat in the upcoming iOS update is a huge deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T16:39:00.000+02:00", "replies_count": 0, "uuid": "d3836aca2aa65391019dbde567fa72b3dc6564c2"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/ios-11-point-3-includes-business-chat-heres-why-thats-a-big-deal.html", "ord_in_thread": 0, "title": "Apple's new Business Chat in the upcoming iOS update is a huge deal", "locations": [], "entities": {"persons": [{"name": "lowe", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "getty images tim cook  apple", "sentiment": "neutral"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "facebook messenger", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New features coming this spring with Apple 's big iPhone operating system update, iOS 11.3 , include Business Chat.\nIt's a big deal. Imagine a day where you can quickly schedule a doctor's appointment, buy new shoes or book a plane ticket, all from iMessage. Business Chat has the fundamentals to make that happen.\nBusiness Chat initially will allow users to chat directly with select companies including Wells Fargo , Lowe's , Hilton and Discover , through the iMessage app. It's a feature we've already seen in Facebook Messenger and will change the way we interact with companies from our smartphones.\nApple iOS 11.3 Business Chat Instead of having to call support, for example, users will be able to pop right into an app and talk with a business about issues, to schedule an appointment or even to make purchases.\nIn the screenshot above, for example, you can see an example where a user can purchase an item directly from Lowe's, in this case a smart lock, using Apple Pay, from within Messages.\nI've used this feature before in Facebook Messenger and found it was much easier to interact with a company through chat than to call. I had to return a bag I had purchased and was able to reach out, chat with customer support and arrange a return.\nI didn't need to visit a company's website, fumble with a separate app or look up a support number (where I'd likely have to dig around voice menus to get the right option only to be put on hold.)\nPlus, instead of sitting around on the phone, you can just answer a message when you get one on your iPhone. Your contact details are kept anonymous, too, Apple says, and you can \"stop chatting at any time\" should you decide the conversation is over.\nApple will likely add more companies, since the current selection is really slim, but Business Chat should be a huge new way to communicate with companies through iMessage without ever having to go to another app or website.", "external_links": [], "published": "2018-01-24T16:39:00.000+02:00", "crawled": "2018-01-24T16:58:11.002+02:00", "highlightTitle": ""}