{"organizations": [], "uuid": "082e54db1395465b59b01278785a90ea9a9eaedc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 49, "shares": 49, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104964250-Novak_Russia_.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/russian-minister-fields-awkward-sanctions-question-next-to-rick-perry.html", "country": "US", "domain_rank": 767, "title": "Russia's energy minister fielded an awkward question on US sanctions while sitting next to Rick Perry", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T23:47:00.000+02:00", "replies_count": 0, "uuid": "082e54db1395465b59b01278785a90ea9a9eaedc"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/russian-minister-fields-awkward-sanctions-question-next-to-rick-perry.html", "ord_in_thread": 0, "title": "Russia's energy minister fielded an awkward question on US sanctions while sitting next to Rick Perry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Any public event that seats U.S. Energy Secretary Rick Perry elbow-to-elbow with Russian Energy Minister Alexander is bound to generate at least one awkward moment.\nAn energy policy panel that featured just that scenario at the World Economic Forum in Davos, Switzerland on Wednesday did not disappoint.\nThe discussion ranged from oil price forecasts to the U.S. shale revolution, but ultimately — and perhaps inevitably — veered toward U.S. sanctions on the Russian energy sector, imposed in 2014 after Moscow annexed Crimea in the early days of Ukraine's civil war.\nAsked if they had hurt investment into Russia, Novak played down the impact of the sanctions, which are aimed at deterring Russia's development of Arctic, offshore and shale resources.\n\"As far as we are concerned, for Russia, frankly, because of these sanctions, it gave our industry a certain impetus, additional impetus, and we have managed to redirect the flow of investments to reboot our enterprises,\" Novak said through an interpreter.\nSource: World Economic Forum\nHowever, he said the sanctions make Russia \"slightly uncomfortable\" because Moscow has grown used to living in a market economy and operating without interference in its business.\nHe also said the sanctions do not help solve global economic problems because the world's top oil producers need to meet the demands of the 2.4 billion people who do not have access to modern energy sources for cooking and heating.\nNovak concluded by suggesting the United States, which recently became a net exporter of natural gas, join the Gas Exporting Countries Forum, a group of nations that gather regularly to discuss the development of the gas market.\n\"It would be very helpful if the United States could get on board with these consultations and discussions aimed at some positive results, so we can develop the markets and create an enabling environment for developing these industries,\" he said.\nAsked whether he would accept that offer, Perry did not answer directly, but said the future is bright in part because of competition between the United States and Russia.\n\"I think one of the things people are interested is when the administration talks about America First, what does that mean?\" he said.\n\"I can tell you in one word. It's competition. That the United States wants to be competitve, that when your country is looking for a place to purchase LNG that you think about America ... first,\" he added, referring to liquefied natural gas.\nPerry said there will be times when the United States and Russia are in conflict, but it's important for the fossil fuel producers of the world to find places where they can work together. He noted that Russia has helped shuttle U.S. astronauts into space in recent years.\nTensions between Russia and the United States remain high.\nLast year, Congress codified Obama-era sanctions into law and applied new penalties in response to Moscow's alleged meddling in the 2016 U.S. election. A special investigator is investigating whether the Trump campaign colluded with Russia and whether President Donald Trump obstructed justice by seeking to derail the investigation.\nU.S. shale takes center stage The panel also featured Saudi Energy Minister Khalid al-Falih, who has spearheaded a deal between OPEC and Russia to limit output and restore balance to the oil market. A surge in U.S. shale drilling, which uses advanced technology to squeeze oil and gas from rock formations, was a major factor in the 2014 oil price collapse.\nPerry said he doesn't believe the United States will once again play the \"spoiler\" in the oil market, arguing the world can sop up growing U.S. oil output. The country is nearing all-time high output above 10 million barrels a day and is expected to soon top Saudi production. Only Russia produces more at about 11 million barrels a day.\nThe last time the United States pumped 10 million barrels a day was in the 1970s, when oil demand was much lower, Falih noted.\n\"So for the U.S. to regain and even to exceed some of its market share in a much bigger market doesn't necessarily present a threat to other producers,\" he said.\nWith oil demand approaching 100 million barrels a day, the world should not be afraid of U.S. shale output, Novak said.", "external_links": [], "published": "2018-01-24T23:47:00.000+02:00", "crawled": "2018-01-25T00:15:10.000+02:00", "highlightTitle": ""}