{"organizations": [], "uuid": "cab4df6e6c921678f3f6a7dda37ed9de0983e099", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 30, "shares": 30, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/13/103710045-GettyImages-505759618.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/gunmaker-shares-rally-ahead-of-shot-show-next-week-in-las-vegas.html", "country": "US", "domain_rank": 767, "title": "Gunmakers look to new products to lift demand as big trade show opens next week", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T02:23:00.000+02:00", "replies_count": 0, "uuid": "cab4df6e6c921678f3f6a7dda37ed9de0983e099"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/gunmaker-shares-rally-ahead-of-shot-show-next-week-in-las-vegas.html", "ord_in_thread": 0, "title": "Gunmakers look to new products to lift demand as big trade show opens next week", "locations": [], "entities": {"persons": [], "locations": [{"name": "sands expo", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "smith & wesson", "sentiment": "negative"}, {"name": "national shooting sports foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images An attendee tries out an M&P 15-22 Sport rifle at the Smith & Wesson booth at the 2016 National Shooting Sports Foundation's Shooting, Hunting, Outdoor Trade (SHOT) Show at the Sands Expo and Convention Center on January 19, 2016 in Las Vegas, Nevada. \nAfter cooling demand for firearms in 2017, large manufacturers are hoping new models of pistols and long guns rolling out at the industry's big trade and convention next week in Las Vegas will generate strong consumer interest and boost sales in the coming year. \nThe National Shooting Sports Foundation's four-day SHOT Show officially kicks off Jan. 23 and is expected to attract around 65,000 attendees and hundreds of exhibitors. \nHistorically, the SHOT (or Shooting, Hunting and Outdoor Trade) Show can help drive demand by exciting collectors, sport shooters and other gun enthusiasts about new firearms and related products, say industry experts. One area that is getting more attention this year is the growing concealed-carry gun segment. \n\"Relative to last year, you're definitely seeing a flurry of new product introductions being brought to the market now just to sort of take advantage of what many perceive will be a better climate in 2018,\" said Rommel Dionisio, an industry analyst at Aegis Capital in New York. \nAhead of the show, shares of firearms maker Sturm Ruger surged nearly 2.4 percent on Friday and its rival American Outdoor Brands , parent of Smith & Wesson, picked up 1.6 percent. Also, gun and ammo maker Vista Outdoor rose 2.3 percent. \nIn contrast, AOBC's stock fell almost 40 percent last year and it slashed annual guidance in December due to what CEO James Debney called \"challenging market conditions.\" Even so, he told investors on the earnings conference call last month that this is a \"perfect environment to be launching new products.\" \n\"Last year, it was kind of a depressed year for firearms overall,\" said Dionisio. \"There was less of an urgency to go buy firearms because there was less fear of them being banned with a Republican president.\" \nPrior to the presidential election, the gun industry enjoyed a spike in sales and retailers had stocked up on firearms product thinking that Democrat Hillary Clinton, a backer of tougher gun control regulation, would prevail over her Republican challenger Donald Trump. However, after the Trump win retailers faced bloated inventories and manufacturers experienced weaker orders and tougher comparisons. \n\"The eight-year assault on your Second Amendment freedoms has come to a crashing end,\" Trump said in a speech to the National Rifle Association gathering in April. \"You have a true friend and champion in the White House.\" \nSmith & Wesson had about 100 new products at last year's SHOT Show, and this year is expected to showcase both pistol and rifle models, including a new M&P2.0 pistol and a sport rifle. \nEven in the current tough environment, Smith & Wesson has been gaining market share against competitors in some categories, including hunting rifles. \nFor its part, rival Ruger is showcasing its new EC9s, a value-priced model of its LC9s pistol, as well as a next-generation precision rifle — the so-called Gen 3 with enhanced scope clearance. \nAccording to Dionisio, Ruger's new EC9 subcompact pistol model is \"aimed at the fast-growing 'concealed-carry' segment.\" \nIn December, the House passed a bill that allows licensed \"concealed-carry\" gun permit owners to take their firearms across state lines. Today, there are more than 16 million concealed-carry permit holders, according to estimates from the Crime Prevention Research Center. \nRuger's new EC9 model is expected to sell for just under $300 and is essentially similar in size to Smith & Wesson's M&P Shield 2.0 model, which has a suggested retail price of $479. \nMeantime, Dionisio has \"buy\" ratings on AOBC and Ruger, making the case that the demand for firearms will improve after a tough year. \n\"As retail inventories normalize, I still believe in the long-term growth prospects of the industry,\" he said. ", "external_links": [], "published": "2018-01-20T02:23:00.000+02:00", "crawled": "2018-01-20T02:27:52.005+02:00", "highlightTitle": ""}