{"organizations": [], "uuid": "8dd33c4248cebec14a470d88e0155e2766bca3a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/17/104590811-RTS11VE3.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/earnings-will-be-the-next-test-for-the-seemingly-unstoppable-30-trillion-stock-market.html", "country": "US", "domain_rank": 767, "title": "Earnings will be the next test for the seemingly unstoppable $30 trillion stock market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-13T00:55:00.000+02:00", "replies_count": 0, "uuid": "8dd33c4248cebec14a470d88e0155e2766bca3a0"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/earnings-will-be-the-next-test-for-the-seemingly-unstoppable-30-trillion-stock-market.html", "ord_in_thread": 0, "title": "Earnings will be the next test for the seemingly unstoppable $30 trillion stock market", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}], "locations": [], "organizations": [{"name": "market insider earnings", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "none"}, {"name": "goldman sachs , bank of america", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Earning season presents the next hurdle for stocks, and Wall Street's bull market is expected to leap right over it, with some help from tax reform.\nWith little economic data expected in the coming week, earnings could be the main event for markets with many large financial institutions – such as Goldman Sachs , Bank of America, Citigroup and A merican Express – reporting. IBM also reports though tech companies will be dominating results later in the month.\n\"The pivotal question is we will be getting guidance on tax reform. We know it's a positive, we just don't know how much,\" said Lori Calvasina, who heads U.S. equity strategy at RBC.\nThe fourth quarter is the final quarter where corporations were subject to the 35 percent corporate rate, and now companies are expected to detail how the new tax law will affect them. \"The risk is the net effect isn't as positive as expected,\" she said.\nshow chapters JP Morgan rallies on earnings, but that's bad news for one trader 21 Hours Ago | 01:33 But Calvasina said she believes after studying the comments from more than 200 major companies, there still is not clarity from managements, and the impact on profits is not fully priced in, as a result. \"There's probably more upside risk than downside risk,\" she said.\nTax reform is one of the factors that has helped the stock market rally into the new year, and the bull still appears unstoppable early on in the earnings season. According to Bespoke, U.S. stock market value, measured by the Russell 3000, crossed $30 trillion for the first time Friday, and it is now up more than $6.5 trillion under President Donald Trump. The Russell 3000 represents about 98.5 percent of the U.S. market cap.\nThe S&P 500 is up more than 4 percent since just the beginning of the year, having tagged on another 1.5 percent in the past week. The market has been lifted by expectations for a strong economy , and the prospect that earnings will be good and get even better, when the impact of new 21 percent corporate tax rate is factored in.\nSource: Bespoke\nPaul Hickey, co-founder of Bespoke, said he sees a warning sign in the earnings this season. \"The pace of positive revisions to negative revisions haven't been higher than at any time in 10 years. That's a function of the tax bill,\" said Hickey. \"This is the first quarter in 13 quarters when there's been more positive revisions in the month leading up to earnings than negative revisions.\"\nThe concern is that analysts lowered the bar with reduced estimates, ahead of those other earnings reporting seasons, making it easier for stocks to realize an earnings pop, but this time, analysts are raising the bar.\n\"Early on, in these reports, we want to see stocks reacting well, and so far its been pretty good. It's early,\" said Hickey, adding the real test will come when tech names report. Those have been the best performers of 2016, and the group as a whole is expected to see the least benefit from the tax bill.\nshow chapters IBM a sleeper earnings pick? 21 Hours Ago | 03:59 For the fourth quarter, earnings are expected to grow by 12.1 percent, according to Thomson Reuters. Energy companies are expected to see the best profit growth, up nearly 140 percent, followed by materials, up 25 percent, according to Thomson Reuters. Financial companies are expected to see 13 percent earnings growth for the fourth quarter.\nOf the roughly two dozen companies that have reported so far, about three in four have beaten expectations.\nCalvasina said if earnings estimates are raised by 10 percent after companies reveal the impact of tax law changes, the price to earnings ratio would fall to 17.6 from about 19.4.\n\"I don't think the tax is going to take market valuations and make them look cheap, but it's going to give us some breathing room,\" she said.\nCalvasina expects the S&P 500 to finish the year at 3,000. Like many analysts, she does see a pullback coming this year after barely a sell off last year. \"I don't think an imminent pullback is coming. I think it's going to be later this year,\" she said.\nEven so, some traders are getting a bit anxious about the way the market has run higher. \"There's a pain trade being created,\" said Scott Redler, partner with T3Live.com who follows the short term technicals. \"Sometimes fast and furious markets might be great for statements and 401ks, but for traders, when you get a little extreme, it definitely creates anxiety and a little more stress than if you had a pause.\"\n'When you're up six, seven, eight, nine days, it makes you feel like you're chasing, and as a trader it's harder to enter. You remember the prices you had a week ago,\" he said. \"Traders are probably a little more anxious and frustrated than they were with the S&P 40 handles lower.\"\nOn the economic front, there are a few reports in the week ahead. Industrial production is expected Wednesday, as is the Fed's beige book and Treasury international capital flow data is also due that day. Housing starts are Thursday, and consumer sentiment is Friday.\nWhat to Watch Monday\nMartin Luther King Jr. Day\nMarkets closed\nTuesday\nEarnings: Citigroup, UnitedHealth, Charles Schwab, Comerica, First Republic Bank, CSX, Interactive Brokers, Pinnacle Financial\n8:30 a.m. Empire State manufacturing\nWednesday\nEarnings: Bank of America , Goldman Sachs, US Bancorp, Fastenal, Alcoa, SLM, Hancock Holding\n8:30 a.m. Business leaders survey\n9:15 a.m. Industrial production\n10:00 a.m. NAHB survey\n2:00 p.m. Beige book\n4:00 p.m. TIC data\nThursday\nEarnings: American Express , IBM , Morgan Stanley , Bank of NY Mellon, BB&T KeyCorp, JB Hunt, Commerce Bancshares, Canadian Pacific Railway, Taiwan Semiconductor\n8:30 a.m. Initial claims\n8:30 a.m. Housing starts\n8:30 a.m. Philadelphia Fed survey\nFriday\nEarnings: Kansas City Southern, Synchrony Financial, Schlumberger, First Horizon, Citizens Financial\n10:00 a.m. Consumer sentiment\nWATCH: Markets after the start of Q4 earnings season show chapters Markets after the start of Q4 earnings season 2:59 PM ET Fri, 12 Jan 2018 | 00:14", "external_links": [], "published": "2018-01-13T00:55:00.000+02:00", "crawled": "2018-01-13T01:50:26.038+02:00", "highlightTitle": ""}