{"organizations": [], "uuid": "1a48b641bfe0b7ee1dce3a916ca4a0ef2bee5cf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936110-GettyImages-486958975.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/gig-job-workers-had-better-beware-of-pay-as-you-go-tax-payments.html", "country": "US", "domain_rank": 767, "title": "Independent workers better beware of pay-as-you-go tax payments", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T16:19:00.000+02:00", "replies_count": 0, "uuid": "1a48b641bfe0b7ee1dce3a916ca4a0ef2bee5cf1"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/gig-job-workers-had-better-beware-of-pay-as-you-go-tax-payments.html", "ord_in_thread": 0, "title": "Independent workers better beware of pay-as-you-go tax payments", "locations": [], "entities": {"persons": [{"name": "julie thurston", "sentiment": "none"}, {"name": "alex marlantes", "sentiment": "none"}], "locations": [], "organizations": [{"name": "getty images  workers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Workers who venture into the world of side hustles or gig jobs might get an unwelcome surprise when they file their tax returns : an unexpected tax penalty.\nIndependent workers — those who don't have taxes withheld by an employer — should be paying estimated taxes. Yet a recent survey showed the majority (59 percent) of these solo workers do not make these four-times-a-year payments. They said they do not need to (42 percent) or don't know what estimated taxes are (17 percent).\n\"If you're new to independent work or freelancing, there's no one [explaining] how to pay your taxes,\" said Alex Marlantes, co-founder and CEO of mileage-and-receipt tracker app Everlance, which conducted the survey late last year of 1,528 self-identified independent workers.\nHere's what you should know: The federal tax system is a pay-as-you-go deal, meaning you are expected to pay taxes on income as you earn it throughout the year.\nIf you don't have an employer withholding those taxes from your paycheck and sending them to the IRS and your state's tax department, the onus is on you to make those payments on a quarterly basis. (See chart below for this year's due dates.)\nYou also should be aware that just because the new tax law lowered rates on income for 2018 through 2026 and created a 20 percent deduction for qualifying earnings from self-employment, the legislation did not remove self-employment taxes.\nThis means it still doesn't take much to owe the government. If you have net earnings — your business income less expenses — of at least $400, that amount is subject to the 15.3 percent self-employment tax.\nThat levy encompasses a 12.4 percent Social Security tax and 2.9 percent Medicare tax and is applied to income up to $128,400 in 2018 (up from $127,200 in 2017). Income above that threshold is subject only to the 2.9 percent Medicare tax, with incomes above $200,000 ($250,000 for married couples filing jointly) are also hit with an additional 0.9 percent Medicare tax.\nPayment period Due date January 1 to March 31 April 17, 2018 April 1 to May 31 June 15, 2018 June 1 to August 31 September 17, 2018 September 1 to December 31 January 15, 2019 While employees of companies also are subject to these taxes, their employer pays half. A self-employed person — as both the employer and employee — pays both shares. However, half of that tax generally can be deducted, which lowers your adjusted gross income.\nAs for the 20 percent deduction on qualifying income, the new law imposes some limits. Generally speaking, to qualify for the full deduction, your taxable income must be below $157,500 if you are single or $315,000 if you are married and file a joint tax return.\nThat deduction is in addition to lower income tax rates on individuals , which you also will pay on your business income as an independent worker.\nYet even if you end up paying less in a taxes this year than you did for 2017 as a self-employed worker, don't make the mistake of thinking you don't need to pay estimated taxes. The IRS can (and will) assess penalties in certain situations. In most cases, if you owe more than $1,000 in taxes at the end of the tax year, you will owe a penalty unless:\n1) You earn less than $150,000 and pay 90 percent of your current-year tax burden or 100 percent of the previous year's tax bill; or\n2) You earn more than $150,000 and pay at least 90 percent of your current-year tax burden or 110 percent of what you paid the previous year.\nWhile the above generally holds true for all workers, employees whose taxes are withheld from their paychecks generally are less likely to underpay by enough to generate a penalty.\nshow chapters Mnuchin, taxes and the budget      4 Hours Ago | 01:16 If you do incur a penalty, the amount you'll pay depends on how much you owe the IRS and how long you've owed it. For each payment period, a penalty is applied for underpayment. The rate, which is set by the IRS and fluctuates, has been in the 4 percent neighborhood in recent quarters.\nMany self-employed workers can refer to their previous year's tax burden to gauge what they will owe in the current year. If you're new to estimated taxes, it can be trickier.\nGenerally speaking, however, you can start by subtracting your business expenses from your business income. You'll also need to know what deductions and credits you will be taking for 2018 — there aren't many left for individuals to take — and what income tax rate you will pay. (You pay that in addition to the self-employment tax).\nIf you have other sources of income — whether from a job that withholds taxes or from, say, interest or dividends — those amounts also should be part of your calculation. Remember that any tax withholdings from a paycheck count toward your total expected tax burden.\n\"You should be putting away 30 cents of every dollar that comes through the door in preparation of taxes.\" -DeDe Jones, Managing director of Innovative Financial After you arrive at a number that you need to pay throughout the year, divide it by four and make plans to mail off your payment by the due date. Estimated tax payments are done using Form 1040-ES. And don't forget your state might also want its share.\nThen, most importantly, you need to set aside some of your income so you have the money to pay those taxes.\n\"You should be putting away 30 cents of every dollar that comes through the door in preparation of taxes,\" said certified financial planner DeDe Jones, managing director of Innovative Financial in Lakewood, Colorado. \"If you never the see the money, you can trick yourself into thinking you don't have it.\"\nIf you have additional income from an employer that withholds taxes from your paycheck, you also can increase your withholdings to reflect the higher tax bill you'll pay due to self-employment.\nIt's also important to keep good records of your business expenses, Jones said. Online apps can help you keep track of receipts, mileage and other business-related costs.\nJones also recommends setting up online payments with the IRS to make your estimated tax payments easier.\nMore from Your Money Your Future: \nThat 20 percent tax break for small businesses is no free-for-all. How to navigate \nStudent loan nightmare: Some borrowers have to start over \n5 key differences between Roth and traditional IRAs", "external_links": [], "published": "2018-01-17T16:19:00.000+02:00", "crawled": "2018-01-17T16:50:07.000+02:00", "highlightTitle": ""}