{"organizations": [], "uuid": "4b95c84b8ef5ab85e7dfb374ddf6cdd42ff85b49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104902083-AP_17349602238046.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/space-companies-got-3-point-9-billion-in-venture-capital-last-year-report.html", "country": "US", "domain_rank": 767, "title": "Space companies received $3.9 billion in private investment during 'the year of commercial launch'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "4b95c84b8ef5ab85e7dfb374ddf6cdd42ff85b49"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/space-companies-got-3-point-9-billion-in-venture-capital-last-year-report.html", "ord_in_thread": 0, "title": "Space companies received $3.9 billion in private investment during 'the year of commercial launch'", "locations": [], "entities": {"persons": [{"name": "chad anderson", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "cape canaveral", "sentiment": "none"}], "organizations": [{"name": "spacex falcon", "sentiment": "negative"}, {"name": "nasa", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "space angels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The entrepreneurial space age is well underway.\nPrivate investors poured $3.9 billion into commercial space companies last year, a record according to a report from investment firm Space Angels.\nIt said venture capital is pouring into the sector and finding success: Over 120 firms made investments in space last year, topping a peak of 89 in 2015. The last eight years have seen around $25 billion in exits, as acquisitions and public offerings take venture capital investments from start-ups to the next level. \n\nSource: Space Angels \n\"2017 was the year of commercial launch,\" Space Angels CEO Chad Anderson told CNBC. \"The amount of capital put in was the key turning point\" in a year that saw 37 commercial launches and 51 government launches.\nThe report provides a commercial designation to divide the private and public sectors. That difference is one which Anderson says is \"hotly contested\" in the space industry today — and for good reason.\n\"Everybody wants to be categorized as a commercial company to take advantage\" of government incentives, Anderson said. He said that conversations about NASA's Commercial Cargo and Commercial Crew programs focus on the government trying to find more ways to support private rocket companies.\n\"It is undeniable that entrepreneurial space companies are disrupting the launch industry,\" Anderson said. \"What we haven't seen is a revolutionary new class of launch vehicle, developed by incumbents in response. Instead, what we've seen is corporate venture arms and efforts to lobby the government for increased subsidies.\"\nSo what counts as commercial? According to Space Angels, a company must fulfill three criteria: developed by a nongovernment-owned profit-seeking entity, built with risk-capital that is at least 25 percent of the total development costs and serving government and nongovernment customers. The report counts 303 commercial companies as fulfilling that standard, with 60 of those in the launch and lander vehicle category.\n\"In a world where we're inundated with loads of information, knowledge and wisdom comes from knowing what to exclude,\" Anderson said. \"There are people claiming there are 10,000 commercial space companies.\"\nThe Space Angels definition reveals further data: Today's commercial rockets are more reliable and more cost-effective than government rockets.\n\nThat competitiveness means commercial launches are now rivaling government launches on more than just price. The report compares the commercial and government rockets in development to find how much it will cost both fleets to reach 500,000 kilograms of launch capacity. The results show that by 2025 it will cost $6.6 billion for government rockets and $4.2 billion for commercial rockets — or $2.4 billion less for the private sector.\n\"Government used to have a ton of capacity sitting on the ground, ready to go, and that fell off significantly,\" Anderson said.\nThe vast majority of private space investment has come as the government has reeled in its spending in recent years. Bank of America Merrill Lynch predicted in October that the space industry would reach at least $2.7 trillion in the next three decades, up from about $350 billion today.\nThe Space Angels portfolio includes rocket builder Vector , asteroid miner Planetary Resources and satellite start-ups Iceye and Planet. \nCorrection: This story was updated to clarify that the $3.9 billion was from private investments into commercial space companies.", "external_links": [], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T15:57:06.012+02:00", "highlightTitle": ""}