{"organizations": [], "uuid": "75d82b57180a4354e66c37db332402105e91c952", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936618-GettyImages-903005540.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/how-trump-can-win-at-davos-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump should not ‘make nice’ at Davos, but he should act presidential", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:35:00.000+02:00", "replies_count": 0, "uuid": "75d82b57180a4354e66c37db332402105e91c952"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/how-trump-can-win-at-davos-commentary.html", "ord_in_thread": 0, "title": "Trump should not ‘make nice’ at Davos, but he should act presidential", "locations": [], "entities": {"persons": [{"name": "steny ho", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "jim watson", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "anthony scaramucci", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Jim Watson | AFP | Getty Images President Donald Trump (C) listens as US Congressman Steny Hoyer (R), D-Maryland speaks during a meeting with bipartisan members of the Senate on immigration at the White House in Washington, DC, on January 9, 2018. \nThe White House has confirmed that President Donald Trump will attend the World Economic Forum in Davos, Switzerland later this month. \nWhat a difference a year makes. \nLast year, then-President-elect Trump spurned the event, reportedly because he thought the elitist confab would betray his populist message and supporters. Instead, the administration sent Davos regular Anthony Scaramucci to represent the incoming administration in a relatively muted role. \nBut now it's 2018. Populist leader and advisor Steve Bannon is gone at the White House. A pro-business tax reform bill has been passed. President Trump is cheering and taking credit for the stock market rally on a near-daily basis. \nThis announcement seems right in line with the purge of the Bannon influence in the Trump administration. The president may now feel like it's time to play a more traditional and established role. After almost a year of playing the outsider, perhaps he's now ready to mingle with the world's top CEOs and political leaders to talk business, trade deals and security. \nBut there's just as much evidence that this will not be some kind of \"make nice\" visit. \nThe Trump administration is still about to announce new tariffs on some Chinese imports in a continuing effort to achieve what President Trump calls \"fair trade.\" With that in mind, President Trump could just as well be looking to go to Davos as more of a conqueror and proceed to bluntly tell off the assembled visitors about a number of issues. \nThat's precisely what he did at the NATO summit last May. He insisted that the European NATO members could and should spend more on defense and it apparently worked. \nThe Trump administration has also made no indication that it will reverse its decision to withdraw from the Paris Climate Agreement. Climate change has long been a cause celebre at Davos. \nSo there's a good chance that President Trump's decision to go to Davos is less about a polite joining of the establishment elite and more about telling it off. \nObviously, there's a happy medium here. President Trump doesn't need to be rude when and if he makes his case for better European border security and handling of the Islamic refugee/migrant issue. He doesn't need to angrily call China a trade manipulator right to the Chinese leaders' faces. He doesn't have to taunt foreign countries over the fact that so much U.S. corporate cash is expected to flow back to America thanks to the new tax rates. \nBut he can make all of those points clearly and without apology in the way President Ronald Reagan used to encourage Europe to stand up to the old Soviet Union. He can insist there is a humane way to deal with the refugee crisis without keeping the borders wide open. He can make the case that there is a way to enact fairer trade deals. \nFinally, there's the current elephant in the room. The release of Michael Wolff's new book \"Fire and Fury\" has tongues wagging all over the world about President Trump's fitness for office . In this environment, what better way to fend off such talk than by sending President Trump to rub elbows and speak publicly and clearly about burning economic and political issues? \nThe more he is seen with his international peers, the better and more competent President Trump looks to the world. Trump still considers himself a businessman, so it would be a more comfortable venue for him than a purely political forum. \nThe fact is President Trump's previous international visits have worked out just fine for him. His trip to Saudi Arabia to push for real reforms in that country's approach to terrorism and its own internal governance definitely yielded results. His trip to Europe in the spring of last year did lead to more NATO member defense spending. \nThat track record and the current political climate make a Trump appearance at Davos a very easy decision to make. As long as he doesn't suddenly change his public persona during the forum, it will boost his image as a president engaged with the world and one who is willing to change course over time. \nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-09T21:35:00.000+02:00", "crawled": "2018-01-09T22:00:18.021+02:00", "highlightTitle": ""}