{"organizations": [], "uuid": "6e8cc0ea06200387189abd2820f92a70e82bf994", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/moon-landing.jpg", "site_section": "http://news.google.com/news?cf=all&ned=us&hl=en&topic=t&output=rss", "section_title": "Sci/Tech - Google News", "url": "http://fortune.com/2018/01/24/google-xprize-moon-competition/", "country": "US", "domain_rank": 1196, "title": "Google Wanted to Give Away $30 Million for Landing on the Moon. But Nobody Won - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:49:00.000+02:00", "replies_count": 0, "uuid": "6e8cc0ea06200387189abd2820f92a70e82bf994"}, "author": "", "url": "http://fortune.com/2018/01/24/google-xprize-moon-competition/", "ord_in_thread": 0, "title": "Google Wanted to Give Away $30 Million for Landing on the Moon. But Nobody Won - Fortune", "locations": [], "entities": {"persons": [{"name": "aric jenkins", "sentiment": "none"}, {"name": "jack schmitt", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "fortune space travel google", "sentiment": "negative"}, {"name": "time life pictures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Space Travel Google Wanted to Give Away $30 Million for Landing on the Moon. But Nobody Won Apollo 17 astronuat Jack Schmitt standing on surface of moon while holding rake full of rock samples, w. Rover in distance Time Life Pictures The LIFE Picture Collection/Getty Images By Aric Jenkins 10:48 AM EST \nAfter 10 long years, the Google -sponsored competition to land a robot on the moon for millions of dollars will end without a winner. \nThe XPrize foundation, which hosted the competition in collaboration with Google , announced Tuesday that the grand prize of $30 million will go unclaimed since none of the five teams will be able to reach the moon by the March 31st deadline. While the nonprofit said that it “did expect a winner by now,” it may move forward with a new sponsor to fund a prize if possible or reframe the Lunar XPrize as a non-cash competition. \nA decade ago, teams were challenged to land an unmanned spacecraft on the moon, move the device around the surface for at least 500 meters, and then send photos and video back to Earth. The deadline was pushed back several times, but XPrize finally decided to halt the competition “due to the difficulties of fundraising, technical and regulatory challenges.” \nXPrize argues that it still succeeded in some ways because it “sparked the conversation and changed expectations with regard to who can land on the Moon.” Indeed, a number of private spaceflight companies such as Elon Musk’s Space X , Richard Branson’s Virgin Galactic, and Jeff Bezos’ Blue Origin have sprung up in recent years with goals to usher in space tourism. \n“We set out on this journey in 2007, excited by the potential of the prize to spur innovation and discovery in commercial space travel,” an XPrize spokesperson said. “Though the prize is coming to an end, we continue to hold a deep admiration for all Google Lunar XPrize teams, and we will be rooting for them as they continue their pursuit of the moon and beyond. To all teams, thank you for inspiring us to dream big and work hard.” \nThe nonprofit added that Google awarded more than $6 million to teams over the course of the competition “in recognition of the milestones they have accomplished.” SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-24T17:49:00.000+02:00", "crawled": "2018-01-24T20:15:00.036+02:00", "highlightTitle": ""}