{"organizations": [], "uuid": "c53f84a2f3d4758738c8eb8e2a1c19e30a8f2307", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934671-LindseyVonnski.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/top-mental-coach-shares-steps-to-handling-pressure-like-an-olympian.html", "country": "US", "domain_rank": 767, "title": "Mental coach of top athletes shares 3 steps to handling pressure like an Olympian", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T18:04:00.000+02:00", "replies_count": 0, "uuid": "c53f84a2f3d4758738c8eb8e2a1c19e30a8f2307"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/top-mental-coach-shares-steps-to-handling-pressure-like-an-olympian.html", "ord_in_thread": 0, "title": "Mental coach of top athletes shares 3 steps to handling pressure like an Olympian", "locations": [], "entities": {"persons": [{"name": "andrew wiggins", "sentiment": "none"}, {"name": "ben simmons", "sentiment": "none"}, {"name": "graham betchart", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "minnesota timberwolves", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ufc", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "graham betchart mental", "sentiment": "none"}, {"name": "john f. kennedy university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:04 SHARES \nA half-pipe course lasts about 22 seconds. Alpine skiers fly through the air for five seconds. Figure skaters complete three twirls in a breath. \nDuring the 2018 Winter Olympics , which kick off in a month, athletes will have a handful of very brief moments to show the world what they have spent their lifetimes training for. \nThat means pressure. \nIf you think Olympians are impervious to pressure, according to mental coach Graham Betchart , you're wrong. \"Every human being feels these feelings,\" he tells CNBC Make It . What the best do is take the necessary steps to thrive, rather than fold, when that moment finally arrives. Source: Graham Betchart Mental coach Graham Betchart \nSince receiving his masters in sports psychology from John F. Kennedy University in 2008, Betchart hashelped train countless athletes in mental toughness, including UFC fighters, NFL players and three recent NBA No. 1 draft picks — the Philadelphia 76ers' Ben Simmons, as well as the Minnesota Timberwolves' Karl-Anthony Towns and Andrew Wiggins. He's currently designing the mental training program for U.S.A. Basketball's youth program. \nHere are the three steps, he says, that Olympians take to perform in a pressure situation: 1. Get comfortable being uncomfortable \n\"You have to find a way to get into the moment, get into your body, trust your training,\" he says, \"even though literally everything is on the line and the entire world is watching.\" This is where the training comes in, because it takes years of preparation to stay calm in uncomfortable situations. Alain Grosclaude/Agence Zoom | Getty Images Lindsey Vonn of USA competes during the Alipine Ski World Cup Women's Super G on December 16, 2017 in France \n\"If you've never experienced feeling a little vulnerable or being uncomfortable, and you've always resisted that feeling... that's going to sabotage your performance,\" says Betchart. \nSo don't resist. \"Welcome it in,\" says Betchart. \"Then what you find is: What your afraid of is not as big a deal. What makes it a big deal resisting it.\" \nThe sports psychologist offers one anecdote from a personal experience. \"Before my wife gave birth, I'm not telling her everything's going to feel great,\" he says. Instead, he told her: \"You know the deal. This is a legendary uncomfortable moment. But if you embrace it, that takes away the panic, the anxiety and the fear. You're still going to be uncomfortable, but you don't have the anxiety. And that allows you to perform.\" 2. Reframe your feelings \nBeing okay with a discomfort is one thing, but, to take this a step further and truly thrive under pressure, you need to reframe what you are feeling in a positive light. \"Reframing is everything,\" says Betchart. \n\"The really good basketball players have told themselves it's not nervousness [that they're feeling]. They've told themselves it's excitement and joy.\" show chapters ", "external_links": [], "published": "2018-01-09T18:04:00.000+02:00", "crawled": "2018-01-09T18:15:47.078+02:00", "highlightTitle": ""}