{"organizations": [], "uuid": "b4c1107430be8f90b4dc3d2f71e2abd135175d42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/15/104653649-GettyImages-507832693.1910x1000.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&q=cable&cf=all&output=rss", "section_title": "cable - Google News", "url": "https://www.cnbc.com/2018/01/05/cable-rates-keep-rising-but-you-might-not-have-to-pay-up.html", "country": "US", "domain_rank": 767, "title": "Cable rates keep rising, but you might not have to pay up - CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T16:55:00.000+02:00", "replies_count": 0, "uuid": "b4c1107430be8f90b4dc3d2f71e2abd135175d42"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/cable-rates-keep-rising-but-you-might-not-have-to-pay-up.html", "ord_in_thread": 0, "title": "Cable rates keep rising, but you might not have to pay up - CNBC", "locations": [], "entities": {"persons": [{"name": "robert daly", "sentiment": "none"}], "locations": [], "organizations": [{"name": "comcast", "sentiment": "negative"}, {"name": "cnbc tech guide cable", "sentiment": "negative"}, {"name": "s&p global market intelligence", "sentiment": "none"}, {"name": "directv", "sentiment": "none"}, {"name": "getty images  cable", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cable and satellite TV providers are ringing in the new year with an unwelcomed gift: higher cable bills.\nComcast , for instance, says customer bills will rise 2.2 percent, on average, in 2018. AT&T is raising DirecTV's prices by up to $8 a month in mid-January. Smaller providers are planning increases, too.\nOver the past decade, prices for TV service have risen almost twice as fast as inflation, according to an analysis of government data. Data provider S&P Global Market Intelligence says customers' cable and satellite TV bills have soared 53 percent since 2007, to $100.98 in 2017.\nAnnual rate hikes are as guaranteed as death and taxes. But you can push back and trim your bill.\nWhy prices rise Cable companies point to rising fees they pay to carry TV networks. The networks, in turn, have their own rising costs — particularly sports, as they willingly pay more to sports leagues for what they consider must-have programming. But the networks also know they can pass those costs back to cable companies and ultimately their subscribers.\nIt's industry convention that a cable bundle needs live sports. Otherwise, cable companies risk losing subscribers to Netflix and other sports-less alternatives.\nThe consulting firm PwC estimates that sports leagues in North America raked in $18.4 billion in 2016 from TV, radio and tech companies that stream games, up from $11.6 billion in 2012. That's expected to keep growing as tech companies such as Amazon and Facebook become more interested in sports, meaning more competition for rights to televise games.\nThe big winner in the TV ecosystem? \"If anyone's the beneficiary it's NFL players,\" Pivotal Research Group analyst Brian Wieser said.\nMeanwhile, to get the biggest audience possible, many entertainment companies like Disney require cable companies to include expensive channels in the most popular bundles. Verizon tried to offer a cheaper package by dropping Disney's ESPN from a basic package, making it an optional add-on. ESPN sued, and now Verizon offers a sports-focused basic package with ESPN alongside ones that doesn't have sports.\nBeyond sports, networks pay for high-quality TV series to compete with hits on Amazon, Netflix and other services. Those costs are passed along, too.\nIn all, S&P Global Market Intelligence estimates that network fees that cable companies are paying are nearly 2.5 times what they were a decade ago.\nPush back You can threaten to ditch your cable company in hopes of getting a discount. Companies will often offer a promotional rate for a year or two — though they may also try to get you to upgrade packages in the process. BillFixers, a service that fights on your behalf in return for a cut of your savings, estimates that 55 percent of customers are on a promotion at any given time.\nBut just having a discount doesn't mean it's a good one. BillFixers' founder, Ben Kurland, recommends calling to complain about prices and rejecting the first deal offered. More often than not, a better discount will be available if you ask for it. Repeatedly.\nIf you decide to cut one of your services, like your home phone, but you feel that you are still paying too much, Kurland advises calling back again in a month and seeing if there are any new discounts.\nCable companies are already dealing with customers dropping TV service entirely. That hurts the networks, too, as their fees are based on the number of subscribers. It's in everyone's interest to keep you as a customer, even if you are paying less.\nMany promotions are automatic after you initially sign up for service and last for a year or two. That may protect you from immediate price hikes, at least partially. Those deals don't always include equipment charges and separate fees for over-the-air networks, including ABC, CBS, Fox and NBC (yes, you're paying for them, too, even though they are free with an antenna).\nCord-cutting An increasingly popular option is to just peace out. Though there are still 94 million cable and satellite TV customers, that's roughly 4 million fewer than two years ago, according to MoffettNathanson Research.\nYou don't have to drop TV networks completely. Online TV services such as YouTube TV, DirecTV Now and Sling TV offer smaller packages of channels, often for less than what cable charges. MoffettNathanson estimates these services have 3.5 million customers combined. Make sure the service has your favorite channels, as these services have notable gaps.\nAntennas are also available for $50 or less. You get over-the-air networks for free, although reception might not be perfect.\nBe careful: Paying for online services to replace TV could eventually add up to more than a $100 cable bill, especially as more services are created to compete for your dollars. Disney, for instance, is pulling its movies from Netflix and plans its own streaming service in 2019. On the other hand, it's easy to cancel after a month or two of catching up on shows; cancelling cable is a chore by comparison.", "external_links": [], "published": "2018-01-05T16:55:00.000+02:00", "crawled": "2018-01-05T17:06:33.036+02:00", "highlightTitle": ""}