{"organizations": [], "uuid": "5a99aac3e23eb0e4a4f0386e74633228233227fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/11/100634586-20110301-2068-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/january-and-its-unusual-string-of-new-highs-is-setting-a-good-tone-for-the-market.html", "country": "US", "domain_rank": 767, "title": "January and its unusual string of new highs is setting a good tone for the market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T02:10:00.000+02:00", "replies_count": 0, "uuid": "5a99aac3e23eb0e4a4f0386e74633228233227fa"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/january-and-its-unusual-string-of-new-highs-is-setting-a-good-tone-for-the-market.html", "ord_in_thread": 0, "title": "January and its unusual string of new highs is setting a good tone for the market", "locations": [], "entities": {"persons": [{"name": "adam jeffery", "sentiment": "none"}, {"name": "detrick", "sentiment": "none"}, {"name": "ryan detrick", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "lpl financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As Januarys go, this one is looking to be particularly good for stocks.\nNot since 1964 has the S&P 500 started the year with six record highs, and for the Nasdaq, it's been since 1999, according to LPL Financial's Ryan Detrick. The S&P was up 13 percent in 1964, but the Nasdaq roared ahead 85 percent in 1999, before crashing shortly after.\nThe fact that the first five trading days of the year were positive was already a good omen. Detrick, senior market strategist, said when the first five days of a new year are up 2 percent or more, the full year has been higher 15 out of 15 times. The average gain in those years has been 18.6 percent.\n\"It sure seems like there's something to it,\" said Detrick. \"Even though it's a very small sample size it does suggest if you get the ball rolling it can very well continue. The fact it was such a strong start to the year just continues to reinforce the bull market is still alive and there's probably a lot more positives than negatives as we move out into 2018.\"\nDetrick said January looks to be sizing up to a positive month overall, and as the Wall Street saying goes, \"So goes January, so goes the year.\"\n\"Off to a good start and January is higher is just one more sign this could be a double-digit equity return year for investors,\" he said.\nBut a good January doesn't mean a good February, and Detrick said there could be a pullback in February, one of the weaker months, before the market moves higher in March and April, seasonally strong months.\nJulian Emanuel, chief equity and derivatives strategist at BTIG, said it's possible there could be a pullback even before next month. On Tuesday he released his S&P 500 year-end target of 3,000. The S&P closed Tuesday at 2,741, up 0.1 percent but up nearly 3 percent for the year so far.\n\"If it happens, January is a likely time for it,\" he said. \"I think it could happen later this month as you get closer to the government funding deadline of the 19th and a little later the [Federal Open Market Committee]. Not that the FOMC is going to be a catalyst in general, but there's a rich history of leadership transitions being a source of more volatility.\"\nThe Fed meeting Jan. 30-31 is the last to be chaired by Janet Yellen before she hands over the reins to Jerome Powell. The Fed is not expected to raise interest rates at that meeting.\nEmanuel said there was medium-term market volatility in past transitions of Fed chairs. \"[Ben] Bernanke took over in 2006. Obviously, the top came in 2007. [Alan] Greenspan on the other hand, took over in the summer of 1987, and literally you had the market crash within months of him taking over,\" he said.\nEmanuel said when Paul Volcker came in during the late 1970s, there was a massive surge in gold and interest rates.\nInterest rates could be a factor for markets Wednesday, after the 10-year broke 2.50 and hit a high of 2.55 percent Tuesday, its highest since March. The move in yields started with a move by the Bank of Japan to buy fewer bonds , which stirred speculation it was moving away from quantitative easing.\nBut strategists believe the move was more technical and the BOJ will continue its easy policies, at least for now.\nThe Treasury auctions $20 billion reopened 10-year notes at 1 p.m. ET Wednesday.\n\"I'm expecting average results. I don't think the dip buyers are going to come in just yet. We've got to see the data at the end of the week,\" said George Goncalves, head of fixed-income strategy at Nomura. CPI is reported Friday, and the markets have been awaiting inflation news.\n\"We broke through the 2.50 level [on the 10-year]. It's a psychological level. I don't think it's going to be a stellar auction,\" he said.\nStocks are being buoyed by the anticipated benefits of the tax cuts, economic growth and the prospect for strong earnings. The fourth-quarter earnings season gets underway Friday when J.P. Morgan and Wells Fargo report.\nThere are a few earnings Wednesday, including KB Home , Supervalu and Progress Software . On the economic front, there are import prices at 8:30 a.m. ET and wholesale trade at 10 a.m.", "external_links": [], "published": "2018-01-10T02:10:00.000+02:00", "crawled": "2018-01-10T02:16:39.012+02:00", "highlightTitle": ""}