{"organizations": [], "uuid": "5335224125c0297456f92550a0b9ba64f2fd1ed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/08/103699254-GettyImages-103460029.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/us-weekly-jobless-jan-13-2018.html", "country": "US", "domain_rank": 767, "title": "US jobless claims fall to 45-year low", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:30:00.000+02:00", "replies_count": 0, "uuid": "5335224125c0297456f92550a0b9ba64f2fd1ed0"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/us-weekly-jobless-jan-13-2018.html", "ord_in_thread": 0, "title": "US jobless claims fall to 45-year low", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "labor department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The number of Americans filing for unemployment benefits fell more than expected last week to the lowest level in 45 years, but the decline likely overstated the health of the labor market as data for several states were estimated.\nInitial claims for state unemployment benefits dropped 41,000 to a seasonally adjusted 220,000 for the week ended Jan. 13, the lowest level since February 1973, the Labor Department said on Thursday. Claims for the prior week were unrevised.\nEconomists polled by Reuters had forecast claims falling to 250,000 in the latest week. Claims had increased over the previous four weeks, with economists blaming difficulties adjusting the data for seasonal fluctuations around moving holidays and unseasonably cold weather.\nThe Labor Department said claims for California , Arkansas , Kentucky , Maine , Hawaii , Virginia , and Wyoming were estimated. Government offices were closed on Monday for the Martin Luther King holiday.\nIt also said claims-taking procedures continued to be disrupted in the Virgin Islands months after they were battered by Hurricanes Irma and Maria, while claims processing in Puerto Rico was still not back to normal.\nLast week marked the 150th straight week that claims remained below the 300,000 threshold, which is associated with a strong labor market. That is the longest such stretch since 1970, when the labor market was much smaller.\nThe labor market is near full employment, with the jobless rate at a 17-year low of 4.1 percent.\nLast week, the four-week moving average of initial claims, considered a better measure of labor market trends as it irons out week-to-week volatility, fell 6,250 to 244,500. The claims data covered the survey week for January's nonfarm payrolls.\nThe four-week average of claims rose 8,500 between the December and January survey periods, suggesting some moderation in the pace of job growth. Nonfarm payrolls increased by 148,000 in December after surging by 252,000 in November.\nJob growth is slowing as the labor market nears full employment. There has been an increase in companies reporting difficulties finding qualified workers. There are about 5.9 million job openings in the country.\nIn its Beige Book report of anecdotal information on business activity collected from contacts nationwide, the Federal Reserve said on Wednesday that \"most districts cited on-going labor market tightness and challenges finding qualified workers across skills and sectors.\"\nThursday's claims report also showed the number of people receiving benefits after an initial week of aid increased 76,000 to 1.95 million in the week ended Jan. 6. The four-week moving average of the so-called continuing claims gained 4,000 to 1.92 million.", "external_links": [], "published": "2018-01-18T15:30:00.000+02:00", "crawled": "2018-01-18T15:56:25.014+02:00", "highlightTitle": ""}