{"organizations": [], "uuid": "a916c1789e521941469565949edc0d8a3e7819dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938774-GettyImages-509780204.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/market-optimism-reaches-potential-danger-sign-not-seen-since-1986.html", "country": "US", "domain_rank": 767, "title": "Market optimism reaches 'potential danger' sign not seen since 1986", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T20:04:00.000+02:00", "replies_count": 0, "uuid": "a916c1789e521941469565949edc0d8a3e7819dd"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/market-optimism-reaches-potential-danger-sign-not-seen-since-1986.html", "ord_in_thread": 0, "title": "Market optimism reaches 'potential danger' sign not seen since 1986", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "investors intelligence", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Market optimism reaches 'potential danger' sign not seen since 1986 The difference between market optimism and pessimism on the Investors Intelligence survey is at a level last seen in April 1986, 18 months before Black Monday That wide spread could be indicative that sentiment is getting overdone. Bullishness is at 64.4 percent while bearishness is down to 13.5 percent. However, the market has done quite well during the current run of elevated optimism, with the S&P 500 up 7 percent over the past 14 weeks. 5 Hours Ago | 03:15 \nMarket optimism may be reaching a crescendo, with hopes that stocks will keep rising equaling a level not seen in 31 years. \nSpecifically, the difference between bullishness and bearishness among professional investors is at its highest since April 1986, according to the Investors Intelligence survey that gauges the outlook of newsletter authors. \nThose expecting the market to move higher numbered 64.4 percent, up from 61.9 percent a week ago, according to an II release Wednesday. That's equal to the reading of early November 2017. On the other side, those looking for the market to fall tumbled to 13.5 percent, which is the lowest level since August 2014. \nThe spread between the two numbers is 50.9 percent, up from 46.7 percent a week ago. That multidecade high normally would represent a contrarian signal that the market is getting into dangerously overbought levels. \nHowever, the time period when the spread was last this high inspires a particular reason for caution. Sentiment surveys can be contrarian indicators when they reach elevated levels, meaning that rampant bullishness is often a sell signal. \nBulls and bears showed a wide disparity in 1986, with optimism occasionally wavering then rebounding. That movement, of course, would yield brutal results a year and a half later when Black Monday hit the stock market and the Dow fell nearly 22 percent in one wicked October day. Michael Nagle | Bloomberg | Getty Images Yellow 'Caution' tape is displayed outside of the New York Stock Exchange (NYSE) in New York. \n\"Sentiment readings have roughly followed their 1987 pattern. Then the bulls peaked (near 65%) with initial market highs early that year and they returned to above 60% levels months later after more index records,\" wrote John Gray, editor of the Investors Intelligence weekly newsletter. \"In 1987 stocks crashed a few months after that. A repeat of that scenario suggests potential danger for over the near term, especially if the bulls take profits early in 2018!\" \nTo be sure, the market has performed well even in the midst of a 14-week streak of the bull-bear spread holding above 40 percent. The S&P 500 is up about 7 percent during that period. \nThis particular bull market, which is nearing its ninth anniversary, has featured low participation from retail investors, and thus could have more staying power as the mom and pop crowd gets more optimistic. \n\"There has been a marked shift in momentum the last couple of months, from years of rampant pessimism and skepticism, to now questions that have a much more of an optimistic and opportunistic tune to them,\" said Liz Ann Sonders, chief investment strategist at Charles Schwab. \nElevated levels of sentiment are \"a concern, but in and of itself is not a reason to throw in the towel and get out,\" Sonders said.", "external_links": [], "published": "2018-01-10T20:04:00.000+02:00", "crawled": "2018-01-10T20:27:39.001+02:00", "highlightTitle": ""}