{"organizations": [], "uuid": "0f64031a336ad8d7016178eb237eb3c4255b19c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/09/104272125-GettyImages-53042001.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/investors-pile-into-bond-funds-just-as-smart-market-money-turns-away.html", "country": "US", "domain_rank": 767, "title": "Retail investors make massive move into bond funds just as smart money says bonds going down", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T21:28:00.000+02:00", "replies_count": 0, "uuid": "0f64031a336ad8d7016178eb237eb3c4255b19c3"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/investors-pile-into-bond-funds-just-as-smart-market-money-turns-away.html", "ord_in_thread": 0, "title": "Retail investors make massive move into bond funds just as smart money says bonds going down", "locations": [], "entities": {"persons": [{"name": "goldberg", "sentiment": "none"}, {"name": "santschi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "treasurys", "sentiment": "none"}, {"name": "trimtabs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More than $36 billion has already flowed into bond funds in January, meaning U.S. retail investors are making the biggest bet on bond funds since October 2009, and at a time when many high-profile investors are sounding alarm bells about the end of the 30 year-plus bull market in bonds. \n\"The most remarkable flows are into bonds,\" said David Santschi, CEO of Trimtabs, which provided CNBC with the preliminary fund flow data, which also show strong flows into U.S. equity and international equity portfolios this month. \"Bond funds are down in the past four months,\" he said. \"The biggest mispricings in the world today are in bonds, not stocks.\" \nNot only are bonds down, but many expect bond losses to grow larger this year. Treasury yields hit their highest level since 2014 on Thursday.\nScott Olson | Getty Images Market gurus, including Jeff Gundlach and Ray Dalio, recently have sounded sour notes on bonds, with Gundlach's firm DoubleLine Capital saying that, among stock market hedges, it's commodities that look like a good bet for 2018 and that bond yields, which move inversely to bond prices, will continue to rise.\nBill Gross said last week that, after more than 30 years, the bond bear market has begun. The world's largest money manager, BlackRock, came into 2018 without a single overweight recommendation in the fixed-income universe.\nInvesting legend Bill Miller said in his latest letter to investors this week, \"I believe that if rates rise in 2018, taking the 10-year treasury above 3 percent, that will propel stocks significantly higher, as money exits bond funds for only the second year in the past 10. ... Bonds, in my opinion, have entered a bear market,\" Miller wrote, but he added, \"one that is likely to be benign for the next year or so.\" \nOne underlying data point that Miller's letter highlights is that investor interest in bond funds is not a sudden shift. Trimtabs data shows that bond funds took in more than $400 billion in 2017.\nCore bond funds are already down by 1 percent in 2018, and financial advisors expect those losses to accelerate. \n\"[10-year treasury] rates have risen and if they go above 3, we will see bond funds down 2, 3, 4 and 5 percent,\" said Mitch Goldberg, president of investment advisory firm ClientFirst Strategy. \n\"Is it a crushing blow? No. But it is significant,\" Goldberg said. \"If you ask the average investor if they think they can you lose money on a bond fund, I think they would say no.\n\"But this year they are more likely to be wrong than right in answering that way.\"\nBut Goldberg stressed sticking with bonds is also the lesser of two evils when compared to investors tinkering with long-term investing plans and portfolio allocations.\nInvestors have reasons to buy unloved bonds It may seem counterintuitive, but there's plenty of support for the argument that investors are actually doing the right thing by moving into bonds. It is annual portfolio rebalancing season and, given the huge gains in all stock markets around the world last year, portfolio allocations between stocks and bonds would have moved well away from target weightings.\n\"You can't escape the fact that, for most investors, bonds will make up a portion of their portfolio,\" said Douglas Boneparth, president and founder of Bone Fide Wealth and a member of the CNBC Digital Finance Advisor Council. \"Even millennial clients we work with have 20 percent in fixed income.\"\nBoneparth said that, based on his recent moves, the most likely explanation for the surge into bond funds is rebalancing. \"We've been watching 5 to 10 percent of portfolios that have created built- in risk over the past few years and now are moving out of equities and back into fixed income,\" he said. \"You're probably seeing a lot of that take place at the retail level.\"\nMore from Investor Toolkit: \nInvesting with borrowed money can be a big win \nThe biggest risks for 2018 \nFinancial planning is not meant to be a quick fix \nWhile it may reflect a stay-the-course philosophy, it still leaves Trimtabs' Santschi scratching his head — and issuing a warning.\n\"It doesn't bode well for the bond market to see this retail enthusiasm,\" he said. \"Usually when retail investors buy, they tend to be wrong.\"\nThe Trimtabs CEO said that, even accepting the argument about annual rebalancing and the fact that an aging demographic has greater need for income investments, investors could choose to go into cash or cash equivalents instead of bonds likely to go down in value. Some bank certificates of deposit are now yielding as much, in some cases more, than Treasurys. \"There are other asset classes than stocks and bonds,\" Santschi said. \"There's cash, real estate, commodities, precious metals.\" \nCash equivalents and inflation-protection are alternatives Goldberg said that investors who continue to hold longer-term bonds should expect fluctuations and, if they look closely at statement this year, losses in the bond holdings. But it's not a reason to sell. And most retail investors aren't in bonds for the total return (i.e., performance) anyway. But they do need to understand that the market mechanics are much stronger for stocks than bonds now.\nFor his investors, with anywhere from 10 percent to 60 percent in fixed-income, he is favoring cash equivalents and treasury-inflation protected bonds rather than core bond holdings. \n\"I have concerns,\" Goldberg added. \"We prefer cash equivalents.\"\nHe said money markets are now yielding more than 1 percent and, at that yield, one of the major drawbacks of money market funds is erased: The fees they charge are no longer eroding the yield generated. \nGoldberg added that there is also nothing wrong with using bank CDs, though the ones that offer yields as high as 10-year Treasurys may have long-term holding requirements and potentially fees on early withdrawals. But he said many financial advisors don't like bank CDs because it means allowing a client to take a money to another institution.\n\"I feel strongly that bonds aren't an asset to load up on. Rebalancing is the only reason that makes sense.\" He added that many investors won't see \"the carnage in the bond market \"until their March statement, and even then, most won't even notice it as long as stocks remain strong and the overall statement value is higher.\nBut they should be aware of the overall dynamic sooner rather than later. \"Safe havens aren't always so safe,\" he said. \"It's been over 30 years since investors had to take major losses in bonds.\nshow chapters Rates will push higher with more growth: DoubleLine Capital's Jeffrey Sherman      2 Hours Ago | 05:31 The theme of investing in a rising interest rate environment is not new; in fact, it has been overhyped in years past, most notable during the taper tantrum. But Goldberg said there has been so much literature from asset management companies stating case for bonds in a low interest rate environment they now should find it harder to justify bonds when the interest rate environment changes.\n\"It is significant now,\" he said. \"No one anymore can really deny the growth story, the China credit bubble, consumer credit or the Fed.\n\"Whatever people used to doubt stocks people have to start acknowledging the economy has past the point of escape velocity,\" Goldberg said. \"It is growing and worldwide, so rates deserve to go higher, and that's a good thing for the economy.\n\"I'd be more worried if rates weren't rising,\" he said, adding that he thinks the Fed may raise rates as many as four times this year.\nBoneparth at Bone Fine Wealth said statements from market figures as prominent as Ray Dalio that say it looks like 1980-81 as far as a bear market for bonds goes may get the attention, but he gave up on trying to call the end of the bond bull market a few years ago when rates hit 1.5 percent.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth \nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . \"The big win was to hedge at that point,\" he said. He added, \"You have to remember the pundits and dynamos of the industry are traders.\n\"A lot gets lost in communication between that and the retail side of the industry.\"\nThere is definitely an argument to be made for having a slight overweight to cash when you start to feel wary on both sides of market, viewing both equities and bonds from a peak down. Nine to 12 months of cash reserve, rather than just six months, is the new norm for greater security, and to take some risk off the table and wait for a better opportunity to reinvest, he said.\nBoneparth also is favoring bond managers who use unconstrained total return approaches, the style employed by Gross and Gundlach, among others, to tactically allocate across the entire global fixed-income universe.\n\"Rates have been going up and look at yesterday,\" he said. \"I was looking at core bond funds to see if any total return funds were really rocked and the meter didn't move that much. Across the board, it didn't look too detrimental.\"\n\"A downtick in bonds is not same as a downtick in equities,\" said Mike Loewengart, vice president of investment strategy at E-Trade Financial. He said even in previous rate increase environments, when bond income is received and reinvested, that can keep returns in positive territory and help investors get through fixed-income volatility. \"Maybe it is the end of a 30-year bull run in bonds, but I still think if rates rise gradually, most diversified fixed income portfolios should fair OK.\"\nBoneparth has no concerns about sticking with bonds for the long-term and doesn't believe clients will, either. \"No matter how tactical you are trying to be with bonds they will still make up a big swath of allocation models, the majority in pre-retiree and retiree accounts,\" he said. \"What can they do? Load up even more on equities?\n\"Let's assume a correction, 20 percent down, and then making claim bonds are a bad investment?\" Boneparth added. \"How will they feel then when there is obviously a flight to safety? \n\"You can't bail on an asset class ... even if turns out to be a bad cycle for bonds, when the good cycle returns, I'll still have all my clients.\"", "external_links": [], "published": "2018-01-25T21:28:00.000+02:00", "crawled": "2018-01-25T21:51:41.018+02:00", "highlightTitle": ""}