{"organizations": [], "uuid": "eef90e218b797bdff91b53c389aa29a735428d69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948282-GettyImages-51234128.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/jay-lenos-no-1-rule-for-first-time-car-buyers.html", "country": "US", "domain_rank": 767, "title": "Jay Leno's No. 1 rule for first-time car buyers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T18:31:00.000+02:00", "replies_count": 0, "uuid": "eef90e218b797bdff91b53c389aa29a735428d69"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/jay-lenos-no-1-rule-for-first-time-car-buyers.html", "ord_in_thread": 0, "title": "Jay Leno's No. 1 rule for first-time car buyers", "locations": [], "entities": {"persons": [{"name": "jay leno", "sentiment": "negative"}, {"name": "leno", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Whether you're buying your first car or shopping for your kid, Jay Leno has some advice for first-time car owners: Get a model that dates from at least 2005.\nIf you're tempted to buy an antique car, check yourself.\n\"Accidents you walk away from in a modern car would kill you in an antique car,\" the host of \" Jay Leno's Garage ,\" tells CNBC Make It . \"If you are buying a car for a teenager, don't get them an antique car. Get them something from 2005 forward, because at least they'll have airbags and seatbelts and all that kind of stuff.\n\"Old cars are truly dangerous conveyances.\"\nIt's worth it to spend on a car that will keep you safe, says Leno, whose rule of thumb is to \"buy the best car that you can afford.\"\nshow chapters Jay Leno: Never use valet parking      6:55 AM ET Mon, 5 Dec 2016 | 01:31 Once you've settled on one that you can afford, don't lease, advises Leno. \"I always think it's better to buy a car,\" he told CNBC Make It in 2016 . \"Everyone seems to lease now. Everyone thinks you can write off this and write off that, and to a certain extent, you can. But at the end of the lease, you don't have anything.\"\nThere are pros and cons to both leasing and owning that you'll want to consider.\nLease payments per month are typically cheaper than loan payments per month. Buying offers more flexibility, though: The car is yours to keep or sell, and you don't have to worry about going over an annual mileage limit.\nPlus, once you pay off your auto loan, you eliminate a fixed monthly cost and won't have to worry about a car payment until you buy again.\nIn an ideal world, you'd pay for your car in cash and avoid loans completely, says Leno, who prefers ownership when it comes to most things .\nTo be fair, the former \"Tonight Show\" host is in the enviable position of being a uniquely high earner. But he was financially conservative long before he hit it big. He says he didn't buy his first home until he had the cash to do so.\nAfter all, \"when you don't have to write checks every month, you're just better off,\" he says.\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Jay Leno: This is the quickest way to become a millionaire \n\nVideo by Andrea Kramar \nshow chapters Jay Leno doesn't want your resume — here's how he finds talent      5:11 PM ET Tue, 9 Jan 2018 | 01:19", "external_links": [], "published": "2018-01-16T18:31:00.000+02:00", "crawled": "2018-01-16T18:34:26.002+02:00", "highlightTitle": ""}