{"organizations": [], "uuid": "a243c51d664dc388fc5e04d2593a138365c6da9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941969-cd_dinners_ke_6_720.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/i-had-to-cook-5-different-dinners-for-20-heres-how-i-pulled-it-off.html", "country": "US", "domain_rank": 767, "title": "Here's how I cooked 5 different, healthy dinners for only $20", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T20:50:00.000+02:00", "replies_count": 0, "uuid": "a243c51d664dc388fc5e04d2593a138365c6da9e"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/i-had-to-cook-5-different-dinners-for-20-heres-how-i-pulled-it-off.html", "ord_in_thread": 0, "title": "Here's how I cooked 5 different, healthy dinners for only $20", "locations": [], "entities": {"persons": [{"name": "joel gamoran", "sentiment": "none"}, {"name": "joel", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "national chef for sur la table", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nAmericans waste a lot of money dining out . Dinner in particular can be a real budget buster . \nIt didn't take long living in New York City to realize that one meal out can easily set you back $20. Throw in a drink or two and your tab can be twice that. \nWhen I was challenged to make five dinners on a budget of $20 for this week's Cash Diet challenge , I wasn't too worried. Living off pasta and eggs for a week wouldn't be too bad. But then I read the catch, which complicated things: Each meal had to be different. And they each had to contain a carb, protein and vegetable. \nI don't have much experience cooking, so I consulted an expert: Joel Gamoran , National Chef for Sur La Table and host of the cooking show \" SCRAPS .\" He helped me whip up homemade brunch for six on a budget of $30 , so I figured he'd have some good ideas for this week's challenge. \nBefore helping me plan my meals for the week, Joel gave me some tips for grocery shopping on a tight budget: \n1. Expand your shopping list. In other words, buy ingredients that make your dollar go further. Joel suggested I use pasta and couscous, which are both cheap and filling, as my carbs for the week. \nHe also suggested getting an entire chicken, rather than just the thighs or breasts, and stretching it across three meals. That way, I could use the bones to make a chicken broth, which would be a helpful (and completely free!) ingredient. \nJoel said it was fine to buy a rotisserie chicken, even though they tend to be pricier than raw ones . The pre-cooked chicken would save me time and stress. And, since chicken would be my main source of protein for the week, I couldn't risk ruining an uncooked one. \n2. Price compare and shop outside of your neighborhood. While it may be more convenient to shop at your go-to grocery store, it's worth it to stop by someone else's local market for cheaper produce. \nFactors like storage, refrigeration and shipping can drive up the prices at national grocery stores, so you can generally score much better deals at small markets that get their produce from local farms and wholesalers. \nThat said, shopping at multiple spots can get time consuming. When price comparing, keep in mind that your time is also valuable. CNBC Make It Scoring deals on produce in Chinatown \n3. Keep it simple. Rather than buying a ton of different ingredients, find ways to get creative with a few staples . Mix and match what you're working with so you're not stuck eating the same thing over and over. You'd be surprised with how far a little bit of creativity can go . \nBefore you head out to shop, make a list of exactly what you need and stick to it. No impulse buys! And if you're worried about going over your food budget, try using cash. Decide out how much you want to spend on food on that particular grocery trip and withdraw only that amount. When you head to the store, don't bring your credit cards so you're not tempted to use them. \nI grabbed a $20 bill before heading out to price compare at Trader Joe's, Whole Foods and the markets in Chinatown. Here's what I got for the week: \nCarbs: 1 box of couscous, 1 bag of pasta \nVegetables: Sweet potatoes, frozen peas, carrots, broccoli \nProtein: 1 dozen eggs, 1 rotisserie chicken \nOther: 1 can of coconut milk \nI'm no chef, but with just $20, nine ingredients and a few basic recipes from Joel, I was able to make five healthy and filling dinners, each involving a carb, veggie and protein. \nHere's a breakdown of what I made each night: Day 1: Roasted chicken and sweet potatoes \nPrepping meal No. 1 was a true confidence builder: All I had to do was chop a few sweet potatoes, drizzle some olive oil over them and stick them in the oven for about 20 minutes. \nWhile the potatoes were roasting, I cut up about one-third of my rotisserie chicken and heated it in a frying pan. Since I wasn't sure if sweet potatoes could double as a veggie and a carb, I chopped up some carrots on the side to make sure I fulfilled the challenge requirements. Day 2: Twice-baked sweet potato \nThis meal was a bit more time intensive, but completely worth the kitchen labor. Baked sweet potatoes are also uncharted territory for me — let alone twice baked sweet potatoes — so I didn't know what to expect. \nLuckily, the recipe is easier than it sounds: I started by baking one sweet potato until it was soft enough to slice and remove the flesh. While my potato was in the oven, I chopped up my broccoli and carrots and steamed them to make them softer. I then scooped out the flesh of the baked potato and, in a separate bowl, combined it with my veggies. \nFinally, I piled the mixture back into the potato skin, popped my loaded potato back into the oven and baked it until it was golden brown. I topped it off with a beautiful egg over easy to fulfill the protein requirement. Day 3: Pasta carbonara with peas \nMy go-to dinner has always been buttery pasta: Pasta with butter melted on top. It's quick, tasty and filling. \nTurns out, pasta carbonara is just as easy to make … and tastes way better. \nI started by cooking a generous portion of spaghetti. While the noodles were boiling, I whisked together two eggs, a splash of whole milk and a handful of frozen peas. When the pasta was done, I drained it, immediately added the hot noodles to the egg mixture and voila! \nMost carbonara sauces are made with Parmesan cheese, which was out of my price range this week. For a more complete pasta carbonara recipe, check out this one . Day 4: Chicken curry stir fry \nOn day four, couscous became my new best friend. It's impossible to mess up and took just five minutes to cook, which is much faster than rice and even speedier than pasta. Plus, it's delicious. \nWhile the couscous was cooking, I combined another third of my rotisserie chicken — shredded — a handful of frozen peas, one cup of coconut milk and a sprinkle of curry powder in a separate pan. I let the mixture simmer for a bit and then poured it on top of the couscous to create a chicken curry-esque meal. Day 5: Chicken fried \"rice\" \nThe last day was particularly exciting because I got to use my homemade chicken broth, which I prepared earlier in the week. You can follow a more detailed recipe , but here are the basic instructions: Put your chicken carcass in a pot with water, bring it to a boil and then let it simmer for about four hours. \nMy take on chicken fried rice first involved cooking the couscous in my homemade broth, which added great flavor. I steamed what was left of my veggies — a few carrots and peas — tossed them in with the cooked couscous and added my favorite topper: eggs. \nWhile this challenge required some planning and creativity in the kitchen, $20 was more than enough to make five healthy and filling dinners. I even had leftovers some nights, and since each meal was so different, I didn't mind packing the extras for lunch for the week. \nAll-in-all, I spent an average of $4 per dinner. And the best part: You don't need to know much — or anything — about cooking at all to pull these meals off. If I can make them, almost anyone can. ", "external_links": [], "published": "2018-01-12T20:50:00.000+02:00", "crawled": "2018-01-12T21:06:49.012+02:00", "highlightTitle": ""}