{"organizations": [], "uuid": "d271063fb9f170639b0d7fecb169912d766bb46c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/02/103210929-GettyImages-96177798.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/heres-a-map-of-where-walmart-is-closing-more-than-60-sams-club-stores.html", "country": "US", "domain_rank": 767, "title": "Here's a map of where Walmart is closing more than 60 Sam's Club stores", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T12:57:00.000+02:00", "replies_count": 0, "uuid": "d271063fb9f170639b0d7fecb169912d766bb46c"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/heres-a-map-of-where-walmart-is-closing-more-than-60-sams-club-stores.html", "ord_in_thread": 0, "title": "Here's a map of where Walmart is closing more than 60 Sam's Club stores", "locations": [], "entities": {"persons": [{"name": "sam", "sentiment": "negative"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "sam's club", "sentiment": "neutral"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart abruptly announced Thursday plans to close more than 60 of its Sam's Club locations, or nearly 10 percent of its store fleet, across the country.\nThe wholesale club locations closing span from Alaska to Puerto Rico. Some of the shuttered stores will be converted into e-commerce fulfillment facilities, the company said.\nThe news came on the same day the big-box retailer announced it would be boosting its starting wage for hourly employees and handing out bonuses, among other benefits, after the passage of new tax legislation.\nAs local media outlets began to report on the store closures, though, disgruntled shoppers took to sites like Twitter and Facebook to learn what was going on. Many customers were seen asking for refunds on memberships, which cost $45 annually, and others were concerned about where they would pick up prescriptions.\nshow chapters Walmart to shutter some of its Sam's Club locations 23 Hours Ago | 00:58 Late in the day Thursday, Sam's Club CEO John Furner wrote in a companywide email:\n\"Transforming our business means managing our real estate portfolio — we need a strong fleet of clubs that are fit for the future. After a thorough review, it became clear we had built clubs in some locations that impacted other clubs, and where population had not grown as anticipated. We've decided to right-size our fleet and better align our locations with our strategy. ... We will work to place as many associates as possible in new roles at nearby locations, and we'll provide them with support, resources, and severance pay to those eligible.\"\nWalmart said it would book a charge of 14 cents per share related to the closures, which would show up mainly in its fourth-quarter results. The company said it would share more details when it reports earnings on Feb. 20.\nWalmart \"is taking prudent steps to prepare for the next generation of retail warfare, one in which speed will be king and delivery will be judged by hours and not days,\" Cowen and Co. analyst Oliver Chen wrote in a note to clients Friday morning.\n\"We believe Sam's Club leadership will continue to execute against other initiatives ... as management noted that while results have improved over the last several quarters, the retailer can do better as Sam's Club has under-performed club peers,\" Chen said. Those competitors include Costco , BJ's Wholesale Club and Boxed.\nMoving forward, many analysts anticipate Sam's Club will focus on growing its e-commerce business, amassing a higher-quality grocery selection, marketing its private labels and finding new members.\nFurner has said the brand is looking to tap into households with annual income between $75,000 to $125,000.\nHere is a list of the stores being closed:\n8801 Old Seward Hwy, Anchorage, AK 1074 N Muldoon Rd, Anchorage, AK 48 College Rd, Fairbanks, AK 3900 Grants Mill Rd, Irondale, AL 2425 E Florence Blvd, Casa Grande, AZ 5757 E State Route 69, Prescott Valley, AZ 1375 S Arizona Ave, Chandler, AZ 15255 N Northsight Blvd, Scottsdale, AZ 3360 El Camino Ave, Sacramento, CA 17835 Gale Ave, City of Industry, CA 12540 Beach Blvd, Stanton, CA 12920 Foothill Blvd, Sylmar, CA 69 Pavilions Dr, Manchester, CT 2 Boston Post Rd, Orange, CT 355 FL-436, Fern Park, FL 7233 N Seacrest Blvd, Lantana, FL 5135 S Dale Mabry Hwy, Tampa, FL 2994 Turner Hill Rd, Lithonia, GA 501 N Randall Rd, Batavia, IL 21430 S Cicero Ave, Matteson, IL 6600 44th Ave, Moline, IL 808 S Illinois Rte 59, Naperville, IL 900 S Barrington Rd, Streamwood, IL 1055 McHenry Rd, Wheeling, IL 460 S Weber Rd, Romeoville, IL 3015 W 86th St, Indianapolis, IN 10859 E Washington St, Indianapolis, IN 4024 Elkhart Rd #1, Goshen, IN 9598 Cortana Pl, Baton Rouge, LA 9750 Reisterstown Rd, Owings Mills, MD 1 Tobias Boland Way, Worcester, MA 340 E. Edgewood Boulevard, Lansing, MI 32625 Northwestern Hwy, Farmington Hills, MI 3745 Louisiana Ave S, St Louis Park, MN 2800 27th Ave S, Moorhead, MN 11 Batchelder Rd, Seabrook, NH 81 International Dr S, Budd Lake, NJ 1900 E Linden Ave, Linden, NJ 301 Nassau Park Boulevard, Princeton, NJ 2649 Erie Blvd E, Syracuse, NY 720 Fairmount Ave, Jamestown, NY 700 Elmridge Center Dr, Rochester, NY 1600 Marketplace Dr, Rochester, NY 5085 Dawn Dr, Lumberton, NC 1101 Shiloh Glenn Dr, Morrisville, NC 4825 Marburg Ave, Cincinnati, OH 9570 Fields Ertel Rd, Loveland, OH 615 Old Hickory Blvd, Nashville, TN 1805 Getwell Rd, Memphis, TN 1615 S Loop W, Houston, TX 13331 Westheimer Rd, Houston, TX 22296 Market Place Dr, New Caney, TX 12919 San Pedro Ave, San Antonio, TX 741 E Little Creek Rd, Norfolk, VA 4571 S Laburnum Ave, Richmond, VA 901 S Grady Way, Renton, WA 1101 Outlet Collection Way, Auburn, WA 13550 Aurora Ave N, Seattle, WA 7050 Watts Rd, Madison, WI 1540 S 108th St, West Allis, WI This list does not contain three additional stores in Puerto Rico.\nWATCH: Walmart closing nearly 10% of US Sam's Club stores\nshow chapters Walmart closing nearly 10% of US Sam's Club stores 5 Hours Ago | 01:19", "external_links": [], "published": "2018-01-12T12:57:00.000+02:00", "crawled": "2018-01-12T13:26:11.074+02:00", "highlightTitle": ""}