{"organizations": [], "uuid": "38e1298346194c3243dcc9c6c940d130040b3d57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950690-pic_1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/how-to-step-back-when-you-know-youre-a-micromanager.html", "country": "US", "domain_rank": 767, "title": "How to step back when you know you're a micromanager, according to Marcus Lemonis", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T18:46:00.000+02:00", "replies_count": 0, "uuid": "38e1298346194c3243dcc9c6c940d130040b3d57"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/how-to-step-back-when-you-know-youre-a-micromanager.html", "ord_in_thread": 0, "title": "How to step back when you know you're a micromanager, according to Marcus Lemonis", "locations": [], "entities": {"persons": [{"name": "marcus lemonis", "sentiment": "neutral"}, {"name": "aimee", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "aimee dougherty", "sentiment": "none"}, {"name": "lemonis", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "jd custom designs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:08 SHARES \nWhen it comes to running a successful and profitable company, self-made millionaire Marcus Lemonis is a firm believer that having people skills can make or break a leader's business. \nIn this week's episode of CNBC's \"The Profit, \" Lemonis revealed how a California-based company bringing in millions in sales is on the brink of closing due to one of its owners' control and micromanagement issues. \nHusband and wife Jeff and Aimee Dougherty founded JD Custom Designs, a display manufacturing company, in 2009. In the following year, the business reached $2.4 million of revenue mainly by creating eye-catching retail displays for clients in the cosmetic industry. \nDespite bringing in over $1 million in sales each year over the previous few years, the company ran out of working capital in 2016. Without the funds to repair broken machines, delays piled up and sales slowed down. The business fell into $393,000 of debt. \nThough Jeff and Aimee are equal partners and owners of the business, Lemonis noticed that Jeff had an issue with micromanaging his wife and the rest of his staff. \n\"If I can't persuade him to let go of the reins and help his wife and partner come into her own, JD Custom Designs could just disappear,\" Lemonis said. \nHere are three ways Lemonis helped Jeff resolve his desire for control, step away from his micromanaging ways and help turn his business around. The Profit Avoid distractions \nWhen Lemonis first visited JD Custom Designs, Jeff told him that he ran \"pretty much everything other than paperwork,\" a duty his wife asks him to stay out of. \nAs Lemonis soon learned, Jeff has a habit of taking on too many tasks that he can't actually get to, which consequently impedes the company's productivity. \n\"I know I wouldn't be able to do half the stuff my dad does,\" Wesley said. \"He's in the front, back, he's all over the place. It stresses me out. He's going to put himself in the ground the way he's going right now. He's trying to do everything by himself. It scares the hell out of me.\" \nLemonis noted that the company is \"so one-dimensional because Jeff pours all of his time into doing everybody else's job, as opposed to allowing people to do their job.\"This would give him more \"free time to develop new ideas, develop new products,\" he added. Trust your team's abilities \nIn the past, Jeff insisted on making sales himself despite his wife's background in sales. Lemonis, however, wasn't a fan. \"Seems like a role reversal,\" he said. \nTo prove Aimee's ability to run a sales pitch, Lemonis set up a meeting with a footwear company he owns part of . Although Jeff nearly sabotaged her presentation, Aimee proved she believed in her ability to win over the new client for JD Custom Designs. \n\"You build it and I can sell it,\" Aimee told Jeff. \"We each have our own jobs so let me do my job.\" \nImpressed with Aimee's presentation and Jeff's new product design, Lemonis appreciated the changes the Doughertys were starting to make. \n\"We want to be able to do anything that any company wants, but we ultimately have to change the culture. And that starts with you,\" Lemonis said, pointing to Jeff. \"Letting go and trusting your team.\" Trust in your own abilities \nBefore marrying Aimee, Jeff was a single father raising three children. As a result of a rough family upbringing, he said he felt the need to exert control through his business in order to provide for his family. \n\"If I lose that control, it scares me because of what my family stands to lose,\" Jeff told Lemonis. \"My family is everything to me and I have a control issue yeah, because if I didn't, I [couldn't] take care of them.\" \nOnce he understood Jeff's background and need for control, Lemonis set out on working on the issue. \n\"I think the fact that Jeff was vulnerable and disclosed why he is the way he is, it's a testament to the character of this man,\" Lemonis said. \n\"You have to be the chief. That doesn't mean you don't get out of the shop and get your hands dirty that doesn't mean that you don't lead example,\" he told Jeff, \"but the way that you lead by example is also empowering these people.\" \nLemonis went on to comment that the equipment upgrades and improved confidence among the whole team would boost the company back into success. He projected the changes could bring in at least $5 million in the following year. \n\"I love working with them because they do what they say they're going to do, they work their butts off and those are the kind of people I like being partners with,\" Lemonis said. \"People that truly want to earn it.\" ", "external_links": [], "published": "2018-01-17T18:46:00.000+02:00", "crawled": "2018-01-17T19:05:37.016+02:00", "highlightTitle": ""}