{"organizations": [], "uuid": "4ca947fde510c193bf6a11ebbbbba40a145b7acc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891392-GettyImages-693012598.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/few-large-companies-say-theyll-use-tax-savings-to-boost-wages-cnbc-survey-finds.html", "country": "US", "domain_rank": 767, "title": "Few large companies say they'll use tax savings to boost wages, CNBC survey finds", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T22:55:00.000+02:00", "replies_count": 0, "uuid": "4ca947fde510c193bf6a11ebbbbba40a145b7acc"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/few-large-companies-say-theyll-use-tax-savings-to-boost-wages-cnbc-survey-finds.html", "ord_in_thread": 0, "title": "Few large companies say they'll use tax savings to boost wages, CNBC survey finds", "locations": [], "entities": {"persons": [{"name": "david paul morris", "sentiment": "negative"}, {"name": "tim cook", "sentiment": "negative"}, {"name": "despit", "sentiment": "neutral"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nDespite a handful of high-profile announcements, the recent cuts in corporate taxes haven’t yet had a meaningful impact on American companies’ plans to boost investment or raise workers’ pay, a CNBC survey of large companies found. \nThe latest announcement came Wednesday with news that Apple plans to repatriate billions of dollars stashed overseas. The company said it will make a $350 billion “contribution to the economy, while promising to create 20,000 new jobs and open a new campus. Apple did not provide details on specific investment or plans to boost compensation for current employees. \nProponents of the recent tax reform law, which cuts the top corporate tax rate from 35 percent to 21 percent, argue that a significant portion of those savings will flow to workers in the form of higher wages. The Trump administration has estimated that the average American worker could see their annual wages grow by $4,000 as a result of the drop in corporate taxes. \nSo far, however, those pay increases have been few and far between. With a few exceptions, companies that have announced specific plans are offering one-time bonuses in place of permanent wage increases. \nOf the 100 biggest companies by market capitalization on Jan. 4, roughly half did not respond to CNBC’s multiple requests for comment on the impact on the tax bill on their plans for investment or worker’s paychecks. \nAnother 21 responded but had no comment. The same number responded with general comments that did not include specific details on investment or worker compensation. \nOnly 9 companies in the S&P 100 contacted by CNBC said they have specific plans to use some of the money saved from the corporate tax cuts to boost worker pay or invest in facilities or charitable causes. \nAmong those with detailed announcements: AT&T last month said it plans to invest an additional $1 billion in the United States this year and pay a special $1,000 bonus to more than 200,000 AT&T U.S. employees. Walmart will raise its starting minimum wage to $11 an hour and award worker bonuses of between $200 and $1000 depending on years of service. Comcast , the parent company of CNBC, said it will award a special $1,000 bonus to more than 100,000 workers. Boeing last month announced plans to invest an additional $300 million as a result of the new tax law. Wells Fargo said it will raise its minimum hourly pay rate to $15 and target $400 million in 2018 for philanthropic contributions. Bank of America last month said U.S. employees making up to $150,000 per year – or about 145,000 workers – would get a get a one-time year-end bonus of $1,000. PNC Financial said it would give a $1,000 bonus to about 47,500 workers. U.S. Bancorp said it will pay a one-time, $1,000 bonus for nearly 60,000 employees; raise the minimum wage to $15 for all hourly employees; make a one-time, $150 million contribution to the U.S. Bank Foundation, and make enhancements to employees’ health care offerings effective for the 2019 enrollment period. \nSome of the companies contacted by CNBC, including Goldman Sachs , Verizon , Walgreens and Intel , said they are analyzing the impact of the tax changes and may make announcements in the months ahead. A few said they planned to provide details on upcoming earnings calls. \nDozens of other large companies have also announced specific plans to pay bonuses. But collectively, they represent a tiny portion of the American workforce. \nIt’s also unclear how smaller employers will deploy any savings from the new tax law. Roughly half of all American workers are employed by companies with payrolls of fewer than 500 workers, according to the Small Business Administration. \nProponents of the tax law argue that lower taxes will help smaller companies boost wages as they compete to hire workers in a tight labor market. Yet some economists, including Joel Naroff, chief economist at Naroff Economic Advisors, doubt that most small businesses will see a big enough windfall to pass those savings along to workers. \n“That means the bonus and minimum wage announcements make for good PR, but not necessarily strong income gains for workers,” he said. \nCNBC will update this survey as additional companies respond.", "external_links": [], "published": "2018-01-17T22:55:00.000+02:00", "crawled": "2018-01-17T23:11:24.008+02:00", "highlightTitle": ""}