{"organizations": [], "uuid": "ed4ddcb88789c1e8ee1a0a887e647479b6521996", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://richinwriters.com/feed", "section_title": "RichInWriters.com", "url": "https://www.cnbc.com/2018/01/29/uber-looked-at-buying-truck-logistics-company-load-delivered.html", "country": "US", "domain_rank": 767, "title": "Uber looked at buying a truck logistics company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T23:59:00.000+02:00", "replies_count": 0, "uuid": "ed4ddcb88789c1e8ee1a0a887e647479b6521996"}, "author": "anonymous Hipster", "url": "https://www.cnbc.com/2018/01/29/uber-looked-at-buying-truck-logistics-company-load-delivered.html", "ord_in_thread": 0, "title": "Uber looked at buying a truck logistics company", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "home depot", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uber had looked at buying a Chicago-based freight logistics company to complement its existing UberFreight service, several people briefed on the process say.\n\nThe ride-hailing startup spoke to Load Delivered Logistics, a broker for freight trucking routes, as recently as this month, but deal talks fell apart, the sources say.\nAn Uber spokesperson said the company was not acquiring Load Delivered. Load Delivered did not respond to requests for comment on the acquisition talks.\nMore from Recode: \nUber for trucks is here. Here's how it will work. \nUber's first self-driven truck delivery was a beer run \nHome Depot has considered buying a $9 billion logistics company so Amazon doesn't \n\nUber's interest in the logistics company spotlights one of its newer businesses, UberFreight, which helps independent truckers as well as trucking fleets find and negotiate available payload jobs through an app.\nLoad Delivered is a traditional brokerage firm that pairs truckers with payload work through a 70-person team. Uber's interest in the company suggests the deal could have been a way for Uber to add to its customer base or add to its growing roster of staffers with experience in the trucking industry.\nLoad Delivered is still deciding whether to sell itself to any of the other players in the logistics market, the sources said — but the two companies met as recently as this month at Load Delivered's offices in Chicago.\nThe talks were serious enough that some rank-and-file Load Delivered employees were told about the transaction even though it had not yet closed.\nThe talks began as early as last August, sources say, but stalled as Uber went several months without a full-time CEO. Investors ousted Travis Kalanick from the job in June, but Dara Khosrwoshahi didn't assume the role until September.\nLoad Delivered then also had a strong fourth quarter, said one person, and is now unsure if it wants to sell to anyone or remain an independent company. The company saw $87 million in revenue in 2016 and is profitable, according to Crain's.\nThe acquisition would have been an unusual move for a company attempting to overhaul the traditional trucking brokerage industry. But it's not the first time Uber sought expertise in the realm it was trying to supplant. In September of 2016, Uber hired Bill Driegert to be the director of UberFreight. Driegert previously headed up the innovation efforts at freight logistics firm Coyote Logistics, which was acquired by UPS in 2015.\n\"When we look for talent, Chicago's at the top of the list,\" Driegert told Crain's in August 2017. \"It's a great hub for logistics and ops talent. We knew that managing the whole country from San Francisco was going to be a challenge.\"\nIn fact, at least a dozen UberFreight staffers previously worked at Coyote Logistics.\nIn addition to talent, a Load Delivered purchase could have given UberFreight necessary expertise in shipping refrigerated freight — Load Delivered's specialty, according to people in the industry.\nWATCH: Uber's CEO on cleaning up the company's image show chapters Uber's new CEO talks cleaning up the company's image, IPO and driver-less cars      11:19 AM ET Tue, 23 Jan 2018 | 01:44", "external_links": [], "published": "2018-01-29T23:59:00.000+02:00", "crawled": "2018-01-30T00:45:39.006+02:00", "highlightTitle": ""}