{"organizations": [], "uuid": "4dedf7c840f6b656076a90a0f3d49be5103f8c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/12/10/101260233-smoking.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/02/trying-non-cigarette-tobacco-products-raises-odds-teens-try-cigs-later.html", "country": "US", "domain_rank": 767, "title": "Teens who try non-cigarette tobacco products are twice as likely to try cigarettes a year later", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-02T18:00:00.000+02:00", "replies_count": 0, "uuid": "4dedf7c840f6b656076a90a0f3d49be5103f8c38"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/trying-non-cigarette-tobacco-products-raises-odds-teens-try-cigs-later.html", "ord_in_thread": 0, "title": "Teens who try non-cigarette tobacco products are twice as likely to try cigarettes a year later", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "university of california san francisco's center for tobacco control research and education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Teens who have tried a non-cigarette tobacco product are twice as likely to try conventional cigarettes a year later than those who haven't, according to a new study.\nResearchers found that any use of e-cigarettes, hookah, non-cigarette combustible tobacco or smokeless tobacco in one year doubled the chance that youths smoked cigarettes the following year. The results were adjusted for factors like sociodemographic and environmental smoking risk. Using multiple products further increased the odds.\nThe study, published Tuesday in JAMA Pediatrics from researchers at the University of California San Francisco's Center for Tobacco Control Research and Education, comes amid a growing debate around e-cigarettes. The products are often marketed as a way for adult smokers to quit conventional cigarettes but are becoming increasingly popular among teens .\nDespite the buzz around e-cigarettes, researchers stress that all products they studied increased the chance kids smoked conventional cigarettes. Therefore, they recommend regulating them together and extending to them prevention tactics like pack size requirements and flavor restrictions.\n\"We have a public rhetoric around e-cigarettes that's really strong, but we should be thinking about other products,\" said Shannon Lea Watkins, one of the study's authors and a postdoctoral scholar at the UCSF's Center for Tobacco Control Research and Education.\nThe findings should also extend discussions around regulating non-cigarette tobacco products to include the risk they pose of leading adolescents to smoke cigarettes rather than only the harm the individual products may present, Watkins said.\nResearchers used data from the National Institutes of Health and Food and Drug Administration's Population Assessment of Tobacco and Health to track the responses of adolescents between the ages of 12 and 17 from 2013 to 2015.\nThe study is believed to be the first to analyze all non-cigarette tobacco products. Others have focused on specific categories like e-cigarettes.\n\"I'm perhaps surprised about how similar the relationships were for each product across the board,\" Watkins said. \"I'm not surprised about the relationship, but the fact that we sliced this in as many ways as we could think of with all the methodological concerns folks had, no matter how we run the model, the results hold.\"", "external_links": [], "published": "2018-01-02T18:00:00.000+02:00", "crawled": "2018-01-02T18:18:39.003+02:00", "highlightTitle": ""}