{"organizations": [], "uuid": "7a7e734e4c4eb852667ef20cf2e72bb97ac3f6df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-3-brazils-petrobras-settles-u-s-corruption-class-action-for-2-point-95-bln.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Brazil's Petrobras settles U.S. corruption class action for $2.95 bln", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T19:46:00.000+02:00", "replies_count": 0, "uuid": "7a7e734e4c4eb852667ef20cf2e72bb97ac3f6df"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-3-brazils-petrobras-settles-u-s-corruption-class-action-for-2-point-95-bln.html", "ord_in_thread": 0, "title": "UPDATE 3-Brazil's Petrobras settles U.S. corruption class action for $2.95 bln", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "negative"}, {"name": "jed rakoff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "petrobras", "sentiment": "negative"}, {"name": "petroleo brasileiro sa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UPDATE 3-Brazil's Petrobras settles U.S. corruption class action for $2.95 bln Brendan Pierson SHARES \nbln@ (Adds context on settlement, comment on dividend, JPM comment) \nNEW YORK, Jan 3 (Reuters) - Brazil state-controlled oil company Petroleo Brasileiro SA said on Wednesday it had agreed to pay $2.95 billion to settle a U.S. class action brought by investors who claim they lost money as a result of a graft scandal. \nPetrobras denied any wrongdoing in the deal, which is one of the largest securities class action settlements in U.S. history. U.S. District Judge Jed Rakoff in Manhattan must approve the accord. \nThe settlement, smaller than many analysts anticipated, is an important milestone for the company as it seeks to dig out from under a massive graft scandal, in which contractors bilked the oil giant out of billions by bribing company executives. \nBut the deal reduces chances the world's most indebted oil company will pay a dividend for 2017, much anticipated by investors who have not seen such a payment since 2014 when the scandal came to light, a source familiar with the matter said. \n\"This has been one of the most important overhangs for Petrobras especially for the extremely high uncertainty around the values of this potential liability,\" JPMorgan said in a client note, adding that it had expected a figure above $5 billion. \"The settlement puts an end to that uncertainty.\" \nPreferred shares ticked up 0.48 percent to 16.63 reais. U.S.-traded shares were unchanged at $10.70. \nMoody's brushed off concerns about the impact of the fine on the company's balance sheet, noting it was expected to generate some $30 billion in cash this year and make capital investments of around $15 billion. \n\"Petrobras' liquidity position is adequate and the payment of the agreed class action settlement amount is not a material concern,\" it said. \nThe plaintiffs were upbeat too. \n\"This litigation and its ultimate resolution has yielded an excellent result for the class,\" said Jeremy Lieberman, an attorney for the investors. He called the deal \"historic\" and said it was the largest ever involving a foreign securities issuer. \nInvestors had sued Petrobras after prosecutors in Brazil accused executives of accepting more than $2 billion in bribes over a decade, mainly from construction and engineering companies. \nPetrobras claimed it was itself a victim and denied wrongdoing in a securities filing on Wednesday. But its market value has plunged as its central role in the scheme continues to be unwound by investigators. \nFor the past four years, Brazil has been rocked by the so-called \"Car Wash\" investigation, which has exposed kickbacks to executives of state-run companies and politicians who appointed them to their jobs. \nPetrobras said it hoped the settlement would resolve all investor claims in the United States. Analysts at Brazilian bank BTG Pactual said the market had expected a settlement of $5 billion to $10 billion. \nThe deal does not include investors who bought non U.S.-based Petrobras securities outside the United States, according to the company. \nThe deal came days after Brazil's securities regulator CVM formally accused eight former Petrobras executives of corruption. \nThe accusations relate to possible irregularities in the contracting process for three drilling ships, according to a legal filing by the regulator last Friday. \nAmong the accused in CVM's filing are former Petrobras Chief Executives Maria das Gracas Foster and Jose Sergio Gabrielli. Neither could be reached for comment. \nThe largest securities fraud settlements in U.S. history include $7.2 billion stemming from the collapse of Enron, $6.2 billion over an accounting scandal at WorldCom and $3.2 billion over an accounting scandal at Tyco International, according to Stanford Law School's Securities Class Action Clearinghouse. ($1 = 3.25 reais) \n(Reporting by Brendan Pierson in New York; Additional reporting by Rodrigo Viga Gaier in Rio de Janeiro and Flavia Bohone in Sao Paulo; Writing by Gram Slattery and Alexandra Alper; Editing by Jeffrey Benkoe and Andrew Hay)", "external_links": [], "published": "2018-01-03T19:46:00.000+02:00", "crawled": "2018-01-04T04:36:16.004+02:00", "highlightTitle": ""}