{"organizations": [], "uuid": "f6df4b626e6f7585f0854c157f795200dcf77c26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970491-Hed_Goals_Mary_Delaney_The_Oracles_preview.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/6-ways-to-set-goals-that-actually-make-you-succeed.html", "country": "US", "domain_rank": 767, "title": "6 ways to set goals that actually make you succeed", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T19:29:00.000+02:00", "replies_count": 0, "uuid": "f6df4b626e6f7585f0854c157f795200dcf77c26"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/6-ways-to-set-goals-that-actually-make-you-succeed.html", "ord_in_thread": 0, "title": "6 ways to set goals that actually make you succeed", "locations": [], "entities": {"persons": [{"name": "mary delaney", "sentiment": "positive"}], "locations": [], "organizations": [{"name": "u.s. navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 ways to set goals that actually make you succeed The Oracles CNBC.com Mary Delaney | The Oracles \nGoals are essential for success. But not all goals are created equal. Entrepreneurs and members of The Oracles share their top tips for setting goals that fast-track success in business and life. 1. Match the \"why\" with \"what\" \nStop listing goals that seem like a good idea. To transform your success trajectory (which leads to greater happiness and fulfillment), take considerable time to ensure that your goals are aligned with your ethos and connected to your mission. \n\"Ethos\" is a Greek word describing the guiding beliefs or ideals that characterize a community. Since no goal is achieved solo, ensure that your goals align with the character traits you and your team aim to embody. \nOne of the ethos traits of U.S. Navy SEALs is to \"be ready to lead, ready to follow, and never quit.\" Therefore, one of my personal goals was to develop greater leadership capacity through ever-challenging positions and situations. I was supported by a team who each had the imperative to develop their leadership and followership skills. So, ask yourself: Does your ethos align with your goal? Do you even know your ethos? \nAlthough your ethos defines the \"why\" behind what you do, the mission is \"what\" you intend to do. A SEAL's mission is to continuously earn the right to wear the SEAL Trident, capable of defeating our enemies in the most demanding situations, whenever asked. It's no surprise then, that my goal of developing leadership capacity as a SEAL got the right focus and energy, unlike many goals that tend to slip away. \nIf a goal aligns with your ethos and connects to your overall mission, the process of fulfilling it will be transformative. It will make you happier too, because you won't quit! — Mark Divine , retired U.S. Navy SEAL commander, founder of SEALFIT , and NYT/WSJ bestselling author ; follow SEALFIT on YouTube , Facebook , or Instagram 2. Grade your goals \nWe live in a world where everyone is obsessed with squeezing more goals onto their to-do list. I like to ignore what's on my to-do list for a while and see how I feel about the items on it a few weeks later. \nIf a goal still rings true, I give it an \"A\" rating and make sure it gets done. By focusing on the important \"A\" priorities rather than getting distracted by a very long laundry list, chances are that you'll be more fulfilled and effective. — Barbara Corcoran , founder of The Corcoran Group and Shark on \" Shark Tank \" 3. Start with the end in mind \nThe making of all Hollywood movies starts with the last scene. In fact, directors often shoot the final scene first. That's what you must do for your life and business. Create an image of who you are, and have your last scene written. Then, work backward with a three-year, five-year or even seven-year plan to get there. Commit to that plan with disciplined routines. \nPart of my daily routine is reading and exercise. I do 100 step-ups, sit-ups, and push-ups every morning. While I do this, I read a \"goal card\" that keeps me focused. When putting your overall plan into action, keep your end in mind. — Roy McDonald , founder and CEO of OneLife 4. Prioritize time-sensitive goals first \nIn real estate, as in most business, learning to effectively manage time is a game changer. Create a list of priorities, and focus on what needs to get done right away. Once you've met the urgent needs first, tackle the rest. If there are things on your list you don't want to do, delegate. Don't let them hold you back from doing what you love to do. \nBe cautious of letting things fall through the cracks, though, because if you do, inevitably, they'll carry over to your next week's \"to-do list.\" We all have the same number of hours in the day to work with. Make yours work for you. — Dottie Herman , CEO of Douglas Elliman , a real estate brokerage empire with more than $27 billion in annual sales 5. Write out your goals five times a day \nFor the past 12 years, I've written my goals five times a day, every day: once when waking up, three times during my day, and once before bed. I created a Facebook goal-writing community, where 600 members do the same. From experience, goal writing is one of the most important tasks to do in your day. \nJust writing your goals creates a relationship with your mind to bring them to life that would otherwise never be understood. It keeps your mind focused on practical ways to progress. It builds your ability to seize opportunities related to your goals. \nIf you're facing challenges, try writing out your goals for 30 minutes to one hour. Re-anchoring your mind during any difficulty reminds you of your purpose and can do wonders for your mood and attitude toward success. \nMoving forward, write your goals out three to five times a day at different times, even just for 30 seconds. Practice builds progress. Commit to writing them as a daily lifestyle habit, not a chore. \nSet alarms on your mobile devices. You will skyrocket your ability to attract the necessary resources to realize your goals. —  Com Mirza , \"The $500 Million Man\" and CEO of Mirza Holdings ; failed in eight companies back to back and today, runs a nine-figure empire with over 600 employees 6. Find what works for you \nGoal-setting advice is everywhere. For me, what works best is making a list of \"To Do's.\" These include long-term ideas, short-term ideas, and immediate needs. After writing out my list, I prioritize tasks accordingly. I also have a three-year vision that allows me to avoid stressing over the little things. Other people use a quadrant method, where they label each square \"do now,\" \"delay/ignore,\" \"work in\" and \"selectively invest.\" \nMy overall advice is to do what works best for you. There are all kinds of blueprints you can use. The most important thing is to choose one that works for your specific goals. —  Craig Handley , co-founder and CEO of ListenTrust ; read more about Handley: This boss hires and trains his employees to quit \nWant to share your insights like those above in a future column? If you're an experienced entrepreneur, please get in touch here . \nWant to suggest a future topic for these entrepreneurs to answer? Email , and it's very possible we'll make your suggestion the focus of a future article! \nFollow The Oracles on Facebook . ", "external_links": [], "published": "2018-01-26T19:29:00.000+02:00", "crawled": "2018-01-26T19:46:09.006+02:00", "highlightTitle": ""}