{"organizations": [], "uuid": "cbc0cae24457da131547c6376f6c57a2e0fdf4a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/10/102824989-IMG_6313rr.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/cramer-remains-confident-on-most-major-banks-after-earnings.html", "country": "US", "domain_rank": 767, "title": "Cramer remains confident on most major banks after earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T01:25:00.000+02:00", "replies_count": 0, "uuid": "cbc0cae24457da131547c6376f6c57a2e0fdf4a5"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/cramer-remains-confident-on-most-major-banks-after-earnings.html", "ord_in_thread": 0, "title": "Cramer remains confident on most major banks after earnings", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "positive"}, {"name": "cramer", "sentiment": "positive"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "j.p. morgan , bank of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC's Jim Cramer firmly believes that the financial stocks are the most important leadership group in the market, so he wanted to check in with some of its biggest players after earnings.\nWhen Cramer told viewers what to look for from the banks' earnings reports last week, he anticipated the hefty, one-time charges many of them incurred to take advantage of newly enacted tax laws .\n\"I know it was pure accounting gimmickry, but I worried that it might freak out investors. Turns out there was no need to worry,\" the \" Mad Money \" host said. \" J.P. Morgan , Bank of America , Wells Fargo and Citigroup all delivered substantial earnings beats, even as only J.P. Morgan and Citi actually gave you that higher-than-expected revenue that I like to see.\"\nFor Cramer, the \"headline numbers\" — how the earnings and revenue results compared to analysts' estimates — were less important than the banks' net interest margins, loan growth and capital return plans.\nThe net interest margin, or the difference between what banks pay individuals for their deposits and the interest they collect on loans, is the primary way banks make money.\nDespite concerns of a flattening yield curve , J.P. Morgan's net interest margin rose by 5 basis points from last quarter to 2.42 percent, beating expectations, and Bank of America's increased by 3 basis points to 2.39 percent.\nHowever, Citigroup's net interest margin fell by 9 basis points to 2.63 percent and Wells Fargo's dropped by 2 basis points to 2.84 percent.\nAs for loan growth, a key line item for gauging the welfare of the economy, the banks also delivered fairly healthy results, Cramer said.\nJ.P. Morgan's consumer average loan balances rose 1.7 percent versus last quarter, a sign that consumers are warming up to borrowing money, a trend that stimulates economic activity.\nBetter yet, J.P. Morgan's commercial average loan balances rose by 7 percent, commercial and industrial loans were up 6 percent, and commercial real estate loans increased 9 percent.\nCitigroup's total loans were also up 5 percent versus last quarter, which Cramer called \"very good.\" Conversely, Bank of America's total loans were up by a meager 1 percent and Wells Fargo's total commercial loans rose by less than 1 percent.\nFinally, Cramer turned to the banks' capital return plans, a central topic of discussion amid the Trump administration's easing regulatory regime.\n\"Now, J.P. Morgan and Citi, and Bank of America all said that their approach to dividends and buybacks won't change because of the tax bill,\" Cramer said. \"But all four of these companies have been voracious buyers of their own stock, especially Bank of America and Wells Fargo, and if the Fed gives them permission to even increase their repurchase programs, I think they'll do just that.\"\nAll things considered, Cramer thought J.P. Morgan reported a solid quarter, with good loan growth, deposit growth, an expanding net interest margin and expectations of a 19 percent tax rate.\nBut Bank of America delivered what Cramer saw as one of the best quarters in the group, especially with its lack of exposure to the weakness in trading and fixed income revenues — two of J.P. Morgan's weak spots.\n\"Bank of America is exactly the kind of financial you want to own in this environment,\" the \"Mad Money\" host said. \"They have the most rate sensitivity to rising interest rates because they have such a gigantic deposit base.\"\nCitigroup's quarter was always going to be marred by its $19 billion one-time charge, but its loan growth was \"encouraging,\" Cramer said.\nWells Fargo was Cramer's only real disappointment. The big bank, still embroiled in reputation repair after its cross-selling scandal , seemed to be struggling to capture new customers, which explained its declining net interest margin numbers and loan balances, he said.\n\"The company also saw a big pickup in costs thanks to their litigation expenses, and while I think the whole group is poised to go higher here ... I'm going to call [Wells Fargo] my least favorite,\" Cramer added.\nAs for the stocks themselves, Cramer used tangible book value — what the business would be worth if it was shut down and liquidated — to determine their valuations.\nJ.P. Morgan and Wells Fargo were the most expensive, trading at 2.1 and 2 times book value, respectively. Bank of America was trading at 1.85 times book value, and Citi, the cheapest, came in at 1.28 times book value.\n\"My view? J.P. Morgan remains best of breed, but as usual, you need to pay up for best of breed. ... If you want the best play on rising interest rates, go for Bank of America, and if you're looking for the value in the group, it's Citi. As for Wells, I think it's going to play catch up to the others because it looks to be out of the woods with the regulators, although I still prefer the others,\" Cramer said. \"The bottom line: after hearing from most of the major banks, I remain confident about the financials as a place to be.\"\nWATCH: Cramer discusses big bank earnings after the fact show chapters Cramer remains confident on most major banks after earnings 18 Hours Ago | 09:52 Disclosure: Cramer's charitable trust owns shares of J.P. Morgan and Citigroup.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-18T01:25:00.000+02:00", "crawled": "2018-01-18T01:59:49.012+02:00", "highlightTitle": ""}