{"organizations": [], "uuid": "3e3fc6bfaf8d351eb8d2044ddc495f5b913a5428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874126-RTX3KQ95.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/ex-national-security-advisor-flynn-met-fbi-agents-in-the-west-wing.html", "country": "US", "domain_rank": 767, "title": "Michael Flynn reportedly met FBI agents in the West Wing — without telling the White House", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T16:46:00.000+02:00", "replies_count": 0, "uuid": "3e3fc6bfaf8d351eb8d2044ddc495f5b913a5428"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/ex-national-security-advisor-flynn-met-fbi-agents-in-the-west-wing.html", "ord_in_thread": 0, "title": "Michael Flynn reportedly met FBI agents in the West Wing — without telling the White House", "locations": [], "entities": {"persons": [{"name": "michael flynn", "sentiment": "negative"}, {"name": "jonathan ernst", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "andrew mccabe", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "flynn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "west wing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters former u.s. national security", "sentiment": "negative"}, {"name": "white house", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Jonathan Ernst | Reuters Former U.S. National Security Adviser Michael Flynn departs U.S. District Court, where he was expected to plead guilty to lying to the FBI about his contacts with Russia's ambassador to the United States, in Washington, U.S., December 1, 2017. \nPresident Donald Trump 's former national security advisor, Michael Flynn , met with two FBI investigators in the West Wing early last year — without a lawyer or the White House's knowledge, NBC News reported Wednesday . \nMonths before special counsel Robert Mueller was appointed to investigate potential contacts between the Trump campaign and Russian sources, Flynn spoke with FBI investigators in his West Wing office about his communications with Russians, NBC reported, citing unidentified people familiar with the matter. \nDeputy FBI Director Andrew McCabe reportedly facilitated the Jan. 24, 2017, meeting after a phone call with Flynn's scheduler that day. Sources told NBC that Trump was unaware of the meeting until Jan. 26. \nFlynn took the meeting alone, NBC said, opting to exclude his lawyer or a lawyer from the National Security Council who would normally attend such a meeting. \nFormer acting Attorney General Sally Yates informed White House lawyer Don McGahn about the meeting on Jan. 26. He was the first member of Trump's inner circle to learn about it, and he then told senior administration officials, NBC said. \nFlynn is a retired Army lieutenant general who joined the Trump administration as national security advisor in January 2017. He resigned from the role less than a month later, after his allegedly misleading statements to Vice President Mike Pence about contacts with Russian ambassador Sergey Kislyak raised concerns from the Justice Department that Flynn could be vulnerable to blackmail. \nTrump later told reporters that Flynn was fired from the position \" because of what he said to Mike Pence ,\" while later adding \"with all that being said, I think he's a fine man.\" \nIn late 2017, Flynn pleaded guilty to lying to the FBI as part of the bureau's investigation into potential collusion between the Trump campaign and Russia. He is now cooperating with the special counsel's probe. \nNBC News, citing a source, also reported that former senior White House strategist and Trump campaign boss Steve Bannon is expected to meet with the special counsel's staff before the end of January. CNN later reported that Mueller's team plans to ask Bannon about the firings of Flynn and former FBI Director James Comey. \nThe special counsel's office declined to comment to CNBC, while the White House had no comment. \nThe FBI, Flynn's lawyer and McGahn did not immediately respond to requests for comments from CNBC. ", "external_links": [], "published": "2018-01-24T16:46:00.000+02:00", "crawled": "2018-01-24T16:58:09.000+02:00", "highlightTitle": ""}