{"organizations": [], "uuid": "ea1de710747cb297042350ae3c6234d2f5285082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/06/102563001-467701296.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19836768/device/rss", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/30/oil-markets-focus-on-inventory-build.html", "country": "US", "domain_rank": 767, "title": "Oil prices fall for third day on inventory build", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T02:49:00.000+02:00", "replies_count": 0, "uuid": "ea1de710747cb297042350ae3c6234d2f5285082"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/oil-markets-focus-on-inventory-build.html", "ord_in_thread": 0, "title": "Oil prices fall for third day on inventory build", "locations": [], "entities": {"persons": [{"name": "mihir kapadia", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "gonzales", "sentiment": "none"}], "organizations": [{"name": "sun global investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices ticked up on Wednesday, reversing earlier losses, despite data showing American crude inventories rose more than expected and U.S. oil output topped 10 million barrels a day in November for the first time in nearly half a century.\nU.S. West Texas Intermediate (WTI) futures ended Wednesday's session up 23 cents at $64.73, posting a 7.1 percent gain on the month.\nBrent crude , the global benchmark, closed up 3 cents at $69.05 a barrel, ending January 3.3 percent higher.\nPrices firmed up after the U.S. Federal Reserve announced it would leave interest rates unchanged , but said it expects inflation to creep higher this year.\nU.S. commercial crude stockpiles rose by 6.8 million barrels in the week through Jan. 26, according to the U.S. Energy Information Administration. That compared with analysts' expectations for a 100,000-barrel rise in a Reuters poll.\nshow chapters There’s a ‘tremendous speculative bubble’ in oil market, warns energy expert Tom Kloza 23 Hours Ago | 02:34 Inventories tend to rise in January, but this year they have fallen by more than 12 million barrels, making this the largest drop in the first month of the year in 30 years.\nGasoline stocks unexpectedly fell by 2 million barrels, compared with analysts' expectations in a Reuters poll for a 1.8 million barrels gain. Distillate stockpiles, which include diesel and heating oil, fell by 1.9 million barrels, versus expectations for a 1.5 million-barrel drop, the EIA data showed.\nHigher prices have encouraged U.S. producers to increase their rig count. Energy companies added 12 oil rigs last week, the biggest weekly increase since March.\n\"The rig count will only continue to rise and the U.S. system will only become more efficient,\" said Matt Stanley, a fuel broker at Freight Services International in Dubai.\nU.S. oil output in November roughly matched the monthly record of 10.04 million barrels a day set in November 1970, according to data released by EIA on Wednesday.\nThe Organization of the Petroleum Exporting Countries , along with other producers including Russia, has been waging a battle against U.S. shale producers, agreeing to take 1.8 million barrels a day off the market through the end of 2018.\n\"I see a correction on the horizon down towards $60 before the inevitable OPEC minister comes out and talks about new cuts,\" he added.\nOn Tuesday, U.S. crude fell 1.6 percent to close at $64.50 a barrel, far outpacing a 0.6 percent drop in the price of Brent.\n\"The extent of the latest pullback in oil prices has taken many by surprise. Whether this weakness will be short-lived or are we witnessing the precursor to a violent downside correction remains to be seen,\" PVM Oil Associates strategist Stephen Brennock said.\n\"Still, what is apparent is that positives are increasingly in short supply for skittish buyers and the early-year optimism is hanging by a thread.\"\nNot everyone was surprised by the pullback. Analysts told CNBC earlier this month that oil markets were poised for a correction because bullish bets that prices would keep rising have surged, while wagers they would fall have plunged. This means there are plenty of potential sellers, but a shrinking pool of possible buyers.\nSociete Generale commodities strategist Mark Keenan repeated that warning on Friday. While the fundamental supply-demand balance and geopolitical backdrop support the rally, the extreme investor positioning undermines a further run-up , he said.\n— CNBC's Tom DiChristopher contributed to this report.", "external_links": [], "published": "2018-01-31T02:49:00.000+02:00", "crawled": "2018-01-31T03:17:02.013+02:00", "highlightTitle": ""}