{"organizations": [], "uuid": "833aedcd744dfad34c6d02bad88159e96d0b741f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104969208-GettyImages-888825578.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/richard-branson-on-success-this-has-been-my-greatest-asset.html", "country": "US", "domain_rank": 767, "title": "Self-made billionaire Richard Branson on achieving success: This has been my 'greatest asset'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T18:41:00.000+02:00", "replies_count": 0, "uuid": "833aedcd744dfad34c6d02bad88159e96d0b741f"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/richard-branson-on-success-this-has-been-my-greatest-asset.html", "ord_in_thread": 0, "title": "Self-made billionaire Richard Branson on achieving success: This has been my 'greatest asset'", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "richard branso", "sentiment": "negative"}, {"name": "steve jobs", "sentiment": "negative"}, {"name": "richard branson", "sentiment": "negative"}, {"name": "bill gates", "sentiment": "negative"}, {"name": "oldfield", "sentiment": "none"}, {"name": "mike oldfield", "sentiment": "none"}, {"name": "branson", "sentiment": "none"}], "locations": [{"name": "manor", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Like Steve Jobs, Bill Gates and Mark Zuckerberg, Richard Branson became a billionaire without formally completing a college degree . Despite this, he considers his love for learning one of his best strengths.\n\"I've launched so many businesses in so many sectors and I'm often asked how I turn my hand to so many different things,\" Branson said in a recent blog post . \"The truth is, for most of the time, I've learned as I went along, but I've learned this is often my greatest asset.\"\nOne of the products of Branson's insatiable appetite for learning was the creation of his music label Virgin Records in 1972. When Branson heard the music of unsigned performer Mike Oldfield, he immediately wanted to help him find a record deal. Unfortunately, none of the established companies they approached would take him. \ntweet \nAside from building his own recording studio, the Manor, Branson had little knowledge or experience in the music industry, but he didn't let that stop him. Passionate to get Oldfield's music out into the world, Branson said, \"screw it, let's start a record company.\"\n\"It was an odd situation; we had our first artist but I had no idea how to run a record company and had to learn really fast,\" Branson said. \"If I did have experience in music – like all those others who turned it down – I probably wouldn't have gone ahead.\"\nBranson says his ability to say \"yes\" first and then learn along the way is what helped catapult him to success.\n\"My lack of knowledge and experience was a huge benefit. Fast forward a few decades and Virgin was the biggest independent record label in the world, and now Virgin is a global brand.\" Branson said. \ntweet \nOldfield would become the first artist signed to Virgin Records, where he produced \"Tubular Bells,\" (whose title song was the theme music to the movie \"The Exorcist\") and made Virgin its first $1 million. In years following, Branson signed other renowned artists including Janet Jackson, the Rolling Stones, Mariah Carey, the Spice Girls and Daft Punk, to name a few .\n\"It's really important to realize that it doesn't matter if you don't know,\" Branson said, \"because you can always find out. Seize opportunities and don't give in to self-doubt.\"\nBranson later sold Virgin Records to EMI for $1 billion in 1992 in part to fund Branson's Virgin airlines, according to Reuters .\nBranson also noted that he has gotten bolder over the years, which allows him to chase his dreams of starting new business ventures like Virgin Galactic and Virgin Hyperloop One.\n\"I love learning every day and can't wait to keep asking questions and discovering the answers,\" he said.\nLike this story? Like CNBC Make It on Facebook . \nDon't miss: \n\nThese are the top 10 best countries in the world Oprah Winfrey: Being president is 'not something that interests me' \nshow chapters Billionaire Richard Branson says he's never been motivated by money — here's why      3:02 PM ET Wed, 18 Oct 2017 | 01:16", "external_links": [], "published": "2018-01-26T18:41:00.000+02:00", "crawled": "2018-01-26T19:06:28.001+02:00", "highlightTitle": ""}