{"organizations": [], "uuid": "d7a75471e7c4343e4ccb478fb9859485fd0f86bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961634-9I9B0472.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/bridgewater-associates-ray-dalio-gives-his-best-career-advice.html", "country": "US", "domain_rank": 767, "title": "Billionaire Ray Dalio shares his best career advice for 20-somethings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T21:00:00.000+02:00", "replies_count": 0, "uuid": "d7a75471e7c4343e4ccb478fb9859485fd0f86bf"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/bridgewater-associates-ray-dalio-gives-his-best-career-advice.html", "ord_in_thread": 0, "title": "Billionaire Ray Dalio shares his best career advice for 20-somethings", "locations": [], "entities": {"persons": [{"name": "ray dalio", "sentiment": "negative"}, {"name": "dalio", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "bridgewater associates", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Want to get ahead in your career?\nBillionaire Ray Dalio offers the following advice to today's 20-somethings: \"Work in an idea meritocracy.\"\nAn idea meritocracy is a place \"where you can always ask the questions that you need to ask and challenge the ideas and not be held as a lackey to a boss but instead as a partner, so that you can learn and grow and have a say,\" the Bridgewater Associates founder told CNBC Make It at the World Economic Forum in Davos, Switzerland, this week.\nIn this kind of culture, great ideas can come from anywhere — not just the boss — and they are thoroughly debated so that the strongest ones win.\n\"It's so important for your own personal development and self-actualization,\" Dalio says. \"Otherwise, you're going to learn to follow rather than think for yourself.\"\nThis type of environment is good for you and the business, he says. \"When the best ideas win out, that's better for the company.\"\nshow chapters Ray Dalio: Promoting meritocracy - where the best ideas win out      8:44 AM ET Tue, 19 Sept 2017 | 01:41 How do you spot an idea meritocracy?\nDalio says you should be able to see it based on the company's reputation and culture. \"If the culture doesn't come through to you loud and clear, something's wrong.\"\nIf you're still unsure, \"just ask,\" he says. \"Can you challenge the boss? Is it an idea meritocracy, or is it a hierarchy?\"\nDalio expounds on this idea in his recent book, \" Principles: Life and Work ,\" and says creating this kind of culture was crucial to the success of Bridgewater, now the world's largest hedge fund.\nAt Bridgewater, he wanted to build an idea meritocracy where people were \"radically truthful with each other and radically transparent.\"\nBy laying everything out there, you become more efficient and more honorable, he says. And importantly, having open and thoughtful disagreements can \"stress-test your thinking\" and lead to powerful learning.\n\"It's the way of the future,\" Dalio says. \"Be in one of those kinds of environments.\"\nDon't miss: 4 books that billionaire Ray Dalio thinks everyone should read \nshow chapters Ray Dalio says market surge may be ahead: 'If you're holding cash, you're going to feel pretty stupid'      9:16 AM ET Tue, 23 Jan 2018 | 02:06 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-24T21:00:00.000+02:00", "crawled": "2018-01-24T21:56:56.013+02:00", "highlightTitle": ""}