{"organizations": [], "uuid": "1db1b4357c2545f84ef114b46bc70fc131c7cc79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/06/104882279-GettyImages-885568560-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/the-dows-31-percent-gain-during-trumps-first-year-is-the-best-since-fdr.html", "country": "US", "domain_rank": 767, "title": "The Dow's 31% gain during Trump's first year is the best since FDR", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T22:05:00.000+02:00", "replies_count": 0, "uuid": "1db1b4357c2545f84ef114b46bc70fc131c7cc79"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/the-dows-31-percent-gain-during-trumps-first-year-is-the-best-since-fdr.html", "ord_in_thread": 0, "title": "The Dow's 31% gain during Trump's first year is the best since FDR", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "positive"}, {"name": "fdr the dow", "sentiment": "positive"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saul loeb", "sentiment": "none"}, {"name": "roosevelt", "sentiment": "none"}, {"name": "franklin roosevelt", "sentiment": "none"}], "locations": [{"name": "utah state capitol", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "fdr", "sentiment": "positive"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Dow's 31% gain during Trump's first year is the best since FDR The 30-stock index has surged more than 31 percent since Trump's inauguration. That marks the index's best performance under the first year of a president since Roosevelt. \"You've got lower taxes, less regulation and confidence in the economy is high,\" said one investor. T he S&P 500 surged 23 percent during Trump's first year in office. SHARES Saul Loeb | AFP | Getty Images President Donald Trump speaks prior to signing a Presidential Proclamation shrinking Bears Ears and Grand Staircase-Escalante national monuments at the Utah State Capitol in Salt Lake City, Utah, December 4, 2017. \nDonald Trump lifted the Dow Jones industrial average in his first year in office more than any other president since Franklin Roosevelt. \nThe Dow has surged more than 31 percent since Trump's inauguration on Jan. 20, 2017. That marks the index's best performance under a president's first year since Roosevelt. The Dow skyrocketed 96.5 percent during Roosevelt's first year in office. \n(Returns measured from the day before the inauguration.) \n\"This is all about policy,\" said Bruce Bittles, chief investment strategist at Baird. \"You've got lower taxes, less regulation and confidence in the economy is high. Things are firing on all cylinders.\" \nTrump quickly moved to cut regulations enacted by previous administrations. He also successfully pushed to overhaul the U.S. tax code. That revamp included slashing the corporate tax rate to 21 percent from 35 percent. \nThe president made it to the White House saying he would \"put America first.\" Since taking office, Trump has pushed to have companies bring back jobs to the U.S. and has said repeatedly said his policies would help to accomplish this. show chapters 30 Mins Ago | 02:20 \nThese policy and rhetoric shifts have helped the so-called old guard of the stock market rally. \nShares of Boeing and Caterpillar — both founded in the early 1900s — are up 115 percent and 82 percent respectively since Trump entered the White House. They are also the best-performing Dow stocks since Trump took office. These companies benefit greatly from lower taxes and less regulation, and tend to rise the most when people believe the economic cycle is accelerating. \nSome investors believe Trump is getting too much credit for the run-up and it's really the strength of the global economy boosting these industrial stocks. \n\"There is clearly a coincidence between Trump's election and the run-up in stock prices over the past year,\" Ed Yardeni, president and chief investment strategist at Yardeni Research, said in a note earlier this week. \"However, coinciding with Trump's victory was mounting evidence of a global synchronized boom. In our opinion, the run-up in stock prices over the past year has been a continuation of the bull market within a bull market that started on February 12, 2016.\" \nTrump doesn't see it that way often patting himself on the back about the Dow's successes during his first year in office. He's tweeted about the index at least a dozen times in the last year. The president also mentioned the Dow repeatedly in meetings and press conferences. Most recently, Trump took credit for the index breaking above 25,000 for the first time. He also told reporters: \" I guess our new number is 30,000 .\" \nHe talks less about the S&P 500, perhaps because its name recognition isn't as strong as the Dow's, but also because it's gains are slightly less impressive. \nThe broader S&P 500 jumped 23 percent during Trump's first year in office. But the index did better during the first year of three other presidents: Roosevelt, Barack Obama and Harry Truman. \nThe S&P 500 rose 96 percent in Roosevelt's first year. It gained 33.5 percent when Truman took office and 34 percent after Obama was sworn in. \nObama took office in January 2009, less than two months before the market started to recover from the financial crisis.", "external_links": [], "published": "2018-01-18T22:05:00.000+02:00", "crawled": "2018-01-18T22:32:37.001+02:00", "highlightTitle": ""}