{"organizations": [], "uuid": "cc553b23226bfb944da4ffdb5288e921b4e50d78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909642-GettyImages-895498968-real-estate.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/mortgage-applications-shoot-up-8-point-3-percent-to-start-the-year.html", "country": "US", "domain_rank": 767, "title": "Mortgage applications shoot up 8.3% to start the year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T14:00:00.000+02:00", "replies_count": 0, "uuid": "cc553b23226bfb944da4ffdb5288e921b4e50d78"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/mortgage-applications-shoot-up-8-point-3-percent-to-start-the-year.html", "ord_in_thread": 0, "title": "Mortgage applications shoot up 8.3% to start the year", "locations": [], "entities": {"persons": [{"name": "ty wright", "sentiment": "none"}], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "mortgage bankers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pent-up demand from the holidays likely fueled the solid jump in mortgage applications last week.\nTotal application volume rose 8.3 percent during the first week of the year from the previous week, as mortgage rates held below year-ago levels, according to the seasonally adjusted Mortgage Bankers Association report.\n\nRefinance applications led the charge, rising 11 percent from the previous week. Homeowners may be taking advantage of lower rates now, concerned that rates will move higher this year. Rates were higher at the start of 2017 than they are now. Homeowners also saw big gains in home equity last year and may be taking advantage of that in cash-out refinances.\n\nThe average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances of $453,100 or less was basically unchanged during the week, increasing just 1 basis point to 4.23 percent, with points decreasing to 0.35 from 0.37, including the origination fee, for 80 percent loan-to-value ratio loans.\n\nEconomic news was mixed during the week, which kept interest rates in check.\n\n\"For example, the ISM's nonmanufacturing index showed that growth in the services sector was down for the second month, and the BLS' December jobs report was weaker than expected,\" said Joel Kan, an MBA economist. \"However, these were partially offset by slightly stronger factory orders for November and continued optimism of positive impacts from the tax reform plan.\"\n\nHomebuyers also came back to the market after the holiday break. Mortgage applications to purchase a home rose 5 percent for the week but were 1 percent lower than the same week one year ago.\n\n\"This was likely a catch-up week for potential borrowers as we head into the new year,\" Kan said.\n\nHomebuyers this year are facing a new landscape on the tax front. The Republican tax plan reduced the deductions that homeowners can take for property taxes and mortgage interest. In higher-priced housing markets and in states with high property-tax rates, that makes homebuying more expensive than it was just a few weeks ago.\n\nBuyers are also facing higher prices due to a severe lack of supply. More homes should begin to come on the market this month and next, with sellers hoping to get the jump on the spring market, especially those who are selling in order to buy another home. Unfortunately for buyers, there is so much demand for housing right now that any new supply will likely be swallowed up quickly with competition and prices remaining high.", "external_links": [], "published": "2018-01-10T14:00:00.000+02:00", "crawled": "2018-01-10T14:16:37.000+02:00", "highlightTitle": ""}