{"organizations": [], "uuid": "841e16f9fefdb6d7e11e98770cf913f7001720e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936169-elliq1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/elliq-robot-for-elderly-first-look.html", "country": "US", "domain_rank": 767, "title": "Here's a smart robot for the elderly that can play videos, chat and more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:08:00.000+02:00", "replies_count": 0, "uuid": "841e16f9fefdb6d7e11e98770cf913f7001720e3"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/elliq-robot-for-elderly-first-look.html", "ord_in_thread": 0, "title": "Here's a smart robot for the elderly that can play videos, chat and more", "locations": [], "entities": {"persons": [{"name": "andrew evers", "sentiment": "none"}, {"name": "ellie", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "intuition robotics", "sentiment": "none"}, {"name": "facebook messenger", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ElliQ is a smart robot and personal voice assistant for the elderly. It can play music, send and receive messages, manage a calendar and play videos. It launches later this year — and will be expensive — but the price hasn't been released. show chapters 1 Hour Ago | 00:57 \nA company named Intuition Robotics showed off a new robot at CES that's specifically designed for the elderly. \nIt's a smart voice assistant with a personality that can help remind senior citizens of upcoming calendar appointments, show pictures from the family, receive and send messages and more. It's also supposed to serve as a companion that people can have social interactions with. \nIt launches later this year, though Intuition Robotics doesn't have a price just yet. Here's what it's all about. ElliQ is a small robot with a swiveling head, a removable tablet and cameras. CNBC | Andrew Evers Its head lights up when you speak \"ElliQ\" (pronounced Ellie Q) and can then respond to requests. CNBC | Andrew Evers You can ask it to read new Facebook Messenger messages and show pictures your family might send you. CNBC | Andrew Evers You can ask it to tell jokes or play games. Handout: ElliQ You can ask it to suggest an activity. If it knows you've been sitting around all day, it'll suggest taking a walk. Handout: ElliQ It can stream radio stations if you ask it to play music, like jazz. It has built-in Harmon Kardon speakers which sounded pretty good. There are also an array of mics so it can hear you from across the room. CNBC | Andrew Evers It can manage your calendar, and friends and family can add appointments from their home. CNBC | Andrew Evers This function doesn't work yet, but eventually it'll support video chat, too. ElliQ's head swivels to look at you and lights up when it's thinking. It feels more alive than something like an Amazon Echo. Handout: ElliQ You can ask it to play videos, and it'll bring up things like TED talks. There aren't movies from places like Netflix or even TV shows, though. Handout: ElliQ", "external_links": [], "published": "2018-01-09T21:08:00.000+02:00", "crawled": "2018-01-09T21:36:39.003+02:00", "highlightTitle": ""}