{"organizations": [], "uuid": "c0209ed64eec3f34d7fb08f15e23952a15ca3852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/12/102501521-20150312-9204-1137.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/cramer-remix-my-loneliest-defense-of-apple-yet.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: My loneliest defense of Apple yet", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T01:59:00.000+02:00", "replies_count": 0, "uuid": "c0209ed64eec3f34d7fb08f15e23952a15ca3852"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/cramer-remix-my-loneliest-defense-of-apple-yet.html", "ord_in_thread": 0, "title": "Cramer Remix: My loneliest defense of Apple yet", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "logitech international", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "illinois tool works and first horizon national", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cramer Remix: My loneliest defense of Apple yet \"Mad Money\" host Jim Cramer revealed why he still believes in Apple's ability to head higher. Cramer also sat down with the CEOs of Logitech International, Illinois Tool Works and First Horizon National to hear more about the state of the consumer and the broader economy. In the lightning round, Cramer made the case for a energy play that might be out of style. Published 10 Hours Ago 10 Hours Ago | 01:02 \nAfter a whiplash in the major averages on Wednesday drove the stock market to soaring highs before it fell to tumultuous lows, CNBC's Jim Cramer realized he needed to reevaluate . \n\"I realized it's time to adopt a new view about this market,\" the \" Mad Money \" host said. \"We have a 9:30 to 11:00 a.m. session. Then another one goes from 11:00 to 2:00, and then the final one covers the last couple hours before the close. This is the only way that we can make sense of what's currently going on.\" \nThis time, Cramer decided to do the homework for investors to explain the peculiar intraday decline that plagued equities for several hours. \nOne leg of weakness came from surveys of Apple's suppliers that indicated iPhone sales may have declined since last quarter. \nWhile Cramer had no true insights about sales for the latest iPhone or its components, he admitted that it was possible they were not up to par and that investors wouldn't be hurt taking profits in their Apple positions. \n\"However, in what may be the loneliest defense of Apple I've made in ages, let me just say that even if sales are weaker, this company's been able to triumph over moments of weakness in the past,\" he argued. \"Remember, Apple's less a tech stock than a consumer products company with [a] terrific revenue stream and fabulous technological prowess. But that doesn't mean it never gets hit.\" Logitech International CEO on company's top 3 drivers Scott Mlyn | CNBC Bracken Darrell, CEO, Logitech International \nAs Logitech International gains market share around the world, CEO Bracken Darrell told CNBC on Wednesday that he sees three central growth drivers for the company going forward. \n\"We have three ways to grow: the markets we're in are generally growing, some of them strongly. We can gain share if we innovate well, and we're innovating well. We're winning lots of design awards. And then we can enter new categories. That's exactly what we're doing,\" Darrell told Cramer. \nLogitech, a consumer technology colossus that makes personal computer accessories, mobile phone products and a host of other devices, reported earnings on Tuesday, posting strong sales and a raised full-year outlook. \nEven though it was the company's best quarter ever, Darrell admitted that he thought the company could have done even better. Cramer's contrarian call on consumer goods stocks Laura Buckman | Bloomberg | Getty Images Boxes of Huggies brand diapers move along a conveyor belt at the Kimberly-Clark manufacturing facility in Paris, Texas. \nFor investors seeking income, steady growth and a good dividend, Cramer thinks consumer packaged goods stocks like Procter & Gamble and Kimberly-Clark are good buys. \nBut \"the whole group is facing some major problems that we haven't had to deal with for ages, issues of relevance, capital returns [and] rotations that have made the stocks seem a lot less attractive,\" the \"Mad Money\" host said. \nHistorically, as the economy expands, consumer packaged goods tend to fall out of favor among investors. \nThe \"hedge fund playbook\" sheds low-growth consumer names for higher-growth stocks of companies that directly benefit from a improving economic layout, Cramer said. \n\"However, the fact remains that none of these stocks have lost their bond market equivalent status, and if you can find the ones with the right balance of capital allocation toward dividends and buybacks, you should be able to do pretty well long-term,\" he said. Illinois Tool Works CEO on skilled labor shortage Scott Mlyn | CNBC Scott Santi, CEO, Illinois Tool Works \nIndustrial executives like Illinois Tool Works Chairman and CEO Scott Santi typically have intimate insights on pitfalls in the labor market. \n\"One of the real issues with a lot of trades these days is that there's a growing shortage of skilled and trained labor,\" Santi told Cramer in a Wednesday interview . \"You see it in the automation arena [and] certainly in the welding arena.\" \nBut as one of the most diversified companies in the business, Illinois Tool Works, which reported earnings on Wednesday, almost always has the wind at its back and the power to innovate solutions to problems like these, the CEO said. \n\"A big component of our innovation focus there is to take some relatively sophisticated technology, but create user interfaces that allow you to apply that sophisticated technology to a lower skill level of trainee, if you will, and they can be very effective at their job,\" Santi said. First Horizon National CEO bullish on economy \nA pickup in lending activity brings with it improved prospects for regional banks like Tennessee-based First Horizon National , Chairman and CEO Bryan Jordan told Cramer on Wednesday . \n\"Some of it, I'm sure, is a rollback in some of the regulatory environment, both in financial institutions and the broader economy, and then we've seen a good bit of excitement with the passage of tax reform,\" the CEO said. \nHaving just purchased Capital Bank for $2.2 billion in its largest-ever acquisition, First Horizon National has secured its place as the fourth-largest regional bank in the United States. And, in Jordan's view, its upward trajectory will not stop there. \n\"Clearly, the ability of financial institutions to lean in a little bit more and make credit available to not only small businesses, mid-sized businesses and large businesses, but also consumers, I think, is going to be a strong tailwind for the economy over the remainder of 2018 into 2019,\" he told Cramer. Lightning round: Swim upstream with the stock of Dominion \nIn Cramer's lightning round , he rattled off his take on some callers' favorite stocks: \nDominion Energy Inc. : \"Dominion [has a] 4.4 percent yield. I like that compound. It's a well-run company. I know it's down because people are staying away from those kinds of stocks. I want you to buy it.\" \nLloyds Banking Group PLC : \"No. If we're going to do that, we're going to do Banco Santander . If we want to do a European bank, we want to do S-A-N.\" \nDisclosure: Cramer's charitable trust owns share of Apple. \nQuestions for Cramer?", "external_links": [], "published": "2018-01-25T01:59:00.000+02:00", "crawled": "2018-01-25T02:22:11.000+02:00", "highlightTitle": ""}