{"organizations": [], "uuid": "406113d6ece30b80ef8535c59c10c654c2817be4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955974-GettyImages-899306178.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/high-tax-states-plan-workarounds-to-the-federal-salt-deduction.html", "country": "US", "domain_rank": 767, "title": "SALT in the wound: How high-tax states are working around federal tax breaks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T18:00:00.000+02:00", "replies_count": 0, "uuid": "406113d6ece30b80ef8535c59c10c654c2817be4"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/high-tax-states-plan-workarounds-to-the-federal-salt-deduction.html", "ord_in_thread": 0, "title": "SALT in the wound: How high-tax states are working around federal tax breaks", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "fairfax county", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "fairfax", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "High-tax states plan workarounds to the federal SALT deduction The GOP tax code caps the SALT deduction at $10,000. But the average SALT deduction for taxpayers in New York, New Jersey and California has been about $20,000. Politicians in blue states across the country are devising ways to workaround the federal code. SHARES Getty Images Residents wait in line to pay taxes at the Fairfax County Government Center December 28, 2017 in Fairfax, Virginia. \nOfficials in New York, New Jersey and California are working to reshape their tax codes to ease residents' pain from new limits to federal deductions for state, local and property taxes. \nStarting this year, the Tax Cuts and Jobs Act , the GOP's new tax code, caps taxpayers' deductions on their property, state and local incomes taxes (SALT)  at $10,000. \nBut in 2015, the average New Yorker's SALT deduction was more than $22,000 . In New Jersey and California, the average deductions were around $18,000. \nPreviously, there was no limit on the extent to which taxpayers could deduct these local levies. The change means many residents in these states — and many others — will now pay more to the federal government. (See chart below.) \n\"We're attempting to come up with ways to negate and blunt the harsh and unfair Republican tax policy,\" said Kevin de León, the Democratic leader of the California State Senate. \nTo combat the new SALT deduction cap, politicians are proposing creative concepts. Some of the ideas include granting a charitable deduction — which remains uncapped — after filers pay property taxes. Another idea does away with income taxes and applies a statewide payroll tax to be paid for by employers — which is deductible to them. \n\"The whole intent is to ensure that you get the benefit of the deduction you would otherwise lose,\" said Joseph Bankman, the Ralph M. Parsons Professor of Law and Business at Stanford Law School. \nThe White House has expressed its disapproval. \n\"I hope that the states are more focused on cutting their budgets and giving tax cuts to their people in their states than they are in trying to evade the law,\" said Steven Mnuchin, U.S. Treasury Secretary, at a press briefing this month. \"The whole intent is to ensure that you get the benefit of the deduction you would otherwise lose.\" -Joseph Bankman, Professor, Stanford Law School \nHowever, Robert Mujica, New York's budget director, said it's impossible for the state to not react. \n\"What Washington did to New York was say 'We're going to basically change the laws entirely and upend your system, oh, and by the way, don't make any changes to adjust to it',\" he said. \nHere's how three key states are working to combat the new tax law. California Michael Tullberg | Getty Images California State Senate leader Kevin de Leon. \nIn early January, California Senate leader de León introduced a bill that would allow residents to pay some of their state taxes to the California Excellence Fund, a state charity. In turn, taxpayers would be able to deduct the amount of their charitable contribution on their federal returns. \nSo if, say, a San Francisco resident's SALT taxes were $15,000, they could pay the first $10,000 as normal, and then contribute the remaining $5,000 of their state tax bill to the California Excellence Fund as a charitable donation. That would then make their total SALT taxes deductible. \"It means sitting down with an accountant in December instead of March.\" -Brian Galle, Professor of law, Georgetown University \n\"It's pretty easy,\" said Brian Galle, a law professor at Georgetown University who specializes in taxation. \"It follows a mechanism that many taxpayers have done every year.\" \nWhat might require adjustment is that people would have to figure out their taxes months earlier than they're used to. That's because people would need to know their state tax bill and make that charitable contribution before the end of the year to receive the benefit. \n\"It means sitting down with an accountant in December instead of March,\" Galle said. \nEducating Californians about the system would be a major part of the plan, de Leon said. New York Getty Images New York Governor Andrew Cuomo. \nAbsent of any changes, the state estimates that New Yorkers would pay an additional $14 billion a year in taxes. \nSo earlier this month, New York Gov. Andrew Cuomo ordered the Department of Taxation and Finance to craft ways for the state to respond to the GOP tax bill. The department emerged with a slew of proposals to reshape New York's taxation. \n\"All of them are designed to give back to New Yorkers what the federal government took away,\" Mujica said. \nThe first proposal basically mirrors California's plan. Residents would contribute their SALT taxes beyond the $10,000 cap to a state charity, and therefore make their entire bill eligible for deduction. \nThe other major proposal would shift income taxes to payroll taxes — or from employees who can no longer deduct taxes to employers who still can. \nEmployers, facing a higher tax bill, would most likely reduce wages. But the state would give employees a wage credit, which would be deductible. \"What Washington did to New York was say 'We're going to basically change the laws entirely and upend your system, oh, and by the way, don't make any changes to adjust to it'\" -Robert Mujica, Director, New York State Division of the Budget \nSo if an employee makes $75,000 a year, and the employer lowers her salary to $65,000 because it's now paying a new payroll tax, the state would give the employee a wage credit for $10,000. The employee is back where she started (at $75,000) — but now she has her state taxes shielded from federal taxation. \nThis proposal could reach more people than the charitable deduction, Galle said. \n\"You might be benefiting all your constituents,\" he said. \"Not just the ones who itemize.\" Although it might require workers to accept an immediate pay cut. \nMujica said these proposals are a top priority for the state. \n\"We'd like to get legislative drafted in the next few weeks,\" he said. New Jersey", "external_links": [], "published": "2018-01-20T18:00:00.000+02:00", "crawled": "2018-01-20T18:25:36.008+02:00", "highlightTitle": ""}