{"organizations": [], "uuid": "c40d1d74c01ffd6840c2fbb96f956c0b11686575", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "House Acts to Avoid Shutdown but Senate Democrats Could Still Block the Measure – Fortune", "url": "http://fortune.com/2018/01/18/government-shutdown-funding-bill-immigrants/", "country": "US", "domain_rank": 1196, "title": "House Acts to Avoid Shutdown but Senate Democrats Could Still Block the Measure", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T04:21:00.000+02:00", "replies_count": 0, "uuid": "c40d1d74c01ffd6840c2fbb96f956c0b11686575"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/18/government-shutdown-funding-bill-immigrants/", "ord_in_thread": 0, "title": "House Acts to Avoid Shutdown but Senate Democrats Could Still Block the Measure", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "john cornyn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "house freedom caucus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The House passed a spending bill Thursday to avoid a U.S. government shutdown, but Senate Democrats say they have the votes to block the measure in a bid to force Republicans and President Donald Trump to include protection for young immigrants.\nThe 230-197 vote came just over a day before current funding is set to run out at midnight Friday. The bill would keep the government open through Feb. 16 while all sides negotiate on longer-term funding for defense and domestic programs. The Senate plans a procedural vote later Thursday, said second-ranking Senate Republican John Cornyn of Texas.\nShortly before the House vote, Trump wrote on Twitter: “House of Representatives needs to pass Government Funding Bill tonight. So important for our country – our Military needs it!”\nIn a show of strength, House Republicans had enough support within their own ranks to pass the measure without help from Democrats.\nSome members of the conservative House Freedom Caucus withheld their support through much of the day Thursday, but reached a last-minute agreement with Speaker Paul Ryan to hold votes later on a conservative immigration bill and a measure to boost defense spending without increasing non-defense spending.\nStill, Senate Democrats said they have the votes to block the measure in their chamber. At least 10 of the 18 Democrats who voted for a temporary funding measure in December have publicly announced their opposition, and a Democratic aide said there won't be enough party members who support the House bill.\nRepublicans would need at least a dozen Democratic votes to get the bill, H.R. 195, through the Senate after at least three of the 51 Republicans in the chamber said they would vote against it.\nCongress has needed to extend current funding levels while congressional leaders haggle over how much to raise spending on defense and domestic programs and whether to give protection from deportation to at least 690,000 undocumented immigrants brought to the U.S. as children.\nDemocrats have been demanding that Congress act now to protect the young immigrants who are shielded under the Obama-era Deferred Action for Childhood Arrivals program, which Trump plans to end on March 5. Republicans want to pair that issue with stronger border security and restrictions on other immigration programs.\nAs passed in the House, the bill would fund the government for four weeks, extend the Children's Health Insurance Program for six years and delay implementation of three taxes imposed by the Obama-era Affordable Care Act.\nTrump threw a wrench into the talks Thursday morning by tweeting that he didn't want the children's health-insurance provision in the short-term spending bill. He said it \"should be part of a long term solution, not a 30 Day, or short term, extension!\" The White House later backtracked and said the president supported the spending bill.\nIf Congress can't agree on a spending bill by midnight Friday or soon after, about 800,000 federal workers face furloughs and many government functions would be closed. In past shutdowns, that meant national parks were shuttered, some government contractors halted work and many agency functions, including release of economic statistics, were suspended. National security functions continued, as did others including air-traffic control and delivery of Social Security benefits.\n2013 Shutdown The last shutdown occurred in 2013 when Republican lawmakers unsuccessfully tried to eliminate funding of then-President Barack Obama's signature legislative achievement, the Affordable Care Act. Republicans had the majority in the House, while Democrats held the Senate.\nThe GOP now controls both chambers of Congress and the White House, and Democrats are using the must-pass bill to force other policy concessions. It's not clear who would take most of the political blame for a shutdown, and the stakes are high ahead of midterm elections in November.\nTo avoid a government shutdown, the Senate can either pass the House temporary spending bill or make changes and send it back to the House for another vote. The House isn't scheduled to be in session next week, but a shutdown may force members to stay.", "external_links": [], "published": "2018-01-19T04:21:00.000+02:00", "crawled": "2018-01-19T04:22:12.033+02:00", "highlightTitle": ""}