{"organizations": [], "uuid": "bab66350fc0f436ce9fcb645aac7bdb2a613a2fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936256-GettyImages-599066856.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/trump-ally-ex-sheriff-joe-arpaio-running-for-arizona-us-senate-seat.html", "country": "US", "domain_rank": 767, "title": "Trump ally and pardoned sheriff Joe Arpaio is running for Jeff Flake's Senate seat in Arizona", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T18:33:00.000+02:00", "replies_count": 0, "uuid": "bab66350fc0f436ce9fcb645aac7bdb2a613a2fc"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/trump-ally-ex-sheriff-joe-arpaio-running-for-arizona-us-senate-seat.html", "ord_in_thread": 0, "title": "Trump ally and pardoned sheriff Joe Arpaio is running for Jeff Flake's Senate seat in Arizona", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jeff flake", "sentiment": "negative"}, {"name": "joe arpaio", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "arpaio", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "maricopa county", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "washington examiner", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images Maricopa County Sheriff Joe Arpaio speaks in support of Republican presidential candidate Donald Trump during a Trump campaign rally on August 31, 2016 in Phoenix, Arizona. \nFormer Arizona Sheriff Joe Arpaio is running for U.S. Senate. \nThe 85-year-old immigration hard-liner on Tuesday announced his intention to run for the seat that will soon be vacated by Republican Sen. Jeff Flake , an outspoken critic of President Donald Trump . \n\"I have a lot to offer. I'm a big supporter of President Trump,\" Arpaio told the Washington Examiner in a phone interview . In another interview, with liberal-leaning site Talking Points Memo, Arpaio said he didn't discuss his decision to run with either the president or White House officials . \nArpaio's candidacy sets up a potentially volatile dynamic during this year's midterm election season, as Senate Majority Leader Mitch McConnell has sought to boost more traditional Republicans over populist and nativist candidates championed by Trump and his former advisor and campaign chief Steve Bannon . \nThe Republicans have a razor-thin margin of 51 to 49 in the Senate, after Democrat Doug Jones last month triumphed over Republican Roy Moore in traditionally deep-red Alabama. \nTrump pardoned Arpaio in August after the former Maricopa County sheriff was convicted of contempt of court over his practice of racially profiling Latinos. \nPro-Trump Republican Kelli Ward is already running for the seat, and mainstream Rep. Martha McSally is expected to enter the race. Arpaio tweet \nArizona's secretary of State's office said the state doesn't hold runoff elections in case a primary winner ends up with less than 50 percent of the vote. \n\"Conceivably we could have a dozen candidates in a special primary election. Who knows, maybe somebody with less than 20 percent of the vote will get elected,\" spokesman Matt Roberts told CNBC. \nThe Arizona primary is slated for Aug. 28. \nThe Alabama special GOP primary for Attorney General Jeff Sessions ' former Senate seat ended up in a runoff because no candidate reached 50 percent in the first primary vote. Sen. Luther Strange, the establishment candidate backed by McConnell who was endorsed by Trump during the primary, lost to Moore, who was supported by Bannon and eventually earned Trump's full-throated endorsement despite allegations of sexual misconduct and assault. \nMoore, who is known for his anti-gay views and other hard-right positions, then lost in the main special election to former prosecutor Jones, marking the first time a Democrat won a U.S. Senate seat in Alabama in more than two decades. \nLikewise, it has been more than two decades since Arizona had a U.S. senator from the Democratic Party. The Democratic field in the race for Flake's seat includes Rep. Kyrsten Sinema. \nTrump beat his Democrat Hillary Clinton by fewer than 4 percentage points in Arizona during the 2016 presidential election. \nCorrection: This story was revised to correct Matt Roberts' title. He's a spokesman for Arizona's secretary of State. ", "external_links": [], "published": "2018-01-09T18:33:00.000+02:00", "crawled": "2018-01-09T18:50:06.043+02:00", "highlightTitle": ""}