{"organizations": [], "uuid": "7a2f5c0864b49eb1382e8f008535c711e457e713", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104960157-Leslie_China_4.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/22/moritz-right-silicon-valley-should-be-terrified-of-china-commentary.html", "country": "US", "domain_rank": 767, "title": "Michael Moritz is right: Silicon Valley should be terrified of China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T01:30:00.000+02:00", "replies_count": 0, "uuid": "7a2f5c0864b49eb1382e8f008535c711e457e713"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/moritz-right-silicon-valley-should-be-terrified-of-china-commentary.html", "ord_in_thread": 0, "title": "Michael Moritz is right: Silicon Valley should be terrified of China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The reaction has been swift and negative to investor Michael Moritz's essay arguing Silicon Valley companies have something to learn from China's hard-working entrepreneurship culture. Moritz, a partner at the exceptionally successful venture capital firm Sequoia, has been accused of being sexist , out of touch , and an evangelist of workaholism .\nI've spent my entire career working in China and travel to Shanghai monthly to visit manufacturing partners as CEO of Anomalie , a Silicon Valley-based e-commerce wedding dress company. My takeaway from visiting the country over 30 times is clear: Silicon Valley should be terrified to compete with Chinese entrepreneurs over the coming years.\nBased on my experience, the Bay Area criticism of Moritz reflects a lack of appreciation for China's recent history, a misunderstanding of the factors driving the work ethic of Chinese workers, and a worrying belief that Silicon Valley's pre-eminence as the center of entrepreneurship is to be inherited by future generations instead of fought for.\nThe first generation In Silicon Valley circles, it is common to acknowledge that people in China work harder than us but there is a prevailing sense that the Chinese miss an \"innovation gene.\" The thinking goes that China might outwork us, but Silicon Valley competitiveness will be sustained by a unique ecosystem that encourages risk-taking and invention.\nI used to have this biased view too but then I met Esther, the owner of a garment factory I worked with years ago. Walking with her through the floor of her 1,000-person operation, I asked her whether the enterprise was a family business. She gave me a confused look and said, \"The phrase 'Family Business' does not exist in China. My parents grew up during the Cultural Revolution.\"\nShe informed me of a fact I was embarrassingly ignorant of: this is China's first generation of entrepreneurs. The older generation, which runs the country and most large Chinese companies today, lived through a period of unfathomable violence, starvation and poverty under Mao. The biographies of China's leaders are case studies in human resourcefulness and resolve. The current President, Xi Jinping, had his education cut off at 15 and was later arrested for deserting his rural area and forced to dig ditches in a labor camp. Huang Nubo, one of China's richest men, saw his family lose everything and father commit suicide during the Cultural Revolution – he now writes poetry about this horrifying period.\nI have deep disagreements and concerns with many decisions the Chinese government makes domestically and internationally. But that doesn't negate that fact that what China has achieved over the past 40 years is the fastest and largest movement of humans from poverty to prosperity in history. The key lesson we should take from China's innovation culture is how fast it has developed, and how concerned we should be to compete with the ascending generation.\nThe Chinese work ethic springs from optimism Getting off the plane in Shanghai, I always have a sense that a once-in-a-century global shift is occurring and opportunity is everywhere.\nDetractors of Moritz's essay claim that long work hours in China is \" sadistic ,\" but I don't sense most people in China feel this way. Far from a dystopian workaholic state, I see in China a sense of optimism, feeling of upward mobility, and pace of improvement that is extraordinary. With the horrors of Mao still in recent memory, I (and I think many in China) see it as very inspirational that so many people have the opportunity to now work hard, provide for their families, and take them to Disneyland on the weekend.\nIt is also worth noting that the majority of managers I've worked with in China have been women. While they might not see their kids left often as they'd like, they are able to give those children a life their parents could have never dreamed of. Tens of millions of moms are also able to provide incredible role models to their children of what a smart, hard-working woman looks like.\nFrom my experience, the U.S. can learn a lot from China about women and work. A significantly higher percentage of Chinese tech companies have C-Suite women leaders than their U.S. counterparts. One senior female executive told me that she agrees with Warren Buffet's assertion that the U.S. economy has been operating for much of its history at \"50% capacity\" because of attitudes towards women. While there are obviously systemic gender inequities China must work through, I have personally never been in an environment that felt more meritocratic and less devoid of gender politics than when I am working with a Chinese team.\nThe younger generation in China is optimistic, hard-working, aggressively upwardly mobile, and adopting new tech trends and a furious pace . We should only expect China's pace of innovation to increase as they take over levers of power.\nTake the Flight In short, compared to the United States, China is an economy that is improving its innovation engine at an unprecedented rate with more workers who work longer hours at a higher labor participation rate. The disdain with which the Silicon Valley Twittersphere reacted to Moritz's call to learn from China unfortunately only highlights his point that a competitiveness gap is growing.\nThere are three direct flights per day from SFO to Shanghai. The flight is a quick 12 hours and often costs only $300. Everyone on our team makes this trip and I encourage anyone who cares about the future competitiveness of Silicon Valley to take this trip and view what is happening in China (particularly among the rising entrepreneurial generation).\nThe entrepreneurial economy is not zero-sum, and I hope that the competition among Chinese and American startups over the next generation will lift all boats. China is definitely learning from us and iterating quickly. Silicon Valley should heed the calls to learn from them.\nLeslie Voorhees is the CEO and co-founder of Anomalie , which brings more customization, transparency, and value to wedding dresses. She previously worked in supply chain operations for Nike and Apple in China. \nWATCH: There's more to investing in China than technology \nshow chapters There more to investing in China than technology      12:14 AM ET Fri, 19 Jan 2018 | 02:28", "external_links": [], "published": "2018-01-23T01:30:00.000+02:00", "crawled": "2018-01-23T02:28:51.017+02:00", "highlightTitle": ""}