{"organizations": [], "uuid": "3a142f83b81b8bbe0203961d5489f14eb6daa3a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/24/104861420-RTX3JT61-black-friday.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000116/device/rss", "section_title": "Retail", "url": "https://www.cnbc.com/2018/01/09/cramer-lists-6-tailwinds-for-consumer-related-stocks.html", "country": "US", "domain_rank": 767, "title": "Cramer lists 6 tailwinds for consumer-related stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T01:11:00.000+02:00", "replies_count": 0, "uuid": "3a142f83b81b8bbe0203961d5489f14eb6daa3a7"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/cramer-lists-6-tailwinds-for-consumer-related-stocks.html", "ord_in_thread": 0, "title": "Cramer lists 6 tailwinds for consumer-related stocks", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "icr conference", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "icr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One thing became clear to CNBC's Jim Cramer as he spoke to various consumer-facing CEOs at ICR's annual investment conference: the consumer is better off than many people think.\n\"The consumer is alive and well and spending. The consumer wants value. The consumer wants reliability. And the consumer will pay for it,\" the \" Mad Money \" host said. \"It almost feels like you can throw darts at the stocks of the consumer companies ... and end up with a winner.\"\nAs institutional investors and money managers chase industrial stocks for gains, Cramer found it worth turning his focus to the consumer cohort. Here are the six tailwinds he sees:\n1. Holidays For years, much of retail was bogged down by \"promotional activity,\" an industry phrase that means issuing deep discounts on items to get rid of inventory.\nBut after a robust holiday season where many retailers focused on tightening their inventories while still offering deals, Cramer said the outlook has improved — though not without a caveat.\n\"As much as I'd like to praise the companies themselves for getting it right, and they deserve it, it's almost like they'd have to go out of their way to get it wrong with this newfound, more positive consumer mindset,\" he said.\n2. Trump Some might scoff, but even Cramer couldn't deny that President Donald Trump's policies have benefited business.\nWhile Trump can't take credit for the broader global economic expansion or the fact that the economy was already improving when he took office, his deregulation efforts have moved the needle, Cramer said.\n\"Corporations don't fear expanding as much as they used to because they know we now have a much more benign regulatory environment, and I bet that's what the banks will say when they start reporting on Friday ,\" the \"Mad Money\" host said. \"I'm not really a believer in trickle-down economics, but some of that trickles down to the consumer.\"\n3. Taxes Nearly every company Cramer has touched base with has cash on the sidelines. Because most consumer-facing companies are high domestic taxpayers, the \"Mad Money\" host expected corporate tax cuts to reflect nicely on their balance sheets.\n\"Their budgets for buybacks and dividends were all based on the old tax code, so those dividends and buybacks are about to get bigger ,\" he said.\n4. Jobs Even without meaningful wage inflation, job creation is inspiring confidence — and spending — among consumers, Cramer said. \n\"Those hundred companies offering bonuses certainly don't hurt, especially because I expect many more to do so,\" he added.\n5. E-commerce Companies are finally starting to mobilize, digitize and push back against e-commerce giants like Amazon , improving their customer experiences and sparking buy-online-pick-up-in-store initiatives, Cramer said.\n\"They got wise,\" he said. \"They're competing on a more level playing field, meaning Amazon is no longer the retail Death Star .\"\n6. Value Last but not least, consumers are increasingly seeking value, which is as present in a $1,000 Canada Goose jacket as it is in a $4 meal from Denny's, Cramer said.\nWhat matters to consumers now is quality and service, meaning chains that focus on these aspects — like Kohl's, according to its CEO — are poised to succeed, the \"Mad Money\" host said.\nFinal Thoughts As many areas of the market surge or bounce back, Cramer asked investors to keep an eye on the hidden winners.\n\"Here's the bottom line, at least from the ICR conference as I see it: don't get in front of the consumer freight train,\" Cramer said. \"It's coming full speed ahead, and it's better to get on the locomotive than get run over by one.\"\nWATCH: Cramer on the state of the consumer-facing market show chapters Cramer lists 6 tailwinds for consumer-related stocks      21 Hours Ago | 10:28 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-10T01:11:00.000+02:00", "crawled": "2018-01-10T01:27:15.000+02:00", "highlightTitle": ""}