{"organizations": [], "uuid": "97ac26ee3ca79fdb2e958a312405375deb819336", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/09/23/102026562-Dell2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/dell-is-considering-acquisitions-or-a-possible-ipo-sources.html", "country": "US", "domain_rank": 767, "title": "Dell is considering acquisitions or an IPO in possible exit route for Silver Lake Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "97ac26ee3ca79fdb2e958a312405375deb819336"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/dell-is-considering-acquisitions-or-a-possible-ipo-sources.html", "ord_in_thread": 0, "title": "Dell is considering acquisitions or an IPO in possible exit route for Silver Lake Partners", "locations": [], "entities": {"persons": [{"name": "michael dell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "silver lake partners tech guide dell", "sentiment": "negative"}, {"name": "dell", "sentiment": "negative"}, {"name": "mins ago getty images michael dell", "sentiment": "none"}, {"name": "emc corp.", "sentiment": "none"}, {"name": "dell technologies", "sentiment": "none"}, {"name": "emc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. computer maker Dell Technologies is exploring a range of options that could see the world's largest privately held technology company grow further through acquisitions or go public, people familiar with the matter said on Thursday.\nDell's board of directors will meet later this month to consider the biggest shakeup in the company's history since it acquired data storage provider EMC Corp. for $67 billion in 2016, the sources said.\nThe Round Rock, Texas-based company, headed by its founder Michael Dell, is under pressure to boost its profitability after the EMC deal failed to deliver the cost savings and performance it projected, while higher component costs and a challenging data storage market have eroded its margins.\nDell is reviewing a list of several possible acquisition targets that would boost its cash flow and expand its offerings, the sources said.\nDell's review is at its very early stages and no deal is certain, according to the sources, who requested anonymity to discuss the deliberations. The company did not respond to a request for comment outside of regular U.S. business hours. The news of Dells review was first reported by Bloomberg.\nDell is also considering a sale or initial public offering of its one of its fast-growing divisions, Pivotal Software, the sources said. It may also consider a transaction with its majority-owned VMware , a virtualization software maker. VMware shares, which have gained more than 62 percent in the past 12 months, touched an all-time high on Thursday.\nDell, whose technology portfolio spans servers, displays, workstations and gaming PCs, also has a security unit, RSA, and a cloud platform called Boomi.\nThe company has struggled with fierce competition in the storage market, as cloud-based rivals such as Amazon.com Inc's AWS and Microsoft Corp's Azure put pressure on prices. Dell's infrastructure chief, former EMC executive David Goulden, departed last fall, and the firm has since been working to reorganize its storage operations.\nThe PC market, which Michael Dell helped shape by founding Dell in 1984 as a University pre-med freshman with $1,000 in savings, has remained stagnant due to the popularity of smart phones and tablets, shrinking by 0.2 percent in 2017, according to International Data Corporation.\nA bright spot in Dell's business has been its servers, helping its total net revenue grow to $56.7 billion in the nine months to Nov. 3, from $41.6 billion a year earlier. However, the company's operating expenses soared from $10 billion to $17.3 billion, leading to an operating loss of $3 billion, up from a $1.6 billion operating loss a year ago.\nAn exit route for Silver Lake \nAnother consideration for Dell in its deliberations is offering a path to private equity firm Silver Lake to cash out on its investment in the company. Silver Lake helped bankroll Michael Dell's $24.9 billion deal in 2013 to take the company private and owns about 18 percent of the company.\nA stock market listing for Dell would allow Silver Lake to gradually begin selling down its stake. What is more, an IPO of Dell, or a divestiture of one or more of its assets, would help it pay down debt faster, saving it money on expensive interest payments, for which it currently pays about $2 billion annually.\nDell's $52.5 billion debt pile is expected to become more burdensome this year because the U.S. tax reform enacted last month caps a company's ability to deduct interest expense to 30 percent of its annual earnings before interest, tax, depreciation, and amortization.", "external_links": [], "published": "2018-01-26T14:00:00.000+02:00", "crawled": "2018-01-26T14:18:36.003+02:00", "highlightTitle": ""}