{"organizations": [], "uuid": "4d41681a82247644299db66fa59c0ccfa6f30454", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225305226&w=1200&r=LYNXMPEE0O1U6", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-fujitsu-divestiture-polaris-capital-g/fujitsu-to-sell-mobile-phone-unit-to-japanese-investment-fund-nikkei-idUSKBN1FE39U", "country": "US", "domain_rank": 408, "title": "Fujitsu to sell mobile phone unit to Japanese investment fund: Nikkei", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T01:27:00.000+02:00", "replies_count": 0, "uuid": "4d41681a82247644299db66fa59c0ccfa6f30454"}, "author": "", "url": "https://www.reuters.com/article/us-fujitsu-divestiture-polaris-capital-g/fujitsu-to-sell-mobile-phone-unit-to-japanese-investment-fund-nikkei-idUSKBN1FE39U", "ord_in_thread": 0, "title": "Fujitsu to sell mobile phone unit to Japanese investment fund: Nikkei", "locations": [], "entities": {"persons": [{"name": "shri navarat", "sentiment": "none"}, {"name": "rushil dutta", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "fujitsu", "sentiment": "negative"}, {"name": "polaris", "sentiment": "none"}, {"name": "polaris capital group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nikkei reuters staff", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}, {"name": "fujitsu ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 11:30 PM / in 16 hours Fujitsu in talks to sell mobile phone unit, highlighting fading Japanese presence Minami Funakoshi , Junko Fujita 3 Min Read \n(Reuters) - Japan’s Fujitsu Ltd said on Friday it was in talks about selling its mobile phone business to investment fund Polaris Capital Group, becoming the latest Japanese electronics maker to withdraw from the sector. \nThe sale, if realized, would leave just three Japanese electronics makers - Sony Corp, Sharp Corp and Kyocera Corp - in a global market dominated by Apple Inc, Samsung Electronic Co Ltd and cheaper Chinese rivals. \nThe potential deal calls for Tokyo-based Polaris Capital to take a majority stake in Fujitsu’s mobile phone unit, which is valued at around 40 billion yen to 50 billion yen ($365 million to $456 million), a source familiar with the situation said. \nThe size of the stake is still under negotiation, said the person, who asked not to be identified as the discussions were confidential. \nAn official agreement is expected by the end of the month, the Nikkei newspaper said. \nPolaris will aim to list the business in several years, the Yomiuri newspaper reported. \nFujitsu said in a statement that no decision has been made and a representative declined to comment on how large a stake is being negotiated. \nAround the year 2000, there were more than 10 major Japanese handset firms producing traditional flip phones, including NEC Corp and Toshiba Corp. \nBut most have since withdrawn from the business, caught out by the meteoric rise of Apple and Samsung. \nDomestic makers failed to gain a global presence by being overly reliant on the lucrative domestic market, which gave them little incentive to change their Japan-specific mobile phone formats and expand overseas. \nThe rise of low-cost component producers such as Taiwan’s MediaTek Inc also have made it easier for price-competitive Chinese rivals to enter the market. \nFujitsu, whose shares were up 1.0 percent in a flat broader market, has been unloading other non-core businesses as well. \nLast year, Lenovo Group agreed to buy a majority stake in Fujitsu’s personal computer unit for up to $269 million in a bid to capture a larger share of a market that is battling weak sales as more people switch to mobile devices. \nThe Nikkei added that retaining the mobile division’s staff and factories will likely be a condition of the deal. Fujitsu, which wants to focus on its core information technology services business, is also expected to continue operating its Arrows brand under Polaris, the source said. \nFujitsu, which spun off its mobile phone operations into a separate company in 2016, had drawn interest from other investment funds such as Britain’s CVC Capital Partners Ltd and Chinese personal computer maker Lenovo Group Ltd, the Nikkei reported last year. Reporting by Minami Funakoshi and Junko Fujita in Tokyo, writing by Makiko Yamazaki in Tokyo, with additional reporting by Rushil Dutta in Bengaluru; Editing by Shri Navaratnam and Malcolm Foster", "external_links": [], "published": "2018-01-26T01:27:00.000+02:00", "crawled": "2018-01-26T01:44:39.006+02:00", "highlightTitle": ""}