{"organizations": [], "uuid": "56955de43de1f6b80d7678694eb462faa1de477e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/02/104442380-IMG_2058.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/top-vc-deals-john-chambers-pony-ai-ziroom-jump-softbank.html", "country": "US", "domain_rank": 767, "title": "Top VC deals: John Chambers starts a fund, and ex-Baidu exec scores funding for self-driving cars", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T03:29:00.000+02:00", "replies_count": 0, "uuid": "56955de43de1f6b80d7678694eb462faa1de477e"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/top-vc-deals-john-chambers-pony-ai-ziroom-jump-softbank.html", "ord_in_thread": 0, "title": "Top VC deals: John Chambers starts a fund, and ex-Baidu exec scores funding for self-driving cars", "locations": [], "entities": {"persons": [{"name": "john chambers", "sentiment": "negative"}, {"name": "unata", "sentiment": "none"}, {"name": "warburg pincus", "sentiment": "none"}, {"name": "travis kalanick", "sentiment": "none"}, {"name": "pony ma  ziroom", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "unata", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "sequoia capital china", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "cfius", "sentiment": "none"}, {"name": "getty images tencent", "sentiment": "none"}, {"name": "axios", "sentiment": "none"}, {"name": "vcg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3:09 PM ET Tue, 28 Nov 2017 | 02:07 \nInstacart acquired Unata in a deal valued at $65 million, the companies announced on Wednesday. The Toronto-based start-up had raised $1.2 million in funding from MaRS Investment Accelerator Fund and others. Unata's software delivers personalized product recommendations to shoppers, a la the Netflix recommendation engine. It also helps grocery shoppers keep digital lists, and use loyalty rewards. \nSoftBank said it had closed a massive investment in Uber , representing an exit for founder and former CEO Travis Kalanick and other earlier investors who sold some of their shares to SoftBank. The deal remains subject to a CFIUS review, however, Axios reported . Start-ups VCG | Getty Images Tencent chairman and CEO Pony Ma \nZiroom, an apartment renting platform in China, scored a curve-throwing series A funding round of $621 million. The deal was co-led by Warburg Pincus, Tencent and Sequoia Capital China. The company will use the capital to \"increase its rental supply, boost supportive services, and invest in technology capacity and employee training,\" Ziroom CEO Xiong Lin said in an interview with Caixing Global. Pony.ai is developing self-driving car technologies. \nJames Peng and Tiancheng Lou, formerly of Baidu and Google respectively, raised $112 million in series A funding for their new self-driving tech venture, Pony.ai. The start-up is developing systems that give cars \"level 4 autonomy,\" meaning they can safely drive themselves in suburban and urban environments, and can deal with bad weather. Morningside Venture Capital and Legend Capital led the round. Other investors included a mix of Chinese and Silicon Valley based funds, including Sequoia Capital China, IDG Capital, Polaris, DCM and Comcast Ventures. ( Disclosure: Comcast is the owner of NBCUniversal, parent company of CNBC and CNBC.com.) \nE-commerce companies are still scoring venture funding, despite Amazon's dominance. In one of the latest deals, Grove Collaborative raised $35 million in a series C round to sell \"all-natural\" home and personal care products direct-to-consumers. \nCircleCI raised $31 million in a series C round led by Top Tier Capital Partners for devops tools, or tools that help companies develop and maintain their own software more efficiently. CircleCI's customer list includes: Facebook, Spotify, GoPro, Blue Apron and Coinbase. Industry Ventures, Heavybit and earlier backers Scale Venture Partners, Baseline Ventures, Harrison Metal and DFJ also joined the round. New York-based Jump Bikes brought dockless bike sharing to the U.S. \nVCs are still hoping that bike sharing will take off in the U.S. as it has in China, or for that matter, Amsterdam. Jump Bikes (formerly known as Social Bicycles) raised $10 million in a series A round to grow its service. The New York City start-up was the first to offer dockless bike sharing in the U.S. Menlo Ventures led the round joined by Sinewave Ventures and Esther Dyson. The company has most recently rolled out pedal-assist electric bikes, which help riders conquering hills without breaking a sweat. \nA start-up developing collision avoidance technology for commercial drones, Iris Automation , has raised $8 million in a series A round of funding led by Bessemer Venture Partners and joined by Bee Partners. Funds & Firms Katie Kramer | CNBC John Chambers \nJohn Chambers, former CEO and chairman of Cisco, has a new venture capital firm called JC2 . The vaunted tech exec is looking to back start-ups involved in the Internet of Things, digital communications, security and agriculture. Self-funded JC2 has backed 8 companies so far including drone software developer Airware and social media management company Sprinklr. \nParis-based Ring Capital closed a $170 million fund, TechCrunch reported . Its limited partners included dozens of French angel investors and entreprneeurs, as well as Bpifrance through the \"Programme d'Investissements d'Avenir\", AG2R La Mondiale, BRED, Danone and Tikehau Capital. ", "external_links": [], "published": "2018-01-20T03:29:00.000+02:00", "crawled": "2018-01-20T04:57:18.063+02:00", "highlightTitle": ""}