{"organizations": [], "uuid": "ce883651384bc619c0e68d475b75d8761a60dfc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 449, "shares": 449, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965727-AP_957228432478.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/bill-kristol-takes-on-fox-news-tucker-carlson.html", "country": "US", "domain_rank": 767, "title": "Bill Kristol hits Fox News, Tucker Carlson for 'dumbing down' coverage, pushing 'ethno-nationalism'", "performance_score": 4, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "ce883651384bc619c0e68d475b75d8761a60dfc1"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/bill-kristol-takes-on-fox-news-tucker-carlson.html", "ord_in_thread": 0, "title": "Bill Kristol hits Fox News, Tucker Carlson for 'dumbing down' coverage, pushing 'ethno-nationalism'", "locations": [], "entities": {"persons": [{"name": "john harwood", "sentiment": "negative"}, {"name": "bill kristol", "sentiment": "negative"}, {"name": "tucker carlson", "sentiment": "negative"}, {"name": "richard drew", "sentiment": "none"}, {"name": "harwood", "sentiment": "none"}, {"name": "kristol", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "fox news", "sentiment": "negative"}, {"name": "cnn", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC's John Harwood recently sat down with conservative pundit Bill Kristol to discuss a wide range of topics, including the Trump administration, the proper role of government, the state of conservative media and, here, the evolution of conservative media such as Fox News.\nCNBC's John Harwood: The development of conservative media.\nBill Kristol: That's, I think, become really a problem in the last few years. Fox was always of course somewhat conservative. But it was one thing when it was the somewhat conservative alternative to somewhat liberal MSNBC, and to some degree CNN and mainstream media.\nRichard Drew | AP Tucker Carlson I was on Fox for 10 years really, 2002 to 2012. I think it was pretty good. It was a little tilted right? Sure.\nNow Fox is sort of — 75 percent of it seems to be birther-like coverage of different issues. That's been, I think, bad. And you put that together with the social media and the segmentation of everyone into bubbles, and I think there's some truth to that criticism.\nHarwood: Why do you think that happened on Fox?\nKristol: I don't know. There's a gradual increasing of recklessness.\nThe second term of Obama, I think, was a shock. I think one can't underestimate — that was a shock to the system. That was like, \"We're losing our country\" for a certain chunk of Fox viewers — as opposed to, \"That was an unfortunate election of Obama, but the tea party won and we, the Republicans, won the House in 2010, checked Obama really in 2011, 2012.\"\nHarwood: Did that strike you as an organic reaction to events, as opposed to a marketing decision?\nKristol: So I think it's both. One other thing: The Obama administration was more left wing in 2013, the second term, than the first term. So I think things objectively changed some. The mood of Republicans changed some. And Fox News maybe saw an opportunity, changed some, and then the whole thing together.\nI do feel now we're in a different world. I mean, now you look at — Tucker Carlson began at The Weekly Standard. Tucker Carlson was a great young reporter. He was one of the most gifted 24-year-olds I've seen in the 20 years that I edited the magazine. His copy was sort of perfect at age 24.\nHe had always a little touch of Pat Buchananism, I would say, paleo-conservativism. But that's very different from what he's become now. I mean, it is close now to racism, white — I mean, I don't know if it's racism exactly — but ethno-nationalism of some kind, let's call it. A combination of dumbing down, as you said earlier, and stirring people's emotions in a very unhealthy way.\nHarwood: As someone who knows Tucker, who hired Tucker, have you talked to him about this change?\nKristol: (shakes head no)\nHarwood: I want to go back to one other thing. You mentioned a disagreement with [the late Fox News chief Roger] Ailes that caused you to leave Fox. What was the disagreement?\nKristol: I mean, I wasn't going to talk about it. So he asked me to do something. It was nothing to do with anything that was on the air. He wasn't trying to tell me what to say.\nHe wanted me to call up people here in Washington and basically blackball someone who had run afoul of him on a totally separate matter in New York. And it seemed kind of crazy to me, and I wasn't going to do it. I didn't know what happened, but I wasn't going to just take his word for it and start calling about some other person I slightly knew and say, \"Don't hire this person.\"\nSo I just said, \"No.\" Suddenly, you know, I remember that Sunday I was pulled off 'Fox News Sunday.' Gradually I was cut back over the next year. So maybe Roger was getting more cranky and odd in his older age, but anyway that was the story.\nRead more Kristol on the state of the Republican Party\nKristol on businesses kissing up to Trump\nKristol on Sarah Palin", "external_links": [], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T14:11:03.002+02:00", "highlightTitle": ""}