{"organizations": [], "uuid": "e5c0c178fc3c968b7c4b095b7403b2383d31d6c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961918-9I9B0408.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/rubenstein-generally-when-people-are-happy-something-wrong-happens.html", "country": "US", "domain_rank": 767, "title": "Rubenstein: 'When people are happy and confident, something wrong happens'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T08:21:00.000+02:00", "replies_count": 0, "uuid": "e5c0c178fc3c968b7c4b095b7403b2383d31d6c0"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/rubenstein-generally-when-people-are-happy-something-wrong-happens.html", "ord_in_thread": 0, "title": "Rubenstein: 'When people are happy and confident, something wrong happens'", "locations": [], "entities": {"persons": [{"name": "rubenstein", "sentiment": "negative"}, {"name": "david rubenstein", "sentiment": "negative"}, {"name": "adam galica", "sentiment": "negative"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "wef", "sentiment": "negative"}, {"name": "carlyle group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Debt, geopolitics, unexpected world events and a widespread sense of general happiness: these are the things that worry private equity billionaire David Rubenstein the most.\nThe co-founder of global private equity firm Carlyle Group detailed his concerns while speaking at the World Economic Forum in Davos, during a panel on Tuesday entitled \"The Next Financial Crisis.\"\n\"Right now, the biggest concern I have is that most people think there is no problem of a likely recession this year or even maybe early next year. Generally when people are very happy and confident, something wrong happens,\" Rubenstein cautioned at the Bloomberg-moderated panel.\n\"I am nervous that the conventional wisdom is that we have no recession problems around the world, that everybody's doing quite well ... The conventional wisdom is usually wrong, and it might be in this case.\"\nThe American businessman and philanthropist went on to explain why debt and geopolitics are further sources of concern.\nshow chapters David Rubenstein: I think we'd be lucky and happy to get close to 3 percent GDP 10:17 AM ET Tue, 23 Jan 2018 | 01:00 \"I do worry that governments have a little bit too much debt, and maybe they have too many entitlement programs they're ultimately not going to be able to honor. At some point, people are going to wake up and say the U.S. government has $20 trillion dollars of debt and unfunded liabilities that are hard to fathom.\"\nTrepidation over mounting global debt is not new; numerous CEOs and finance officials have cited greater leverage across both emerging and advanced economies as among the greatest threats to global economic stability.\nRubenstein continued, \"I worry about geopolitical things we can't anticipate, the so-called black swans,\" suggesting a slew of potential threats from a \"9/11 type event\" to pandemics and conflicts involving Iran, Russia and China.\nMeanwhile, the CEO of Bank Pekao, Poland's second-largest bank, made a similar warning about what he believed to be a sort of oblivious optimism.\n\"Obviously there are many reasons to be optimistic -- the U.S. economy is growing fast, positive IMF outlook, emerging markets are growing fast,\" Pekao's Michal Krupinski told CNBC Wednesday.\n\"The problem is that once you're not able to find an imbalance in the global economy, you should always be aware of what is the weakest link. This makes me worried.\"\n\"Secondly, we have unprecedented actions from central banks,\" he added, referring to central banks' prolonged quantitative easing policies. \"The drug will be cut one day, and we're facing lots of structural problems.\"\nA common theme at Davos, and indeed over the past several months among investors, is whether the current skyrocketing growth of market valuations and increased capital flows are a harbinger of the next crash . David Rubenstein seems to think so.\n\"I think when everybody is complacent, that's usually when you have to be nervous,\" he said.\nshow chapters What is Davos? 12:34 AM ET Tue, 23 Jan 2018 | 03:12", "external_links": [], "published": "2018-01-24T08:21:00.000+02:00", "crawled": "2018-01-24T08:29:55.003+02:00", "highlightTitle": ""}