{"organizations": [], "uuid": "0d48cb830e027f134163fedca10ec00bf9e66fd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/11/16/103172254-GettyImages-464456275.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/sears-lands-additional-financing-even-as-holiday-sales-disappoint.html", "country": "US", "domain_rank": 767, "title": "Sears lands additional financing, even as holiday sales disappoint", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T14:48:00.000+02:00", "replies_count": 0, "uuid": "0d48cb830e027f134163fedca10ec00bf9e66fd5"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/sears-lands-additional-financing-even-as-holiday-sales-disappoint.html", "ord_in_thread": 0, "title": "Sears lands additional financing, even as holiday sales disappoint", "locations": [], "entities": {"persons": [{"name": "sears", "sentiment": "none"}], "locations": [], "organizations": [{"name": "sears holdings", "sentiment": "negative"}, {"name": "sears", "sentiment": "negative"}, {"name": "kmart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sears Holdings said Wednesday it suffered another disappointing holiday season, making it more challenging as the struggling retailer scrambles to refinance its debt.\nThe parent company of Sears and Kmart stores said it's in talks with lenders about transactions that would strengthen its balance sheet and improve the terms on more than $1 billion of debt. This would help the chain reduce cash interest expenses and extend maturities.\nWhile reiterating his beliefs that Sears has the right strategy to turn itself around, Chief Executive Officer Eddie Lampert wrote in blog post that, should the refinancing \"not be fully successful, the Company's Board will consider all other options to maximize the value of Sears Holdings' assets.\"\nSears' shares climbed 3.5 percent Wednesday, after falling more than 12 percent in the opening trading days of 2018.\nSears has also raised $100 million in new financing and is pursuing an additional $200 million from other lenders, the company revealed Wednesday.\nSears has been in discussions about monetizing some of its own brands and assets, Lampert said. That could include diversifying Sears' revenue stream through its Home Services, Auto Services, Kenmore, and DieHard businesses, but these actions require \"a more stable environment and more cooperative partners,\" according to the CEO and hedge fund manager.\nJust last week, Sears announced another round of store closures, which the company said were some of its \"lowest performing\" locations. In turn, Sears has been piloting smaller concept stores that only showcase mattresses and appliances, and it recently started selling some of its brands (Kenmore and DieHard) through Amazon .\nTo be sure, none of this covers up the fact Sears had a dismal holiday season. Overall same-store sales dropped 16 to 17 percent for the first two months of the fourth quarter.\nThe company now expects to book a fourth-quarter adjusted loss of $10 million to $70 million, compared with a loss of $61 million a year ago. A net loss attributable to Sears Holdings' shareholders should range from $200 million to $320 million in the fourth quarter, Sears said, compared with a net loss of $607 million during the same period in 2016.\nThe company didn't disclose when it will report fourth-quarter and full-year results.\nUnlike its peers, which are largely benefiting from a strong economy and greater consumer confidence, the embattled department store chain hasn't been able to drive sales higher. But Sears is still working to cut costs in 2018 and said it should be able to trim about $200 million in expenses, on an annualized basis, which would be unrelated to any store closures.\nManagement has also reaffirmed Sears is still pushing to return to profitability against a backdrop of vendor disputes and liquidation sales.\n\"As previously announced, we are actively pursuing transactions to adjust our capital structure in order to generate liquidity and increase our financial flexibility,\" Chief Financial Officer Rob Riecker said.\nSears said its latest $100 million in funding as well as the $200 million it's seeking would be supported by ground leases on its real estate assets and other \"select intellectual property.\"\nMoving forward, Lampert said Sears could \"materially improve the financial strength and operating focus of Sears Holdings and provide meaningful reassurance of our viability to our vendors and business partners.\" The CEO added that Sears has made progress in prefunding contributions to its pension plan for the next two years.\nThe department store chain recently struck a deal with the Pension Benefit Guaranty Corp. over its pension obligations, clearing the way for the company to try to sell about 140 additional properties. In exchange, Sears said it would pay $407 million to the plan.\n\"While these actions have so far helped our Company survive the so-called 'Retail Apocalypse' ... we need to undertake further measures,\" Lampert said in a statement.\nAnalysts and investors remain skeptical Lampert's \"actions\" will work over the long term.\n\"Sears is taking additional steps to address its upcoming maturities in fiscal 2018 and improve its liquidity as its unencumbered asset base continues to decline and its business turnaround remains elusive,\" Moody's analyst Christina Boni wrote in a note to clients.\n\"Despite brighter sales in the department store sector this holiday season, Sears continued to significantly underperform with comparable store sales declining in the range of 16-17% for the November/December period,\" Boni said.\nWATCH: Sears announces more store closures show chapters Sears to close an additional 103 Kmart and Sears stores      4:56 PM ET Thu, 4 Jan 2018 | 01:21", "external_links": [], "published": "2018-01-10T14:48:00.000+02:00", "crawled": "2018-01-10T14:56:48.003+02:00", "highlightTitle": ""}