{"organizations": [], "uuid": "aa4bf84cc07dc768de4824d63421c844d3a43886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/18/103879250-squatty_potty4.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/moms-constipation-turns-into-33-million-juggernaut-squatty-potty.html", "country": "US", "domain_rank": 767, "title": "How a mom's constipation turned into a $33 million cult juggernaut", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T16:00:00.000+02:00", "replies_count": 0, "uuid": "aa4bf84cc07dc768de4824d63421c844d3a43886"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/moms-constipation-turns-into-33-million-juggernaut-squatty-potty.html", "ord_in_thread": 0, "title": "How a mom's constipation turned into a $33 million cult juggernaut", "locations": [], "entities": {"persons": [{"name": "judy edwards", "sentiment": "none"}, {"name": "judy", "sentiment": "none"}, {"name": "bobby edwards", "sentiment": "none"}, {"name": "jeniece pettitt", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "bobby", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}], "organizations": [{"name": "cnbc squatty potty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A simple white plastic footstool that tucks under your toilet has made one Utah family multimillionaires.\n\"Now everyone is like, 'Why didn't I think of that?'\" said Bobby Edwards, the creator and CEO of Squatty Potty. \"I have proven a lot of people wrong, and it's felt really good.\"\nIt all started because Bobby's mother had trouble in the bathroom. \"I was constipated my whole life,\" Judy Edwards reluctantly admitted. Age only made the problem worse. A few years ago, a medical professional recommended Judy use a footstool to raise her knees while on the toilet.\nShe tried it, and it worked. \"It's just a world of difference,\" she said. Her husband, Bill, was amazed. \"We both thought, 'Wow, we're in our 60s, why are we just now hearing about this?'\"\nBut the footstool wasn't perfect, and so Bobby — a self-described gypsy forever looking to make a \"big splash\" — saw a business opportunity. \"There was nothing out there on the market that we could find to help us solve the problem. So we made it.\"\nJeniece Pettitt | CNBC Squatty Potty has a variety of options for sale including this wooden stool They made the first stool out of wood and named it the Squatty Potty, based on what they heard traditional hole-in-the-ground toilets in China were called. Other potential names included \"The Health Step,\" \"The S--- Shelf\" and \"The Stool Stool.\"\nBobby said squatting is the way humans are supposed to, well, poop. \"We all have a kink in our colon,\" he said. \"It's there to maintain continence. Otherwise we'd be crapping our pants wherever we go.\" Sitting on a toilet relaxes the kink to a point, but squatting opens everything up for better evacuation. \"Most of your problems with your colon start where that kink is,\" said his father, Bill.\nJeniece Pettitt | CNBC The Squatty Potty tucks right in to most toilets. The family began giving footstools to friends, who considered them gag gifts, until they started using them. \"I saw the results, and I saw the effect on people, and I'm like, 'There really is something here,'\" said Bobby. So he and his parents and one other brother took $35,000 to set up a website and begin manufacturing for real.\nJudy decided the stools needed to be made out of plastic to bring down the price, and they placed their first large order. \"The first order was like 2,000 Squatty Potties. They arrived from China, and we got this big container full,\" said Bobby. \"I was like, 'What? We are never going to sell these,' right? Now we sell that many a day.\"\nJeniece Pettitt | CNBC The founders of Squatty Potty. Bobby, Judy and Bill Edwards. In the beginning, Bobby sent free Squatty Potties to health bloggers to generate buzz, and success has flowed with more regularity than Metamucil. Dr. Oz's show called (Bill Edwards thought it was a crank call from his kids), and then Howard Stern started talking about the product.\nFinally, on their second try, Squatty Potty qualified for \"Shark Tank.\" They sold $1 million in product within 24 hours of the TV appearance, and the company also received a $350,000 investment from Lori Greiner, which led to high-profile shelf space in Bed Bath & Beyond .\nFirst-year sales in 2011 were $17,000. Sales hit a whopping $19 million in 2015. And by the end of 2017, they reached nearly $33 million. \"We're going to probably hit $100 million within the next few years,\" said Judy.\nIn the past year, the company has developed new products like a toilet plunger incorporating the poo emoji and a line of toilet deodorant sprays. The Edwards have expanded operations in Utah and added a new plant in Canada to focus on international sales.\nThe biggest challenge has always been finding a marketing balance between humor and health. \"You can get really gross, or you can get so ambiguous that people don't know what you're talking about,\" said Bobby.\nThe Squatty Potty YouTube ad is a good example. It stars a Prince Charming character and a unicorn that poops ice cream. \"This is where your ice cream comes from,\" says the prince. \"(Unicorns) are good at pooping, but you know who sucks at pooping? You do.\"\nWhen first presented with the idea for the video, the Edwards family thought it was too cheeky and too expensive. \"We're talking about a subject nobody wants to talk about,\" said Judy, \"and if a unicorn, or anything, is going to show poop, we don't want it to be poop, we want it to be something that people like and enjoy.\"\nHence, the ice cream. \"It's not OK to talk about poop, but it's OK to talk about ice cream,\" said Bill.\nThey eventually decided to spend $250,000 to make the ad. At last count, it had over 100 million views, and sales have surged. \"We're going to make more videos, and they're going to cost a lot more than that,\" Bill laughed.\nJeniece Pettitt | CNBC Bobby Edwards demonstrates how the Squatty Potty works. Squatty Potty has run into a couple of hiccups. In May 2017, the company dropped Kathy Griffin as a spokeswoman after her infamous photo with a fake severed head of Donald Trump.\nAlso, after releasing their new SquattyPottymus for kids last fall, they recalled the top portion — the \"hat\" — after receiving reports of two children slipping and hurting themselves. The rest of the unit continued to sell well through the holidays.\nUltimately, the success has been stunning. Judy Edwards originally thought they might just sell a few Squatty Potties here or there to help supplement their retirement income, because no one likes to discuss pooping problems.\n\"I still am embarrassed to talk about it,\" she said. Not nearly as embarrassed as she used to be.\nLearn more about the founders of Squatty Potty in CNBC's new podcast: Strange Success , which you can listen to on Apple Podcasts.\nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\" This is an update of a previously published article.", "external_links": [], "published": "2018-01-10T16:00:00.000+02:00", "crawled": "2018-01-10T16:19:24.005+02:00", "highlightTitle": ""}