{"organizations": [], "uuid": "e45f37484c2a24a83c9b18d41793c612606ff194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/12/104582520-20170712-3907-2401.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/best-time-in-decades-to-own-commodities-says-goldmans-currie.html", "country": "US", "domain_rank": 767, "title": "This is the best time in decades to own commodities, says Goldman Sachs commodities chief", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T23:19:00.000+02:00", "replies_count": 0, "uuid": "e45f37484c2a24a83c9b18d41793c612606ff194"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/best-time-in-decades-to-own-commodities-says-goldmans-currie.html", "ord_in_thread": 0, "title": "This is the best time in decades to own commodities, says Goldman Sachs commodities chief", "locations": [], "entities": {"persons": [{"name": "currie", "sentiment": "none"}, {"name": "jeffrey currie", "sentiment": "none"}], "locations": [], "organizations": [{"name": "goldman sachs", "sentiment": "positive"}, {"name": "cnbc", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 03:06 \nToday's global economy has created the best backdrop in \"decades\" for owning commodities, says Jeffrey Currie, global head of commodities for Goldman Sachs. \nIn Currie's view, the market's love affair with technology equities, especially the FANG stocks, is unjustly drawing capital away from commodities. \n\"I think it has a lot to do with the fact that the equity market has the wind in its sails. It had great year last year,\" told CNBC's \"Power Lunch\" on Tuesday. \"Commodities had a miserable year. History says commodities will outperform equities this year.\" \nCurrie went so far as to disagree with Goldman's ranking of asset classes for 2018, which places stocks above commodities. \n\"History says it's commodities, equities, bonds and cash,\" he said. \nCurrie's outlook for commodities boils down to three R's: reflation, reconvergence of global growth and releveraging. In other words, inflation is expected to rise, global economies are growing in unison and the world is borrowing more money. \n\"You put those three together, they create a really strong macro backdrop — the best, again, we've seen since maybe 2004,\" Currie said. Adam Jeffery | CNBC Jeff Currie \nThere's also a benefit to buying and holding a broad range of commodities, known as positive carry, for the first time in years, Currie said. He noted there's currently positive carry for all the commodities in the Goldman Sachs Commodity Index. \nAsked how long the bull cycle for commodities has to run, Currie says investors need to split the market into metals and energy. \nThe metals sector has experienced more than seven years of under-investment in new production of copper and other core metals, he said. Goldman expects copper to average $7,050 per ton in the final quarter of 2018, up from $6,750 in the year-ago period. \n\"It has a similar supply story as what we saw back in the 2000s,\" Currie said, referring to the start of an historic super cycle in commodities driven by Chinese economic growth. \"Then overlay that demand story on it, you have a lot of potential price upside in the base metals complex.\" \nOn the other hand, Currie believes the long-term story for energy can't be as good. That's because new technology like hydraulic fracturing and horizontal drilling allow producers to tap vast reserves of oil and natural gas, creating the risk of oversupply that will weigh on prices.", "external_links": [], "published": "2018-01-23T23:19:00.000+02:00", "crawled": "2018-01-23T23:56:31.012+02:00", "highlightTitle": ""}