{"organizations": [], "uuid": "ed14995303cdd5b496d7e608185d8ce87e83043a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Bitcoin Can’t Save the World’s Autocrats From the Sanctions Squeeze – Fortune", "url": "http://fortune.com/2018/01/15/bitcoin-sanctions-russia-north-korea/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Can’t Save the World’s Autocrats From the Sanctions Squeeze", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T04:05:00.000+02:00", "replies_count": 0, "uuid": "ed14995303cdd5b496d7e608185d8ce87e83043a"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/15/bitcoin-sanctions-russia-north-korea/", "ord_in_thread": 0, "title": "Bitcoin Can’t Save the World’s Autocrats From the Sanctions Squeeze", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "negative"}, {"name": "tom uren", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "save the world", "sentiment": "negative"}, {"name": "australian strategic policy institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 9:05 PM EST \nVladimir Putin’s finance ministry wants to let cryptocurrencies trade on official Russian exchanges. Kim Jong Un’s hackers are stealing digital cash. Nicolas Maduro hopes a cryptocurrency backed by oil will lure investment back to Venezuela. \nAll three leaders are wading into the crypto-craze as their regimes grapple with the same problem: Sanctions curbing their access to the global financial system. But while bitcoin and opaque virtual currencies can provide sources of cash for political pariahs, the market’s still too nascent to make a meaningful skirting of a U.S.-led economic blockade possible. \nAny autocrat eyeing bitcoin as a sanctions safe haven must confront a simple matter of scale. All the world’s digital tokens are worth about $700 billion, according to Coinmarketcap.com. That’s about one-seventh of the daily foreign exchange market. \n“Think about how many U.S. dollars are in circulation and how much each bitcoin would have to be worth to match that value — it would be a ludicrously big number,” said Tom Uren, a visiting fellow at the Australian Strategic Policy Institute’s International Cyber Policy Centre. “In the long term, that’s possible, but we are talking decades and decades. Cash isn’t going away any time soon.” Curbing the market \nMoreover, regulators are quickly moving to rein in digital currencies. China’s central bank declared initial coin offerings illegal in September. And on Thursday, South Korea’s justice minister reiterated a proposal to ban cryptocurrency exchanges altogether. Yonhap New Agency reported Saturday that authorities asked banks to adopt real-name digital currency accounts. \nFor more on Bitcoin, watch Fortune’s video: \nU.S. Treasury Secretary Steve Mnuchin told the Economic Club of Washington, D.C., on Friday he was “not at all” worried that Russia or others countries could use digital tokens to evade sanctions. “I don’t think that’s a concern,” Mnuchin said, noting that digital coin exchanges were subject to the same requirements as banks to scrutinize who their customers are. \nThe U.S. sanctions people and organizations, not assets, and those measures still apply to states that park their earnings in cryptocurrencies. Even if Maduro can overcome investor skepticism and attract support to Venezuela’s oil-backed “petro,” those who use the token could find themselves ensnared by sanctions. \n“The detail of how you issue it is critical because you have to trust the currency and there has to be a market for it,” said Jim Fitzsimmons, a director at Control Risks in Singapore. “Venezuela is having a really bad time. I just don’t see how the gee-wizzery cryptocurrency stuff is going to help.” \nIn Russia, the central bank opposes a finance ministry effort — announced Thursday — to allow cryptocurrency trading on official exchanges. Undeterred, Deputy Finance Minister Alexey Moiseev told reporters the ministry would use the “power of thoughts and words” to convince the central bank. \nUsing digital currencies to evade sanctions would be particularly problematic for petro-states that need access to the mainstream financial system — especially U.S. dollars — to sell their oil. Iran’s economy, for instance, is too big for bitcoin to serve as savior. \nStill, cryptocurrencies do open new avenues for isolated regimes and their political elite to smuggle cash across borders, especially for smaller, impoverished states like North Korea. North Korean hackers seized a South Korean server last summer and used it to mine digital coins worth about $25,000, according to Kwak Kyoung-ju, who leads a hacking analysis team at the South Korean government-backed Financial Security Institute. \nSouth Korean investigators are also probing if North Korean cyber thieves were responsible for the December collapse of a Seoul-based cryptocurrency exchange, which lost 17% of its assets. \n“These things are an incredible asset for criminals and governments who want to do illicit things because they are decentralized, they are not regulated, and there is a lot of anonymity,” said Tim Wellsmore, Canberra-based Asia-Pacific director of threat intelligence at FireEye Inc., a cyber security company. They are total freedom, “open slather,” he said. \nDigital currencies offer states a covert way to fund other sorts of mischief, such as financing armed rebel groups or bribing politicians, said ASPI’s Uren. But something like a cyber-attack on a country’s electric grid may be cheaper and more disruptive. \nOn Friday, Mnuchin said he was mostly concerned about bitcoin’s potential to be used in crimes, such as money laundering. He said he was working with U.S. and foreign regulators to closely monitor its use. \n“We want to make sure that bad people cannot use these currencies to do bad things,” he said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T04:05:00.000+02:00", "crawled": "2018-01-16T04:06:08.001+02:00", "highlightTitle": ""}