{"organizations": [], "uuid": "9eafd90511398703072f1e3bb0d603493fc46bca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/05/102480694-cuban.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/how-relativity-spaces-tim-ellis-got-mark-cuban-to-invest-500000.html", "country": "US", "domain_rank": 767, "title": "These guys cold-emailed Mark Cuban and got a half-million-dollar investment in their start-up", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T20:18:00.000+02:00", "replies_count": 0, "uuid": "9eafd90511398703072f1e3bb0d603493fc46bca"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/how-relativity-spaces-tim-ellis-got-mark-cuban-to-invest-500000.html", "ord_in_thread": 0, "title": "These guys cold-emailed Mark Cuban and got a half-million-dollar investment in their start-up", "locations": [], "entities": {"persons": [{"name": "tim ellis", "sentiment": "negative"}, {"name": "jordan noone", "sentiment": "negative"}, {"name": "ellis", "sentiment": "none"}, {"name": "noone", "sentiment": "none"}], "locations": [{"name": "mars", "sentiment": "none"}], "organizations": [{"name": "spacex", "sentiment": "negative"}, {"name": "abc", "sentiment": "none"}, {"name": "dallas mavericks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Blue Origin engineer Tim Ellis and SpaceX engineer Jordan Noone launched a space start-up together at the end of 2015 . The two aerospace techies have a lot of brains between them, but they needed capital for lift off.\n\"We actually raised our seed round from Mark Cuban — which was a cold email — a week after we said we are starting the company,\" says Ellis, speaking at the CB Insights A-ha Conference in December. Video of the session was published Wednesday.\n\"Yeah, we cold-emailed Mark Cuban with the email tagline, 'Space is sexy: 3D printing an entire rocket,'\" says Ellis — Relativity Space , the company he and Noone were pitching, 3D prints rocket parts. \"It was two months of due diligence after, but he gave us half a million dollars,\" says Ellis.\nCuban, famous for his role on ABC's \"Shark Tank,\" prefers email to other forms of communication. The owner of the Dallas Mavericks says he saves time by using email and it puts him in control of his schedule.\nAre you shooting for the Moon or Mars? 3D rocket printing pioneer @relativityspace's Tim Ellis gives his answer to @Bloomberg's @DanaHull \nEllis says part of the reason he got a response was because of his and his co-founder's impressive professional pedigree: \"It worked out, I think our team is very strong,\" he says at the CB Insights conference.\nSince graduating from start-up accelerator Y Combinator and getting the investment from billionaire Cuban, Ellis and Noone have worked to grow Relativity Space. As of December, the team was up to 14. Thus far, Relativity Space has raised $8.4 million, according to public database Crunchbase .\nBut Ellis knows they have a high bar to reach. \"We are going to live or die based on our ability to be the best in the world at 3D printing for rockets,\" he says.\nBy 3D printing a rocket instead of assembling the parts in a factory, Relativity Space is able to upgrade production specifications as quickly as it can update the software. It takes the existing aerospace companies between 12 and 18 months to build a rocket, but Relativity can build one in 60 days, says Ellis. \nRelativity's printed rocket engine: ignition to full thrust test of Aeon SN005. Designed and built by our team and tested \nIn addition to modernizing the rocket-building industry, Relativity has a long-term goal too: building rockets and other pieces of infrastructure on Mars.\n\"If you believe — which I do — that Elon [Musk] will send people and NASA is going to send people to Mars, and we are actually going to go build this city and start settling Mars ... you are going to need a whole bunch of other technologies,\" says Ellis. \n\"Any factory that is going to print rockets on Mars again can certainly print other things that you need, whether it is cars or structures to live in or other machinery and tooling.\" \nSee also: \nMark Cuban says that his best life hack is saying yes to email and no to meetings \nHow a 25-year-old high-school dropout cold-emailed Mark Cuban and got an investment \n5 tips for writing a great cold email from a guy who got Mark Cuban to reply in 20 minutes \nshow chapters Mark Cuban: AI will produce the world’s first trillionaires      4:19 PM ET Fri, 21 April 2017 | 00:46 Like this story? Like CNBC Make It on Facebook . \nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-25T20:18:00.000+02:00", "crawled": "2018-01-25T20:29:11.012+02:00", "highlightTitle": ""}