{"organizations": [], "uuid": "6cc7d6c57c57ee1c16ede14199596dcd613ddaf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Amazon Just Expanded Its HQ in Seattle. Now It Has a Rainforest – Fortune", "url": "http://fortune.com/2018/01/29/amazon-expanded-hq-seattle-rainforest/", "country": "US", "domain_rank": 1196, "title": "Amazon Just Expanded Its HQ in Seattle. Now It Has a Rainforest", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T14:26:00.000+02:00", "replies_count": 0, "uuid": "6cc7d6c57c57ee1c16ede14199596dcd613ddaf3"}, "author": "Reuters", "url": "http://fortune.com/2018/01/29/amazon-expanded-hq-seattle-rainforest/", "ord_in_thread": 0, "title": "Amazon Just Expanded Its HQ in Seattle. Now It Has a Rainforest", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "south lake union", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "rainforest amazon", "sentiment": "negative"}, {"name": "amazon", "sentiment": "neutral"}, {"name": "walmart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 7:26 AM EST \nAmazon on Monday opens a rainforest-like office space in Seattle that it hopes will spark new ideas for employees. \nWhile cities across North America are seeking to host Seattle-based Amazon’s second headquarters, the world’s largest online retailer is still expanding its main campus. Company office towers and high-end eateries have taken the place of warehouses and parking lots in Seattle’s South Lake Union district. The Spheres complex, officially open to workers on Tuesday, is the pinnacle of a decade of development here. \nThe Spheres’ three glass domes house some 40,000 plants of 400 species. Amazon, famous for its demanding work culture, hopes the Spheres’ lush environs will let employees reflect and have chance encounters, spawning new products or plans. \nThe space is more like a greenhouse than a typical office. Instead of enclosed conference rooms or desks, there are walkways and unconventional meeting spaces with chairs. \nRead: Walmart Is Bringing the Fight to Amazon’s Turf: E-books \nAmazon (amzn) has invested $3.7 billion on buildings and infrastructure in Seattle from 2010 to summer 2017, a figure that has public officials competing for its “HQ2” salivating. Amazon has said it expects to invest more than $5 billion in construction of HQ2 and to create as many as 50,000 jobs. \nEarlier this month, the online retailer narrowed 238 applications for its second headquarters to 20. The finalists, from Boston and New York to Austin, Texas, largely fit the bill of being big metropolises that can attract highly educated tech talent. \nAmazon started the frenzied HQ2 contest last summer and plans to pick a winner later this year. \nRead: This Is Amazon’s Master Plan to Become Profitable \nSeattle’s mayor, the governor of Washington and Amazon’s top real estate executive were expected to speak during the Spheres’ opening ceremony. The Spheres will become part of Amazon’s guided campus tours, and members of the public can also visit an exhibit at the Spheres by appointment starting Tuesday. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-29T14:26:00.000+02:00", "crawled": "2018-01-29T14:27:01.005+02:00", "highlightTitle": ""}