{"organizations": [], "uuid": "921283e79168110383d7e8351c55ba7bd4c8e114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104912388-rsz_264a0247.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/new-york-citys-aviary-bar-is-serving-an-everything-bagel-cocktail.html", "country": "US", "domain_rank": 767, "title": "The country’s most innovative bar is serving a $27 cocktail packaged in a pillow of bagel air", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T18:20:00.000+02:00", "replies_count": 0, "uuid": "921283e79168110383d7e8351c55ba7bd4c8e114"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/new-york-citys-aviary-bar-is-serving-an-everything-bagel-cocktail.html", "ord_in_thread": 0, "title": "The country’s most innovative bar is serving a $27 cocktail packaged in a pillow of bagel air", "locations": [], "entities": {"persons": [{"name": "andrea kramar", "sentiment": "none"}, {"name": "nick kokonas", "sentiment": "none"}, {"name": "grant achatz", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "alinea group", "sentiment": "none"}, {"name": "kentucky fried chicken", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "columbus circle", "sentiment": "none"}, {"name": "alinea group beverage di", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's not everyday that you're struck by something that makes you question your own senses.\nBut that's what happens when you experience the experimental cocktails at The Aviary NYC, the new high-concept bar imported from Chicago's most Michelin-starred chef, Grant Achatz, and his Alinea Group co-founder, Nick Kokonas.\nMaybe it's because the cocktails can cost as much as two Kentucky Fried Chicken family meals. Maybe it's because when The Aviary first opened in Chicago in 2011 people waited six hours to be among the first samplers, according to Eater . Maybe it's because at its Manhattan outpost perched on the 35th floor of the luxe Mandarin Oriental hotel, the signature cocktail comes ensconced in a bag containing the aroma of an \"everything\" bagel.\nCNBC | Andrea Kramar The Aviary NYC offers views of Columbus Circle from the 35th floor of The Madarin Oriental hotel. Whatever the reason, expectations for the self-proclaimed \"innovative\" bar run high — especially when entering a market like New York, which prides itself on cocktail craftsmanship.\nFor Alinea Group Beverage Director Micah Melton, it created a unique opportunity to defy what some might envision from a bar charging $38 for a Bloody Mary (its most expensive drink). \n\"At the end the day, it's still a bar so we don't want to take ourselves too seriously,\" he tells CNBC Make It . \"So the first thing we try to do is make it approachable and you know if you can get someone to laugh when they read the drink names then they're going to chill out a little bit.\"\nAnd while the cocktail names certainly don't sound too serious (How Does Snoop Dogg Use Lemongrass?, Boom Goes The Dynamite, Science A.F. ), what arrives on the table are among the top contenders in the progressive cocktail space.\nMelton, who started at The Aviary as an ice chef tasked with creating flavored, sculpted ice cubes in 2011, prepared a sampling of some of the restaurant's most popular drinks for CNBC Make It.\nCNBC | Mary Stevens The Aviary NYC's signature cocktails \"In the Rocks,\" \"Science A.F.\" and \"Wake and Bake\" in their finished states. \"The Wake and Bake is a cocktail that's inspired by breakfast in New York,\" he says, dropping off a Manhattan with a hint of coffee and orange liquor.\nThe $27 cocktail arrives at the table in a clear plastic bag emblazoned with The Aviary logo. Behind the bar — which is shielded by a pane of glass meant to reflect the restaurant's views of Central Park — garlic, onion, poppy seeds and sesame oil are heated in a volcano vaporizer and shot through a tube into the bag before it's sealed. When a server cuts it open, you're hit with the aroma of an everything bagel.\nGetting hit with the air of a bagel shop may put you more in the mood for bacon and eggs than a cocktail, and the gimmick of having your eyes and tastebuds experience something so different from what your nose is getting is confusing, yet it's oddly worthwhile. \nThe drink's origins stem from The Aviary's Chicago location where the concept of wrapping a bourbon cocktail in a pillow of oatmeal-scented air was born. Replacing oatmeal scents with bagel aroma was the natural move in coming to New York, explains Melton, even though it wasn't originally planned that way.\n\"The bagel was actually in the drink at first, and it didn't work out that well, he says, adding that it could take multiple iterations before he and his staff settle on a final concoction. \"A lot of it is ... trying and failing a lot of times and sometimes getting it right.\"\nNext up, Melton carries out something that looks more like a science experiment than a drink. Fittingly, The Aviary has dubbed it \"Science A.F.,\" named after the scientist who discovered penicillin, Alexander Fleming.\n\"It's a riff on the penicillin cocktail,\" Melton explains, paying homage to the 2005 creation from famous New York mixologist Sam Ross that fueled the rise of craft cocktails with its combination of Scotch, ginger and lemon. \"We kind of took that as inspiration and then added The Aviary style to it.\"\nThat style includes using a single-pot coffee brewer stuffed with fresh ginger, lemon, blueberries and honey, mixed with a combination of peated and blended Scotch. Hibiscus tea, with which the cocktail is infused, is heated over an open flame and mixed with dry ice to produce a billowing fog — it's part of the allure that allows The Aviary to charge $27 for the enjoyable drink. \nWhen it comes to taste, however, both drinks pale in comparison to the cocktail inspired by the ball drop at New York's celebration of the New Year dubbed \"In the Rocks.\"\nThe drink features a hollowed out ball of ice that's formed by the controlled freezing of a water balloon in a superchiller. Using a syringe, a drinkmaker injects the ice with the makings of an Old-Fashioned and places it in a glass atop crème-de-cassis granita. The creation is served with a half-glass of champagne for $29.\nThen comes the best part.\n\"You get the chance at the table to use a slingshot to crack the ice open,\" Melton explains, pointing to the slingshot device that's placed over the glass. \"It's, again, one of those things where we try to add something different to a really standard style of serving a cocktail.\"\nThough the focus is on cocktails, which get rotated and reimagined every few months, The Aviary also offers food in small plates. Perhaps the most eye-catching is actually not small at all, however: A $17 chicharron, listed on the menu as a \"giant crispy pork skin,\" measures in at roughly 2-feet long. Chef Dan Perretta says he can sell as many as 150 pounds worth of the salt and vinegar spiced snack in a day.\nCNBC | Andrea Kramar CNBC correspondent Zack Guzman is dwarfed by a giant, $17 chicharon. In its third month of operating, it might be too early to tell whether The Aviary NYC can attract as loyal a following as its original Chicago location, especially hidden on a high floor of an expensive hotel. A tepid review from Eater NY, in December questioned whether its possible.\nBut according to Melton, New York guests are reacting much the same way to his creations as they do in Chicago.\n\"We're having fun with it and making the drinks taste delicious and that's at the end of the day what matters,\" he says.\nVideo by CNBC's Andrea Kramar . \nDon't miss: \nThis entrepreneur is getting people to eat $100,000 of a venomous fish to save the ocean How a 33-year-old turned $200 into $1 million in 92 days selling Kevlar pants online This 24-year-old made $345,000 in 2 months by beating Kickstarters to market show chapters This entrepreneur is selling six figures worth of venomous fish to save the ocean      6:25 PM ET Thu, 2 Nov 2017 | 01:42 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-05T18:20:00.000+02:00", "crawled": "2018-01-05T18:40:03.020+02:00", "highlightTitle": ""}