{"organizations": [], "uuid": "137aad7fe72923a229c967d53a28a1204800752d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/15/104843254-GettyImages-869971836.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/oprah-winfrey-greatest-career-lesson.html", "country": "US", "domain_rank": 767, "title": "Self-made billionaire Oprah Winfrey shares her 'greatest' career lesson", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T16:31:00.000+02:00", "replies_count": 0, "uuid": "137aad7fe72923a229c967d53a28a1204800752d"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/oprah-winfrey-greatest-career-lesson.html", "ord_in_thread": 0, "title": "Self-made billionaire Oprah Winfrey shares her 'greatest' career lesson", "locations": [], "entities": {"persons": [{"name": "oprah winfrey", "sentiment": "negative"}, {"name": "angelou", "sentiment": "none"}, {"name": "winfrey", "sentiment": "none"}, {"name": "maya angelou", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "oprah magazine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10:00 AM ET Fri, 10 Feb 2017 | 00:47 SHARES \nSelf-made billionaire Oprah Winfrey says the \"greatest lesson\" she has learned and used throughout her career came from the late, renowned American poet and civil rights activist Maya Angelou. \n\"One of my greatest wisdom teachings is to assess from people's behaviors, their actions — not just towards me but to other people — who they are and how they behave,\" Winfrey said during a press conference after the Golden Globe Awards on Sunday. \nEarlier that night, Winfrey accepted the Cecil B. DeMille Award for lifetime achievement and gave a speech that prompted rumors that she may consider running for U.S. president in 2020 . \nWinfrey had known Angelou since nearly the start of her career in her 20s and often referred to the poet as her mother, sister, friend and \" one of the greatest influences \" in her life. In the May 2013 issue of \"O, The Oprah Magazine,\" Winfrey said she had been a fan of Angelou before first meeting in the 1970s. After reading Angelou's award-winning book, \"I Know Why the Caged Bird Sings,\" Winfrey connected to the author's life story. \n\"When I first met Maya, in the '70s, I couldn't have guessed what the next few decades would bring—or that she would be there for me every step of the way, a wise, loving presence and the greatest mentor I've ever known,\" Winfrey said. \nFrom the time the two first got to know each other, Winfrey recalled, Angelou had provided her a solid piece of advice on building relationships with people: Actions speak louder than words. \n\"Baby, you know, you need to know that when people show you who they are, you believe them the first time,\" Winfrey recalled Angelou telling her. \"Your problem is it takes you 29 times to see the same lesson coming in a different skirt or wearing a different pair of pants.\" A post shared by Oprah (@oprah) on Apr 4, 2017 at 8:40am PDT \nAngelou taught Winfrey that relationships — whether professional or personal — fundamentally depend not on who a person says he or she is, but how they act toward you and others. \nOne example Winfrey provided: \"When people talk about other people, they'll talk about you.\" \n\"So I think in business and personal relationships, that [has been] my greatest lesson,\" Winfrey added.", "external_links": [], "published": "2018-01-10T16:31:00.000+02:00", "crawled": "2018-01-10T16:43:22.001+02:00", "highlightTitle": ""}