{"organizations": [], "uuid": "00c63819d50c9dcc4112318da207829953fac3cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/20/104786528-GettyImages-627553078.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/self-made-billionaire-richard-branson-dont-waste-your-time-trying-to-be-normal.html", "country": "US", "domain_rank": 767, "title": "Self-made billionaire Richard Branson: 'Don’t waste your time trying to be normal'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T18:49:00.000+02:00", "replies_count": 0, "uuid": "00c63819d50c9dcc4112318da207829953fac3cb"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/self-made-billionaire-richard-branson-dont-waste-your-time-trying-to-be-normal.html", "ord_in_thread": 0, "title": "Self-made billionaire Richard Branson: 'Don’t waste your time trying to be normal'", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "branson", "sentiment": "none"}], "locations": [{"name": "pacific ocean", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "9:39 AM ET Thu, 19 Oct 2017 | 00:52 SHARES \nSelf-made billionaire Richard Branson says his ability to cross the Pacific Ocean in a hot air balloon and pursue his dream of traveling to space by starting a commercial spaceflight company comes from being a forward-thinking leader. \n\"I've never really had the desire to fit in and that's served me well in business. Innovation doesn't come from being comfortable and doing what everyone else is doing,\" Branson wrote in a recent blog post . \nIn order to become comfortable in your creativity and different way of thinking, Branson shared this main lesson: \"Don't waste your time trying to be normal.\" show chapters 2:04 PM ET Wed, 30 Aug 2017 | 02:16 \n\"We all have different qualities and strengths and we should use these to our advantage rather than just try to be like everybody else,\" he explained. \nBranson noted that whether it was leaving school at 16 or starting his airline with no experience of the aviation industry, he's always done things differently than others. \nAs a child, Branson had the opportunity to pursue his \"outlandish ideas\" thanks to his family. \n\"My parents nurtured my entrepreneurial spirit — even allowing me to grow Christmas trees and breed budgerigars to try and turn a profit when I was young,\" Branson wrote. \"They always had a positive attitude to my crazy ideas and I'm so glad they didn't try and force me to conform.\" \nIn 1997, Steve Jobs included Branson in an Apple marketing campaign titled \"Think Different.\" Branson was featured in a montage of clips including Martin Luther King, Jr. and John Lennon, as Jobs' voiceover said, \"Here's to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently.\" show chapters 12:14 PM ET Thu, 24 Aug 2017 | 01:33 \nFor Branson, the ability to be disruptive is \"an attitude that's shared by all leaders who seek to make a real difference.\" \n\"The mark of a good leader,\" Branson added, \"is being able to harness these different talents and empower people to be the best that they can be.\" \nThe Virgin Group founder got onto his unique path to success by doing what suited him best and playing to his strengths. As a result, he recommends that others also define their own paths to success. \nBut Branson says the risk of choosing the path less traveled will only pay off by doing these two things: \"If you pick yourself up time and time again and if you've done your homework.\" ", "external_links": [], "published": "2018-01-09T18:49:00.000+02:00", "crawled": "2018-01-09T19:09:12.001+02:00", "highlightTitle": ""}