{"organizations": [], "uuid": "fed1c3cebf7fcc181f7bc1e13d71538362898608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934376-GettyImages-902405298.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/oprah-for-president-mania-raises-important-point-about-women-and-politics-commentary.html", "country": "US", "domain_rank": 767, "title": "Oprah for president 'mania' raises one important point about women in politics", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:53:00.000+02:00", "replies_count": 0, "uuid": "fed1c3cebf7fcc181f7bc1e13d71538362898608"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/oprah-for-president-mania-raises-important-point-about-women-and-politics-commentary.html", "ord_in_thread": 0, "title": "Oprah for president 'mania' raises one important point about women in politics", "locations": [], "entities": {"persons": [{"name": "oprah winfrey", "sentiment": "positive"}, {"name": "oprah", "sentiment": "positive"}, {"name": "cecil b. demille", "sentiment": "positive"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "beverly hilton hotel", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES NBC Oprah Winfrey, recipient of the Cecil B. DeMille Award, poses in the press room at the 75th Annual Golden Globe Awards held at the Beverly Hilton Hotel on January 7, 2018. \nOff the back of a powerful Golden Globes speech, Oprah Winfrey has sparked feverish \"will she or won't she\" speculation about a potential presidential bid in 2020. Initial praise has been followed by the predictable combination of hero(ine) worship and personal attacks. \nBut amid all the noise, Oprah-mania raises an important point: we need to get better at recruiting successful women to enter politics from other fields. \nThere are, of course, impressive female politicians who have spent years rising up the political ranks. However, the simple fact is that there aren't enough of them. Both in the United States and worldwide, we still have a limited pipeline of potential senior-level female politicians. \nGlobally, less than one in four members of parliament are women . The United States has the ignominious distinction of ranking 99th in the world on this measure, with just 19 percent female representation in Congress . \nThere are a range of factors that contribute to this shortage, notably lack of access to finance, exclusion from male-dominated networks, and entrenched cultural norms about gender and leadership. \"It's time for parties to stop waiting for droves of qualified women to come to them and to start going out and recruiting.\" \nWhen women do enter politics, they generally do so later in life . Men typically get elected to their first political position around age 40, whereas women come into politics 5-10 years later on average. Perhaps unsurprisingly, this often coincides with the point at which the average woman's youngest child is of schooling age. \nWomen also tend to come into politics through different channels than men. A 2010 study on women's paths to power found that only 15 percent of senior female politicians came to power as \"outsiders\" entering politics from other fields. When you combine these two factors, it makes sense that so few women are reaching the highest ranks. \nSo, what is being done to address the issue? \nIn the U.S., Democratic groups like Emily's List are leading the charge: recruiting, training, and fundraising for female candidates. The Democratic Congressional Campaign Committee is also working to recruit a specific group of women outside the political sphere to run for office: female veterans. In contrast, Republicans have often struggled in their efforts to recruit more women, though the party and outside groups like Maggie's List are trying to close the gap. \nThe wave of women running for office in the U.S. in 2018 is a heartening sign that the trend may be changing . According to the Center for American Women and Politics at Rutgers University, which tracks the number of female candidates, there are 374 women running for House seats this cycle, crushing the previous record of 298 in 2012. Another 42 female candidates are running for Senate seats. \nWhile many of those candidates come from political and public service backgrounds, there are some notable examples of women from the private sector running in 2018 on both sides of the aisle. \nOn the Democratic side: Annie Craig is running for Congress in Minnesota, following a career as an executive at a Fortune 500 company; and Marie Newman is running for Congress in Illinois, after setting up a successful consulting firm working for Fortune 1000 companies. \nOn the Republican side: Lena Epstein, who has a bachelor's degree from Harvard, an MBA from the University of Michigan, and is a co-owner of her family's large automotive and industrial lubricant distribution business, is running for Congress in Michigan; and businesswoman and political novice Pamela Evette is running as Lieutenant Governor alongside South Carolina Governor Henry McMaster. \nHowever, these candidates are largely the exception rather than the rule. And the unsuccessful candidacies of previous high-profile businesswomen such as Meg Whitman and Carly Fiorina illustrate the up-hill battle involved with entering politics from the outside. \nThe United States isn't alone in facing a challenge recruiting women into politics from other fields. \nEven in countries where there are quotas requiring a minimum percentage of female candidates, I've come across a familiar refrain from political parties: \"there just aren't enough qualified women.\" \nIn a way, I can't really blame them for thinking this. Given the male-dominated networks that candidates are normally pulled from and the narrow definition of what \"qualified\" means (i.e. working your way up the party for decades) they really might not know where to find female candidates. \nBut not knowing isn't an excuse for not trying. It's time for parties to stop waiting for droves of qualified women to come to them and to start going out and recruiting. \nIn many cases, this means rethinking party infrastructure to ensure that gender equality is a priority that is reflected in both staffing and budgeting decisions. It also means putting in place well-resourced efforts to recruit and train female candidates. \nThese recruitment programs can't take a one-size-fits-all approach. After all, candidates who have come up through traditional channels and have cut their teeth in state legislatures have a very different skillset to those who have succeeded in other fields and are entering politics for the first time. \nBoth types of experience can be incredibly valuable, but skills gaps need to be addressed through tailored training. Mentorship can also play an important role, by pairing newcomers with successful female political leaders who can show them the ropes. \nWhile an increasing amount of energy and attention is being devoted to discussing gender inequality and there are promising signs that more women are seeking public office, it is still unclear whether there will be lasting reforms that will make it easier for women to enter and succeed in politics. \nMeanwhile, for the first time in a decade, the global gender gap has actually widened . Taking into account slowing progress on political equality, closing the political gender gap will take another 99 years. \nGiven that stark reality, it's time for political parties around the world to get serious about this issue and start devoting resources to get more women elected. Otherwise, almost none of us alive today will see a world where men and women can enter and succeed in politics on an equal footing. \nCommentary by Eva Barboni, founder and CEO of Atalanta, a social enterprise dedicated to increasing the number of women holding senior government positions worldwide and accelerating programs that tackle the root causes of gender inequality. \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-18T20:53:00.000+02:00", "crawled": "2018-01-18T21:14:22.000+02:00", "highlightTitle": ""}