{"organizations": [], "uuid": "69c4a540cfef28041aa1002bfd419690f1ed0c20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/02/23/102446720-463871936.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/walmarts-bonuses-heres-what-workers-will-receive.html", "country": "US", "domain_rank": 767, "title": "Walmart's bonuses: Here's what workers will receive", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T22:57:00.000+02:00", "replies_count": 0, "uuid": "69c4a540cfef28041aa1002bfd419690f1ed0c20"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/walmarts-bonuses-heres-what-workers-will-receive.html", "ord_in_thread": 0, "title": "Walmart's bonuses: Here's what workers will receive", "locations": [], "entities": {"persons": [], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "neutral"}, {"name": "wal-mart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart's bonuses: Here's what workers will receive In total, Walmart will spend $400 million in fiscal 2018 to fund one-time bonuses. Some workers will receive $1,000, but only if they've served at the company for at least 20 years. The announcement came on the heels of new tax legislation. Walmart also revealed it would be shuttering dozens of its warehouse club stores across the country. Getty Images A Wal-Mart employee pushes grocery carts at a store in Miami. \nWalmart announced on Thursday its plans to give out bonuses of up to $1,000 to some of its employees, following the passage of new tax legislation that slashes corporate tax rates. \nHowever, the amount each hourly worker receives will depend on his or her time with the company. (See a chart below for details.) \nIn total, the big-box retailer and world's largest private employer will spend $400 million in fiscal 2018 to fund the one-time pay outs. Walmart said an employee's qualification for a bonus will be determined before the end of the month, \"and payments will be paid as quickly as practical thereafter.\" \nHere's a breakdown of what employees should expect to receive: \nMore than 20 years of service: $1,000 \n15 to 19 years of service: $750 \n10 to 14 years of service: $400 \n5 to 9 years of service: $300 \n2 to 4 years of service: $250 \nLess than 2 years of service: $200 \nAlso on Thursday, Walmart revealed it would be shuttering 63 of its Sam's Club wholesale stores across the country. Some of the stores would close immediately. \nThe company said those workers impacted by the closures would still be eligible for bonuses. \nWhile many employees, customers and analysts alike were startled by the abrupt store closure news , Walmart has largely been applauded for opting to give back a portion of its tax savings to workers. \n\"Providing employees with a bonus and better wages should also help drive additional sales, and also allow the company to remain competitive in a 17-year-low unemployment rate labor market,\" Susquehana analyst Bill Dreher wrote in a note to clients. \n\"This represents less than 20% of Walmart's tax savings which we expect will be invested in merchandise price reductions , employee training, omnichannel and other technology investments as well as share repurchases,\" Dreher said. Lauren Thomas News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-12T22:57:00.000+02:00", "crawled": "2018-01-12T23:23:19.002+02:00", "highlightTitle": ""}