{"organizations": [], "uuid": "2d40af0b1773d2395a191fe9f2158e35c3a3bfa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "South Korea Is Cracking Down on Cryptocurrency Exchanges for Alleged Tax Evasion – Fortune", "url": "http://fortune.com/2018/01/10/south-korea-cryptocurrency-exchanges-raided/", "country": "US", "domain_rank": 1196, "title": "South Korea Is Cracking Down on Cryptocurrency Exchanges for Alleged Tax Evasion", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T05:57:00.000+02:00", "replies_count": 0, "uuid": "2d40af0b1773d2395a191fe9f2158e35c3a3bfa3"}, "author": "Reuters", "url": "http://fortune.com/2018/01/10/south-korea-cryptocurrency-exchanges-raided/", "ord_in_thread": 0, "title": "South Korea Is Cracking Down on Cryptocurrency Exchanges for Alleged Tax Evasion", "locations": [], "entities": {"persons": [{"name": "coinone", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "coinone", "sentiment": "none"}, {"name": "bithumb", "sentiment": "none"}], "organizations": [{"name": "national tax service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Korea South Korea Is Cracking Down on Cryptocurrency Exchanges for Alleged Tax Evasion A woman walks past a screen showing exchange rates of cryptocurrencies at Bithumb, one of the major cryptocurrency exchanges in Seoul, South Korea on Dec. 20, 2017. Jung Yeon-Je—AFP/Getty Images By Reuters 10:57 PM EST \nSouth Korea‘s largest cryptocurrency exchanges were raided by police and tax agencies this week for alleged tax evasion, people familiar with the investigation said on Thursday. \n“A few officials from the National Tax Service raided our office this week,” an official at Coinone, a major cryptocurrency exchange in South Korea, told Reuters. \n“Local police also have been investigating our company since last year, they think what we do is gambling,” said the official, who spoke on condition of anonymity. He said Coinone was cooperating with the investigation. \nBithumb, the second largest virtual currency operator in South Korea, was also raided by the tax authorities on Wednesday. \n“We were asked by the tax officials to disclose paperwork and things yesterday,” an official at Bithumb said, requesting anonymity due to the sensitivity of the issue. \nSouth Korean financial authorities had previously said they are inspecting six local banks that offer virtual currency accounts to institutions, amid concerns the increasing use of such assets could lead to a surge in crime. \nThe crackdown on Seoul-based operators of some of the world’s busiest virtual currency exchanges comes as the government attempts to calm frenzied demand for cryptocurrency trading in Asia’s fourth largest economy. \nBitcoin’s 1,500 percent surge last year has stoked huge demand for cryptocurrency in South Korea, drawing college students to housewives and sparking concerns about a gambling addiction. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T05:57:00.000+02:00", "crawled": "2018-01-11T05:57:24.037+02:00", "highlightTitle": ""}