{"organizations": [], "uuid": "b9c93ee0aae886fb68d94e32a570324607718421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000513/device/rss", "section_title": "Brazil", "url": "https://www.cnbc.com/2018/01/24/reuters-america-monsanto-to-defend-brazil-patent-on-gm-soybeans-lawyers.html", "country": "US", "domain_rank": 767, "title": "Monsanto to defend Brazil patent on GM soybeans -lawyers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T19:49:00.000+02:00", "replies_count": 0, "uuid": "b9c93ee0aae886fb68d94e32a570324607718421"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/reuters-america-monsanto-to-defend-brazil-patent-on-gm-soybeans-lawyers.html", "ord_in_thread": 0, "title": "Monsanto to defend Brazil patent on GM soybeans -lawyers", "locations": [], "entities": {"persons": [{"name": "sao paulo", "sentiment": "negative"}, {"name": "amaral", "sentiment": "none"}, {"name": "luiz henrique", "sentiment": "none"}, {"name": "sidney pereira de souza junior", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "mato grosso", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "gm", "sentiment": "negative"}, {"name": "ana mano reuters", "sentiment": "negative"}, {"name": "monsanto co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "inpi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Monsanto to defend Brazil patent on GM soybeans -lawyers Ana Mano Reuters SHARES \nSAO PAULO, Jan 24 (Reuters) - Monsanto Co has two months to present a defense of its patent on genetically modified soybeans in Brazil, a lawyer for the company told Reuters after authorities suggested the U.S. seed company's intellectual property rights should be revoked. \nLuiz Henrique do Amaral, an attorney representing Monsanto, said the company would present arguments ahead of a March 22 deadline to push back against patent officials calling for annulment of the patent on Intacta seeds. \nBrazil's solicitor general cited that re-evaluation by patent authority INPI in a case brought in November by soy producers in the state of Mato Grosso. The revised opinion could spark years of litigation in the world's biggest soy exporter. \n\"Any court ruling suspending royalty payments can be appealed by Monsanto,\" Amaral said. He declined to estimate how long it would take for a final lower court ruling on the patent. \nSidney Pereira de Souza Junior, the lawyer representing the Mato Grosso soy growers association Aprosoja, said the case \"is moving fast,\" and a decision could come in two years. He said that after Monsanto presents its defense, the court could issue an injunction ordering it to suspend collection of Intacta royalties while the case is being deliberated. \nAmaral said that after a 10-year patent approval process it seemed \"surprising\" INPI would reverse its finding in a few weeks, based on the opinions of officials who did not participate in the original review. \nINPI said in a statement it had given its technical opinion in the case on the basis of Aprosoja's arguments, and that Monsanto had not presented counter-arguments before the court. \nIntellectual property rights are crucial to Monsanto, which also faces regulatory hurdles to gain approval for its takeover by Bayer AG, a $63.5 billion deal that would create the world's largest pesticides and seeds company. \nMonsanto's shares have been trading at a big discount to Bayer's offer price of $128 as investors worry about antitrust reviews around the world, including in Brazil, Monsanto's second-biggest market. \nAbout 96.5 percent of planted soy area in Brazil is occupied by genetically engineered beans. \nGlobal demand for transgenic seeds including soybean and corn is expected to rise to $36.5 billion in 2021 from $21.5 billion in 2015, according Zion Research. \nIntacta is genetically engineered to tolerate the herbicide glyphosate and to resist caterpillars. Monsanto has been collecting royalties on the seed since 2012, and its patent protection extends through 2022. (Reporting by Ana Mano; Editing by David Gregorio)", "external_links": [], "published": "2018-01-24T19:49:00.000+02:00", "crawled": "2018-01-25T03:19:35.008+02:00", "highlightTitle": ""}