{"organizations": [], "uuid": "ec14792b4f33338c7e252965fd248c9c1e4e2fab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891350-RTR3KH14.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/31/4-ted-talks-you-should-watch-if-you-want-to-understand-bitcoin.html", "country": "US", "domain_rank": 767, "title": "4 TED Talks you should watch immediately if you want to understand bitcoin", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T17:34:00.000+02:00", "replies_count": 0, "uuid": "ec14792b4f33338c7e252965fd248c9c1e4e2fab"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/4-ted-talks-you-should-watch-if-you-want-to-understand-bitcoin.html", "ord_in_thread": 0, "title": "4 TED Talks you should watch immediately if you want to understand bitcoin", "locations": [], "entities": {"persons": [{"name": "narula", "sentiment": "none"}, {"name": "neha narula", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "9:38 AM ET Tue, 23 Jan 2018 | 01:36 SHARES \nWith the price of bitcoin climbing above $10,000 in recent weeks, now is as good a time as any to educate yourself on the volatile cryptocurrency. \nIf you're still not too sure how cryptocurrencies and the blockchain work, here are four TED Talks you can watch that help explain it: 'The future of money' \nIn her 2016 TED Talk \"The future of money,\" digital currency researcher Neha Narula argues that \"there's nothing inherently invaluable about a dollar or a stone or a coin.\" \n\"The only reason these things have any value is because we've all decided they should. And because we've decided that, they do,\" she said. \nNarula pointed out how we already use digital money through tasks like direct deposit, online bill payments and online savings accounts. However, there's a catch to all of those transfers: The money stays in the possession of gatekeeper institutions such as banks, credit cards or investment firms. \n\"The future of money is programmable. When we combine software and currency, money becomes more than just a static unit of value, and we don't have to rely on institutions for security,\" Narula said, referring to cryptocurrencies. \n\"Programmable money democratizes money,\" she said. \"And because of this, things are going to change and unfold in ways that we can't even predict.\" 'How the blockchain is changing money and business' \nIn his 2016 TED Talk \"How the blockchain is changing money and business,\" digital strategist Don Tapscott discusses the impact new technology will have on money, business, government and society. \nTapscott explained that while middlemen like banks, government, social media companies and credit card companies may serve us in many positive ways, they are also vulnerable to being hacked and putting our data, privacy and resources (in this case, our money) at risk. With currency built using blockchain technology, people are able to make peer-to-peer transactions based on an asset they equally trust in. \nA blockchain financial industry, Tapscott argued, would bring people prosperity by securing economic mobility, distributing wealth and protecting our data, among other benefits. \n\"Technology doesn't create prosperity, of course, people do,\" Tapscott said. \nUltimately, people now have a chance to \"rewrite the economic power grid and the old order of things\" to \"solve some of the world's most difficult problems,\" he added. 'We've stopped trusting institutions and started trusting strangers' \nTrust researcher Rachel Botsman argues in her 2016 TED Talk that technology alone has not disrupted society in recent decades, but rather people's perception of trust has changed because of new technologies. \nPeople today take leaps of trust in services used in their daily lives all the time, she says, including with Uber, Airbnb, Tinder and now cryptocurrencies. \n\"These are all examples of how technology is creating new mechanisms that are enabling us to trust unknown people, companies and ideas,\" she said. \"And yet at the same time, trust in institutions — banks, governments and even churches — is collapsing.\" \n\"The implications are huge,\" she added. \"In the same way the internet blew open the doors to an age of information available to everyone, the blockchain will revolutionize trust on a global scale.\" 'How the blockchain will radically transform the economy' \nIn blockchain entrepreneur and researcher Bettina Warburg's 2016 TED Talk, \"How the blockchain will radically transform the economy,\" she discusses how the blockchain could one day make institutions like banks and governments less of a necessity. \nToday, platform marketplaces like Amazon, eBay, Alibaba now act as \"middlemen to facilitate human economic activity,\" but blockchain technology has the ability to \"collapse institutions and enforcement\" to return the economic power to people. \n\"While blockchain technology is relatively new, it's also a continuation of a very human story, and the story is this: As humans, we find ways to lower uncertainty about one another so that we can exchange value,\" she said. \nWarburg clarified that although blockchain isn't the solution to everything, it gives \"us the technological capability of creating a record of human exchange, of exchange of currency, of all kinds of digital and physical assets, even of our own personal attributes, in a totally new way.\"", "external_links": [], "published": "2018-01-31T17:34:00.000+02:00", "crawled": "2018-01-31T17:57:45.006+02:00", "highlightTitle": ""}