{"organizations": [], "uuid": "b752e1d1ebb48323489978610788308dce9affa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "#TrumpShutdown Dominates Twitter Reaction to Government Funding Failure – Fortune", "url": "http://fortune.com/2018/01/20/trump-shutdown-twitter-reaction/", "country": "US", "domain_rank": 1196, "title": "#TrumpShutdown Dominates Twitter Reaction to Government Funding Failure", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T17:49:00.000+02:00", "replies_count": 0, "uuid": "b752e1d1ebb48323489978610788308dce9affa5"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/20/trump-shutdown-twitter-reaction/", "ord_in_thread": 0, "title": "#TrumpShutdown Dominates Twitter Reaction to Government Funding Failure", "locations": [], "entities": {"persons": [{"name": "carter", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats and Republicans are publicly sparring over which party is responsible for the government shutdown that began at midnight on Friday, after Congress failed to pass a short-term funding bill.\nIn the hours just before the deadline, though, prevailing sentiment on Twitter was crystal clear. #TrumpShutdown, a hashtag laying blame squarely on the White House and Republicans, topped global trends .\nWhile not a precise gauge of American voter sentiment, the early Twitter momentum reflects a stark reality: the 2018 government shutdown is the first since the (infamously ineffectual) Carter administration in the late 1970s to take place with one party in full control of the House, Senate, and White House.\nGet Data Sheet , Fortune's technology newsletter. \nThe current Congress has funded the government through short-term continuing resolutions for the majority of its tenure, rather than passing a full-year budget. A more immediate cause of the shutdown appears to have been President Trump's now-infamous \"shithole\" comment , which came during a meeting aimed at resolving a dispute over DACA, also known as the Dream Act for undocumented U.S. residents brought to the country as children. Trump's comment helped torpedo a deal that might have kept the government open.\nPresident Trump and other Republicans have tried to push back with the hashtag #DemocratShutdown, after Democrats objected to Republicans’ treatment of both a DACA extension and funding for CHIP, the children's health insurance program.\nSome polls show that shouldering the blame for a government shutdown wasn't harmful to Republicans’ electoral fates in 2013 or during the Clinton administration. President Trump this morning called the shutdown a 'present' from Democrats , and suggested the solution to Congressional gridlock was to elect even more Republicans in 2018.\nBut that mindset is a holdover from Republicans' longtime stance as an opposition party, at least at the federal level. It remains to be seen if voters have different expectations for a party that's actually responsible for running the government.", "external_links": [], "published": "2018-01-20T17:49:00.000+02:00", "crawled": "2018-01-20T17:49:57.009+02:00", "highlightTitle": ""}