{"organizations": [], "uuid": "571265cb52710b8a4b3d166b35cb790990ac8446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104865202-RTX3K333.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/white-houses-mulvaney-chances-of-government-shutdown-are-currently-50-50.html", "country": "US", "domain_rank": 767, "title": "White House's Mulvaney: Chances of government shutdown are currently 50-50", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T17:04:00.000+02:00", "replies_count": 0, "uuid": "571265cb52710b8a4b3d166b35cb790990ac8446"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/white-houses-mulvaney-chances-of-government-shutdown-are-currently-50-50.html", "ord_in_thread": 0, "title": "White House's Mulvaney: Chances of government shutdown are currently 50-50", "locations": [], "entities": {"persons": [{"name": "mulvaney", "sentiment": "negative"}, {"name": "mick mulvaney", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "other white house", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "office of management and budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chances of a government shutdown are rising, a top White House official told CNBC on Friday.\nMick Mulvaney, chief of the Office of Management and Budget, said that odds of a shutdown occurring are 50-50.\n\"We were operating under sort of a 30 percent shutdown up until yesterday,\" he told CNBC. \"I think we're ratcheting it up now.\"\nOther White House aides told CNBC that \"it doesn't look good.\"\nCongress has until the end of Friday to approve a spending measure to keep the government open. The House on Thursday passed a measure that would continue funding the government for another month, but opposition from Senate Democrats and some Republicans make it unlikely that such a measure can pass.\nMarc Short, the White House director of legislative affairs, said that President Donald Trump has been making phone calls in a bid to avert a shutdown, and that he hopes the government doesn't close.\n\"The president stands ready to sign a bill\" that will fund the government, Short told reporters during a briefing Friday.\nIf a shutdown happens, it will come just as Trump is marking his first full year in office. The president is planning to stick around Washington until the Senate passes a stopgap spending measure. Trump was slated to travel to his private Mar-a-Lago club in Florida, where he plans to attend a big-money fundraiser celebrating the first anniversary of his inauguration . The White House later said he would not go to Florida on Friday as originally planned.\nIn the breifing, both Mulvaney and Short tried to preemptively put the blame for a possible shutdown on Democrats. Asked about whether Trump rejecting a bipartisan immigration deal and reportedly calling certain nations \"s---hole\" countries set back funding talks, Mulvaney argued that \"there's no way\" Trump should take the blame for a shutdown.\nHe said Trump is \"actively working\" to strike a funding deal and contended that President Barack Obama did not do the same before a 2013 shutdown.\nNearly all Democrats have held out from supporting the GOP plan because they also want to pass a bill that would protect hundreds of thousands of young undocumented immigrants from deportation. Senate Minority Leader Chuck Schumer has sought to extend government funding for a few days in hopes of reaching an immigration agreement and longer-term spending deal.\nTrump and McConnell face some resistance within their own party in the Senate. Sen. Lindsey Graham, R-S.C., said in an interview with MSNBC that he would not vote for a 30-day continuing resolution. He also said he was against a four-day deal.\nMulvaney cast doubts on lawmakers finding an immigration solution soon, saying the bipartisan lawmakers who presented a deal to Trump did not have legislative text for it.\nThe proposal also sought to meet Republican demands for increased border security funding and changes to extended family migration and the visa \"lottery\" system.", "external_links": [], "published": "2018-01-19T17:04:00.000+02:00", "crawled": "2018-01-19T17:13:10.001+02:00", "highlightTitle": ""}