{"organizations": [], "uuid": "e970ecc8e28c4be9641c592170c5d2669a44339a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/05/104880564-GettyImages-886375734.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/after-wildfires-it-gets-tougher-to-insure-a-home-in-california.html", "country": "US", "domain_rank": 767, "title": "Insurers take a hard look at California and see growing wildfire risk", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:26:00.000+02:00", "replies_count": 0, "uuid": "e970ecc8e28c4be9641c592170c5d2669a44339a"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/after-wildfires-it-gets-tougher-to-insure-a-home-in-california.html", "ord_in_thread": 0, "title": "Insurers take a hard look at California and see growing wildfire risk", "locations": [], "entities": {"persons": [{"name": "marcus yam", "sentiment": "negative"}, {"name": "thomas", "sentiment": "none"}, {"name": "dave jones", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "ventura", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}], "organizations": [{"name": "california insurance", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Marcus Yam | Los Angeles Times | Getty Images Firefighters work to put out flames after it has engulfed a home on December 5, 2017 in Ventura, California. \nAfter the wildfire disasters in California, it may be tougher for some homeowners in canyon and hillside areas of the state to keep their current insurance. \nIt also could force some homeowners in areas deemed a high risk to go to a fall-back insurance plan created by the state decades ago, California Insurance Commissioner Dave Jones told CNBC in an interview. He also said it's not only rural areas but now some urban-type areas of the state that are increasingly getting viewed by insurers as an elevated fire risk. \nInsurers refused to renew more than 10,000 policies in fire-hazard areas in 2016 after previous fire disasters. And, following last year's devastating wildfire season that trend could repeat itself. \nAlso, the Southern California community of Montecito had deadly mudslides on Jan. 9 in areas burned by the record-breaking Thomas wildfire . The seaside town was not in a recognized flood zone so many homeowners reportedly didn't have flood insurance. \n\"There are some number of communities that have already been experiencing challenges in some cases with obtaining private residential homeowners insurance,\" said Jones. \nAccording to Jones, the problem of obtaining private homeowners insurance has shown up in foothill communities and so-called wildland-urban interface areas of the state. Mark Neuling | CNBC A resident searches through the debris after wildfires destroyed his home in Santa Rosa, Calif. \nFor example, Santa Rosa — the largest city in Sonoma County — had about 3,000 homes, or 5 percent of its housing stock, go up in flames from last October's wildfires. It also is the deadliest wildfire in state history with 44 victims. \nThe insurance losses from October's wildfires in California topped $9.4 billion in residential and commercial claims, according to the state's Department of Insurance. \nIn Southern California, more than 13,500 homes in Los Angeles and Ventura counties are considered at high or extremely high wildfire risk, according to CoreLogic, a real estate information firm. Last month, Corelogic also indicated that nearly 73,000 other homes in the region were at low or moderate risk of wildfire hazards. \nJones said the private insurers today use computer models to assign fire risk scores to homes, and they are using that data sometimes when deciding to decline renewal on certain insurance policies or to stop writing policies in wildfire-prone areas. \nMore than 2 million homes in California are considered at high or extreme risk from wildfires , making the Golden State the most wildfire-prone state in sheer numbers, according to Verisk, a data analytics supplier to the insurance industry. It also estimates that 15 percent of the state's housing stock is exposed to elevated wildfire hazards. \n\"The fires that occurred at the end of 2017 burned areas, including significantly urbanized areas like parts of Santa Rosa where whole subdivisions burned to the ground,\" Jones said. Previously, he said that area was considered at a low risk under the insurance industry models. \nJones said he anticipates that the insurance industry will update its models based on the recent disasters. \n\"Some areas of the state that have been historically modeled at lower risk will have homes modeled at higher risk, and there may be additional challenges in those areas in finding private residential homeowners insurance,\" he said. \nStill, the big fire losses last year don't mean California homeowners can expect a massive rate hike right away . \nA state ballot measure passed in 1988 by California voters means insurers cannot take all the losses associated with one event, such as the 2017 wildfires, and then simply put them into the next year's property and casualty insurance rates. \n\"At least 20 years of catastrophes are essentially averaged out,\" said Jones. \"It has the effect of preventing cramming all of the $9.4 billion and counting into next year's rates. There will be some impact, but it's not going to be that they can put the entirety of losses into next year's rates.\" \nAfter the huge losses from the 6.7 magnitude earthquake of 1994 in LA, some insurers such as Allstate Insurance stopped writing new homeowner policies in the state. Allstate returned nine years later, though, and that was after the state established the California Earthquake Authority (CEA), a publicly managed organization to sell earthquake insurance policies. \nJones, a Democrat who is running for California attorney general, doesn't expect to see insurers leave California due to the string of natural disasters. \nThe state official said the reason why some insurers left after the 1994 earthquake was due largely to a California requirement at the time that they offer insurance earthquake policies for homeowners. Today, the CEA is the largest provider of residential earthquake insurance in the state and has dozens of participating insurance companies offering its policies, including Allstate. \n\"Homeowner insurers still have the ability to decide where the risk is too high in parts of California, and decline to renew or write [policies]\" he said. \"And that's what we're beginning to see.\" \nMeantime, there are at least eight insurance-related bills being proposed by state lawmakers in the aftermath of the disasters, including a measure that would limit insurers' ability to cut coverage in areas after a wildfire disaster. At least five other states already curb insurance companies from canceling or non-renewing policies after a natural disaster.", "external_links": [], "published": "2018-01-18T20:26:00.000+02:00", "crawled": "2018-01-18T20:47:15.010+02:00", "highlightTitle": ""}