{"organizations": [], "uuid": "6e044d937fa6aac044baffe94834f79188ef8e52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 152, "shares": 152, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "The World’s Richest 1% Took Home 82% of Wealth Last Year, Oxfam Says – Fortune", "url": "http://fortune.com/2018/01/21/oxfam-report-global-inequality-billionaires/", "country": "US", "domain_rank": 1196, "title": "The World’s Richest 1% Took Home 82% of Wealth Last Year, Oxfam Says", "performance_score": 1, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-22T04:35:00.000+02:00", "replies_count": 0, "uuid": "6e044d937fa6aac044baffe94834f79188ef8e52"}, "author": "Reuters", "url": "http://fortune.com/2018/01/21/oxfam-report-global-inequality-billionaires/", "ord_in_thread": 0, "title": "The World’s Richest 1% Took Home 82% of Wealth Last Year, Oxfam Says", "locations": [], "entities": {"persons": [{"name": "winnie byanyima", "sentiment": "none"}, {"name": "byanyima", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world", "sentiment": "negative"}, {"name": "oxfam", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters television", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 9:35 PM EST \nFour out of every five dollars of wealth generated in 2017 ended up in the pockets of the richest 1%, while the poorest half of humanity got nothing, a report published by Oxfam found on Monday. \nAs global political and business leaders gather for this week’s World Economic Forum annual meeting in Davos, Switzerland, the charity’s report highlights a global system that rewards the super-rich and neglects the poor. \nIt found that 3.7 billion people who make up the poorest half of the world saw no increase in their wealth in 2017, while 82% of the wealth generated last year went to the richest 1% of the global population. \n“(It) reveals how our economies are rewarding wealth rather than the hard work of millions of people,” Winnie Byanyima, Oxfam‘s executive director, told Reuters Television. \n“The few at the top get richer and richer and the millions at the bottom are trapped in poverty wages.” \nByanyima blamed “tax dodging” as a major cause of global inequality and urged leaders to clamp down on tax havens and plough money into education, healthcare and jobs for young people. \nIn particular, Byanyima criticised U.S. President Donald Trump, who is attending the World Economic Forum, for creating “a cabinet of billionaires” and implementing tax legislation that she said rewarded the super-rich, not ordinary Americans. \nThe annual report by Oxfam found that the number of billionaires rose at a rate of one every two days between March 2016 and March 2017, while in the United States the three richest people own the same wealth as the poorest half of the population. \nOxfam said that women workers were worst hit by global inequality as they consistently earn less than men and usually have lower paid and more insecure forms of work. \nThe World Economic Forum has previously estimated that it would take 217 years before women earn as much as men and have equal representation in the workplace. \nAccording to the 2017 Forbes rich list, the five richest people on the planet are all men – from Microsoft’s Bill Gates, to veteran investor Warren Buffett, Amazon boss Jeff Bezos, Inditex founder Amancio Ortega and Facebook’s Mark Zuckerberg. \n“The economic model is not working at all,” Oxfam report co-author, Iñigo Macías Aymar, told the Thomson Reuters Foundation. “The way this wealth is being distributed we are really worried, it’s being concentrated in fewer hands.” \nOxfam called for all workers to receive a minimum living wage, the elimination of the gender pay gap and tougher rules to crackdown on tax avoidance. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T04:35:00.000+02:00", "crawled": "2018-01-22T04:35:52.011+02:00", "highlightTitle": ""}