{"organizations": [], "uuid": "01e135bc24c6c05371835cc26c769f4cbc89831d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955273-GettyImages-137446250.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/trumps-lawyer-created-llc-to-pay-porn-star-for-silence-on-affair-wsj.html", "country": "US", "domain_rank": 767, "title": "Trump lawyer reportedly created an LLC to pay porn star $130,000 for silence on alleged affair", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T18:50:00.000+02:00", "replies_count": 0, "uuid": "01e135bc24c6c05371835cc26c769f4cbc89831d"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/trumps-lawyer-created-llc-to-pay-porn-star-for-silence-on-affair-wsj.html", "ord_in_thread": 0, "title": "Trump lawyer reportedly created an LLC to pay porn star $130,000 for silence on alleged affair", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "clifford", "sentiment": "none"}, {"name": "michael cohen", "sentiment": "none"}, {"name": "peggy peterson", "sentiment": "none"}, {"name": "stephanie clifford", "sentiment": "none"}], "locations": [{"name": "delaware", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "essential consultants llc", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A lawyer for then-candidate Donald Trump established a private limited liability company in October 2016 to pay off an adult film star to keep her silent about an alleged extramarital affair with Trump, The Wall Street Journal reported .\nThe newspaper cited corporate records and sources familiar with the matter.\nStephanie Clifford, who uses the stage name Stormy Daniels, was reportedly paid $130,000 by Essential Consultants LLC, a Delaware business created by attorney Michael Cohen less than a month before the 2016 presidential election, the Journal said. The company issued a draft settlement pact to Clifford, referring to her by the pseudonym \"Peggy Peterson,\" according to Slate, which published photos of the document.\nThe new report was published just before a new poll from NBC and The Wall Street Journal found that Trump's approval rating stands at only 39 percent — the lowest number in the survey's history for any modern president after one year in office.\nIn addition, Trump and Congress are mired in a fight over government spending, immigration and children's health insurance as the threat of a government shutdown loomed Friday — the eve of the first anniversary of Trump's inauguration .\nAs part of the settlement, Clifford signed a nondisclosure agreement with Cohen, precluding her from discussing the affair publicly, the Journal reported.\nIn 2011, Clifford detailed her alleged 2006 dalliance with Trump, in a lengthy interview with gossip magazine In Touch Weekly. In Touch published the interview Friday.\nTrump married his current wife, Melania , in 2005. Their son, Barron, was born in March 2006.\nCohen has aggressively disputed the Journal's reports. He also sent the newspaper a statement signed by Daniels that denied she had a \"sexual and/or romantic\" relationship with Trump or that she received \"hush money from Donald Trump.\"\nThe intrigue surrounding an alleged affair between Trump and Clifford is not the first time reports emerged about his relationships. In November 2016, the Journal reported that Trump backer American Media, owner of The National Enquirer supermarket tabloid, paid $150,000 to a former Playboy model for her story of an alleged relationship with Trump, which they then chose not to publish. American Media denies that the payment was hush money.\nCohen could not be reached for comment. CNBC left multiple messages for him at the Republican National Committee, where he is deputy chairman of the RNC's finance leadership team. The White House did not immediately respond to multiple requests for comment. Clifford's lawyer, Keith Davidson, did not immediately respond to a request for comment.\nRead the full Wall Street Journal report here.", "external_links": [], "published": "2018-01-19T18:50:00.000+02:00", "crawled": "2018-01-19T19:18:04.027+02:00", "highlightTitle": ""}