{"organizations": [], "uuid": "a68579fffb1d1aeeae1e77235210b15150947e38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/07/104391554-GettyImages-664562496.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/senate-will-take-up-immigration-daca-bill-that-trump-supports-mitch-mcconnell-says.html", "country": "US", "domain_rank": 767, "title": "Senate will take up an immigration bill when it figures out what Trump wants, Mitch McConnell says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T22:03:00.000+02:00", "replies_count": 0, "uuid": "a68579fffb1d1aeeae1e77235210b15150947e38"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/senate-will-take-up-immigration-daca-bill-that-trump-supports-mitch-mcconnell-says.html", "ord_in_thread": 0, "title": "Senate will take up an immigration bill when it figures out what Trump wants, Mitch McConnell says", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bill clark", "sentiment": "negative"}, {"name": "mitch mcconnell", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "r-ky", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "getty images senate", "sentiment": "negative"}, {"name": "senate repub", "sentiment": "neutral"}, {"name": "gop", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Republican leaders said Wednesday that they want to take up a bipartisan immigration bill. \nThey just need to figure what President Donald Trump would sign, first, according to Senate Majority Leader Mitch McConnell . \nTalks on crafting a bill that would protect hundreds of thousands of young undocumented immigrants while boosting border security measures and revising other immigration policy hit a snag in recent days, partly due to Trump's rejection of a bipartisan Senate deal presented to him Thursday. Only eight days ago, Trump told lawmakers that he would sign essentially whatever they put in front of him to resolve several immigration issues. \nAs negotiations continue, GOP senators say they need to see what Trump would sign before they can proceed. \n\"I'm looking for something that President Trump supports. And he's not yet indicated what measure he's willing to sign,\" McConnell told reporters Wednesday. \"As soon as we figure out what he is for, then I would be convinced that we were not just spinning our wheels going to this issue on the floor but actually dealing with a bill that has a chance to become law and therefore solve the problem.\" \nIn an interview with Reuters on Wednesday, Trump insisted that the plan presented by senators is \"the opposite of what I campaigned for.\" Trump, who promised to crack down on immigration, did not go into further detail about what changes he would want to see, during the portion of the interview published by Reuters .\nImmigration talks have complicated efforts to fund the government beyond Friday . Democrats have threatened not to support a must-pass spending bill unless lawmakers can also approve legislation shielding those young immigrants by Friday. \nSenate Majority Whip John Cornyn , R-Texas, said he met Wednesday with his No. 2-ranking counterparts from both sides of the aisle in the House and Senate on an immigration deal. The group — which is considered the deciding factor on a path forward — will meet again Thursday, he said. \n\"We all want to get to a solution here. But the president has made clear there are four components to that: there's a DACA solution, there's a border security solution, and then we need to deal with the diversity lottery visa and chain migration,\" Cornyn told reporters. \nHe said the lawmakers are \"all committed to getting to 'yes.'\" \nSome senators were confused by Trump's rejection of their previous deal. Sen. Dick Durbin, D-Ill., one of the senators at Thursday's White House meeting, has said the proposal presented to Trump included everything he sought. \nSen. Lindsey Graham , R-S.C., who also attended the meeting, expressed dismay at Trump's change in tone from eight days ago, when he encouraged bipartisan lawmakers to pass a bill and said he would sign it, to Thursday, when he shot down the senators' deal. \n\"Tuesday we had a president that I was proud to golf with, call my friend, who understood immigration had to be bipartisan,\" Graham said during a Senate Judiciary Committee hearing on Tuesday. \"I don't know where that guy went. I want him back.\"", "external_links": [], "published": "2018-01-17T22:03:00.000+02:00", "crawled": "2018-01-17T22:27:24.064+02:00", "highlightTitle": ""}