{"organizations": [], "uuid": "6fe804795eed9b65ab9c8c9ede2e70ad7a3db35f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/07/21/101853358-83632109r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/circuit-city-to-relaunch-online-next-month-with-stores-on-the-horizon.html", "country": "US", "domain_rank": 767, "title": "Circuit City to relaunch online next month, with stores on the horizon", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T19:01:00.000+02:00", "replies_count": 0, "uuid": "6fe804795eed9b65ab9c8c9ede2e70ad7a3db35f"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/circuit-city-to-relaunch-online-next-month-with-stores-on-the-horizon.html", "ord_in_thread": 0, "title": "Circuit City to relaunch online next month, with stores on the horizon", "locations": [], "entities": {"persons": [{"name": "shmoel", "sentiment": "none"}, {"name": "ronny shmoel", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "circuit city", "sentiment": "negative"}, {"name": "retail report circuit city", "sentiment": "negative"}, {"name": "getty images  circuit city", "sentiment": "none"}, {"name": "consumer electronics show", "sentiment": "none"}, {"name": "taylored group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Report Circuit City to relaunch online next month, with stores on the horizon Circuit City has picked Feb. 15 as the day its website will relaunch, CEO Ronny Shmoel said at CES. The once-bankrupt retailer also has plans to open kiosks, stores within other stores and eventually its own showrooms, consumer electronics website Twice reported. SHARES Getty Images \nCircuit City has picked Feb. 15 as the day its website will relaunch, CEO Ronny Shmoel said Monday at the Consumer Electronics Show in Las Vegas. \nThe once-bankrupt retailer also has plans to open kiosks, stores within other stores and eventually its own showrooms, consumer electronics website Twice reported . \nShmoel told his audience at CES that Circuit City's revamped website will include virtual vignettes, search by photo, augmented reality and real-time tech support via video chat, among other experiential features, Twice said. \nCircuit City also recently hired Skinny IT to provide home installations and is working with Taylored Group to design experiential showrooms that would mirror its new site, Twice added. \nUnder new ownership, Circuit City has been making plans to open smaller stores in the wake of filing for bankruptcy in 2008. The retailer attempted to operate strictly online after closing its last store in 2009, however those plans folded in 2012. \nShmoel acquired the brand, domain and associated trademarks for Circuit City in October 2015. \nRoughly one year later and under pressure for not reopening quickly enough, Shmoel told Twice in 2016: \"We could have easily leased a location, put some product in and opened the doors for business. Instead, we are taking our time to get this right.\" \nOn Monday, Shmoel told the publication that \"major retailers\" have expressed interest in working with Circuit City to open stores within their stores. \nTo be sure, as it re-emerges Circuit City will face heightened competition in the electronics category from the likes of Best Buy , Amazon , Target and Walmart . Lauren Thomas News Associate for CNBC Related Securities ", "external_links": [], "published": "2018-01-09T19:01:00.000+02:00", "crawled": "2018-01-09T19:08:58.049+02:00", "highlightTitle": ""}