{"organizations": [], "uuid": "65fe7bc3c34980f025fbb036a513cea7247184f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/19/103403364-RTX27PMI.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/cramer-use-the-earnings-damage-to-your-advantage-this-week.html", "country": "US", "domain_rank": 767, "title": "Cramer: Use the earnings 'damage' to your advantage this week", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-30T01:13:00.000+02:00", "replies_count": 0, "uuid": "65fe7bc3c34980f025fbb036a513cea7247184f8"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/cramer-use-the-earnings-damage-to-your-advantage-this-week.html", "ord_in_thread": 0, "title": "Cramer: Use the earnings 'damage' to your advantage this week", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On a down day for the major averages, CNBC's Jim Cramer said that investors should look at Monday's broad-based dip as an opportunity.\n\"If you've been waiting for a pullback to do some buying, this is your moment,\" \"This week we're going to run a gauntlet of important earnings reports, and while I think we can get through it OK, I bet there will be some damage. And you know what? That damage is [the] first chance for long-term investors to buy into weakness this year.\"\nCramer said investors should use the pullback to buy into an index fund, putting a small portion of their funds to work each day to hedge against uncertainty.\nWith a fifth of the S&P 500 reporting earnings this week, Cramer pointed out that the odds of the bull rally continuing are small. Each report is a chance for stocks to get hit, he said.\nFor example, if you have $2,000 ready for investment, Cramer suggested putting half of it to work this week and waiting to see what happens.\nRetirement-focused investors should look for high-quality stocks with healthy, growing dividends instead of bonds, Cramer advised, suggesting low-cost index funds as a good start.\n\"There will come a time when Treasurys make sense as an investment for people other than the very oldest viewers,\" he said. \"But at the moment, I still think a risk-free 2.7 percent return [from the 10-year Treasury ] is pretty crummy versus what you're likely to get from an index fund.\"\nAs for individual stocks, couldn't help but zoom in on the hustle and bustle around Apple ahead of its Thursday earnings report.\nBearish iPhone sales forecasts have plagued Apple's stock in the weeks leading up to the report, all but setting the stock up to \"fail\" on Thursday, Cramer said.\n\"I don't know what Apple will report. I don't know what it's going to say. I just don't want people to flee from this stock and then not be able to get back in when it turns out the new products have legs and the service revenue stream becomes huge,\" he said.\n\"When Apple goes down, it takes the stocks of all its suppliers with it,\" added. \"No need to buy those until you see the whites of Apple's eyes.\"\nCramer also rattled off how investors should interpret market sectors other than technology: wait for the oil stocks to decline; let the drug stocks shake out weaker hands; hope for weakness in the \"best-in-show\" bank stocks.\nIf shares of the banks, which benefit from rising interest rates, happen to decline by the end of the week, Cramer said they are the best buys by far thanks to their relative cheapness.\n\"The bottom line? I am urging you to be ready for more volatility. Understand that you can trade some of these big techs all you want,\" concluded. \"My take? You need to own stocks like Apple. Don't trade them, but keep in mind that you may need to take some short-term pain before you get some long-term gain.\"\nWATCH: Cramer's 'down day' strategy show chapters Cramer: Use the earnings 'damage' to your advantage this week 21 Hours Ago | 13:00 Disclosure: Cramer's charitable trust owns shares of Apple.\n ", "external_links": [], "published": "2018-01-30T01:13:00.000+02:00", "crawled": "2018-01-30T01:28:02.011+02:00", "highlightTitle": ""}