{"organizations": [], "uuid": "374a3a69e883d62e5f36e6d895e531108770371b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968351-Trump-Hands2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/president-trumps-full-remarks-on-nafta-tpp-in-cnbc-interview.html", "country": "US", "domain_rank": 767, "title": "Read President Trump's full remarks on trade deals to CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T13:31:00.000+02:00", "replies_count": 0, "uuid": "374a3a69e883d62e5f36e6d895e531108770371b"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/president-trumps-full-remarks-on-nafta-tpp-in-cnbc-interview.html", "ord_in_thread": 0, "title": "Read President Trump's full remarks on trade deals to CNBC", "locations": [], "entities": {"persons": [{"name": "joe kernen", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "cnbc cnbc.com", "sentiment": "negative"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump talked to CNBC's Joe Kernen from the World Economic Forum in Switzerland on Thursday.\nIn the interview, Trump said he could rethink the massive Trans-Pacific Partnership trade agreement , but only if the United States got a better deal. He also said the U.S. had a \"good chance\" to renegotiate the North American Free Trade Agreement, but said he could still terminate the deal.\nTrump's full remarks on trade:\nTrump: I like bilateral, because if you have a problem, you terminate. When you're in with many countries — like with TPP, so you have 12 if we were in — you don't have that same, you know you don't have that same option. But somebody asked me the other day, 'Would I do TPP?' Here's my answer — I will give you a big story. I would do TPP if we made a much better deal than we had. We had a horrible deal. The deal was a horrible deal. NAFTA's a horrible deal, we're renegotiating it. I may terminate NAFTA, I may not — we'll see what happens. But NAFTA was a — and I went around and I tell stadiums full of people, I'll terminate or renegotiate.\nKernen: So you might re-enter, or? Are you opening up the door to re-opening TPP, or?\nTrump: I'm only saying this. I would do TPP if we were able to make a substantially better deal. The deal was terrible, the way it was structured was terrible. If we did a substantially better deal, I would be open to TPP.\nKernen: That's interesting. Would you handicap ... ?\nTrump: Are you surprised to hear me say that?\nKernen: I am a little bit, yeah, I'm a little taken aback.\nTrump: Don't be surprised, no, but we have to make a better deal. The deal was a bad deal, like the Iran deal is a bad deal, these are bad deals.\nKernen: Maybe NAFTA, maybe not NAFTA, can you give me any indication of which way you're leaning because there's a lot of people, a lot of the CEOs that have been on here, they all seem to acknowledge that it's 30 years later and there's a lot of changes that make a lot of sense, but to not abandon the deal. Will you —\nTrump: Hey Joe, we have a trade deficit with Mexico. Mexico, $71 billion a year, right? We have a trade deficit with Canada of a substantial amount of money. I have a number, but they keep arguing it, they keep saying, so I won't say it, I won't tell you it's $17 million, OK? We have a trade deficit with Canada. We have a massive trade deficit with Mexico. We've got to do something. We can't continue to do this.\nKernen: Are you leaning towards staying in or would you really go out completely?\nTrump: I've always said ... during campaign and as you have noticed, and as you have actually said a couple of times which I have always appreciated, I have fulfilled a lot of what I've said and I'm only here a year, you know I think I have four years, and maybe another four years, OK? … Joe, we have a $71 billion a year deficit with Mexico. We've got to do something, we can't have that. So, will it be renegotiated? We're trying right now with [U.S. Trade Representative] Bob Lighthizer and the whole group. I think we have a good chance but we'll see what happens.\nLater in the interview, he returned to the topic of trade when discussing the strength of the dollar.\nTrump: But ultimately the dollar, because our country is going to get so much stronger economically, if you look at what's happened to our country over the — look, I've been talking about this with you for 25 years. Trade. It started with Japan, morphed into China, now it's China, Japan, it's everybody. And everybody has taken advantage of our country. They have ripped our country off. You look at what they do. I saw something on motorcycles today with a certain country. Why should I say? But they sell motorcycles into our country, no tax. We sell motorcycles into their country — Harley-Davidsons, the greatest, right? We sell them into their country, 100 percent tax. Not going to happen.\nThe word \"reciprocal\" is the most important word with Donald Trump when it comes to what the subject that we talk about and the subject that CNBC covers so well — especially you, by the way, because I don't agree with all of you people, but that's OK. But reciprocal. I want reciprocal. If they're going to charge us 100 percent for a motorcycle, it should be 100 percent the other way, too. And you know, when you mention a tax at the border, a 10 percent tax on the border for everything coming in, I'm a free trader. Totally. I'm a fair trader. I'm all kinds of trader, but I want reciprocal. Because when China's charging us a fortune to send products in and making it impossible for the product to get there — and many other countries, by the way, not just China. China's the biggest. And then we charge them nothing to sell their stuff here. It's not fair. When you use the word \"reciprocal\" everybody understands that. If they do it to you, you do it to them and everybody understands it, Joe. And you're going to see a lot of that in my administration. And you're already seeing it.\nWATCH: CNBC's full interview with President Trump from Davos show chapters Watch CNBC's full interview with President Trump from Davos 6 Hours Ago | 21:00", "external_links": [], "published": "2018-01-26T13:31:00.000+02:00", "crawled": "2018-01-26T13:40:46.029+02:00", "highlightTitle": ""}