{"organizations": [], "uuid": "15b63974a6ccda5e6fd60849bfd19504ea6f03a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926898-GettyImages-888023398.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/asia-markets-dollar-rise-oil-prices-and-china-data-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia looks set to open in positive territory after S&P 500 cracks 2,700", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-04T01:49:00.000+02:00", "replies_count": 0, "uuid": "15b63974a6ccda5e6fd60849bfd19504ea6f03a0"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/asia-markets-dollar-rise-oil-prices-and-china-data-in-focus.html", "ord_in_thread": 0, "title": "Asia looks set to open in positive territory after S&P 500 cracks 2,700", "locations": [], "entities": {"persons": [{"name": "caixin", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "caixin", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "amd", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major Asian markets closed mostly higher on Thursday, on the back of the stronger lead from Wall Street following positive economic data. Markets in Japan finished their first day of trade in the new year with strong gains while South Korean stocks were weaker than their regional peers.\nJapan's Nikkei 225 hit levels not seen in 26 years, jumping 3.26 percent, or 741.39 points, to close at 23,506.33 on its first day of trade after a long New Year weekend. Most sectors were in positive territory, with financials, technology and automakers higher across the board. Toyota rose 2.77 percent and Honda climbed 3.21 percent by the end of the day. Heavyweight SoftBank Group closed higher by 4.28 percent. \nSymbol Name Price   Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Meanwhile, the Kospi slid into negative territory, with the index sliding 0.8 percent to finish the session at 2,466.46 after trading higher at the open. Technology names closed mostly lower, with Samsung Electronics losing 1.05 percent and chipmaker SK Hynix giving up early gains to close down 0.77 percent. \nAutomakers saw declines, with Hyundai Motor falling 2.66 percent and affiliate Kia Motors losing 3.22 percent by the end of the session. \nShipbuilders, which had rallied in the new year due to optimism in the outlook for the sector, were mixed. Hyundai Heavy Industries closed 6.41 percent higher and Daewoo Shipbuilding was off by 4.07 percent. \nIn Sydney, the S&P/ASX 200 edged up by 0.11 percent to close at 6,077.1, with the energy sub-index the top-performer of the day as oil prices touched their highest levels in two and a half years. Oil and gas producers mostly notched gains, with Oil Search rising 3.6 percent and Woodside climbing 2.68 percent by the end of the day.\nGreater China markets extended gains. Hong Kong's Hang Seng Index rose 0.58 percent by 3:05 p.m. HK/SIN, with investors eyeing an eighth straight day of gains. Energy-related plays were higher following oil's overnight gains, with the tech sector also recording sizable gains: CNOOC was up 3.61 percent and Tencent advanced 2.13 percent at 3:10 p.m. HK/SIN.\nOn the mainland, markets saw moderate gains. The Shanghai Composite added 0.52 percent to end at 3,386.5 and the Shenzhen Composite advanced 0.36 percent to close at 1,940.96. The energy sector outperformed its peers on the blue-chip CSI 300 index, which tracks large companies listed in both Shanghai and Shenzhen.\nA survey released Thursday showed the services sector in the country grew at its fastest rate in more than three months in December. The Caixin services PMI came in at 53.9 last month, compared to the 51.9 seen in November. That was the highest level recorded since August 2014, according to Reuters.\nThe positive read followed the release of expectation-topping Caixin manufacturing PMI data earlier this week. Official PMI for December had been in line with estimates.\nStrong lead from Wall Street U.S. stocks closed higher in the last session, with the S&P 500 closing above 2,700 for the first time as technology stocks notched more gains. Semiconductor names led the sector higher, with AMD jumping 5.19 percent and Nvidia soaring 6.58 percent on the day.\nThe Dow Jones industrial average advanced 0.4 percent, or 98.67 points, to close at 24,922.68 and the S&P 500 gained 0.64 percent to finish at 2,713.06. \nOn the data front, manufacturing activity stateside topped expectations, with the ISM manufacturing index for December released Wednesday coming in at 59.7.\nInvestors also digested minutes from the Federal Reserve's meeting in December, which showed that most members thought upcoming changes in taxes would lead to higher real GDP growth. The minutes also showed members of the Federal Open Market Committee were somewhat at odds over meeting the central bank's inflation target of 2 percent.\nElsewhere, European markets ended higher as new financial sector rules under Mifid ll came into effect, with the pan-European Stoxxx 600 closing nearly 0.5 percent higher.\nDollar loses steam The dollar lost steam late in Asian trade after firming on the back of optimistic releases stateside. The dollar index , which tracks the U.S. currency against a basket of six peers, traded at 92.083 at 2:58 p.m. HK/SIN, after rising as high as 92.261 during the session.\nThe greenback , however, held onto gains made against the yen to fetch 112.53, after beginning the week at the 112.3 handle.\nMeanwhile the Korean won pared losses against the dollar after softening overnight. The currency had traded at its highest levels in more than three years earlier this week. At 3:02 p.m. HK/SIN, the won traded at 1,061.05 to the dollar. \n\"Support for the dollar should provide some relief in Asia over strong exchange rates,\" said DBS Group strategists Eugene Leow and Philip Wee in a morning note, highlighting South Korea's concerns over recent strength in the won. \nThe commodities trade Oil prices extended gains after touching their highest levels in two and a half years on Wednesday on the back of a wider market rally. The move higher in prices also came as protests continued in Iran, although analysts said those were unlikely to negatively impact oil production in the country.\nU.S. West Texas Intermediate advanced 0.76 percent to trade at $62.10 per barrel after rising 2.1 percent in the last session. Brent crude futures tacked on 0.4 percent to trade at $68.11.\nCorporate news Shares of Japanese videogame maker Nintendo closed up 4.9 percent following news that its hit \"Pokemon Go\" game was headed to China. The Financial Times reported earlier this week that U.S.-based developer Niantic was partnering with NetEase to launch the game on the mainland.\nDalian Wanda Commercial Property was downgraded from \"BBB\" to \"BB+\" by Fitch Ratings on Wednesday, a two-notch downward revision. Fitch said the downgrade reflected the company's \"inability to access offshore funding channels to boost its offshore liquidity in a timely manner.\"", "external_links": [], "published": "2018-01-04T01:49:00.000+02:00", "crawled": "2018-01-04T02:31:00.002+02:00", "highlightTitle": ""}