{"organizations": [], "uuid": "fbcafb5e976c638ac084f2aeba9be232bb1bd4bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930253-GettyImages-631200574.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/ces-2018-wrap-up-opinion-its-no-longer-about-the-consumer.html", "country": "US", "domain_rank": 767, "title": "CES is now mostly about ideas - there are few products you'll ever actually buy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T19:11:00.000+02:00", "replies_count": 0, "uuid": "fbcafb5e976c638ac084f2aeba9be232bb1bd4bf"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/ces-2018-wrap-up-opinion-its-no-longer-about-the-consumer.html", "ord_in_thread": 0, "title": "CES is now mostly about ideas - there are few products you'll ever actually buy", "locations": [], "entities": {"persons": [{"name": "bilgin s. sasmaz/anadolu", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "getty las vegas", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "anadolu agency", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CES 2018 wraps up on Friday and if there's one takeaway, it has drastically changed in its focus in recent years.\nIf I'm remembering correctly, this was my 10th time attending the annual tech show in Las Vegas. A lot has changed since I first set foot on the show floor as a cub reporter almost a decade ago.\nThere were plenty of gadgets — drones, augmented reality goggles, virtual reality headsets, cars that can drive themselves and more.\nThe show isn't what it used to be — not that this is bad — but it's much more about gadget-makers getting on stage and chest-pounding tech that's still in development.\nManufacturers seem to want to follow Apple's playbook — most are trying to create and sell us things we \"don't yet know we need.\" Except, unlike Apple, few competitors are able actually able to prove we ever actually need any of this. It's something only Apple has been able to perfect.\nTake LG and Samsung, for example. Both companies announced products I don't think I'll see in my house within the next 10 years. LG has a fridge with Amazon's Alexa voice assistant built in, for example -- something that was technically introduced last year. Samsung is also putting its Bixby voice assistant -- already in its smartphones -- into its appliances.\nShort of Wayne Szalinski from the movie Honey I Shrunk the Kids, I can't think of anyone who actually needs this. Why not just pull out a smartphone to ask the weather, or turn to your Amazon Echo to add an item to your shopping list?\nIf there was a theme this year, it's that gadget-makers are putting tech where I don't think we need it — just because they can. There were pole dancing robots. Robots that helped you play ping pong, that probably won't ever sell on the market to general consumers.\nThere are other examples, too, like TVs that are larger than most walls we could ever put them on (and which may never actually come to market at affordable prices for many, many years), glasses that still look just as silly as Google Glass (and have yet to prove they'll be useful by actual consumers), and too many concepts and Kickstarter projects to count.\nSadly, there were few products one might actually be able to buy, even if you wanted to. What was once a show with dozens of new TVs and laptops and smartphones that were going to hit the market in weeks or months, is now a show about ideas.\nIt's not bad, it's just curious we still call it a \"consumer\" electronics show.", "external_links": [], "published": "2018-01-12T19:11:00.000+02:00", "crawled": "2018-01-12T19:25:09.006+02:00", "highlightTitle": ""}