{"organizations": [], "uuid": "c82c9ded1aeab828f16b6a6802f23233ea61e637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 33, "shares": 33, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "President Trump Says He Is ‘the Least Racist Person’ – Fortune", "url": "http://fortune.com/2018/01/14/donald-trump-says-not-racist/", "country": "US", "domain_rank": 1196, "title": "President Trump Says He Is ‘the Least Racist Person’", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-15T04:37:00.000+02:00", "replies_count": 0, "uuid": "c82c9ded1aeab828f16b6a6802f23233ea61e637"}, "author": "The Associated Press", "url": "http://fortune.com/2018/01/14/donald-trump-says-not-racist/", "ord_in_thread": 0, "title": "President Trump Says He Is ‘the Least Racist Person’", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "hait", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "kevin mccarthy", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump Says He Is 'the Least Racist Person' President Donald Trump speaks to reporters in West Palm Beach, Fla. on Jan. 14, 2018. Nicholas Kamm—AFP/Getty Images By The Associated Press 9:37 PM EST \nPresident Donald Trump defended himself Sunday in the wake of recent disparaging comments about Haiti and African nations, declaring that “I am not a racist.” \nTrump addressed the issue briefly as he arrived for dinner at his private golf club with House Majority Leader Kevin McCarthy of California. \nAsked what he thinks about people who think he is racist, Trump said, “No, No. I am not a racist.” He told reporters: “I am the least racist person you have ever interviewed. That I can tell you.” \nTrump also denied making the statements attributed to him, but avoided specifics about what he did or did not say. \n“Did you see what various senators in the room said about my comments?” he asked. “They weren’t made.” \nTrump stands accused of using the word “shithole” to describe African countries during an Oval Office meeting last Thursday with a bipartisan group of six senators. The president also questioned the need to admit more Haitians to the U.S., according to people who were briefed on the conversation but were not authorized to describe the meeting publicly. \nTrump also said in the meeting that he would prefer immigrants from countries like Norway instead. \nThe White House has not denied that Trump said “shithole” though Trump has already pushed back on some depictions of the meeting. \nA confidant of Trump’s told The Associated Press that the president spent Thursday evening calling friends and outside advisers to judge their reaction to his remarks. Trump wasn’t apologetic and denied he was racist, instead blaming the media for distorting his meaning, said the confidant, who wasn’t authorized to disclose a private conversation and spoke on condition of anonymity. \nSen. Dick Durbin of Illinois, the only Democrat at Thursday’s meeting, said Trump had indeed said what he was reported to have said. Durbin said the remarks were “vile, hate-filled and clearly racial in their content.” He said Trump used the most vulgar term “more than once.” \nTrump commented as Durbin was presenting details of a compromise immigration plan that included providing $1.6 billion for a first installment of the president’s long-sought border wall. \nTrump took particular issue with the idea that people who’d fled to the U.S. after disasters hit their homes in places such as El Salvador, Guatemala and Haiti would be allowed to stay as part of the deal, according to the people, who spoke on condition of anonymity because they weren’t authorized to publicly describe the discussion. \nWhen it came to talk of extending protections for Haitians, Durbin said Trump replied: “We don’t need more Haitians.'” \nFor more on Trump’s immigration remarks, watch Fortune’s video: \n“He said ‘Put me down for wanting more Europeans to come to this country. Why don’t we get more people from Norway?” Durbin said. \nRepublican Sens. David Perdue of Georgia and Tom Cotton of Arkansas, who also attended the meeting, initially said in a statement Friday that they “do not recall the president saying these comments specifically.” \nOn Sunday, they backtracked and challenged other senators’ descriptions of the remarks. \nPerdue described as a “gross misrepresentation” reports that Trump used the vulgarity. He said Durbin and Republican Sen. Lindsey Graham of South Carolina were mistaken in indicating that was the case. Graham also attended the meeting. \n“I am telling you that he did not use that word. And I’m telling you it’s a gross misrepresentation,” Perdue said on ABC’s “This Week.” \nCotton told CBS’“Face the Nation” that he “didn’t hear” the word used — “and I was sitting no further away from Donald Trump than Dick Durbin was.” \nTrump insisted in a tweet on Friday that he “never said anything derogatory about Haitians other than Haiti is, obviously, a very poor and troubled country. Never said ‘take them out.’ Made up by Dems.” Trump wrote, “I have a wonderful relationship with Haitians. Probably should record future meetings – unfortunately, no trust!” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-15T04:37:00.000+02:00", "crawled": "2018-01-15T04:37:34.002+02:00", "highlightTitle": ""}