{"organizations": [], "uuid": "a060e47938efa06e33eca7ea340c87a6425b01f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Delta and American Airlines Strike a Pact to Help Stranded Passengers – Fortune", "url": "http://fortune.com/2018/01/26/delta-american-airlines-policy-stranded-deal/", "country": "US", "domain_rank": 1196, "title": "Delta and American Airlines Strike a Pact to Help Stranded Passengers", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T12:12:00.000+02:00", "replies_count": 0, "uuid": "a060e47938efa06e33eca7ea340c87a6425b01f2"}, "author": "David Meyer", "url": "http://fortune.com/2018/01/26/delta-american-airlines-policy-stranded-deal/", "ord_in_thread": 0, "title": "Delta and American Airlines Strike a Pact to Help Stranded Passengers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "delta", "sentiment": "negative"}, {"name": "american airlines", "sentiment": "negative"}, {"name": "cnn", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer 5:12 AM EST \nIf you’re a Delta or American Airlines passenger and you find yourself stranded at an airport due to bad weather or technical issues, you should now have more options to help you get where you’re going. \nThe carriers have reportedly struck a deal, which came into effect Wednesday, that lets passengers on one airline get a seat on the other, in order to get them to their destination as quickly as possible. \nAccording to a CNN report , the arrangement was Delta’s idea. Both airlines told the news organization that it would help their staff help customers. \nThe carriers previously had an agreement that achieved much the same thing, but that ended in 2015 after Delta complained it was having to deal with more American Airlines passengers than vice versa. \nHowever, that was an interline agreement, allowing passengers to combine flights with both airlines in a single itinerary—this time round, the carriers aren’t going as far. Delta told CNBC that the new deal was “strictly an irregular-operations ticketing and baggage reaccommodation agreement.” \nBoth Delta and American Airlines faced big flight disruptions in the last year. Delta’s Atlanta hub, Hartsfield-Jackson international airport, was battered by storms in April and suffered a massive blackout in December. And American Airlines had to throw money at its pilots to avoid disruptions around Christmas, after a glitch in its vacation scheduling system let too many of them book vacation at the same time. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T12:12:00.000+02:00", "crawled": "2018-01-26T12:12:38.006+02:00", "highlightTitle": ""}