{"organizations": [], "uuid": "f0bee5251c8ac9013cf41159cab891a27b50f8e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Google Inks a Patent Deal with Tencent as it Explores Ways to Expand in China – Fortune", "url": "http://fortune.com/2018/01/19/google-tencent-patent-deal-china/", "country": "US", "domain_rank": 1196, "title": "Google Inks a Patent Deal with Tencent as it Explores Ways to Expand in China", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T08:54:00.000+02:00", "replies_count": 0, "uuid": "f0bee5251c8ac9013cf41159cab891a27b50f8e5"}, "author": "Reuters", "url": "http://fortune.com/2018/01/19/google-tencent-patent-deal-china/", "ord_in_thread": 0, "title": "Google Inks a Patent Deal with Tencent as it Explores Ways to Expand in China", "locations": [], "entities": {"persons": [{"name": "tence", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "tencent holdings", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "google inks", "sentiment": "negative"}, {"name": "tencent", "sentiment": "negative"}, {"name": "lg electronics", "sentiment": "none"}, {"name": "cisco systems", "sentiment": "none"}, {"name": "samsung electronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Google Inks a Patent Deal with Tencent as it Explores Ways to Expand in China A security guard walks past a logo of Google in Shanghai, China, on April 21, 2016. Aly Song—Reuters By Reuters 1:54 AM EST \nAlphabet ‘s (goog) Google has agreed to a patent licensing deal with Tencent Holdings (tctzf) as it looks for ways to expand in China where many of its products, such as app store, search engine and email service, are blocked by regulators. \nThe U.S. technology company has signed similar agreements before with Samsung Electronics (ssnlf) , LG Electronics and Cisco Systems (csco) , but the deal with Tencent is a first with a large Chinese tech firm. \nGoogle has previously said that agreements such as these reduce the potential of litigation over patent infringement. \nThe agreement with the Chinese social media and gaming firm Tencent covers a broad range of products and paves the way for collaboration on technology in the future, Google said on Friday, without disclosing any financial terms of the deal. \nTencent oversees China’s top social media and payments app, WeChat, which has close to a billion users. It also oversees one of the country’s most popular app stores and hosts the country’s biggest gaming and livestream platforms. \nGoogle did not disclose the scope of the new patent deal and Tencent did not immediately respond to questions about which products the patent agreement will cover. \n“By working together on agreements such as this, tech companies can focus on building better products and services for their users,” said Mike Lee, Google’s head of patents. \nOver the past year, Google has indicated that it was looking to increase it presence in the restrictive Chinese market, with the launch of a local AI research lab, introduction of a version of its translation app and expansion into new cities. \nThe company announced this month that it had invested in Chinese livestream gaming app Chushou, which is similar to Google’s own YouTube game livestreaming services. \nIn December, Google CEO Sundar Pichai spoke at a conference in China hosted by the Cyberspace Administration of China, which oversees censorship in the country. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-19T08:54:00.000+02:00", "crawled": "2018-01-19T08:54:28.035+02:00", "highlightTitle": ""}