{"organizations": [], "uuid": "965216010114a1594a52ae1a70af39d4c8ddf402", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 199, "shares": 199, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220487805&w=1200&r=LYNXMPEE080BV", "site_section": "http://dede-indra.blogspot.com/feeds/posts/default", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-southchinasea-philippines-china/philippines-to-protest-to-china-over-apparent-airbase-on-manmade-island-idUSKBN1EY0H8", "country": "US", "domain_rank": 408, "title": "Philippines to protest to China over apparent airbase on manmade island", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T11:02:00.000+02:00", "replies_count": 0, "uuid": "965216010114a1594a52ae1a70af39d4c8ddf402"}, "author": "", "url": "https://www.reuters.com/article/us-southchinasea-philippines-china/philippines-to-protest-to-china-over-apparent-airbase-on-manmade-island-idUSKBN1EY0H8", "ord_in_thread": 0, "title": "Philippines to protest to China over apparent airbase on manmade island", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 6:26 AM / in 4 hours Philippines to protest to China over apparent airbase on manmade island Reuters Staff 3 Min Read \nMANILA (Reuters) - The Philippines will make a diplomatic protest to China, which the southeast Asian nation’s defense minister described as having reneged on a promise not to militarize artificial islands in the busy South China Sea waterway. \nThe United States has criticized China’s build-up of military facilities on the artificial islands and is concerned they could be used to restrict free movement along the key trade route. \nPhilippine Defence Secretary Delfin Lorenzana’s comment followed a Dec. 30 broadcast of aerial footage by the official China Central Television (CCTV) showing Fiery Cross Reef, which appeared to have been transformed into an airbase. \n“The Chinese government said some time ago that they were not going to militarize those reclaimed islands,” Lorenzana told reporters, adding that the protest would be made through the foreign ministry. \n“If it is true and we can prove that they have been putting soldiers and even weapons systems, that will be a violation of what they said.” \nAsked about the protest, China’s foreign ministry spokesman said the construction was on the country’s territory and was intended to aid peace in the region, as well as maritime safety and disaster prevention. \n“Of course, China also needs to construct necessary defense equipment for its territory,” the spokesman, Lu Kang, told a regular briefing on Tuesday. “The relevant equipment is not directed at any particular country.” \nChina and the Philippines have long sparred over the South China Sea, but relations have improved considerably under President Rodrigo Duterte, who has been courting Beijing in hopes of winning business and investment. \nChina has assured the Philippines it will not occupy new features or territory in the South China Sea, under a new “status quo” brokered by Manila as both sides try to strengthen their relations. \nReports about China militarizing reclaimed islands were not new, presidential spokesman Harry Roque told a regular news briefing. \n“We have always been against the militarization of the area,” he added. “It is certainly not OK, because it constitutes a further threat to peace and security in area.” \nChina is holding to a commitment not to reclaim more islands, Roque added, however. \n“There is still no breach of the good faith obligation for as long as China has not embarked on new reclamation,” he said, when asked about the situation on the reef. \nChina has denied U.S. charges that it is militarizing the South China Sea, which also is claimed by Brunei, Malaysia, the Philippines, Taiwan and Vietnam. \nThe reef has a hospital with more than 50 doctors, high-speed mobile connections and an airport with a runway of 3,160 meters (3,456 yards) to serve what Beijing calls a “weather station” equipped with radar, Chinese state media say. \nIn the last 27 years, China’s navy has sent more than 1,000 soldiers to guard the reef, state media have said. Reporting by Karen Lema; Additional reporting by Christian Shepherd in BEIJING; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-09T11:02:00.000+02:00", "crawled": "2018-01-09T11:14:41.029+02:00", "highlightTitle": ""}