{"organizations": [], "uuid": "33d8cbb4280476c01bcfce86af74090be7eb27fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930774-GettyImages-53293410.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/flooding-at-jfk-airport-adds-to-misery-after-flight-delays.html", "country": "US", "domain_rank": 767, "title": "Water main break at JFK airport adds to travelers' misery after winter storm flight delays", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T12:51:00.000+02:00", "replies_count": 0, "uuid": "33d8cbb4280476c01bcfce86af74090be7eb27fd"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/flooding-at-jfk-airport-adds-to-misery-after-flight-delays.html", "ord_in_thread": 0, "title": "Water main break at JFK airport adds to travelers' misery after winter storm flight delays", "locations": [], "entities": {"persons": [{"name": "rick cotton", "sentiment": "none"}], "locations": [{"name": "jfk airport", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "jfk airport", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "cnn", "sentiment": "none"}, {"name": "port authority", "sentiment": "none"}, {"name": "john f. kennedy international airport", "sentiment": "none"}, {"name": "u.s. northeast", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flooding from a water main break forced the temporary suspension of some flights at New York's John F. Kennedy International Airport on Sunday, adding to the misery of travelers after a winter storm canceled or delayed hundreds of flights in recent days.\nWater poured from the ceiling onto a check-in counter and covered large areas of the floor of Terminal 4, video on CNN showed. The disruption occurred while the U.S. Northeast continued to endure bone-chilling weather with the New York temperature at 17 degrees Fahrenheit (-8 Celsius).\nInternational flights to Terminal 4 were temporarily suspended and passengers who had already arrived there were diverted to other terminals, according to the Port Authority of New York and New Jersey, which operates the airport.\nThe Port Authority said the water pipe break appears to be weather-related. Flights later resumed but with delays, it said.\nMohammed Elshamy | Anadolu Agency | Getty Images A passenger and her luggage are seen during the weather-related cancellation at the John F. Kennedy Airport in New York, United States on January 08, 2017. \"What happened at JFK Airport is unacceptable, and travelers expect and deserve better,\" Port Authority Executive Director Rick Cotton said in a statement.\nThe authority said a water pipe that feeds the terminal's sprinkler system broke, which caused flooding and a led to a temporary power cut in some areas as a safety measure.\nThe airport on Twitter advised travelers to check with their airlines before arriving.\nThere were about 3 inches (7.5 cm) of water inside the west end of Terminal 4, Scott Ladd, a spokesman for the Port Authority, said in an email.\nThe flooding hit just as the airport was crawling back to normal after a winter storm labeled a \"bomb cyclone\" forced the airport to close on Thursday.\nWhen operations resumed on Friday, the backlog led to hundreds more delays or cancellations, crowding the terminals with stranded passengers.\nMohammed Elshamy | Anadolu Agency | Getty Images Passengers with their luggage are seen during the weather-related cancellation at the John F. Kennedy Airport in New York, United States on January 08, 2017. More than 500 flights into or out of JFK were canceled and nearly 1,400 delayed from Friday morning to Sunday afternoon, according to the flight-tracking website FlightAware.\nThe extreme cold and recovery from Thursday's snowstorm created a \"cascading series of issues for the airlines and terminal operators,\" the Port Authority said.\nEquipment froze and baggage handling was delayed, which was compounded by staff shortages and heavier than normal passenger loads, the Port Authority said. The backlog left passengers stuck on planes for long stretches while waiting for other aircraft to get in and out of gates.", "external_links": [], "published": "2018-01-08T12:51:00.000+02:00", "crawled": "2018-01-08T13:30:40.000+02:00", "highlightTitle": ""}