{"organizations": [], "uuid": "51b0647eab52d82b4efdd34037e7a0125f66f854", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/21/104857004-GettyImages-860933692.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/us-dollar-will-get-slammed-if-nafta-dies-analyst-jens-nordvig-says.html", "country": "US", "domain_rank": 767, "title": "US dollar will get slammed if NAFTA dies, analyst Jens Nordvig says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T22:12:00.000+02:00", "replies_count": 0, "uuid": "51b0647eab52d82b4efdd34037e7a0125f66f854"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/us-dollar-will-get-slammed-if-nafta-dies-analyst-jens-nordvig-says.html", "ord_in_thread": 0, "title": "US dollar will get slammed if NAFTA dies, analyst Jens Nordvig says", "locations": [], "entities": {"persons": [{"name": "jens nordvig", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "exante data", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider US dollar will get slammed if NAFTA dies, analyst Jens Nordvig says If the U.S. pulls out of NAFTA, the peso could lose as much as 10 percent but the dollar could also get slammed against a host of currencies, according to Exante Data CEO Jens Nordvig. The dollar could end up losing out to the euro and yen if the U.S. proceeds with protectionist activity, and could ultimately be less attractive as a reserve currency, he said. Earlier, the dollar moved lower on a report that Chinese officials were considering buying fewer or stopping purchases of Treasury securities due to their unattractiveness but also trade issues. SHARES \nProtectionism may be a problem for the U.S. dollar. \nIf the U.S. pulls out of NAFTA, the Mexican peso could lose as much as another 10 percent, but the U.S. dollar could also get slammed against major world currencies, according to Jens Nordvig, CEO of Exante Data. Getty Images \nThe currency strategist said U.S. protectionism is one of the biggest threats to the dollar and one of the biggest sources of dollar volatility. \nReuters Wednesday quoted unnamed Canadian government officials saying they are increasingly convinced that President Donald Trump will withdraw from the North American Free Trade Agreement. The next round of talks is scheduled for Jan. 23 in Canada. \nThe peso lost 0.9 percent, and the Canadian dollar fell one percent on the report. \nNordvig said the size of the Canadian dollar's decline is unusual, and the loonie has not previously reacted as intensely during prior NAFTA scares. If NAFTA fails, he said the Canadian dollar would decline further but not as much as the five to 10 percent decline he expects to see in the peso. \n\"Mexico is more vulnerable. Over time, we think the Mexican move is going to play out more forcefully. What the dollar does on a global scale is more tricky,\" said Nordvig. \nIf the 24 year old treaty is tossed, years of integration between Mexico, Canada and the U.S. will be at risk. Supporters of NAFTA claim prices will rise if the U.S. kills the trade deal, and the U.S. will find itself at the start of what could turn into trade wars. But critics of NAFTA say it has allowed U.S. manufacturing and workers to be undermined by low cost goods coming in from Mexico, which has a $60 billion trade deficit with the U.S. \n\"The dollar will suffer against the euro but the market is not really having a clear view on this. The euro is actually down on these headlines. The market is actually so confused about what it means for the global dollar,\" said Nordvig. \nEarlier Wednesday, the dollar sank on another trade related story. Bloomberg reported that unnamed Chinese officials were considering stopping purchases of U.S. Treasurys because of their unattractiveness but also trade issues. \nThe Trump administration is expected to make recommendations on steel and aluminum this month that could impact China. \nBut Nordvig said it would take a much bigger trade event than product tarriffs to really damage the dollar, and if the U.S. does engage in full scale protectionism, the dollar could ultimatley be seen as less attractive as a reserve currency. \nCanada, the U.S. and Mexico have held five rounds of talks to renegotiate NAFTA but U.S. demands on how trade issues are resolved and the treaty's permanence have been among the thorny issues for Canada and Mexico. \nEarlier Wednesday, U.S. Trade Representative Robert Lighthizer called a case filed by Canada with the World Trade Organization against the U.S. for U.S. disciplinary practices and procedures \"a broad and ill-advised attack\" on the U.S. trade remedies system. \n\"Even if Canada succeeded on these groundless claims, other countries would primarily benefit, not Canada. For example, if the U.S. removed the orders listed in Canada's complaint, the flood of imports from China and other countries would negatively impact billions of dollars in Canadian exports to the United States, including nearly $9 billion in exports of steel and aluminum products and more than $2.5 billion in exports of wood and paper products,\" the trade representative said in a statement. ", "external_links": [], "published": "2018-01-10T22:12:00.000+02:00", "crawled": "2018-01-10T22:19:41.020+02:00", "highlightTitle": ""}