{"organizations": [], "uuid": "472634a1bcf8fc4981f43862ec3f1e3d771904be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/23/104126239-GettyImages-462812192.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/oil-prices-are-poised-to-fall-because-theres-little-left-to-do-but-sell.html", "country": "US", "domain_rank": 767, "title": "Oil prices are poised to fall because there's little left to do but sell", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T18:56:00.000+02:00", "replies_count": 0, "uuid": "472634a1bcf8fc4981f43862ec3f1e3d771904be"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/oil-prices-are-poised-to-fall-because-theres-little-left-to-do-but-sell.html", "ord_in_thread": 0, "title": "Oil prices are poised to fall because there's little left to do but sell", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "renewable energy oil", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}, {"name": "u.s. commodity futures trading commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices are poised for a pullback after hedge funds and money managers raised their bullish bets on energy futures to record levels , analysts say.\nSpeculative bets that U.S. crude prices will rise have surged since September as OPEC and Russia hammered out a deal to continue capping their oil production. The deal has helped to balance an oversupplied market and drain global stockpiles of crude oil.\nHedge funds and other money managers raised their long positions, or bets that crude prices will keep going up, to the highest levels in 2017, according to data from the U.S. Commodity Futures Trading Commission covering the week through Dec. 26. This financial positioning represents the biggest risk to oil prices in the near term, according to Matt Smith, director of commodity research at ClipperData.\n\"Everybody that wants to be long is long, and so all that can be done now is that it can be sold,\" he told CNBC's \"Squawk Box\" on Wednesday. \"And so we should see those net long positions unwind. That could present some downside risk.\"\nHowever, the market is now finely balanced, so supply disruptions such as last month's U.K. North Sea Forties pipeline outage can boost oil prices, he said. Geopolitical tensions such as the unrest rocking Iran this past week can also push up prices, according to Smith.\nOil prices rose to their highest levels since mid-2015 on Wednesday as the protests continued, even though analysts said there was little risk of a supply disruption from Iran , OPEC's third largest producer.\n@JKempEnergy: HEDGE FUND long positions in petroleum hit a record 1,329 million bbl in week to Dec 26\nWhile long positions have surged, short positions, or bets that prices will fall, have dropped to the lowest levels since February in recent weeks.\nThe last time short positions fell to these \"extreme\" lows , the oil market saw a more than 20 percent correction, said John LaForge, head of Real Asset Strategy at Wells Fargo Investment Institute.\n\"On the professional side, everyone's long. Everyone's into this trade already, so sentiment-wise, I think we're going down from here,\" he told CNBC's \"Squawk on the Street\" on Friday.\nshow chapters Crude oil prices up: High oil demand pulls inventory down 10:56 AM ET Fri, 29 Dec 2017 | 02:54 However, Gary Ross, global head of oil analytics at S&P Global Platts, is not convinced the length in the oil market heralds a drop in prices.\nMany of the traders who are long oil are actually playing the so-called roll yield, he said. This is the profit traders can earn when they roll their investment in crude oil futures, which expire every month, into contracts that expire at a later date.\nRight now, traders playing the roll yield are earning 5 percent to 10 percent on their investments, compared with a roughly 2.5 percent yield on U.S. 10-year Treasury bonds .\n\"I think financial length is far more well-supported by the structure in the market,\" he told \"Squawk on the Street\" on Friday. \"So I think there is some vulnerability ... but I also think that you're not going to see any wholesale liquidation of financial length.\"", "external_links": [], "published": "2018-01-03T18:56:00.000+02:00", "crawled": "2018-01-03T19:01:32.004+02:00", "highlightTitle": ""}