{"organizations": [], "uuid": "0db18e634643e15d43f69faa7c7ff4fd85bd81da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/27/104612693-GettyImages-466156611.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/stocks-making-the-biggest-moves-premarket-ge-unh-pg-an-dis-wmt-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: GE, UNH, PG, AN, DIS, WMT & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T15:14:00.000+02:00", "replies_count": 0, "uuid": "0db18e634643e15d43f69faa7c7ff4fd85bd81da"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/stocks-making-the-biggest-moves-premarket-ge-unh-pg-an-dis-wmt-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: GE, UNH, PG, AN, DIS, WMT & more", "locations": [], "entities": {"persons": [{"name": "spencer platt", "sentiment": "negative"}, {"name": "goldman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city  check", "sentiment": "none"}], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "unh", "sentiment": "negative"}, {"name": "general electric", "sentiment": "none"}, {"name": "p&g", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "unitedhealth group", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "autonation", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell: \nGeneral Electric – GE is taking a $6.2 billion charge following a comprehensive review of its legacy reinsurance business. About $15 billion will be contributed to reserves over the next seven years, funded by GE Capital. As a results, GE Capital will eliminate the dividend that it pays to GE for the foreseeable future.\nUnitedHealth Group – The health insurer reported adjusted quarterly profit of $2.59 per share, 8 cents a share above estimates. Revenue beat forecasts, and the company also raised its full-year forecast due to benefits from the new tax law.\nProcter & Gamble – Goldman Sachs upgraded the stock to \"neutral\" from \"sell,\" as it no longer sees a material downside to earnings. Goldman continues to have concerns over P&G's long-term growth prospects, however.\nAutonation – The automotive retailer said it would see a one-time benefit of 45 cents per share for the fourth quarter, thanks to the new tax law. It also sees a full-year 2018 benefit of 80 cents to $1.10 per share.\nWalt Disney — Facebook Chief Operating Officer Sheryl Sandberg and Twitter CEO Jack Dorsey will not seek re-election to the Disney board. Disney said the two are standing down due to growing conflicts of interest.\nCBS , Viacom — Controlling shareholder Shari Redstone is reportedly seeking a merger between CBS and Viacom. The two are not said to be in active discussions about such a combination.\nWal-Mart – Wal-Mart is planning to cut about 1,000 jobs primarily at its corporate headquarters, according to The Wall Street Journal. The cuts are expected to be completed by January 31, the last day of the retailer's fiscal year.\nApple — CEO Tim Cook has received a letter from four House Republicans, seeking more information about the company's recent disclosure about slowing down older iPhones to prevent shutdowns.\nMcDonald's – McDonald's is switching to environmentally friendly packaging and offering recycling options at its restaurants. The company has set a goal of getting 100 percent of its packaging from renewable or recycled sources by 2025.\nAT&T – AT&T is being pressured to cut all ties with China phone maker Huawei Technologies and to oppose China Mobile's plans to enter the U.S. market, because of national security concerns, according to Reuters quoting two congressional aides.\nBoeing – The jetmaker was beaten out by European rival Airbus for 2017 orders, thanks to a surge of deals in the year's closing weeks. Airbus sold 1,109 jets in 2017, compared to 912 for its U.S. rival.\nCitigroup – Citi is planning to raise pay for women and minorities in the U.S. to help bridge pay gaps.\nBlackBerry – BlackBerry has launched new cybersecurity software called \"BlackBerry Jarvis,\" designed to identify vulnerabilities in self-driving car programs.\nFiat Chrysler — Chief Executive Officer Sergio Marchionne said he has no plans to either break up the automaker or sell individual brands.\n21st Century Fox – Fox was upgraded to \"buy\" from \"neutral\" at B.Riley/FBR due to the pending sale of various assets to Walt Disney.\nEli Lilly – Lilly was downgraded to \"neutral\" from \"buy\" at Goldman Sachs, which sees potential headwinds in the drug maker's diabetes business.\nHershey – Hershey was cut to \"sell\" from \"neutral\" at Goldman, which points to competitive pressures for Hershey's chocolate business.", "external_links": [], "published": "2018-01-16T15:14:00.000+02:00", "crawled": "2018-01-16T15:32:49.011+02:00", "highlightTitle": ""}