{"organizations": [], "uuid": "8503e57b2d80448526773f019fae436b62f8ea1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/07/104573503-NUP_100117_0022.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/jerry-seinfeld-on-his-first-joke-how-he-knew-hed-found-his-calling.html", "country": "US", "domain_rank": 767, "title": "This was Jerry Seinfeld's first joke—and how he knew he'd found his calling as a comedian", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T19:32:00.000+02:00", "replies_count": 0, "uuid": "8503e57b2d80448526773f019fae436b62f8ea1f"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/jerry-seinfeld-on-his-first-joke-how-he-knew-hed-found-his-calling.html", "ord_in_thread": 0, "title": "This was Jerry Seinfeld's first joke—and how he knew he'd found his calling as a comedian", "locations": [], "entities": {"persons": [{"name": "jerry seinfeld", "sentiment": "neutral"}, {"name": "forbes", "sentiment": "none"}, {"name": "david remnick", "sentiment": "none"}, {"name": "jerry", "sentiment": "none"}, {"name": "seinfeld", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jerry Seinfeld might be the world's most famous comedian. Worth almost $70 million according to Forbes, his namesake television show catapulted the funny man to superstardom — but Seinfeld, 63, built his reputation step by step, joke by joke.\nIn a conversation with David Remnick for The New Yorker Radio Hour , Seinfeld talks about his very first joke, which he also reveals in his new Netflix series, \" Jerry before Seinfeld .\"\n\"So, I am left handed. Left-handed people do not like that the word left is so often associated with negative things. Left feet. Left-handed compliment. 'What are we having for dinner? Leftovers.' You go to a party there is nobody there. 'Where did everybody go?' 'They left!'\"\n\"That was it, that was my first joke,\" Seinfeld says.\n\n\"It just occurred to me that all these left words are negative. Left-handed compliment. You know, you hear that and then I thought, 'Well that is weird. Why are they putting that on us?' And, 'they left' — and so that was the joke.\"\nThe pacing is important, he says: \"The rhythm is 90 percent of that joke.\"\nThe entire podcast is embedded below:\nSeinfeld discovered his love for comedy early in life. He was obsessed.\n\"I was not a very social kid, but I did get a TV in my room — when my parents got a new TV, I got them to give me the old TV,\" he tells Remnick. \"I had a TV in my room and I never came out of the room again.\"\nHe watched comedy shows and movies and listened to comedians' records. \"I just inhaled this stuff. I just couldn't get enough of it.\"\nThough he knew at a young age he loved comedy, Seinfeld says he didn't know he would be successful — but that didn't stop him. And his obsessive determination, despite his lack of confidence, is exactly how he knew he had found his passion.\n\"The truth is I really didn't think that I could and I didn't really care whether I could or I couldn't. I just got to this point where I was so in love with it that I just decided, 'What's the difference? What's the difference?' It seemed much more important to do the thing you want to do than success or failure,\" says Seinfeld.\n\n\"This was 1975 you know, there was still a little bit of the vapors of the 60s where you did what you believed in. It wasn't a success culture. It was more of a soul culture,\" Seinfeld says.\nIt was that dedication that sustained Seinfeld through the early struggles of building a comedy career. Remick asked Seinfeld whether being a young comedian requires a remarkably thick skin.\n\"Well, yes it does,\" he says. \"It does unless you just know you can't leave this world. You just can't. So it doesn't matter how hard it is or how much pain there may be. You know you have no choice. You know you have found your thing if you are lucky in life. If you find your thing.\" \n\"This is my thing,\" he says. \"I know how to do this. I am good at this.\"\nSee also: \nBillionaire Richard Branson: This simple trick is the best way to come up with an idea for a successful business \nTony Robbins: This is the difference between people who stick to their New Year's resolutions and those who don't \nMark Cuban: If I lost everything and had to start over, here's what I would do \nshow chapters Mark Cuban: If I lost everything and had to start over, here's what I would do      9:22 AM ET Fri, 24 March 2017 | 00:47 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-11T19:32:00.000+02:00", "crawled": "2018-01-11T19:46:39.041+02:00", "highlightTitle": ""}