{"organizations": [], "uuid": "3145efacc30b58fa44efff22e88126b15fd40512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/07/104266306-RTX2Z06U.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/stocks-making-the-biggest-moves-premarket-cat-mmm-celg-luv-noc-f-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: CAT, MMM, CELG, LUV, NOC, F & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T15:24:00.000+02:00", "replies_count": 0, "uuid": "3145efacc30b58fa44efff22e88126b15fd40512"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/stocks-making-the-biggest-moves-premarket-cat-mmm-celg-luv-noc-f-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: CAT, MMM, CELG, LUV, NOC, F & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "new york stock exchange", "sentiment": "negative"}, {"name": "celg", "sentiment": "negative"}, {"name": "noc", "sentiment": "negative"}, {"name": "mmm", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "celgene", "sentiment": "none"}, {"name": "southwest airlines", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "3m", "sentiment": "none"}, {"name": "northrop grumman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nCaterpillar – The heavy equipment maker earned an adjusted $2.16 per share for the fourth quarter , well above estimates of $1.79 a share. Revenue also beat forecasts and the company issued an upbeat 2018 outlook based in part on growth in its construction business.\n3M – The consumer products maker beat estimates by 9 cents a share, with adjusted quarterly profit of $2.10 per share. Revenue beat estimates, as well. 3M also announced a 16 percent increase in its quarterly dividend.\nCelgene – The biotech firm came in 3 cents a share above estimates, with adjusted quarterly profit of $2 per share. Revenue beat estimates, as well. Celgene also gave a better-than-expected earnings outlook for 2018.\nSouthwest Airlines – The airline earned an adjusted 77 cents per share for its latest quarter, 1 cent a share above forecasts. Revenue also topped the Street's outlook. The results were driven by an increase in passenger volume.\nNorthrop Grumman – The defense contractor reported adjusted quarterly profit of $2.82 per share , 8 cents a share above estimates. Revenue exceeded forecasts, as well. The company also raised its quarterly dividend by 10 percent to $1.10 per share.\nFord Motor – Ford reported adjusted quarterly profit of 39 cents per share , falling 3 cents a share short of estimates. Revenue also beat forecasts. Ford said North America was its only profitable region last quarter, with overall results hurt by rising commodity costs and unfavorable currency exchange rates.\nLas Vegas Sands – Las Vegas Sands beat estimates by 11 cents a share, with adjusted quarterly profit of 88 cents per share. The casino operator's revenue came in above estimates, as well. Its performance was helped by the continuing recovery in the Macau market.\nWhirlpool – Whirlpool earned an adjusted $4.10 per share for its latest quarter, compared to consensus estimates of $3.99 a share. The appliance maker's revenue did miss, however, as did its full-year forecast despite higher washing machine prices resulting from recently imposed tariffs on foreign washing machine makers.\nSTMicroelectronics – The company reported better-than-expected profit and revenue for its latest quarter, helped by auto and industrial demand for its chips, as well as a boost helped by the release of Apple's iPhone X. The quarter's performance concluded STMicro's best year since 2010.\nQualcomm – Qualcomm signed memorandums of understanding to sell at least $2 billion in electronic components to Chinese firms Lenovo, Guangdong, Vivo, and Xiaomi.\nAlphabet – Alphabet launched a new unit known as Chronicle , which will sell cybersecurity software to Fortune 500 companies. The unit will be run by Stephen Gillett, a former executive at cybersecurity firm Symantec .\nSnap – Snap Vice President of Product Tom Conrad is leaving the Snapchat parent in March. Snap director of growth Jacob Andreou will replace Conrad.\nFoot Locker – The athletic apparel and footwear retailer was rated \"buy\" in new coverage at Pivotal Research, based on valuation, upcoming easier comparable store comparisons, and new product in the athletic footwear pipeline.\nDomino's , Grubhub – The stocks were both rated \"buy\" in new coverage at Mizuho Securities, based on an expected surge in online food delivery and that fact that the pizza chain and the food delivery service represent about 40 percent of the online food delivery market.\nBest Buy – Best Buy was downgraded to \"market perform\" from \"outperform\" at Telsey Advisory Group. Telsey said the electronics retailer has pulled off one of the few successful retail transformations in recent history but notes a full stock valuation, more difficult comps, and pressures on profit margin growth as reasons for the downgrade.", "external_links": [], "published": "2018-01-25T15:24:00.000+02:00", "crawled": "2018-01-25T15:40:38.032+02:00", "highlightTitle": ""}