{"organizations": [], "uuid": "5fffa4e1e5a9da574fa7a1116f3dc77413ce92da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/06/103998873-GettyImages-103587227.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/medical-experts-predict-worst-flu-season-in-history.html", "country": "US", "domain_rank": 767, "title": "Get ready, the worst flu season in history may be coming", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T17:53:00.000+02:00", "replies_count": 0, "uuid": "5fffa4e1e5a9da574fa7a1116f3dc77413ce92da"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/medical-experts-predict-worst-flu-season-in-history.html", "ord_in_thread": 0, "title": "Get ready, the worst flu season in history may be coming", "locations": [], "entities": {"persons": [{"name": "tom starkweather", "sentiment": "negative"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "cdc", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nApple urged to take action on smartphone addiction some call 'digital heroin' \nThe United States is experiencing a similarly \"early and robust start to this flu season,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, part of the National Institutes of Health. \"It has all the markings of being a severe season.\" show chapters 1 Hour Ago | 01:27 \nA string of bad flu seasons has Dr. Fauci and other medical experts calling for the development of a universal influenza vaccine that would save lives. Each year, on average, 5 percent to 20 percent of the U.S. population contracts the flu, tens of thousands are hospitalized, and between 3,000 and 49,000 Americans die from flu-related illness, according to the CDC. The flu strikes indiscriminately, but young children, the elderly and the chronically ill are most vulnerable. \nCaring for the sick is costly. The CDC estimates that the flu costs the United States $10.4 billion a year in direct medical expenses and another $16.3 billion in lost earnings annually. A chunk of those billions is spent formulating, growing and distributing millions of doses of the annual flu vaccine, which from year to year reduces the risk of illness by 40 percent to 60 percent at best. The flu vaccine is the only one that has to be reformulated and administered every year. Most of the vaccine is grown in eggs, an arduous process that takes around six months. The race to make a universal vaccine \nThe definition of a universal flu vaccine is somewhat flexible. Ideally, a single injection would protect against all known and emerging influenza A strains and last a lifetime, said Peter Palese, a microbiologist at the Icahn School of Medicine at Mount Sinai in New York. More modest proposals envision a one-shot vaccine that would protect against getting the flu for anywhere from three to 20 years. Erica Spackman | USDA | Reuters The Avian influenza virus is harvested from a chicken egg as part of a diagnostic process in this undated U.S. Department of Agriculture (USDA) handout image. U.S. farm and health officials are racing to assess the threat that a type of bird flu never before seen in the country poses to humans and poultry, employing emergency plans drawn up in the wake of a devastating outbreak in birds last year. \nPalese's laboratory is one of three different research groups at Mount Sinai exploring a universal flu vaccine and one of numerous efforts under way mostly in academia, biotech firms and NIH. A handful of major pharmaceutical companies are supporting universal flu vaccine research, including GlaxoSmithKline ; Janssen Vaccines, a division of Johnson & Johnson ; and Sanofi . \nPalese's team has developed a universal flu vaccine that is now in the first phase of testing in humans, with support from GSK and the Gates Foundation. \"What changes in the influenza virus from year to year is the hemagglutinin (HA),\" Palese explained, \"which is the major protein against which we make an immune response.\" \nThe HA comprises a head and a stalk. \"When our immune system sees a flu virus, it makes antibodies against the head,\" he said. Palese's vaccine aims to stimulate antibodies that bind to the more \"conserved\" areas on the stalk and which remain the same every year and are common to most seasonal flu viruses. \"We want to redirect the body's immune response to the stalk.\" \nA different approach to the universal vaccine is under way at FluGen, a biotech firm in Madison, Wisconsin. Backed by both government and VC funding, the company is working with technology first discovered at the University of Wisconsin-Madison by Dr. Yoshihiro Kawaoka and Dr. Gabriele Neumann and exclusively licensed to FluGen. \"Our vaccine, called RedeeFlu, is based on a premise that says what happens if you take a [naturally occurring] 'wild type' of flu virus and modify it to infect the human body but don't allow it to replicate and cause illness,\" said Boyd Clarke, executive chairman of FluGen. (Coincidentally, his maternal grandfather died in the 1918 pandemic.) \nLast October, FluGen announced that it was awarded $14.4 million by the Department of Defense to conduct human clinical challenge trials with RedeeFlu. In those studies, half of the participants will be vaccinated and half will receive a placebo, but all will subsequently be infected with an influenza virus. \"We want to see if the vaccine prevents illness and replication of the virus,\" Clarke said. \"Based on pre-clinical trials, we have reason to be optimistic.\" \nOn another front, this year the Human Vaccines Project , a New York-based nonprofit consortium of academic, government and industry medical researchers, is launching the Universal Influenza Vaccine Initiative. \"The goal is to understand immunity to the flu and then convert that into a universal flu vaccine,\" said Dr. James Crowe, a pediatric infectious diseases physician at Vanderbilt University Medical Center in Nashville, Tennessee, and the director of UIVI. Similar to Palese's approach, UIVI is targeting the more stable stalk region of the HA protein. \nAlthough Crowe is dedicated to the eventual discovery of a universal vaccine, he also wants to focus on improving current vaccines. \"The excitement in the field is making better vaccines for strains that are killing people right now,\" he said. \"Even modest improvements would save thousands of lives.\" \n— By Bob Woods, special to CNBC.com Bob Woods Special to CNBC.com Related Securities ", "external_links": [], "published": "2018-01-09T17:53:00.000+02:00", "crawled": "2018-01-09T18:15:47.025+02:00", "highlightTitle": ""}