{"organizations": [], "uuid": "a0daa64d01376a27657b818844b64bfd92a3c87b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953444-Untitled-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/rising-hedge-fund-stars-are-crushing-the-market.html", "country": "US", "domain_rank": 767, "title": "Rising hedge fund stars are crushing the market, taking crown away from Einhorn, Ackman", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T13:00:00.000+02:00", "replies_count": 0, "uuid": "a0daa64d01376a27657b818844b64bfd92a3c87b"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/rising-hedge-fund-stars-are-crushing-the-market.html", "ord_in_thread": 0, "title": "Rising hedge fund stars are crushing the market, taking crown away from Einhorn, Ackman", "locations": [], "entities": {"persons": [{"name": "bill ackman", "sentiment": "negative"}, {"name": "david einhorn", "sentiment": "negative"}, {"name": "einhorn", "sentiment": "negative"}, {"name": "ackman adam jeffery", "sentiment": "negative"}, {"name": "chris goodney", "sentiment": "none"}, {"name": "joseph edelman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "perceptive advisors llc  edelman", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "perceptive life sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The torch is passed as the old hedge fund guard is losing its touch in the current market.\nA new generation of under-the-radar hedge fund stars are soundly outperforming more experienced, better-known managers such as David Einhorn and Bill Ackman.\nThe common thread among some of the best hedge fund performers is in-depth sector expertise.\nIn a stock market where 5 out of the 6 most valuable companies in the S&P 500 are technology firms, it's more important than ever to be an expert on rapidly changing technology trends and consumer tastes.\nJoseph Edelman's Perceptive Life Sciences fund surged 43.1 percent last year, according to a source familiar with the returns. In comparison, the S&P 500 rose 19 percent in 2017. The biotechnology specialist firm has $2.8 billion in assets.\nChris Goodney | Bloomberg | Getty Images Joseph Edelman, chief executive officer of Perceptive Advisors LLC Edelman explained why it is so important to have a deep understanding of the biotech sector to outperform the stock market.\n\"Our largest investment focus is on developmental-stage biotech companies, which requires both a strong scientific focus and knowledge base, as well as significant investment experience and a realistic appraisal of the chances of success,\" he told CNBC.\nEdelman further revealed how his firm analyzes companies to find the next great idea.\n\"We look at whether the mechanism of action of the drug makes sense for the disease being treated, as well as existing clinical and pre-clinical data. We believe that our knowledge, experience and investment process allows us to identify the most promising opportunities and size our positions appropriately,\" he added.\nIn similar fashion, technology-focused fund manager Alex Sacerdote of Whale Rock Capital, a firm with $2.5 billion under management, generated a stunning 36.2 percent return in 2017, according to Absolute Return.\n\nSacerdote also emphasized the importance of sector expertise for investing success in a 2015 interview with Graham & Doddsville.\n\"It can be tricky to invest in the tech sector. There is constant change, brutal competition, price deflation and often high and 'bubble' like valuations,\" he said. \"In the technology sector, it's important to be a specialist. … Finding that competitive advantage, understanding it, appreciating it before other people, and developing a more in-depth understanding of its strength are really important to us.\"\nWhile sector specialists are thriving, famous generalist value hedge fund managers are sputtering.\nEinhorn's Greenlight Capital fund returned a meager 1.6 percent in 2017, according to an investor letter. And Ackman's Pershing Square declined 4 percent last year, according to its website .\nPart of the reason may be the rise of computerized trading. The quantitative-oriented funds could be taking the low-hanging, numbers-based valuation opportunities away. \n\nEinhorn tried to explain that his fund's current underperformance was due to a temporary phase in the stock market.\n\"Despite it being a good year in the market, it was a challenging environment for our investment style,\" he wrote in a note to clients Tuesday. \"We have a value orientation and we take comfort from the margin of safety afforded by the low valuations of our long investments … while we certainly don't believe value investing is dead, it is clearly out of favor at the moment.\"\nValue investing may be out of favor, but it is clear the market is rewarding sector expertise.\nSpokespersons for Whale Rock and Perceptive declined to comment on fund performance for this story.", "external_links": [], "published": "2018-01-19T13:00:00.000+02:00", "crawled": "2018-01-19T13:15:50.009+02:00", "highlightTitle": ""}