{"organizations": [], "uuid": "2d118c920e5cae4b327f9b13cdb02d5daa477729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/06/103614020-einhornackman.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001135/device/rss/rss.html", "section_title": "Stock Picks", "url": "https://www.cnbc.com/2018/01/23/wall-streets-star-activists-stumbled-in-2017.html", "country": "US", "domain_rank": 767, "title": "Hedge fund industry's stars are stumbling as stock picks and proxy fights fizzle", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T21:31:00.000+02:00", "replies_count": 0, "uuid": "2d118c920e5cae4b327f9b13cdb02d5daa477729"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/wall-streets-star-activists-stumbled-in-2017.html", "ord_in_thread": 0, "title": "Hedge fund industry's stars are stumbling as stock picks and proxy fights fizzle", "locations": [], "entities": {"persons": [{"name": "bill ackman", "sentiment": "negative"}, {"name": "scott eells", "sentiment": "negative"}, {"name": "adam jeffrey", "sentiment": "negative"}, {"name": "david einhorn", "sentiment": "negative"}, {"name": "nelson peltz", "sentiment": "none"}], "locations": [{"name": "pershing square", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "hfr", "sentiment": "none"}, {"name": "greenlight capital", "sentiment": "none"}, {"name": "trian fund management", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "14 Mins Ago | 02:03 \nIt's not easy being famous. \nAt least that was the case in 2017, when some of Wall Street's brand-name hedge-fund activists underperformed not only their peers but the rest of the hedge-fund industry and the market as a whole. \nBill Ackman's Pershing Square comes to mind, posting losses of 4 percent last year, the third consecutive negative year. But there's also David Einhorn's Greenlight Capital, up about 1.6 percent and Nelson Peltz's Trian Fund Management, up 3.7 percent, to name a few. \nThat compares with a 19.4 percent jump in the S&P 500 , an 8.5 percent gain in HFR's weighted composite index of hedge-fund returns, and a 4 percent gain in HFR's index of activist investors. \nHedge-fund activists typically manage concentrated portfolios, buying enough stock to push for changes at their selected target companies. Activist campaigns typically aim to remake boards with new directors or push for larger transformations like a sale or CEO change. Their leverage stems from the potential for a proxy fight — the activist appeals to shareholders to elect their own nominees to a company's board. \nBut with a long-biased strategy that's equity-focused, how did these stars manage to underperform so dramatically in 2017? Part of it has to do with stock picking. And part of it has to do with size. \n\"They have such large amounts of capital at their disposal that they had to invest a certain amount of money, which led them to a certain market cap,\" said Josh Black, editor of Activist Insight. \"Generally to win support from the institutional investor community, you have to be focused on operations or something that can enhance long-term value, rather than a short-term breakup or capital allocation.\" \nTake Trian, for example. As of the end of the third quarter, the firm had only eight long positions, according to its quarterly regulatory filing. All but two were stakes worth more than $1 billion. One of those was General Electric , a stock that was down about 45 percent during 2017. \nNot counting GE, Trian was up about 10 percent for the year, according to a person with knowledge of the matter. That still fell short of the gain in the S&P. \nIt was a similar story with Greenlight, which has long and short stakes, or bets that a stock will drop. The firm said its \"bubble basket\" of short positions -- including Amazon , Athenahealth, Netflix and Tesla -- dragged down returns for the firm. Instead of falling, the stocks rose. \nAckman has been undergoing a unique set of challenges. Pershing took a $4 billion loss on its stake in Valeant Pharmaceuticals. A Pershing short, Herbalife, gained 41 percent, while Chipotle, in which Pershing Square is long, plummeted 23 percent. \nAs a result, Ackman is refocusing the firm, announcing last Friday that he would be laying off 10 people -- one investment professional and the rest from the operational side of the firm, according to a person with knowledge of the matter. Reuters earlier reported the layoffs. Ackman plans to spend more time investing and less time marketing in the new year, the person said. \nJana Partners' activist strategy is a bit more nuanced. The firm, led by Barry Rosenstein, has a main fund that's only about one-third invested in an activist-oriented strategy and produced a return of about 5.6 percent in 2017. \nJana also has a fund, with about $1.5 billion in capital, that focuses on activism and that was up about 22 percent, according to a person with knowledge of the matter. \nThird Point's Dan Loeb produced returns of 18.1 percent last year, according to a letter obtained by CNBC. Loeb credits the performance to a switch he began in 2009 from generalist analysts to sector or asset-class specialists. That includes a specialist short-selling team, which posted absolute returns of 13 percent. \nUnlike his star-powered peers, Loeb didn't wage any major activist pushes in 2017, aside from some public comments about Nestle. But Trian essentially tied a proxy fight at P&G (and P&G ultimately gave him the board seat after several rounds of recounts), Pershing Square lost its fight at ADP and Greenlight lost its fight at General Motors. \nUp-and-coming and lesser known activists were able to produce better results, by and large. Marcato, led by Mick McGuire, generated 25.6 percent returns last year. Voce Capital, led by Dan Plants, jumped 19 percent, while Scott Ferguson's Sachem Head and Jonathan Litt's Land & Buildings each returned about 13 percent.", "external_links": [], "published": "2018-01-23T21:31:00.000+02:00", "crawled": "2018-01-23T21:57:34.003+02:00", "highlightTitle": ""}