{"organizations": [], "uuid": "73504f441b13cf87b210a6c9394305b9819b4eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965301-GettyImages-684746896.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/how-billionaire-richard-branson-is-training-to-get-unbelievably-fit.html", "country": "US", "domain_rank": 767, "title": "How Richard Branson is keeping up with his goal to 'get unbelievably fit'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T20:25:00.000+02:00", "replies_count": 0, "uuid": "73504f441b13cf87b210a6c9394305b9819b4eab"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/how-billionaire-richard-branson-is-training-to-get-unbelievably-fit.html", "ord_in_thread": 0, "title": "How Richard Branson is keeping up with his goal to 'get unbelievably fit'", "locations": [], "entities": {"persons": [{"name": "justin sullivan", "sentiment": "neutral"}, {"name": "richard branson", "sentiment": "neutral"}, {"name": "branson", "sentiment": "none"}, {"name": "mont rochelle", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "virgin sport", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Self-made billionaire Richard Branson is a jet-setter constantly on the move, but that isn't stopping him from meeting the goals he set for himself this year.\n\"My New Year's resolution is to get unbelievably fit so I'm ready for a trip into space, so I'm making sure I'm keeping active even while traveling,\" Branson said in a recent blog post .\nIn October of last year, Branson told CNBC's \"Squawk Box\" that he expected to travel to space by April or May or else he'll be disappointed.\nDuring his recent travels to Mont Rochelle, a Virgin-owned estate located just outside of Cape Town, Branson got up early each morning for a \"hard game of tennis\" with a manager there. Branson pointed out that while he would normally enjoy a small glass of wine from the estate's vineyard, he had to opt out.\ntweet \n\"This time around I stuck to soft drinks as I'm also taking part in dry January and not drinking alcohol for the month,\" Branson said.\nHe also hiked Table Mountain and biked around Cape Town.\nEarlier this month, Branson shared his resolution for 2018:\nI'll be doing lots of trekking and biking to get me into top shape. When I finished the Virgin Strive Challenge in 2016 I felt like a 25-year-old again – I hadn't felt that good in 40 years. I'll also be doing some centrifuge g-force training so I'm as acclimatized as I can be for the journey.\nDuring an interview with Esquire editor-in-chief Jay Fielden last year, Branson said Virgin Galactic had been 12 years in the making and had taken \"lots of tears and hard work, but we're nearly there.\"\nBranson envisions the initial journeys will be brief and take about three and half hours. \"You'll go into space, we've got big windows to unbuckle, float about, become an astronaut,\" he said.\nDespite the challenge of preparing for his flight, Branson said the main step he is taking is to remain active.\n\"Fortunately, I'm a great believer in keeping fit and healthy,\" Branson said. The billionaire begins and ends his days with his favorite sports.\n#kitesurfing #neckerisland Image by Brahm Van Der Hoeven \nA post shared by Richard Branson (@richardbranson) on May 14, 2017 at 1:39am PDT \nWhen Branson isn't traveling, he said he wakes up every morning, plays a game of singles tennis, sometimes goes kite surfing and plays tennis again in the evening.\nEven at 67, Branson's penchant for daily exercise not only prepare him for space travel, but it's also his trick to being more productive every day. Along with other activities like running and cycling, Branson has said working out helped him get where he is today.\n\"I definitely can achieve twice as much by keeping fit,\" Branson tells FourYourBodyPress . \"It keeps the brain functioning well.\" \nThe other step Branson said that he has been taking to prepare for his trip is centrifuge or \"high-G\" training. A human centrifuge spins at a high enough speed to simulate the feeling of gravity during a space mission and helps prevent future bodily damage. In 2009, he was seen training at the NASTAR Center, even pumping his fist while doing so. \n\"You actually replicate how your body is going to feel as you go from north of 3000 miles an hour in seconds, so that's quite a thrust heading up,\" Branson said.\n\"It's so important to go through that so that when you actually go into space, you just lie back and enjoy the whole experience,\" he said at the time. \n\"I think I'm ready for it and obviously I've waited a long time for it so I'm thoroughly looking forward to it.\"\nLike this story? Like CNBC Make It on Facebook . \nDon't miss:\n\nActor Will Smith in viral video: 'Failure is a massive part of being able to be successful' These are the top 10 best countries in the world show chapters Elon Musk reveals his plan to send passengers anywhere on Earth in under 60 minutes, for the price of a plane ticket      12:57 PM ET Fri, 29 Sept 2017 | 01:05 This is an updated version of a previously published story .", "external_links": [], "published": "2018-01-24T20:25:00.000+02:00", "crawled": "2018-01-24T20:36:24.015+02:00", "highlightTitle": ""}