{"organizations": [], "uuid": "ff7e32a4e398ec0238e6ee75c0d7382231f1cb9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941856-GettyImages-903554694-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/white-house-doesnt-deny-that-president-trump-referred-to-haiti-african-nations-as-s--hole-countries.html", "country": "US", "domain_rank": 767, "title": "White House doesn't deny that President Trump referred to Haiti, African nations as 's---hole' countries", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T00:20:00.000+02:00", "replies_count": 0, "uuid": "ff7e32a4e398ec0238e6ee75c0d7382231f1cb9a"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/white-house-doesnt-deny-that-president-trump-referred-to-haiti-african-nations-as-s--hole-countries.html", "ord_in_thread": 0, "title": "White House doesn't deny that President Trump referred to Haiti, African nations as 's---hole' countries", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "erna solberg", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "washington post", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 01:17 \nPresident Donald Trump referred to Haiti and African nations as \"s---hole countries\" in a meeting with lawmakers, a Democratic aide briefed on the matter told NBC News. \nThe Washington Post first reported the news, citing two people briefed on the meeting. The newspaper said that lawmakers had convened with the president in the Oval Office on Thursday to discuss a bipartisan immigration deal. \nWhen lawmakers brought up protections for immigrants from Haiti, El Salvador and African countries, Trump asked, \"Why are we having all these people from s---hole countries come here?\" \nThe president then said that the U.S. should let in more people from countries like Norway. Trump met with Norwegian Prime Minister Erna Solberg on Wednesday. \nOn Monday, the Trump administration said that they would be ending the Temporary Protected Status designation for Salvadorans. It made a similar announcement for Haiti in November. \nTPS is a humanitarian program which allows citizens from other countries to temporarily remain in the U.S. This special designation is given to people from countries that are undergoing hardships like armed conflict or recovery from natural disasters. \nWhen reached for comment, the White House said in a statement that the president \"will only accept an immigration deal that adequately addresses the visa lottery system and chain migration – two programs that hurt our economy and allow terrorists into our country.\" \nThe White House's statement did not deny that the president made those remarks. \n\"Certain Washington politicians choose to fight for foreign countries, but President Trump will always fight for the American people. The President will only accept an immigration deal that adequately addresses the visa lottery system and chain migration – two programs that hurt our economy and allow terrorists into our country. Like other nations that have merit-based immigration, President Trump is fighting for permanent solutions that make our country stronger by welcoming those who can contribute to our society, grow our economy and assimilate into our great nation. He will always reject temporary, weak and dangerous stopgap measures that threaten the lives of hardworking Americans, and undercut immigrants who seek a better life in the United States through a legal pathway.\" \nThis is breaking news. Please check back for updates. ", "external_links": [], "published": "2018-01-12T00:20:00.000+02:00", "crawled": "2018-01-12T00:36:57.004+02:00", "highlightTitle": ""}