{"organizations": [], "uuid": "84d0bba77def1ef6ba1eeffe8906de00ffeadad5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936840-New_York_cityscape.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/the-cities-with-the-10-highest-starting-salaries-in-2018.html", "country": "US", "domain_rank": 767, "title": "The cities with the 10 highest starting salaries in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T17:21:00.000+02:00", "replies_count": 0, "uuid": "84d0bba77def1ef6ba1eeffe8906de00ffeadad5"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/the-cities-with-the-10-highest-starting-salaries-in-2018.html", "ord_in_thread": 0, "title": "The cities with the 10 highest starting salaries in 2018", "locations": [], "entities": {"persons": [{"name": "jan hatzius", "sentiment": "none"}, {"name": "alexander spatari", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "jersey city", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "national association of colleges and employers", "sentiment": "none"}, {"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The new year brings new promise for job seekers.Though job creation slowed by 6 percent in 2017, most recent figures from the Bureau of Labor Statistics indicates that unemployment is just 4.1 percent, and the National Association of Colleges and Employers reports that employers expect to hire 4 percent more members of the Class of 2018 than they did from the class of 2017.\nDespite the strength of the economy, wages have not been significantly impacted. Goldman Sachs' Chief Economist Jan Hatzius tells CNBC that 2018 might be the year that workers finally get a raise. But some cities have higher starting salaries than others.\nWalletHub compared over 180 U.S. cities across 26 key indicators in order to calculate which were the best places for job seekers . They found that in 10 cities salaries for early-career employees were sky high. They adjusted this figure for the cost of living to calculate monthly average starting salary.\nCheck out the 10 cities with the highest starting salaries:\nAlexander Spatari | Getty Images New York skyline 10. Jersey City, NJ (tie) Monthly average starting salary: $3,477\n10. Newark, NJ (tie) Monthly average starting salary: $3,477\n10. New York, NY (tie) Monthly average starting salary: $3,477\n10. Yonkers, NY (tie) Monthly average starting salary: $3,477\n9. Boston, MA Monthly average starting salary: $3,863\nshow chapters Why Detroit, Phoenix and Cleveland are among the top cities for business travel in America 3:54 PM ET Thu, 13 July 2017 | 01:18 7. Seattle, WA (tie) Monthly average starting salary: $4,067\n7. Tacoma, WA (tie) Monthly average starting salary: $4,067\n6. Bridgeport, CT Monthly average starting salary: $4,082\n5. Washington, D.C. Monthly average starting salary: $4,637\nshow chapters Best cities for start-ups 3:31 PM ET Tue, 28 July 2015 | 01:25 2. Fremont, CA (tie) Monthly average starting salary: $4,680\n2. Oakland, CA (tie) Monthly average starting salary: $4,680\n2. San Francisco, CA (tie) Monthly average starting salary: $4,680\n1. San Jose, CA Monthly average starting salary: $5,441\nDenis Tangney Jr. | Getty Images Downtown San Jose San Jose, CA topped WalletHub's list with a monthly average starting salary of $5,441. With roughly 1 million residents, San Jose is the third largest city in California and the largest city in Silicon Valley. High-paying tech companies like Adobe, Cisco and eBay call San Jose home .\nSeveral other Californian cities cracked the top 10 including San Francisco and Oakland where the average starting salary is $4,680 a month.\nDavid Bjerk , Economics professor at Claremont McKenna College is cautiously optimistic that wages will see a boost in the new year.\n\"The economy seems strong, but I think uncertainty is also high. The unemployment rate has fallen about as low as it can go, so there may be hope that wages will finally start to respond and creep up,\" he tells WalletHub . \"However, a stock market plunge or rash decisions coming from the current administration do not seem out of the question, which may substantially change the state of the job market.\"\nLike this story? Like CNBC Make It on Facebook\nDon't miss:\nThe best and worst jobs for 2018 10 cities with booming employment growth in 2017 The 10 best places to find a job in 2018 show chapters Here are the 10 best cities to start your career 6:00 PM ET Tue, 30 May 2017 | 00:51", "external_links": [], "published": "2018-01-10T17:21:00.000+02:00", "crawled": "2018-01-10T17:47:35.009+02:00", "highlightTitle": ""}