{"organizations": [], "uuid": "c041d5e666a6fc39f81fe402251df06566b254c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "How Tech Firms Are Embracing Ex-Prisoners – Fortune", "url": "http://fortune.com/2018/01/20/coding-jobs-prisoners-employment/", "country": "US", "domain_rank": 1196, "title": "How Tech Firms Are Embracing Ex-Prisoners", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T15:00:00.000+02:00", "replies_count": 0, "uuid": "c041d5e666a6fc39f81fe402251df06566b254c7"}, "author": "Jennifer Alsever", "url": "http://fortune.com/2018/01/20/coding-jobs-prisoners-employment/", "ord_in_thread": 0, "title": "How Tech Firms Are Embracing Ex-Prisoners", "locations": [], "entities": {"persons": [{"name": "richard bronson", "sentiment": "negative"}, {"name": "bronson", "sentiment": "none"}, {"name": "leonardo dicaprio", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "stratton oakmont", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Bronson made millions on Wall Street in the 1990s, but by 2005 he found himself destitute with no home and no money--and only his sister's couch on which to sleep. No one would give him a job or even entertain the idea. \"I tried to put the past behind me, but doors were slamming in my face,\" says Bronson.\nThe event that turned him into a pariah? A two-year stint in federal prison for securities fraud that followed Bronson's time as a partner at the infamous Stratton Oakmont brokerage firm, dramatized in the movie The Wolf of Wall Street , starring Leonardo DiCaprio. Eventually, nine years after his release from prison, Bronson landed a job at a nonprofit in New York that aimed to help ex-convicts get back on their feet. There he learned that, as a white male with a college education, his reentry into society was easier than most--especially compared with people of color with no education. Says Bronson: \"As long as there's the Internet to search, you're walking around with a life sentence.\"\nThat mindset is changing as the number of people coming out of prisons grows--600,000 released from state prisons each year and 11 million from jails--and jobs go unfilled. Add to that the fact that the U.S. spends $87 billion a year imprisoning 2.24 million people--and at least half of them get arrested again within eight years of release.\nContributing to their struggle is the challenge of getting hired. Nearly half of employers still ask for criminal history on job applications, according to a 2017 survey by Sterling Talent Solutions, a firm specializing in employee background checks.\nIn 2016, more companies including Facebook fb , Google googl , and Koch Industries made public their promise to consider hiring people with criminal records as part of former President Obama's Fair Chance Pledge. Bronson jumped in to help them.\nLast year he launched 70MillionJobs , a for-profit recruiting firm for people with a criminal record. The startup graduated from the Silicon Valley accelerator Y Combinator, landed $650,000 from investors, and hired seven employees to achieve its ambitious goal: finding jobs for 1 million of the 70 million Americans with a criminal past. (For more on the changing job market, see this issue's cover stories.)\nWhat's happening in Silicon Valley with 70MillionJobs is part of an important shift occurring nationwide .\nIn Denver, for instance, Mile High -WorkShop wants to be the first employer of record for a string of former inmates. Inside a 12,000-square-foot warehouse, those employees handle woodworking, sewing, and order fulfillment, and they manufacture ceramic components for up to 100 clients including CoorsTek, Meier Skis, and Cora, a feminine-products company. Ideally, employees get not only work but also the life skills and references needed to get another full-time job. In just two years, 50 people have moved through the company, with half finding permanent employment; just two have re-offended.\nIn San Francisco, husband-and-wife tech veterans Beverly Parenti and Chris Redlitz have been training prisoners to be coders and entrepreneurs--even before they get out of prison. Their nonprofit, the Last Mile , teaches software programming, design, and entrepreneurship in four California prisons--using computers without Internet access. Over the course of four years, a string of local tech executives and entrepreneurs have come in as guest speakers, garnering connections that have led to higher-paying jobs when prisoners are released. Those enrolled in the group's web development shop inside San Quentin State Prison do design work for businesses while still behind bars, building their portfolios, references, and cash for when they get out.\nGuest speaker Joseph Cureton (seated) shows Rowdy Orbit Impact participants how to use Google Chrome to inspect lines of code. Courtesy of Rowdy Orbit To participate, prisoners must have 18 to 36 months of good behavior before applying and must have their GED, take appropriate math and algebra classes, write an essay, take a logic test, and agree to an in-person interview. None of the 320 people trained have returned to prison in the past eight years, says Parenti, and many have landed jobs inside tech companies after their release.\n\"They go on to be some of the best employees because they're loyal and grateful, and they bring that drive and spirit,\" says Parenti. She intends to expand the Last Mile into three more California prisons and one Indiana prison this year.\nThe same philosophy is being applied in Baltimore, where a company called Rowdy Orbit Impact is training a dozen black and Latino ex-prisoners for programming and quality assurance tech jobs. The yearlong program includes wraparound social services that teach professionalism and life skills they may have lacked growing up. Rowdy Orbit Impact will then place those people into jobs that might pay $40,000 a year to start. Software platform GitHub is developing the curriculum.\nFor Rowdy Orbit founder Jonathan Moore the mission is to make people of color with criminal pasts feel confident in a business environment. \"You get tired of people looking at you and treating you different because of what they see on the news,\" he says.\n\"Some of these guys, their whole life people have been telling them they aren't anything. We're telling them they're an asset.\"\nA version of this article appears in the Feb. 1, 2018 issue of Fortune with the headline “Out of Prison and Into the Valley.” ", "external_links": [], "published": "2018-01-20T15:00:00.000+02:00", "crawled": "2018-01-20T15:00:34.004+02:00", "highlightTitle": ""}