{"organizations": [], "uuid": "86c08d6da86e3cf478639a356676302276450f6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/21/104664652-GettyImages-521516194.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/picking-the-best-529-college-saving-plan-is-about-more-than-tax-breaks.html", "country": "US", "domain_rank": 767, "title": "Big mistake: Choosing a college savings plan based solely on state tax breaks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:37:00.000+02:00", "replies_count": 0, "uuid": "86c08d6da86e3cf478639a356676302276450f6f"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/picking-the-best-529-college-saving-plan-is-about-more-than-tax-breaks.html", "ord_in_thread": 0, "title": "Big mistake: Choosing a college savings plan based solely on state tax breaks", "locations": [], "entities": {"persons": [{"name": "jonah gruda", "sentiment": "none"}], "locations": [{"name": "district of columbia", "sentiment": "none"}, {"name": "mazars usa", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES The Washington Post | Getty Images \nIf you're choosing your college savings plan based solely on state tax breaks, then you're doing it wrong. \nMore than 30 states, plus the District of Columbia, offer state tax breaks to residents for contributions to a 529 plan — the college savings account families use to save and pay for education on a tax-free basis. Indeed, 45 percent of parents said in-state tax incentives were a factor in their 529 plan selection, according to a survey from Strategic Insight. \nBut as convenient as it may be to invest in your state's plan just for the tax break, experts actually warn against it. \nOther factors matter, too, especially now that the Tax Cuts and Jobs Act allows families to tap a 529 plan to cover up to $10,000 in private elementary and high school expenses each year. As of Sept. 30, 2017, these plans held $282.2 billion in assets, Strategic Insight found. \"Deductions are great, but they may not be worth anything if your state's plan charges a lot of fees.\" -Jonah Gruda, Mazars USA \nImportant to note: You can choose any state's plan . There is no requirement that you invest in your home state's 529 plan. \nFamilies residing in states that have no income tax, that don't offer a deduction for contributions, or that give a tax break regardless of whether investors choose the home state's plan, all have good reasons to look elsewhere. So may families whose state offers a break on contributions, but has high plan fees. \n\"Deductions are great, but they may not be worth anything if your state's plan charges a lot of fees,\" said Jonah Gruda, a certified public accountant and partner at Mazars USA in New York. \n\"If there's no tax incentive, then find the plan that's the cheapest and has the most investment options,\" he said. \"Those two are the biggest factors.\" \nHere's what to think about. Investment management \nFull exposure to the stock market — especially when it's hitting new highs every day — probably isn't appropriate if your child is two years away from starting college. But it might make sense to take that risk if you're just opening an account for your six-month-old child and you have 18 years to let your savings grow. \nGenerally, 529 plans offer age-based portfolios, which start off with high equity exposure early on in a child's life and then become more bond-centric and conservative as the college start date approaches. Tom Merton | Getty Images \nSome portfolios slash their equity exposure by 20 to 25 percent in one day as they move toward more conservative allocations, said Leo Acheson, a senior analyst at Morningstar. Such moves are risky if they occur when the market is plummeting. \n\"In the past you had these big step-downs in equity exposure, but more plans are smoothing their exposure to stocks and bonds and making it gradual,\" said Acheson. \nIf you're using your 529 plan to cover private K-12 costs, take a second look at your asset allocation: A shorter time frame may call for less equity risk. Fees \nIf you're spending less money on account fees and fund costs, then more of your contribution is actually being invested. \nCosts you may cover include enrollment and maintenance fees, as well as fund expenses. Investment expenses can vary sharply from one plan to the next. \nConsider that costs for the age-based portfolios in the Utah Educational Savings Plan range from 0.17 percent to 0.60 percent, while the NJ Best 529 College Savings Plan has fees between 0.41 percent and 0.91 percent. Advisor-sold or direct \nYou can't address costs without considering advisor-sold plans versus direct-sold plans. \nAs families become more fee-conscious , an increasing number of 529 assets are flowing toward 529 plans you can purchase directly — that is, without the aid of a financial advisor. (See chart below.) \nIt varies as to whether the advisor's guidance is worth a commission or a separate fee for planning. \n\"Direct-sold plans are simpler generally because you have a direct investor buying the index,\" said Acheson of Morningstar. \n\"Advisor-sold plans tend to have more active underlying managers and higher fees,\" he said. \nWhen shopping for a 529 plan, be sure to compare advisor-sold plans to one another and direct-sold plans to one another, Acheson said. (See charts below for Morningstar's top 10 direct-sold and advisor-sold plans.) Direct-Sold Plans", "external_links": [], "published": "2018-01-18T20:37:00.000+02:00", "crawled": "2018-01-18T20:47:18.081+02:00", "highlightTitle": ""}