{"organizations": [], "uuid": "d33e7e08f687f8aba803da28e971910e95a3d718", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/03/26/101527588-184101442.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/how-to-explain-a-layoff-in-your-next-job-interview.html", "country": "US", "domain_rank": 767, "title": "How to explain a layoff in your next job interview", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T17:36:00.000+02:00", "replies_count": 0, "uuid": "d33e7e08f687f8aba803da28e971910e95a3d718"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/how-to-explain-a-layoff-in-your-next-job-interview.html", "ord_in_thread": 0, "title": "How to explain a layoff in your next job interview", "locations": [], "entities": {"persons": [{"name": "joshua hodge", "sentiment": "negative"}, {"name": "zippia", "sentiment": "none"}, {"name": "jason hanold", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hanold associates", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bureau of labor statistics job openings and labor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joshua Hodge Photography | E+ | Getty Images SHARES \nGetting laid off from work is never an easy thing to process. In addition to your finances taking a hit, you might dread the idea of having to answer common interview questions about why you want to leave your current company or why you're looking for a new job. \nAccording to career resource site Zippia , if you find yourself in this position at the top of the year you are far from alone. Using data from the Bureau of Labor Statistics Job Openings and Labor Turnover survey, Zippia found January to be the month where companies do the most firings and layoffs. \nJason Hanold, CEO and managing partner of Chicago-based executive recruitment firm Hanold Associates , tells CNBC Make It that there are a number of factors that create this January phenomenon. show chapters 8:55 AM ET Tue, 12 Sept 2017 | 01:48 \n\"Part of it reflects a business cycle where you have new budgets that are being put in place and year-end results,\" he says. \"Another part is the so-called 'compassionate layoffs,' where companies think they are doing someone a favor by not firing them before or during the holiday season. Instead, they fire them after the holidays because they think it's a little less emotionally challenging.\" \nRegardless of when a layoff happens, explaining your circumstance to a hiring manager can be an uncomfortable discussion. But rather than fudging the truth, Hanold says you should be completely transparent in an interview about why you're in a position of transition. \n\"You may feel embarrassed to be in that state, but what is difficult for most individuals to realize is that if they were a part of any business decision, it's not personal and is moreso a reflection of the health of the business,\" he says. \nTo start, Hanold says you should make sure your resume is updated with the correct beginning and end date of your most recent position. If not, potential employers can easily discover during the hiring process that you're being dishonest. show chapters 8:57 AM ET Tue, 10 Oct 2017 | 01:44 \n\"It usually comes out when someone says, 'When can we get you in for an interview?' and a candidate will respond saying 'any time' because they are unemployed,\" says Hanold. \"A hiring manager will then look at the resume and see it isn't up to date and start to think what else may they be lying about.\" \nHanold also says that unemployment can sometimes work to your advantage. He's worked with companies like Amazon, Blue Apron and Groupon, and says that in his experience, most companies appreciate a candidate that can start right away. \nBestselling management author and CNBC contributor Suzy Welch agrees that it's essential to be transparent. When asked by an employer about your reason for leaving your current job, she says you absolutely shouldn't fabricate an answer. \n\"Don't make up a story,\" Welch says. \"I've said it before, and I'll say it again: Lying is never good.\" \nInstead, she says you should deliver a response that shows how forward-thinking you are by discussing your future plans with the company. \n\"Turn the conversation towards why you want to join the new company,\" she adds. \"Explain why this job is so right for your skills, your values and your career goals.\" ", "external_links": [], "published": "2018-01-23T17:36:00.000+02:00", "crawled": "2018-01-23T18:06:04.007+02:00", "highlightTitle": ""}