{"organizations": [], "uuid": "aa76fab59761ca8e0204b1a4c24c30f9f749343c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/31/104683480-RTSCNAI-UBS.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/us-regulators-to-fine-ubs-deutsche-bank-hsbc-for-spoofing-and-manipulation-sources.html", "country": "US", "domain_rank": 767, "title": "US regulators to fine UBS, Deutsche Bank, HSBC for 'spoofing' and manipulation", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T14:02:00.000+02:00", "replies_count": 0, "uuid": "aa76fab59761ca8e0204b1a4c24c30f9f749343c"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/us-regulators-to-fine-ubs-deutsche-bank-hsbc-for-spoofing-and-manipulation-sources.html", "ord_in_thread": 0, "title": "US regulators to fine UBS, Deutsche Bank, HSBC for 'spoofing' and manipulation", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "bern", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ubs", "sentiment": "negative"}, {"name": "deutsche bank", "sentiment": "negative"}, {"name": "hsbc", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "mins ago ruben sprich | reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. derivatives regulator is set to announce it has fined European lenders UBS , HSBC , and Deutsche Bank millions of dollars each for so-called spoofing and manipulation in the U.S. futures market, three people with direct knowledge of the matter told Reuters.\nThe enforcement action by the Commodity Futures Trading Commission (CFTC) is the result of a multiagency investigation that also involves the Department of Justice (DoJ) and the Federal Bureau of Investigation (FBI) — the first of its kind for the CFTC, the people said.\nThe fines for UBS and Deutsche Bank will be upward of $10 million, while the fine for HSBC will be slightly less than that, the people said, without providing exact figures.\nSpokesmen for HSBC, Deutsche Bank, and UBS declined to comment.\nSpoofing involves placing bids to buy or offers to sell futures contracts with the intent to cancel them before execution. By creating an illusion of demand, spoofers can influence prices to benefit their market positions.\nSpoofing is a criminal offense under a provision implemented as part of the 2010 Dodd-Frank financial reform.\nSome of the manipulative behavior came to light as a result of the authorities' previously-settled probes into forex market manipulation while UBS self-reported the wrongdoing, according to two of the people with knowledge of the matter.\nThe bank investigations have been ongoing for more than a year, one of the people said.\nThe settlement is the most high-profile brought so far by the CFTC's head of enforcement James McDonald who was appointed to the role in March 2017.\nMcDonald, who was previously a prosecutor in the Southern District of New York, said in September he plans to encourage companies and staff to report their own wrongdoing and cooperate with investigators, a strategy he hopes will make it easier to prosecute more individuals.\nIn August, a U.S. appeals court upheld the conviction of former New Jersey-based high-speed trader Michael Coscia who was the first individual was the first person to be criminally prosecuted for the manipulative trading practice.\nA spokeswoman for the CBOE, one of the U.S.'s major futures exchanges, declined to comment. A spokeswoman for the CME Group , the other major futures bourse, did not immediately respond to a request for comment.", "external_links": [], "published": "2018-01-29T14:02:00.000+02:00", "crawled": "2018-01-29T14:11:23.000+02:00", "highlightTitle": ""}