{"organizations": [], "uuid": "ff74e20b88d4908abe4f0f963746bcd695ad5647", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/09/25/103026464-RTX1SFF7.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/06/pope-dont-be-misled-by-making-money-and-career-your-life.html", "country": "US", "domain_rank": 767, "title": "Pope warns on being misled by the pursuit of money", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-06T14:17:00.000+02:00", "replies_count": 0, "uuid": "ff74e20b88d4908abe4f0f963746bcd695ad5647"}, "author": "", "url": "https://www.cnbc.com/2018/01/06/pope-dont-be-misled-by-making-money-and-career-your-life.html", "ord_in_thread": 0, "title": "Pope warns on being misled by the pursuit of money", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "francis", "sentiment": "none"}, {"name": "pope francis", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "st. peter's basilica", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "mins ago tony gentile | reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pope Francis advised against making the pursuit of money, a career or success the basis for one's whole life, urging people in his Epiphany remarks Saturday to also resist \"the inclinations toward arrogance, the thirst for power and for riches.\"\nFrancis said during a homily at Mass in St. Peter's Basilica that people \"often make do\" with having \"health, a little money and a bit of entertainment.\"\nHe urged helping the poor and others in need of assistance, giving freely without expecting anything in return.\nMany Christians observe Epiphany to recall the three wise men who followed a star to find baby Jesus. Francis suggested asking \"what star we have chosen to follow in our lives.\"\n\"Some stars may be bright, but do not point the way. So it is with success, money, career, honors and pleasures when these become our lives,\" the pope said. That path, he continued, won't ensure peace and joy.\nLater, during an appearance from his studio window overlooking St. Peter's Square, Francis told tens of thousands of faithful gathered below that some Christians prefer to live while indifferent to Jesus.\n\"Instead of conducting themselves in coherence with their own Christian faith, they follow the principles of the world, which lead to satisfying the inclinations toward arrogance, the thirst for power and for riches,\" Francis said.\nHe prayed that instead that \"the world makes progress down the path of justice and of peace.\"\nFrancis noted that some Eastern Rite Catholic and Orthodox churches are celebrating Christmas this weekend. In expressing cordial wishes to these believers, Francis added, \"May this glorious celebration be a source of new spiritual vigor and of communion among us Christians.\"\nHe also recalled the traditions such as in Poland, where many families join in processions recalling the three wise men. In some countries, Epiphany and not Christmas, is the holiday occasion to exchange gifts among loved ones.", "external_links": [], "published": "2018-01-06T14:17:00.000+02:00", "crawled": "2018-01-06T15:04:48.012+02:00", "highlightTitle": ""}