{"organizations": [], "uuid": "6a372c497e03659092cd81c92f3b686d5d74c05d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955616-Amazon.com_founder.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/amazon-will-turn-over-third-party-seller-tax-data-to-massachusetts.html", "country": "US", "domain_rank": 767, "title": "Amazon gives in to Massachusetts tax officials and agrees to turn over third-party seller data", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T22:48:00.000+02:00", "replies_count": 0, "uuid": "6a372c497e03659092cd81c92f3b686d5d74c05d"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/amazon-will-turn-over-third-party-seller-tax-data-to-massachusetts.html", "ord_in_thread": 0, "title": "Amazon gives in to Massachusetts tax officials and agrees to turn over third-party seller data", "locations": [], "entities": {"persons": [{"name": "jeffrey dastin", "sentiment": "negative"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "amazon.com", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Jeffrey Dastin | Reuters An employee collects items ordered by Amazon.com customers through the company's two-hour delivery service Prime Now in a warehouse in San Francisco, December 20, 2017. \nSome Amazon sellers could soon get calls from Massachusetts state officials asking for unpaid sales taxes. \nOn Tuesday, Amazon notified its marketplace sellers that the company has agreed to hand over important merchant information to the state of Massachusetts — including their federal tax ID numbers and the estimated value of inventory stored in Amazon's warehouses in that state. \nThe move — which is the first public case of Amazon handing over seller data to state tax officials — will help the state of Massachusetts identify which Amazon sellers may owe them unpaid sales taxes. \nIt could also mean incredible headaches for the majority of third-party sellers who never comply with various state laws on sales tax collection — if more states follow Massachusetts and demand unpaid taxes from those sellers. \nAmazon currently collects sales tax on that products it sells directly, but leaves it up to sellers on the platform to handle their own tax collection. Those independent sellers are responsible for charging sales tax in any state where they have a physical presence, including the states where they store their products. \nIn the notice to sellers, viewed by CNBC, Amazon said it would share the information with Massachusetts by January 26, 2018. Amazon initially refused to cooperate in September, but said in the note it decided to comply after receiving a \"valid and binding legal demand\" from the Massachusetts Department of Revenue. It also advised the sellers to consult with a tax adviser because \"each seller's business and tax needs are unique.\" \nThe agreement would serve as an important case as it sets a precedent for other states to follow. The U.S. Government Accountability Office estimates that states are missing up to $13 billion in annual revenue by failing to collect sales taxes from remote sellers. \n\"It's game on in terms of sellers being targeted by states,\" said BuyBox Experts' partner James Thomson, who provides advisory service to Amazon sellers. \"Less than 10 percent of sellers are actually sales tax compliant, so every state has an incentive to get this information and audit sellers who aren't collecting.\" Amazon vs. sellers \nScott Peterson, VP of U.S. Tax Policy and Government Relations at Avalara, a tax software maker, says this case is being closely watched because it shows states taking action to collect sales taxes rather than waiting for new laws to get enacted. \n\"We are watching as the departments of revenue take their own action rather than waiting for laws to change,\" Peterson said. \"We have seen enforcement of many kinds on the rise, but this is certainly unique to watch.\" \nThe situation is made more complicated by the fact that states have different sales tax laws —and have different rules about who is responsible for collecting them. \nSome states, like Washington, Minnesota, and Rhode Island, have recently passed new laws requiring online marketplaces — like Amazon — to collect sales tax on behalf of its third-party sellers. South Carolina has filed a complaint arguing existing laws would make Amazon the responsible party for third party sales tax collection. \nMassachusetts, however, doesn't have any existing laws requiring Amazon to take action. And if successful, other states that don't have similar laws in place will certainly look for ways to follow suit as it's easier to target individual sellers than a big company like Amazon. \n\"Successful strategies take on a life of their own,\" Peterson said. \"I would anticipate other states are paying close attention.\" Dog and pony show \nThe move is an about-face for Amazon. After the company refused to cooperate in September, the state of Massachusetts filed a court order forcing Amazon to turn over the data by mid-October. It wasn't clear if Amazon would relent or fight the court until now. (Amazon declined to comment, and the Massachusetts Department of Revenue didn't return a request for comment.) \nPeterson noted that when someone uses language like \"valid and binding legal demand\" and agrees to comply, it typically means its lawyers have believe they're likely to lose in court. \nBut Paul Rafelson, a law professor at Pace University and a former tax counsel at GE, had a more nuanced view of the incident. \nHe says, given how common these requests are, it was strange to see Amazon react so aggressively against turning over the data. Instead, he thinks Amazon's resistance was likely a \"pretend fight\" put on to mitigate its liability against any seller that might decide to sue them over failing to help them be more tax compliant. Because Amazon currently takes a hands-off approach to third party sales tax collection, the company would be able to use this as one evidence of \"sticking up for the sellers,\" he said. \nAnd the situation only gets trickier as Boston is in the running for a bid to win Amazon's second headquarters. Cities are offering all kinds of tax incentives to get Amazon's HQ2, which would create 50,000 new jobs and attract over $5 billion in investments. \n\"This is a bit of a dog and pony show,\" Rafelson said. \"This is such a basic request that there's no reason why Amazon wouldn't turn it over. It's just making kind of a big public show.\" Eugene Kim Technology Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-23T22:48:00.000+02:00", "crawled": "2018-01-23T22:59:15.050+02:00", "highlightTitle": ""}