{"organizations": [], "uuid": "02071bebd4fbf91b376e51c8afb0223439ec2f42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864793-RTX3K2U2-amazon.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/bmo-amazon-to-pop-23-percent-this-year-to-near-800-billion-value.html", "country": "US", "domain_rank": 767, "title": "Amazon to pop 23% this year to near $800 billion value, says Wall Street's new biggest bull on stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T15:48:00.000+02:00", "replies_count": 0, "uuid": "02071bebd4fbf91b376e51c8afb0223439ec2f42"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/bmo-amazon-to-pop-23-percent-this-year-to-near-800-billion-value.html", "ord_in_thread": 0, "title": "Amazon to pop 23% this year to near $800 billion value, says Wall Street's new biggest bull on stock", "locations": [], "entities": {"persons": [{"name": "marke", "sentiment": "none"}, {"name": "daniel salmon", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "robbinsville", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "wall street", "sentiment": "negative"}, {"name": "shares lucas jackson | reuters", "sentiment": "negative"}, {"name": "bmo capital markets", "sentiment": "none"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon stock will add to its historic run in 2018 thanks to its booming advertising business, according to BMO Capital Markets.\nThe firm raised its price target for Amazon to $1,600 from $1,200, the highest 12-month forecast on the e-commerce company of any brokerage on Wall Street. The target represents a 23 percent gain from Friday's close of $1,305.20.\n\"We believe the emergence of Amazon's advertising business can support both margin and multiple expansion and could be a greater catalyst for the shares if management shares more data points like it did for Amazon Web Services,\" BMO analyst Daniel Salmon wrote on Monday. \"The end result is greater confidence in the company's advertising opportunity and an increase in our estimates.\"\nThe analyst's new price target implies a market cap of $771 billion given the current level of common stock. Shares rose about 2 percent on Tuesday.\n\nAmazon's ascent in the retail world has been nearly 21 years in the making, but the e-commerce giant has been accruing market cap at a faster rate in recent years.\nFive years ago, shares of Amazon traded at $272, climbing to $809 per share by January 2016. With its shares now trading around $1,325, the company is ranked fourth in the S&P 500 in terms of market cap, behind Apple , Alphabet and Microsoft .\nSalmon noted that the company's sponsored product ads, headline search ads and product display ads present the company with an $18 billion revenue opportunity in the medium term. Amazon may also see a bump in revenue when it starts recording certain advertising fees as revenue, the analyst added.\nAmazon has been dabbling in various advertising products across its portfolio in recent months, preparing for a larger move into the space this year. Conversations appeared to be focused on the company's search and video products, sources told CNBC. One source said Amazon is working with third-party mobile advertising firms like Kargo.\nKen Sena of Wells Fargo is now the second most bullish analyst on Wall Street on the stock with a $1,525 12-month target, according to FactSet. Three others have $1,500 price targets.\nWhile the company's stock rose 60 percent in the past 12 months, nearly 12 percent of that gain has occurred in the new year alone. But despite the dramatic rise, Wall Street has remained largely positive on shares. Echoing Salmon's sentiment, Piper Jaffray analyst Michael Olson reiterated his buy rating last week. \n\"Amazon, despite its size and continued strong growth, is arguably still in the early innings of its share gain potential, even in the company's most penetrated market,\" Olson wrote on Jan. 9.\nOlson increased his price target for Amazon shares to $1,400 from $1,200 last week.\nDisclaimer", "external_links": [], "published": "2018-01-16T15:48:00.000+02:00", "crawled": "2018-01-16T15:55:53.147+02:00", "highlightTitle": ""}