{"organizations": [], "uuid": "4031c6d71ebc810c2bd3c13c70e176ca5719003a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 111, "shares": 111, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/27/103820178-GettyImages-576526520.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/china-will-not-be-viewing-gdp-growth-as-a-priority-this-year-economists-say.html", "country": "US", "domain_rank": 767, "title": "China won't be prioritizing growth this year, economist says", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T07:48:00.000+02:00", "replies_count": 0, "uuid": "4031c6d71ebc810c2bd3c13c70e176ca5719003a"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/china-will-not-be-viewing-gdp-growth-as-a-priority-this-year-economists-say.html", "ord_in_thread": 0, "title": "China won't be prioritizing growth this year, economist says", "locations": [], "entities": {"persons": [{"name": "andy xie", "sentiment": "none"}, {"name": "xie", "sentiment": "none"}, {"name": "johannes eisele", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China's fears of a financial crisis will spur Beijing to keep the country's growth target in check, a widely followed China expert said Friday.\n\"Their top priority is to prevent a financial crisis, so the government is looking for any pockets (of risk) that might be a trigger,\" independent economist Andy Xie told CNBC's \"Squawk Box.\"\nChinese authorities have been cracking down on money fleeing the country and warning on \"gray rhinos,\" which are risks that could potentially be solved but have been unaddressed so far.\n\"The government does not view growth as the top priority right now — we have to take the government's word at face value. The government is worried about financial risk,\" Xie added.\nChina will keep its target for economic growth at \"around 6.5 percent\" in 2018, unchanged from last year, Reuters reported on Thursday, citing unnamed policy sources.\nJohannes Eisele | AFP | Getty Images The world's second-largest economy has been fighting debt for years, but with little success so far as it balances economic stability against fallout from a sharp deceleration.\nThere have also been difficulties with the political buy-in for the debt crackdown. That's been especially true down the Communist Party pecking order as many local governments still need to hit growth targets.\n\"It takes time to filter down the ranks. Most government officials still don't believe in the new direction,\" said Xie.\nHowever, unlike officials in previous administrations, Xie said current ones are likely to be changed if they don't agree with the current economic direction, so the government will have more power to push through its agenda.\nPolicies are working toward that direction, with higher interbank interest rates that will remain at elevated levels for the foreseeable future, Xie added. China is also looking to further slow money supply growth in 2018 after it already slowed to the all-time low around 9 percent in November 2017.\nWith China likely headed toward a money supply growth rate of 7 to 8 percent in the next few years, it will be a \"very different situation\" for the economy, said Xie.\nshow chapters Chinese government has 'powerful' ability to fend off shocks: Credit Suisse 15 Hours Ago | 01:09 Meanwhile, concerns about debt will push the Chinese government to slow down on infrastructure growth, said Vincent Chan, Credit Suisse's head of China macro research.\nNonetheless, credit growth is still a big problem. But authorities are able to fence off the economy and financial systems from external and internal shocks, he said.\nAfter three decades of breakneck growth as a manufacturing powerhouse, China is transitioning to a services and consumer-led economy, but that will not be taking off in a big way until the government cuts taxes to promote the switch, said Xie.", "external_links": [], "published": "2018-01-05T07:48:00.000+02:00", "crawled": "2018-01-05T07:54:30.011+02:00", "highlightTitle": ""}