{"organizations": [], "uuid": "32df7e7fd9e9d8c6b5c73ecb0909484f761864b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953030-GettyImages-489756813.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/ex-assistant-to-top-goldman-exec-fled-to-rome-after-admitting-wine-theft-fbi-says.html", "country": "US", "domain_rank": 767, "title": "Ex-assistant to top Goldman exec fled to Rome after admitting wine theft, FBI says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:14:00.000+02:00", "replies_count": 0, "uuid": "32df7e7fd9e9d8c6b5c73ecb0909484f761864b1"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/ex-assistant-to-top-goldman-exec-fled-to-rome-after-admitting-wine-theft-fbi-says.html", "ord_in_thread": 0, "title": "Ex-assistant to top Goldman exec fled to Rome after admitting wine theft, FBI says", "locations": [], "entities": {"persons": [{"name": "francois guillot", "sentiment": "none"}, {"name": "solomon", "sentiment": "none"}, {"name": "david solomon", "sentiment": "none"}, {"name": "nicolas de-meyer", "sentiment": "none"}, {"name": "de-meyer", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "morocco", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "venture capital", "sentiment": "negative"}, {"name": "goldman", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The former personal assistant to Goldman Sachs co-president David Solomon fled to Rome in November 2016, one day after privately admitting he took $1.2 million worth of rare wine from the executive's collection.\nA federal court judge in Los Angeles on Wednesday denied Nicolas De-Meyer bail and called him a flight risk. De-Meyer, who had worked for Solomon from 2008 to 2016, had admitted to his boss he took the wine during a meeting with him and his wife at a Manhattan hotel that November, the day before he fled the U.S.\nHe traveled in Italy, Brazil, Argentina, Switzerland and Morocco and was issued a 10-year visa in Brazil in 2016, according to FBI agent Elizabeth Rivas, who testified on Wednesday about De-Meyer's arrest at Los Angeles International Airport on Tuesday night. The FBI tracked his movements using bank records and ATM withdrawals, she said.\nSolomon's wife provided a sworn statement that she, her husband and De-Meyer met at the hotel in New York that November. During that meeting, De-Meyer admitted to taking the wine. They talked about possible prosecution, FBI Agent Rivas said Wednesday, and Solomon wouldn't guarantee that the FBI would not be involved.\nDe-Meyer was supposed to meet Solomon's wife at a bank the next day to pay them back but he never showed up, instead fleeing the country, Rivas said. In a recorded phone call to Solomon's wife after that day, he admitted again he took the wine and had left for Rome.\nThe FBI agent says De-Meyer denied using a fake name, as he was accused of doing in an indictment unsealed Wednesday by federal prosecutors in Manhattan. The Los Angeles judge ordered De-Meyer to be detained and sent to the federal court in Manhattan, where he was charged by a grand jury.\nDe-Meyer, 40, has no stable employment, the Los Angeles judge said in a hearing Wednesday afternoon, and there was a concern he would not show up in New York for court.\nDe-Meyer took hundreds of bottles of wine from Solomon's personal collection, including seven of a rare French Burgundy that Solomon had acquired for more than $133,000, the indictment said. As a member of Solomon's household staff, one of De-Meyer's jobs had been to receive wine shipments at the executive's New York apartment and then to transfer wine from the New York residence to a property in the Hamptons.\nInstead, the grand jury indictment said, he used the fake name \"Mark Miller\" to sell stolen bottles to a North Carolina wine dealer.\nThe discovery of missing bottles in the collection appears to coincide with the sale of Solomon's New York apartment in November 2016 for $21.5 million. That apartment was described as having Central Park views and a 1,000-bottle wine storage area.", "external_links": [], "published": "2018-01-18T20:14:00.000+02:00", "crawled": "2018-01-18T20:26:45.023+02:00", "highlightTitle": ""}