{"organizations": [], "uuid": "128d1b8296dae57b0ca64d7a49959bc1420e707c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/24/104236800-GettyImages-455507140.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/google-misses-out-on-billions-in-china.html", "country": "US", "domain_rank": 767, "title": "Google is missing out on billions of dollars by not having an app store in China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T23:41:00.000+02:00", "replies_count": 0, "uuid": "128d1b8296dae57b0ca64d7a49959bc1420e707c"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/google-misses-out-on-billions-in-china.html", "ord_in_thread": 0, "title": "Google is missing out on billions of dollars by not having an app store in China", "locations": [], "entities": {"persons": [{"name": "sundar pichai", "sentiment": "negative"}, {"name": "kuni takahashi", "sentiment": "negative"}, {"name": "app annie", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "baidu", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "tencent", "sentiment": "none"}, {"name": "google inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the amount of money that Chinese app users spend continues to swell at a break-neck pace, Google is missing out on a growing chunk of potential revenue because its Google Play app store is barred from that market, new data from App Annie shows.\nChinese consumers spent nearly $35 billion on apps in 2017, marking a 270 percent in two years, with more aggressive growth likely ahead.\nHowever, it's only Apple and Chinese companies like Tencent and Baidu — which have their own Android app stores — that reap the benefits of that, since Google pulled search from China and had most of its services blocked back in 2010. (Although it's technically possible for Chinese smartphone users to access the Play Store via virtual private networks, data from 2017 shows that a tiny percentage actual go through the effort to do so.)\nOver the last eight years, Google has repeatedly tried to relaunch Play in China, to no avail.\nMeanwhile, App Annie predicts continued strong growth in China, calling the country a \"tale of two markets.\" Some cities, like Beijing and Shanghai, have already reached advanced levels of app maturity while people in lower tier cities and rural areas are just starting to adopt smartphones. Google and Apple both take a 30 percent cut of app purchases, so as the pie grows bigger, so too would their slice.\nGoogle's most recent plans to relaunch a censored version of the Play Store in partnership with Chinese company Netease, reported by The Information , show that the company realizes the huge potential of this market. Alphabet doesn't break out what percentage of its revenue comes specifically from the Play Store — it lumps those together with money from its swelling cloud business and hardware sales. In Q3 of 2017, Alphabet's so-called \"Other Google revenues\" hit $3.4 billion.\nOverall, smartphone users downloaded over 175 billion apps and spent more than $86 billion on them in 2017, according to App Annie, and the average spends 3 hours in apps every day .\nWATCH: Google deletes 60 apps that show kids pornographic content show chapters Google had to delete 60 apps after they showed kids pornographic content 11:38 AM ET Fri, 12 Jan 2018 | 00:49", "external_links": [], "published": "2018-01-17T23:41:00.000+02:00", "crawled": "2018-01-18T00:03:40.002+02:00", "highlightTitle": ""}