{"organizations": [], "uuid": "3354d21605a9c56b8db92e3ef8e22e50e33882a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223131738&w=1200&r=LYNXMPEE0H1VU", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-bitcoin-crackdown/fears-of-global-crackdown-fail-to-dampen-cryptocurrency-interest-idUSKBN1F72YM", "country": "US", "domain_rank": 408, "title": "Fears of global crackdown fail to dampen cryptocurrency interest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T22:30:00.000+02:00", "replies_count": 0, "uuid": "3354d21605a9c56b8db92e3ef8e22e50e33882a6"}, "author": "", "url": "https://www.reuters.com/article/us-bitcoin-crackdown/fears-of-global-crackdown-fail-to-dampen-cryptocurrency-interest-idUSKBN1F72YM", "ord_in_thread": 0, "title": "Fears of global crackdown fail to dampen cryptocurrency interest", "locations": [], "entities": {"persons": [{"name": "gertrude chavez-dreyfuss", "sentiment": "none"}, {"name": "francesco nazari fusetti", "sentiment": "none"}], "locations": [{"name": "aidcoin", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "min read  miami", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:34 PM / in 9 minutes Fears of global crackdown fail to dampen cryptocurrency interest Gertrude Chavez-Dreyfuss 3 Min Read \nMIAMI (Reuters) - Worries about a crackdown by global regulators on cryptocurrency trading could slow the pace of bitcoin’s rise but should not threaten its existence, investors and market participants at a cryptocurrency conference said on Thursday. \nAt the North American Bitcoin Conference in Miami, investors and executives interviewed by Reuters were unfazed by government moves to further regulate cryptocurrencies, which have sent prices into a tailspin. \n“It’s impossible to ban bitcoin and cryptocurrency trading because the more you regulate, the more it will become popular,” said Francesco Nazari Fusetti, co-founder and chief executive officer of Aidcoin and CharityStars, which aims to launch an online auction platform for the non-profit sector. \nBitcoin soared more than 1,700 percent last year, hitting a record high just shy of $20,000 as institutional and retail investors snapped up the virtual currency on expectations of further steep increases. Its astronomical gains though have attracted the attention of global regulators tasked with protecting investors from fraud. \nIn recent weeks, Japan and China have made noises about a regulatory crackdown while South Korean policymakers said they are considering shutting down domestic virtual currency exchanges. In addition, the U.S. Treasury’s Financial Crimes Enforcement Network (FinCEN) is “aggressively” pursuing virtual currency platforms that lack strong internal safeguards against money laundering. [nL3N1PD1DO] [nL3N1PC4IS] \nBitcoin plunged to below $10,000 on Wednesday on the Luxembourg-based exchange Bitstamp after the South Korean news. On Thursday however, bitcoin recovered to trade at $11,718 BTC=BTSP , up 4.6 percent on the day. \nSouth Korea is the third-largest market in the world for bitcoin trades after Japan and the United States, according to digital currency website Coinhills. Bitcoin trades at roughly a 30 percent premium in South Korea compared with other countries because of huge demand and monetary restrictions in that country, analysts said. \n“Such intervention will further squeeze the already heated South Korean market, further drive up spreads to other markets, and push order flow outside the country,” said Trevor Koverko, chief executive officer of Polymath, whose platform makes it easier for start-up companies to launch security tokens. \nEran Eyal, chief executive officer of Shopin, a project that aims to be the decentralized Amazon of the virtual currency space, believes the efforts by governments will not affect bitcoin in a major way. \n“You have to think of what the general trajectory is and the general trajectory is upward for cryptocurrencies and bitcoin,” said Eyal. Reporting by Gertrude Chavez-Dreyfuss; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-18T22:30:00.000+02:00", "crawled": "2018-01-18T22:39:33.024+02:00", "highlightTitle": ""}