{"organizations": [], "uuid": "f3a822649fa7088583526ca547af45589c297c59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/21/104121657-GettyImages-521368040.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/tax-software-options-for-do-it-yourself-filers.html", "country": "US", "domain_rank": 767, "title": "5 tax software options for do-it-yourself filers", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T18:21:00.000+02:00", "replies_count": 0, "uuid": "f3a822649fa7088583526ca547af45589c297c59"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/tax-software-options-for-do-it-yourself-filers.html", "ord_in_thread": 0, "title": "5 tax software options for do-it-yourself filers", "locations": [], "entities": {"persons": [{"name": "andrew harrer", "sentiment": "none"}], "locations": [{"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "getty images  tax", "sentiment": "neutral"}, {"name": "turbotax", "sentiment": "none"}, {"name": "fidelity", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "intuit inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images \nTax season kicks off Jan. 23. Are you ready? \nWhile you wait for key documents such as your W-2s and 1099s to arrive, start thinking about how you'll file. If you want to go the do-it-yourself route, there are plenty of software options out there. \nSome have a wealth of features, and many are low cost — even free . Cast a wide net to see which is the best fit for your tax situation. \nYou might also want to check if your bank, credit card issuer or other financial institution has any tax-filing deals. For example, Fidelity offers its customers a $20 discount on TurboTax. \nHere are some of the software options to consider: 1) TurboTax Andrew Harrer | Bloomberg | Getty Images The homepage of Intuit Inc.'s TurboTax website is displayed on a computer monitor in Washington, D.C. \nPrice range: $39.99-$149.99 \nTurboTax features include an artificial intelligence system that will recommend deductions based on your profession, as well as access to certified public accountants and other tax experts that can help you throughout the process. You can join a Q&A with a tax professional or use TurboTax Live, in which you can see the pro helping you, but they cannot see you. \n\"We're always thinking about trends,\" said Lisa Lewis, a CPA with TurboTax. \"People use their computers and phones for their finances, but they're also seeking expert help from the comfort of their home.\" \nIf you use a 1040EZ or 1040A form, and make under $100,000 a year, you may qualify for TurboTax Absolute Zero — which means your tax filing is free. 2) H&R Block Source: Office Depot \nPrice range: $29.95-$89.95 \nBoth H&R Block's deluxe and premium packages offer free online consultations with tax experts. You can import forms and track your refund from you phone. \n(And if you get lost in the process, you can always stop in at one of H&R Block's 12,000 retail sites.) \nH&R Block also offers free filing for people who use the 1040EZ, 1040A or the 1040 with Schedule A form. The program, called More Zero, also offers free state return filing. 3) TaxAct Source: TaxAct \nPrice range: $27-$51 \nTaxAct offers complimentary email and phone support, and you can easily import your tax returns from previous years. There's also an option exclusively for independent contractors and other freelancers, which costs $39. \nFederal and state return filings are free for taxpayers \"with simple returns\" using 1040EZ or 1040A forms. 4) TaxSlayer Source: TaxSlayer \nPrice range: $17-$55 \nThe \"classic\" e-filing version of TaxSlayer is just $17 (one of the cheapest options around). Users can even opt to have their filing fees deducted from their refund, rather than paid out of pocket. \nSimple tax returns can be completed and filed via the company's app. 5) IRS Free File Source: IRS.gov \nThe IRS offers the Free File program, administered through a nonprofit alliance of tax-prep service providers . Each provider has its own restrictions on who qualifies. \nThis tool on the IRS website will help you find which free software fits your situation . \nIf you'd rather do your taxes with a human: Volunteers for the IRS, through The Volunteer Income Tax Assistance program, provide free tax filing for people who make less than $54,000 a year, are disabled or speak limited English. \nYou can find a location near you on the IRS's website. show chapters", "external_links": [], "published": "2018-01-18T18:21:00.000+02:00", "crawled": "2018-01-18T18:28:26.054+02:00", "highlightTitle": ""}