{"organizations": [], "uuid": "7791f11b56a8ed873cf3740b714e3cd61dbad878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 242}, "facebook": {"likes": 1132, "shares": 1132, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/uk-southkorea-bitcoin/south-koreas-major-cryptocurreny-exchanges-raided-by-police-tax-authorities-idUSKBN1F002A", "country": "US", "domain_rank": 408, "title": "South Korea's major cryptocurrency exchanges raided by police, tax authorities", "performance_score": 10, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T04:10:00.000+02:00", "replies_count": 0, "uuid": "7791f11b56a8ed873cf3740b714e3cd61dbad878"}, "author": "", "url": "https://www.reuters.com/article/uk-southkorea-bitcoin/south-koreas-major-cryptocurreny-exchanges-raided-by-police-tax-authorities-idUSKBN1F002A", "ord_in_thread": 0, "title": "South Korea's major cryptocurrency exchanges raided by police, tax authorities", "locations": [], "entities": {"persons": [{"name": "coinone", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "coinone", "sentiment": "none"}, {"name": "bithumb", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "national tax service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s government said on Thursday it plans to ban cryptocurrency trading, sending bitcoin prices plummeting and throwing the virtual coin market into turmoil as the nation’s police and tax authorities raided local exchanges on alleged tax evasion.\nThe clampdown in South Korea, a crucial source of global demand for cryptocurrency, came as policymakers around the world struggled to regulate an asset whose value has skyrocketed over the last year.\nJustice minister Park Sang-ki said the government was preparing a bill to ban trading of the virtual currency on domestic exchanges.\n“There are great concerns regarding virtual currencies and the justice ministry is basically preparing a bill to ban cryptocurrency trading through exchanges,” Park told a news conference, according to the ministry’s press office.\nAfter the market’s sharp reaction to the announcement, the nation’s Presidential office hours later said a ban on the country’s virtual coin exchanges had not yet been finalised while it was one of the measures being considered.\nA press official at the justice ministry said the proposed ban on cryptocurrency trading was announced after “enough discussion” with other government agencies, including the nation’s finance ministry and financial regulators.\nOnce a bill is drafted, legislation for an outright ban of virtual coin trading will require a majority vote of the total 297 members of the National Assembly, a process that could take months or even years.\nThe government’s tough stance triggered a selloff of the cryptocurrency on both local and offshore exchanges.\nThe local price of bitcoin plunged as much as 21 percent in midday trade to 18.3 million won (12,730.35 pounds) after the minister’s comments. It still trades at around a 30 percent premium compared to other countries.\nBitcoin BTC=BTSP was down more than 10 percent on the Luxembourg-based Bitstamp at $13,199, after earlier dropping as low as $13,120, its weakest since Jan. 2.\nSouth Korea’s cryptocurrency-related shares were also hammered. Vidente ( 121800.KQ ) and Omnitel ( 057680.KQ ), which are stakeholders of Bithumb, skidded by the daily trading limit of 30 percent each.\nOnce enforced, South Korea’s ban “will make trading difficult here, but not impossible,” said Mun Chong-hyun, chief analyst at EST Security.\n“Keen traders, especially hackers, will find it tough to cash out their gains from virtual coin investments in Korea but they can go overseas, for example Japan,” Mun said.\nPark Nok-sun, a cryptocurrency analyst at NH Investment & Securities, said the herd behaviour in South Korea’s virtual coin market has raised concerns.\nIndeed, bitcoin's BTC=BTSP 1,500 percent surge last year has stoked huge demand for cryptocurency in South Korea, drawing college students to housewives and sparking worries of a gambling addiction.\nSlideshow (4 Images) “Some officials are pushing for stronger and stronger regulations because they only see more (investors) jumping in, not out,” Park said.\nBy Thursday afternoon, the Justice Ministry’s announcement had prompted more than 55,000 South Koreans to join a petition asking the presidential Blue House to halt the crackdown on the virtual currency, making the Blue House website intermittently unavailable due to heavy traffic, the website showed.\nREGULATORY CONUNDRUM There are more than a dozen cryptocurrency exchanges in South Korea, according to Korea Blockchain Industry Association.\nThe proliferation of the virtual currency and the accompanying trading frenzy have raised eyebrows among regulators globally, though many central banks have refrained from supervising cryptocurrencies themselves.\nThe news of South Korea’s proposed ban came as authorities tightened their grip on some cryptocurrency exchanges.\nThe nation’s largest cryptocurrency exchanges such as Coinone and Bithumb were raided by police and tax agencies this week for alleged tax evasion. The raids follow moves by the finance ministry to identify ways to tax the market that has become as big as the nation’s small-cap Kosdaq index in terms of daily trading volume.\nSome investors appeared to have taken preemptive action.\n“I have already cashed most of mine (virtual coins) as I was aware that something was coming up in a couple of days,” said Eoh Kyung-hoon, a 23-year old investor.\nBitcoin sank on Monday after website CoinMarketCap removed prices from South Korean exchanges, because coins were trading at a premium of about 30 percent in Asia’s fourth-largest economy. That created confusion and triggered a broad selloff among investors.\nAn official at Coinone told Reuters that a few officials from the National Tax Service raided the company’s office this week. The official, who spoke on condition of anonymity, said that Coinone was cooperating with the investigation.\nBithumb, the second largest virtual currency operator in South Korea, was also raided by the tax authorities on Wednesday.\n“We were asked by the tax officials to disclose paperwork,” an official at Bithumb said, requesting anonymity due to the sensitivity of the issue.\nThe nation’s tax office and police declined to confirm whether they raided the local exchanges.\nSouth Korean financial authorities had previously said they are inspecting six local banks that offer virtual currency accounts to institutions, amid concerns the increasing use of such assets could lead to a surge in crime.\nAdditional reporting by Hyonhee Shin; Editing by Shri Navaratnam and Jacqueline Wong\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T04:10:00.000+02:00", "crawled": "2018-01-11T04:21:44.008+02:00", "highlightTitle": ""}