{"organizations": [], "uuid": "7dafb8df8b752fa99f54d0f724b7aa76f261b69c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104935748-Beluga1.1910x1000.PNG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/airbus-beluga-xl-one-of-the-biggest-planes-in-the-world-just-got-bigger.html", "country": "US", "domain_rank": 767, "title": "One of the largest aircraft in existence just got bigger", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T15:17:00.000+02:00", "replies_count": 0, "uuid": "7dafb8df8b752fa99f54d0f724b7aa76f261b69c"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/airbus-beluga-xl-one-of-the-biggest-planes-in-the-world-just-got-bigger.html", "ord_in_thread": 0, "title": "One of the largest aircraft in existence just got bigger", "locations": [], "entities": {"persons": [{"name": "bertrand george", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The first structurally complete Airbus BelugaXL transporter rolls out from its assembly hangar in Toulouse. \nAirbus has unveiled photographs of the first structurally complete airframe for its new BelugaXL aircraft. \nThe super transporter is one of the largest aircraft in existence and is used to airlift completed sections of planes from different manufacturing sites in Europe to Airbus's final assembly lines in France, Germany and Spain. \nThe BelugaXL is six metres longer, one metre wider and holds a payload capacity six tonnes greater than the BelugaST transporter version it is replacing. Airbus said it will be able to transport both wings of an A350 XWB jetliner at once. The present BelugaST transporter can only carry one single wing per flight. \nIn a press release Tuesday Airbus said the BelugaXL is a highly modified version of the Airbus A330-200 jetliner. Bertrand George, head of the BelugaXL programme said there had been many changes and \"transforming an existing product into a super transporter is not a simple task.\" \nThe initial BelugaXL is expected to be flying by mid-2018 after a sequence of jet engine tests and a paint job. With the first plane rolled out of the way, a second conversion will now begin at the hangar in Toulouse. Source: Airbus The Airbus BelugaXL transporter is one of the largest aircraft in existence. Stronger ties with China \nAirbus also announced Tuesday that it is to deepen cooperation with Chinese partners. \nIn the presence of visiting French President Emmanuel Macron and Chinese President Xi Jinping, Airbus has signed a Memorandum of Understanding with the National Development and Reform Commission of China (NDRC). \nBoth parties have agreed to strengthen the cooperation in technical innovation, engineering capabilities and supply chain expansion. Airbus presently has some 1900 employees working in China and the country represents around a quarter of all Airbus commercial plane deliveries. \nThe agreement was signed by He Lifeng, Chairman of the NDRC and Fabrice Brégier, Airbus COO and President of Commercial Aircraft. \nOn the same day, Airbus and its Chinese partners also signed a framework agreement on ramping-up its A320 production rate at its assembly line in Tianjin to six aircraft per month by early 2020.", "external_links": [], "published": "2018-01-09T15:17:00.000+02:00", "crawled": "2018-01-09T15:41:47.013+02:00", "highlightTitle": ""}