{"organizations": [], "uuid": "c09d710bbfd61c067a235300d0fe5da6a362fd9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 16}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/01/16/102345587-RTR1RIJ3.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/itll-be-another-weak-year-for-the-us-dollar-goldman-sachs-predicts.html", "country": "US", "domain_rank": 767, "title": "It'll be another weak year for the US dollar, Goldman Sachs predicts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T11:54:00.000+02:00", "replies_count": 0, "uuid": "c09d710bbfd61c067a235300d0fe5da6a362fd9d"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/itll-be-another-weak-year-for-the-us-dollar-goldman-sachs-predicts.html", "ord_in_thread": 0, "title": "It'll be another weak year for the US dollar, Goldman Sachs predicts", "locations": [], "entities": {"persons": [{"name": "jan hatzius", "sentiment": "none"}, {"name": "hatzius", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. currency is set for another soft year despite a hawkish Federal Reserve that could hike interest rates up to four times in the next twelve months, a Goldman Sachs economist told CNBC Tuesday.\n\"We still think the dollar is probably going to be relatively soggy, at least against the majors, probably against the emerging economies to a significant degree as well,\" Jan Hatzius, chief economist at Goldman Sachs, said.\nRate rises by a central bank traditionally boost a currency as it promotes investors to flock to a country with the anticipation of higher-yielding assets. However, Hatzius believes that we are now in a \"fairly synchronized global upswing\" where other central banks are also looking to push benchmark rates higher, diminishing the appeal of the U.S.\nMichael Caronna | Reuters A trader at FXCM in Japan. \"(In) that sort of environment it's usually hard to see large dollar appreciation, so generally slightly softer is the basic view,\" he added.\nThe dollar index, which compares it to a basket of global currencies, was down around 10 percent last year after several years of gains as the U.S. economy improved following the global economic crash. Now the consensus from market watchers suggests it could see another weak year as other global regions pick up. Many cite uncertainty over the currency, including on the policies that could be delivered by President Donald Trump .\n\"There are the doubts on Trump — which is causing a sense of befuddlement among international investors about the dollar as the ultimate store of value and America's place in the global economy — and there is a growing sense of unease about the economy's ongoing resilience. These two repeat factors keep pulling any dollar recovery down and mean we remain in cautious wait and see mode about the U.S.,\" Bill Blain, strategist and head of capital markets at Mint Partners, told CNBC via email.\nshow chapters Don’t expect ECB rate hikes in 2018, economist says 11 Hours Ago | 02:30 The dollar lost about 10 percent of its value against the euro in 2017. This despite the Fed raising rates three times and the Trump administration managing to get approval for its tax cuts. But Jane Foley, head of forex strategy at Rabobank, agrees that it's other economies that could be having more of an impact, with the European Central Bank and the Bank of England both reducing their stimulus at the end of last year.\n\"The fact that many other G-10 central banks could be backing out of very accommodative monetary policies detracts from the impact of higher Fed rates on the USD,\" she told CNBC via email. She also believes that U.S. assets could lose their status as a so-called safe haven in the short term amid all this uncertainty.\n\"The U.S. has neither the current account surplus or budget surplus that a true safe haven would demand,\" Foley explained. \"The euro zone, by contrast does have a huge current account surplus and this factor has been helping the euro to show safe haven characteristics more recently. I would expect that in a period that the EUR is showing safe haven characteristics that the USD is unlikely to – the world only needs so many safe havens ,\" she said.\n—CNBC's Joumanna Bercetche contributed to this article.", "external_links": [], "published": "2018-01-09T11:54:00.000+02:00", "crawled": "2018-01-09T12:05:42.002+02:00", "highlightTitle": ""}