{"organizations": [], "uuid": "49c8f1495b3da1882d93bfe4fd684e20e54d5740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955849-RTX4F7L8.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/trump-to-anti-abortion-activists-we-are-with-you-all-the-way.html", "country": "US", "domain_rank": 767, "title": "Trump to anti-abortion activists: 'We are with you all the way'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T22:12:00.000+02:00", "replies_count": 0, "uuid": "49c8f1495b3da1882d93bfe4fd684e20e54d5740"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/trump-to-anti-abortion-activists-we-are-with-you-all-the-way.html", "ord_in_thread": 0, "title": "Trump to anti-abortion activists: 'We are with you all the way'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "mike pence", "sentiment": "none"}, {"name": "kevin lamarque", "sentiment": "none"}], "locations": [{"name": "national mall", "sentiment": "none"}, {"name": "white house rose garden", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump to anti-abortion activists: 'We are with you all the way' President Donald Trump on Friday addressed the anti-abortion March for Life via satellite from the White House. Trump touted a number of steps his administration has taken to restrict access and funding for certain types of abortions. Yet the official show of solidarity belied Trump's complicated relationship with the anti-abortion movement. SHARES Kevin Lamarque | Reuters President Donald Trump addresses the annual March for Life rally from the White House Rose Garden in Washington, January 19, 2018. \nPresident Donald Trump on Friday addressed marchers gathered on the National Mall for the March for Life, an annual anti-abortion rally that draws thousands of activists and students to Washington each year. \n\"Under my administration, we will always defend the very first right in the Declaration of Independence, and that is the right to life,\" Trump told the crowd via satellite from the White House Rose Garden, where he was joined by Vice President Mike Pence, a longtime opponent of abortion rights. \nIn speaking to the group on live TV, Trump became the first sitting president to do so. Two of his Republican predecessors, George W. Bush and Ronald Reagan, addressed the marchers by telephone. In March of last year, Pence spoke to the group in person, becoming the first vice president to do so while in office. \nTrump touted a number of steps his administration has taken to limit certain late-stage abortions and divert federal funding away from clinics that offer abortions, in addition to other women's health services. \nOn Thursday, the Trump administration announced the creation of a new Conscience and Religious Freedom Division within the Department of Health and Human Services. The office will be tasked with ensuring that medical professionals whose religious beliefs include an opposition to abortion are not forced to participate in the procedure. \n\"You love every child, born and unborn, because you believe that every life is sacred,\" Trump told the crowd, \"And we are with you all the way. May God bless you.\" \nOn screen, marchers could be seen cheering wildly as he concluded his remarks. But it wasn't always like this. Buried underneath Trump's steadfast demeanor and language on Friday is a complicated relationship with the anti-abortion movement. \nWhen Trump ran for president in 2016, he described himself as a \"pro-life\" candidate. But he struggled to articulate a cohesive, consistent position on the issue as a whole. At one point he suggested that women seeking illegal abortions should be punished -- a view that runs contrary to the anti-abortion movement's view of expectant mothers as needing support and counseling. \nTrump later said abortion laws should be left to the states to decide, again earning him the rebuke of national anti-abortion groups like the Susan B. Anthony List. \nTrump's confusion over the basic outlines of the anti-abortion platform can likely be attributed, at least in part, to the fact that he was relatively new to it. In 1999, Trump told NBC's Meet The Press he was \"very pro-choice.\" \nThis year's March for Life took place against the backdrop of furious negotiations on Capitol Hill, as Congress races to come up with a plan to keep the government open past midnight . The House passed a one month spending bill late Thursday on a party line vote, but as of Friday afternoon, that bill is believed to have little prospect of passing the Senate.", "external_links": [], "published": "2018-01-19T22:12:00.000+02:00", "crawled": "2018-01-19T22:17:14.000+02:00", "highlightTitle": ""}