{"organizations": [], "uuid": "4afb0ccc0165ea8c7b89abbf5ef3cdd3ac5c9a2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/12/103782261-GettyImages-542343644.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/how-to-buy-your-first-home.html", "country": "US", "domain_rank": 767, "title": "85 percent of millennials expect to own a home—here's how to buy one", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T22:00:00.000+02:00", "replies_count": 0, "uuid": "4afb0ccc0165ea8c7b89abbf5ef3cdd3ac5c9a2f"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/how-to-buy-your-first-home.html", "ord_in_thread": 0, "title": "85 percent of millennials expect to own a home—here's how to buy one", "locations": [], "entities": {"persons": [{"name": "david bach", "sentiment": "none"}, {"name": "michelle brownstein", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "aperion care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:07 AM ET Thu, 4 Jan 2018 | 01:06 SHARES \nMost young people expect to own a home at some point in their lifetime: 85 percent, according to Aperion Care, which surveyed 2,000 millennials to get a sense of what they think about aging, retirement and their future in general. \nThat's good news. Young people should be prioritizing home ownership , says co-founder of AE Wealth Management and self-made millionaire David Bach. In fact, not buying a home is the No. 1 millennial money mistake, he tells CNBC Make It . \nIf you're ready to get in the game, follow these eight steps for first-time homebuyers. 1. Look at your cash flow \nThe first step is \"to really know where you're at financially,\" says Michelle Brownstein , a certified financial planner at Personal Capital , \"meaning how much you're earning, how much you're saving , or, if you're not saving, how much you're actually spending every month. \n\"If you don't know where your money is going, it's impossible to put together any kind of plan to achieve your goal.\" \nYou'll also want to check your credit score , which will affect the interest rate on your mortgage. Good credit can mean significantly lower monthly payments , so if your score isn't great, consider taking some time to improve it before home shopping. show chapters 12:22 PM ET Mon, 24 April 2017 | 00:49 2. Figure out how much home you can afford \nA good rule of thumb is to make sure you don't spend more than 28 percent of your gross income on housing in any given month, says Brownstein. Keep in mind that monthly payments encompass more than just the mortgage; they also include interest, property taxes and insurance on the home. \nWhen determining your budget, \"it's easier to work backwards than to say, 'OK I want a house that's $1 million,'\" she tells CNBC Make It. \"You don't want to put yourself in a situation where you buy more house that you can afford.\" 3. Build up your emergency fund \n\"It's always important, from a broader financial planning standpoint, to have an emergency fund ,\" says Brownstein, but it's particularly important for homeowners, who no longer have a super to deal with roof leaks, broken appliances or other pricey repairs: \"Going from renting to owning is a big adjustment because all of a sudden you can't call your landlord if the washing machine breaks. You have to pay for it.\" \nShe recommends having between three and six months' worth of your day-to-day living expenses stashed away. That means, if you spend $4,000 a month, you'll want to have between $12,000 and $24,000 in cash to fall back on. show chapters 1:16 PM ET Tue, 27 June 2017 | 01:03 4. Get together a down payment \nTechnically, you don't always have to put money down when financing a home today, and how much you decide to put down is highly personal. But the smaller the down payment , the larger the mortgage loan and the more you'll pay in interest. \n\"Generally speaking, 20 percent is a good amount to put down,\" Brownstein tells CNBC Make It. Anything lower and you will have to pay for private mortgage insurance (PMI), which is a safety net for the bank in case you fail to make your payments. \nPMI, which can cost between one percent and two percent of your loan amount , will be added to your monthly mortgage if you don't have 20 percent equity in your home. 5. Plan for surprises \nThe down payment isn't the only necessary factor you need to budget for, since buying a home comes with expenses such as property taxes, insurance, closing costs, moving costs and maintenance. \n\"Depending on where you live in the country, you should always find out if your city or state assesses property tax,\" says Brownstein. \"There are some areas that assess both a county tax and a state tax, so it's good to be aware of that on the front end.\" \nIn terms of planning ahead for maintenance and repairs, while shopping around, you'll want to ask when the appliances were purchased and installed so you'll have a better idea of when they'll need to be replaced. \n\"If you're buying a house that's a bit older, that can come with its own issues as well, whether it's poor heating or poor insulation that needs to be redone,\" notes Brownstein. Ultimately, the cost of repairs and maintenance can represent 10-to-20 percent of the price of the home each year. \nWhen you get to the point where you're ready to close on a house, you'll want to be prepared for closing costs such as appraisal fees, attorney fees, title insurance and inspection fees, which can run you two-to-five percent of the total cost of the home . \nThe expenses don't end at closing. You should also budget for moving costs, which vary but can set you back a couple thousand dollars . show chapters 9:15 AM ET Tue, 14 March 2017 | 00:53 6. Get pre-approved for a mortgage \nA pre-approval analyzes your creditworthiness, tells you how much you can borrow from your lender and, ultimately, can make all the difference between winning a bid or not . \nOnce you're pre-approved for a mortgage loan, start hunting for places within your price range. A real estate agent, and sites like Zillow , Trulia and Redfin , can help you with the process. \nAfter determining your basic home requirements — where you want to live, how many bedrooms and bathrooms you need and whether you want a specific school district — Brownstein suggests making a list of your \"deal breakers\" and \"must haves,\" which will help you narrow your search. \nMost importantly, stick to your budget. \"The key is to be really firm on the very top end of your budget and refuse to look at anything that's priced above it,\" says Brownstein. At the end of the day, \"it's much better to be able to upgrade your house than it is to realize you bought way more house than you could afford to the point where it's impacting your ability to live other parts of your life.\" 7. Get to know the neighborhood \nBesides buying more home than you can afford, one of the biggest mistakes first time homebuyers make is \"buying in an area that you don't fully explore,\" says Brownstein. \"Actually go walk around the neighborhood, and not just during the day — go there at night. Make sure you feel safe and good about it.\" \nAfter all, one of the most important factors to consider when settling down is the actual location of your home, says Brownstein: \"You can buy a brand new condo in a great building, but if it's in a terrible neighborhood with no amenities and you can't have the lifestyle you want, you're in the wrong place.\" \nUltimately, you can always change the finishing of your home, she notes, but you can't change the location. show chapters 1:00 PM ET Fri, 31 March 2017 | 00:51 8. Offer something you're comfortable with and close \nShopping for a home can be a draining process. Don't put in an offer because you're desperate to be done. On the flip side, be wary of buying with your heart and not your head — getting too emotionally involved can lead to spending more than you can afford. \nOnce you're ready to make an offer on a home within your budget, bid. If the seller acce", "external_links": [], "published": "2018-01-09T22:00:00.000+02:00", "crawled": "2018-01-09T22:26:57.017+02:00", "highlightTitle": ""}