{"organizations": [], "uuid": "3c77a621452567bbbe0141872834e7c7f8f36a55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104953200-GettyImages-157029992.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/31/expect-more-big-market-swings-wells-fargo-says.html", "country": "US", "domain_rank": 767, "title": "Big market swings are something you’re going to have to get used to, says Wells Fargo", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T14:48:00.000+02:00", "replies_count": 0, "uuid": "3c77a621452567bbbe0141872834e7c7f8f36a55"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/expect-more-big-market-swings-wells-fargo-says.html", "ord_in_thread": 0, "title": "Big market swings are something you’re going to have to get used to, says Wells Fargo", "locations": [], "entities": {"persons": [{"name": "james comey", "sentiment": "none"}, {"name": "wren", "sentiment": "none"}, {"name": "micha", "sentiment": "none"}, {"name": "scott wren", "sentiment": "none"}], "locations": [], "organizations": [{"name": "wells fargo", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cboe", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The nearly 400-point tumble in the Dow is something we haven't seen in a while.\nRather than panic, investors would be wise to roll with the punches, says Scott Wren, senior global equity strategist at Wells Fargo. These days, big swings are bound to become more common.\n\"You've got to get used to this — maybe not 400-point days but certainly half percent days, 100- to 200-point days, up and down,\" Wren told CNBC's \" Futures Now \" on Tuesday.\nWall Street had been spoiled with low volatility and upward-trending days for months before this week's two-day selloff. The CBOE market volatility index hit an all-time low in November and, even now, sits at its lowest level since August.\nTuesday's 363-point skid followed Monday's 145-point drop — a two-day decline of 508 points. That amounted to a two-day slide of 2.03 percent, the Dow's worst back-to-back performance since Sept. 8-9, 2016, when it fell 2.38 percent. The S&P 500 on Tuesday suffered its worst intraday plunge since May, when news broke that President Donald Trump asked then-FBI director James Comey to stop investigating Michael Flynn , his short-lived national security adviser.\nIn this kind of market, moves such as these should give retail investors reason to buy, Wren said.\n\"It's nothing but an opportunity,\" said Wren. \"Retail investors should welcome this, they should have a plan. They don't need to wait until the market is off 5 percent to figure out what they want to do.\"\nA pullback was in the cards after a breakneck pace of record highs to begin the year. The S&P 500 has risen 6 percent in the year to date and is on track for its 10 th straight month of gains. At these levels, this would be the best January since 1997.\nJanuary's gains only pushed the S&P 500 further into overbought territory. The S&P's relative strength index ended last week at 90, its highest level on record. Its price-to-earnings ratio hit 18.44 times forward earnings this week, its highest level since May 2002.\nEven with the potential for pullbacks, Wren remains bullish on the equities market this year. Wells Fargo has a 2,800 to 2,900 price target on the S&P 500, wrapping the S&P 500's current levels as of the Tuesday close. The target suggested 4.5 percent to 8.5 percent upside from where the S&P 500 started the year.\nExpected economic expansion and the passage of tax reform pushed Wren to increase his S&P 500 earnings forecast to $152 a share this year from a previous target of $138 a share. This year's target is up from $129 a share in 2017.\nFor this stage of the cycle, Wren recommends the industrials, consumer discretionary and financials sectors to his clients, sectors that are \"very sensitive to the economy\" and will \"continue to benefit from an ongoing expansion.\"\n\"We want them to be assertive, we do not want them getting defensive,\" he said. \"We want them leaning toward economically sensitive sectors.\"\nThe three sectors Wren recommends are among the top performers on Wall Street this year. The consumer discretionary sector is the best performer on the S&P 500, gaining 10 percent in 2018, while the financials sector is up 6 percent and industrial sector 5 percent.\nshow chapters Market selloff an opportunity, not a threat, says Wells Fargo's Scott Wren 3:10 PM ET Tue, 30 Jan 2018 | 10:06 Vote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-31T14:48:00.000+02:00", "crawled": "2018-01-31T15:01:33.013+02:00", "highlightTitle": ""}