{"organizations": [], "uuid": "6171bd1fe47246f212464ed545f27ee025b40d2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://app.feed.informer.com/digest3/VLZEFJTITH.atom", "section_title": "World News Review", "url": "https://www.reuters.com/article/us-australia-gaymarriage/midnight-marriages-usher-in-australias-same-sex-wedding-laws-idUSKBN1EY0AO", "country": "US", "domain_rank": 408, "title": "Midnight marriages usher in Australia's same-sex wedding laws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T05:43:00.000+02:00", "replies_count": 0, "uuid": "6171bd1fe47246f212464ed545f27ee025b40d2c"}, "author": "", "url": "https://www.reuters.com/article/us-australia-gaymarriage/midnight-marriages-usher-in-australias-same-sex-wedding-laws-idUSKBN1EY0AO", "ord_in_thread": 0, "title": "Midnight marriages usher in Australia's same-sex wedding laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - At the stroke of midnight and in the early hours of Tuesday morning dozens of same-sex couples exchanged wedding vows across Australia as laws making the nation the 26th in the world to legalize gay marriage took effect.\n“It was just magical,” Diana Ribeiro told Special Broadcasting Service television, after her minute-past-midnight marriage in Melbourne to her wife Deanne Ribeiro was solemnized before about 60 cheering guests.\n“For me Deanne’s always been my wife, always been the love of my life and today’s not going to change that, it’s just about equality really, and being able to finally be legal in Australia,” she said.\nAustralian’s parliament voted to legalize same-sex marriage in December after a nationwide postal survey returned an overwhelming majority in favor of the unions.\nThe survey result prompted relief, then celebration among campaigners who had for decades pushed for change, and later cheers and singing on the floor of parliament when the law passed. Some Australian states ruled homosexual acts to be illegal until just 20 years ago.\nBecause a month’s notice is required for the state to recognize a marriage, the Rieberos’ wedding and several other same-sex marriages reported in the local press were among the first to be recognized under the new laws.\nSeveral same-sex couples already wed in December after the notice period was waived for reasons such as one member of the couple falling gravely ill, or to allow a legal wedding to go ahead when a non-binding ceremony was already planned.\nReligious organizations and conservative lawmakers had voiced strong opposition to same-sex marriage and pressed unsuccessfully for broad protections for religious objectors, which would have allowed florists and bankers to refuse service to same-sex couples if the unions were legalized.\nReporting by Tom Westbrook; Editing by Michael Perry\n ", "external_links": [], "published": "2018-01-09T05:43:00.000+02:00", "crawled": "2018-01-09T09:41:59.402+02:00", "highlightTitle": ""}