{"organizations": [], "uuid": "223fbd589c5333d708488a41235aa3c1cbd402f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "‘They’re Hunting. The People Are Hungry!’ Venezuelans Are Rioting Over Food Shortages – Fortune", "url": "http://fortune.com/2018/01/11/venezuela-food-riots/", "country": "US", "domain_rank": 1196, "title": "‘They’re Hunting. The People Are Hungry!’ Venezuelans Are Rioting Over Food Shortages", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T06:53:00.000+02:00", "replies_count": 0, "uuid": "223fbd589c5333d708488a41235aa3c1cbd402f0"}, "author": "Reuters", "url": "http://fortune.com/2018/01/11/venezuela-food-riots/", "ord_in_thread": 0, "title": "‘They’re Hunting. The People Are Hungry!’ Venezuelans Are Rioting Over Food Shortages", "locations": [], "entities": {"persons": [{"name": "carlos paparoni", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "merida", "sentiment": "none"}, {"name": "paparoni", "sentiment": "none"}], "organizations": [{"name": "merida", "sentiment": "none"}, {"name": "information ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 11:53 PM EST \nHungry mobs ransacked a food collection center, and a supermarket in Venezuela’s western Andean state of Merida on Thursday and reportedly even slaughtered cattle grazing in a field as unrest over food shortages spread through the country. \nAn opposition lawmaker from Merida, Carlos Paparoni, said four people had died and 10 were injured in the chaos over the last two days, but he did not specify the circumstances. \nFour years of recession and the world’s highest inflation have plunged millions of Venezuelans into poverty, and President Nicolas Maduro’s authoritarian socialist regime faces mounting unrest. \nVenezuela’s Information Ministry did not respond to a request for information about the latest disturbances to rock the nation of 30 million people. \nLooters plundered a truck carrying corn, a food collection center, and a state-run supermarket, according to Paparoni, and a vet who witnessed the mayhem. \nA video on social media also showed around a dozen men running into a lush pasture, chasing a cow, and then apparently beating it to death. \n“They’re hunting. The people are hungry!” says the narrator of the video, who filmed the incident from his car. Lawmaker Paparoni said some 300 animals were believed to have been killed. Reuters could not verify the information. \nZuley Urdaneta, a 50 year-old vet in Merida, witnessed the looting of a truck along the highway around 2 p.m. on Thursday afternoon. About two hours later, he said some 800 people converged on a food collection center and proceeded to plunder it. \n“They knocked down the gates and looted flour, rice, cooking oil, cooking gas,” said Urdaneta. “The police and the National Guard tried to control the situation by giving out what was left.” \nFor more on the crisis in Venezuela, watch Fortune’s video: \nLooting has been increasing in the provinces since Christmas, with food shortages and hyperinflation leaving millions of people hungry, though the capital, Caracas, has so far been largely unaffected. \nThe opposition says Maduro’s failed economic policies and rampant corruption are to blame for the meltdown in the once booming country home to the world’s largest crude reserves. \n“What we’re living is barbaric,” said opposition lawmaker Juan Guaido in a tweet referencing the slaughter the cattle. “The dehumanizing regime of Nicolas Maduro is turning a blind eye to the tragedy that we Venezuelans are living.” \nMaduro’s government accuses political opponents and business-friendly foreign powers of trying to foment a social uprising against him by stoking inflation and hoarding food. \nIn what they said was an attempt to combat “speculation,” authorities last week forced over 200 supermarkets to slash prices, creating chaos as desperate Venezuelans leapt at the chance to buy cheaper food. \nSome supermarkets were sold out of fruit and vegetables, and staff were unsure if the shelves would be replenished. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T06:53:00.000+02:00", "crawled": "2018-01-12T06:53:56.001+02:00", "highlightTitle": ""}