{"organizations": [], "uuid": "a4a7e6590cc624399ab86085384e692793ead401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955838-GettyImages-81855794.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/stormy-daniels-sex-scandal-wont-harm-trump-commentary.html", "country": "US", "domain_rank": 767, "title": "The Stormy Daniels 'sex scandal' won't hurt Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T20:52:00.000+02:00", "replies_count": 0, "uuid": "a4a7e6590cc624399ab86085384e692793ead401"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/stormy-daniels-sex-scandal-wont-harm-trump-commentary.html", "ord_in_thread": 0, "title": "The Stormy Daniels 'sex scandal' won't hurt Trump", "locations": [], "entities": {"persons": [{"name": "stormy daniels", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "clifford", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "stephanie clifford", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "trump gregg", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It can be hard to keep track of all the scandals connected to President Donald Trump . But the latest of them was impossible to miss: The Wall Street Journal's blockbuster report revealing that then-candidate Donald Trump paid a former porn star hush money to cover up their affair .\nThe story has spawned a flurry of other reports about Trump and porn star Stormy Daniels, (real name Stephanie Clifford), complete with particularly salacious and embarrassing details for everyone involved.\nAll of this begs a two-part question: Will this story cause any real political harm to Trump, and why hasn't it really hurt him already?\nThe answer to the first part of the question is: \"No.\"\nThe answer to the second part is: \"See the answer to the first part.\"\nThere are two reasons for these answers. First, there is no alleged crime here. If Clifford had been paid off with direct campaign funds, then that would be a problem. But the Journal report says the money allegedly paid to Clifford came from the Trump Organization.\nSecond, America's left, right, and middle no longer seem all that sensitive to consensual sex \"scandals.\"\n\"The religious right in America has clearly decided to overlook Trump's personal failings and history in return for his backing on key social issues.\" Revelations of consensual extramarital affairs are hardly an Achilles heel in politics anymore. The fact that President Bill Clinton weathered the Lewinsky scandal and saw his peak approval ratings at the height of the scandal proved that beyond any doubt.\nBut what about the crucial Republican Evangelical voting base? Couldn't or shouldn't this be a killer for them?\nThere, too, the answer is \"no.\" That's because the religious right in America has clearly decided to overlook Trump's personal failings and history in return for his backing on key social issues.\nBefore anyone starts throwing the word \"hypocrisy\" around or feeling all too sure that Christian groups are ditching their supposed principles, remember what's happened to Evangelicals over just the last few years.\nThey've been called hate mongers and they face threats of financial retaliation for refusing to agree with the Supreme Court's decision to legalize gay marriage. They took enormous criticism for supporting North Carolina's now-overturned transgender bathroom law .\nAnd it's not just gay issues. Abortion and contraceptive laws are also a sore spot. Remember the Obama administration pulled out all the stops to fight the Little Sisters of the Poor as that Catholic organization sued to be exempt from providing contraceptive care to its employees under the Affordable Care Act.\nTo say that the religious right in America often feels under siege for a variety of reasons is an understatement.\nEnter Donald Trump. He was by no means the Evangelicals' favorite GOP primary candidate at the start of the 2016 election process. But he was able to win them over with his statements about abortion and the crucial release of his top choices for Supreme Court justice just as he was about to clinch the number of delegates to win the Republican nomination. Then he chose Evangelical favorite Mike Pence as his running mate. And even though he spoke out for gay rights at his convention acceptance speech in July of 2016, it was clear by then that Trump had won over the religious right.\nThis was true even though Trump was already a twice-divorced man, known for sexual promiscuity, and exhibiting a public persona that's a far cry from textbook Christian humility. It stayed true through the Access Hollywood audiotape scandal.\nOn Election Day, the Evangelical loyalty to Trump was clearer than ever. He won 81 percent of the Evangelical vote according to Gallup. That was a greater percentage of that vote than George W. Bush, John McCain, or Mitt Romney captured.\nIn return, those Evangelicals can hardly be disappointed in Trump's policies. He nominated and helped push through the confirmation of conservative judge Neil Gorsuch to the Supreme Court. He's cut the guts out of Obamacare by repealing the individual coverage mandate in the tax reform law. He's rolled back contraceptive requirements for employers, and his attorney general, Jeff Sessions, is now pushing for religious practices in the workplace.\nJust this week, the White House also announced it would create a new office to protect the religious rights of health care providers, including those who oppose abortions.\nQuid pro quo is in full effect when it comes to Trump and religious voters.\nIt's those religious voters who are the only ones left in America likely to really object to the president's 10-year-old affair with a porn star. Sure, this story is going to grab some nice ratings and millions of clicks. But with no key voting group flipping its support for Trump because of it, this is just another \"Storm\" that's going to pass.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-19T20:52:00.000+02:00", "crawled": "2018-01-19T20:59:00.012+02:00", "highlightTitle": ""}