{"organizations": [], "uuid": "7cd7fa11ba2de137d1536f7431d47c04ad1dbedc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/21/104857004-GettyImages-860933692.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/trump-hasnt-made-the-dollar-great-again-but-he-might-like-it-weak.html", "country": "US", "domain_rank": 767, "title": "Trump hasn't made the dollar great again, and he apparently likes it that way", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "7cd7fa11ba2de137d1536f7431d47c04ad1dbedc"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/trump-hasnt-made-the-dollar-great-again-but-he-might-like-it-weak.html", "ord_in_thread": 0, "title": "Trump hasn't made the dollar great again, and he apparently likes it that way", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "matt cardy", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "marc chandler", "sentiment": "none"}, {"name": "chandler", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "brown brothers harriman", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "bank of america merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Days before he was inaugurated, then- President-elect Donald Trump shocked the currency world by saying the dollar was too strong.\nIn the year since his inauguration, the dollar index has lost 10 percent. A weak dollar helps U.S. exports and boosts foreign earnings of U.S. corporations.\nTrump's words may have crushed a number of dollar long positions, but they aren't the reason the currency has been lagging and is now at a three-year low.\n\"I think the dollar might be being punished not because of what's going on in the U.S., but by what's going on in Europe and Japan,\" said Marc Chandler, head of fixed income strategy at Brown Brothers Harriman. \"People are buying Europe and Japan. ... It's the relative business cycle. They are about to begin their adjustment process.\"\nChandler and strategists at Bank of America Merrill Lynch say they expect the dollar to start strengthening. One caveat would be if Trump were to pursue protectionist strategies or start a trade war, which would send the dollar lower against the euro and yen.\nBen Randol, BofA's G-10 foreign exchange strategist, said he had expected the dollar to begin 2018 with a first-quarter gain, but the global central banks are working against it.\nThe Bank of Japan's adjustment in its quantitative easing purchases last week sparked speculation that it would tighten sooner than expected. The European Central Bank has also cut its QE purchases in half, and there's speculation it could end the program altogether later this year.\nThe market has been ignoring rising U.S. interest rates and the fact the Fed has forecast three interest-rate hikes for this year. Many economists expect it to do even more.\n\"There's a lot of Fed hiking that has yet to be priced in,\" said Randol. \"We see a lot of upside dollar risks going into this quarter.\"\nRandol said one thing that could help the dollar is the anticipated repatriation of cash by U.S. companies, which are responding to changes in the tax law. Apple on Wednesday announced it would pay a tax of $38 billion on repatriated funds, leading to speculation it will bring back $245 billion from overseas.\nBut Chandler said he expects that to be marginal since U.S. companies have already put that cash into Treasurys or dollar-denominated commercial paper to avoid currency risks.\nWhat he does expect to see is a migration toward the dollar again because of interest rate differentials. Plus, European officials have begun to warn that the euro is too strong, something that could hit the export-driven European economy.\n\"This is a reverse of last year. Beginning last year, everyone and their sister was bullish the dollar. ... Now everyone is bearish , but bullish the yen and bullish the euro. The key is going to be interest rate differentials,\" Chandler said. \"It's paying you more to be long dollars than it has in a generation ... since the late 1990s.\"\nHe noted a U.S. 10-year Treasury yields more than 2.57 percent, while a 10-year German bund yields 0.55, and the U.S. 2-year is now yielding 2.04 percent — to the 2-year bund's negative 0.58 yield.\nChandler also said European politics could begin to hit the euro, including the possible need for Germany to hold another election if it can't form a government. Its Socialist Democratic party meets Sunday.\nIn Spain, Catalan's wish to separate continues to be a problem for the government, and in Italy, former Prime Minister Silvio Berlusconi's party is edging up.", "external_links": [], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T14:31:57.006+02:00", "highlightTitle": ""}