{"organizations": [], "uuid": "3c12ec60af59f32cb55f6e6e099f8668c0571017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://app.feed.informer.com/digest3/VLZEFJTITH.atom", "section_title": "World News Review", "url": "https://www.reuters.com/article/us-usa-japan-helicopter-okinawa/japan-calls-on-u-s-to-take-safety-steps-in-wake-of-okinawa-military-incidents-idUSKBN1EY099", "country": "US", "domain_rank": 408, "title": "Japan calls on U.S. to take safety steps in wake of Okinawa military incidents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T05:10:00.000+02:00", "replies_count": 0, "uuid": "3c12ec60af59f32cb55f6e6e099f8668c0571017"}, "author": "", "url": "https://www.reuters.com/article/us-usa-japan-helicopter-okinawa/japan-calls-on-u-s-to-take-safety-steps-in-wake-of-okinawa-military-incidents-idUSKBN1EY099", "ord_in_thread": 0, "title": "Japan calls on U.S. to take safety steps in wake of Okinawa military incidents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japanese officials on Tuesday called on the United States to take thorough measures to protect Japanese citizens a day after a U.S. helicopter made an emergency landing on the grounds of a hotel on the southern island of Okinawa.\nThe emergency landing, coming just days after a similar mishap, was the latest in a series of incidents involving U.S. military aircraft in Okinawa that have further fueled public opposition to the U.S. presence there.\nJapanese Defence Minister Itsunori Onodera told a news conference that in a morning telephone call with U.S. counterpart James Mattis he had called on the United States to prevent any recurrences.\n“We are asking the United States to take thorough measures,” he said, adding that he intended to repeat the message when he meets U.S. Pacific Commander Harry Harris later this week.\nJapanese media reported that Mattis had apologized for the latest incident, but Onodera made no reference to this, although he said he felt Mattis is “thoroughly aware” of the issue.\nChief Cabinet Secretary Yoshihide Suga echoed Onodera’s concerns, telling a news conference that while U.S.-Japanese deterrence was important in an increasingly fraught regional security situation, the understanding and cooperation of Japanese locals was essential for the U.S. military to carry out its duties well.\n“These accidents, which create fear on the part of local residents, must not happen,” he added.\nResentment has simmered among residents of the southern Japanese island who bemoan what they see as an unfair burden in supporting the U.S. military presence in Japan.\nAmong recent incidents, a USMC transport helicopter made an emergency landing on an Okinawan beach on Saturday because of a faulty rotor. Earlier, a window fell from a military aircraft onto a school playground.\nLocated strategically at the edge of the East China Sea, Okinawa, which was under U.S. occupation until 1972, hosts some 30,000 military personnel living and working on bases that cover a fifth of the island.\nReporting by Elaine Lies; Editing by Michael Perry\n ", "external_links": [], "published": "2018-01-09T05:10:00.000+02:00", "crawled": "2018-01-09T10:15:02.570+02:00", "highlightTitle": ""}