{"organizations": [], "uuid": "40f52190de85476d1e723e9393f4be0da996803a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/26/102296101-454548894.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/failed-atlantic-city-casino-is-sold-could-reopen-in-months.html", "country": "US", "domain_rank": 767, "title": "Failed Atlantic City casino is sold, could reopen in months", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T19:49:00.000+02:00", "replies_count": 0, "uuid": "40f52190de85476d1e723e9393f4be0da996803a"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/failed-atlantic-city-casino-is-sold-could-reopen-in-months.html", "ord_in_thread": 0, "title": "Failed Atlantic City casino is sold, could reopen in months", "locations": [], "entities": {"persons": [{"name": "bruce deifik", "sentiment": "negative"}, {"name": "glenn straub", "sentiment": "none"}, {"name": "deifik", "sentiment": "none"}], "locations": [{"name": "atlantic city", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "trump taj mahal", "sentiment": "none"}, {"name": "ocean resort casino", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Atlantic City's most spectacular casino flop is getting another chance under new ownership and a new name.\nColorado developer Bruce Deifik said Monday he had purchased Atlantic City's former Revel casino hotel from Florida businessman Glenn Straub for $200 million. He plans to reopen it this summer, around the same time the former Trump Taj Mahal casino will reopen nearby under the Hard Rock brand.\nThe former Revel will be called the Ocean Resort Casino. Deifik called the purchase \"a dream come true.\"\nBut the news raises a sobering question for a gambling resort that only recently regained its equilibrium following the shutdown of five of its 12 casinos: Might the sudden reintroduction of two large casinos create the same conditions that led to the wave of shutdowns in the first place?\nRevel's sale was finalized Thursday afternoon, during a blizzard, a fitting development for a project with a turbulent history. It cost $2.4 billion to build, yet lasted just over two years before shutting down, never having come close to turning a profit.\nDeifik is undeterred.\n\"We are incredibly excited that we were able to take advantage of the opportunity to acquire this tremendous property at a time when Atlantic City is seeing great economic strides,\" he said. \"The former Revel property opened at a time when Atlantic City was still in economic recovery, and operationally it just did not cater to the customer base for this destination.\"\nOne new amenity Deifik plans is a sports book facility that would operate if New Jersey wins its U.S. Supreme Court case to legalize sports betting.\nHe said the casino will employ 2,500 to 3,000 people. It has 1,399 hotel rooms. The gambling area will offer 100 table games and 2,200 slot machines.\nDeifik said he plans to bring back some of the restaurants that were popular at Revel, along with some new ones, including an Asian noodle bar. He also plans a high-end players' club.\nDeifik is president and CEO of Integrated Properties, which owns 103 commercial properties in five states, including the Hyatt Grand Champions Resort in Palm Springs, California, and several office and retail centers in the Denver and Phoenix areas.\nAnalysts are mixed on whether Atlantic City's seven operating casinos can handle two more competitors. Some say the reopenings could hurt smaller casinos and possibly lead one or more to close, but others are optimistic the new offerings — particularly the music-themed, globally known Hard Rock brand — can bring new customers who otherwise would not have traveled to Atlantic City.\nRevel opened in 2012, with no less an aim than to rewrite the rules of success in Atlantic City's casino market. It eschewed bus-riding, buffet-patronizing day trippers in favor of a hoped-for clientele of Wall Street traders, hedge fund execs and the highest of high-rollers. It was the only Atlantic City to ban smoking.\nNone of it worked.\nThe $13 million in casino winnings it took in its first month ranked it near the bottom of Atlantic City's 12 casinos — a spot it would occupy for its two-year existence. It went bankrupt twice, choking on massive debt it couldn't come close to paying, and closed on Sept. 2, 2014.\nStraub, a Polo-loving multimillionaire, bought it for $82 million from bankruptcy court and then fought with state officials over whether he needed a casino license. He said Monday he bought Revel \"to keep and not to sell.\" But he quickly tangled with government regulations at the local and state levels that he said frustrated his plans to spend hundreds of millions of dollars to help redevelop Atlantic City.\nStraub sold the property for $118 million more than he paid for it, but he incurred large expenses while keeping it closed.\nBut what Straub described as burdensome red tape are rules that all Atlantic City's other casino owners comply with. And a significant portion of his expenses involved legal fees incurred in fighting government regulations with which he disagreed.\nStraub said he retains more than 60 Atlantic City properties, with which he plans to \"be a spark for catalyzing positive economic movement in Atlantic City.\"\nThe closest he got to reopening Revel came with the partial installation of a rope-climbing course in what used to be the casino's port cochere area. But even that modest venture failed and was ripped out while half-finished.\nBefore settling on a reopened casino and hotel, Straub floated a wide variety of proposed uses for the property. They included a water park; condominiums; a health-themed spa; an equestrian facility; a so-called \"tower of geniuses\" where the world's top minds would gather to tackle society's problems, and a temporary home for Syrian refugees.", "external_links": [], "published": "2018-01-08T19:49:00.000+02:00", "crawled": "2018-01-08T20:27:04.007+02:00", "highlightTitle": ""}