{"organizations": [], "uuid": "f2dd47624c6cf9389d6ea85ce907063df30343b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928319-GettyImages-814600256.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/facebook-shouldnt-show-any-news-at-all.html", "country": "US", "domain_rank": 767, "title": "Facebook should get rid of its news product entirely", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T21:18:00.000+02:00", "replies_count": 0, "uuid": "f2dd47624c6cf9389d6ea85ce907063df30343b5"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/facebook-shouldnt-show-any-news-at-all.html", "ord_in_thread": 0, "title": "Facebook should get rid of its news product entirely", "locations": [], "entities": {"persons": [{"name": "lyons", "sentiment": "none"}, {"name": "tessa lyons", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "washington post", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook said it's going to limit the amount of news its users see soon.\nWhat it should really do is take news off the platform entirely.\nWe shouldn't be looking to a social media platform that established itself as a place to connect with friends and family to read about local, national and world events.\nThere are several reasons why.\nFirst, Facebook had already proved it isn't capable of splitting real news from fake propaganda , though at least it says it's working on it.\nSecond, it's using news as a business model — so much so that shares fell as much as 6.1 percent this morning after the changes were announced. It sells ads and promotes content from some publishers, which means it stands to make cash off of the most popular news stories ... no matter how accurate they are.\nSadly, that has led news organizations to use Facebook as a means to drive traffic, but not to create an established audience.\nThe Verge's Casey Newton hit the nail right on the head:\nread tweet \nOr this one, from The Information's Jessica Lessin, nails it again:\ntweet \nI remember, for example, that there used to be an easy way to game Facebook traffic to a news site simply by writing about any of the trending stories posted on the news feed. It drove crazy amounts of people to blogs and other organizations, but never people who came back.\nAnd as for the fake news problem, Facebook even admits that earlier attempts to stop it from spreading actually did the exact opposite. In a blog post last month, Facebook product manager Tessa Lyons said that red flags that it posted next to stories that were meant to identify false news were actually doing the opposite.\n\"Academic research on correcting misinformation has shown that putting a strong image, like a red flag, next to an article may actually entrench deeply held beliefs – the opposite effect to what we intended,\" Lyons said. \nYikes.\nFacebook has forced the hands of some news organizations to change for the worse — pivoting to sometimes short but often unimportant videos about cats in pajamas instead of real topics, like what's on the front page of The New York Times, The Washington Post, CNBC, Bloomberg and other established first-rate news organizations.\nMake no mistake: It would have devastating effects on sites that rely on Facebook for traffic and revenue. It'll also force publishers to get back to what we do best — what we're supposed to be doing in the first place — reporting first and generating traffic second (we do need to pay the bills after all, right?). It'll create new traffic that accumulates through an audience who wants to return because they expect high quality content. (Obviously, Facebook can't stop users from sharing news articles in their feeds.)\nOtherwise we face another problem: The possibility of requiring some sort of government regulation of Facebook's news feed. That would help cut down on propaganda and fake news, but it also sets a dangerous precedent where the government might one day be able to regulate more of the news media, whether it's on Facebook or other platforms.\nFacebook says it's moving away from news, and that's a step, but it's time for it to shut down the news operation entirely.", "external_links": [], "published": "2018-01-12T21:18:00.000+02:00", "crawled": "2018-01-12T21:30:43.008+02:00", "highlightTitle": ""}