{"organizations": [], "uuid": "45b539790f1c997a4054fbaab9ca0b270bdaaf43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "President Trump Says Quitting NAFTA Would Yield the ‘Best Deal’ for the U.S. – Fortune", "url": "http://fortune.com/2018/01/17/donald-trump-terminate-nafta-renegotiation/", "country": "US", "domain_rank": 1196, "title": "President Trump Says Quitting NAFTA Would Yield the ‘Best Deal’ for the U.S.", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T03:57:00.000+02:00", "replies_count": 0, "uuid": "45b539790f1c997a4054fbaab9ca0b270bdaaf43"}, "author": "Reuters", "url": "http://fortune.com/2018/01/17/donald-trump-terminate-nafta-renegotiation/", "ord_in_thread": 0, "title": "President Trump Says Quitting NAFTA Would Yield the ‘Best Deal’ for the U.S.", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "u.s. u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump Says Quitting NAFTA Would Yield the 'Best Deal' for the U.S. President Donald Trump in the Cabinet Room at the White House Jan. 9, 2018 in Washington, DC. Chip Somodevilla—Getty Images By Reuters 8:57 PM EST \nU.S. President Donald Trump on Wednesday said that terminating the North American Free Trade Agreement would result in the “best deal” to revamp the 24-year-old trade pact with Canada and Mexico in favor of U.S. interests. \nLawmakers as well as agricultural and industrial groups have warned Trump not to quit NAFTA, but he said that may be the outcome. \n“We’re renegotiating NAFTA now. We’ll see what happens. I may terminate NAFTA,” Trump said in an interview with Reuters. \n“A lot of people are going to be unhappy if I terminate NAFTA. A lot of people don’t realize how good it would be to terminate NAFTA because the way you’re going to make the best deal is to terminate NAFTA. But people would like to see me not do that,” he said. \nTrump‘s comments come less than a week before trade negotiators from the United States, Canada and Mexico meet in Montreal for the sixth of seven scheduled rounds of negotiations to update NAFTA. \nThe talks are viewed as pivotal for the success of the NAFTA renegotiation effort because major differences remain over aggressive U.S. demands on autos, dispute settlement and a five-year sunset clause—proposals that some business groups have labeled “fatal.” \nTrump discussed NAFTA and other trade issues last weekend in Florida with U.S. Trade Representative Robert Lighthizer, who is leading the U.S. negotiating strategy. \nTrump‘s comments appeared to validate concerns voiced last week by Canadian government sources that the U.S. president, now a year in office, looked increasingly likely to announce a pullout from NAFTA. \nCanadian Foreign Minister Chrystia Freeland added that U.S. threats to quit NAFTA had to be taken seriously. \nFor Canadian Prime Minister Justin Trudeau’s take on NAFTA, watch Fortune’s video: \nThe Reuters interview with Trump also reversed gains on Wednesday in Mexico’s peso, which has been highly sensitive to NAFTA withdrawal talk. \nBut Trump told the Wall Street Journal last week that he would be “a little bit flexible” on the withdrawal threat. \nFarm state lawmakers have been making the case to Trump in recent weeks that a NAFTA withdrawal could cause a major tariff increase on U.S. corn and other crops sold to Mexico, hurting a major political support base for Trump in the rural United States. \nOn Monday, automakers from Detroit and around the world urged the Trump administration not to quit NAFTA and to back away from some of its demands in the negotiations. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T03:57:00.000+02:00", "crawled": "2018-01-18T03:57:20.000+02:00", "highlightTitle": ""}