{"organizations": [], "uuid": "70bf0554bd7c1fd34bd1fdfee692d98aaf054231", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/08/104888879-GettyImages-888602372.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/us-will-no-longer-allow-oil-drilling-off-florida-coast.html", "country": "US", "domain_rank": 767, "title": "Trump administration says no oil drilling off Florida coast", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T03:09:00.000+02:00", "replies_count": 0, "uuid": "70bf0554bd7c1fd34bd1fdfee692d98aaf054231"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/us-will-no-longer-allow-oil-drilling-off-florida-coast.html", "ord_in_thread": 0, "title": "Trump administration says no oil drilling off Florida coast", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "rick scott", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}, {"name": "joe raedle", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "pensacola", "sentiment": "none"}, {"name": "atlantic ocean", "sentiment": "none"}, {"name": "pensacola bay center", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}], "organizations": [{"name": "renewable energy trump", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration said Tuesday it would not allow oil drilling off the coast of Florida, abruptly reversing course under pressure from Republican Gov. Rick Scott .\nJoe Raedle | Getty Images President Donald Trump walks on stage as he holds a rally at the Pensacola Bay Center on December 8, 2017 in Pensacola, Florida. Interior Secretary Ryan Zinke said after a brief meeting with Scott at the Tallahassee airport that drilling would be \"off the table\" when it comes to waters in the eastern Gulf of Mexico and the Atlantic Ocean off Florida.\nThe change of course — just five days after Zinke announced the offshore drilling plan —highlights the political importance of Florida, where President Donald Trump narrowly won the state's 29 electoral votes in the 2016 election and has encouraged Scott to run for Senate.\nThe state is also important economically, with a multi billion-dollar tourism business built on sunshine and miles and miles of white sandy beaches. Zinke said Tuesday that \"Florida is obviously unique\" and that the decision to remove the state came after meetings and discussion with Scott.\nZinke announced plans last week to greatly expand offshore oil drilling from the Atlantic to the Arctic and Pacific oceans, including several possible drilling operations off Florida, where drilling is now blocked. The plan was immediately met with bipartisan opposition on both the Atlantic and Pacific coasts.\nScott, who is expected to run for Senate later this year, came out against the Trump administration plan when it was first announced, saying his top priority is to ensure that Florida's natural resources are protected.\nshow chapters What happens to oil when US opens federal waters to offshore drilling? 2:12 AM ET Fri, 5 Jan 2018 | 03:02 Other Republican governors also oppose the plan, including Maryland Gov. Larry Hogan, South Carolina Gov. Henry McMaster and Massachusetts Gov. Charles Baker. \"For Floridians we are not drilling off the coast of Florida, which clearly the governor has expressed that's important,\" Zinke said, adding that he knew when he announced the drilling plan last week that it would spark discussion across the country.\n\"Our tactic was open everything up, then meet with the governors, meet with the stakeholders so that when we shaped it, it was right,\" he told reporters at a news conference Tuesday night. \"The president made it very clear that local voices count.\"\nWhen asked what caused the administration to change its position on Florida drilling, Zinke said bluntly, \"The governor.\" Scott said he was pleased at the administration's change of heart.\n\"It's a good day for Florida,\" he said, adding, \"I think it's very important to continue our efforts to take care of our environment.\"\nDemocratic Sen. Bill Nelson said the meeting with Zinke was \"a political stunt orchestrated by the Trump administration to help Rick Scott,\" who Nelson said has long wanted to drill off Florida's coast.\n\"I have spent my entire life fighting to keep oil rigs away from our coasts. But now, suddenly, Secretary Zinke announces plans to drill off Florida's coast and (five) days later agrees to `take Florida off the table'? I don't believe it,\" Nelson said in a statement. \"We shouldn't be playing politics with the future of Florida.\"\nshow chapters Here's why a lot of Florida homes survived Hurricane Irma 4:07 PM ET Mon, 18 Sept 2017 | 01:00 Zinke said last week that the drilling plan called for responsible development that would boost jobs and economic security while providing billions of dollars to fund conservation along U.S. coastlines.\nThe five-year plan would open 90 percent of the nation's offshore reserves to development by private companies, Zinke said, with 47 leases proposed off the nation's coastlines from 2019 to 2024. Nineteen sales would be off Alaska, 12 in the Gulf of Mexico, nine in the Atlantic and seven in the Pacific, including six off California.\nIndustry groups praised the announcement, the most expansive offshore drilling proposal in decades. The plan follows Trump's executive order in April encouraging more drilling rights in federal waters , part of the administration's strategy to help the U.S. achieve \"energy dominance\" in the global market.\nA coalition of more than 60 environmental groups denounced the plan, saying it would impose \"severe and unacceptable harm\" to America's oceans, coastal economies, public health and marine life.", "external_links": [], "published": "2018-01-10T03:09:00.000+02:00", "crawled": "2018-01-10T03:44:14.002+02:00", "highlightTitle": ""}