{"organizations": [], "uuid": "83e1fe1485ab88a12a09c78175e2c434975f4520", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965203-RTX476I4-alex-azar.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/senate-confirms-alex-azar-as-president-donaldtrumps-health-chief.html", "country": "US", "domain_rank": 767, "title": "Senate confirms former drug exec Alex Azar as Trump's health chief", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T21:48:00.000+02:00", "replies_count": 0, "uuid": "83e1fe1485ab88a12a09c78175e2c434975f4520"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/senate-confirms-alex-azar-as-president-donaldtrumps-health-chief.html", "ord_in_thread": 0, "title": "Senate confirms former drug exec Alex Azar as Trump's health chief", "locations": [], "entities": {"persons": [{"name": "alex azar ii", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "joshua roberts", "sentiment": "negative"}, {"name": "alex azar", "sentiment": "negative"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "azar", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "senate finance committee", "sentiment": "negative"}, {"name": "eli lilly and co", "sentiment": "none"}, {"name": "hhs", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "health and human services", "sentiment": "none"}, {"name": "u.s. health and human services department", "sentiment": "none"}, {"name": "medicaid", "sentiment": "none"}, {"name": "yale law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Senate confirmed the nomination of former drug company executive Alex Azar as head of the U.S. Health and Human Services Department on Wednesday.\nAzar's long-expected approval as HHS secretary puts him in a charge of a department with a trillion-dollar budget that oversees the massive Medicare and Medicaid health coverage systems, drug regulatory bodies, disease-fighting agencies and the ever-controversial Obamacare health reform law.\nThe Senate voted 55-43 in favor of Azar's appointment.\nThe 50-year-old Azar is a veteran of HHS, having served for two years as deputy secretary and before that as general counsel of the department, both during the administration of President George W. Bush.\nIn 2017, the Yale Law grad ended a five-year stint as president of the U.S. division of pharmaceuticals giant Eli Lilly and Co .\nDemocratic senators during Azar's recent confirmation hearings highlighted the price increases of Lily's drugs while he was at the company, and given that history were skeptical of his claims to intend to fight rising drug costs as HHS chief.\nAzar is the first person with a pharmaceutical industry background to lead the health agency.\nWhen President Donald Trump announced Azar's nomination in November , the president tweeted that \"He will be a star for better healthcare and lower drug prices!\"\nAnd two former HHS chiefs under Bush, Tommy Thompson and Mike Leavitt, wrote in The Hill that Azar \"has the necessary experience, skills, motivation and integrity\" to run the department.\nHHS had been without a secretary since September, when Trump's original pick for the job, Dr. Tom Price, resigned amid controversy over his use of private and expensive charter jets for official travel.\nPrice's departure came while Trump and his Republican allies in Congress were pushing legislation that sought to repeal and replace key parts of the Affordable Care Act, as Obamacare is formally known.\nThose efforts failed, repeatedly, in the Senate . But the recently passed tax law did effectively eliminate, starting in 2019, the ACA requirement that most Americans have some form of Obamacare-compliant health coverage or pay a fine.\nAzar opposes the ACA, which has led to criticism of his nomination from groups that support Obamacare.\nOn Wednesday, The Washington Post reported that the Trump administration is looking into expanding access to hardship exemptions from Obamacare's coverage mandate, making it easier for people to avoid the existing penalty for not having insurance.\nAzar, who also clerked for late conservative Supreme Court Justice Antonin Scalia, also has contributed to politicians who oppose abortion rights.\nAfter the Senate Finance Committee voted Tuesday to advance Azar's nomination to the full Senate, the abortion rights group NARAL Pro-Choice blasted the move.\n\"It is sad, but not surprising, that Donald Trump is so desperate to install another anti-choice ideologue at HHS, an agency that's critical for women's healthcare. HHS has a duty to protect the health, rights, and reproductive freedom of women all across America, and Azar's clear and consistent anti-choice record should disqualify him from such an influential position,\" said NARAL spokeswoman Kaylie Hanson Long.", "external_links": [], "published": "2018-01-24T21:48:00.000+02:00", "crawled": "2018-01-24T21:56:52.037+02:00", "highlightTitle": ""}