{"organizations": [], "uuid": "57e8cf962b36fa1e49011cb5df5513056d3fa7fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104907389-RTX3VCLF.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/paul-ryan-warns-dems-about-playing-games-with-government-shutdown-daca-deal.html", "country": "US", "domain_rank": 767, "title": "Paul Ryan warns Democrats against 'playing political games' with government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T17:36:00.000+02:00", "replies_count": 0, "uuid": "57e8cf962b36fa1e49011cb5df5513056d3fa7fa"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/paul-ryan-warns-dems-about-playing-games-with-government-shutdown-daca-deal.html", "ord_in_thread": 0, "title": "Paul Ryan warns Democrats against 'playing political games' with government shutdown", "locations": [], "entities": {"persons": [{"name": "wedne", "sentiment": "negative"}, {"name": "paul ryan", "sentiment": "negative"}, {"name": "ryan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc.com shares  house", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House Speaker Paul Ryan warned on Wednesday against \"playing political games\" as Democrats threatened to block a last-ditch spending deal this week if they cannot also pass a plan to protect young undocumented immigrants from deportation.\nParts of the government will shut down if Congress cannot pass a spending bill by the end of Friday. The GOP has framed passing funding legislation as crucial to supporting American military and national security efforts. \n\"For people to hold up money for our military for these unrelated issues — and for deadlines that don't even exist this Friday — that makes no sense,\" Ryan told reporters. \nRepublicans have control of the House, Senate and White House and can pass a spending bill on their own. Some Republicans, however, have criticized the notion of passing another short-term funding plan. Congress in late December last approved a stopgap bill through Friday. \nHouse Republicans hope to pass another temporary measure this week to extend government funding through Feb. 16. It would reauthorize the Children's Health Insurance Program for six years and delay some Affordable Care Act taxes .\nThe GOP does not plan to approve legislation this week to shield hundreds of thousands of young immigrants who were protected by the Obama-era Deferred Action for Childhood Arrivals, which President Donald Trump ended in September. The immigrants could start to face deportation after March 5. \nOn Wednesday morning, Senate Minority Leader Chuck Schumer called the funding measure a \"loser.\" He added that Democrats \"will do everything we can\" to avoid a shutdown. \n\"If, God forbid, there's a shutdown, it will fall on the majority leader's shoulders and the president's shoulders,\" Schumer said on the Senate floor. \nSchumer decried Trump's rejection of an immigration deal bipartisan senators brought to him Thursday. It would have protected the immigrants shielded by DACA and made concessions to Republicans, including increasing funding for some border security measures and making changes to extended family migration. \nEarlier last week, Trump signaled to bipartisan lawmakers that he would sign whatever they passed. \nIn remarks Wednesday, Senate Majority Leader Mitch McConnell said bipartisan talks on immigration continued, but added that he did not believe the issue needed to be resolved this week. \n\"There's no cause whatsoever for manufacturing a crisis and holding up funding for the vital services of the federal government,\" McConnell said.", "external_links": [], "published": "2018-01-17T17:36:00.000+02:00", "crawled": "2018-01-17T17:46:21.010+02:00", "highlightTitle": ""}