{"organizations": [], "uuid": "484f4641dd1d91f8189f471f1d856bfe5160ba5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/27/102623358-453863898.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/home-equity-hits-record-high-heres-how-homeowners-are-spending-it.html", "country": "US", "domain_rank": 767, "title": "Home equity hits record high, and here's how homeowners are spending it", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T18:45:00.000+02:00", "replies_count": 0, "uuid": "484f4641dd1d91f8189f471f1d856bfe5160ba5d"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/home-equity-hits-record-high-heres-how-homeowners-are-spending-it.html", "ord_in_thread": 0, "title": "Home equity hits record high, and here's how homeowners are spending it", "locations": [], "entities": {"persons": [{"name": "suzanne kreiter", "sentiment": "negative"}, {"name": "steve cunningham", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "williamsburg", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "boston globe", "sentiment": "negative"}, {"name": "national association of home builders", "sentiment": "none"}, {"name": "td bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook Home equity hits record high, and here's how homeowners are spending it Remodeling spending topped $152 billion in 2017, and is forecast to increase in 2018. Homeowners are using home equity cash to pay down other debt in order to lower monthly payments. Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Home equity hits record high, and here's how homeowners are spending it Diana Olick, CNBC Published 2:27 p.m. ET Jan. 10, 2018 CLOSE With fewer homes for sale today, would-be buyers are having to get creative about making their bid stand out. USA TODAY Real Estate is constantly rising a safe investment. If you’re considering taking out a home equity loan, here are 13 things you need to know first. (Photo: Getty Images/iStockphoto) CONNECT COMMENT EMAIL MORE Homeowners are racking up record amounts of home equity , thanks to fast-rising values in today's competitive housing market. No surprise, more people are now starting to tap that cash. What are they spending it on? Mostly making their homes even more valuable. Renovation spending is soaring, and 80% of borrowers taking out home equity lines of credit say they would consider using that money to renovate, according to a survey released in December by TD Bank. \"We're not only seeing more requests for proposals, but more committed projects from homeowners,\" said Steve Cunningham, a remodeler from Williamsburg, Virginia, in a report from the National Association of Home Builders. \"In addition to regular updates and repairs, there's been an uptick in more ambitious large remodel requests.\" Remodeling spending topped $152 billion in 2017, and renovations for owner-occupied single-family homes will increase 4.9% in 2018 over 2017, according to the NAHB. That does not include remodeling done by investors looking to flip or rent properties, both of which are increasing as well. \"Below-normal rates of home building are creating an aging housing stock,\" said Paul Emrath, vice president of survey and housing policy research at the NAHB. \"Factors inhibiting stronger growth include the ongoing labor shortage and rising material prices.\" An older housing stock, combined with not enough new homes being built, means more people will choose to renovate.", "external_links": [], "published": "2018-01-10T18:45:00.000+02:00", "crawled": "2018-01-10T18:55:05.006+02:00", "highlightTitle": ""}