{"organizations": [], "uuid": "5fda4ecfbd404929c69f2da01f12731b3a5c443e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/07/103448928-103448928-GettyImages-514173146.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/stocks-making-the-biggest-moves-premarket-shld-stz-sonc-aapl-tgt-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: SHLD, STZ, SONC, AAPL, TGT & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T15:12:00.000+02:00", "replies_count": 0, "uuid": "5fda4ecfbd404929c69f2da01f12731b3a5c443e"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/stocks-making-the-biggest-moves-premarket-shld-stz-sonc-aapl-tgt-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: SHLD, STZ, SONC, AAPL, TGT & more", "locations": [], "entities": {"persons": [{"name": "spencer platt", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "aapl", "sentiment": "negative"}, {"name": "sonc", "sentiment": "negative"}, {"name": "sears", "sentiment": "none"}, {"name": "kmart", "sentiment": "none"}, {"name": "cal-maine foods", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "xilinx", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell :\nSears Holdings — The company announced Thursday it is closing 64 Kmart stores and 39 Sears establishments. Sears said the shutdowns are expected to start between early March and April.\nConstellation Brands — The beer maker reported better-than-expected quarterly earnings. The company also raised its earnings-per-share guidance for fiscal 2018.\nXilinx — Goldman Sachs upgraded the semiconductor's stock to \"buy\" from \"neutral,\" noting signs of an improving demand outlook for its communications business. The analysts also raised their price target on the stock to $78 from $72.\nCal-Maine Foods — Cal-Maine Foods reported adjusted earnings and revenue that surpassed Reuters estimates. The stock fell more than 4 percent in the premarket, however, after the company said it will not pay a dividend for the first two quarters of fiscal 2018.\nSonic — The fast-food restaurant's shares jumped 4 percent before the bell after the company reported quarterly earnings that surpassed analysts' expectations. Sonic also expects fiscal 2018 earnings to grow between 5 percent and 10 percent.\nWingstop — Wingstop shares were downgraded to \"neutral\" from \"outperform\" at Wedbush Securities. The analysts said in a note they believe 2018 expectations for the company \"could prove overly optimistic.\"\nTyson Foods — Analysts at Piper Jaffray initiated coverage of Tyson Foods with an \"overweight\" rating and a price target of $94 per share. In a note, analysts cited management's strategy to focus on \"growing more value-added products to expand margins and reduce volatility.\"\nTarget , Lowe's — Shares of both retailers were upgraded at Barclays, with analysts citing a stimulus to retailers from the recent tax code overhaul and \"improved flexibility to make necessary investments without negatively impacting EPS results.\"\nApple — Apple Music executive Jimmy Iovine could leave the company in August, Billboard reported, citing sources . Billboard said his departure is likely timed to his Apple shares fully vesting.", "external_links": [], "published": "2018-01-05T15:12:00.000+02:00", "crawled": "2018-01-05T15:20:13.001+02:00", "highlightTitle": ""}