{"organizations": [], "uuid": "5d95237e1893a02adf597c773d2ece33d15f17fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/28/104738821-work_from_home.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/heres-how-trello-sets-remote-workers-up-for-success.html", "country": "US", "domain_rank": 767, "title": "Here's how Trello sets its remote workers up for success", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T21:36:00.000+02:00", "replies_count": 0, "uuid": "5d95237e1893a02adf597c773d2ece33d15f17fe"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/heres-how-trello-sets-remote-workers-up-for-success.html", "ord_in_thread": 0, "title": "Here's how Trello sets its remote workers up for success", "locations": [], "entities": {"persons": [{"name": "pryor", "sentiment": "none"}, {"name": "michael pryor", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "aetna", "sentiment": "negative"}, {"name": "ibm", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "negative"}, {"name": "mins ago cnbc.com  recently", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "trello trello", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Recently, major companies like IBM, Aetna and Bank of America have called their remote employees back in the office to improve collaboration and productivity. But one CEO who has vowed to keep his remote policy and prove its effectiveness is Trello's Michael Pryor. \nHe tells CNBC Make It that his New York City-based company implemented a remote policy in 2012 after making an exception for a talented developer who had to relocate for personal reasons. Now, with 60 percent of the 100-person company taking advantage of the flexible work option, Trello uses a non-traditional screening process to ensure a candidate is a good fit for their culture. \nRather than relying on the standard in-person interview, Pryor tests an applicant's ability to communicate and work effectively outside of the office by screening everyone via a video call and asking questions about their at-home work space. \nPhoto courtesy of Trello Trello CEO Michael Pryor \"If we decide to hire someone then we go through this process of asking, 'Do you have an office with a door that closes? If you don't and you live in a studio, then you have to go find a co-working space if you take this job,\" Pryor says he tells all applicants. \nDepending on the candidate's response, Trello will either help the potential employee purchase a desk and chair for their home office or pay for them to work out of a co-working space.\n\"We spend a lot of time at the end of an interview trying to figure out if someone is set up for success before they start working,\" he says. \nPryor also makes a conscious effort to ensure all employees at his company feel a sense of collaboration regardless of whether they are in the office or at home. \n\"There is this sort of middle ground where you have to force yourself to create a level playing field for everyone in order for that remote person to be successful and for that arrangement to be successful,\" he says. \"What I mean by that is you don't have a meeting where everyone is in a conference room and that one person is on a screen. You all just get on the video conference from your desk.\"\nPhoto courtesy of Trello Leah Ryder, who leads content and marketing at the company, says Trello isn't the first employer she's worked for that has a remote work option. However, she says the project management company is the first organization she's worked for where she has felt supported as a remote employee. She credits this support to the company's \"embrace remote\" motto. \n\"It is different than 'remote-friendly' or '100 percent remote,'\" she says. \"Trello is not a place that just tolerates or is even merely friendly toward remote, it prioritizes communication channels and inclusionary practices that provide remote and in-office team members with equal experiences and opportunities.\"\nIn addition to virtual business meetings, Pryor also mandates Friday meetings where out-of-office and in-office employees from different sectors of the company discuss things outside of work.\n\"We randomly pair up four people in a meeting every Friday for a half an hour just to talk about anything,\" he says. \"It's not even work-related. You just get to spend time with somebody that you would not be working with.\"\nPryor adds that the key for any employer looking to implement an effective remote work policy is to create an equal playing field where out-of-office employees don't feel excluded from in-office opportunities to connect with others.\n\"You can be a developer but you might run into a person on the marketing team at lunch,\" he says, \"but when you are remote that doesn't happen as much and you have to create a space for that.\"\nLike this story? Like CNBC Make It on Facebook \nDon't miss: 10 work-from-home companies that offer unlimited paid time off \nshow chapters Tired of your desk job? These jobs pay well and will get you moving.      1:28 PM ET Wed, 14 Dec 2016 | 01:06", "external_links": [], "published": "2018-01-26T21:36:00.000+02:00", "crawled": "2018-01-26T21:52:10.012+02:00", "highlightTitle": ""}