{"organizations": [], "uuid": "c6a81ab1bea1afd73f162eca6f99797bb16e3a37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Spotify IPO: What You Need to Know About This Unusual Event – Fortune", "url": "http://fortune.com/2018/01/15/spotify-ipo-date-why-know-tech/", "country": "US", "domain_rank": 1196, "title": "Spotify IPO: What You Need to Know About This Unusual Event", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T02:56:00.000+02:00", "replies_count": 0, "uuid": "c6a81ab1bea1afd73f162eca6f99797bb16e3a37"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/15/spotify-ipo-date-why-know-tech/", "ord_in_thread": 0, "title": "Spotify IPO: What You Need to Know About This Unusual Event", "locations": [], "entities": {"persons": [{"name": "spotify", "sentiment": "none"}], "locations": [{"name": "spotify", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "goldman sachs group inc.", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "morgan stanley and allen & co", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}, {"name": "ecm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7:56 PM EST \nThe initial public offering of Spotify, the music-streaming service, is almost here. \nWhat is expected to be the largest tech IPO of 2018—it’s certainly the most anticipated—will likely take place in late March or April. \nSpotify plans to list on the New York Stock Exchange—but there’s a catch. Instead of a traditional IPO that makes shares available to the general public, Stockholm-based Spotify will opt to directly list on the exchange , making its shares available only to institutional investors and eliminating the need for underwriters, a.k.a. the banks that set an initial price, connect sellers and buyers, and provide the cash necessary to stabilize the stock. Some people have already called it a “non-IPO.” \nThe move could shake up Wall Street . IPOs are usually a lucrative business for investment banks, but in the last few years revenues from equity capital market (ECM) fees have dropped. \nSpotify paid just $30 million in ECM fees to three banks: Goldman Sachs Group Inc., Morgan Stanley and Allen & Co. Those institutions will perform some of the traditional tasks expected of them, but in a less prominent way. \nWhy the novel strategy? Spotify can buck tradition because, though it’s not yet turning a profit, it is earning cash, and it is not planning on raising more revenue from investors. Spotify, as measured by either its subscription service or its ad-supported free version, is the most popular music streaming service, according to the New York Times . \nCommentators say it’s a good time for Spotify to go public. The company has 60 million paying subscribers, just renegotiated long-term licensing deals with three major record labels, and is valued at about $15 billion. (It is, however, facing a copyright suit from Wixen Music Publishing, filed in late December 2017.) \nThe Wall Street Journal says that due to other companies’ need for cash, “it is far from guaranteed” that more will follow Spotify’s lead. However, according to Bloomberg , Spotify “could create a new model for growth companies in which they raise all their money in private markets and do all their trading in public ones, with some small variations.” \nWhatever the case, Wall Street will be watching. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T02:56:00.000+02:00", "crawled": "2018-01-16T02:56:45.054+02:00", "highlightTitle": ""}