{"organizations": [], "uuid": "1e69fedee7bb7eedd629858d09391ec8c67df738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 17}, "facebook": {"likes": 317, "shares": 317, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226148646&w=1200&r=LYNXMPEE0S02B", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-autos-selfdriving-usa-poll/most-americans-wary-of-self-driving-cars-reuters-ipsos-poll-idUSKBN1FI034", "country": "US", "domain_rank": 408, "title": "Most Americans wary of self-driving cars: Reuters/Ipsos poll", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T03:07:00.000+02:00", "replies_count": 0, "uuid": "1e69fedee7bb7eedd629858d09391ec8c67df738"}, "author": "", "url": "https://www.reuters.com/article/us-autos-selfdriving-usa-poll/most-americans-wary-of-self-driving-cars-reuters-ipsos-poll-idUSKBN1FI034", "ord_in_thread": 0, "title": "Most Americans wary of self-driving cars: Reuters/Ipsos poll", "locations": [], "entities": {"persons": [{"name": "paul lienert", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters/ipsos", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Two-thirds of Americans are uncomfortable about the idea of riding in self-driving cars, according to a Reuters/Ipsos opinion poll, underscoring one of many challenges for companies spending billions of dollars on the development of autonomous vehicles.\nWhile 27 percent of respondents said they would feel comfortable riding in a self-driving car, poll data indicated that most people were far more trusting of humans than robots and artificial intelligence under a variety of scenarios.\nThe Reuters/Ipsos poll found a wide disparity of opinion by gender and age, with men generally more comfortable than women about using self-driving vehicles and millennials more comfortable than baby boomers. ( tmsnrt.rs/2DD4h4W )\nAmong men, 38 percent said they would feel comfortable riding in a self-driving car and 55 percent said they would not. Among women, only 16 percent said they would feel comfortable and 77 percent said they would not.\nAmong those skeptical of driverless cars was California resident Phoebe Barron. “I don’t want to be the first guinea pig,” she said in an interview.\nColorado resident Sonja Coy told Reuters she had a more positive view. Self-driving cars “are a great innovation and technology with a lot of potential,” she said.\n“However, I‘m concerned with how liability will fall in the case of accidents, where there are both self-driving and regular cars on the road,” Coy said.\nFILE PHOTO: Waymo unveils a self-driving Chrysler Pacifica minivan during the North American International Auto Show in Detroit, Michigan, U.S., January 8, 2017. REUTERS/Brendan McDermid/File Photo Like most people, she said she had not yet ridden in a self-driving vehicle. Companies testing the vehicles in the United States and elsewhere have provided limited public access so far.\n“We’re talking about abstract things that many people have not experienced firsthand,” said Jeremy Carlson, principal automotive analyst with IHS Markit.\nAutomotive and technology industry executives are pushing U.S. lawmakers to pass legislation that would loosen restrictions on testing and deploying self-driving cars. However, the legislation is currently stalled in the Senate.\nIn the meantime, companies from General Motors Co to Alphabet Inc’s Waymo are planning to deploy the first wave of self-driving vehicles over the next three years.\nIndustry officials and analysts have said providing convincing reassurances about safety is an urgent task for advocates of autonomous vehicle technology.\nThe Reuters/Ipsos poll was conducted in mid-January and collected responses from 2,592 adults.\nOther recent surveys have also highlighted widespread doubts among U.S. consumers about self-driving cars, in the absence of any direct experience with them.\nReporting by Paul Lienert in Detroit; Additional reporting by Chris Kahn in New York; Editing by Tom Brown\n ", "external_links": [], "published": "2018-01-29T03:07:00.000+02:00", "crawled": "2018-01-29T03:16:08.001+02:00", "highlightTitle": ""}