{"organizations": [], "uuid": "1cb020ce9d2ca233528ea98783cde502bee59cef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/06/103284069-103284069-Photo_Oct_06.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/intel-earnings-q4-2017.html", "country": "US", "domain_rank": 767, "title": "Intel set to report earnings after the bell", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T22:45:00.000+02:00", "replies_count": 0, "uuid": "1cb020ce9d2ca233528ea98783cde502bee59cef"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/intel-earnings-q4-2017.html", "ord_in_thread": 0, "title": "Intel set to report earnings after the bell", "locations": [], "entities": {"persons": [{"name": "justin solomon", "sentiment": "negative"}, {"name": "brian krzanich", "sentiment": "negative"}, {"name": "romit shah", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc intel", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "nomura instinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Intel stock rose more than 4.5 percent after the company released better-than-expected earnings for the fourth quarter of 2017 on Thursday. The company will hold a conference call with analysts at 5 p.m. Eastern time.\nEPS: Excluding certain items, $1.08 in earnings per share vs. $0.86 in earnings per share as expected by analysts, according to Thomson Reuters. Revenue: $17.05 billion vs. $16.35 billion as expected by analysts, according to Thomson Reuters. The company's total revenue for the quarter was up 4 percent year over year. And for the full year revenue came in at $62.8 billion, which was up 6 percent.\nIntel's biggest segment, the Client Computing Group, brought in $9 billion, down 2 percent year over year, in the fourth quarter. But the second largest segment, the Data Center Group, grew 20 percent, with $5.6 billion in revenue. Both groups beat FactSet consensus estimates, which were $8.73 billion from the former and $5.09 billion from the latter, according to StreetAccount.\nThe company has faced pressure around its handling of the Meltdown and Spectre security vulnerabilities , which were disclosed on Jan. 3.\nThe issues affect chips made by several companies, although the Meltdown issue has had an especially large impact on Intel's processors. On Wednesday, a House committee said it had sent letters to Intel CEO Brian Krzanich and other tech leaders to learn about why Intel and other companies had withheld information about the issues for months before publicly announcing them.\nIndeed, Intel acknowledged controversies related to the security issues in the forward-looking statements sections of the earnings report :\nWe have and may continue to face product claims, litigation, and adverse publicity and customer relations from security vulnerabilities and/or mitigation techniques, including as a result of side-channel exploits such as \"Spectre\" and \"Meltdown,\" which could adversely impact our results of operations, customer relationships,and reputation. Separately, the publicity around recently disclosed security vulnerabilities may result inincreased attempts by third parties to identify additional vulnerabilities, and future vulnerabilities and mitigation of those vulnerabilities may also adversely impact our results of operations, customer relationships, and reputation.\nIntel had a one-time charge of $5.4 billion because of U.S. tax reform. Intel is expecting a 14 percent tax rate through 2018, and the company announced a 10 percent increase to its quarterly cash dividend that's tied to the tax changes.\nIn terms of guidance, for the first quarter of 2018 Intel said it's expecting $0.70 per share, give or take 5 cents, excluding certain items, on $15 billion in revenue, give or take $500 million. Analysts were expecting $0.72 per share, excluding certain items, on $15.03 billion in revenue, according to Thomson Reuters.\nAnd for all of 2018, Intel said it's expecting $3.55 in earnings per share, plus or minus 5 percent, on $65 billion in revenue, plus or minus $1 billion. Analysts had been expecting $3.27 in earnings per share on $63.80 billion in revenue for the full year, according to Thomson Reuters.\nIn the fourth quarter, Intel announced that it had hired the head of AMD's graphics business , Raja Koduri, and that it would begin making discrete graphics cards — an area where Nvidia is the market leader. Also, Krzanich sent employees a memo in which he said the company would take more risks.\nIntel stock is down about 2 percent since the beginning of the year.\nThis is breaking news. Please check back for updates.", "external_links": [], "published": "2018-01-25T22:45:00.000+02:00", "crawled": "2018-01-25T23:01:33.009+02:00", "highlightTitle": ""}