{"organizations": [], "uuid": "54ed0eb329595f39156f7155d7d1ae9af96c5d0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/19/104718426-GettyImages-663601290-nike.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/if-you-invested-1000-in-nike-10-years-ago-heres-what-youd-have-now.html", "country": "US", "domain_rank": 767, "title": "If you invested $1,000 in Nike 10 years ago, here’s what you’d have now", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T21:43:00.000+02:00", "replies_count": 0, "uuid": "54ed0eb329595f39156f7155d7d1ae9af96c5d0c"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/if-you-invested-1000-in-nike-10-years-ago-heres-what-youd-have-now.html", "ord_in_thread": 0, "title": "If you invested $1,000 in Nike 10 years ago, here’s what you’d have now", "locations": [], "entities": {"persons": [], "locations": [{"name": "ameri", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "nike", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial website How Much took a look at some of America's most popular stocks in 2007 to find out how much a $1,000 investment in each would be worth now. Based on its data, sports apparel and equipment company Nike was a safe bet: A $1,000 investment in Nike in 2007 would be worth $3,319 as of October 31, or more than three times the initial investment.\nOf the companies How Much examined, Nike's performance ranked fifth, falling short only of Starbucks , Apple , Amazon and Netflix . It should be said, though, that Netflix outperformed the other companies by a lot: A $1,000 investment in 2007 grew to $51,966 in the same time frame.\nIn the graphic below, the blue dots are equivalent to a $1,000 initial investment, and the pink dots equal the investment's current total value.\n\"The larger the pink circle, the more your investment is worth,\" according to How Much. \"If the pink fits inside the blue, then you lost money. The [graphic] assumes that you took any dividend paid out in cash and did not reinvest into the company by buying more stock.\"\nAny individual stock can over- or under-perform and past returns do not predict future results.\nSome investors also have concerns about Nike. Susan Anderson of capital-market company B. Riley FBR says in a recent episode of \" Squawk on the Street \" that that's because the athletic-apparel and footwear environments in the future will look a lot different than they have in the past.\nAnd while the athletic apparel environments \"have been very robust over the past 5 to 10 years,\" Anderson says she doesn't anticipate the same type of growth going forward, or at least not initially. \nMany companies, including Nike, are attempting to take product distribution directly to their consumers since, according to Nike chief executive officer Mark Parker, retail consolidation has decelerated the overall market.\nRandal Konik of investment-banking company Jefferies Group tells \"Squawk on the Street\" that for Nike, as a mostly \"wholesale-oriented business model, it's going to take time and it's going to take a lot of choppiness in terms of [its distribution] fundamentals.\"\nAs a sponsor to a number of high-profile sports teams, including those in the NFL and NBA , and with sneaker collaborations with top athletes like LeBron James , though, others see potential for the stock's continued growth.\nIf you're just considering getting into stocks , experts advise beginning carefully. Experienced investors such as Warren Buffett, Mark Cuban and Tony Robbins suggest you start with index funds .\nIndex funds hold every stock in an index such as the S&P 500 and offer low turnover rates, attendant fees and tax bills. They also fluctuate with the market and eliminate the risk of picking individual stocks.\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: If you invested $1,000 in Google 10 years ago, here's how much you'd have now \nVideo by Richard Washington \nshow chapters Investing in these stocks would have made you rich by now — here's other ways to invest your money      7:26 AM ET Wed, 29 Nov 2017 | 01:17", "external_links": [], "published": "2018-01-17T21:43:00.000+02:00", "crawled": "2018-01-17T22:07:28.003+02:00", "highlightTitle": ""}