{"organizations": [], "uuid": "739b4d434a14b2f6aaa4a95613f8248ae00307c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/02/02/102389752-451834356.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/if-you-put-1000-in-disney-10-years-ago-heres-what-youd-have-now.html", "country": "US", "domain_rank": 767, "title": "If you invested $1,000 in Disney 10 years ago, here’s what you’d have now", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T21:17:00.000+02:00", "replies_count": 0, "uuid": "739b4d434a14b2f6aaa4a95613f8248ae00307c0"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/if-you-put-1000-in-disney-10-years-ago-heres-what-youd-have-now.html", "ord_in_thread": 0, "title": "If you invested $1,000 in Disney 10 years ago, here’s what you’d have now", "locations": [], "entities": {"persons": [{"name": "wall stre", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}], "organizations": [{"name": "disneyland", "sentiment": "negative"}, {"name": "disney", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Disneyland and its related theme parks are sometimes called the happiest places on Earth. If you had invested in Disney itself 10 years ago, you might be partaking in some of that happiness, too.\nFinancial website How Much took a look at some popular American stocks from ten years ago to find out how much a $1,000 investment in each would be worth now. It estimates that a $1,000 investment in Disney in 2007 would be worth $2,824 as of October 31.\nDisney's performance came in just shy of Google's holding company, Alphabet's.\nIn the graphic below, the blue dots are equivalent to a $1,000 initial investment, and the pink dots equal the investment's current total value. \"The larger the pink circle, the more your investment is worth,\" according to How Much. \"If the pink fits inside the blue, then you lost money. The [graphic] assumes that you took any dividend paid out in cash and did not reinvest into the company by buying more stock.\"\nRemember, any individual stock can over- or under-perform . However, some Wall Street execs feel optimistic about Disney's announcement that it will buy parts of Twenty-First Century Fox in a deal worth $52.4 billion in stock.\nAmong other acquisitions, the company will take on Fox's movie studios, networks Nat Geo and FX, and stakes in Hulu and regional sports networks. The deal will also give Disney more content as it plans to launch its own streaming service to compete with services like Netflix , whose stock proved to be an even better bet over the past decade.\nDisney also plans to launch a stand-alone ESPN digital service.\nThe company \"remains best positioned in the current fragmented media landscape to leverage its content across a growing number of distribution channels, its global theme parks and consumer products,\" according to Stan Meyers, vice president and senior research analyst at investment bank and asset management firm Piper Jaffray.\nInvestors and entertainment stars alike are taking notice. Most recently, American rapper Kanye West bought his wife, reality TV star and entrepreneur Kim Kardashian, stocks in major companies such as Netflix , Amazon , Apple and Adidas. The bundle included 920 shares of Disney , worth about $100,000, according to Kardashian's Instagram.\nIf you're looking to invest in a company yourself or pass on shares to a loved one, since they can make great gifts , begin carefully and remember that past returns do not predict future results. Experienced investors Warren Buffett, Mark Cuban and Tony Robbins suggest you start with index funds .\nIndex funds hold every stock in an index such as the S&P 500, including big-name brands such as Microsoft and Google, and offer low turnover rates, attendant fees and tax bills. They also fluctuate with the market, stay pretty constant and eliminate the risk of picking individual stocks.\nDisclosure: Comcast, which owns CNBC parent NBCUniversal, is a co-owner of Hulu.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: If you invested $1,000 in bitcoin in 2013, here's how much you'd have now\nVideo by Andrea Kramar\nshow chapters Here's how young people should invest their first $10,000 7:12 PM ET Tue, 15 Nov 2016 | 00:53", "external_links": [], "published": "2018-01-03T21:17:00.000+02:00", "crawled": "2018-01-03T21:35:17.005+02:00", "highlightTitle": ""}