{"organizations": [], "uuid": "437eefe3f711e8c2575ad1ebbc0f37b310291feb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936959-GettyImages-902997454.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/trumps-pick-to-head-hhs-balks-at-negotiating-drug-prices.html", "country": "US", "domain_rank": 767, "title": "Trump's pick to head HHS balks at having government negotiate drug prices", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T01:24:00.000+02:00", "replies_count": 0, "uuid": "437eefe3f711e8c2575ad1ebbc0f37b310291feb"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/trumps-pick-to-head-hhs-balks-at-negotiating-drug-prices.html", "ord_in_thread": 0, "title": "Trump's pick to head HHS balks at having government negotiate drug prices", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "alex azar", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "azar", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hhs", "sentiment": "negative"}, {"name": "eli lilly", "sentiment": "none"}, {"name": "senate finance committee", "sentiment": "none"}, {"name": "u.s. health and human services department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While President Donald Trump has repeatedly expressed support for allowing the government to negotiate drug prices, his pick to head the U.S. Health and Human Services Department, Alex Azar, says he doesn't think it would be the magic bullet that would bring costs down.\n\"Where we can do so that preserves innovation, that preserves access for patients, I want anything that's going to help us with drug pricing … I think that we should be looking at those approaches,\" said Azar, who was the former U.S. president of drugmaker Eli Lilly and once served as deputy director of HHS during the George W. Bush administration.\nDuring his confirmation hearing before the Senate Finance Committee , Azar said in some circumstances it does make sense for the government to seek volume discounts for a health emergency.\n\"If the government is the purchaser, let's say for instance, we are going to be buying (drugs) as part of the opioid crisis program, and we're directly buying that and supplying it out to states and first responders, there's absolutely nothing wrong with the government negotiating that,\" he explained.\nBut when it comes to allowing the Medicare program to negotiate drug prices, that's where Azar splits with Trump. Under current law, private Medicare Part D drug plans administered by insurers do negotiate drug discounts, but the traditional Medicare program is prohibited from doing so.\n\"For the government to negotiate … we would have to have a single national formulary that restricted access to all seniors for medicines,\" he explained, noting that was the conclusion reached by the Congressional Budget Office under the Obama administration. \"That would be only thing that could change. I don't believe we want to go there in restricting patient access.\"\nUsing formulary plans that favor some drugs over others is how insurers, large employers and pharmacy benefit management firms secure deep discounts from pharmaceutical firms.\n\"For Medicare negotiating to work, they would have to say that some drugs are not available because they are too expensive, effectively creating a single set of drugs available for the elderly,\" said Craig Garthwaite, the director of Northwestern University's Kellogg's Health Enterprise Management Program. \"Frankly, that doesn't appear to be something that Americans are prepared for at this point.\"\nIn a heated exchange with democratic Senator Claire McCaskill , D.-Mo., Azar argued that the government would not be able to get any better pricing than private insurers and pharmacy benefit managers do for Medicare drug plans.\n\"But they're getting paid to do that. The government could do it directly … wouldn't that save us money?\" McCaskill countered.\n\"They do it better than the government would,\" Azar maintained.\n\"To his point, it is complicated to negotiate — there are so many drugs on the market, you'd literally have to have a contract for every drug on existence,\" said Les Funtleyder, a health care portfolio manager at E Squared Capital Management. But he added that pricing pressures will not go away for the government or drugmakers with more baby boomers aging into Medicare.\n\n\"Even if Alex Azar is approved,\" Funtleyder said, \"these are issues that are going to be with us forever ... until we come to a decision on how we want our health care to be.\"", "external_links": [], "published": "2018-01-10T01:24:00.000+02:00", "crawled": "2018-01-10T01:58:09.001+02:00", "highlightTitle": ""}