{"organizations": [], "uuid": "d09400c5cdbbe15caa81349619a4bf770dfea18b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/12/101664136-106894463.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/12/closing-sams-club-is-a-good-move-for-walmart-says-ex-us-ceo-bill-simon.html", "country": "US", "domain_rank": 767, "title": "Closing some Sam's Club stores allows Walmart to focus on what works, says ex-US chief", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T17:11:00.000+02:00", "replies_count": 0, "uuid": "d09400c5cdbbe15caa81349619a4bf770dfea18b"}, "author": "", "url": "https://www.cnbc.com/2018/01/12/closing-sams-club-is-a-good-move-for-walmart-says-ex-us-ceo-bill-simon.html", "ord_in_thread": 0, "title": "Closing some Sam's Club stores allows Walmart to focus on what works, says ex-US chief", "locations": [], "entities": {"persons": [{"name": "sam", "sentiment": "positive"}, {"name": "bill simon", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "positive"}, {"name": "cnbc", "sentiment": "none"}, {"name": "walmart u.s.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The closure of some Sam's Club locations is a good move for Walmart , the retail giant's former U.S. chief Bill Simon told CNBC on Thursday.\nWalmart, which owns Sam's Club, announced on Thursday it is shutting down or converting 10 percent, or 63 of the membership-only retail warehouse stores around the country.\n\"It's allowing them to focus on things that are working,\" Simon said on \" Closing Bell .\"\nThe things that are working for Walmart, according to Simon, are the Walmart branded brick-and-mortar stores and its online shopping destination.\n\"This is endemic of the transition that retail is in,\" said Simon, who served as president and CEO of Walmart U.S. from 2010 to 2014.\n\"Retailers who figure out a sweet spot, or something they need to be famous for, have been very, very effective,\" he added. \"But those who have just been OK at executing their plan haven't done very well.\"\nWalmart has made its mark as a leader in low price and wide variety.\nDespite the closure of many brick-and-mortar stores across the country, Walmart shares have gained about 60 percent in the past two years.\nMeanwhile, stores like Sam's Club, which lacks a clear specialty and faces stiff competition with Costco , have not done well.\nThe announcement came on the same day Walmart announced its minimum wage for hourly employees would rise to $11 an hour from $9 , and employees would receive a one-time bonus of up to $1,000, depending on length of tenure. Some critics argued the move was a publicity stunt to deflect attention from the closure of Sam's Club.\nA spokesperson from Walmart told CNBC that Walmart and Sam's Clubs, while they fall under the same parent company, are in two different parts of the business.\nWalmart, which has two million employees globally , got one of the biggest breaks under the new GOP tax plan that cut the corporate rate from 35 percent to 21 percent.\nThe raise in wages will cost Walmart between $300 million and $400 million a year and another $400 million in one-time bonuses. The company credited the raise in wages to the tax break.\nSimon called the wage increase and bonuses \"just the tip of the iceberg\" when it comes to the money Walmart will see from tax reform.\n\"They have a lot of powder and a lot of money to invest,\" he said.\nMeanwhile, Natixis Americas chief economist, Joseph Lavorgna, appearing with Simon, called Walmart's pay raises and bonuses good news for the company's workers. But he argued the recent announcements about companies giving back to employees have been isolated cases.\n\"To get faster wage growth, the economy needs faster productivity growth,\" he said. \"If this tax package is to work, it will work because it galvanizes companies to spend on capital to get capital deepening, give workers the tools to actually get paid more because they're more productive.\"", "external_links": [], "published": "2018-01-12T17:11:00.000+02:00", "crawled": "2018-01-12T17:59:48.001+02:00", "highlightTitle": ""}