{"organizations": [], "uuid": "1fb5e79551dd67c5fb0f51d4c27833c6a9a8e2ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104963692-GettyImages-882769388.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/world-economic-forum-paytm-ceo-on-narendra-modi.html", "country": "US", "domain_rank": 767, "title": "India has made some big changes lately — a top entrepreneur says it's paying off", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T02:28:00.000+02:00", "replies_count": 0, "uuid": "1fb5e79551dd67c5fb0f51d4c27833c6a9a8e2ee"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/world-economic-forum-paytm-ceo-on-narendra-modi.html", "ord_in_thread": 0, "title": "India has made some big changes lately — a top entrepreneur says it's paying off", "locations": [], "entities": {"persons": [{"name": "narendra modi sin", "sentiment": "negative"}, {"name": "modi", "sentiment": "none"}, {"name": "sharma", "sentiment": "none"}, {"name": "vijay sharma", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The sweeping policy initiatives introduced by Prime Minister Narendra Modi since he came into power more than three years ago are already paying off, according to a closely watched Indian business leader. \nVijay Sharma, founder and CEO of Indian digital payments giant Paytm, said India was an opportunity waiting to happen just a few years ago. Indeed, the country's economic growth was flagging below 5 percent just before Modi became prime minister. \n\"If you look at India today, India is an opportunity happening now. That trigger has happened,\" Sharma told CNBC in Davos, Switzerland at the annual World Economic Forum meeting.\nMuch of that, he said, could be attributed to the policies enacted by Modi.\n\"He's reduced red tapes significantly, he's brought pro-business, pro-consumer growth,\" Sharma said, adding that Modi's policies are actually benefiting businesses.\nTwo major reforms that shaped India's economy under Modi include the decision to pull out old 500 and 1,000 rupee notes from circulation and replace them with newly printed 500 and 2,000 rupee notes. Then, last year, India rolled out an ambitious tax plan to replace a thicket of indirect levies that critics argued blunted economic competitiveness. \nFor companies like Paytm, India's demonetization efforts provided a significant boost as Indians scrambled onto digital payment platforms amid a massive cash crunch. \nModi has also championed for the manufacturing sector with his \"Make In India\" pitch that invited foreign companies to set up production bases in the country. Some have efforts underway: Apple began manufacturing a small batch of iPhones in India last year and Xiaomi set up multiple facilities to produce its devices. Others, particularly the Chinese, have steadily been investing in local businesses. \nIn tandem with the \"Make In India\" initiative, India has gradually loosened previous restrictions placed on foreign direct investments in various sectors. \nSharma said he was initially skeptical about India's ability to pull off its ambition to become a global manufacturing hub given that it'd face stiff competition from China. \n\"India has pulled off tremendously well,\" Sharma said. \"It's incredible — the number of factories, people and production that happen. Look at the smartphones, look at the electronics or non-electronics or the car manufacturing that happens in India.\" \nIndia, he added, was now becoming a country that was increasingly building and exporting technologies such as cloud computing software. \nThat said, market watchers will be closely watching the final full-year budget for 2018-2019 from Modi's government due next week ahead of next year's general elections. India expects its full-year growth for the current financial year to be below 7 percent.", "external_links": [], "published": "2018-01-25T02:28:00.000+02:00", "crawled": "2018-01-25T02:56:29.002+02:00", "highlightTitle": ""}