{"organizations": [], "uuid": "51ba6f965b07198b5c7574dc0c5c0493ab79ddae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/02/104073402-GettyImages-489426337.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/04/another-tiny-digital-coin-leaps-into-the-top-10-cryptocurrencies.html", "country": "US", "domain_rank": 767, "title": "Another tiny digital coin leaps into the top 10 cryptocurrencies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-04T22:10:00.000+02:00", "replies_count": 0, "uuid": "51ba6f965b07198b5c7574dc0c5c0493ab79ddae"}, "author": "", "url": "https://www.cnbc.com/2018/01/04/another-tiny-digital-coin-leaps-into-the-top-10-cryptocurrencies.html", "ord_in_thread": 0, "title": "Another tiny digital coin leaps into the top 10 cryptocurrencies", "locations": [], "entities": {"persons": [{"name": "samxmeg", "sentiment": "none"}, {"name": "litecoin", "sentiment": "none"}, {"name": "justin sun", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coinmarketcap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold Another tiny digital coin leaps into the top 10 cryptocurrencies Digital currency tron, or TRX, climbed 112 percent Thursday to 20.5 cents, according to CoinMarketCap. That put the digital coin briefly into eighth place by market capitalization. Tron's gains followed a tweet from founder Justin Sun early Thursday that the company \"will announce our partnership with a very prestigious public company next week.\" Tron is repeating a pattern seen in the last few weeks of lesser-known cryptocurrencies surging into the ranks of the largest digital currencies. SHARES Source: Samxmeg \nA digital coin worth about a dime a day ago has doubled in price, briefly climbing into eighth place among cryptocurrencies by market capitalization. \nTron climbed 112 percent Thursday to 20.5 cents, according to CoinMarketCap. The website showed that tron's latest gains gave the coin a market cap of $13.5 billion, greater than that of litecoin and just behind that of another coin, stellar. Litecoin had recovered eighth place by midafternoon Thursday. \nTron's gains followed a tweet from founder Justin Sun early Thursday that the company \"will announce our partnership with a very prestigious public company next week.\" Sun tweeted later in the day that the news would come in a live stream event on \"January 6th 10 am GMT+8 Beijing time.\" \nTron 30-days performance \nSource: CoinMarketCap \nThe company is focused on creating a blockchain-based platform for monetizing digital entertainment. Investors listed on its website include some big names in Chinese business today, such as Wei Dai, founder of bike sharing company ofo. \nTron's surge follows a pattern of the last few weeks in which lesser-known cryptocurrencies have dramatically climbed into the ranks of the top 10 coins by market cap. Ripple has soared more than 1,000 percent in the last month into second place. In just the last week, stellar has leaped more than 300 percent, climbing into the top 10 coins and rising as high as sixth place. \n\"We are seeing the beginnings of renewed speculative fever driven by fears of missing out on the big gains that have recently happened in the crypto space,\" William Mougayar, organizer of the Token Summit conferences, said in an email. \n\"Although there were some cryptocurrencies that were under-valued a month ago, and they deserved the run-up, things are getting a little over-heated right now,\" Mougayar said. \nBitcoin, the largest and most well-known digital currency, has gained 1,300 percent over the last 12 months to near $15,000, according to Coinbase. \nMuch of the buying in the smaller cryptocurrencies is coming from bitcoin holders. About 79 percent of tron trading volume was in bitcoin , and 19 percent in ethereum , according to CryptoCompare. \nIt's not clear whether tron takes its name directly from the science fiction movie, but its 10-year projected development timeline on its website has heavy references to \"Star Trek.\" The project is still in the initial \"Exodus\" stage. \nCoinMarketCap data show tron began trading in September at a tenth of a penny.", "external_links": [], "published": "2018-01-04T22:10:00.000+02:00", "crawled": "2018-01-04T22:54:58.013+02:00", "highlightTitle": ""}