{"organizations": [], "uuid": "041205de7ef3531cc769dbd0f9f14e98a35ef5d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930793-GettyImages-899559482.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/pot-stocks-take-a-hit-market-watchers-say-theyll-end-in-the-green.html", "country": "US", "domain_rank": 767, "title": "Pot stocks take a hit, but market watchers say they’ll end in the green", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T19:43:00.000+02:00", "replies_count": 0, "uuid": "041205de7ef3531cc769dbd0f9f14e98a35ef5d4"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/pot-stocks-take-a-hit-market-watchers-say-theyll-end-in-the-green.html", "ord_in_thread": 0, "title": "Pot stocks take a hit, but market watchers say they’ll end in the green", "locations": [], "entities": {"persons": [{"name": "seaburg", "sentiment": "none"}, {"name": "david seaburg", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cowen", "sentiment": "none"}, {"name": "aurora cannabis", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "20 Hours Ago | 03:03 \nPot has been hot. \nAnd despite a potential crackdown by Washington on the industry , some market watchers are optimistic on stocks related to the marijuana business. \nNames like Weed , Aurora Cannabis and Canopy Growth, all viewed as plays if investors are bullish on the weed business, fell a respective 45 percent, 6 percent and 3 percent since Thursday's open. \nMeanwhile, one exchange-traded fund related to the business, the ETFMG Alternative Harvest ETF, fell 6 percent on Thursday, but saw a bit of a bounce back and rose nearly 3 percent on Friday. This ETF is a particular favorite of David Seaburg, head of sales and trading at Cowen. This weakness should be bought here, he said Thursday on CNBC's \" Trading Nation .\" \n\"I look at it and say, 'It's a tax revenue sort of catalyst.' There's no way that local governments and attorney generals are not going to support it for that reason alone. You buy it here; MJX in particular,\" Seaburg said, referring to the ticker symbol for the ETF. \nThis most recent dip is likely a good buying opportunity for investors who can bear the high risk associated with the industry, said Mark Tepper, president and CEO of Strategic Wealth Partners. \n\"This is a really high-growth, but high-risk industry,\" Tepper said Thursday on \"Trading Nation.\" \n\"In 2017, these stocks were up 250 percent, and in light of the news [Thursday], these same stocks are down 10 to 40 percent. I think what's important for consumers to investors to realize, is sales in Colorado topped $1.3 billion and grew 32 percent year over year. California has nine times the population, and estimates $5.1 billion in 2019, which sounds really, really low. There's just a lot of tax revenue that states would be missing out on, and it just seems really unlikely that Sessions wins here,\" Tepper said, referring to U.S. Attorney General Jeff Sessions. \nSome of the biggest players in the space are listed on Canadian stock exchanges, Tepper pointed out, and noted that even if these plans were to pan out, there's still a rich market out of the country. \n\"It's a high-risk, high-reward play. For our clients, probably a little too high risk, but if you are interested in having some high-risk opportunities in your portfolio, this is probably a good buying opportunity,\" he said.", "external_links": [], "published": "2018-01-05T19:43:00.000+02:00", "crawled": "2018-01-05T20:48:15.038+02:00", "highlightTitle": ""}