{"organizations": [], "uuid": "0c3c9c45db3ae59eea5ed2dad4972aa52fbea5a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/27/102623358-453863898.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/heres-how-much-your-home-remodel-will-pay-you-back.html", "country": "US", "domain_rank": 767, "title": "Here's how much your home remodel will pay you back", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T18:00:00.000+02:00", "replies_count": 0, "uuid": "0c3c9c45db3ae59eea5ed2dad4972aa52fbea5a2"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/heres-how-much-your-home-remodel-will-pay-you-back.html", "ord_in_thread": 0, "title": "Here's how much your home remodel will pay you back", "locations": [], "entities": {"persons": [{"name": "chris herbert", "sentiment": "none"}], "locations": [], "organizations": [{"name": "harvard's joint center for housing studies", "sentiment": "none"}, {"name": "joint center for housing studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As home prices and mortgage rates rise, more and more homeowners are choosing to stay put and remodel.\nYet, depending on the project, some of the returns are diminishing. Remodeling spending is expected to approach $340 billion in 2018, a 7.5 percent increase over last year, according to Harvard's Joint Center for Housing Studies.\n\"Steady gains in the broader economy, and in home sales and prices, are supporting growing demand for home improvements,\" said Chris Herbert, managing director of the Joint Center for Housing Studies. \"We expect the remodeling market will also get a boost this year from ongoing restoration efforts in many areas of the country impacted by last year's record-setting natural disasters.\"\nMore homeowners may be remodeling, but those who do high-end projects are seeing less value in those remodels — that is, the expensive upgrades and additions are paying back less in the resale value of homes, according to an annual cost versus value report from Remodeling magazine.\n\"It's not clear if this is a sign of nervousness among real estate pros in the face of a booming housing market or if nationwide affordability concerns are leading pros to question the value of renovations that would make a house even more expensive at resale – particularly with the new tax law regarding the deductibility of mortgage interest and state, local and property taxes,\" Craig Webb, editor in chief of Remodeling, wrote in a release.\nFor those who remodel, the average payback in a home's resale value is 56 percent of the cost of the remodel, but for those who replaced things like garage doors or windows, the payback is a much higher 75 percent. That is according to real estate professionals surveyed by the magazine.\nThose values change, however, depending on geography. After all, all real estate is local. The highest remodeling returns are on the West Coast, where the average payback is 64 percent of the cost. In the Mid-Atlantic, that falls to 51 percent.\nAs for types of renovations, external changes are paying back big time. Things that increase curb appeal, as well as outdoor living, are seeing the greatest increases in payback value: garage door replacement (up 18.6 percent), wood deck additions (up 17.7 percent) and manufactured stone veneer installation (up 15.7 percent).\nThose that saw the least gains in value were interior projects: Master suite additions (down 14.7 percent) and major kitchen remodels (down 10.9 percent).\nHomeowners who decide to rein in their big ideas are also seeing bigger returns. Minor kitchen remodels pay an 81 percent return, while major high-end kitchen remodels just 59 percent. It's the same for bathrooms. Why? Taste. Not everyone likes the latest expensive trend. They do like appliances and fixtures that are functional and new.\n\"You might want a kitchen that looks like a 1980s replica from 'Stranger Things,'\" Webb said, referring to the television show. \"But the person you're selling to might hate an avocado and burnt orange color scheme. So regardless of what you spent, to the prospect that kitchen needs to go.\"", "external_links": [], "published": "2018-01-24T18:00:00.000+02:00", "crawled": "2018-01-24T18:14:58.000+02:00", "highlightTitle": ""}