{"organizations": [], "uuid": "2c68cc929fb8d4ddc577e7dd4cecae472f8638ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104910009-GettyImages-896192830.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/how-to-know-whether-your-business-qualifies-for-that-20-percent-tax-break.html", "country": "US", "domain_rank": 767, "title": "How to know whether your business qualifies for that 20 percent tax break", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-09T21:58:00.000+02:00", "replies_count": 0, "uuid": "2c68cc929fb8d4ddc577e7dd4cecae472f8638ed"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/how-to-know-whether-your-business-qualifies-for-that-20-percent-tax-break.html", "ord_in_thread": 0, "title": "How to know whether your business qualifies for that 20 percent tax break", "locations": [], "entities": {"persons": [{"name": "saul loeb", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "sepi ghiasvand", "sentiment": "none"}], "locations": [{"name": "south lawn of the white house", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}, {"name": "hopkins carley", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Saul Loeb | AFP | Getty Images President Donald Trump speaks about the passage of tax reform legislation on the South Lawn of the White House in Washington, DC, December 20, 2017. \nSmall business owners may benefit from kinder tax treatment under the new law. They should think twice before becoming incorporated. \nThe Tax Cuts and Jobs Act offers a 20 percent deduction for qualified business income from so-called pass-through entities, which include S corporations and limited liability companies. \nUnder the \"old\" tax code, income from these small businesses would \"pass-through\" to the owner on her own taxes and were subject to individual income tax rates as high as 39.6 percent. \nNow, entrepreneurs are subject to a tax break on the income their businesses generate, but many of them face a key decision: Is it now time to incorporate — and if so, what entity should you choose? \n\"Everyone wants to form an LLC,\" said Sepi Ghiasvand, who is of counsel at Hopkins Carley in Palo Alto, California. \"This is a time when an LLC can save you on taxes, but with a caveat.\" \nHere are the things to consider before incorporating your business . Not a free-for-all \nThe new tax law's 20 percent deduction on qualified business income is subject to limitations that keep it from being a free-for-all for every entrepreneur. \nIn general, to qualify for the full deduction, your taxable income must be below $157,500 if you're single or $315,000 if you're married and file jointly. \nFilers who are below those thresholds may take the deduction no matter what business they're in, said Jeffrey Levine, a certified public accountant and director of financial planning at BluePrint Wealth Alliance in Garden City, New York. \"We've seen plaintiffs' counsel pierce the corporate veil because business owners treat the corporation as a piggy bank and don't maintain bylaws\" -Rick Keller, chairman of First Foundation \nHowever, once taxable income exceeds those thresholds, the law places limits on who can take the break. For instance, entrepreneurs with service businesses — including doctors, lawyers and financial advisors — may not be able to take advantage of the deduction if their income is too high. \nFinally, partners in a business may also find themselves in a situation in which one owner gets the 20 percent deduction and the other doesn't. That's because a partner with a high-income spouse may wind up exceeding the taxable income threshold. \n\"What's fascinating is that you can have two people doing the same work for the same pay, but only one can take the deduction on their return because of other factors,\" said Levine. How it works \nThe 20 percent deduction is considered a \"between the lines\" deduction in that it doesn't lower your adjusted gross income and you don't have to itemize on your taxes in order to take it. \nGenerally, if you qualify for the deduction, the 20 percent break will apply to the lesser of your qualified business income or your taxable income minus capital gains. See below for an example from Levine of BluePrint Wealth Alliance. \nKey Facts: Joint filer with a Schedule C business has a standard deduction of $24,000Business gross income of $130,000Business expenses of $30,000Net profit from business $100,000 (qualified business income)Spouse works and makes $70,000Above-the-line deductions of $7,500 for deductible portion of self-employment tax and $20,000 for SEP IRA contribution Analysis: Taxable income before application of pass-through deduction = $118,500In this case, the taxable income of $118,500 is greater than the qualified business income of $100,000. As a result, the 20 percent pass through deduction will apply to the qualified business income, resulting in a $20,000 deduction.This couple is in the 22 percent tax bracket, so they save about $4,400 in federal taxes. LLC formation \nOne big advantage in establishing an LLC is the fact that it protects owners from having their personal assets seized by the business's creditors. \nSetting up your LLC may cost a couple hundred to a couple thousand dollars, and you'll be required to file your documents with the state in which your business is based. \nYou will have to tell the IRS how it should tax your business, using Form 8832 : Is your business a corporation, a partnership or should it be on your personal tax return? \nWhat you choose matters, and here's why. Hero Images | Getty Images Social Security \nEntrepreneurs must pay self-employment taxes, which include payments toward Social Security, of 15.3 percent. However, profits that pass through from an S-corp. are subject only to income taxes. \nIn that case, an owner of an S-corp. would pay the self-employment tax from his salary, instead. Compliance requirements \nIn order to maintain their liability protection and preferred tax status, owners of S-corps. (and C-corps.) need to have an operating agreement in place, maintain books and records, and track their minutes. \n\"We've seen plaintiffs' counsel pierce the corporate veil because business owners treat the corporation as a piggy bank and don't maintain bylaws,\" said Rick Keller, chairman of First Foundation in Irvine, California. Consistent profits \nOnce your business consistently exceeds $70,000 in annual profits after expenses from 1099 income (as opposed to W-2 wages), it might be time to consider setting up an S-corp., according to Howard Samuels, a CPA and managing partner at Samuels & Associates in Florham Park, New Jersey. \nThat's because S-corps. are subject to bookkeeping requirements: Owners need to file returns for themselves and the business. They also need payroll services to ensure that taxes are correctly deducted. \nOwners should weigh how much they will save on taxes with an S-corp. versus how much they will pay to set it up and maintain it. \nWatch: Here's what Trump will discuss in his first major speech since tax overhaul passed show chapters", "external_links": [], "published": "2018-01-09T21:58:00.000+02:00", "crawled": "2018-01-09T22:26:54.002+02:00", "highlightTitle": ""}