{"organizations": [], "uuid": "4d8e60c42ce81a2639621f88ba092de7f33c1d5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/20/104598475--sites-default-files-images-104424509-GettyImages-487392310.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/apple-ceo-tim-cook-on-his-secret-to-success.html", "country": "US", "domain_rank": 767, "title": "A high schooler interviewed Apple CEO Tim Cook — and he told her his secret to success", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T20:48:00.000+02:00", "replies_count": 0, "uuid": "4d8e60c42ce81a2639621f88ba092de7f33c1d5b"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/apple-ceo-tim-cook-on-his-secret-to-success.html", "ord_in_thread": 0, "title": "A high schooler interviewed Apple CEO Tim Cook — and he told her his secret to success", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "neutral"}, {"name": "cook", "sentiment": "none"}, {"name": "rebecca kahn", "sentiment": "none"}, {"name": "kahn", "sentiment": "none"}], "locations": [{"name": "porter-gaud", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "neutral"}, {"name": "@ncwitaic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tim Cook was the second highest-paid executive of 2016, pulling in $150,036,907 SHARES \nAs the CEO of Apple , Tim Cook manages one of the largest tech companies in the world (it currently has a market cap of over $920 billion), but he still wasn't too busy to speak to a high school senior who cold-emailed him asking for a few minutes of his time. \nCook responded to Porter-Gaud high school senior Rebecca Kahn 's questions and imparted an invaluable life lesson . \nFind \"your North Star\" and focus your energy on working towards that, says Cook to Kahn, according to Kahn's blog post about the conversation , which took place in November. \nCook retweeted the post Tuesday. It was a pleasure talking to you, @rebeccaekahn! Looking forward to more conversations between Apple and the bright young minds at @NCWITAIC. \nCook's \"objective in life is to work for some higher purpose,\" he tells Kahn. \nIt's more important to be excellent at a limited number of tasks than it is to be mediocre at a slew of them, according to Cook. \nApple is \"all about doing just a few things, but the few things that we do, we want to make the very best in the world. Because we believe those make a much larger difference in the world than if we were to focus on just making the most,\" Cook says. \nOnce you have identified and decided upon your North Star, or your personal guiding principal, \"Keep your eye on your North Star, and keep moving,\" he advises. \nThe \"worst thing to do would be to fail and quit. Failure is just temporary, but quitting lasts forever.\" So excited! My interview with Apple CEO Tim Cook published here: \nKahn says she has loved technology since she was young and fondly remembers going with her father to the Apple store in Charleston, South Carolina, where she still lives, to learn about new products. She started coding in lower school and reached out to Cook because her computer class homework was to interview a \"person of interest\" in technology. \n\"As soon as the assignment was announced, one name immediately came to mind: Apple CEO Tim Cook,\" writes Kahn. \"He is not just in charge of the world's largest tech company, but he personally advocates and stands up for things he believes are right. He travels the world and meets with political and innovative leaders. \n\"What was the likelihood of him even responding to me?\" \nKhan was surprised when Cook emailed her back and was nervous to talk to the Apple executive. He was charming though, she says. \"Call me Tim — Mr. Cook is my father's name,\" Cook told to Khan. \"Keep your eye on your North Star, and keep moving.\" -Tim Cook, Apple CEO \nNow, the conversation between Kahn and Cook inspired Apple and the National Center for Women & Information Technology (NCWIT), of which Kahn is a member, to help others have the same opportunity. The \"Innovator to Innovator\" program, announced Tuesday and to be run by NCWIT, will pair young women with an interest in STEM with Apple executives for a conversation about \"personal philosophies, past experiences, and pivotal influencers.\" \nApple is a sustaining partner of the NCWIT and donated $10 million to the organization in 2015. \nCook has talked about the importance of a meaningful mission before. \n\"My advice to all of you is, don't work for money — it will wear out fast, or you'll never make enough and you will never be happy, one or the other,\" Cook said after receiving an honorary degree from The University of Glasgow in February. \n\"You have to find the intersection of doing something you're passionate about and, at the same time, ... is in the service of other people,\" he says. \"I would argue that, if you don't find that intersection, you're not going to be very happy in life.\" \nSee also:", "external_links": [], "published": "2018-01-18T20:48:00.000+02:00", "crawled": "2018-01-18T21:14:24.007+02:00", "highlightTitle": ""}