{"organizations": [], "uuid": "2de3bffa534cff6afb9429b39376b29b77e6de62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/28/104919674-IMG_9980r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/tilman-fertitta-says-you-should-still-send-handwritten-thank-you-cards.html", "country": "US", "domain_rank": 767, "title": "Self-made billionaire Tilman Fertitta says you should still send handwritten thank you cards", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:40:00.000+02:00", "replies_count": 0, "uuid": "2de3bffa534cff6afb9429b39376b29b77e6de62"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/tilman-fertitta-says-you-should-still-send-handwritten-thank-you-cards.html", "ord_in_thread": 0, "title": "Self-made billionaire Tilman Fertitta says you should still send handwritten thank you cards", "locations": [], "entities": {"persons": [{"name": "tilman fertitta", "sentiment": "negative"}, {"name": "tilman", "sentiment": "none"}, {"name": "catherine lowe", "sentiment": "none"}, {"name": "landry", "sentiment": "none"}, {"name": "fertitta", "sentiment": "none"}, {"name": "sean lowe", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "houston rockets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire Tilman Fertitta, the founder of restaurant and hospitality corporation Landry's and the owner of the Houston Rockets, says it's essential to send thank you cards to others.\n\"In the hospitality business we like letting our customers know how important they are to us,\" he says. The billionaire spends about $150,000 a year on stationary to thank patrons for visiting his many establishments.\n\"Customers love to know they're appreciated,\" says Tilman. \"So when you can drop them a little unique note, it really lets them know how you feel.\"\nIn this week's episode of CNBC's \"Billion Dollar Buyer,\" Fertitta, who Forbes estimates is worth $3.7 billion, meets with the founder of LoweCo ., a luxury stationery business.\nCEO Catherine Lowe founded the paper goods company after appearing on season 17 of \"The Bachelor\" where she met her now-husband, Sean Lowe. While filming, she would send him personalized handwritten notes with quirky message like \"I'm vegan but I love the beef\" and \"Your tush is the only one I want to squish\" to show she was thinking about him.\n\"She started giving me these cards that were just fun and cute and right away I thought, 'this is just someone I want to be around,'\" says Sean. \"I couldn't help it. I fell in love with her.\"\nshow chapters Why this billionaire restaurateur says he never 'shot for the stars' 8:22 AM ET Wed, 3 Jan 2018 | 01:04 After filming ended in 2013, Catherine translated her knack for writing witty messages into an upscale company.\nAs Fertitta suggests, sending a thank you note can help you succeed in various ways in your career. One prime example: during a job hunt.\nAccording to a survey from TopResume , 68 percent of employers say that receiving a thank you note after an interview affected their decision-making process. Most recruiters and hiring managers expect a thank you note from an interviewee.\nAdditionally, nearly one in five of those surveyed say that they have dismissed a candidate because they didn't receive a thank you note after the interview.\nThe survey also found that only 31 percent of people send a thank you note after every interview. That's great news for someone who is in the habit of sending thank yous post-interview because you're more likely to stand out.\nThough a thank you note is generally sent via email these days, Fertitta says he prefers something handwritten. In fact, he keeps all of the handwritten cards he's received on his desk.\n\"It's a great touch you should never lose in this world,\" says the billionaire. \"That's the truth.\"\nLike this story? Like CNBC Make It on Facebook .\nSee also:\nThis self-made billionaire says he's highly successful because he never 'shot for the stars'\nThe best way to negotiate a higher salary if you're an introvert\n5 skills top HR execs say you should highlight to get the job you want in 2018\nshow chapters Here is why this billionaire wanted to have a plane by 35 11:19 AM ET Tue, 29 Nov 2016 | 00:46 \"Billion Dollar Buyer\" airs on CNBC on Wednesdays at 10pm ET/PT.", "external_links": [], "published": "2018-01-18T15:40:00.000+02:00", "crawled": "2018-01-18T15:57:18.007+02:00", "highlightTitle": ""}