{"organizations": [], "uuid": "0145b7ba8311fec385a0ccbbcb11283b615f4c5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930584-GettyImages-143968314.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/e-coli-outbreak-linked-to-romaine-lettuce-frustrates-produce-industry.html", "country": "US", "domain_rank": 767, "title": "E. coli outbreak linked to romaine lettuce frustrates produce industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-06T02:27:00.000+02:00", "replies_count": 0, "uuid": "0145b7ba8311fec385a0ccbbcb11283b615f4c5d"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/e-coli-outbreak-linked-to-romaine-lettuce-frustrates-produce-industry.html", "ord_in_thread": 0, "title": "E. coli outbreak linked to romaine lettuce frustrates produce industry", "locations": [], "entities": {"persons": [{"name": "lisa romerein", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lisa Romerein | Getty Images Despite more food-safety inspections and other initiatives over the past decade, the fresh produce industry is dealing with what may be its worst E. coli outbreak linked to leafy greens since 2006.\nThere's also been a sense of frustration for some in the food industry that more information hasn't been provided by the U.S. government.\nA deadly strain of the E. coli bacteria possibly linked to romaine lettuce has sickened nearly 60 people and killed at least two in the U.S. and Canada, although U.S. health officials are still trying to nail down the source of the outbreak. Canada's public health agency, though, has said romaine lettuce is the source of its outbreak and advised its population to avoid consuming the leafy vegetable.\nThe U.S. Centers for Disease Control and Prevention said it is investigating illnesses in at least 13 states and indicated the outbreak started in mid-November and cases continued through Dec. 8 . One of the deaths from the outbreak was in California, according to a spokesman for the California Department of Public Health.\n\"Leafy greens tend to have little nooks and crannies where it's hard to wash off bacteria,\" said Jean Halloran, director of food policy initiatives at Consumers Union, the policy arm of Consumer Reports.\nAccording to Halloran, this appears to be the worst E. coli outbreak linked to leafy greens since 2006, when contaminated baby spinach sickened at least 205 people and killed three.\nE. coli can get on fresh produce by fecal contamination from wild animals, nearby livestock or even humans, say experts. The contamination can occur in the soil or water and happen on the farm itself or in the processing of the fresh produce.\nConsumer Reports recommends U.S. consumers temporarily steer clear of the romaine lettuce. But the CDC said it is still trying to determine the origin of the Shiga toxin-producing E. coli infections and hasn't issued any formal recommendation to stop eating romaine lettuce.\n\"We've been able to do some really detailed DNA fingerprinting of the bacteria and the outbreak in Canada and the outbreak in the United States,\" Matthew Wise, an epidemiologist and CDC response team leader, told CNBC on Friday.\nWise said the bacteria found on both sides of the border appear to be \"really closely related to one another.\" To be clear, though, he said more data needs to be collected in the U.S. to determine if romaine lettuce is the source of the domestic outbreak.\nHowever, some food industry veterans contacted for this story expressed frustration that more information hasn't been provided by the federal government and suggested the response has been perhaps slower than it should have been.\n\"We don't have any information beyond what the Canadian government and the CDC have put out,\" said Scott Horsfall, CEO of the California Leafy Greens Marketing Agreement (LGMA), a food-safety program formed a decade ago in the wake of the deadly spinach E. coli outbreak. \"It's pretty frustrating, actually. So we don't have any insights what may have happened.\"\nCDC's Wise defended the agency's handling and said, \"Canada has many more illnesses in their outbreak investigation. They have linked that to Romaine. We're working really hard to ... confirm whether or not that's the case also in the U.S.\"\nWise said the CDC is collaborating closely with the Canadian authorities \"on a weekly basis.\"\nMeantime, some industry experts said the shelf life of romaine lettuce is just a few days and so any contaminated product is probably long gone from supermarket shelves or restaurants.\n\"If this outbreak is actually confirmed to be caused by romaine lettuce, it's important to recognize this is a highly perishable product with limited usable shelf life and it's highly unlikely a specific affected lot would still be available for sale or in a home refrigerator,\" said Jon Dinsmore, a grower in Yuma, Arizona.\nTogether, California and Arizona grow about 90 percent of the leafy green vegetables produced domestically. Mexico also imports product into the United States.\nUnder the LGMA program, regular on-farm inspections are conducted and it certifies that grower or shipper members are in compliance with food-safety standards. There's a similar program operating in Arizona.\nThe 2006 spinach outbreak was linked to contamination from cattle fecal matter found near a California spinach farm, according to state and federal officials.\nAmong the other changes since 2006 are the Food Safety Modernization Act, signed into law by President Barack Obama in January 2011. It is considered the most significant update to U.S. food safety rules since the 1930s.\nRegardless, some experts concede even tougher rules and self-policing programs by farmers and shippers probably won't ever eliminate the risk entirely.\n\"Anytime you have a raw agricultural product, they can get contaminated, and you can have these kind of outbreaks,\" said Bill Marler, a Seattle-based foodborne illness attorney.\nIn 2011, melons contaminated with listeria were blamed for sickening nearly 150 people, and 33 died as a result. Also, a U.S. Government Accountability Office report issued in November said there have been foodborne illnesses linked to other fresh produce, including cucumbers, alfalfa sprouts, bean sprouts and packaged salad products.\nMarler, though, does credit the Obama-era legislation with helping to bring some change.\nContamination \"is actually significantly less than what it was in the early part of the 2000s,\" he said. \"It used to be a fairly common occurrence where there would be literally hundreds of people sickened.\"\nEven so, the Trump administration has delayed some \"key\" portions of the food-safety overhaul from going into effect and is creating \"a gap\" in the farm-to-consumer \"safety chain,\" the Center for Science in the Public Interest charged Thursday.\nThe center also said the Trump administration is effectively \"undoing\" rules intended to protect consumers from being exposed to hazards such as E. coli or salmonella.\nCNBC reached out to the White House for comment.", "external_links": [], "published": "2018-01-06T02:27:00.000+02:00", "crawled": "2018-01-06T02:41:51.003+02:00", "highlightTitle": ""}