{"organizations": [], "uuid": "0f9e370fd85cc39eabcd1ab7a19bbd3a32910cf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938547-GettyImages-120766265.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/the-bond-market-is-about-to-do-something-that-could-spell-trouble-for-stocks.html", "country": "US", "domain_rank": 767, "title": "The bond market is about to do something that could spell trouble for stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T00:38:00.000+02:00", "replies_count": 0, "uuid": "0f9e370fd85cc39eabcd1ab7a19bbd3a32910cf8"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/the-bond-market-is-about-to-do-something-that-could-spell-trouble-for-stocks.html", "ord_in_thread": 0, "title": "The bond market is about to do something that could spell trouble for stocks", "locations": [], "entities": {"persons": [{"name": "tim boyle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "cme group", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "chicago board of trade", "sentiment": "none"}, {"name": "fomc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The bond market is about to do something that could spell trouble for stocks The bond market is on the verge of making an important move that could spook stock investors. The 10-year yield is closing in on 2.63 percent, a level it has not traded above since the summer of 2014. Higher yields compete for investment dollars with stocks and also make for higher lending rates for corporations. SHARES Tim Boyle | Bloomberg | Getty Images Traders work in the S&P 500 pit on the floor of the CME Group's Chicago Board of Trade following a Federal Open Market Committee (FOMC) meeting, in Chicago, Illinois, U.S., on Tuesday, Aug. 9, 2011. \nThe bond market is in the process of making an important move, and stock traders are keeping a wary eye on it. \nOn Thursday afternoon, the benchmark 10-year Treasury yield crept close to 2.63 percent, a level it came near last year but has not really traded above since 2014. The yield was above 2.62 percent in afternoon trading Thursday. \n\"The pain point comes at 2.63 percent, where everybody believes that's the breakout, and everyone will be keying on that,\" said Art Hogan, chief market strategist at B. Riley FBR. \"This is a more-than-three-year range that we're attempting to break out of here.\" \nHe added that technically it appears there could then be a quick move higher to 2.75 percent. \nWhile 2.63 percent and even 2.75 percent are not historically high yields, the move out of a lower long-term range reminds stock investors that bond yields can lure money away from the stock market if they get high enough. They also could mean higher borrowing costs for U.S. companies. The 10-year itself is key, because it influences so many business and consumer loans, including mortgages. \nBond strategists expect yields to move higher this year, with the Federal Reserve and other central banks raising interest rates and moving away from financial crisis policies. Bond market heavyweights have been firing off warnings for weeks. Jeff Gundlach, CEO of DoubleLine, has been looking for higher rates this year and has said tax cuts could help send them higher, as growth picks up. \nBill Gross declared last week that after more than 25 years, the bond bear market has begun. In a tweet from his investment firm, Janus Henderson Group, he noted key trend lines were broken in the 5-year and 10-year, confirming a bear market. \n\"I think that it's just a culmination of a variety of factors,\" said Mark Cabana, head of U.S. short rate strategy at Bank of America Merrill Lynch. There is continued good U.S. economic data, he said, and it seems like there is mounting optimism regarding the overall growth outlook plus a focus on the amount of supply the Treasury market is going to get. \n\"All of those factors are contributing to the overall steepness of the curve and rates reaching new highs,\" Cabana said. \nHogan said the bond move, combined with the possibility that Congress fails to vote for a resolution to prevent a government shutdown by Friday night, could spell trouble for stocks in the near term. \n\"I don't think that's going to be the death knell, but in the near term, trepidation over this could cause a pause in the market, especially if you couple that with a government shutdown that nobody wants,\" he said. Patti Domm CNBC Markets Editor Related Securities ", "external_links": [], "published": "2018-01-19T00:38:00.000+02:00", "crawled": "2018-01-19T00:54:33.032+02:00", "highlightTitle": ""}