{"organizations": [], "uuid": "8236d94c83ade092bb04abf656fb57425575444a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Donald Trump Calls for Change in ‘Failing’ Iran as Economic Protests Turn Fatal – Fortune", "url": "http://fortune.com/2018/01/01/donald-trump-economic-protests-iran/", "country": "US", "domain_rank": 1196, "title": "Donald Trump Calls for Change in ‘Failing’ Iran as Economic Protests Turn Fatal", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-01T17:58:00.000+02:00", "replies_count": 0, "uuid": "8236d94c83ade092bb04abf656fb57425575444a"}, "author": "Jaclyn Gallucci", "url": "http://fortune.com/2018/01/01/donald-trump-economic-protests-iran/", "ord_in_thread": 0, "title": "Donald Trump Calls for Change in ‘Failing’ Iran as Economic Protests Turn Fatal", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "obama", "sentiment": "none"}, {"name": "rouhani", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump Calls for Change in 'Failing' Iran as Economic Protests Turn Fatal People gather to protest in Tehran on Dec. 30, 2017 Anadolu Agency Getty Images By Jaclyn Gallucci 10:58 AM EST \nU.S. President Donald Trump said Iran is failing and called for a change there, as security forces clashed with demonstrators rallying in a rare show of displeasure with the country’s leaders. \n“Iran is failing at every level despite the terrible deal made with them by the Obama administration,” Trump said Monday morning in one of several New Year’s Day tweets, including one that was critical of Pakistan. “The great Iranian people have been repressed for many years. They are hungry for food & for freedom. Along with human rights, the wealth of Iran is being looted. TIME FOR CHANGE!” \nAs many as a dozen people may have died in the protests, according to state TV and local reports. Iranian President Hassan Rouhani, seeking to calm the unrest, on Sunday defended the Iranian people’s right to protest while urging them to work with his administration to address what he said were justified grievances about the economy. \nThose comments came after Rouhani’s government restricted access to social media, which has become an important source of information about the protests. \nThe rare public show of dissent comes at a time when prices and joblessness are on the rise and Trump’s administration has placed additional sanctions on the country. Trump said on Twitter a day before that the U.S. will be watching “very closely” for human rights violations during the protests. \nIn another Twitter posting on New Year’s Day, Trump called out Pakistan and said his administration was seeking to get tougher with that nation. In October he said leaders there were beginning to respect the U.S. again and pointed to the release of a U.S. woman and her Canadian born husband as proof the country is working with the U.S. \nPakistan is a partner with the U.S. in the fight against terrorism, yet it was was also the hiding place where 9/11 mastermind Osama bin Laden lived for years before being killed in a nighttime raid by Navy Seals. \n“The United States has foolishly given Pakistan more than 33 billion dollars in aid over the last 15 years, and they have given us nothing but lies & deceit, thinking of our leaders as fools. They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!” Trump tweeted. You May Like Sign Up for Our Newsletters Sign up now to receive FORTUNE's best content, special offers, and much more. ", "external_links": [], "published": "2018-01-01T17:58:00.000+02:00", "crawled": "2018-01-01T17:58:13.011+02:00", "highlightTitle": ""}