{"organizations": [], "uuid": "51858eef933436c22c32d06be6aa72b2a66b463e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/20/104352709-GettyImages-646923788.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/05/tax-law-changes-that-affect-employees-and-their-benefits.html", "country": "US", "domain_rank": 767, "title": "The new tax law is a mixed bag for your company benefits", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-05T18:29:00.000+02:00", "replies_count": 0, "uuid": "51858eef933436c22c32d06be6aa72b2a66b463e"}, "author": "", "url": "https://www.cnbc.com/2018/01/05/tax-law-changes-that-affect-employees-and-their-benefits.html", "ord_in_thread": 0, "title": "The new tax law is a mixed bag for your company benefits", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "jetblue airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With some U.S. companies planning to give employees a special bonus or boost hourly wages due to corporate tax cuts taking effect this year, workers might wonder how else the new tax law will affect them.\nIt's a mixed bag.\nSome of the changes could lead to better benefits while others might ding existing ones. While it's hard to predict exactly what corporate America will do, some provisions in the new tax law could have a fairly direct impact on workers.\nAlso worth noting: While no changes were made specifically to the tax treatment of employer-provided health insurance, as of 2019, there is no longer a tax penalty if you do not have coverage.\nHere's how some of the changes in the new tax law affect employees, starting with the positives.\nBonuses, more pay One of the most immediate results of the tax bill's passage on Dec. 20 was a flurry of announcements from large U.S. companies that they would share their windfall with employees. For example, JetBlue Airways , Bank of America and CNBC parent company Comcast announced they would award certain workers a special bonus of $1,000.\nOther companies, such as banks BB&T and Fifth Third , said that in addition to giving one-time bonuses, they are increasing their minimum hourly pay rate.\nSince those first announcements, many other companies have followed suit. According to an aggregated list by Americans for Tax Reform, dozens of other small and large companies have announced bonuses — ranging from a few hundred dollars to $3,000 — or increases to their hourly pay rates due at least in part to passage of the tax legislation.\nshow chapters Rep. Rob Portman: Businesses can now be competitive after GOP tax reform 9:05 AM ET Thu, 4 Jan 2018 | 03:14 And of course, many workers will see fatter paychecks due to lower tax rates on individuals.\nOnce companies have a chance to incorporate the new tax brackets and withholding rates into their systems, paychecks will reflect the new rates. The tax law retained seven income brackets, but lowered the tax rates applied to each bracket and modified some of the income levels.\n\"The new tax withholdings rates should be ready by the end of January and affect employee paychecks by March,\" said Greg Long, public policy leader at benefits administrator Alight Solutions.\nShort-term leave The Family and Medical Leave Act is a federal law that guarantees employees at larger companies up to 12 weeks of leave each year, although employers do not need to pay workers for that leave. The new tax law provides a partial tax credit to employers who offer wages during those times.\n\"It's an incentive for employers to offer paid time off,\" said Karen Frost, vice president of health strategy and solutions at Alight. \"We could see employers moving in the direction of offering some pay during those family leaves as a result of the tax change.\"\n\"We could see employers moving in the direction of offering some pay during those family leaves as a result of the tax change.\" -Karen Frost, Alight Solutions 401(k) loans Workers who have an outstanding loan from their 401(k) account when they leave their employer also get some relief.\nGenerally speaking, when you leave your job — voluntarily or otherwise — and still owe money on a loan from your 401(k) account, your employer will give you a short window to repay it. If you do not, the amount gets deducted from your account balance. In other words, you pay off that loan whether you want to or not.\nHowever, pre-2018, if you rolled over your remaining 401(k) balance to an IRA or another employer plan, you would be taxed on the loan balance unless you could come up with that amount to contribute to your rollover account within 60 days. In other words, the loan balance had been treated as a taxable distribution at that time and potentially subject to a 10 percent early withdrawal penalty.\n\"When you're in between jobs it's hard to come up with the money to pay [a loan] back. Now you'll have more time to come up with it.\" -Greg Long, Public policy leader at Alight Solutions Now, you get until your tax-due date (typically April 15) of the following year to put that loan amount into your rollover account without it getting treated as a distribution.\n\"When you're in between jobs it's hard to come up with the money to pay it back,\" Long said. \"Now you'll have more time to come up with it.\"\nThe new tax law also eliminates some deductions available to employees or employers, and makes other changes that could affect employee benefits. Here are some of them.\nMoving expenses When an employer paid for a worker's moving expenses due to a new job or relocation, the amount was not taxable to the employee. The new law suspends that tax-free treatment through 2025, which means it will be considered income to the employee and taxed as such. The exception to this rule is for active-duty military members.\nTheoretically, Long said, an employer that pays for a move could increase the employee's gross pay to reflect the taxable moving expenses.\n\"It's too early to know if employers will change their policies because of this,\" Long said.\nEmployee awards In the tax legislation, lawmakers included a definition of what can be given as tax-free achievement awards. While not intended to mark a change in the law, it does codify what can and cannot be excluded from an employee's income.\nIn simple terms, if you are given cash or a cash equivalent, such as a gift card, meals, lodging or tickets, they are taxable. Awards considered tangible property, like a T-shirt or mug, are not taxable.\nGetty Images Commuting breaks Employees who use pretax dollars to pay for transit or parking expenses can continue to do so, but companies no longer will get a deduction for any contributions they make toward those expenses. For 2018, workers with access to an employer-sponsored transit program can contribute up to $260 monthly for both transportation and parking expenses, pretax.\n\"If my employer takes the approach that they contribute, they still can, but they just don't get the deduction,\" Long said.\nWhile some employee-benefits watchers have speculated that eliminating the deductibility for companies will reduce their incentive to help with commuting expenses, Long said he doubts the change will have any immediate impact on whether companies continue helping employees with commuting costs.\nAdditionally, if you happen to bicycle to work and receive the $20 monthly limit from your employer to defray the costs of cycling (i.e., maintenance, a new helmet), it no longer is tax-free.\nAs with eliminating the business deduction for other commuting contributions, it may remove the incentive for employers to help out with bicyclists' costs of getting to work.\nThis tax bill provision helps families save on school costs and taxes\nThese changes under the GOP tax plan affect homeowners\nThe strong economy could be your ticket to a new job", "external_links": [], "published": "2018-01-05T18:29:00.000+02:00", "crawled": "2018-01-05T18:39:53.037+02:00", "highlightTitle": ""}