{"organizations": [], "uuid": "e3dc1b0c37669bf955e890dd527269bba5682fbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923536-Oil_rig.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/us-oil-prices-top-65-a-barrel-for-the-first-time-since-dec-2014.html", "country": "US", "domain_rank": 767, "title": "US oil prices top $65 a barrel for the first time since Dec. 2014", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T17:39:00.000+02:00", "replies_count": 0, "uuid": "e3dc1b0c37669bf955e890dd527269bba5682fbb"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/us-oil-prices-top-65-a-barrel-for-the-first-time-since-dec-2014.html", "ord_in_thread": 0, "title": "US oil prices top $65 a barrel for the first time since Dec. 2014", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. energy information administration", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 Hours Ago | 00:55 \nU.S. crude prices topped $65 a barrel for the first time in more than three years on Wednesday after government data showed the tenth straight weekly drop in U.S. stockpiles of crude oil. \nU.S. West Texas Intermediate crude futures ended Wednesday's session up $1.14, or 1.8 percent, at $65.61 a barrel. The settlement marked the highest closing level since Dec. 5, 2014. \nInternational benchmark Brent crude rose 59 cents, or 0.8 percent, to $70.55 by 2:28 p.m. ET. The contract also touched a new three-year high on Wednesday. \nOil prices turned higher after the U.S. Energy Information Administration reported that U.S. commercial crude stockpiles fell by 1.1 million barrels in the week through Jan. 19. That put total inventories at 411.6 million barrels, the lowest since February 2015, according to Reuters. \nU.S. crude intraday \nThat was below analyst estimates for a drop of 1.6 million barrels in a Reuters poll, but the report eased traders' worries after industry data released on Tuesday suggested that stocks rose by 4.8 million barrels. \nThe report was further evidence that production limits by OPEC, Russia and several other oil-producing nations are achieving their goal of shrinking stockpiles in developed countries. \nThe drop also comes at a time of synchronized global economic growth that is raising hopes about demand for oil. Exports of U.S. crude have mostly held above 1 million barrels a day since the end of September. \nThe EIA report \"was decent enough in terms of the oil drawdowns at the key points in the Gulf Coast and Cushing,\" the delivery hub for WTI, said John Kilduff, partner at energy hedge fund Again Capital. \n\"Underpinning this is this weakened dollar,\" he added. \"It's an incredible move in the dollar that's propping up commodity prices in general.\" \nThe U.S. dollar index hit a new three-year low on Wednesday after Treasury Secretary Steven Mnuchin said a weaker greenback is good for the country. Dollar weakness typically encourages purchases of dollar-denominated commodities like crude oil. \nThe report contained some bearish news on refined fuel stockpiles and U.S. production, Kilduff said. \nGasoline inventories rose by 3.1 million barrels and stocks of distillate fuels, which include diesel, were up by 639,000 barrels. \nU.S. crude 5-year performance \nThe market also shrugged off weekly figures showing U.S. oil production rose to nearly 9.9 million barrels a day, inching closer to an all-time high above 10 million barrels set in the 1970s. \nEIA forecast earlier this month that U.S. output would hit 10.3 million barrels a day this year, the highest ever annual average production. At that level, U.S. production would decisively top Saudi production and rival Russia. \nSurging supplies of American oil played a major role in the price collapse of 2014. But while U.S. output is approaching records, many drillers are focusing on improving their finances and returning money to shareholders rather than funding new production. \nOil prices are now approaching levels not seen since Thanksgiving 2014, when OPEC refused to cut oil production, sparking a sharp downturn. ", "external_links": [], "published": "2018-01-24T17:39:00.000+02:00", "crawled": "2018-01-24T17:59:18.019+02:00", "highlightTitle": ""}