{"organizations": [], "uuid": "d42f196fe6edc91eaf6302264a67fd05fbde1eda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/13/104838829-GettyImages-530685403-heart-monitor.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/26/idaho-will-allow-health-plans-outside-obamacare-rules.html", "country": "US", "domain_rank": 767, "title": "Idaho's bid to duck Obamacare: Old, sick customers could face costs 15 times higher than others", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T23:26:00.000+02:00", "replies_count": 0, "uuid": "d42f196fe6edc91eaf6302264a67fd05fbde1eda"}, "author": "", "url": "https://www.cnbc.com/2018/01/26/idaho-will-allow-health-plans-outside-obamacare-rules.html", "ord_in_thread": 0, "title": "Idaho's bid to duck Obamacare: Old, sick customers could face costs 15 times higher than others", "locations": [], "entities": {"persons": [{"name": "sam edwards", "sentiment": "negative"}, {"name": "obamacare", "sentiment": "none"}], "locations": [{"name": "idaho", "sentiment": "none"}, {"name": "obamacare", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Sam Edwards | Caiaimage | Getty Images \nA bold bid by Idaho to become the first state in the nation to allow the sale of health plans that do not comply with key Obamacare rules could lead to the oldest, sickest customers facing prices up to 15 times the rates charged the youngest and healthiest in the new plans, experts say. \nStill, it's not clear whether any insurers will even accept the state's permission to issue the skimpier plans along with their existing Obamacare coverage — because of the risk they could be fined staggering amounts by federal health regulators. \nSeveral insurers told CNBC on Friday they had concerns about the legality of issuing non-compliant plans in Idaho despite the state's new directive authorizing them to do so. The state's move is designed to get more people insured who now are put off by Obamacare prices. \nIdaho says it will allow insurers to be able to issue separate plans that charge older customers much more than they currently can in Obamacare plans, and permit insurers to charge people higher premiums if they have health problems — which is barred by Obamacare. The state would also allow insurers to set a $1 million cap on what they have to pay out in health costs for customers, which also is now barred by Obamacare. \nAnd the new plans would be allowed to cover fewer benefits that are currently mandated by the Affordable Care Act. \n\"It's wildly illegal,\" said Sam Berger, senior adviser at the liberal Center for American Progress, and a former health-care advisor in the White House during the Obama administration. \"There's no argument that anyone's put forward that it's not illegal.\" \nHe said insurers that issue the new plans could be fined $100 per customer, per day, by federal regulators for violating the Affordable Care Act's standards . That works out to $365,000 in potential fines per customer every year — putting insurers at risk of insolvency. \nOfficials at the U.S. Health and Human Services Department have not responded to CNBC's request for comment about Idaho's move. That silence is raising the question of whether the Trump administration will end up tolerating Idaho's policy because of the Trump White House's hostility toward Obamacare. \nBerger said the situation is a crucial test for HHS's new secretary, Alex Azar, a Yale Law school grad, who is being confronted by a state which is suggesting that insurers can flout federal law. \n\"Is Azar willing to basically violate centuries of American law in his first few days while he throws aside everything that he and every other lawyer has been taught and is willing to do it for the purpose of harming some of the most vulnerable people in our country, people with pre-existing [health] conditions?\" Berger asked. \nIdaho's Insurance Department on Wednesday issued its bulletin detailing the rules for the new plans. \nWeston Trexler, bureau chief at the Insurance Department, said that \"the biggest driver\" for the move is the fact that \"there's a lot of Idahoans that aren't able to afford the price of health insurance\" sold in the Obamacare market if they do not qualify for federal subsidies. \nTrexler noted that the average, non-subsidized prices of \"silver plans\" sold on Idaho's Obamacare exchange increased by 39 percent this year, and by 24 percent and 23 percent in the prior two years, respectively. Most Obamacare customers buy silver plans, which cover about 70 percent of their health costs. \nTrexler said that only insurers who offer plans on Obamacare marketplaces would be allowed to issue the new plans. \n\"These plans are just an alternative for people being priced out of the market,\" Trexler said. \n\"They're not taking away ACA protections from anyone,\" he said, noting that Obamacare plans will still be available in the state, and that low- and moderate-income customers who buy coverage on Idaho's state-run marketplace will still get subsidies that reduce their premiums. \nThe new plans would likely be less expensive for some customers than current individual market coverage because they would be less comprehensive in terms of benefits, and because insurers would be able to limit their costs through other mechanisms. \nHowever, no customers in the new plans would be eligible for federal subsidies that could reduce their premium costs, and out-of-pocket health costs. \nAnd whereas the ACA bars health plans from charging older customers more than three times the premiums charged younger customers, the new plans allow older people to be charged five times as much. \nAnd while Obamacare bars insurers from medically underwriting, or charging sicker customers higher rates than healthy customers, Idaho would allow insurers to charge sicker customers who enroll in the new plans up to three times the amount charged the healthy. \nAs a result of those two multiplying effects, \"The older, sicker person could be charged 15 times the youngest, healthiest person could be charged,\" said Karen Pollitz, a senior fellow at the Kaiser Family Foundation, a leading health policy research group. \nIf, for example, insurers charged a healthy 21-year-old $100 per month in premiums, a healthy 60-year-old customer could pay a premium of $500 a month, solely due to their age. Now, if that 60-year-old also suffered from terminal cancer, that could increase their premiums up to $1,500 each month. \n\"It's a lot,\" Pollitz said. \"And it's illegal under federal law, so it's not clear to me how this is going to proceed.\" \n\"Some things a state can apply for a waiver for. But this is not that,\" she said. \nBecause of the big price discrepancy allowed by Idaho's directive, it's likely the new plans would tend to draw healthier, younger customers more than older, less-healthy people. \nThe Insurance Department said that insurers would be grouping their Obamacare customers and ones in the new plans as a single risk pool, whose premiums would be used to offset the costs of benefits paid out. \nPollitz said she did not understand how that would work. \n\"You can't have a single risk pool with two rating\" systems, she said, referring to the way the separate plans would set their respective premiums. \nBerger of CAP said that even if HHS does not take action against the new plans, insurers will have a significant legal liability from their own customers if they issue such coverage. He said that a customer who was denied coverage for more than $1 million in health costs by an insurer could then sue the insurer in court for violating ACA rules. \nAn argument by the insurer stipulating that the plan's contract set a cap of $1 million would fail in court, Berger said, because such a contract is illegal under the ACA, and hence be unenforceable. \n\"They will sue, and they will win,\" he said of plan customers. \"Why would it ever make economic sense for [insurers] to enter into illegal and unenforceable contracts?\" Insurers weigh in \nCNBC reached out for comment to all current insurers in the state that issue Obamacare plans in Idaho and asked whether they would issue new plans alongside their ACA-compliant plans in light of the state's new directive. Three of the five insurers explicitly mentioned legal concerns about the directive. Ken Provencher, CEO of PacificSource Health Plans, said in an emailed statement: \"We are still evaluating the implications of this decision.\" He added:\"Before we decide next steps, it's important to us that we assess the impact this might have on the ACA pool, the potential market disruption and overall legality. ... We are actively discussing these issues and will determine our direction soon.\" A representative for SelectHealth said: \"While we remain committed to offering plans that are attractive and affordable for our members, it is important that any new plan designs allowed in the Individual market do not create regulatory or legal liability for carriers or unnecessary instability in the market.\" The rep added: \"We continue to work closely with regulators to assure that our plans comply with all state and federal laws and regulations. ... SelectHealth intends to continue to offer ACA-compliant Individual plans, in addition to other low-cost short-term plans, and we encourage people to continue to stay insured.\" Regence BlueShield of Idaho, in its own statement, said: \"We are still evaluating the recently released rules, and weighing how to best move forward.\" The company added: \"The Affordable Care Act is still valid law, and we do not see how these rules fit within that framework. ... To comply with current law, we believe it is critical to secure a 1332 waiver [from HHS], and we continue to advocate for a transparent rule-making process in support of providing consumers choice while stabilizing the individual market.\" Charlene Maher, president and CEO of Blue Cross of Idaho, said: \"While we are currently reviewing the guidance, we believe the direction will provide uninsured middle-class families in Idaho with choices in health insurance at a price that fits their budget and meets their needs.\" A fifth insurer, BridgeSpan, had no immediate comment.", "external_links": [], "published": "2018-01-26T23:26:00.000+02:00", "crawled": "2018-01-26T23:57:52.000+02:00", "highlightTitle": ""}