{"organizations": [], "uuid": "2f9d7635c0b778939e9f639105614bd207dc72a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 23}, "facebook": {"likes": 22, "shares": 22, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/31/104377975-GettyImages-643865870.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/wwe-is-a-data-powerhouse-thanks-to-content-growth-and-digital-cfo.html", "country": "US", "domain_rank": 767, "title": "WWE is a 'data powerhouse' thanks to content, growth and digital, CFO says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-20T01:43:00.000+02:00", "replies_count": 0, "uuid": "2f9d7635c0b778939e9f639105614bd207dc72a8"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/wwe-is-a-data-powerhouse-thanks-to-content-growth-and-digital-cfo.html", "ord_in_thread": 0, "title": "WWE is a 'data powerhouse' thanks to content, growth and digital, CFO says", "locations": [], "entities": {"persons": [{"name": "barrios", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "vince mcmahon", "sentiment": "none"}, {"name": "george barrios", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With nearly $800 million in revenues, a $2.6 billion market cap and 850 million social media followers, World Wrestling Entertainment isn't the tiny ticketing business it was 35 years ago.\nA massive overhaul of the wrestling network in 2013 and 2014 drove the \"wave of growth\" that made it a central player in digital media despite its seemingly niche content, CFO George Barrios told CNBC.\n\"Content, continued global growth and the direct-to-consumer digital has turned us into a data powerhouse,\" Barrios told \" Mad Money \" host Jim Cramer in a Friday interview. \"We've seen about 70 percent growth since 2008, and we think there's a lot more runway.\"\nBarrios largely credited WWE CEO Vince McMahon for transforming the company from a small tours-and-tickets business to a global media giant.\nNow, the company boasts more social media followers than any sports brand in the world and is the No. 1 sports channel and No. 2 channel overall on YouTube, Barrios said.\nThe CFO added a \"crazy stat:\" in 2010, WWE's online videos were viewed 500 million times. In 2017, WWE's online video views grew to 20 billion.\n\"We call it tiering the content,\" Barrios said of the company's content distribution strategy. \"A lot of people take the content and put it all over all the different platforms and it cannibalizes.\"\nWWE takes a different approach. Some of its content is produced specifically for paid television (about five hours a week). The company also produces about 600 hours of content for YouTube, Facebook and the WWE website that is different from what paid TV viewers are getting.\n\"Then we're going to do about [300], 400 hours on our direct-to-consumer network to super-serve our most passionate fans,\" Barrios said. \"So all those different platforms, different content ... it raises all boats.\"\nOne of the most curious elements of the global rise of WWE — the No. 1 country that consumes WWE video in the world is India — is its seemingly niche content offering.\nInvoking writer and mythologist Joseph Campbell's biography, The Hero's Journey, Barrios explained WWE's two chief appeals: storytelling and simplicity.\n\"[Campbell] said every culture throughout human history tells stories the same way: heroes, enemies, overcome. So John Cena, Katniss Everdeen, Luke Skywalker; it's the hero's journey,\" the CFO said. \"The second thing is our sport centers around the ring. It's the simplest thing. Everyone understands it. That's why India's our No. 1 market in terms of consumption.\"\nWatch George Barrios' full interview here: show chapters WWE is a 'data powerhouse' thanks to content, growth and digital, CFO says 20 Hours Ago | 07:31 ", "external_links": [], "published": "2018-01-20T01:43:00.000+02:00", "crawled": "2018-01-20T01:50:00.000+02:00", "highlightTitle": ""}