{"organizations": [], "uuid": "7da86d7fd214aba7819eef0b9bc01c9c7cb5ebc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104964876-GettyImages-496586720.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/will-smith-failure-is-a-massive-part-of-being-able-to-be-successful.html", "country": "US", "domain_rank": 767, "title": "Actor Will Smith in viral video: 'Failure is a massive part of being able to be successful'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T18:11:00.000+02:00", "replies_count": 0, "uuid": "7da86d7fd214aba7819eef0b9bc01c9c7cb5ebc1"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/will-smith-failure-is-a-massive-part-of-being-able-to-be-successful.html", "ord_in_thread": 0, "title": "Actor Will Smith in viral video: 'Failure is a massive part of being able to be successful'", "locations": [], "entities": {"persons": [{"name": "will smith", "sentiment": "negative"}, {"name": "smith", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "bel-air", "sentiment": "none"}], "organizations": [{"name": "instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you've recently failed at something, whether it's meeting your goals, landing a job or acing an important test, you know how disheartening failing can be.\nWorld-famous actor and musician Will Smith wants you to rest assured there is definitely a silver lining in these moments of disappointment.\n\"Fail early, fail often, fail forward,\" Smith said in a series of Instagram story videos on January 7 that went viral. \"Failure is a massive part of being able to be successful.\"\nSmith, 49, shared a hang up he has with the way people tend to deal with being unsuccessful: \" It's always a little bit frustrating to me when people have a negative relationship with failure,\" he said.\ntweet \nInstead of feeling defeated, Smith recommended that you not only get comfortable with failure, but that you actually seek it because \"failure is where all of the lessons are.\"\nSmith first got his start in Hollywood as a 21-year-old who had never acted before starring in the renowned 1990s television show \"The Fresh Prince of Bel-Air.\"\nDespite years of career wins immediately after the hit show, Smith has been vocal about the role that failure played in his life.\nAt the 2016 Cannes Lions, Smith discussed how marketing his movie \"Wild Wild West,\" a 1999 film that generated more than $200 million in revenue, marked one of the lowest points in his life.\n\"I had so much success that I started to taste global blood, and my focus shifted from my artistry to winning. I wanted to win and be the biggest movie star,\" he said. \"I found myself promoting something because I wanted to win versus promoting something because I believed in it.\"\nSmith also called his 2013 movie \"After Earth\" the \"most painful failure\" of his career, according to Variety . In the same moment, the actor referenced a quote from \"The Fresh Prince of Bel-Air\" in which his character's aunt told him, \"Don't let success go to your head and failure go to your heart.\"\nshow chapters The best advice Olympian Shawn Johnson East received has carried her far beyond gymnastics      11:48 AM ET Mon, 2 Oct 2017 | 01:05 In his recent video, Smith went on to compare one common way many people actually put themselves in defeat's way: exercise.\n\"When you go to the gym and you work out, you're actually seeking failure. You want to take your muscles to the point where you get to failure because that's where the adaptation is and that's where growth is,\" Smith said. \"Practice is controlled failure.\"\nUltimately, Smith wanted viewers to understand that even successful people fail a lot more than they succeed. Among other influential leaders who believe in the power of failing are Bill Gates, Tim Ferriss and Richard Branson .\n\"They extract the lessons from the failure and they use the energy and they use the wisdom to come around to the next phase of success,\" Smith said.\n\"You've gotta take a shot, you have to live at the edge of your capabilities. You gotta live where you're almost certain you're going to fail,\" Smith said. \"Failure actually helps you to recognize the areas where you need to evolve. So fail early, fail often, fail forward.\" \n\nLike this story? Like CNBC Make It on Facebook . \nDon't miss: \nThese are the top 10 best countries in the world", "external_links": [], "published": "2018-01-24T18:11:00.000+02:00", "crawled": "2018-01-24T18:22:26.000+02:00", "highlightTitle": ""}