{"organizations": [], "uuid": "8902f7a4a46bcf7c87170b059eb9f5630e7bfefe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/13/104164049-GettyImages-106456965.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/fearful-millennials-are-putting-money-into-etfs-and-stocks.html", "country": "US", "domain_rank": 767, "title": "Fearful millennials are finally ready to take a chance on the stock market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T18:55:00.000+02:00", "replies_count": 0, "uuid": "8902f7a4a46bcf7c87170b059eb9f5630e7bfefe"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/fearful-millennials-are-putting-money-into-etfs-and-stocks.html", "ord_in_thread": 0, "title": "Fearful millennials are finally ready to take a chance on the stock market", "locations": [], "entities": {"persons": [{"name": "jared smith", "sentiment": "negative"}, {"name": "not smith", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bankrate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "5 Hours Ago | 02:04 \nJared Smith represents a new breed of millennial: someone who saw the financial crisis unfold during his formative years but is now ready to step back into the arena and take some risk. \nThe 31-year-old New Yorker is a big believer in stocks. While that seems like a no-brainer for a market that has skyrocketed 325 percent since the crisis lows, investors in general and millennials in particular have been afraid of equities, worried that another crisis could sneak up and wipe out all those gains. \nNot Smith, who has taken a slice of his trust fund and put it to work on Wall Street. \n\"The market's becoming a little more insulated,\" he said. \"I'm hoping that we learned our lesson from [the crisis] and we have gotten better as a society, especially in the financial and banking world, that we will not allow that again, that certain measure have been put in place since then.\" \nMillennials, born between the early 1980s and early 2000s, have been the most reluctant demographic when it comes to diving into risk assets. For instance, a Bankrate survey in 2017 showed just 13 percent would invest in equities, trailing real estate and cash by large margins. \nBut with the market showing stunning resiliency , the tide is turning. Getty Images \nA survey released Tuesday by megamoney manager BlackRock indicated a big jump in millennial interest in exchange-traded funds, a $3.3 trillion industry populated mostly with securities that track stock market indexes. (Bond funds are getting more popular but still make up only about 16 percent of ETF assets.) \nThe portion of millennials who are buying ETFs jumped from 33 percent in 2016 to 42 percent a year later. That pushes the group to the top of the list in terms of ETF ownership. Silvers (age 71 or older) are next at 37 percent, followed by Gen Xers (29 percent) and baby boomers (27 percent). \nOverall, investors continue to push money into the low-cost funds, with the industry now boasting $3.3 trillion of assets under management, a 27 percent jump from a year earlier, according to the Investment Company Institute. About 1 in 3 investors uses ETFs, a 24 percent increase from a year ago, according to BlackRock, the industry leader with $1.4 trillion of its total $5.7 trillion under management in the funds. \nSmith uses a mix of individual stocks and ETFs for his portfolio after initially trusting his investments with a money manager, an experience that was positive but served to whet his appetite for striking out on his own. \nHis portfolio is loaded with popular tech names like Nvidia , Facebook and Netflix , but he's also studying to learn about options trading. He's also recently taken a shot at cryptocurrencies, which he said worries him more than stocks. \nOne factor influencing his appetite for risk: President Donald Trump . \n\"Trump does seem to be much more pro-economy and pro-American stock market than other past presidents,\" Smith said. \"While he's in office I believe there's an extra layer of insulation there from something drastic and catastrophic from happening.\" \nWATCH: Millennials will help contribute to the stock boom, economist says. show chapters ", "external_links": [], "published": "2018-01-23T18:55:00.000+02:00", "crawled": "2018-01-23T19:02:27.036+02:00", "highlightTitle": ""}