{"organizations": [], "uuid": "e9da3d1a621d9a6be53ec6f1e1a08292dbb508bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Time’s Up, Hoda Kotb leads Today, Gretchen Carlson: Broadsheet for January 2nd – Fortune", "url": "http://fortune.com/2018/01/02/broadsheet-january-2nd/", "country": "US", "domain_rank": 1196, "title": "Time’s Up, Hoda Kotb leads Today, Gretchen Carlson: Broadsheet for January 2nd", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-02T15:49:00.000+02:00", "replies_count": 0, "uuid": "e9da3d1a621d9a6be53ec6f1e1a08292dbb508bd"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/02/broadsheet-january-2nd/", "ord_in_thread": 0, "title": "Time’s Up, Hoda Kotb leads Today, Gretchen Carlson: Broadsheet for January 2nd", "locations": [], "entities": {"persons": [{"name": "hoda kotb", "sentiment": "negative"}, {"name": "gretchen carlson", "sentiment": "negative"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Happy New Year, Broadsheet readers! I hope you all had a joyful holiday. Today’s Broadsheet is a bit of a catch-up edition, featuring some of the big stories that caught my eye over the past week or so. Here’s to a happy and productive 2018! \nEVERYONE'S TALKING [bs_bullet_primary] Taking action in 2018 . In the final Broadsheet of last year, I asked all of you to share any thoughts you might have on what we can do in 2018 to advance the next stage of the #MeToo movement--steps that will change the culture that has allowed sexual harassment and other abuses toward women to quietly flourish. Thank you to all of you who sent in your inspiring ideas, some of which I've included (in edited form) below:\n\"One of the biggest issues I see is that many women have no one to turn to when they have an issue with harassment. Their boss is often the problem, and HR focuses on protecting the company. Since many companies can't seem to police themselves, I think there needs to be an external group that holds companies accountable for getting rid of predators. Some thoughts for what this could look like: - A government organization similar to the Consumer Financial Protection Bureau that would be open to public complaints and able to do its own investigations. - Industry-level groups that hold their companies accountable. - A nonprofit or group of lawyers who set up a confidential complaint line for women who want to make them aware of harassment problems...they could give guidance, or even prosecute companies if they have enough evidence.\" -- Joy S.\n\"We need a consistent set of definitions of harassment behavior and consequences that would spread throughout the American workplace. This would negate the often heard 'I am not sure what's acceptable, etc.' excuse that leaves us nowhere.\" -- Anne K.\n\"I think we need 1.) a way to investigate claims that is fair to all sides, punishments appropriate to the seriousness, and a path to redemption for the redeemable. I know these aren't universally held points of view, but I believe it might encourage people to speak up if they feel the process is just, not only for an accuser, which is critically important, but as well for someone who is accused. And 2.) a \"certification\" for organizations to show they are respectful environments. It could include survey data about perceptions of safety/respect, qualitative data, metrics, and the presence of and trust in processes for people who have been harassed. Somehow it needs to show where there is real safety and respect, and not just the window dressing.\" -- Jonathan B.\n\"Companies should also consider tools which allow anonymous reporting via text, email, phone, etc. Reporting sexual harassment is difficult. Often, it's easier done anonymously or via email. And, at a time when younger generations are becoming more comfortable with digital communication and less comfortable with face-to-face communication, we, HR, should adapt for cases like this. These anonymous reporting tools are going to be important in getting people to report issues they otherwise may not be comfortable reporting to a person. Just knowing it's there is a great message to employees.\" -- Beth S.\n\"The vast majority of companies already have policies or practices in place, but what this recent uptick in attention sparked was a realization that policies don't mean much if your employees don't fully understand what harassment is. It comes in many different forms and is often subtle. 2018 is an opportunity for education - not only around what harassment looks like and feels like but what to do and how to speak up when you see it.\" -- Katie. S\nAs many of you noted, this will not be a quick or simple fix, so I'd like to make it a standing request: Please email me anytime at kristen.bellstrom@fortune.com with your thoughts on what each of us can be doing to make 2018 the year of #NoMore. I'll share your responses with your fellow readers on a regular basis--let's keep this conversation going for as long as it takes.\nALSO IN THE HEADLINES [bs_bullet_primary] Time's Up . More than three hundred Hollywood women yesterday revealed their own action plan to fight systemic sexual harassment in their industry and in blue-collar workplaces nationwide. Called Time's Up, the plan includes legislation to penalize companies that tolerate persistent harassment, a fresh push for gender parity at studios and talent agencies, and a request that women walking the red carpet at the Golden Globes speak out and raise awareness by wearing black. But the most notable aspect is a $13 million legal defense fund for less privileged women who experience sexual misconduct. You can sign the letter of solidarity--and donate to the fund here . [bs_link link=\"https://mobile.nytimes.com/2018/01/01/movies/times-up-hollywood-women-sexual-harassment.html?referer=\" source=\"New York Times\"]\n[bs_bullet_primary] Vice at Vice . While this New York Times investigation is not the first media report of a sexual harassment problem at Vice Media, it paints a uniquely scathing portrait of a \"top-down ethos of male entitlement at Vice, where women said they felt like just another party favor at an organization where partying often was an extension of the job.\" The story reports that more than two dozen women say they've experienced or witnessed sexual misconduct at the company and reveals four settlements involving allegations of sexual harassment or defamation against Vice employees, including its current president. [bs_link link=\"https://www.nytimes.com/2017/12/23/business/media/vice-sexual-harassment.html?rref=collection%2Fsectioncollection%2Fbusiness&action=click&contentCollection=business&region=stream&module=stream_unit&version=latest&contentPlacement=42&pgtype=sectionfront&mtrref=www.nytimes.com&gwh=0338435B7C4F3A5D6C7B33AD80D2A1D2&gwt=pay\" source=\"New York Times\"]\n[bs_bullet_primary] Boards get onboard . In light of #MeToo and the numerous powerful men who've lost their jobs over sexual harassment allegations, some corporate board directors are--for the first time--saying that they would fire their company's CEO if past offensive behavior came to light during his or her tenure. In another sign of the times, other boards report that they're beefing up CEO candidate background checks to make sure any such behavior comes to light before they land in the corner office. [bs_link link=\"https://www.wsj.com/articles/sexual-harassment-scandals-are-reshaping-ceo-searches-1514370600\" source=\"WSJ\"]\n[bs_bullet_primary] Calling their own fouls . New York Times and Morning Consult polled 615 men about their behavior at work over the past year, finding that roughly a third admitted doing at least one thing that qualifies as sexual harassment or other objectionable behavior. By far the most common offenses were inappropriate jokes or stories (19%), followed by sexist remarks (16%). About 10% of the men said they had engaged in unwanted sexual attention, \"actions like touching, making com", "external_links": [], "published": "2018-01-02T15:49:00.000+02:00", "crawled": "2018-01-02T15:49:58.004+02:00", "highlightTitle": ""}