{"organizations": [], "uuid": "303a7ceadd21a0dba9aafcfe127243cd6dd36200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Wilbur Ross Tells Davos: U.S. Is Done ‘Being a Patsy’ on Trade – Fortune", "url": "http://fortune.com/2018/01/24/davos-2018-trump-wilbur-ross-trade-war-tariff/", "country": "US", "domain_rank": 1196, "title": "Wilbur Ross Tells Davos: U.S. Is Done ‘Being a Patsy’ on Trade", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-24T22:21:00.000+02:00", "replies_count": 0, "uuid": "303a7ceadd21a0dba9aafcfe127243cd6dd36200"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/24/davos-2018-trump-wilbur-ross-trade-war-tariff/", "ord_in_thread": 0, "title": "Wilbur Ross Tells Davos: U.S. Is Done ‘Being a Patsy’ on Trade", "locations": [], "entities": {"persons": [{"name": "patsy", "sentiment": "negative"}, {"name": "wilbur ross", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ross", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump’s decision on Tuesday to impose tariffs on imported washing machines and solar panels launched in earnest his long-anticipated crusade against what he sees as unfair trade. It also stoked concerns that a trade war looms.\nCommerce Secretary Wilbur Ross didn’t necessarily allay those fears at the World Economic Forum Annual Meeting in Davos, Switzerland on Wednesday, stating : “Trade wars are fought every single day, the difference is U.S. troops are now coming to the ramparts.”\nRoss added nuance to that remark, speaking on a panel at Davos later in the day: “ Nobody is trying to ignite what Smoot-Hawley did during the Depression,” Ross said, referring to legislation passed in 1930 that slapped tariffs on nations that shipped goods to the U.S. and arguably made the era’s financial downturn even worse. Rather, the Trump administration is trying to fix the “incorrect policy decisions that our government and others made earlier in the process,” he said. \nThe U.S.’s approach to trade is dated, Ross said. “These are old systems; the world has changed,” he said. Concessions made in the wake of World War II are “not so appropriate as we get here to this year.” \nDavid MacLennan, chairman and CEO of Cargill who appeared alongside Ross on a panel moderated by Time Inc. chief content officer Alan Murray, agreed that pacts brokered decades ago “need a facelift,” but said he was wary of Trump’s threats during the presidential campaign to rip up agreements like NAFTA.\n“ I hope that's not where it's going,” he said, noting that the administration’s decision last year to forego another agreement--the Trans-Pacific Partnership--is “not good” for his business. \nLikewise, Emma Marcegaglia, chairman of Italian multinational Eni SpA, said she supported changing trade agreements to reflect, say, the digital economy, but that such tweaks should be made inside the World Trade Organization.\nThe Trump administration, meanwhile, has had the WTO in its sights, blocking new appointments to the organization’s appellate body. WTO Director-General Roberto Azevedo, who shared the stage with Ross on Wednesday, said in November that the move cramped the watchdog’s ability to resolve disputes.\nYet at Davos, Ross seemed to recognize WTO’s role.\n“We do think that somebody needs to be the rule-maker or arbiter of global trade,” he said. “No need for it to be a total free-for-all. Does that mean we agree with every aspect? No.”\nRoss also issued a warning against misinterpreting the Trump administration’s hardline approach to trade, in what could foretell what Trump himself will communicate to the Davos crowd on Friday. “We don't intend to abrogate leadership,” Ross said. “Leadership is different from being a sucker and being a patsy.”", "external_links": [], "published": "2018-01-24T22:21:00.000+02:00", "crawled": "2018-01-26T10:39:47.000+02:00", "highlightTitle": ""}