{"organizations": [], "uuid": "48078787b0f23c99c1f8829ffde2fb4254cdcd73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930879-GettyImages-901287034.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/stock-market-optimism-from-pros-reaches-highest-level-since-1986.html", "country": "US", "domain_rank": 767, "title": "Stock market optimism from pros reaches highest level in nearly 32 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T14:27:00.000+02:00", "replies_count": 0, "uuid": "48078787b0f23c99c1f8829ffde2fb4254cdcd73"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/stock-market-optimism-from-pros-reaches-highest-level-since-1986.html", "ord_in_thread": 0, "title": "Stock market optimism from pros reaches highest level in nearly 32 years", "locations": [], "entities": {"persons": [{"name": "john gray", "sentiment": "none"}], "locations": [], "organizations": [{"name": "investors intelligence", "sentiment": "none"}, {"name": "dow jones", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "21 Hours Ago | 11:09 \nStock market optimism among professional investors just keeps on surging, and is now at the highest levels since before the crash of 1987. \nBullishness, or the belief that the market is heading higher, is now at 66.7 percent in the latest Investors Intelligence survey, a widely followed gauge of sentiment among investment newsletter authors. \nThat's the highest level since early April 1986 — a potential warning sign that the rush into equities is getting overdone. After all, a year after the bulls had reached this level came the infamous Black Monday crash that sent the Dow Jones industrials down nearly 22 percent in a single day. \n\"Sentiment readings have roughly followed their 1986/87 pattern. Then the bulls peaked with initial market highs early that year and they returned to above 60% levels months later after more index records,\" John Gray, editor of the Investors Intelligence weekly report, said in the latest issue Wednesday. \n\"In 1987 stocks crashed a few months after that. A repeat of that scenario suggests potential danger, especially as the market moves become parabolic,\" he added. \"Those recently holding cash appear to be chasing a rallying market, adding fuel to the fire.\" \nIndeed, the II survey reflects other gauges that show stock market fever is reaching levels not seen in years. Getty Images A trader wears a DOW 24,000 hat as he works on the floor of the New York Stock Exchange, (NYSE) as the Dow Jones Industrial Average crosses 25,000 on Jan. 4ht, 2018 for the first time. \nThe January Bank of America Merrill Lynch Fund Managers Survey — another gauge of professional investors' sentiment — showed cash levels at a five-year low, allocations to stocks at a two-year high and the overweight ratio of stocks to government bonds at its highest since August 2014. \nSentiment surveys can be contrarian indicators when at extremes, which is why the current rush into stocks has triggered some concern . In just over two weeks of trading, investors already have poured $14.8 billion into stock-based exchange-traded funds, another indicator of money surging in. \nThe Investors Intelligence survey also showed that skepticism is nearly gone as the S&P 500 has posted a 3.85 percent gain in 2018. \nBearishness fell over the past week to 12.7 percent, also the lowest reading since April 1986. The level was at 15.2 percent just two weeks ago and was above 20 percent the week of Sept. 12. \n\"The strengthening economy and increasing earnings projections makes this outlook hard to defend.\" Gray wrote. \"Low bearish readings are negative for contrarians as the markets are said to 'climb a wall of worry.'\" \nThe newsletter each week features a sample of bullish and bearish quotes from the authors it polls. This week found very little in the camp of those looking for a downturn, save for William John Kuhn, whose \"The Risk Factor Method of Investing\" compared the market to a runaway train. \n\"The lessons of the last crash are being ignored. We are witnessing all the safety equipment being ripped out of the stock market by those in power,\" Kuhn wrote. \"We are witnessing the market climb a mountain made of Swiss cheese with no guardrails.\"", "external_links": [], "published": "2018-01-17T14:27:00.000+02:00", "crawled": "2018-01-17T14:42:02.002+02:00", "highlightTitle": ""}