{"organizations": [], "uuid": "d51ff4f0f610546059a16be21e1913c0ca987445", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222730612&w=1200&r=LYNXMPEE0G0X8", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-ibm-stocks-research/ibm-shares-rise-after-barclays-double-upgrade-idUSKBN1F61MZ", "country": "US", "domain_rank": 408, "title": "IBM shares rise after Barclays double upgrade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-17T15:21:00.000+02:00", "replies_count": 0, "uuid": "d51ff4f0f610546059a16be21e1913c0ca987445"}, "author": "", "url": "https://www.reuters.com/article/us-ibm-stocks-research/ibm-shares-rise-after-barclays-double-upgrade-idUSKBN1F61MZ", "ord_in_thread": 0, "title": "IBM shares rise after Barclays double upgrade", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "ibm", "sentiment": "negative"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "international business machines", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:23 PM / Updated 6 hours ago IBM shares rise after Barclays double upgrade Reuters Staff 3 Min Read \n(Reuters) - Shares in International Business Machines rose nearly 2 percent on Wednesday, helped by a double-notch upgrade for the company from Barclays ahead of fourth-quarter results on Thursday. \nBarclays cited a handful of reasons for moving the stock to “overweight” from “underweight”, saying the company could emerge as the next important cloud vendor after Amazon and Microsoft. \nOut of 24 brokerages covering the stock, eight now have a “buy” or a higher rating; 14 have “hold” and just two “sell.” \nShares of IBM gained 1.7 percent at $166.72 in premarket trading. Up to Tuesday’s close, they have gained nearly 12 percent since its last quarterly results on Oct. 17. \nTo counter a slowdown in its legacy hardware and software businesses, IBM has been shifting focus steadily towards data analytics and cloud computing services. \nThe cloud market is currently dominated by Amazon Web Services and Microsoft’s Azure unit - both of which have been growing in double digits as customers scale up their Internet presence. \n“There is room for another cloud player,” Barclays analyst Mark Moskowitz wrote in a note titled “IBM - A New Dawn Emerges” and raised his price target on the stock to $192 from $133. \nThe company, which will report after U.S. markets close on Thursday, trumped Wall Street’s estimates for both profit and revenue in the third quarter ended Sept. 30. \nWhile total revenue in that quarter fell 0.4 percent, the 22nd straight quarterly fall, it was also the smallest quarterly drop since the third quarter of 2016. \nMoskowitz said IBM’s revenue may prove stable or even grow over the next 12-18 months. \nHe also argued that recently disclosed Spectre and Meltdown processor security flaws could allow IBM to gain share in the mid-range and high-end server market. \nIBM last month launched Power9 processors, designed for cloud computing and machine learning, to better compete with the likes of Intel and Advanced Micro Devices Inc. \nA fix for Meltdown, which only affects Intel chips, could lower performance by 30 percent in some cases, pushing customers to look for new processors, potentially lifting both IBM’s market share and revenue, Moskowitz wrote. \nIn a blog post dated Jan. 15, IBM said firmware patches for Power9 platforms were available to fix the security flaws. ( ibm.co/2DqgoFI ) Reporting by Supantha Mukherjee in Bengaluru", "external_links": [], "published": "2018-01-17T15:21:00.000+02:00", "crawled": "2018-01-17T15:37:09.150+02:00", "highlightTitle": ""}