{"organizations": [], "uuid": "5dc42a79fa9940edf37b31eb717d7bdf44563ea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955116-GettyImages-906906648.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/19/government-shutdown-news-all-eyes-on-divided-senate-trump-as-deadline-threatens.html", "country": "US", "domain_rank": 767, "title": "'Shutdown coming?' All eyes are on divided Senate, Trump as deadline threatens", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T15:12:00.000+02:00", "replies_count": 0, "uuid": "5dc42a79fa9940edf37b31eb717d7bdf44563ea1"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/government-shutdown-news-all-eyes-on-divided-senate-trump-as-deadline-threatens.html", "ord_in_thread": 0, "title": "'Shutdown coming?' All eyes are on divided Senate, Trump as deadline threatens", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "zach gibson", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "u.s. capitol", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 Hours Ago | 02:07 \nPresident Donald Trump urged Senate Democrats to get behind a short-term spending bill Friday morning as the deadline for funding the government loomed only hours away. \nTrump's tweet came ahead of a showdown vote in the Senate on a stopgap spending measure that passed the House on Thursday night . Senate Majority Leader Mitch McConnell maneuvered to make sure the vote takes place Friday, rather than late Thursday, to put as much pressure as possible on Democrats who appeared set to sink the bill and restart negotiations to keep the government open. \nSome government agencies will run out of money if Congress cannot pass a funding plan by the end of Friday. \n\"Now Democrats are needed if it is to pass in the Senate – but they want illegal immigration and weak borders,\" Trump contended in a tweet. \n\"Shutdown coming? We need more Republican victories in 2018!\" he added. Trump tweet \nGoldman Sachs economic analysts said Friday they see a 60 percent chance of a shutdown lasting anywhere from a few days to a few weeks. Each week of a shutdown would reduce first quarter gross domestic product by 0.2 percentage points, the analysts said in a note, although the impact would be reversed in the second quarter. \nThe legislation before the Senate would fund the government through Feb. 16, reauthorize the popular Children's Health Insurance Program for six years and delay some Affordable Care Act taxes. The GOP included reauthorization of CHIP — a program popular with Democrats — in the spending plan largely to force the minority party to support it. \nThe bill passed in the House with only some Republicans voting against it and a few Democrats supporting it. However, it will need at least 10 Democratic votes to clear the Senate — and possibly more if the three Republicans who oppose it continue to hold out. Zach Gibson | Bloomberg | Getty Images Demonstrators hold illuminated signs during a rally supporting the Deferred Action for Childhood Arrivals program (DACA), or the Dream Act, outside the U.S. Capitol building in Washington, D.C., on Thursday, Jan. 18, 2018. \nOn Friday morning, McConnell contended that voting for the bill should be a \"no-brainer\" and hit Schumer for putting his members \"into a corner\" over immigration. Shortly after 11 a.m., he said the Senate would move to a procedural vote on the measure \"soon.\" \nAfter it appeared House Republicans could adjourn on Friday as scheduled, members said they were told to stick around for possible additional votes. If the Senate rejects the House-passed proposed, lawmakers could have to scramble for an alternative. \nSaturday is the first anniversary of Trump's inauguration. He was scheduled to leave Washington on Friday for his private Mar-a-Lago club in Florida, where he was slated to celebrate his first year in office with a big-money fundraiser . \nHowever, the White House later said Trump will not go to Florida on Friday as the shutdown deadline loomed. \nDemocrats have cried foul over Republicans moving to pass a spending bill this week without also trying to pass immigration legislation. The minority party wants to approve a measure shielding hundreds of thousands of young undocumented immigrants from deportation, along with Republican-sought measures to boost border security and reform extended family migration and the visa \"lottery\" system. \nAfter Senate Democrats joined Republicans in voting to proceed to the House-passed spending bill Thursday night, progress stalled as lawmakers were faced with the prospect of the plan failing. Senate Minority Leader Chuck Schumer wanted to hold the doomed vote on Thursday night. That may have set the stage for fresh talks on funding the government on Friday, and Schumer argued that lawmakers had enough time to put an immigration deal in front of the president. \nMcConnell ensured that a vote on the plan would not take place until Friday, thereby putting more pressure on Democrats to pass it or risk a shutdown. \nOn the Senate floor Thursday night, McConnell said Democrats were trying to hold the country \"hostage\" over a \"non-imminent problem.\" \nSchumer, in response, decried \"complete disarray\" on the Republican side. He argued for a bill that extended funding only for a few days, rather than a month, to give lawmakers more time to hash out a long-term plan. show chapters", "external_links": [], "published": "2018-01-19T15:12:00.000+02:00", "crawled": "2018-01-19T15:26:58.008+02:00", "highlightTitle": ""}