{"organizations": [], "uuid": "c915c662a5bb69e8a6f6be15afc4da66918d20f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955273-GettyImages-137446250.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/31/amid-publicity-tour-porn-star-stormy-daniels-denies-having-an-affair-with-trump.html", "country": "US", "domain_rank": 767, "title": "Porn star Stormy Daniels denies having an affair with Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-31T13:13:00.000+02:00", "replies_count": 0, "uuid": "c915c662a5bb69e8a6f6be15afc4da66918d20f9"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/amid-publicity-tour-porn-star-stormy-daniels-denies-having-an-affair-with-trump.html", "ord_in_thread": 0, "title": "Porn star Stormy Daniels denies having an affair with Trump", "locations": [], "entities": {"persons": [{"name": "daniels", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "keith davidson", "sentiment": "none"}, {"name": "clifford", "sentiment": "none"}, {"name": "stephanie clifford", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "trump adult", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adult film star Stormy Daniels, in the midst of a publicity tour fueled by past allegations of a 2006 sexual relationship with a then-married Donald Trump , said in a statement on Tuesday the alleged affair never occurred.\nKeith Davidson, a lawyer for Daniels, whose real name is Stephanie Clifford, confirmed the statement was authentic but didn't offer any further details.\nThe statement came at a curious time for Clifford, who appeared after the president's State of the Union address on ABC's \"Jimmy Kimmel Live!\" In recent weeks she has changed production companies, given a television interview and promoted strip club appearances with a risque play on Trump's \"Make America Great Again,\" campaign slogan.\nMichael Cohen, Trump's personal lawyer, has denied there was any affair.\nOn Kimmel's show, Clifford ducked most of his questions about the alleged affair by either remaining silent or cracking jokes. She addressed, vaguely, the legitimacy of the new statement.\nKimmel began by displaying a copy and comparing her signature on it to other examples. They didn't match, he said, asking if she had signed it.\n\"I don't know, did I?\" she said. \"That doesn't look like my signature, does it?\"\nThe ABC host asked if that was an admission that the statement was written and released without her approval, which drew a smile, coy look and a giggle from Clifford.\nThe rest of the interview went on in the same vein, as Clifford skirted whether she had signed a non-disclosure agreement; if an In Touch magazine interview was accurate — \"Not as it is written,\" she replied — and if the magazine's full transcript of her comments was accurate.\nWhen Kimmel started to read details of her alleged encounters with Trump, Clifford interrupted: \"I thought this was a talk show, not a horror movie. Because this is a whole different pay scale.\"\nClifford's allegation, first made in 2011 and then again a month before the election, went mostly unnoticed until the Wall Street Journal reported earlier this month that Cohen brokered a $130,000 payment to Clifford to keep her from publicly discussing it.\nA week after that report, In Touch magazine printed a 5,000-word interview it conducted with Clifford in 2011 but never published after Cohen threatened the tabloid with a lawsuit, the Associated Press has previously reported.\nIn that interview, Clifford described a single sexual encounter with Trump in 2006 when he was recently married to his third wife, Melania, as well as a subsequent years-long relationship with the reality TV star. The magazine said it corroborated her account with friends and that she passed a lie detector test.\nIn her statement Tuesday, Clifford said she wasn't denying the affair because she was paid \"hush money,\" but rather \"because it never happened.\"\nNeither Cohen nor Clifford have addressed whether she was paid $130,000, and if so why.\nA publicist didn't respond to questions about the statement Tuesday.\nKimmel's show opened with him and Clifford seated in armchairs and watching Trump's State of the Union address.\n\"Enough of this. Stormy, show me on the puppet what he did to you,\" Kimmel said to her, holding up a doll dressed in a shirt and briefs and with a mop of Trump-like hair.\nClifford produced a blond female doll with duct tape across its mouth, and gave a small nod as she looked at the camera.", "external_links": [], "published": "2018-01-31T13:13:00.000+02:00", "crawled": "2018-01-31T13:35:33.013+02:00", "highlightTitle": ""}