{"organizations": [], "uuid": "7399379484ffe029dd70f180c2b71202e98b1821", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937250-GettyImages-630110738.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/09/north-carolina-must-redraw-gops-illegally-gerrymandered-map-judges.html", "country": "US", "domain_rank": 767, "title": "Judges: North Carolina must redraw GOP's gerrymandered map", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T03:08:00.000+02:00", "replies_count": 0, "uuid": "7399379484ffe029dd70f180c2b71202e98b1821"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/north-carolina-must-redraw-gops-illegally-gerrymandered-map-judges.html", "ord_in_thread": 0, "title": "Judges: North Carolina must redraw GOP's gerrymandered map", "locations": [], "entities": {"persons": [{"name": "nelson", "sentiment": "none"}, {"name": "ethan hyman", "sentiment": "none"}, {"name": "david lewis", "sentiment": "none"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "raleigh", "sentiment": "none"}, {"name": "legislative building", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "raleigh news & observer | getty images", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Federal judges ruled Tuesday that North Carolina's congressional district map drawn by legislative Republicans is illegally gerrymandered due to excessive partisanship that gave GOP a rock-solid advantage for most seats and must quickly be redone.\nThe ruling marks the second time this decade that the GOP's congressional boundaries in North Carolina have been thrown out by a three-judge panel. In 2016, another panel tossed out two majority black congressional districts initially drawn in 2011, saying there was no justification for using race as the predominant factor in forming them. The redrawn map was the basis for a new round of lawsuits.\nThe latest lawsuit — filed by election advocacy groups and Democrats — said the replacement to the racial gerrymander also were unlawful partisan gerrymanders. Those who sued argued that Republican legislators went too far when they followed criteria designed to retain the party's 10-3 majority.\nAt the time of debate, according to the order, House redistricting chief Rep. David Lewis attempted to justify the criteria by saying during debate that \"I think electing Republicans is better than electing Democrats. So I drew this map to help foster what I think is better for the country.\"\n\"We find that the General Assembly drew and enacted the 2016 plan with intent to subordinate the interests of non-Republican voters and entrench Republican control of North Carolina's congressional delegation,\" U.S. Circuit Court Judge Jim Wynn wrote in the majority opinion. Wynn added that the evidence shows the \"plan achieved the General Assembly's discriminatory partisan objective.\"\nIn their ruling Tuesday, the judges ordered the General Assembly to approve another set of districts by Jan. 24. Candidate filing for the November congressional elections begin Feb. 12. A majority of the judges also agreed they would also hire a redistricting expert to draw replacement boundaries if the legislature won't.\nThrough a spokeswoman, one of the legislative defendants, Sen. Ralph Hise of Mitchell County, said lawmakers plan to appeal.\nThere's a good chance Republicans will try to ask the U.S. Supreme Court to block the ruling's enforcement until the justices rule in a similar case they heard from Wisconsin in the fall. But that case involves legislative districts, not a congressional plan.", "external_links": [], "published": "2018-01-10T03:08:00.000+02:00", "crawled": "2018-01-10T03:44:12.013+02:00", "highlightTitle": ""}