{"organizations": [], "uuid": "71c14cf19093abfe57f0f961f01c0adbc3b06071", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933444-screenshotofvideo.1910x1000.jpg", "site_section": "http://drudgereportfeed.com/rss.xml", "section_title": "Drudge Report Feed", "url": "https://www.cnbc.com/2018/01/08/fire-crews-are-responding-to-a-fire-at-trump-tower-in-new-york-city.html", "country": "US", "domain_rank": 767, "title": "Fire crews responding to fire at Trump Tower NYC... Developing...", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T14:55:00.000+02:00", "replies_count": 0, "uuid": "71c14cf19093abfe57f0f961f01c0adbc3b06071"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/fire-crews-are-responding-to-a-fire-at-trump-tower-in-new-york-city.html", "ord_in_thread": 0, "title": "Fire crews responding to fire at Trump Tower NYC... Developing...", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "trump tower nyc", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "silvio santos", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Three people were injured in an early-morning fire at the top of Trump Tower in midtown Manhattan, the New York Fire Department said on Monday, as the city's workday rush began.\nU.S. President Donald Trump was in Washington at the time. Trump's primary residence was in the building before his election victory and inauguration nearly a year ago.\nOne firefighter was hospitalized with nonlife-threatening injuries, while two people received minor injuries that were treated at the scene, including a building worker whose injury was initially described as serious, the Fire Department said.\nEric Trump , one of the president's sons, said on Twitter that it was a small electrical fire in the cooling tower on the building's roof.\n\"The New York Fire Department was here within minutes and did an incredible job,\" said the younger Trump. \"The men and women of the #FDNY are true heros and deserve our most sincere thanks and praise!\"\nEric Trump tweet\nThe Fire Department said the fire was not inside the building, but on top of it.\n\"We had flames coming out of the vents. No smoke condition or fire was on the inside,\" Manhattan Borough Commander Assistant Chief Roger Sakowich said on Twitter.\nThe cause of the blaze is being investigated by the city fire marshal, a department spokesman said.\nshow chapters Rooftop electrical fire reported at Trump Tower 8 Hours Ago | 00:36\nOnce the investigation is complete, the results will be released, the spokesman, Firefighter Jim Long, said.\nAs firefighters battled the blaze, a plume of smoke spewed from the roof of the 68-story structure.\nThe fire was reported by phone shortly before 7 a.m. EST (noon GMT) on the top floor of the building and was declared under control about an hour and 15 minutes later, the department said.\nSome 84 firefighters and medical crews responded as 26 emergency units with lights flashing converged on the crowded midtown Manhattan location, it added.\nIn addition to the president's 66th-floor penthouse, Trump Tower houses the headquarters of the Trump Organization as well as other residences, offices and stores.\nAndrew Kelly | Reuters New York Fire Department crew respond after a fire broke out at Trump Tower in Manhattan, New York City, U.S. January 8, 2018. Today show tweet\nAndy Constan tweet\nHugh Carran tweet\nazfamily TV CBS 5 tweet", "external_links": [], "published": "2018-01-08T14:55:00.000+02:00", "crawled": "2018-01-08T14:59:28.002+02:00", "highlightTitle": ""}