{"organizations": [], "uuid": "4a0f6f4f66c7dafaadc2bdf43437bc364b86a540", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/03/104196554-Bach_Headshot_2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/17/self-made-millionaire-got-life-changing-money-advice-at-age-7.html", "country": "US", "domain_rank": 767, "title": "Self-made millionaire: The best money advice I ever got came from my grandma when I was 7", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "4a0f6f4f66c7dafaadc2bdf43437bc364b86a540"}, "author": "", "url": "https://www.cnbc.com/2018/01/17/self-made-millionaire-got-life-changing-money-advice-at-age-7.html", "ord_in_thread": 0, "title": "Self-made millionaire: The best money advice I ever got came from my grandma when I was 7", "locations": [], "entities": {"persons": [{"name": "david bach", "sentiment": "negative"}, {"name": "rose bach", "sentiment": "none"}, {"name": "david bach  bach", "sentiment": "none"}, {"name": "bach", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mcdonald", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 00:45 SHARES \nSelf-made millionaire and co-founder of AE Wealth Management David Bach started investing early: He bought his first stock at age seven. \nIt's all thanks to his grandmother, Bach tells CNBC Make It : \"The best advice I ever got about money came from my Grandma Rose Bach. She helped me buy my first stock at age seven in McDonald's, and she basically taught me a lesson that changed my life.\" \nShe told him, \"There are three types of people in the world: Those who come to McDonald's and eat here, like you are now, and spend money; those who work here for minimum wage; and those who invest in the company. Investors get rich.\" Courtesy of David Bach Self-made millionaire and bestselling author David Bach \nBach's grandmother proceeded to help him buy his first stock and \"that experience of thinking like an investor starting at the age of seven changed my whole life,\" he says. After all, as the self-made millionaire came to learn, consistently investing a portion of your paycheck — a strategy known as paying yourself first — is the key to getting building wealth. \n\"Becoming rich requires nothing more than committing and sticking to a systematic savings and investment plan,\" Bach writes in his New York Times bestseller \" The Automatic Millionaire .\" And, because of compound interest , the sooner you put your money to work, the better. \nTo be clear, your investment plan shouldn't involve you trying to pick stocks individually. Bach and other experts tend to agree that you should start by investing your money in a tax-advantaged retirement account , such as a 401(k) , IRA or Roth IRA . Then, look into index funds , which offer diversity at a low cost and generally deliver good long-term returns, or robo-advisors . \nBut if you're trying to get your kid hooked on investing, help them get involved at a young age, like Bach's grandmother did. \"If you can do anything with your kids, help them buy one share of stock — a company that they use and love — and teach them how to be an investor,\" Bach tells CNBC Make It. \"It will change their outlook on everything.\"", "external_links": [], "published": "2018-01-18T15:00:00.000+02:00", "crawled": "2018-01-18T15:57:08.025+02:00", "highlightTitle": ""}