{"organizations": [], "uuid": "976535aab871bf1313311514830b6c5f164c3755", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104954216-GettyImages-906703892.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19834788/device/rss/rss.xml", "section_title": "Asia Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/what-happens-during-a-us-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "What happens during a US government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T03:54:00.000+02:00", "replies_count": 0, "uuid": "976535aab871bf1313311514830b6c5f164c3755"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/what-happens-during-a-us-government-shutdown.html", "ord_in_thread": 0, "title": "What happens during a US government shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "mcnamee", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "us capitol", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes What happens during a US government shutdown President Donald Trump and Republican leaders in Congress are racing to meet a midnight Friday deadline to pass a short-term spending bill to keep the U.S. government open Employees in all three branches of government are vulnerable to furlough, or temporary unpaid leave The last government shutdown in October 2013 lasted more than two weeks and more than 800,000 federal employees were furloughed Published 18 Hours Ago SHARES Win McNamee | Getty Images The US Capitol on January 18, 2018 as Congress continues to wrestle to pass a spending bill. \nPresident Donald Trump and Republican leaders in Congress are racing to meet a midnight Friday deadline to pass a short-term spending bill to keep the U.S . government open and prevent agencies from shutting down. \nDuring government shutdowns, employees in all three branches of government are vulnerable to furlough, or temporary unpaid leave. Other \"essential\" workers, including those dealing with public safety and national security, continue working, some with and others without pay. \nAfter previous government shutdowns, Congress passed measures to ensure that essential and nonessential employees received retroactive pay. \nThe last government shutdown in October 2013 lasted more than two weeks and more than 800,000 federal employees were furloughed. Here is a sampling of what happened, based on previous Reuters reports and government sources: \nNATIONAL PARKS: National parks closed and overnight visitors were given two days to depart, resulting in a loss of 750,000 daily visitors, according to the nonprofit National Parks Conservation Association. The National Park Service estimated that the shutdown resulted in $500 million in lost visitor spending in areas surrounding parks and the Smithsonian museums. \nWASHINGTON TOURIST SIGHTS: Popular tourist destinations such as the Smithsonian closed, with barricades going up at the Lincoln Memorial, the Library of Congress and the National Archives. The National Zoo closed to visitors and its popular \"Panda Cam\" went dark shortly after the birth of a much-watched cub. \nTAXES: The Internal Revenue Service furloughed 90 percent of its staff, according the liberal Center for American Progress. About $4 billion in tax refunds were delayed as a result, according to the Office of Management and Budget, or OMB. \nMAIL DELIVERY: Deliveries continued as usual because the U.S. Postal Service receives no tax dollars for day-to-day operations and relies on income from stamps and other fees. \nTRAVEL: Air and rail travelers did not feel a big impact because security officers and air traffic controllers remained at work.Passport processing continued with some delays, as operations are funded by both fees and money appropriated by Congress. \nCOURTS: Federal courts, including the Supreme Court, remained open. The Administrative Office of the U.S. Courts has said federal courts could continue to operate normally for about three weeks without additional funding. \nHEALTHCARE: Sign-ups for the newly created Obamacare health insurance exchanges began as scheduled. The Medicare health insurance program for the elderly also continued largely without disruption. A program at the U.S. Centers for Disease Control and Prevention to track flu outbreaks was temporarily halted. Hundreds of patients could not enroll in National Institutes of Health clinical trials, according to the OMB. \nCHILDREN: Six Head Start programs operating in Alabama, Connecticut, Florida, Georgia, Mississippi and South Carolina serving about 6,300 children shut for nine days before reopening with money provided by philanthropists, according to the OMB. \nSOCIAL SECURITY: Social Security and disability checks were issued with no change in payment dates and field offices remained open but offered limited services. There were delays in the review process for new applicants. \nMILITARY: All military personnel continued on normal duty status but about half of the Defense Department's 800,000 civilian employees were placed on unpaid leave. Nearly all were recalled one week into the shutdown after the Defense Department implemented the Pay Our Military Act, which had recently been passed by Congress. \nLOANS: The processing of mortgages and other loans was delayed when lenders could not access government services such as income and Social Security number verification. The Small Business Administration was unable to process about 700 applications for $140 million in loans until the shutdown ended, according to the Congressional Budget Office. \nVETERANS: Department of Veterans Affairs services continued, including the operation of VA hospitals. \nFOOD INSPECTIONS: Department of Agriculture meat inspectors stayed on the job. Agricultural statistical reports ceased publication. The USDA's website went dark and linked to a page explaining the shutdown.", "external_links": [], "published": "2018-01-19T03:54:00.000+02:00", "crawled": "2018-01-19T04:03:58.013+02:00", "highlightTitle": ""}