{"organizations": [], "uuid": "22667ccfa0333302c294788b76708f34ea6703fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 210}, "facebook": {"likes": 52, "shares": 52, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104954929-CIRCULAR_STILL_copy.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19836768/device/rss", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/19/some-businesses-think-the-circular-economy-could-change-everything.html", "country": "US", "domain_rank": 767, "title": "There’s a new type of economy in town — and some businesses think it could change everything", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T12:43:00.000+02:00", "replies_count": 0, "uuid": "22667ccfa0333302c294788b76708f34ea6703fc"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/some-businesses-think-the-circular-economy-could-change-everything.html", "ord_in_thread": 0, "title": "There’s a new type of economy in town — and some businesses think it could change everything", "locations": [], "entities": {"persons": [{"name": "elizabeth schulze", "sentiment": "negative"}, {"name": "peter lacy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "circular economy advantage", "sentiment": "none"}, {"name": "accenture strategy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Elizabeth Schulze | @eschulze9 Published 5:44 AM ET Fri, 19 Jan 2018 \nLeasing a car or an apartment is part of everyday life. But what if you could also lease daily household products like a washing machine or a lightbulb? \nThe circular economy aims to do just that. It's a system designed to keep materials and resources in use for as long as possible. \nAnd it's become an attractive business strategy for companies looking to extend the life of their products and achieve sustainability targets. \n\"The circular economy is in essence the way of moving forward from 200 years of linear value chains,\" said Peter Lacy, senior managing director at Accenture Strategy and author of \"Waste to Wealth – the Circular Economy Advantage.\" \nMost organizations operate in a linear model, which is based on the notion of \"take, make, and dispose.\" So, for example, a lightbulb company would take resources, like metal and glass, to manufacture its products. It makes lightbulbs and sells them to customers, who eventually dispose of them. \nBut the linear model can leave companies vulnerable to big swings in the prices and scarcity of materials. \n\"What the circular economy does is it changes that relationship in the shape of those value chains to be about take, make, take, make,\" Lacy said. CNBC | Benjamin Hall The London office of the National Union of Students signed a 15-year lease for its lighting. \nThe circular economy is at work in the London office of the National Union of Students (NUS), a non-profit that represents students across the U.K. Rows of LED lights illuminate the office, turning on and off based on movement in the room. Instead of buying the lightbulbs, NUS signed a 15-year lease with Philips Lighting to receive light as a service. \n\"At the end of the life of the lights, the lights belong to Philips,\" said Jamie Agombar, Head of Sustainability at NUS. \nNUS pays Philips a quarterly fee for the light, which covers all maintenance and replacement costs over the 15-year period. Joao Pola, CEO of Philips Lighting in the UK and Ireland, said the model encourages his company to provide the most efficient light, while maintaining ownership of its resources. \n\"Going for a model like this creates a big incentive to make our products more reusable in the future,\" Pola said. \"It becomes a win-win situation to improve the efficiency of the system for the customer and for ourselves.\" \nAgombar added that paying a fixed price for light allowed the NUS to make other sustainable investments, including solar panels and rainwater harvesting. \"A lot of that has been afforded because we rented the lights,\" he said. \nPaying for a service like light is just one idea within the circular economy. Retailers like H&M and Patagonia are using circular models to recycle and reuse old garments for new clothes. Car-sharing programs help reduce overcapacity by keeping vehicles in use, instead of parked in a driveway or lot. Arnd Wiegmann |Reuters A collection box for used clothes is shown at an H&M in Stockholm, Sweden. \nAccenture's Lacy said the circular economy extends far beyond recycling. \n\"What we're saying in the circular economy is how do we come up with new business models that allow us to change the huge waste of natural resources and financial resources,\" he said. \nFor companies, changing mindsets and taking on the costs of new products and supply chains remain some of the biggest barriers to adopting circular strategies. A 2017 report from Accenture Strategy found only 22 percent of companies surveyed in the U.K. generated value from products that were returned for reuse, recycling or refurbishing. \nBut Lacy said he's optimistic more companies will turn to the circular economy with the help of new technologies like robotics and artificial intelligence. \n\"If we do arc those technologies from linear toward circular I think we have a lot of potential,\" he said.", "external_links": [], "published": "2018-01-19T12:43:00.000+02:00", "crawled": "2018-01-20T00:17:53.006+02:00", "highlightTitle": ""}