{"organizations": [], "uuid": "f62e8854b8e791eed1e0d5119d0d57bed34bf567", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/07/23/100907209-156458329r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/newell-brands-stock-craters-20-percent-unveils-plans-to-sell-off-assets.html", "country": "US", "domain_rank": 767, "title": "Rubbermaid-maker Newell stock craters 22%, unveils plans to sell off assets, close factories", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T17:56:00.000+02:00", "replies_count": 0, "uuid": "f62e8854b8e791eed1e0d5119d0d57bed34bf567"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/newell-brands-stock-craters-20-percent-unveils-plans-to-sell-off-assets.html", "ord_in_thread": 0, "title": "Rubbermaid-maker Newell stock craters 22%, unveils plans to sell off assets, close factories", "locations": [], "entities": {"persons": [{"name": "ty wright", "sentiment": "negative"}, {"name": "newell", "sentiment": "negative"}, {"name": "michael sheetz", "sentiment": "none"}, {"name": "mapa", "sentiment": "none"}, {"name": "rawlings", "sentiment": "none"}, {"name": "waddington", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg | getty images  newell brands", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "newell", "sentiment": "none"}, {"name": "rubbermaid outdoor", "sentiment": "none"}, {"name": "rubbermaid commercial products", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Ty Wright | Bloomberg | Getty Images \nNewell Brands stock plunged more than 20 percent Thursday after the Rubbermaid maker said it may sell off assets. \nThe company said it will explore strategic options for at least 10 of its industrial and consumer businesses. They include: Waddington, Process Solutions, Rubbermaid Commercial Products, Rawlings, Goody, Rubbermaid Outdoor and U.S. Playing Cards. \nIf Newell moves forward with all of its restructuring plans, the company's global factory and warehouse footprint would see a reduction of 50 percent. \nThe company plans to refocus on nine core consumer businesses, which generate $11 billion in total net sales, roughly 82 percent of Newell's fiscal 2016 sales. \nThe moves come a little over a year after its $13.22 billion acquisition of Jarden Corp. in a combination of two consumer giants with vast portfolios. Investors at the time questioned how difficult it would be to integrate a collection of brands spanning Elmer's Glue, Sharpie Pens and Yankee Candle. Several of the brands Newell is selling came from the Jarden acquisition. \n\"It's a big and broad portfolio, the work will not be easy, but it will come together through great leadership,\" Newell Brands CEO Michael Polk told CNBC after the deal closed. \nNewell's stock was down nearly 22 percent by midday Thursday. Newell shares have lost more than 32 percent in the new year through Wednesday's close. In recent months, consumer products giants have seen escalating pressure from retailers, who are working hard to keep prices low to attract shoppers and manage their inventory. Martin Franklin announced his resignation Thursday from the board, as did Ian G.H. Ashken and Domenico De Sole. The three had joined Newell's board as part of the acquisition. \n\"While there is still much work to be done, Domenico, Martin, and Ian have helped management and the Board bring these two great companies together into one of the leading branded goods companies,\" the company said in a statement. \nFranklin is an investor known for his acquisition vehicles like Jarden and frozen food-focused Nomad Foods. He left the board because he felt limited in his ability to influence the company's strategy going forward, sources familiar with the situation said. \nThose sources spoke on the condition of anonymity because the information is not public. Franklin could not be reached for comment and Newell declined to comment. \nPart of the company's strategy, as outlined in 2016, has been a focus on driving growth through innovation. Michael Sheetz News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-25T17:56:00.000+02:00", "crawled": "2018-01-25T18:21:13.005+02:00", "highlightTitle": ""}