{"organizations": [], "uuid": "3aa039e18950fa66182ea2998e0e0d55db9fb183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 453, "shares": 453, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/05/104691220-GettyImages-825587714.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/24/trump-daca-recipients-will-morph-into-citizens-over-10-to-12-years.html", "country": "US", "domain_rank": 767, "title": "Trump: DACA recipients will 'morph into' citizens over 10 to 12 years", "performance_score": 4, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T01:51:00.000+02:00", "replies_count": 0, "uuid": "3aa039e18950fa66182ea2998e0e0d55db9fb183"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/trump-daca-recipients-will-morph-into-citizens-over-10-to-12-years.html", "ord_in_thread": 0, "title": "Trump: DACA recipients will 'morph into' citizens over 10 to 12 years", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Trump: DACA recipients will 'morph into' citizens over 10 to 12 years President Donald Trump on Wednesday said that undocumented young people in the country should not worry about being deported. \"Tell them not to worry. We are going to solve the problem,\" Trump said, referring to some 800,000 undocumented immigrants protected by the DACA program. \"At some point in the future, over a period of 10 to 12 years,\" DACA recipients could become citizens, he said. SHARES Getty Images President Donald Trump makes an announcement on the introduction of the Reforming American Immigration for a Strong Economy (RAISE) Act in the Roosevelt Room at the White House on August 2, 2017 in Washington, DC. \nPresident Donald Trump on Wednesday said that undocumented young people in the country should not worry about being deported, because Congress will strike a deal to extend current DACA protections. \n\"Tell them not to worry. We are going to solve the problem. It's up to the Democrats, but they should not be worried,\" Trump said to reporters before leaving for Switzerland on Wednesday evening. \nTrump also said that his immigration plan would include a path to citizenship in 10 or 12 years for the approximately 800,000 young people covered under Obama-era DACA protections. \n\"We're going to morph into it. It's going to happen,,\" Trump said. \"At some point in the future, over a period of 10 to 12 years,\" DACA recipients could become citizens, he said. \nTrump also said he is prepared to ask Congress for $25 billion in order to fund the building of a wall on the U.S. Mexico border, with the additional $5 billion over what had previously been floated to be used to fund additional \"border security\" measures. \nTrump's comments, made in an impromptu meeting with reporters, triggered positive responses almost instantly from moderate Republicans like South Carolina Sen. Lindsey Graham, who is part of a small bipartisan group of senators working to craft a longer-term immigration fix. \n\"This statement represents presidential leadership on immigration that will allow us to solve a difficult problem,\" Graham said in a statement shortly after Trump's comments were reported. \"I truly appreciate President Trump making it clear that he supports a path to citizenship for DACA recipients. This will greatly help the Senate efforts to craft a proposal which President Trump can sign into law.\" \nTrump's comments, and Graham's speedy response, indicate that Trump may be raising the stakes on an immigration deal currently being negotiated behind-the-scenes in Congress --- effectively offering a path to citizenship to DACA recipients in exchange for even more funding for a border wall and additional border security. \nWhite House press secretary Sarah Sanders said Wednesday that Trump will release a \"legislative framework\" for immigration negotiations on Monday, which \"represents a compromise that members of both parties can support.\" She declined to offer any additional details. ", "external_links": [], "published": "2018-01-25T01:51:00.000+02:00", "crawled": "2018-01-25T02:22:39.005+02:00", "highlightTitle": ""}