{"organizations": [], "uuid": "308b2233143559af08dac41f7f61367810eeccaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/07/104573616-IMG_3283-jim-cramer.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/cramer-remix-violate-these-market-rules-at-your-own-peril.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Violate these investing rules at your own peril", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "308b2233143559af08dac41f7f61367810eeccaa"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/cramer-remix-violate-these-market-rules-at-your-own-peril.html", "ord_in_thread": 0, "title": "Cramer Remix: Violate these investing rules at your own peril", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "mins ago cnbc.com  cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mad Money with Jim Cramer Cramer Remix: Violate these investing rules at your own peril \"Mad Money\" host Jim Cramer reveals his most important rules for buying stocks, paying taxes and managing your portfolio. Cramer also shares where he differs from Wall Street money managers in his strategy. The \"Mad Money\" host also sets the minimum homework requirement for investors. 21 Hours Ago | 01:11 \nCNBC's Jim Cramer knows that he constantly repeats the same old investing rules, but it's because rules mean discipline, and discipline always trumps conviction. \n\"One thing I've learned in my investing career: no matter how much you might believe in something, you violate the rules of the road at your own peril,\" the \" Mad Money \" host said. \nInvesting rules aren't easy to spot. They're not like the laws of physics, which can be deduced by observing the way the world works. The market is a beast of its own, and rules come from experience. \nCramer's nearly 40 years in the business have taught him some important lessons, lessons that he's made into rules for all the homegamers interested in buying stocks. \nOne of his most important rules ? Don't snub the tax man. \n\"Look, no one has ever liked paying taxes,\" Cramer acknowledged. \"But, like death, taxes are inevitable and unavoidable.\" \nSo many investors are loath to pay taxes on their winnings, but Cramer has seen some market players incur serious losses by waiting too long to write a check to Uncle Sam. \nThe fact is, some gains are unsustainable and should be booked quickly, no matter the cost, Cramer said. Taking some profits won't set you back dramatically; it'll keep your portfolio safe. Buying strategy Ralph Orlowski | Bloomberg | Getty Images Statues of a bull and a bear outside the Frankfurt Stock Exchange \nAt the end of the day, Cramer knows investors are only human. \nThat's why the \"Mad Money\" host has come up with a set of investing rules to help guide them through the emotion and the fallibility that can come with being involved in stocks. \nOne of Cramer's most important rules has to do with buying stocks. \n\"This is a real important one: never buy a stock all at once,\" Cramer said. \"I can't stress it enough: do not, under any circumstances, buy all at once.\" \nPlenty of Wall Street brokers and advisors prefer not to deal with partial orders or buying a stock gradually over time. They like to go in big and make a statement with their purchases. \n\"From where I stand, that's all wrong — 100 percent wrong,\" the \"Mad Money\" host said. \"What I want you to do is stage your buys. Stage your sells. The term we use on Wall Street is 'Work your orders.' Try to get the best price over time, and not necessarily in one day. Maybe multiple days.\" Navigating panic Getty Images A trader reacts to the Flash Crash on May 6, 2010. \nIn many ways, individual investors are often their own worst enemies, as Cramer has learned over the years. \n\"If you want to invest wisely, you constantly need to be fighting off your own worst impulses,\" he said. \"We're not robots, we have emotions, and those emotions can really throw you off your game.\" \nThat's why Cramer is always drilling down on another cardinal rule : \"Nobody ever made a dime panicking.\" \nYet no matter how much he repeats it, Cramer constantly sees sellers come out of the woodwork anytime an individual stock or the overall market takes a hit. \nNow, if you were an ancient hunter-gatherer and came across a grizzly bear, the instinct to panic and flee would come in handy, the \"Mad Money\" host said. \n\"But it's not a useful emotion when it comes to analyzing the stock market, where you're running away when maybe you should be running toward\" stocks, he said. Less is more? ChinaFotoPress | Getty Images \nEvery morning at his old hedge fund, Cramer would spend a few hours going over the mistakes he made the day before. \n\"I would analyze every losing trade — you don't need to analyze the winners, they take care of themselves — [and] I'd try to figure out how I could've made more money or, much more importantly, lost less money,\" the \"Mad Money\" host said. \nAfter a few years of this routine, something finally dawned on him. \n\"I realized that good performance could be linked directly to having fewer positions,\" Cramer said. \"When we owned fewer stocks, we tended to make more money.\" \nEver since, Cramer hasn't bought a stock without taking a different one off the table. But not owning too many stocks comes with a price , too. The value of homework Getty Images \nIf you want to be serious about investing, you have to be rigorous. And nothing says rigorous like doing your homework, Cramer said. \nThe problem is that so many investors act like Cramer's kids when it comes to the homework: they hate it, feel like it's punishment and don't understand why it's useful. \nIn Cramer's world, that's wrong. To him, discovering everything there is to know about a company is the definition of responsible investing. \n\"Before you buy a stock, you should listen to the conference calls,\" he said. \"That's the minimum. You can go to the company's website. You can read the research. Read some news stories. Google the darned thing. Everything's available on the web. Everything. You have so much more available now, so much more knowledge, that there really is no excuse.\" \nDoing the homework helps investors stay diversified, another one of Cramer's most significant lessons. Sector risk — or the tendency for stocks in the same sector to trade together — can hit at extreme moments and destroy entire portfolios if investors don't know what they own. \n\"Whether you're an amateur or a professional, you always need to do your homework and keep your portfolio diversified,\" Cramer said. \"It may not be exciting, it may not be sexy, but this is the kind of routine maintenance stuff that protects you from monster losses down the line.\" \nQuestions for Cramer?", "external_links": [], "published": "2018-01-26T02:00:00.000+02:00", "crawled": "2018-01-26T02:11:13.006+02:00", "highlightTitle": ""}