{"organizations": [], "uuid": "7cd8a23effb73b41a69cf6667c935db24e992cd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936595-Bill_and_Melinda_Gates.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/why-bill-gates-is-not-the-richest-person-in-the-world.html", "country": "US", "domain_rank": 767, "title": "Why Bill Gates is no longer the richest person in the world", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T19:59:00.000+02:00", "replies_count": 0, "uuid": "7cd8a23effb73b41a69cf6667c935db24e992cd2"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/why-bill-gates-is-not-the-richest-person-in-the-world.html", "ord_in_thread": 0, "title": "Why Bill Gates is no longer the richest person in the world", "locations": [], "entities": {"persons": [{"name": "bill gates", "sentiment": "negative"}, {"name": "jeff bezos", "sentiment": "negative"}, {"name": "bezos", "sentiment": "none"}, {"name": "gates", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "npr", "sentiment": "none"}, {"name": "bill & melinda gates foundation", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hour Ago | 01:02 SHARES \nAmazon founder Jeff Bezos is now worth $105.1 billion, making him the richest person in recent history. Bezos's wealth surpassed Microsoft co-founder Bill Gates's previous record from 1999. \nBezos first overtook Gates as the richest man the world in October, when his net worth reached $93.8 million. \nA 31-year-old Gates became the youngest billionaire in the world in 1987, shortly after Microsoft went public. In 1995, at age 39, he was the richest man in the world with a fortune of $12.9 billion, NPR reports , and held the title on and off for decades. \nBut there's a simple reason Gates is no longer the richest person alive, and it's not because of Amazon's tremendous growth. Gates made the choice to give much of his money away. Chesnot | Getty Images \nIn 2000, the same year he stepped down as CEO of Microsoft, Gates co-founded the Bill & Melinda Gates Foundation alongside his wife with the mission of improving the quality of life of people around the world. The couple pivoted to focus on philanthropy full time and have since donated $2.9 billion in cash and 700 million Microsoft shares to charitable causes, Bloomberg reports . \nThe pair plan give away the majority of their wealth throughout their lifetimes and are doing so by thoughtfully tackling major issues around the world. \nGates isn't just giving away his own fortune, either; he's inspiring others to do the same. In 2010, the Gateses teamed up with billionaire friend Warren Buffett to start The Giving Pledge, a movement for ultra-rich individuals to commit to donating at least half of their wealth to charitable causes during their lifetime. \nMore than 150 millionaires and billionaires have signed the pledge, including titans like Mark Zuckerberg, Richard Branson and Elon Musk. show chapters 10:21 AM ET Mon, 30 Oct 2017 | 01:16 \n\"We have committed the vast majority of our assets to the Bill & Melinda Gates Foundation to help stop preventable deaths such as these, and to tear down other barriers to health and education that prevent people from making the very most of their lives,\" Gates wrote in his Giving Pledge letter . \"Our animating principle is that all lives have equal value.\" \nThe Foundation has already taken on a wide range of issues and projects, starting in 2000 with a $1 billion effort to send more than 20,000 kids to college . More recently, Bill and Melinda have committed millions to fighting Alzheimer's , providing resources to women in developing countries and promoting global health initiatives around the world , in addition to a variety of other causes . \nOne of the Foundation's proudest accomplishments is the work it has done to eradicate polio. It has contributed nearly $3 billion to help eliminate the disease by 2020 and Gates believes the last outbreak could be on the horizon. show chapters 4:42 PM ET Mon, 7 Aug 2017 | 00:54 \n\"Progress in fighting polio might be one of the world's best-kept secrets in global health,\" he acknowledged in the foundation's 2017 annual letter. But soon, he hopes, it will be a secret no more . \"If things stay stable in the conflicted areas, humanity will see its last case of polio this year.\" \nSince 2007, the Gates Foundation has contributed technical and financial resources to accelerate vaccination campaigns, provide routine immunization and polio surveillance partnerships as well as to help fund more effective vaccines. \nAnd the numbers show that its efforts have made a difference. In 1998, the polio virus was present in over 125 countries and paralyzed 350,000 people every year, mostly children. Since then, polio cases have been reduced by 99 percent, saving 13 million young children from paralysis. Today, there are only twelve known cases of the wild polio virus, according to Jay Wenger, who leads the Gates Foundation polio eradication efforts. Leigh Vogel | Getty Images Bill and Melinda Gates are presented with the 2016 Presidential Medal Of Freedom by President Obama at White House on November 22, 2016 in Washington, DC. \nHad Gates held onto the assets he's given to the foundation, he'd be worth an estimated $150 billion today, according to Bloomberg, which would give him the record. \nHe'd rather put that money to good use. \n\"We have been blessed with good fortune beyond our wildest expectations, and we are profoundly grateful,\" the Gateses wrote in their Giving Pledge letter. \"But just as these gifts are great, so we feel a great responsibility to use them well.\" \nBezos hasn't yet made a \"a major philanthropic mark,\" as Bloomberg puts it , but some predict that's in the cards for the billionaire. In June, Bezos put out a request for ideas on Twitter, where he said he was \"thinking about a philanthropy strategy.\" He followed up to say there's more to come, but he hasn't revealed what that will be. \nAlthough Bezos hasn't taken a deep dive into charitable giving just yet, he and his wife MacKenzie have made several sizable donations. He's partnered with Mary's Place , a local organization in Seattle to provide shelter for the homeless and gave $1 million of his personal funds. ", "external_links": [], "published": "2018-01-10T19:59:00.000+02:00", "crawled": "2018-01-10T20:27:48.013+02:00", "highlightTitle": ""}