{"organizations": [], "uuid": "58bca8e16328640cc31bb975f00c7864160e47fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "BlackRock’s Larry Fink Calls Cryptocurrencies ‘An Index of Money Laundering’ – Fortune", "url": "http://fortune.com/2018/01/25/blackrock-larry-fink-cryptocurrency-money-laundering/", "country": "US", "domain_rank": 1196, "title": "BlackRock’s Larry Fink Calls Cryptocurrencies ‘An Index of Money Laundering’", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T15:23:00.000+02:00", "replies_count": 0, "uuid": "58bca8e16328640cc31bb975f00c7864160e47fb"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/25/blackrock-larry-fink-cryptocurrency-money-laundering/", "ord_in_thread": 0, "title": "BlackRock’s Larry Fink Calls Cryptocurrencies ‘An Index of Money Laundering’", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "larry fink", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "index of money laundering", "sentiment": "negative"}, {"name": "blackrock", "sentiment": "negative"}, {"name": "crypto hq", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This year, cryptocurrencies like Bitcoin are having their biggest Davos moment yet, as references to the cryptocurrency and its peers pop up on panel discussions, in comments by world leaders, and along the Swiss town’s famous promenade, where storefronts transform into flashy corporate ads for one week every January. ( Crypto HQ , anyone?)\nThere is no doubt that cryptocurrencies, which have experienced dramatic fluctuations in recent weeks, are on the minds of heads of states and corporate executives who attend the World Economic Forum’s annual meeting.\nBlackRock chairman and CEO Larry Fink made that clear as he issued an especially bold statement on the assets during a panel about the future of global finance on Thursday.\nWhen asked if he’s ready to start investing in cryptocurrencies, he called them, “more of an index of money laundering than anything more than that.”\nAt the same time, he acknowledged that “it is a real technology.”\n“It’s going to transform how we do our business,” he said. “We should not turn our backs to it; we should embrace it and work toward a global solution because if we don’t work toward a global solution it will create systemic risk.”\nHis comments piggybacked on remarks by U.S. Treasury Secretary Steve Mnuchin , who said the United States is most concerned with keeping the assets from being used for illicit activities.\n“[I]n the United States, our regulation [says that] if you’re a Bitcoin wallet, you’re subject to the same regulation as a bank,” he said. “We want to make sure that the rest of the world…has the same regulations. We encourage fintech, we encourage innovation, but we want to make sure that all of our financial markets are safe.”\nInternational Monetary Fund managing director Christine Lagarde echoed Mnuchin’s remarks, decrying as “just unacceptable” cryptocurrency’s “anonymity, lack of transparency and the way it in which it conceals and protects money laundering, financing of terrorism, and also some dark trades.”\n“We have already started monitoring, analyzing, surveying risk associated with the development of cryptocurrencies [as well as] the potential benefits of it,” she said.\nPaul Achleitner, chairman of the supervisory board at Deutsche Bank, made a point to distinguish between Bitcoin and the blockchain technology underpinning it.\n“[We must] invest in the technology, which has a lot of potential for the remaking of finance and focus on that as opposed to short-term hype: ‘Are you investing in x? Are you investing in y?”\nHis stagemate, Fink, nodded in agreement.", "external_links": [], "published": "2018-01-25T15:23:00.000+02:00", "crawled": "2018-01-25T15:23:44.017+02:00", "highlightTitle": ""}