{"organizations": [], "uuid": "da8789c69af4e5d3330f57b01669c077950bc116", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 38, "shares": 38, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/13/104896043-RTX3QIVF.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/03/2-democrats-to-be-sworn-in-as-senators-narrowing-the-gops-majority-in-congress.html", "country": "US", "domain_rank": 767, "title": "2 Democrats to be sworn in as senators, narrowing the GOP's majority in Congress", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T13:51:00.000+02:00", "replies_count": 0, "uuid": "da8789c69af4e5d3330f57b01669c077950bc116"}, "author": "", "url": "https://www.cnbc.com/2018/01/03/2-democrats-to-be-sworn-in-as-senators-narrowing-the-gops-majority-in-congress.html", "ord_in_thread": 0, "title": "2 Democrats to be sworn in as senators, narrowing the GOP's majority in Congress", "locations": [], "entities": {"persons": [{"name": "tina smith", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "al franken", "sentiment": "none"}, {"name": "doug jones", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "mins ago shares marvin gentry | reuters democratic alabama u.s. senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two new Democrats will be sworn in to the Senate on Wednesday, narrowing the Republican majority and complicating efforts by Majority Leader Mitch McConnell to advance the White House's legislative agenda before the November midterm elections.\nDoug Jones, the first Alabama Democrat elected to the Senate in a quarter century, is one of two new members who will take the oath of office on the Senate floor at noon. The other is Minnesota Lt. Gov. Tina Smith, who was appointed to replace Al Franken following the Democrat's resignation over accusations of sexual misconduct. Smith also plans to compete in the special election taking place in November to complete the final two years of Franken's term.\nThey will narrow the Republican majority to 51-49.\nJones, 63, who will represent one of the most conservative states in the nation, is stressing his desire to work with both parties. He will be under pressure to find some areas of agreement with Republicans and has cited the funding of infrastructure improvements as one possible avenue.\n\"I will be an independent voice and work to find common ground with my colleagues on both sides of the aisle to get Washington back on track and fight to make our country a better place for all,\" Jones said after defeating Republican Roy Moore in a special election rocked by allegations of sexual misconduct against Moore. Jones will take the seat once held by Attorney General Jeff Sessions .\nBefore the Senate seat belonged to Sessions, it belonged to the man Jones considered his mentor, the late Sen. Howell Heflin. Jones worked for Heflin as a staffer after graduating from law school in 1979. Heflin was the last Democrat to represent Alabama in the U.S. Senate.\nJones said for that reason, Wednesday will feel something like a homecoming, bringing his career full circle. During the swearing-in, Jones will be wearing a pair of Heflin's cufflinks. Jones plans to place one of Heflin's cigar boxes in his office.\n\"To be able to have done the things I've done and end up back here is just a remarkable thing,\" Jones said. \"I am looking forward to getting my feet wet and getting to know my colleagues and jumping into the action.\"\nJones said he is hopeful that he comes to the Senate with a \"little bit of a voice\" because of the attention on the Alabama race.\n\"There are a lot of people who didn't vote for me, and I hope they will keep an open mind because I am going to try to be the best senator I can for the state to try to move the state forward as a whole and not just one particular group or philosophy,\" he said.\nJones made it clear during the campaign that he was opposed to the GOP's efforts to repeal President Barack Obama's signature health care overhaul, the Affordable Care Act. He said the efforts would drive up costs and lead to the closure of more rural health care facilities in the state. \"That is a nonstarter,\" Jones said.\nLast month, McConnell signaled that he would likely give up on Obamacare repeal, for now, as the GOP majority was set to narrow.\n\"Well, we obviously were unable to completely repeal and replace with a 52-48 Senate,\" he said. \"We'll have to take a look at what that looks like with a 51-49 Senate. But I think we'll probably move on to other issues.\"\nSmith, 59, served as chief of staff to Minnesota Gov. Mark Dayton before becoming his No. 2 when the previous lieutenant governor declined to seek a second term.\nSmith is known largely as a liberal Democrat who has maintained connections to the state's large and politically powerful business community.\nOnce the senators take the oath of office, they reprise the event at a ceremony with family and friends in the Old Senate Chamber, once the home to the U.S. Senate and later to the U.S. Supreme Court from 1860 to 1935.\nFormer Vice President Walter Mondale is expected to join Smith at the ceremony.\nJones said former Vice President Joe Biden , who headlined Jones' campaign kickoff rally, and former Attorney General Eric Holder are expected to be among his guests Wednesday.", "external_links": [], "published": "2018-01-03T13:51:00.000+02:00", "crawled": "2018-01-03T14:03:35.004+02:00", "highlightTitle": ""}