{"organizations": [], "uuid": "2176498c3c59d8cc070c9f697f2ea1441453b72e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/11/102172540-468309321.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/16/banks-raise-oil-price-targets-on-strong-demand-and-opec-output-cuts.html", "country": "US", "domain_rank": 767, "title": "Big banks raise oil price targets on strong demand and OPEC output cuts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-16T21:16:00.000+02:00", "replies_count": 0, "uuid": "2176498c3c59d8cc070c9f697f2ea1441453b72e"}, "author": "", "url": "https://www.cnbc.com/2018/01/16/banks-raise-oil-price-targets-on-strong-demand-and-opec-output-cuts.html", "ord_in_thread": 0, "title": "Big banks raise oil price targets on strong demand and OPEC output cuts", "locations": [], "entities": {"persons": [{"name": "andrey rudakov", "sentiment": "negative"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "merrill lynch", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "u.s. west texas intermediate", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Big investment banks are raising their price targets for oil — or warning they may soon need to — as crude futures hit levels not seen since the early days of a slump in December 2014.\nBank of America Merrill Lynch and Morgan Stanley both upped their forecasts for crude prices this week, while Goldman Sachs said the risks of prices overshooting its current targets are mounting.\nBrent crude , the international benchmark for oil prices, rose to $70.37 on Monday, while U.S. West Texas Intermediate crude reached $64.89 on Tuesday, both hitting more than three-year highs.\nThe banks says the long-oversupplied oil market is tightening up more quickly than expected as global economic growth fuels demand and output cuts by OPEC , Russia and several other producers eat into the world's crude stockpiles. The 14-member OPEC cartel has also boasted better adherence to output limits than in the past, according to analysts.\nOn Tuesday, Merrill Lynch analysts said they now expect the oil market to be undersupplied by about 430,000 barrels a day in 2018, up from their prior forecast for a 100,000-barrel-per-day deficit.\nThe bank now sees Brent averaging $64 a barrel in 2018, versus an earlier estimate for $56 a barrel. Merrill also raised its outlook for U.S. crude to $60 a barrel from $52.\nshow chapters Crude prices sit near 3-year highs 9 Hours Ago | 03:26 \"In short, inventories are coming down faster than we expected and OPEC is succeeding at rebalancing the oil market,\" wrote Francisco Blanch, head of global commodities and derivatives research at Bank of America Merrill Lynch.\nGoldman Sachs is not ready to raise its $62 target on Brent and $57.50 forecast for U.S. crude in 2018, but says there's a growing risk that global inventories will fall too quickly and push up prices.\nU.S. drillers are likely to start pumping more oil after a sharp rally in prices since December, Goldman analysts say. But the bank believes there will be a lag in the price response, which could allow prices to keep running up.\nMeanwhile, global oil stockpiles in developed countries could actually fall below the five-year average — the level OPEC is targeting — as inventories approach normal levels, oil demand potentially outstrips Goldman's estimate and OPEC possibly cuts output too deeply.\n\"First, the lagged reporting of inventory data and OPEC's own inertia create risks that the group exits the cuts well after inventories have normalized,\" wrote a team led by Jeffrey Currie, Goldman's global head of commodities research. \"Second, we continue to believe that OPEC's 5-year average inventory target is too aggressive.\"\nOPEC, Russia and other producers have agreed to keep 1.8 million barrels a day off the market through the end of the year. Several oil ministers have said it's too early to discuss an exit strategy for the deal.\nCurrie and his colleagues also say that \"oil inventories should be adjusted for demand levels to correct for a steadily growing oil market.\"\nshow chapters Energy off to a strong start in 2018 5 Hours Ago | 01:14 Morgan Stanley equity analyst Martijn Rats said Monday that strong capital flows into the oil market will occasionally push Brent prices into the $70-$75 range. For the third quarter of 2018, he raised his price target on Brent to $75 a barrel, up from $63 a barrel.\nThe bank believes the oil market is likely to remain undersupplied in 2018, which should keep prices in backwardation. This means that current oil prices are higher than prices for crude deliveries in the future.\nBackwardation encourages traders to buy oil futures because it gives them a chance to play the so-called roll yield, said Rats. The roll yield is the profit traders can earn when they roll their investment in crude oil futures, which expire every month, into contracts that expire at a later date.\n\"If this persists for an extended period, we expect it will continue to attract inflows into the futures market. As these flows can be much larger than physical flows, this should drive oil futures prices higher during the course of this year,\" Rats wrote on Monday.\nHowever, Merrill Lynch's Blanch notes that traders have placed a record number of bets that Brent and U.S. crude prices will keep rising. Those traders could start selling those positions if worldwide oil demand disappoints, OPEC members start cheating or U.S. output rises too sharply. All of those outcomes would put pressure on oil prices.", "external_links": [], "published": "2018-01-16T21:16:00.000+02:00", "crawled": "2018-01-16T21:22:25.000+02:00", "highlightTitle": ""}