{"organizations": [], "uuid": "a856708e4f9b1607946c8ed5739df890d77a44f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 34, "shares": 34, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/10/104211032-GettyImages-138718849.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001135/device/rss/rss.html", "section_title": "Stock Picks", "url": "https://www.cnbc.com/2018/01/10/cramer-makes-the-bull-case-for-chinas-move-to-cut-us-debt-purchases.html", "country": "US", "domain_rank": 767, "title": "Cramer makes the bull case for China's move to cut US debt purchases", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-11T01:12:00.000+02:00", "replies_count": 0, "uuid": "a856708e4f9b1607946c8ed5739df890d77a44f2"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/cramer-makes-the-bull-case-for-chinas-move-to-cut-us-debt-purchases.html", "ord_in_thread": 0, "title": "Cramer makes the bull case for China's move to cut US debt purchases", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As stocks fell on Wednesday on a report that China is considering slowing down or even stopping its purchases of U.S. sovereign debt, CNBC's Jim Cramer gave the bears a warning.\n\"Logically, you can't be worried about one thing and then suddenly freak out when the opposite happens. It's totally lacking in rigor, but it happens all the time around here, and that's what threw us off today,\" the \" Mad Money \" host said.\nCramer was referencing a high-profile narrative: scores of market commentators have been worried about a flattening yield curve , which many see as a precursor to recession.\nWithout a meaningful inflection in the yield curve, short-term Treasury returns almost equal the returns for long-term Treasurys. Paired with a too-abrupt rise in interest rates, that could curb demand for loans, putting a damper on the broader economy.\n\"But here's the thing: if China comes into the market and starts dumping longer-term Treasurys, we won't have a flat yield curve anymore,\" Cramer said. \"Long-term rates will go higher, and bears lose their big thesis propping up the idea that a recession's right around the corner.\"\nThat was Cramer's main problem: how could the bears be worried that long-term rates are far too low, but panic when the Chinese float the possibility of making our long-term rates go up?\n\"Can both sides really be bearish — heads I win, tails you lose? You know that's insane,\" the \"Mad Money\" host said.\n\"Let me make one thing crystal-clear: this is not a be-careful-what-you-wish-for story. We want rates higher, period. The pace of loan growth in this country is slowing, something I'm sure we're going to hear about when the big banks start reporting ,\" he continued. \"Higher long-term rates will make banks eager to lend, so [the] more bonds the Chinese dump, the better.\"\nInflation is at the center of this debate, Cramer said. Some market-watchers remain worried that there isn't enough inflation in the economy, which can translate into lower wage growth, less consumer spending and obstacles to the Federal Reserve's rate-hike agenda .\n\"You can't have it both ways. You can't say, 'Boohoo, there's no inflation, let's sell stocks,' and then say, 'Boohoo, there's inflation, let's sell stocks.' It is either, people, one way or the other,\" Cramer said.\nPeople who say both usually have skin in the game, he added. Money managers who need to outperform the broader averages are incentivized to say what they can to send the market lower.\nBut homegamers should take Wall Street worries with a grain of salt, the \"Mad Money\" host advised.\n\"The bottom line? Don't be careful what you wish for. When good things happen, embrace them,\" Cramer said. \"There's a cohort of money managers out there who need stocks to go lower and they will say anything to make you feel afraid. They are the anti-Goldilocks crowd; nothing is ever right for these people. It's always too high or too low and definitely pointing to some looming catastrophe. These bears would be great in a horror movie — just please don't take their financial advice all that seriously.\"\nWATCH: Cramer calls out market disparity show chapters Cramer makes the bull case for China's move to cut US debt purchases      18 Hours Ago | 12:46 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-11T01:12:00.000+02:00", "crawled": "2018-01-11T01:51:11.029+02:00", "highlightTitle": ""}