{"organizations": [], "uuid": "db5d2ef8b488f37abdd298e97516120fc56d1985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Panera Wants the FDA to Clear up the Confusion over What Constitutes an Egg – Fortune", "url": "http://fortune.com/2018/01/19/panera-breakfast-sandwich-egg-fda/", "country": "US", "domain_rank": 1196, "title": "Panera Wants the FDA to Clear up the Confusion over What Constitutes an Egg", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-19T07:01:00.000+02:00", "replies_count": 0, "uuid": "db5d2ef8b488f37abdd298e97516120fc56d1985"}, "author": "Beth Kowitt", "url": "http://fortune.com/2018/01/19/panera-breakfast-sandwich-egg-fda/", "ord_in_thread": 0, "title": "Panera Wants the FDA to Clear up the Confusion over What Constitutes an Egg", "locations": [], "entities": {"persons": [{"name": "sara burnett", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. Food and Drug Administration has detailed legal definitions for everything from milk and mayonnaise to macaroni and mozzarella. It's got one for peas of both the frozen and canned varieties. There's ones for egg whites, liquid eggs, and frozen egg yolks, too.\nBut one that's missing? Plain old eggs.\nIn fact, the FDA oddly states that \"no regulation shall be promulgated fixing and establishing a reasonable definition and standard of identity for the food commonly known as eggs.\" The loose translation: The legal definition of an egg requires that there be no legal definition at all.\n\"We have no idea why,\" says Sara Burnett, the director of wellness and food policy for Panera.\nNow the restaurant chain wants to change that. The company said that on Thursday night it submitted a petition to the FDA asking that the regulator define eggs to \"reflect a food made from a cracked shell egg without addition of additives or further processing.” The one exception it wants to make is for “pasteurization or other treatment to destroy all viable Salmonella microorganisms from the shell egg.\"\nThe petition comes as Panera, which last year was acquired by investment fund JAB Holdings , starts marketing its new breakfast sandwich--made, of course, from \"100% real eggs\" under the definition it’s hoping the FDA will codify.\nBurnett says that as the company developed its new breakfast sandwich, it discovered that not only does the FDA not have a true definition of the ingredient but that its competitors are \"using the term very loosely.\"\nThe \"puffed scrambled egg patty\" in Starbucks’ sausage, cheddar, and egg breakfast sandwich , for example, contains whole eggs, whey, skim milk, soybean oil, modified food starch, and less than 2% of the following: dicalcium phosphate, salt, sodium bicarbonate, butter flavor (sunflower oil, natural flavors, medium chain triglycerides and palm kernel oil), xanthan gum, guar gum, liquid pepper extract, citric acid.\nOver at Dunkin’ Donuts, the egg patty on its bacon, egg, and cheese sandwich is made of egg whites, egg yolks, soybean oil, water, and 2% or less of: corn starch, salt, natural flavor, xanthan gum, cellulose gum, and citric acid.\n\"When you ask for egg, you should get an egg,\" says Panera CEO Blaine Hurst, who took on the top job at the start of the year.\nPanera is now cooking the eggs in its breakfast sandwich over-easy, meaning that they’re cooked on both sides but the yolks remain runny. Panera says it’s the only chain of its size that it’s aware of that serves a runny yolk. To prevent food safety issues, the eggs are heated to right below cooking temperature while they’re still in their shells to pasteurize them.\nThis is just the latest dust-up in the food world over standards of identity. “Many of the definitions are very outdated and haven’t kept up with food technology and production,” Burnett says.\nStartup Hampton Creek ran into issues with the FDA because its vegan Just Mayo product didn’t contain eggs--an ingredient required under the product’s legal definition. And largely in response to the explosion of plant-based milk alternatives, Sen. Tammy Baldwin introduced the Dairy Pride Act last year to compel the FDA to enforce the legal definition of milk as \"lacteal secretion\" obtained by the \"milking of one or more healthy cows.\"", "external_links": [], "published": "2018-01-19T07:01:00.000+02:00", "crawled": "2018-01-19T07:01:25.007+02:00", "highlightTitle": ""}