{"organizations": [], "uuid": "8155651eac98b77fbdd5815fae6a13542035a326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 73, "shares": 73, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/17/104349481-RTR2HHBB.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/new-flight-routes-increase-fears-of-chinese-invasion-in-taiwan.html", "country": "US", "domain_rank": 767, "title": "Chinese flight routes set off military alarms in Taiwan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T08:35:00.000+02:00", "replies_count": 0, "uuid": "8155651eac98b77fbdd5815fae6a13542035a326"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/new-flight-routes-increase-fears-of-chinese-invasion-in-taiwan.html", "ord_in_thread": 0, "title": "Chinese flight routes set off military alarms in Taiwan", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "tsai", "sentiment": "none"}, {"name": "tsai ing-wen", "sentiment": "none"}, {"name": "ashley pon", "sentiment": "none"}], "locations": [{"name": "taiwan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "bejing", "sentiment": "none"}, {"name": "taiwan strait", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In self-ruled Taiwan , fears of a military invasion from the world's second-largest economy are growing.\nFollowing Beijing's increased military drills near the East Asian island, which China considers as part of its own, Taiwanese President Tsai Ing-wen said in a televised broadcast last week that she did not exclude the possibility of a full-blown attack.\nAshley Pon | Getty Images Taiwan President Tsai Ing-wen waves to the supporters at the celebration of the 14th presidential inauguration on May 20, 2016 in Taipei, Taiwan. A recent decision by Bejing to launch new civilian flights over the Taiwan Strait has contributed to those concerns.\nEarly this month, Chinese President Xi Jinping's administration opened four new routes without official approval from Tsai, who called the move \"destabilizing.\" Back in 2015, the two countries agreed that Beijing would consult Taipei before commencing new flights in the area.\nThe new routes, which are expected to cross paths with Taiwanese flights, could carry major defense implications for Taipei.\n\"By opening this new corridor, the Chinese will likely be able to fly surveillance and reconnaissance operations closer to Taiwan on a regular basis, better monitoring communications and other electronic emissions,\" Dean Cheng, senior research fellow at the Asian Studies Center at think tank The Heritage Foundation, wrote in a recent note. \"Such missions will allow the Chinese to pinpoint radars and associated air defense missile batteries more effectively.\"\nThose activities could hurt Taiwan's ability to monitor its air and sea space, which would be an \"essential\" step in any Chinese military action against the island, Cheng continued.\nTaiwan's Mainland Affairs Council, a cabinet-level agency responsible for bilateral affairs, has expressed similar fears. In an official statement, it said Beijing was \"purposefully using civil aviation as a cover for improper intentions regarding Taiwan politics and even military affairs.\"\nshow chapters Chinese media warns the US of 'retaliations' from 'all sides' after new Taiwan bills passed 2:20 PM ET Thu, 11 Jan 2018 | 00:59 A clear majority of Taiwanese — 67.5 percent — said they believed the new Chinese flights posed a threat to national security, local media reported, citing a recent survey from the Cross-Strait Policy Association.\nThe communist nation has said the additional routes will help ease flight delays in an already congested flight area, but analysts warn of a greater agenda at play.\nIt's \"all a part of China's strategy — ratchet up pressure on Taiwan in both large and small ways — especially while the world is focused on the crisis on the Korean Peninsula,\" said Thomas Shattuck, research associate at the Foreign Policy Research Institute, who added that the incident revealed the poor state of cross-Strait relations.\nThe threat of Chinese invasion — a remote possibility for now, according to Shattuck — has been widely discussed as of late. Last month, Chinese diplomat Li Kexin reportedly said that he had told U.S. officials that his country would use force on Taiwan if the U.S. sent navy ships to the island.\nTsai, who Beijing believes is pushing for Taiwanese independence, has made her stance known to the International Civil Aviation Organization — a United Nations organization — but her complaints may not produce any results.\n\"Unfortunately, since Taiwan is not a member of the U.N., it is also not a member ICAO and cannot broach the topic directly ... it is unlikely that ICAO will work in favor of Taiwan,\" said Shattuck. Instead, he said President Donald Trump's team \"should be more forceful in its rebuke of China's unilateral action.\"\nThe U.S. House Foreign Affairs Committee recently passed two bills aimed at bolstering the U.S.-Taiwan partnership .", "external_links": [], "published": "2018-01-29T08:35:00.000+02:00", "crawled": "2018-01-29T09:09:37.015+02:00", "highlightTitle": ""}