{"organizations": [], "uuid": "dc9f1877ad6fc11576768fcc6f0e329b90995a91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 30, "shares": 30, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219035280&w=1200&r=LYNXMPEE020KW", "site_section": "http://feeds.reuters.com/reuters/technologyNews?format=xml", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-amazon-alphabet-speakers/amazon-google-cut-speaker-prices-in-market-share-contest-analysts-idUSKBN1ES0VV", "country": "US", "domain_rank": 408, "title": "Amazon, Google cut speaker prices in market share contest: analysts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-03T14:05:00.000+02:00", "replies_count": 0, "uuid": "dc9f1877ad6fc11576768fcc6f0e329b90995a91"}, "author": "", "url": "https://www.reuters.com/article/us-amazon-alphabet-speakers/amazon-google-cut-speaker-prices-in-market-share-contest-analysts-idUSKBN1ES0VV", "ord_in_thread": 0, "title": "Amazon, Google cut speaker prices in market share contest: analysts", "locations": [], "entities": {"persons": [{"name": "paresh dave", "sentiment": "none"}, {"name": "stephen nellis", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "google home mini", "sentiment": "none"}, {"name": "min read  san francisco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:04 PM / Updated 4 hours ago Amazon, Google cut speaker prices in market share contest: analysts Stephen Nellis , Paresh Dave 4 Min Read \nSAN FRANCISCO (Reuters) - Amazon.com Inc ( AMZN.O ) and Alphabet Inc’s ( GOOGL.O ) Google both discounted their virtual assistant speakers so deeply over the holiday shopping season that they likely lost a few dollars per unit, highlighting a sharply different strategy from Apple Inc ( AAPL.O ) as it prepares its HomePod speaker, analysts said. \nBoth companies cut prices for the smallest version of their speakers, the Amazon Echo Dot and Google Home Mini, to as little as $29 from $50 for the U.S. holidays. Midlevel versions cost a bit more than twice as much. \nApple failed to ship its $349 HomePod speaker in 2017, as it initially planned, and said the device would go on sale in early 2018. \nApple aims to make a profit on the device itself and bolster sales of its $9.99 per month Apple Music subscription, analysts said. Apple’s voice assistant Siri likely will focus on recommending new songs. \nAmazon and Google, meanwhile, are eager to give consumers a taste of their respective digital assistants, Alexa and Google Assistant, at impulse-buy prices, hoping to lock in customers and profit from later sales of goods and data about buying habits. \nThe Home Mini and Echo Dot do not match the sound quality of the HomePod, but consumers may see less need for a superior, pricier speaker from Apple once they have a rival set up. Even the midlevel Amazon and Google devices were discounted to $79 over the holidays. \n“That kind of pricing is great for consumers and bad for Apple,” said Paul Erickson, a senior analyst with IHS Markit. Slideshow (2 Images) \nSome consumers might consider a $30 speaker to be cheap enough to throw away and not a barrier to buying the Apple device when it arrives. \nAmazon declined to comment on Echo devices but said in a press release it sold millions of its Echo Dot speakers during the holiday season, making it the best-selling product over the period on its online store. \nGoogle did not disclose sales numbers for the Home Mini, but Google Home spokeswoman Nicol Addison said the company was very happy with holiday performance. Google gave away the devices to buyers of its new Pixel 2 smartphones and offered them for $29 at Wal-Mart, Target and Best Buy. \nAmazon dominates the emerging market for smart speakers outside of China, with Google closest behind. Sales of the devices are not yet substantial enough to affect the financial results of either company. \nBoth companies took small losses or broke even on sales of the hockey puck-shaped devices, analysts estimated. \nThe Echo Dot has about $31 worth of parts, according to analysis by ABI Research. Components in the Google Home Mini cost about $26. The figures do not include overhead, shipping and other expenses, meaning discounted versions likely sold at a loss. \n“Apple is in a bit of trouble,” said Adam Wright, senior research analyst at IDC, who estimated that about 35 million smart speakers had been installed worldwide as of a couple of weeks ago - not including U.S. Christmas sales. “We’ve witnessed an explosion in the last six months.” \n(This version of the story has been refiled to delete extra “said” in paragraph nine) Reporting by Paresh Dave and Stephen Nellis; editing by Peter Henderson and Grant McCool", "external_links": [], "published": "2018-01-03T14:05:00.000+02:00", "crawled": "2018-01-03T14:16:12.014+02:00", "highlightTitle": ""}