{"organizations": [], "uuid": "54375771bb281274e5211e4f58fa7b87c9e39f73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104935735-GettyImages-902826468.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/after-hours-buzz-intc-sbux-more.html", "country": "US", "domain_rank": 767, "title": "After-hours buzz: INTC, SBUX, ETFC & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T22:26:00.000+02:00", "replies_count": 0, "uuid": "54375771bb281274e5211e4f58fa7b87c9e39f73"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/after-hours-buzz-intc-sbux-more.html", "ord_in_thread": 0, "title": "After-hours buzz: INTC, SBUX, ETFC & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check out the companies making headlines after the bell Thursday : \nIntel stock surged 3.5 percent in extended trading. The chipmaker outperformed analyst expectations on top and bottom lines , reporting earnings per share of $1.08 on $17.05 billion in revenue. The street projected EPS of $0.86 on $16.34 billion in revenue.\nThe company has faced pressure around its handling of recent security vulnerabilities , but that did not seem to impact investor confidence.\nShares of Starbucks fell 3.2 percent after the bell. The coffee giant announced mixed first quarter financial results. Starbucks reported earnings per share (EPS) of 58 cents, beating street expectations by one cent, on revenue of $6.07 billion. Analysts expected revenue of $6.18 billion.\nThe coffee giant also missed expectations on same store sales, amid efforts to roll-out premiere offerings both internationally and domestically. \nWestern Digital 's stock plunged 4.08 percent in the extended session, despite the disk drive company beating analyst expectations on its second quarter financial results. Western Digital reported $3.95 earnings per share on $5.34 billion versus the $3.79 EPS on $5.30 billion projected. \nThursday's report was the first since the company ended a lengthy legal battle with Tokyo-based Toshiba. \nShares of E-Trade dropped about 2.2 percent after the bell, despite that the financial services company beat Wall Street expectations on top and bottom lines, reporting earnings of 64 cents on $637 million in revenue.\nThe company also announced it would acquire assets from Capital One, including 1 million retail brokerage accounts and $18 billion in customer assets, for a purchase price of $170 million. E-Trade said the deal would have little effect on 2018 earnings.\nIntuitive Surgical shares lost more than 4 percent in after hours trading, after the medical robot production company reported fourth quarter financial results. A $318 million tax-reform related expense impacted earnings, Thomson Reuters reported.\nIntuitive has also ramped up surgical robot production, resulting in a 16.6 percent year-over-year increase in operating expenses, according to Reuters.", "external_links": [], "published": "2018-01-25T22:26:00.000+02:00", "crawled": "2018-01-26T00:12:28.000+02:00", "highlightTitle": ""}