{"organizations": [], "uuid": "968cf671442b2bbc8872e17ba52e178fbdbe614b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/08/103853654-RTX23G5V.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml#", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/18/its-a-buy-the-dip-story-in-the-oil-markets-says-rbcs-helima-croft.html", "country": "US", "domain_rank": 767, "title": "It's a buy-the-dip story in the oil markets, says RBC's Helima Croft", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "968cf671442b2bbc8872e17ba52e178fbdbe614b"}, "author": "", "url": "https://www.cnbc.com/2018/01/18/its-a-buy-the-dip-story-in-the-oil-markets-says-rbcs-helima-croft.html", "ord_in_thread": 0, "title": "It's a buy-the-dip story in the oil markets, says RBC's Helima Croft", "locations": [], "entities": {"persons": [{"name": "helima croft", "sentiment": "none"}, {"name": "croft", "sentiment": "none"}], "locations": [{"name": "mideast", "sentiment": "none"}], "organizations": [{"name": "rbc", "sentiment": "negative"}, {"name": "helima croft oil", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil's run to multiyear highs may soon run out of fuel.\nBut that bearish turn will likely be short-lived, according to RBC Capital Markets' Helima Croft.\nEven though the oil markets are entering a period of seasonal softness, she sees geopolitical trends supporting pricier oil.\nCroft, RBC's head of commodity strategy, says the floor has risen to the mid-to-high $50 a barrel price range.\n\"We're constructive on oil,\" she said Wednesday on CNBC's \" Trading Nation .\" \"I f we do move lower, we think that's a buying opportunity.\"\nIn April, Croft predicted on CNBC that oil would surge nearly 20 percent — trading in the low $60s a barrel within months. That's exactly what happened about nine months later.\nJust last week, WTI crude pushed above $65 a barrel for the first time since December 2014. It has now rallied nearly 40 percent in the last six months.\nBrent crude is also seeing a breakout to more than three-year highs — with the commodity hitting above $70 a barrel on Monday.\nCroft, who's confident that OPEC's 2018 production cut extension will stick, lists Mideast tensions as a bullish catalyst for oil prices.\n\"I've been amazed that we've had multiple ballistic missiles fired from Yemen into Saudi Arabia, and the market shrugs that off,\" she said. \"One of the big geopolitical stories for this year is to really watch what happens in Yemen. If one of those missiles hits a civilian target in Saudi Arabia, the entire region will be on a war footing.\"\nVenezuela is also high on Croft's watch list.\n\"They need more revenue. But they just don't have the barrels to do so. Their production is going in one direction, and that's down,\" she said. \"Same thing with Nigeria. They look pretty tapped out. In fact, you have reports out there that militant groups are threatening to take more production offline.\"\nAnd if any of those scenarios materialize, she said, it will create a tighter demand picture against a vibrant environment.\n\"We are still very conservative on the U.S. production especially in this price environment for this year. But again, it's against a backdrop or a very, very healthy demand picture,\" Croft said.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nshow chapters Top commodity strategist says the outlook for crude is constructive 20 Hours Ago | 04:49 Disclaimer", "external_links": [], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:34:34.055+02:00", "highlightTitle": ""}