{"organizations": [], "uuid": "64d893fb00300f818849c255d44450df1ed0777e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/10/103459756-GettyImages-153156007.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/salesforce-ceo-marc-benioff-says-regulate-facebook-like-tobacco.html", "country": "US", "domain_rank": 767, "title": "Facebook should be regulated like a cigarette company, says Salesforce CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T20:15:00.000+02:00", "replies_count": 0, "uuid": "64d893fb00300f818849c255d44450df1ed0777e"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/salesforce-ceo-marc-benioff-says-regulate-facebook-like-tobacco.html", "ord_in_thread": 0, "title": "Facebook should be regulated like a cigarette company, says Salesforce CEO", "locations": [], "entities": {"persons": [{"name": "sabina dimitriu", "sentiment": "negative"}, {"name": "benioff", "sentiment": "none"}, {"name": "marc benioff", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Election interference has opened the door for the government to clamp down on social media companies. But while executives from Facebook , Google and Twitter have made multiple trips to testify in front of Congress, there's been no clear movement towards enforcement.\nSalesforce CEO Marc Benioff offered up an analogy: Treat social media like a health issue, similar to tobacco and sugar.\n\"I think that you do it exactly the same way that you regulated the cigarette industry. Here's a product: Cigarettes. They're addictive, they're not good for you,\" Benioff told CNBC's \" Squawk Alley \" on Tuesday. \"I think that for sure, technology has addictive qualities that we have to address, and that product designers are working to make those products more addictive and we need to rein that back.\"\nBenioff said that there's confusion about whether social media use is bad for people and it's the government's job to step in and provide clarity for parents. There's a smoking age for cigarettes and regulations around how they can be promoted, but no such rules exist for social media.\nFacebook has already taken steps to avoid the same fate as the tobacco industry. CEO Mark Zuckerberg has resolved to fix the issues with Facebook this year and significantly refocused the customer experience away from divisive news.\nRegulators are questioning whether Russian ads — viewed by millions of social media users — influenced the U.S. presidential election in 2016.\n\"We're the same as any other industry,\" Benioff said. Like, \"financial services, consumer product goods, food — in technology, the government's going to have to be involved. There is some regulation but there probably will have to be more.\"\nshow chapters Salesforce CEO Marc Benioff: There will have to be more regulation on tech from the government 3 Hours Ago | 07:05 Benioff was interviewed in Davos, Switzerland , the site of the World Economic Forum, where he discussed issues in Silicon Valley around tech culture, inequality and discrimination.\n\"I don't think it's fundamentally broken,\" Benioff said of the industry's culture. He said there are \"two worlds,\" one with companies driven by purpose, \"and then you have CEOs that are only focused on the product.\"\nBenioff was heralded as a top CEO for his leadership role at Salesforce, according to a survey by Comparably last year. And the tone at the top has been of special focus in Silicon Valley this year, as allegations around racial and gender discrimination have made headlines.\nBenioff said that he's had almost 20 years to observe the changes in Silicon Valley and, from the beginning, Salesforce has committed resources to a foundation as a multipronged approach to improving the world.\nStill, Benioff said, the tone at Davos is lighter among business leaders than in the post-recession years, noting a \"huge amount of exuberance\" among CEOs around the recent tax overhaul.\n\"The economic freight train is going to continue,\" he said.", "external_links": [], "published": "2018-01-23T20:15:00.000+02:00", "crawled": "2018-01-23T20:28:05.011+02:00", "highlightTitle": ""}