{"organizations": [], "uuid": "5d8754ba5fd232a523ccb0072d1ef50811185c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/14/101672922-183666891r.1910x1000.jpg", "site_section": "http://search.cnbc.com/rs/search/all/view.rss?partnerId=2000&keywords=agriculture&sort=date&minimumrelevance=0.2&pubtime=30&pubfreq=d&categories=exclude", "section_title": "CNBC.com", "url": "https://www.cnbc.com/2018/01/08/trade-among-concerns-as-trump-prepares-address-to-afbf-ag-group.html", "country": "US", "domain_rank": 767, "title": "Trade, labor concerns hang over ag as Trump prepares to address top farm group", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T21:51:00.000+02:00", "replies_count": 0, "uuid": "5d8754ba5fd232a523ccb0072d1ef50811185c2a"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/trade-among-concerns-as-trump-prepares-address-to-afbf-ag-group.html", "ord_in_thread": 0, "title": "Trade, labor concerns hang over ag as Trump prepares to address top farm group", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "holtville", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "american farm bureau federation", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump will likely get a polite reception from farmers and agribusiness leaders when he addresses the American Farm Bureau Federation's convention Monday in Nashville, but there's still challenges and uncertainties facing the industry whether on trade, labor or the farm bill.\nFarmers want assurances that trade disputes such as NAFTA won't close markets that are a major source of revenue. They also want to be heard in the immigration debate since agriculture is struggling with a farm labor problem and relies on seasonal, foreign workers.\nAt the same time, farm incomes have come under pressure due to low prices for crops such as corn. And some fear federal budget cuts may impact the farm bill.\nDebate over the next farm bill is heating up and comes after Congress has held numerous hearings on the issue. Critics want to see cuts in subsidies and changes to crop insurance programs, and dairy and cotton farmers could see some of the biggest changes. The current farm bill is set to expire in September 2018.\nTrump is the first sitting president to address the U.S. farm group in 26 years, and he is scheduled to speak at 4 p.m. ET. The AFBF is the nation's largest agricultural group with around 1.5 million member families.\nMeantime, the sixth round of negotiations involving the North American Free Trade Agreement is set to begin Jan. 23 in Montreal. The U.S. has clashed with Canada on access to dairy and Mexico has been accused of abuses, such as \"dumping\" of certain specialty crops such as tomatoes.\nTrump has previously threatened to withdraw the United States from the 24-year-old trade pact with Canada and Mexico. But scrapping NAFTA without a replacement could be devastating to U.S. agriculture and end up costing American consumers more for their food, including Mexican-grown avocados used to make guacamole.\n\"The food chains of the three countries are very integrated, so without NAFTA it would have a massive displacement,\" said John Beghin, a professor of agricultural economics at North Carolina State University. \" Walmart or the other big retailers or food processors have spent time integrating across borders, so any change in trade policy will create headaches.\"\nOverall, Mexico and Canada represent nearly one-third of total U.S. agricultural exports. Corn, soybeans, fresh fruits and vegetables as well as livestock and dairy are major U.S. exports to those countries.\nU.S. agricultural exports in fiscal 2017 totaled $140.5 billion, up nearly $11 billion from the prior year. Canada was the second-largest ag export customer last year after China, with Mexico in third place , according to the U.S. Department of Agriculture.\nFor the Trump administration, though, concerns about NAFTA go well beyond agriculture to other industries such as auto manufacturing.\nAnother hot-button issue that may come up is immigration.\nThe ag industry claims they can't find enough American workers willing to harvest crops in fields and perform other farm work. Some farmers also say the immigration crackdown by the administration hasn't helped the situation and they worry that cutting off foreign-born workers will only worsen the farm labor shortage.\n\"Part of it is there is plenty of work, even for people in this country, but it's really difficult for citizens to see themselves working in a field,\" said Jim Durst, an organic farmer who grows squash, melons and other specialty crops in Yolo County in Northern California.\nDurst added that the continued pressure by the Trump administration on immigrants coming into the United States \"has exacerbated the problem by creating an atmosphere of fear.\" He also faults Congress for its failure to help on the issue.\nGrowers from California and other parts of the country have relied on a so-called H-2A visa program that allows agricultural guest workers to perform seasonal work. But agricultural employers say it's essentially created a \"mini-bureaucracy\" and added other burdens rather than eased the farm labor shortage.\nStill, one of the themes the president is likely to tout is progress his administration has made on the regulatory front to help ranchers and farmers.\nFor one, the Trump administration rolled back the so-called Waters of the United States rule, which was drafted during the Obama administration and broadened the definition of such things as \"tributary\" and also toughened controls over \"adjacent waters.\"\nAg groups claimed the new rules forced ranchers and feedlot operators to get permits or risk excessive penalties despite being miles away from any navigable water. Also, some ranchers said it restricted their ability to erect important structures including fences to keep in livestock.\nTrump also is likely to tout the new tax bill as it could lower rates for family farms structured as small businesses. Also, there are provisions that help farmers with expenses.\nFinally, the president may discuss how rural America is facing challenges with the opioid epidemic but how his administration declared it a \"health emergency\" and is tackling the issue.", "external_links": [], "published": "2018-01-08T21:51:00.000+02:00", "crawled": "2018-01-08T21:53:12.021+02:00", "highlightTitle": ""}