{"organizations": [], "uuid": "83720fbd5da7ecbaa4143cbf1a62147f0b274713", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104906908-GettyImages-878451366.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/11/cramer-shares-5-reasons-why-the-retail-sector-is-back-in-action.html", "country": "US", "domain_rank": 767, "title": "Cramer shares 5 reasons why the retail sector is back in action, according to industry executives", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-12T01:57:00.000+02:00", "replies_count": 0, "uuid": "83720fbd5da7ecbaa4143cbf1a62147f0b274713"}, "author": "", "url": "https://www.cnbc.com/2018/01/11/cramer-shares-5-reasons-why-the-retail-sector-is-back-in-action.html", "ord_in_thread": 0, "title": "Cramer shares 5 reasons why the retail sector is back in action, according to industry executives", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "kohl", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "icr", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "children's place", "sentiment": "none"}, {"name": "nordstrom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A day of speaking with the retail industry's top brass at the ICR's Conference in Orlando, Florida made CNBC's Jim Cramer realize that Wall Street might be discounting the sector's comeback.\n\"We're being way too cavalier about the return of retail, including mall-based retail and what it really means,\" the \" Mad Money \" host said on Thursday. \"We just can't believe that any of these companies can really escape the clutches of the Death Star, Amazon .\"\nAfter hearing that Kohl's delivered same-store sales of over 5 percent for the first time since 2001 and that Children's Place logged an 8.5 percent gain in holiday-season same-store sales, Cramer sensed that these were more than just positive blips on the retail radar screen.\nThen, when Target and Nordstrom's earnings kicked into high gear and both companies raised their holiday sales forecasts, Cramer started to suspect a genuine turn in the group as a whole.\nWith that in mind, Cramer shared five factors that could be driving the retail sector back into Wall Street's good graces.\n1. Consumer Cramer has already spoken about how the consumer is stronger than many people think. But recently, only do-it-yourself and bargain retailers like Home Depot and Costco were considered to be stable investments by Wall Street.\n\"After this week, it's clear that we're getting terrific results from all kinds of retailers,\" Cramer said. \"The numbers are so big that you have to think there's been a serious pickup in shopping, not just back to where we were in 2014, but, in many cases, to where we were in the early-to-mid-2000s.\"\nStill, Cramer warned investors not to jump the gun. Because the VanEck Vectors Retail ETF is largely in control of the sector, the best strategy would be to wait for it to pull back before buying the improving retail names, he said.\n\"Given that the RTH has been roaring lately, I think you'll end up overpaying if you don't wait for a little bit of a downturn,\" the \"Mad Money\" host said. \"But in truth, retail executives feel that job creation [and] stability, coupled with some genuine economic booms often related to cheap energy in the Southeast, are all combining to create a much more positive backdrop.\"\n2. Millennials Household formation , particularly by millennials starting families, is also having an unexpectedly positive effect on the retail sector, Cramer said.\n\"Millennials [are] finally having children [and] spending money on them,\" he said. \"Maybe student loan debt and health care costs are less of a worry than we thought.\"\n3. Strategy Third, Cramer said traditional retailers' on- and offline strategies are finally starting to resonate with consumers.\n\"While they may have to partner with Amazon Web Services, they're also using the correct customer relationship software to maintain and enhance loyalty,\" he said. \"They have much better control over their inventory and they've finally figured out the positives of bricks-and-mortar, like buy online, pickup at the store .\"\n4. Failures In a time that's been something of a reckoning for retailers, the winners are taking market share as losers abound, Cramer said.\n\"The survivors are getting the spoils,\" the \"Mad Money\" host quipped.\n5. Valuation Finally, the market could still be undervaluing some stocks in the sector, Cramer said, arguing that it seemed \"ridiculous\" that Nordstrom isn't going private given the strength of its latest numbers.\n\"I feel the same way about the stock of Macy's ,\" Cramer said. \"I don't think people understand the magnitude of optionality that Macy's has if they get it right, and CEO Jeff Gennette is getting it very right. The fact that Macy's has cleaned up its balance sheet allows the company to do a lot more with a lot less.\"\nFinal thoughts \"I say now that retail's in a dry spell, and that happens in January, ... you need to buy this group the next time we get any kind of weakness here,\" Cramer concluded. \"The retailers aren't falling apart anymore. For the first time in years, they're not just tradeable, they're actually investable.\"\nWATCH: Cramer renews his retail bull case show chapters Cramer shares 5 reasons why the retail sector is back in action, according to industry executives 19 Hours Ago | 04:41 Questions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-12T01:57:00.000+02:00", "crawled": "2018-01-12T02:09:59.001+02:00", "highlightTitle": ""}