{"organizations": [], "uuid": "7835b7ede9339e8e0cdeae52dd87e41f8b5a3e32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104973679-AP_18026649760964r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/29/gold-treasure-recovered-from-a-1857-shipwreck-is-set-to-make-its-debut.html", "country": "US", "domain_rank": 767, "title": "Gold treasure recovered from a 1857 shipwreck is set to make its debut", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-29T14:20:00.000+02:00", "replies_count": 0, "uuid": "7835b7ede9339e8e0cdeae52dd87e41f8b5a3e32"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/gold-treasure-recovered-from-a-1857-shipwreck-is-set-to-make-its-debut.html", "ord_in_thread": 0, "title": "Gold treasure recovered from a 1857 shipwreck is set to make its debut", "locations": [], "entities": {"persons": [{"name": "bob evans", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "santa ana", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "long beach convention center", "sentiment": "none"}, {"name": "s.s. central america", "sentiment": "none"}], "organizations": [{"name": "u.s. news gold", "sentiment": "negative"}, {"name": "s.s. central america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. News Gold treasure recovered from a 1857 shipwreck is set to make its debut More than $50 million worth of gold is about to make its debut after sitting at the bottom of the ocean for more than 150 years. The 3,100 gold coins, 45 bars, and more than 80 pounds of dust recovered from the wreckage of the S.S. Central America steamship. The gold will be on display Feb. 22-24 at the Long Beach Convention Center. Published 5 Hours Ago The Associated Press Jae C. Hong | AP Chief scientist Bob Evans looks at gold bars recovered from the S.S. Central America steamship that went down in a hurricane in 1857 in a laboratory Tuesday, Jan. 23, 2018, in Santa Ana, Calif. More than $50 million worth of gold bars, coins and dust described as the greatest lost treasure in U.S. history is about to make its public debut in California. \nMore than $50 million worth of gold bars, coins, and dust that's been described as the greatest lost treasure in U.S. history is about to make its public debut in California after sitting at the bottom of the ocean for more than 150 years. \nThe 3,100 gold coins, 45 gold bars and more than 80 pounds (36 kilograms) of gold dust recovered from the wreckage of the S.S. Central America steamship are now sitting in a makeshift laboratory just south of Los Angeles. \nBob Evans, the chief scientist on the original voyage that discovered the shipwreck and its treasure in 1988, is now painstakingly cleaning each piece of gold by hand, soaking it in a solution and brushing off rust and grime that accumulated as the treasure sat 7,000 feet (2,134 meters) below sea level. \n\"This is a whole new season of discovery,\" Evans told The Associated Press this week from the laboratory in Santa Ana. \"We are now peering beneath the grime and the rust that is on the coins, removing those objects and those substances and getting to look at the treasure as it was in 1857.\" \nCentral America was laden with booty from the California Gold Rush when it sank in a hurricane off the coast of South Carolina in 1857. Four hundred and twenty-five people drowned and thousands of pounds of California gold were lost, contributing to an economic panic. \nUsing sable paintbrushes and a cleaning solution, Evans has been restoring the gold —some of which is completely caked over in black gunk — to its original luster for the past two weeks. He will continue that work through February, when the treasure will go on public display at the Long Beach Convention Center, just south of Los Angeles. \nThe gold is all for sale. Just one tiny coin alone could go for $1 million because of its combination of rarity and the history behind it, said Dwight Manley, managing partner of the California Gold Marketing Group, which is displaying and selling the gold. \n\"This is something that in hundreds of years people will still be talking about, reading about, looking back on and collecting things from,\" Manley said. \"There's no other ships that sank that haven't been recovered that rival this or are similar to this, so it's really a once-in-a-lifetime situation.\" \nMeanwhile, the deep-sea treasure hunter responsible for finding the gold in the first place continues to sit in an Ohio jail over his handling of the original treasure recovered from Central America. \nTreasure hunter and Ohio native Tommy Thompson found the ship in 1988 after convincing 161 local investors to fund the voyage for nearly $13 million. \nA lengthy battle ensued over who owned the gold, with Thompson and his investors eventually emerging as the victors over a group of insurance companies. Thompson's company sold 532 gold bars and thousands of coins to the California Gold Marketing Group for about $50 million in 2000. \nInvestors never saw any of those proceeds. In 2005, they sued Thompson, who then went into seclusion in Florida and later became a fugitive after an Ohio judge issued a warrant for his arrest in 2012. \nAuthorities tracked Thompson to a Florida hotel room in 2015. A judge has held Thompson in contempt since December 2015 for violating terms of a plea deal by refusing to answer questions about the location of 500 missing gold coins. He's been jailed ever since. \nThompson has previously said the coins were turned over to a trust in Belize. He has also said that the $50 million from the sale of the gold mostly went toward legal fees and bank loans. \nRecovered in 2014, the gold going on display in California next month is only the second round of treasure brought up from the Central America. \nManley, of the California Gold Marketing Group, bought the gold from investors this month. It was the first time investors saw returns since their initial investment in the 1980s, though some of them died waiting to see such a day. \nThe gold will be on display Feb. 22-24 at the Long Beach Convention Center. ", "external_links": [], "published": "2018-01-29T14:20:00.000+02:00", "crawled": "2018-01-29T14:29:58.000+02:00", "highlightTitle": ""}