{"organizations": [], "uuid": "fd6a2f2c5b43c9b6d650c96961e4cf4d921e18b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/24/104671099-IMG_5392-scott-gottlieb.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/flu-season-may-peak-in-coming-weeks-fda-chief-says.html", "country": "US", "domain_rank": 767, "title": "Flu season may peak in coming weeks, FDA chief says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T14:15:00.000+02:00", "replies_count": 0, "uuid": "fd6a2f2c5b43c9b6d650c96961e4cf4d921e18b0"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/flu-season-may-peak-in-coming-weeks-fda-chief-says.html", "ord_in_thread": 0, "title": "Flu season may peak in coming weeks, FDA chief says", "locations": [], "entities": {"persons": [{"name": "scott gottlieb", "sentiment": "none"}, {"name": "gottlieb", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The flu may peak in coming weeks after a particularly bad season, said Food and Drug Administration Commissioner Scott Gottlieb. \n\"I want to be careful. About a week ago we said it had peaked, and now it looks like we have a couple more weeks. It should peak around February,\" Gottlieb told CNBC's \" Squawk Box \" from the World Economic Forum's annual meeting in Davos, Switzerland. \nThe flu is widespread in the U.S. right now. Healthy people have died from influenza this year, a reminder that the common virus can be a killer. One problem that causes the flu to spread is people with less-severe symptoms going out instead of staying home, Gottlieb said. Pressure to go to the office and work while sick is one way germs spread.\nThis year's flu vaccine hasn't been particularly effective because the strain chosen mutated during development in chicken eggs, Gottlieb said. Research published in the journal Proceedings of the National Academy of Sciences in November supported that.\nScientists are exploring new ways to manufacture influenza vaccines, such as growing the virus in cells. However, the process is more expensive and has a lower yield than the traditional method of using chicken eggs, Gottlieb said. \n\"The holy grail is a universal vaccine that will elicit a T-cell response so good against any strain of influenza so we're out of this business of trying to guess what the predominant strain will be,\" he said. T-cells stimulate the immune response to foreign bodies.\nNow, the FDA meets every February to choose what to put into the year's flu shot based on recommendations from the World Health Organization. It includes three or four strains, since multiple viral strains can circulate throughout the season.\nScientists are trying different methods to create a universal vaccine. \nVaccitech, which spun out from the University of Oxford's Jenner Institute, is testing a universal vaccine in clinical trials. It goes after the bottom part of the protein on flu viruses to boost T-cell response, rather than the traditional antibody response. GV, the venture arm of Google parent Alphabet , is an investor.\nIt's unclear when a universal flu shot may enter the market, Gottlieb said. But he says it's going to be more expensive than what's on the market now.", "external_links": [], "published": "2018-01-25T14:15:00.000+02:00", "crawled": "2018-01-25T14:54:52.020+02:00", "highlightTitle": ""}