{"organizations": [], "uuid": "bed5370d669fc022c4a345fb7ce4183d6c679ccf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938336-Y2A0133.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/10/investing-in-berkshire-hathaway-could-look-different-once-warren-buffett-steps-down.html", "country": "US", "domain_rank": 767, "title": "How will Warren Buffett's departure impact Berkshire Hathaway?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-10T22:55:00.000+02:00", "replies_count": 0, "uuid": "bed5370d669fc022c4a345fb7ce4183d6c679ccf"}, "author": "", "url": "https://www.cnbc.com/2018/01/10/investing-in-berkshire-hathaway-could-look-different-once-warren-buffett-steps-down.html", "ord_in_thread": 0, "title": "How will Warren Buffett's departure impact Berkshire Hathaway?", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "neutral"}, {"name": "abel", "sentiment": "none"}, {"name": "ajit jain", "sentiment": "none"}, {"name": "gregory abel", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "jain", "sentiment": "none"}], "locations": [{"name": "berkshire hathaway", "sentiment": "none"}, {"name": "omaha", "sentiment": "none"}], "organizations": [{"name": "berkshire hathaway", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "College Game Plan Investing in Berkshire Hathaway could look different once Warren Buffett steps down The 87-year-old billionaire acknowledged he is moving toward a succession plan for the leadership of Berkshire Hathaway with the appointment of two new board members. A change in leadership prompted by Buffett's departure would change the investment outlook for the company. 4 Hours Ago | 57:59 \nWarren Buffett is coming closer to naming a successor at Berkshire Hathaway . It remains to be seen whether the company will lose its lustre without the Oracle of Omaha. \nBuffett named Gregory Abel, 55, and Ajit Jain, 66, to the company's board on Wednesday. Abel will serve as vice chairman of non-insurance business, while Jain will serve as vice chair of insurance operations. \nThe appointments are \"part of a movement to succession over time,\" Buffett told CNBC in an exclusive interview . \nThe legendary investor's departure would put the company into unchartered territory for retail investors. Buffett took the company over in 1965 and has overseen its growth ever since . \nThe 87-year-old businessman currently serves as chairman and CEO of Berkshire Hathaway alongside vice chairman Charlie Munger, 94. The Omaha-based conglomerate employs tens of thousands in a variety of businesses including insurance, mobile housing and industrial concerns. \nBuffett said on Wednesday that he is in \"remarkably good health.\" \n\"I feel terrific. I love what I do. I can't wait to go to the office in the morning,\" he said. \"There's nothing I'd rather be doing.\" \nBuffett said he will notify Berkshire's board and shareholders if he experiences any health issues. Berkshire's board already knows who would take over if something happened to him, he said on Wednesday. David A. Grogan | CNBC \n\"Probably no other company on earth has this kind of make up where you have someone who has essentially been running the company for 50 years,\" said Paul Schatz, president of Heritage Capital in Woodbridge, Connecticut. \nBuffett himself could not repeat his investment track record with the level of assets the company now has, according to Schatz. That will pose a challenge for his successors. \n\"They can do a great job, but there is no chance they will come close to the record he compiled over the last 50 years,\" Schatz said. \"The assets are just too big.\" \nSchatz predicts there would be some changes to the company's stock, which is sold in two classes, with Buffett's departure. \"Once Warren and Charlie are gone, there will be intense pressure to start paying a dividend,\" he said. \nMark S. Germain, founder and CEO of Beacon Wealth Management in Hackensack, New Jersey, said he still sees Berkshire Hathaway as a promising investment. \n\"The brain power of Berkshire Hathaway has not been diminished by adding more brain power,\" Germain said. \"The key players are still there.\" \nStill, if a sudden management change were to happen and Buffett was no longer at the company, Germain said he would put the company on watch. \n\"We put the buying of that particular investment opportunity on hold until we have time to evaluate,\" Germain said. \"It doesn't mean you go and sell everything.\" \nGermain said he thinks Buffett has made plans for Berkshire Hathway with the same long-term focus he applies to his investments. \n\"If I could pick someone to have been mentored by, it would be Warren Buffett,\" Germain said. \"Exactly as he looks for companies, he wants his company to be managed in the same fashion.\" \nMore from Personal Finance: ", "external_links": [], "published": "2018-01-10T22:55:00.000+02:00", "crawled": "2018-01-10T23:12:30.009+02:00", "highlightTitle": ""}