{"organizations": [], "uuid": "f1ee606e569730e64f9408b3899eedebff540104", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/12/103782960-GettyImages-80276094.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/08/trouble-in-the-charts-for-banks-going-into-earnings-according-to-technician.html", "country": "US", "domain_rank": 767, "title": "There’s trouble in the charts for banks heading into earnings, according to one technician", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-08T21:09:00.000+02:00", "replies_count": 0, "uuid": "f1ee606e569730e64f9408b3899eedebff540104"}, "author": "", "url": "https://www.cnbc.com/2018/01/08/trouble-in-the-charts-for-banks-going-into-earnings-according-to-technician.html", "ord_in_thread": 0, "title": "There’s trouble in the charts for banks heading into earnings, according to one technician", "locations": [], "entities": {"persons": [{"name": "carter worth", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "american express", "sentiment": "none"}, {"name": "cornerstone macro", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "pnc", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "travelers", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The big banks kick off earnings this week, and it could be make or break time for the surging sector.\nWells Fargo , J.P. Morgan and BlackRock are set to report Friday before the bell, with the market implying moves of 3 percent, 2.5 percent and 2 percent in either direction for those names, respectively. PNC is also reporting earnings Friday after the bell, with options traders expecting an implied move of 3 percent for the name.\nFrom a technical standpoint, Carter Worth, chief market technician at Cornerstone Macro, sees trouble ahead in the space. The financials-tracking ETF ( XLF ) is up almost 2 percent since the start of the year and closed at its highest level since October 2007 on Friday. But Worth says it hasn't been the banks that have driven XLF to multiyear highs despite rallies in names like Bank of America and Wells Fargo, both up 2 percent since the start of 2018.\n\"But what's interesting is [XLF is] so dependent on names like American Express and big insurance companies like Travelers,\" he said Friday on CNBC's \"Options Action.\" \"The banks themselves have trailed the market, and regional banks have really trailed.\"\nTo illustrate his point, Worth brought up a chart of the KBW Bank Index , which includes both big banks and smaller regional names. While the index has rallied about 2 percent in the past month, Worth points out that the index is actually underperforming the S&P 500.\nIn fact, since the start of the year the KBW index has rallied almost 2 percent while the S&P has rallied about 3 percent.\nThe same can be said for big bank J.P. Morgan. The company's stock has made an impressive 10 percent comeback since the end of November. The rally was first fueled by the Nov. 28 hearing for Fed Chairman nominee Jerome Powell , where he said that bank rules were \"tough enough\" for a stable financial system, and then with the passage of the tax law and the Federal Reserve raising interest rates in December.\nBut despite the slew of good news for banks, Worth points out that J.P. Morgan has also been underperforming the market.\n\"[J.P. Morgan has] gone up of late, but it's not participating with the general market,\" he said. \"Overall, it has made no real relative results in about two years. So [J.P. Morgan], as a pick, really didn't do anything one could've done by just being in the SPY, and that's the issue,\" Worth said, referring to the S&P 500 ETF.\nIn conclusion, \"I don't want to be overweight banks here, and I don't think J.P. Morgan is any different than the group at large,\" Worth said.\nFinancials were slightly lower Monday, with the XLF trading at around $28.38.\nDisclaimer", "external_links": [], "published": "2018-01-08T21:09:00.000+02:00", "crawled": "2018-01-08T21:30:37.002+02:00", "highlightTitle": ""}