{"organizations": [], "uuid": "97ed6e8e9428f63f636bfbd5dfebb7f848fc3289", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/13/104896412-GettyImages-538463653.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/25/when-fridays-gdp-is-reported-economys-run-could-be-strongest-in-13-years.html", "country": "US", "domain_rank": 767, "title": "When Friday's GDP is reported, economy's run could be strongest in 13 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-25T23:25:00.000+02:00", "replies_count": 0, "uuid": "97ed6e8e9428f63f636bfbd5dfebb7f848fc3289"}, "author": "", "url": "https://www.cnbc.com/2018/01/25/when-fridays-gdp-is-reported-economys-run-could-be-strongest-in-13-years.html", "ord_in_thread": 0, "title": "When Friday's GDP is reported, economy's run could be strongest in 13 years", "locations": [], "entities": {"persons": [{"name": "george w. bush", "sentiment": "none"}, {"name": "chris rupkey", "sentiment": "none"}, {"name": "ezra bailey", "sentiment": "none"}], "locations": [], "organizations": [{"name": "image bank", "sentiment": "none"}, {"name": "mufg union bank", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider When Friday's GDP is reported, economy's run could be strongest in 13 years Fourth quarter GDP is expected to grow by 3 percent, making for the first time since 2005 that growth has been reported at 3 percent or better for three quarters in a row. The report is expected at 8:30 a.m. ET, as are durable goods for December. The Trump administration had targeted 3 percent growth, and economists have had to ratchet up forecasts for fourth quarter, as data improved. CNBC.com Ezra Bailey | The Image Bank | Getty Images \nEconomists expect fourth quarter GDP to grow at a 3 percent pace, which would make it the third quarter of 3 percent growth in a row for the first time since 2005. \n\"Three in a row 3.0—That's a number that will get people's attention,\" said Chris Rupkey, chief financial economist at MUFG Union Bank. \"It's going to be close. It's going to be a nail biter,\" \nThere was a period of more than 3 percent growth when averaged across three quarters in 2014 and 2015, but no period has seen growth as consistently and sequentially at 3 percent since George W. Bush was in the White House. \nThe fourth quarter report is expected at 8:30 a.m. ET Friday, as is the report on durable goods for December. At 8 a.m. ET Friday, President Donald Trump speaks in Davos, Switzerland, at the World Economic Forum just before the release and is sure to tout the resurgence in the U.S. economy in 2017, even before GOP tax law changes took affect. \n\"Durable goods are coming in strong. It means business equipment expenditures should be adding more than expected to growth,\" said Rupkey. \"Consumer spending — it's been stronger and stronger. We had a shaky period with retail sales but now the consumer looks on a firmer footing.\" \nRupkey said the increase in asset prices, in the stock market and the wealth effect are helping boost consumer sentiment. \"There's kind of a rosy glow, a halo of how well the consumer is doing here. Fed by stock market gains, that knows no bounds. I think everyone feels good about the outlook,\" he said. \nEconomists have warned that the first quarter may not be as strong as the fourth, if it does come in at the 3 percent expected by Thomson Reuters and the CNBC/Moody's Analytics Rapid GDP update. \nThe first quarter has been soft in recent years, and this year January's cold weather may have slowed consumption. \"I have 2.5 percent, just a little weaker,\" said Rupkey.", "external_links": [], "published": "2018-01-25T23:25:00.000+02:00", "crawled": "2018-01-25T23:53:42.000+02:00", "highlightTitle": ""}