{"organizations": [], "uuid": "34eea6817ef1805729f595d1b7a711edf11f8677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "", "site_section": "http://fortune.com", "section_title": "Diet Coke Is In Decline. And the Latest Revamp Might Not Help – Fortune", "url": "http://fortune.com/2018/01/14/diet-coke-revamp-sales-down/", "country": "US", "domain_rank": 1196, "title": "Diet Coke Is In Decline. And the Latest Revamp Might Not Help", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-14T19:36:00.000+02:00", "replies_count": 0, "uuid": "34eea6817ef1805729f595d1b7a711edf11f8677"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/14/diet-coke-revamp-sales-down/", "ord_in_thread": 0, "title": "Diet Coke Is In Decline. And the Latest Revamp Might Not Help", "locations": [], "entities": {"persons": [{"name": "derek thompson", "sentiment": "none"}], "locations": [{"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "negative"}, {"name": "diet coke", "sentiment": "neutral"}, {"name": "coke", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 12:36 PM EST \nCoca-Cola last week announced a major revamp of Diet Coke, including skinny cans and a variety of new fruit flavors. Diet Coke is still a pillar of Coke’s business, but the revamp comes as it is facing dramatic headwinds – according to one analysis, Diet Coke sales were down a staggering 6% in just the last three months of 2017. \nIn part, Diet Coke has been hit by the broader, steady decline in soda consumption. According to an eye-opening new story in The Atlantic , that consumption peaked in the mid-2000s. Back then, Americans consumed, on average, a remarkable half-liter of soda per day. Those levels are down by nearly half after more than a decade of decline , and are projected to keep dropping. \nThe decline of Diet Coke, though, has been faster than that of any other Coke beverage. According to Atlantic writer Derek Thompson, part of that involves dramatically shifting perceptions of what qualifies as healthy. A decade ago, the fact that Diet Coke has no sugar or calories made it seem, for many, like a healthy choice. \nGet Data Sheet , Fortune’s technology newsletter. \nBut growing skepticism about artificial sweeteners — including evidence that they may still cause weight gain — means the most health-conscious consumers are shying away. Even the new Diet Coke flavors have invited scrutiny over the use of a newer artificial sweetener, known as Ace-K. That skepticism of all things artificial may explain why sales of full-sugar Coke are actually still growing. \nThe fate of Diet Coke, and even of soda, doesn’t entirely indicate the future of the Coca-Cola company, which has aggressively diversified into growing categories like juices, energy drinks and bottled water. Nonetheless, the hit to one of Coke’s core products may be showing — Coke’s growth was flat for much of 2017. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-14T19:36:00.000+02:00", "crawled": "2018-01-14T19:36:19.001+02:00", "highlightTitle": ""}