{"organizations": [], "uuid": "b94e13ebb5bfcd73b6d7b20512fcf16c774bcb4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/10/102256633-167836895.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19746125/device/rss/rss.xml", "section_title": "Top News and Analysis (pro)", "url": "https://www.cnbc.com/2018/01/23/the-us-is-in-a-baby-bust-so-diaper-makers-need-a-new-plan.html", "country": "US", "domain_rank": 767, "title": "The US is in a baby bust, so diaper makers need a new plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "blogs", "published": "2018-01-23T20:02:00.000+02:00", "replies_count": 0, "uuid": "b94e13ebb5bfcd73b6d7b20512fcf16c774bcb4e"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/the-us-is-in-a-baby-bust-so-diaper-makers-need-a-new-plan.html", "ord_in_thread": 0, "title": "The US is in a baby bust, so diaper makers need a new plan", "locations": [], "entities": {"persons": [{"name": "kimberly clark", "sentiment": "none"}, {"name": "jason dorsey", "sentiment": "none"}, {"name": "tanya little", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "procter & gamble", "sentiment": "none"}, {"name": "center for generational kinetics", "sentiment": "none"}, {"name": "getty images  baby", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More: With 4 babies on tour, the US Ski Team resembles a nursery Kimberly-Clark , the maker of Huggies diapers and Kleenex tissues, on Tuesday announced it will cut about 13% of its workforce globally in a bid to reduce costs as sales wane. It pointed to the lower U.S. birth rate as one of the challenges confronting the company in its Tuesday call with investors. Pampers-maker Procter & Gamble , which also announced earnings Tuesday, reported a 1% drop in its baby, feminine and family care business. That segment, which also includes wipes and pregnancy tests, has declined or stayed flat on a yearly basis since 2014. The pain has proliferated beyond diaper makers. Edgewell Personal Care , the maker of Playtex baby bottles, has seen sales of its infant feeding products decline. Johnson & Johnson has watched its U.S. baby business, which includes baby oil, bubble bath and nursing pads, drop as well. \"Big brands right now need to adapt, because a delay in having children or a decline poses a significant material threat to their core business,\" Dorsey said. The diaper business remains viable, and any business that requires frequent repeat purchases is desirable. But companies need to make and deliver products the way mothers want them to. CLOSE President Donald Trump says he's imposing new tariffs to \"protect American jobs\" and workers. Trump also said he's \"not concerned\" about what Attorney General Jeff Sessions said during an interview with Robert Mueller for his Russia probe. (Jan. 23) AP Innovation has largely been driven by upstarts. Brands like Honest Co. and Seventh Generation have shown there is an appetite for organic diapers (though Honest ran into labeling issues). Several retailers have demonstrated the appeal of an online subscription diaper business. Companies also can extend their product lines, making different products for babies or focusing on toddlers rather than newborns. J&J plans on relaunching its baby care products this year with new formulations and packaging, the company said during its earnings call. Kimberly-Clark told investors Tuesday it has a number of innovations it is planning on unveiling, including diapers with improved protection and fit. Meantime, as the number of adults older than 65 grow, diaper markers can double down on their offerings for the incontinent. Roughly 31% of all diaper sold in the U.S. were adult diapers, according to data provider IBISWorld. — CNBC's Angelica LaVito contributed to this report. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CONNECT COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-23T20:02:00.000+02:00", "crawled": "2018-01-23T20:28:06.000+02:00", "highlightTitle": ""}