{"organizations": [], "uuid": "1caaac3edc1fa7247e72f20f9b0d6636c68b0a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-up-vs-yen-as-concerns-ease-over-china-us-bond-stance-idUSL4N1P6239", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar up vs yen as concerns ease over China US bond stance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:52:00.000+02:00", "replies_count": 0, "uuid": "1caaac3edc1fa7247e72f20f9b0d6636c68b0a6d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-up-vs-yen-as-concerns-ease-over-china-us-bond-stance-idUSL4N1P6239", "ord_in_thread": 0, "title": "FOREX-Dollar up vs yen as concerns ease over China US bond stance", "locations": [], "entities": {"persons": [{"name": "masayuki kitano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "china us", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "u.s. treasuries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Concerns China could be slowing its U.S. debt buying ease\n* Reports could be based on wrong information-FX regulator\n* Dollar/yen up 0.2 pct, pulls away from 6-week lows (Updates prices, adds comments)\nBy Masayuki Kitano\nSINGAPORE, Jan 11 (Reuters) - The dollar edged higher against the yen on Thursday after comments by China’s foreign exchange regulator eased concerns that China may reduce its buying of U.S. government bonds.\nThe dollar rose 0.2 percent to 111.70 yen, pulling away from a six-week low of 111.27 yen on Wednesday.\nChina’s foreign exchange regulator said a recent report that China was considering slowing down or halting its purchases of U.S. Treasury bonds could be based on erroneous information.\nBloomberg News had reported on Wednesday that Chinese officials reviewing the country’s foreign exchange holdings had recommended slowing or halting purchases of U.S. Treasury bonds.\nU.S. 10-year Treasury yields rose to 10-month highs and the dollar fell after the report was published.\nAfter the regulator’s comments on Thursday though, the dollar and U.S. Treasuries gained some buying support.\nAgainst a basket of six major currencies, the dollar inched up 0.1 percent to 92.396, having fallen as low as 91.922 on Wednesday.\nStill, some analysts remained cautious about the dollar’s near-term outlook.\nMarket sentiment seems tilted toward the dollar’s downside, said Masashi Murata, currency strategist for Brown Brothers Harriman in Tokyo.\n“Market reaction to dollar-buying factors has been subdued, while market reactions to dollar-selling, and yen-buying factors, have been more vivid,” Murata said.\nThe dollar is down more than 1.1 percent against the yen so far this week, having also come under pressure after the Bank of Japan trimmed its buying of long-dated Japanese government bonds in market operations on Tuesday.\nThe BOJ operation unleashed a wave of speculation that the BOJ could be poised to begin winding down its stimulus, giving the yen a boost.\nThe BOJ on Thursday soothed nerves by buying its usual amount of debt.\nThe euro was steady on Thursday at $1.1951, having retreated from Wednesday’s intraday high of $1.20185.\nThe Canadian dollar was nursing losses after slipping on Wednesday as investor bet the Bank of Canada was less likely to raise interest rates next week if the United States withdraws from the North American Free Trade Agreement (NAFTA) trade agreement.\nCanada is increasingly convinced that U.S. President Donald Trump will soon announce that the United States intends to pull out of the agreement, two government sources said.\nThe Canadian dollar was little changed at C$1.2549 per U.S. dollar. It fell on Wednesday as low as C$1.2583, the loonie’s lowest level since late December.\nThe Australian dollar touched its highest levels in nearly three months at $0.7887 on Thursday after data showed that Australian retail sales recorded the biggest monthly rise in four years in November, a major boost for an economy that has been struggling with sluggish consumer spending.\nThe Aussie last traded at $0.7880, up 0.5 percent on the day. (Reporting by Masayuki Kitano; editing by Richard Pullin)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T13:52:00.000+02:00", "crawled": "2018-01-12T18:24:20.012+02:00", "highlightTitle": ""}