{"organizations": [], "uuid": "d16d2e23d4be9fa4eaaecec9d776a94cc2381456", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pakistan-newsweek/newsweek-reviews-ties-with-pakistan-franchise-after-child-abuse-comments-idUKKBN1FE0Z3", "country": "US", "domain_rank": 408, "title": "Newsweek reviews ties with Pakistan franchise after child abuse comments", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T11:18:00.000+02:00", "replies_count": 0, "uuid": "d16d2e23d4be9fa4eaaecec9d776a94cc2381456"}, "author": "", "url": "https://uk.reuters.com/article/uk-pakistan-newsweek/newsweek-reviews-ties-with-pakistan-franchise-after-child-abuse-comments-idUKKBN1FE0Z3", "ord_in_thread": 0, "title": "Newsweek reviews ties with Pakistan franchise after child abuse comments", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "ahmed", "sentiment": "none"}, {"name": "fasih ahmed", "sentiment": "none"}, {"name": "tom cruise", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}], "organizations": [{"name": "newsweek", "sentiment": "negative"}, {"name": "newsweek pakistan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 9:27 AM / Updated 14 minutes ago Newsweek reviews ties with Pakistan franchise after child abuse comments Reuters Staff 3 Min Read \nISLAMABAD (Reuters) - U.S. publication Newsweek said it was reviewing ties with its Pakistan franchise after the magazine’s local editor made offensive remarks about child abuse and rape. \nTwitter posts by Fasih Ahmed, the scion of a wealthy family that owns the local Newsweek Pakistan magazine, sparked outrage on social media at a time of deep anger in the conservative Muslim nation over the rape and murder of a seven-year-old girl. \n“The sexual abuse of children will always exist. You can never eliminate it. Sometimes it leads to great art. So there’s also that,” Ahmed wrote in a now deleted tweet on January 18. \nIn another deleted tweet, Ahmed wrote that unlike being raped by former U.S. President Barack Obama, being raped by actor Tom Cruise is “everyone’s dream come true”, adding that everything is subjective. \nNewsweek on Wednesday tweeted that it was “reviewing” its relationship with the Pakistan publication, “which operates under a license agreement”. \nNewsweek, which is owned by American digital news company IBT Media, and Newsweek Pakistan did not immediately respond to Reuters request for comment. Ahmed could not be reached for comment. \nAfter the social media backlash against Ahmed, a prominent Pakistani literary festival held in the central city of Lahore announced that it had received “several complaints” and had accepted Ahmed’s resignation from its board of governors. \nAhmed’s father, Iqbal Z. Ahmed, is one of Pakistan’s most prominent businessmen and his brother is the founder of the Lahore Literature Festival. \nInitially Ahmed responded to online criticism by saying the rest of the country was in denial about child abuse. \n“Child sexual abuse has always happened, is happening, and will continue,” he tweeted, adding that those showing outrage on social media or participating in vigils were not actually helping the victims. \nAhmed deleted the offensive posts from his twitter page and late on Wednesday posted an apology. \n“My tweets of yesterday were coming from anger, were poorly phrased, and misread. I‘m sorry to have upset the people who have survived child abuse,” Ahmed tweeted. \nAhmed’s comments drew outrage across Pakistan, which is reeling from the shock of the grisly rape and murder of Zainab Ansari, the seven-year-old whose body was recovered from a dumpster in the central town of Kasur. \nProtests erupted nationwide after the Zainab’s body was found. Her murder highlighted a series of paedophilia-related murders in the town. \nOn Tuesday, police announced that they had caught a suspect who had confessed to a number of other murders. \n“Child abuse is pure evil. Zainab needs to be a watershed moment. Talk about it. Deal with it. Don’t shame those who have to live with it,” Ahmed added in one of his apologetic tweets. Reporting by Saad Sayeed; Editing by Drazen Jorgic & Simon Cameron-Moore", "external_links": [], "published": "2018-01-25T11:18:00.000+02:00", "crawled": "2018-01-25T11:46:57.032+02:00", "highlightTitle": ""}