{"organizations": [], "uuid": "ae27fa8728948ab7cbaacdf2ffedc4316104c80f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-airport/syrian-army-allies-take-idlib-air-base-hezbollah-media-unit-idUSKBN1F90M7", "country": "US", "domain_rank": 408, "title": "Syrian army, allies take Idlib air base: Hezbollah media unit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.256, "site_type": "news", "published": "2018-01-20T21:57:00.000+02:00", "replies_count": 0, "uuid": "ae27fa8728948ab7cbaacdf2ffedc4316104c80f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-airport/syrian-army-allies-take-idlib-air-base-hezbollah-media-unit-idUSKBN1F90M7", "ord_in_thread": 0, "title": "Syrian army, allies take Idlib air base: Hezbollah media unit", "locations": [], "entities": {"persons": [{"name": "abu al-duhur", "sentiment": "negative"}, {"name": "ellen francis", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "beirut", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hezbollah", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 1:57 PM / Updated 13 minutes ago Syrian army, allies capture Idlib air base: state TV Reuters Staff 3 Min Read \nBEIRUT (Reuters) - Syrian troops and allied forces seized an air base in Idlib province on Saturday, pressing their offensive into the country’s largest insurgent stronghold, state television said. \nThe province in northwest Syria has become a focal point of the war, with government forces taking scores of villages in recent weeks. With the help of Iran-backed militias and Russian air power, they advanced towards Abu al-Duhur military airport, where rebels had ousted the army in 2015. \nSince mid-December, fighting has forced more than 212,000 people to flee their homes in the south of Idlib and nearby parts of Hama and Aleppo provinces, the United Nations says. \nAnkara has warned the attacks will cause a new wave of migration, urging Russia and Iran to rein in the Syrian army offensive in Idlib, which borders Turkey. \nRebels have held Idlib since 2015, and its population has mushroomed with fighters and civilians escaping offensives in other parts of Syria. It has since become the largest single chunk of the country still under the control of factions fighting President Bashar al-Assad’s state. \nTahrir al-Sham, spearheaded by al-Qaeda’s former Syria branch, is now the dominant insurgent force in the province. \nIn a broadcast from outside Abu al-Duhur airport, state TV said the military was searching the base for mines and battling insurgents around it. \nThe Syrian Observatory for Human Rights, a Britain-based war monitor, said the army and allied militia took full control of the airport after heavy air strikes against the insurgents. \nThe troops had stormed the base hours earlier, said a military media unit run by Lebanon’s Hezbollah, which fights alongside the Damascus government. Other pro-government forces seized villages in rural Aleppo, it said. \nThe army offensive has pushed into Idlib along several fronts from rural Hama to the south and from Aleppo province to the east. \nGovernment forces at opposite ends linked up on Saturday, splitting rebel territory in two, the Observatory and the Hezbollah media unit said. The advance besieged militants near the airport in an enclave, part of it under Tahrir al-Sham control and the other in the hands of Islamic State. \nIn recent weeks, Tahrir al-Sham had been simultaneously under attack at the corner of Idlib from Islamic State, which has expanded a small pocket of territory in Hama since the army ousted it from central Syria last year. Reporting by Ellen Francis; Editing by Andrew Bolton", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T21:57:00.000+02:00", "crawled": "2018-01-20T16:07:25.002+02:00", "highlightTitle": ""}