{"organizations": [], "uuid": "62dc1e820bfd971e768df59a576fbd18bb9060c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sitel-group-names-philippe-riveron-chief-ventures-officer.html", "country": "US", "domain_rank": 767, "title": "Sitel Group Names Philippe Riveron Chief Ventures Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "62dc1e820bfd971e768df59a576fbd18bb9060c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sitel-group-names-philippe-riveron-chief-ventures-officer.html", "ord_in_thread": 0, "title": "Sitel Group Names Philippe Riveron Chief Ventures Officer", "locations": [], "entities": {"persons": [{"name": "philippe riveron", "sentiment": "negative"}, {"name": "laurent uberti", "sentiment": "none"}, {"name": "riveron", "sentiment": "none"}, {"name": "groupe acticall", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "sitel group", "sentiment": "negative"}, {"name": "french association for customer relationship management", "sentiment": "none"}, {"name": "ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 23, 2018 /PRNewswire/ -- Sitel Group , a world-leading provider of customer experience solutions, announced the promotion of Philippe Riveron to Chief Ventures Officer (CVO).\n\"Philippe Riveron's depth and breadth of experience as a leader in driving innovation and performance are the attributes we sought to propel the success of our Ventures and to accelerate our plans of expansion,\" said Laurent Uberti, CEO and President, Sitel Group. \"His contributions and achievements as founder and CEO of one of our largest ventures, Learning Tribes, have been invaluable in driving value to our clients and nearly doubling our client base in just four years.\"\nRiveron joined Groupe Acticall (now Sitel Group) in 2007 as Co-Founder and CEO of Learning Tribes. Prior to this position he served as the Head of Customer Experience for a top-tier telecommunications company. He also served as Vice President of the French Association for Customer Relationship Management from 2003 to 2014.\nUnder Riveron's leadership, the Learning Tribes, Sitel Group's international learning and development organization, experienced revenue growth of 133 percent from 2014 to 2017, literally tripling its membership in the period (from 30 to more than 90 in 2017) and expanding its geographical presence into Europe, North America, Brazil and China. Additionally, Riveron has been the driving force behind the innovation of the modern and socially engaged learning initiatives, exemplified by the Learning Tribes' MOOC, \"CX101,\" designed to train and certify job seekers and interested customer experience candidates looking for new career opportunities.\nAs CVO, Riveron is responsible for the coordination and management of Sitel Group's ventures including Learning Tribes, Extens Consulting, Novagile and TSC. In this role, he will accelerate the ventures' transformation within the industry and nurture each of the organizations. Riveron will remain the global CEO of Learning Tribes and also serve as the global CEO of TSC.\n\"This is a pivotal moment for our industry and organization so I feel honored and excited to join the Global Executive Team as Chief Ventures Officer,\" said Riveron. \"I firmly believe we will continue to surpass our goals of innovation and growth while differentiating ourselves internationally through our shared commitment of driving customer-centric results.\"\nAbout Sitel Group\nSitel Group is one of the largest customer experience companies in the world. The group is comprised of industry-leading firms providing business process outsourcing, digital marketing, training and talent management, technology and innovation, consulting and analytics solutions.\nWith subsidiaries such as Sitel, TSC, Learning Tribes, Extens Consulting, Sitel Insights and Novagile, the group's services are leveraged across geographies, verticals and all stages of the end-to-end customer journey, helping clients effectively harness the industry's explosive digital transformation and consistently deliver outstanding customer experiences.\nWith over 30 years of industry-leading experience, Sitel Group's 75,000 associates service over 400 clients – Fortune Global 500 companies as well as local businesses – through its network of more than 150 offices in 25 countries.\nFor more information, visit www.sitel.com\nFollow us: Twitter , LinkedIn and YouTube\nContact:\nShevaun Betzler\n1-617-779-1886\nsbetzler@shiftcomm.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sitel-group-names-philippe-riveron-chief-ventures-officer-300586077.html\nSOURCE Sitel Group", "external_links": ["https://twitter.com/Sitel_WorldWide", "https://www.youtube.com/user/ActicallGroupe", "http://www.prnewswire.com/news-releases/sitel-group-names-philippe-riveron-chief-ventures-officer-300586077.html", "http://www.sitel.com/", "https://www.linkedin.com/company/3095/"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:48:17.036+02:00", "highlightTitle": ""}