{"organizations": [], "uuid": "d1f49edbb9c6a6d564ab0d3e7e0b0f92885b4d26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225126231&w=1200&r=LYNXMPEE0O0RH", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-preview/real-visit-valencia-with-pressure-mounting-on-zidane-idUKKBN1FE1HE", "country": "US", "domain_rank": 408, "title": "Real visit Valencia with pressure mounting on Zidane", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:48:00.000+02:00", "replies_count": 0, "uuid": "d1f49edbb9c6a6d564ab0d3e7e0b0f92885b4d26"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-preview/real-visit-valencia-with-pressure-mounting-on-zidane-idUKKBN1FE1HE", "ord_in_thread": 0, "title": "Real visit Valencia with pressure mounting on Zidane", "locations": [], "entities": {"persons": [{"name": "zinedine zidane", "sentiment": "none"}, {"name": "zidane", "sentiment": "none"}, {"name": "joseph cassinelli", "sentiment": "none"}, {"name": "villarreal", "sentiment": "none"}], "locations": [{"name": "valencia", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "mestalla", "sentiment": "none"}, {"name": "leganes", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "zidane", "sentiment": "none"}], "organizations": [{"name": "paris st germain", "sentiment": "none"}, {"name": "min read  madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 11:52 AM / Updated 7 hours ago Real visit Valencia with pressure mounting on Zidane Joseph Cassinelli 3 Min Read \nMADRID (Reuters) - Real Madrid visit third-placed Valencia on Saturday in the middle of a deepening crisis with pressure mounting on coach Zinedine Zidane following their King’s Cup elimination at the hands of local rivals Leganes. \nReal’s dismal start to the season has left them fourth in La Liga, 19 points behind table-toppers Barcelona and five adrift of Saturday’s opponents. \nThe Liga and European champions face a battle just to secure Champions League football next season with Villarreal just one point behind them in fifth. \nWith the daunting prospect of facing Paris St Germain in the Champions League next month, Zidane is coming under intense scrutiny after a run in which Real have won just two of their last six games in all competitions. \nThey have not won at Valencia’s imposing Mestalla stadium since 2013 and the Frenchman says he needs to find an answer to their current woes. \n“I’m responsible for this, I’m the boss,” said Zidane. “I have to find the solutions; we’ve found some of them but not consistently enough. I need to take responsibility and I’ll always fight. \n“What matters is that we think positively. It’s a blow to take, a fiasco, but 2018 is not over yet. We need to bounce back. We’ve got a big game on Saturday and on Feb. 14 another (against PSG).” Soccer Football - Real Madrid Training - Ciudad Real Madrid, Madrid, Spain - December 22, 2017 Real Madrid coach Zinedine Zidane during training REUTERS/Sergio Perez/File Photo \nValencia made it through to the semi-finals of the Cup on Wednesday following a nervy penalty shootout win over Alaves. They will, however, be without injured defender Gabriel Paulista for Saturday’s game. \nBarcelona host Alaves on Sunday with an 11-point buffer between themselves and second-placed Atletico Madrid. \nClub-record signing Philippe Coutinho could make his debut for the Catalans after recovering from a hamstring problem. \nCoach Ernesto Valverde, however, said fellow new arrival Yerry Mina may have to bide his time, despite centre back Thomas Vermaelen’s injury and the departure of Javier Mascherano. \n“Mina’s never played a game for us. He is here to help, but we’ll see if he’s in the squad. He needs to adapt to us,” Valverde said. \n“When results go well it makes everything much easier, especially at clubs such as ours that always want to win. Everyone’s pushing in the same direction.” \nAtletico Madrid will look to put pressure on Barca when Las Palmas visit the Spanish capital earlier on Sunday. The other standout fixture of the weekend sees Athletic Bilbao and Eibar face off in a Basque derby on Friday. Editing by Toby Davis", "external_links": [], "published": "2018-01-25T13:48:00.000+02:00", "crawled": "2018-01-25T14:11:14.003+02:00", "highlightTitle": ""}