{"organizations": [], "uuid": "66eeee3c720ecb109736b0512465c1ed6ba55bfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220946657&w=1200&r=LYNXMPEE091JK", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-fertility-ivf/thawed-fresh-embryos-work-equally-well-in-many-women-idUSKBN1EZ2VN", "country": "US", "domain_rank": 408, "title": "Thawed, fresh embryos work equally well in many women", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:09:00.000+02:00", "replies_count": 0, "uuid": "66eeee3c720ecb109736b0512465c1ed6ba55bfd"}, "author": "", "url": "https://www.reuters.com/article/us-health-fertility-ivf/thawed-fresh-embryos-work-equally-well-in-many-women-idUSKBN1EZ2VN", "ord_in_thread": 0, "title": "Thawed, fresh embryos work equally well in many women", "locations": [], "entities": {"persons": [{"name": "lan vuong", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "gene emery", "sentiment": "none"}, {"name": "new england journal of medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - - Women with infertility unrelated to a common hormonal disorder may have more options when they try in-vitro fertilization, two large new studies show.\nWhereas in women with polycystic ovary syndrome (PCOS), freezing and thawing embryos before implantation offers a better chance of pregnancy and birth, in women without this condition thawed embryos and are no better or worse than fresh embryos, researchers in China and Vietnam have found.\nThe findings may encourage doctors to just implant one embryo at a time, lowering the risks that come when doctors try to implant more, producing multiple births and their associated complications.\nThe papers, published in The New England Journal of Medicine, are “good news for women seeking in-vitro fertilization,” said Dr. Lan Vuong, chief author of the Vietnamese study.\nAfter an earlier study by the Chinese team showed that frozen embryos were better for women with PCOS, “a lot of people jumped to the conclusion that we should always do frozen. Some programs around the country won’t do fresh transfers anymore,” said Dr. Christos Coutifaris of the University of Pennsylvania’s Perelman School of Medicine in Philadelphia, who was not connected with the new research.\n“Now these two papers, equally large and done in non-PCOS patients, show that in terms of live birth, which is what we care about, there is no difference,” he told Reuters Health by phone. “So to apply the rule to everybody that we should freeze your embryos is probably not correct.”\nDr. Vuong said that in the past, doctors have often implanted more than one fresh embryo in women because of concerns that a frozen transfer may not work as well.\nThe fact that thawed embryos “produce the same pregnancy rate with less complications should transform the way in-vitro fertilization is practiced,” she told Reuters Health by email. “After the first fresh embryo transfer, it will be possible to freeze the remaining embryos and transfer them one by one, if necessary, without reducing the chance of pregnancy.”\nDr. Vuong, of the University of Medicine and Pharmacy at Ho Chi Minh City, and her colleagues also found that women with high levels of the female hormone progesterone might be better off receiving a thawed frozen embryo.\nDr. Coutifaris, who is president of the American Society for Reproductive Medicine, said a higher progesterone level may indicate that the development of the embryo and the womb are out of synch, and using a thawed embryo allows for better timing of the implantation.\nIt’s one example where “the challenge for us, as practitioners, is to determine who are the patients who will benefit from a freeze-only approach,” he said.\nIn the Chinese study of 2,157 women undergoing their first in-vitro fertilization cycle, the birth rate was 48.7 percent with thawed embryos and 50.2 percent with fresh. Doctors typically implanted two embryos per attempt.\nIn the Vietnam study of 782 women undergoing their first or second attempt, the live birth rates after the first transfer were 33.8 percent with frozen and 31.5 percent for fresh. They also implanted, on average, two at a time.\nIn both studies, the difference in birth rates between the groups was so small that it might have been due to chance.\nNeither study found a higher risk of neonatal or obstetrical complications in either group, although frozen embryo transfer produced a statistically lower risk of over-stimulated ovaries, which leads to swollen and painful ovaries and is potentially dangerous.\nThe rates of the syndrome in the Chinese study were 0.6 percent with frozen embryos and 2.0 percent with fresh. The senior author was Dr. Zi-Jiang Chen of Shandong University, who did not respond to emailed questions.\nIt was the Chen group that, in 2016, reported that frozen-then-thawed embryos offered a 7-percentage-point edge when it came to producing live births among infertile women with polycystic ovary syndrome: 49 percent versus 42 percent. The improvement came primarily from a lower rate of pregnancy loss.\n“The cost for freezing embryos is about 30 percent more than that for fresh transfer,” said Dr. Vuong. “However, the effectiveness of the treatment should be considered in decisions about which approach is more cost-effective. We have done a cost-effectiveness analysis of the two treatments and found that freezing embryos and subsequent transfer is not cost-effective over fresh transfer.”\nSOURCES: bit.ly/2m2bPYw and bit.ly/2CxHmro The New England Journal of Medicine, online January 10, 2018.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T00:09:00.000+02:00", "crawled": "2018-01-11T00:37:59.008+02:00", "highlightTitle": ""}