{"organizations": [], "uuid": "730d97d41ed2a90ab502d5da9aefc1e19901af42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/19/103402894-IMG_9036r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/30/copyright-board-ruffles-aa-by-rejecting-logo-copyright-again.html", "country": "US", "domain_rank": 767, "title": "Copyright board ruffles AA by rejecting logo copyright again", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:37:00.000+02:00", "replies_count": 0, "uuid": "730d97d41ed2a90ab502d5da9aefc1e19901af42"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/copyright-board-ruffles-aa-by-rejecting-logo-copyright-again.html", "ord_in_thread": 0, "title": "Copyright board ruffles AA by rejecting logo copyright again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even after a go-around, American Airlines couldn't clear the relatively low threshold to copyright its logo adopted in 2013, the U.S. Copyright Office's review board has ruled.\n\"A mere simplistic arrangement of non-protectable elements does not demonstrate the level of creativity necessary to warrant protection,\" Catherine Zaller Rowland, senior adviser to the register of copyrights, said in a five-page explanation called \"the final decision in this matter.\"\nThe airline already has the image trademarked, to prevent another U.S. carrier or tourism entity from using the image in its marketing. But a copyright would have offered longer and broader protection internationally, if it were approved.\n\"We have reviewed the copyright office's decision and are working to determine our next steps,\" airline spokesman Matt Miller said.\nThe logo looks like a white eagle's head poking through a diagonal swoosh with blue on top and red on the bottom. The carrier adopted the image after combining with U.S. Airways to become the world's largest airline.\nAmerican filed an application June 3, 2016, to register the logo. But a registration specialist refused the registration in a letter Oct. 4, 2016, by finding it \"lacks the authorship necessary to support a copyright claim.\"\nAmerican disputed that finding and requested a reconsideration in a letter Dec. 20, 2016. The airline argued that the logo \"far exceeds the extremely low level of creativity required to sustain a copyright claim,\" according to the letter from Andrew Avsec, an intellectual-property lawyer with Brinks Gilson & Lione.\nHe described the logo as having the trapezoidal shapes above and below the eagle's head representing its wings, with flared edges. The shape is also meant to represent one leg of a capital A, to suggest an eagle in flight.\nBut after re-evaluating the request, the office again rejected it by concluding it \"does not contain a sufficient amount of original and creative artistic or graphic authorship to support a copyright registration,\" according to an April 12, 2017, letter from Stephanie Mason, an attorney-advisor.\nAmerican then filed a second request the same day as the rejection, with Avsec suggesting there was \"significant modification\" of the \"underlying geometric shapes.\"\nThe airline argued that courts have issued decisions to protect geometric or common shapes that \"transform them beyond their character.\"\nBut the copyright board's decision Jan. 8 repeated a longstanding requirement set forth in the Copyright Act that prohibit registration for \"familiar symbols or designs; (and) mere variations of typographic ornamentation, lettering or coloring.\"\n\"Further, use of the colors of the United States flag (red, white, and blue) are exceedingly common and do not lend themselves to arguments that the work's design choices were especially creative,\" Rowland wrote. \"In any event, even if a bird motif were unusual in this context, the work falls below the threshold for creativity required by the Copyright Act.\"\nRead more from USA Today:\n'Glee' actor Mark Salling, who pleaded guilty to child porn, found dead \nRare manufacturing flaw sparked fiery American Airlines engine failure \nHey, Elon Musk: This Arizona company says it has a better flamethrower", "external_links": [], "published": "2018-01-31T00:37:00.000+02:00", "crawled": "2018-01-31T01:11:05.011+02:00", "highlightTitle": ""}