{"organizations": [], "uuid": "8b35f18a6864fdc072b9d5c0bd2bf716b9f33bad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221301042&w=1200&r=LYNXMPEE0B03L", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported-idUSKBN1F1057", "country": "US", "domain_rank": 408, "title": "Oil dips away from levels last seen in late 2014, but analysts say market supported", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.958, "site_type": "news", "published": "2018-01-12T09:33:00.000+02:00", "replies_count": 0, "uuid": "8b35f18a6864fdc072b9d5c0bd2bf716b9f33bad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-dips-away-from-levels-last-seen-in-late-2014-but-analysts-say-market-supported-idUSKBN1F1057", "ord_in_thread": 0, "title": "Oil dips away from levels last seen in late 2014, but analysts say market supported", "locations": [], "entities": {"persons": [{"name": "sanjeev bahl", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "edison investment research", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:33 AM / Updated an hour ago Oil retreats from $70 highs but set for fourth week of gains Ahmad Ghaddar 3 Min Read \nLONDON (Reuters) - Oil prices eased on Friday after hitting a three-year high of more than $70 a barrel the previous day, but they remained on track to post a fourth straight week of gains. \nBrent crude futures LCOc1 traded 6 cents lower at $69.20 a barrel at 1449 GMT. The contract broke above $70 on Thursday for the first time since December 2014. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 were at $63.66, down 14 cents. WTI the day before rose to its strongest since late 2014 at $64.77. \n“It is remarkable to see that most market analysts believe that prices have rallied too far since consensus forecasts are significantly lower than the current spot prices,” Hans van Cleef, senior energy economist at ABN Amro, said in a note. \n“On the other hand, most investors are still positioned to benefit from further price gains,” he said. \nAnalysts and traders have warned about the risk of a price correction since the start of 2018, but they say overall market conditions remain strong, mainly due to output cuts led by the Organization of the Petroleum Exporting Countries and Russia. \nFatih Birol, head of the Paris-based International Energy Agency, said on Friday that oil prices at $65 to $70 risked encouraging more oversupply from U.S. shale drillers. \nGulf OPEC producers plan to keep their oil output in the current quarter below the year-earlier level despite strong demand growth and a drop in global inventories, a senior OPEC source familiar with Gulf oil thinking said. \nIn addition to the OPEC and non-OPEC production cuts of 1.8 million barrels per day (bpd) that are due to last until the end of 2018, oil prices have found support from eight consecutive weeks of U.S. crude inventory drops. \nU.S. commercial crude stocks C-STK-T-EIA fell by almost 5 million barrels in the week to Jan. 5, to 419.5 million barrels. That was slightly below the five-year average of just over 420 million barrels, the target for OPEC and others cutting output. \nRelatively weak Chinese December oil data weighed on prices, traders and analysts said. China’s crude imports in December fell 9 percent month-on-month to 33.7 million tonnes, or 7.97 million bpd, customs data showed. \nThis has contributed to a fall in Singapore refinery profit margins DUB-SIN-REF to below $6 per barrel this month, their lowest seasonal level in five years, leading some refiners to scale down crude runs. Additional reporting by Henning Gloystein in Singapore; Editing by Dale Hudson and Edmund Blair", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T09:33:00.000+02:00", "crawled": "2018-01-12T04:46:50.014+02:00", "highlightTitle": ""}