{"organizations": [], "uuid": "bdee1720946bcee475c05648c725a36e7d0144ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/exchange-traded-funds", "section_title": "Exchange-Traded Funds | Reuters.com", "url": "https://www.reuters.com/article/us-flow-traders-volatility/dutch-high-frequency-trader-drifts-in-becalmed-markets-idUSKBN1EC1JH", "country": "US", "domain_rank": 408, "title": "Dutch high-frequency trader drifts in becalmed markets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.05, "site_type": "news", "published": "2017-12-18T20:49:00.000+02:00", "replies_count": 0, "uuid": "bdee1720946bcee475c05648c725a36e7d0144ac"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-flow-traders-volatility/dutch-high-frequency-trader-drifts-in-becalmed-markets-idUSKBN1EC1JH", "ord_in_thread": 0, "title": "Dutch high-frequency trader drifts in becalmed markets", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "eastern docklands", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - This year’s unusually quiet markets may have soothed the nerves of many investors, but for Dutch market-maker Flow Traders ( FLOW.AS ) the lack of volatility spells bad news.\nThe trading house, based in the fashionable Eastern Docklands area of Amsterdam, sold shares to the public in 2015 after honing a form of high-frequency trading of Exchange Traded Funds (ETFs) and their underlying stocks in Europe and elsewhere. Bigger market gyrations meant bigger profits, the company says.\nBut stock indices across the world have calmly hit multi-year highs in 2017, with little of the volatility that has characterised previous rallies. The Euro Stoxx Volatility index .V2TX and the VIX index .VIX tracking volatility in U.S. stocks are both near all-time lows.\nShares in Flow Traders have fallen 38 percent year-to-date to an all-time low as its profits were depressed by a lack of market activity.\n(Graphic: Flow Traders' share price has tracked volatility lower - reut.rs/2kwTZeo )\nSeveral analysts have cut their earnings expectations for the company in recent months, and are questioning whether the continued lack of market volatility will hurt business even more.\nUBS, Credit Suisse and Morgan Stanley all downgraded the stock in September and October, no longer recommending its clients buy the shares.\n“With equity market volatility at decade-low levels, and little sign of recovery in the near future, Flow Traders’ revenues will remain depressed due to lower ETF trading activity,” UBS analyst Michael Werner said in a note.\nInvestors too, have turned more cautious.\n“At the time it was a reasonably attractive opportunity (to play) the rise of the ETF,” said Will James, a fund manager at Standard Life Investments who sold his holding in Flow Traders in June.\n“When the investment case doesn’t come through or is proved to be wrong then we are quite happy to take a view we got it wrong and move on.”\nFlow Traders, which has annual revenue of around 350 million euros ($410 million) and some 300 employees, is confident volatility will pick up in 2018 and it can maintain its dominant position in Europe, where it accounts for around 20 percent of ETF trading.\n“Periods of relative quietness give us time to work on our business model more,” Chief Financial Officer Marcel Jongmans told Reuters. “What we have shown during the last few quarters is that we grow our market share.”\nBut it will take more than a spike in volatility to regain favor, Werner said: “We think earnings will have to improve before investors regain interest.”\nReporting by Alasdair Pal; Editing by Tom Pfeiffer and Alison Williams\n ", "external_links": ["http://reut.rs/2kwTZeo", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2017-12-18T20:49:00.000+02:00", "crawled": "2018-01-03T06:42:54.035+02:00", "highlightTitle": ""}