{"organizations": [], "uuid": "e8c02bdada2436fb1eb9b2c3c82650c69422dd20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amdocs-limited-reports-first-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Amdocs Limited Reports First Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-31T00:25:00.000+02:00", "replies_count": 0, "uuid": "e8c02bdada2436fb1eb9b2c3c82650c69422dd20"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-amdocs-limited-reports-first-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Amdocs Limited Reports First Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reiterates Fiscal 2018 GAAP Diluted EPS Growth Outlook of 3.0%-9.0% and Non-GAAP Diluted EPS Growth Outlook of 4.0%-8.0% YoY\nSigns Definitive Agreement to Acquire Vubiquity for $224M\nFirst Quarter Fiscal 2018 Highlights\nSigned definitive agreement on January 30, 2018, to acquire Vubiquity for approximately $224 million in cash, subject to customary closing conditions. The Boards of Directors of Vubiquity and Amdocs have approved the all-cash transaction which, subject to the satisfaction of the conditions to closing, is expected to be completed by the end of the second quarter of fiscal 2018 Revenue of $978 million, at the midpoint of the $960-$1,000 million guidance range adjusting for the negative impact from foreign currency movements of approximately $2 million relative to the fourth quarter of fiscal 2017 GAAP diluted EPS of $0.80, above the $0.66-$0.74 guidance range including the benefit of a lower GAAP effective tax rate Non-GAAP diluted EPS of $1.06, above the $0.94-$1.00 guidance range including the benefit of a lower non-GAAP effective tax rate GAAP operating income of $122 million; GAAP operating margin of 12.5% Non-GAAP operating income of $169 million; non-GAAP operating margin of 17.3% Free cash flow of $113 million, comprised of cash flow from operations of $165 million, less $52 million in net capital expenditures and other Twelve-month backlog of $3.26 billion, up $10 million sequentially The board of directors approved a quarterly cash dividend at the new increased rate of $0.25 per share, as approved at the January 2018 annual general meeting of shareholders, to be paid on April 20, 2018\nST. LOUIS, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Amdocs Limited (NASDAQ:DOX) today reported operating results for the three months ended December 31, 2017.\n“We are pleased with our progress in Q1 during which we sustained a high win rate to deliver another quarter of record 12-month backlog. Among the highlights, we strengthened our position in the North American Pay TV market with a new award at Rogers Communications, while in Europe we were selected for digital modernization projects at Mtel in Bulgaria and Altice SFR in France. Our second quarter has also started strong with last week’s announcement that PLDT and its Philippines’ wireless subsidiary, Smart Communications, have selected Amdocs for a seven-year, $300 million managed transformation project that will integrate our artificial intelligence, machine learning and other advanced technologies,” said Eli Gelman, president and chief executive officer of Amdocs Management Limited.\nGelman continued, “Investing in the growth engines of tomorrow is a core discipline of Amdocs and we see considerable opportunity resulting from the increased convergence of communications with media and entertainment. To further expand our capabilities in this area, we today signed a definitive agreement to acquire Vubiquity, a leading provider of premium content services and technology solutions, for $224 million in cash. Based in Los Angeles, Vubiquity connects content owners like Time Warner and Disney, distributors like Comcast and Sky and OTT providers like Netflix and Amazon to deliver entertainment across platforms on a global scale. Accordingly, we believe this move uniquely positions Amdocs to deliver a set of comprehensive content solutions that combine Vubiquity’s expertise with our monetization, analytics and personalized customer experience capabilities.”\nGelman concluded, “The visibility provided by our work in backlog and recent wins leaves us on-track for a stronger fiscal second half, although we are of course monitoring the many moving parts that may affect our outlook. Additionally, we remain committed to the proactive and disciplined allocation of free cash flow as a mechanism to enhance the expected returns for our shareholders and we are well placed to deliver full year diluted non-GAAP earnings per share growth of 4% to 8% in fiscal 2018.”\nRevenue\nRevenue for the first fiscal quarter ended December 31, 2017 was $977.7 million, down 0.2% or $2 million sequentially from the fourth fiscal quarter of 2017 and up 2.4% as compared to last year’s first fiscal quarter. Revenue for the first fiscal quarter of 2018 includes a negative impact from foreign currency movements of approximately $2 million relative to the fourth quarter of fiscal 2017. Revenue was at the midpoint of Amdocs’ guidance, adjusting for the negative impact of foreign currency movements.\nNet Income and Earnings Per Share\nThe Company's GAAP net income for the first quarter of fiscal 2018 was $116.9 million, or $0.80 per diluted share, compared to GAAP net income of $97.8 million, or $0.66 per diluted share, in the prior fiscal year’s first quarter. Net income on a non-GAAP basis was $154.5 million, or $1.06 per diluted share, compared to non-GAAP net income of $133.6 million, or $0.9 per diluted share, in the first quarter of fiscal 2017.\nReturning Cash to Shareholders\nQuarterly Cash Dividend Program: On January 30, 2018, the Board approved the Company’s next quarterly cash dividend payment at the new rate of $0.25 per share and set March 30, 2018 as the record date for determining the shareholders entitled to receive the dividend, which will be payable on April 20, 2018. Share Repurchase Activity: Repurchased $120 million of ordinary shares during the first quarter of fiscal 2018.\nTwelve-month Backlog\nTwelve-month backlog, which includes anticipated revenue related to contracts, estimated revenue from managed services contracts, letters of intent, maintenance and estimated on-going support activities, was $3.26 billion at the end of the first quarter of fiscal 2018, up $10 million from the end of the prior quarter.\nSecond Quarter Fiscal 2018 Outlook\nRevenue of approximately $960-$1,000 million, including an immaterial sequential impact from foreign currency fluctuations as compared to the first quarter of fiscal 2018. Second quarter fiscal 2018 guidance does not incorporate any contribution from the acquisition of Vubiquity Diluted GAAP EPS of approximately $0.65-$0.73 Diluted non-GAAP EPS of approximately $0.91-$0.97, excluding amortization of purchased intangible assets and other acquisition-related costs and approximately $0.05-$0.07 per share of equity-based compensation expense, net of related tax effects. Expected non-GAAP effective tax rate to be above the high-end of the annual target range of 13%-17% in the second quarter fiscal 2018\nFull Year Fiscal 2018 Outlook\nReiterates revenue growth of 0.0%-4.0% year-over-year as reported and (1.0%)-3.0% year-over-year on a constant currency basis. Full year fiscal 2018 revenue guidance does not incorporate any contribution from the acquisition of Vubiquity Reiterates GAAP diluted earnings per share growth of roughly 3.0%-9.0% year-over-year Reiterates Non-GAAP diluted earnings per share growth of roughly 4.0%-8.0% year-over-year, excluding amortization of purchased intangible assets and other acquisition-related costs and approximately $0.25-$0.29 per share of equity-based compensation expense, net of related tax effects. Expected non-GAAP effective tax rate to remain within the same target range of 13%-17% for the full year fiscal 2018 The impact of the acquisition of Vubiquity on Amdocs’ diluted non-GAAP earnings per share is expected to be neutral in fiscal year 2018, and accretive thereafter. The impact on diluted GAAP EPS will not be known until after Amdocs completes the purchase price allocation. Amdocs expects to incur acquisition-related expenses related to operating adjustments, restructuring charges and other acquisition-related costs\nOur second fiscal quarter 2018 and full year fiscal 2018 outlook takes into consideration the company’s expectations regarding macro and industry specific risks and various uncertainties and certain assumptions that we will discuss on our earnings conference call. However, Amdocs notes market dynamics continue to shift rapidly and that it cannot predict all possible outcomes, including those resulting from AT&T’s proposed merger with Time Warner, or from other current and potential customer consolidation activity in North America.\nConference Call Details\nAmdocs will host a conference call on January 30, 2018 at 5:00 p.m. Eastern Time to discuss the Company's first quarter of fiscal 2018 results. To participate, please dial +1 (844) 513-7152, or +1 (508) 637-5600 outside the United States, approximately 15 minutes before the call and enter passcode 7787959. The call will also be carried live on the Internet via the Amdocs website, www.amdocs.com .\nNon-GAAP Financial Measures\nThis release includes non-GAAP diluted earnings per share and other non-GAAP financial measures, including free cash flow, non-GAAP cost of revenue, non-GAAP research and development, non-GAAP selling, general and administrative, non-GAAP operating income, non-GAAP operating margin, non-GAAP income taxes, non-GAAP effective tax rate, non-GAAP net income and non-GAAP diluted earnings per share growth. These non-GAAP measures exclude the following items:\namortization of purchased intangible assets and other acquisition-related costs; changes in fair value of certain acquisition-related liabilities; equity-based compensation expense; tax effects related to the above; and one-time benefit relating to the new U.S. tax legislation.\nThese non-GAAP financial measures are not in accordance with, or an alternative for, generally accepted accounting principles and may be different from non-GAAP financial measures used by other companies. In addition, these non-GAAP financial measures are not based on any comprehensive set of accounting rules or principles. Amdocs believes that non-GAAP financial measures have limitations in that they do not reflect all of the amounts associated with Amdocs’ results of operations as determined in accordance with GAAP and that these measures should only be used to evaluate Amdocs’ results of operations in conjunction with the corresponding GAAP measures.\nAmdocs believes that the presentation of non-GAAP diluted earnings per share and other financial measures, including free cash flow, non-GAAP cost of revenue, non-GAAP research and development, non-GAAP selling, general and administrative, non-GAAP operating income, non-GAAP operating margin, non-GAAP income taxes, non-GAAP effective tax rate, non-GAAP net income and non-GAAP diluted earnings per share growth when shown in conjunction with the corresponding GAAP measures, provides useful information to investors and management regarding financial and business trends relating to its financial condition and results of operations, as well as the net amount of cash generated by its business operations after taking into account capital spending required to maintain or expand the business.\nFor its internal budgeting process and in monitoring the results of the business, Amdocs’ management uses financial statements that do not include amortization of purchased intangible assets and other acquisition-related costs, changes in fair value of certain acquisition-related liabilities, equity-based compensation expense and related tax effects. Amdocs’ management also uses the foregoing non-GAAP financial measures, in addition to the corresponding GAAP measures, in reviewing the financial results of Amdocs. In addition, Amdocs believes that significant groups of investors exclude these items in reviewing its results and those of its competitors, because the amounts of the items between companies can vary greatly depending on the assumptions used by an individual company in determining the amounts of the items.\nAmdocs further believes that, where the adjustments used in calculating non-GAAP diluted earnings per share are based on specific, identified amounts that impact different line items in the Consolidated Statements of Income (including cost of revenue, research and development, selling, general and administrative, operating income, income taxes and net income), it is useful to investors to understand how these specific line items in the Consolidated Statements of Income are affected by these adjustments. Please refer to the Reconciliation of Selected Financial Metrics from GAAP to Non-GAAP tables below.\nSupporting Resources\nKeep up with Amdocs news by visiting the company’s website Subscribe to Amdocs’ RSS Feed and follow us on Twitter , Facebook , LinkedIn and YouTube\nAbout Amdocs\nAmdocs is a leading software and services provider to the world’s most successful communications and media companies. As our customers reinvent themselves, we enable their digital and network transformation through innovative solutions, delivery expertise and intelligent operations. Amdocs and its 25,000 employees serve customers in over 85 countries. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $3.9 billion in fiscal 2017.\nFor more information, visit Amdocs at www.amdocs.com .\nThis press release includes information that constitutes made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995, including statements about Amdocs’ growth and business results in future quarters. Although we believe the expectations reflected in such are based upon reasonable assumptions, we can give no assurance that our expectations will be obtained or that any deviations will not be material. Such statements involve risks and uncertainties that may cause future results to differ from those anticipated. These risks to, the effects of general economic conditions, Amdocs’ ability to grow in the business markets that it serves, Amdocs’ ability to successfully integrate acquired businesses, adverse effects of market competition, rapid technological shifts that may render the company's products and services obsolete, potential loss of a major customer, our ability to develop long-term relationships with our customers, and risks associated with operating businesses in the international market. Amdocs may elect to update these at some point in the future; however, Amdocs specifically disclaims any obligation to do so. These and other risks are discussed at greater length in Amdocs’ filings with the Securities and Exchange Commission, including in our Annual Report on Form 20-F for the fiscal year ended September 30, 2017 filed on December 11, 2017.\nContact :\nMatthew Smith\nHead of Investor Relations\nAmdocs\n314-212-8328\nE-mail: dox_info@amdocs.com\nAMDOCS LIMITED Consolidated Statements of Income (In thousands, except per share data) Three months ended December 31, 2017 201 6 Revenue $ 977,711 $ 954,727 Operating expenses: Cost of revenue 643,197 620,834 Research and development 68,177 59,990 Selling, general and administrative 118,668 124,079 Amortization of purchased intangible assets and other 25,526 28,231 855,568 833,134 Operating income 122,143 121,593 Interest and other income (expense), net 121 (2,763 ) Income before income taxes 122,264 118,830 Income taxes 5,391 21,037 Net income $ 116,873 $ 97,793 Basic earnings per share $ 0.81 $ 0.67 Diluted earnings per share $ 0.80 $ 0.66 Basic weighted average number of shares outstanding 143,915 146,817 Diluted weighted average number of shares outstanding 145,346 148,382 Cash dividends declared per share $ 0.220 $ 0.195\nAMDOCS LIMITED Selected Financial Metrics (In thousands, except per share data) Three months ended December 31,\n2017 2016 Revenue $ 977,711 $ 954,727 Non-GAAP operating income 169,064 164,085 Non-GAAP net income 154,466 133,567 Non-GAAP diluted earnings per share $ 1.06 $ 0.90 Diluted weighted average number of shares outstanding 145,346 148,382\nAMDOCS LIMITED Reconciliation of Selected Financial Metrics from GAAP to Non-GAAP (In thousands) Three months ended\nDecember 31, 2017 Reconciliation items GAAP Amortization of\npurchased\nintangible assets\nand other Equity based\ncompensation\nexpense Changes in fair\nvalue of certain\nacquisition-\nrelated liabilities Tax effect One-time\ntax benefit\nrelating to\nthe new\nU.S. tax\nlegislation Non-GAAP Operating expenses: Cost of revenue $ 643,197 $ - $ (4,698 ) $ (7,890 ) $ - $ 630,609 Research and development 68,177 - (824 ) - - 67,353 Selling, general and administrative 118,668 - (7,983 ) - - 110,685 Amortization of purchased intangible assets and other 25,526 (25,526 ) - - - - Total operating expenses 855,568 (25,526 ) (13,505 ) (7,890 ) - 808,647 Operating income 122,143 25,526 13,505 7,890 - 169,064 Income taxes 5,391 - - - 6,078 3,250 14,719 Net income $ 116,873 $ 25,526 $ 13,505 $ 7,890 (6,078) $ (3,250 ) $ 154,466\nThree months ended\nDecember 31, 2016\nReconciliation items\nGAAP Amortization of\npurchased\nintangible assets\nand other Equity based\ncompensation\nexpense Tax effect Non-GAAP Operating expenses: Cost of revenue $ 620,834 $ - $ (4,998 ) $ - $ 615,836 Research and development 59,990 - (899 ) - 59,091 Selling, general and administrative 124,079 - (8,364 ) - 115,715 Amortization of purchased intangible assets and other 28,231 (28,231 ) - - - Total operating expenses 833,134 (28,231 ) (14,261 ) - 790,642 Operating income 121,593 28,231 14,261 - 164,085 Income taxes 21,037 - - 6,718 27,755 Net income $ 97,793 $ 28,231 $ 14,261 $ (6,718 ) $ 133,567\nAMDOCS LIMITED Condensed Consolidated Balance Sheets (In thousands) As of December 31,\n2017 September 30,\n2017 ASSETS Current assets Cash, cash equivalents and short-term interest-bearing investments $ 965,938 $ 979,608 Accounts receivable, net, including unbilled of $238,304 and $229,695, respectively 919,937 865,068 Prepaid expenses and other current assets 207,288 203,810 Total current assets 2,093,163 2,048,486 Property and equipment, net 364,937 355,685 Goodwill and other intangible assets, net 2,486,885 2,398,535 Other noncurrent assets 456,884 476,674 Total assets $ 5,401,869 $ 5,279,380 LIABILITIES AND SHAREHOLDERS’ EQUITY Current liabilities Accounts payable, accruals and other $ 1,114,260 $ 1,059,855 Deferred revenue 107,436 113,091 Total current liabilities 1,221,696 1,172,946 Other noncurrent liabilities 552,281 532,364 Total Amdocs Limited Shareholders’ equity 3,589,769 3,574,070 Noncontrolling interests 38,123 - Total Shareholders’ equity 3,627,892 3,574,070 Total liabilities and shareholders’ equity $ 5,401,869 $ 5,279,380\nAMDOCS LIMITED Consolidated Statements of Cash Flows (In thousands) Three months ended December 31, 2017 2016 Cash Flow from Operating Activities: Net income $ 116,873 $ 97,793 Reconciliation of net income to net cash provided by operating activities: Depreciation and amortization 49,237 57,552 Equity-based compensation expense 13,505 14,261 Deferred income taxes (9,245 ) 7,355 Excess tax benefit from equity-based compensation (*) - (912 ) Gain from short-term interest-bearing investments (142 ) (194 ) Net changes in operating assets and liabilities, net of amounts acquired: Accounts receivable (68,797 ) (42,555 ) Prepaid expenses and other current assets 2,067 (1,969 ) Other noncurrent assets (4,804 ) (22,774 ) Accounts payable, accrued expenses and accrued personnel 70,632 68,226 Deferred revenue (2,944 ) (6,913 ) Income taxes payable 598 (1,386 ) Other noncurrent liabilities (2,379 ) (456 ) Net cash provided by operating activities 164,601 168,028 Cash Flow from Investing Activities: Purchases of property and equipment (51,779 ) (41,736 ) Proceeds from sale of short-term interest-bearing investments 56,698 67,140 Purchase of short-term interest-bearing investments (52,648 ) (67,714 ) Net cash paid for acquisitions (53,948 ) - Other 707 3,733 Net cash used in investing activities (100,970 ) (38,577 ) Cash Flow from Financing Activities: Payments under financing arrangements - (200,000 ) Repurchase of shares (119,898 ) (80,219 ) Proceeds from employee stock options exercised 31,053 23,705 Payments of dividends (31,736 ) (28,693 ) Excess tax benefit from equity-based compensation (*) - 912 Proceeds from issuance of shares and loan received related to non-controlling interests 48,123 - Net cash used in financing activities (72,458 ) (284,295 ) Net decrease in cash and cash equivalents (8,827 ) (154,844 ) Cash and cash equivalents at beginning of period 649,611 768,660 Cash and cash equivalents at end of period $ 640,784 $ 613,816", "external_links": ["https://www.globenewswire.com/Tracker?data=IK8wnlFGC0Ep-heDRmRM-KjjKIafkEIzL0kM-5zFFpXgV6j_quZXxKzf1rW3oEZiGvPokVWDYMJeAn2aftLNOQ==", "https://www.globenewswire.com/Tracker?data=eXZ2kv6MijG4j-e3BTnXhKrGqMg7gv420ig_1eVMsX8Yj_V4NhhtwXHCWiHnfTWNdeOR6fFffddtT6t_Pf9afklZwSsdEPRUTgeALK-MHhU=", "http://www.youtube.com/amdocs", "http://www.amdocs.com/Pages/HomePage.aspx", "http://www.linkedin.com/company/amdocs", "http://twitter.com/Amdocs", "http://phx.corporate-ir.net/phoenix.zhtml?c=113915&p=rssSubscription&t=&id=&", "http://www.facebook.com/amdocs/"], "published": "2018-01-31T00:25:00.000+02:00", "crawled": "2018-01-31T02:04:53.010+02:00", "highlightTitle": ""}