{"organizations": [], "uuid": "9e38419dc6e2d7c513e89e823814df9d5e34144d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4374, "shares": 4374, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/15/104712559-GettyImages-667729544-united-airlines.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/26/she-boarded-plane-to-see-dying-mother-then-her-ticket-was-canceled.html", "country": "US", "domain_rank": 767, "title": "She boarded plane to see dying mother. Then her ticket was canceled.", "performance_score": 10, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:32:00.000+02:00", "replies_count": 0, "uuid": "9e38419dc6e2d7c513e89e823814df9d5e34144d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/she-boarded-plane-to-see-dying-mother-then-her-ticket-was-canceled.html", "ord_in_thread": 0, "title": "She boarded plane to see dying mother. Then her ticket was canceled.", "locations": [], "entities": {"persons": [{"name": "carrol amrich", "sentiment": "negative"}, {"name": "amrich", "sentiment": "none"}], "locations": [{"name": "pueblo", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}], "organizations": [{"name": "united airlines", "sentiment": "none"}, {"name": "wynn resorts", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "traveler help desk", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "dealbook", "sentiment": "none"}, {"name": "equifax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In a hospital in Minnesota, Carrol Amrich's mother was dying.\nIn Pueblo, Colo., a thousand miles away, Ms. Amrich was frantically trying to get there in time to say goodbye.\nHolding a United Airlines ticket purchased for her by her landlord, she probably would have. But minutes before departure, already buckled into her seat, she was ordered to leave the plane. The gate agent told her that her reservation had been canceled. Traveler Help Desk, the online agency that sold the ticket, had rescinded it because the landlord made a change directly through United — even though United had assured the landlord that it was not a problem to do so.\nUnable to fly, Ms. Amrich drove through the night, not stopping even to use the bathroom. Her sister, in the hospital room, held a phone to their mother's ear, and Ms. Amrich begged her to hold on.\nShe was still driving when her cellphone rang again. Her mother was dead.\nRead more from The New York Times:\nYou can't fire Equifax, but your employer can. Mine just did.\nWynn Resorts slides on report of sexual misconduct by C.E.O: DealBook briefing\nBBC, criticized over pay gap, cuts salaries of some male journalists\n\"I cried the whole way from Pueblo,\" Ms. Amrich said in a phone interview on Jan. 18, two days after her mother died. \"I've been awake for two days. I haven't had anything to eat in two days.\"\nCarolyn Gallant, customer service supervisor at Traveler Help Desk, confirmed that the agency had voided the ticket after it saw that a change had been made to the reservation. She said that the intention had been to protect Ms. Amrich against possible fraud and that a representative had tried \"numerous times\" to contact Ms. Amrich first.\nBut Ms. Amrich and her landlord, Ines Prelas, said they had heard nothing from the agency before she was removed from the plane.\nThe entire episode unfolded over a few hours on Jan. 16, after Ms. Amrich learned that her mother, Dixie J. Hanson, had been hospitalized. She could not afford a plane ticket, so Ms. Prelas bought one for her, using Traveler Help Desk because it was the cheapest option she could find. At that point, there was no indication that Ms. Amrich's mother was dying, so she chose a flight for the next day.\nBut soon after, Ms. Amrich learned that her mother was in heart failure and was not expected to survive the night. It was around 2:30 p.m., and Ms. Prelas immediately called United and had Ms. Amrich switched onto Flight UA5712, leaving Colorado Springs at 5:15 p.m. That flight would go to Denver, where Ms. Amrich would make a connection to Minneapolis. Ms. Prelas showed The New York Times confirmation emails and a photo of Ms. Amrich's boarding pass.\nShe rushed Ms. Amrich to the airport, about an hour's drive from Pueblo. Ms. Amrich checked in: no problem. Her boarding pass was scanned at the gate: no problem. She took her seat. She buckled her seatbelt.\nMinutes later, the gate agent came on board to remove her.\nWhen Ms. Amrich pleaded, saying her mother was dying, the agent responded that her ticket had been refunded and that \"nobody flies for free.\"\nBack in the airport, Ms. Amrich called Ms. Prelas, sobbing. Ms. Prelas got on the phone with the gate agent and offered to pay for another ticket.\n\"I said: 'Take my credit card. We'll straighten this out later, but get her on that plane,'\" Ms. Prelas said. The agent, she said, responded that Ms. Amrich could not get back on the plane.\nMs. Prelas said she was given no explanation at the time, but United told The Times that the plane had already left by the time Ms. Prelas made that offer.\nAnd so Ms. Amrich drove.\n\"I drove 1,000 miles, and she was gone before I got here,\" she said. \"I never stopped to rest. I went straight through. And she was gone.\"\nMs. Gallant, the Traveler Help Desk supervisor, said that when Ms. Prelas contacted United to change Ms. Amrich's flight, all Traveler Help Desk saw was that the reservation had been modified.\n\"We had no way of knowing this was a change by Ms. Amrich directly with the carrier,\" she said in an email, adding that if the change had been unauthorized and the agency had not canceled the ticket, Ms. Amrich would have lost her money. \"We voided the ticket to protect Ms. Amrich.\"\n\"I am just so sorry for Ms. Amrich's loss,\" Ms. Gallant wrote. \"It is tragic. I understand it was unfortunate the ticket ended up voided. Had she contacted us directly to make the change, this all would have been avoided.\"\nMs. Prelas said that when she made the call, she did not have Traveler Help Desk's number readily available and thought that contacting United directly would be the quickest way to make such an urgent change. She emphasized that she told the United representative she had booked the ticket through an online agency and that the representative had assured her there was no problem.\nAs Ms. Amrich drove across the Great Plains, Ms. Prelas made call after call, trying to find out what had happened. The next day, she said, a woman called her back from United's Chicago headquarters. She wanted Ms. Amrich's address so United could send flowers.\n\"What are the flowers going to do? You took away from her that she might have been able to see her mother alive,\" Ms. Prelas said. \"If I'd have been at that gate, I would have done everything in my power to get her back on that plane.\"", "external_links": [], "published": "2018-01-27T00:32:00.000+02:00", "crawled": "2018-01-27T00:41:03.022+02:00", "highlightTitle": ""}