{"organizations": [], "uuid": "b7791dafef94d90504f1c0ad730fab29246f029e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/loan-demand/lpc-high-demand-helps-us-companies-to-cut-leveraged-loan-pricing-idUSL2N1PL10E", "country": "US", "domain_rank": 408, "title": "LPC: High demand helps US companies to cut leveraged loan pricing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:34:00.000+02:00", "replies_count": 0, "uuid": "b7791dafef94d90504f1c0ad730fab29246f029e"}, "author": "", "url": "https://www.reuters.com/article/loan-demand/lpc-high-demand-helps-us-companies-to-cut-leveraged-loan-pricing-idUSL2N1PL10E", "ord_in_thread": 0, "title": "LPC: High demand helps US companies to cut leveraged loan pricing", "locations": [], "entities": {"persons": [{"name": "jonathan schwarzberg", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "crown holdings", "sentiment": "none"}, {"name": "thomson reuters lpc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:36 PM / in 12 minutes LPC: High demand helps US companies to cut leveraged loan pricing Jonathan Schwarzberg 4 Min Read \nNEW YORK, Jan 26 (Reuters) - The US leveraged loan market has opened with a bang, allowing junk-rated companies such as food packaging company Crown Holdings to reduce pricing further amid strong demand for floating rate assets. \nBa2/BB rated Crown Holdings had an investor count of more than 250 for its US$2.08bn cross-border loan, sources said, allowing it to cut pricing to 200bp on the dollars and 237.5bp on the euros, showing that borrowers still have the upper hand in early 2018. \nStrong appetite from Collateralised Loan Obligation (CLO) funds, the largest buyers of leveraged loans, and separately managed accounts has seen downward pricing flexes outpacing upward flexes by 7.5 to one so far this year, according to Thomson Reuters LPC data. \n“The market is as hot as a pistol,” a senior leveraged finance banker said. \nThe Crown Holdings loan saw high demand due to its track record in the loan market, the large size of the deal and potential secondary market liquidity, as well as the loan’s solid credit rating of Baa2/BB+. \n“It’s kind of rare for the market to get that very high quality paper,” the banker said “As a result, everybody in the market has to own that paper.” PACKAGED UP NICELY \nCrown Holdings launched a US$1.25bn term loan and a €750m term loan on January 10 to back its purchase of industrial packager Signode Industrial Group Holdings. \nPricing guidance opened at 225bp over Libor on the dollars and 275bp over Euribor on the euros. Both tranches were expected to price with an Original Issue Discount (OID) of 99.75. \nRed hot market conditions allowed the company to secure far better terms. Crown Holdings tightened pricing on the dollar tranche once and pricing on the euro tranche twice. The level of demand also allowed both loans to price with no discount. \nSome market participants said the loan could have priced tighter, but the deal was structured conservatively to clear the market at the start of 2018 due to a lack of visibility when the deal was underwritten late last year. \nThe dollar and euro tranches include call protection of 101 for six months, which could allow Crown Holdings to cut pricing in the summer if the loan trades well and market conditions stay strong. \nThe oversubscription also allowed Crown Holdings to add a US$100m pro-rata term loan A to allow banks to participate in the deal. The dollar-denominated term loan was reduced by the same amount to US$1.15bn. \nCitigroup led the transaction. The bank declined to comment. SMALL SPREAD, BIG YIELD \nDespite tightening loan spreads, the yields on US leveraged loans have risen as the three-month Libor rate has climbed to 1.75% in January from an average of 1.45% in the fourth quarter of 2017. The rate has risen steadily in the second half of 2016 from only 0.65% in July 2016. \nLoan yields for BB-rated credits has increased to 4.30% in 2018 to date from 3.92% in the fourth quarter of 2017. \nFloating rate leveraged loans, which are priced over Libor, are attractive to investors seeking to hedge against rising interest rates. High investor demand and high secondary prices leaves room for further price tightening, bankers and investors say. \nFewer leveraged loans have been launched so far this year, which is helping to keep demand high. As of January 25, US$47bn of loans had been launched, 13% lower than the same time last year. \nM&A activity is, however, seeing a stronger start, with US$19.6bn of M&A loans syndicated through January 25, which is 103% higher than the same time last year. \nThe pipeline of new buyouts which built up in late 2017 for syndication in early 2018 is tailing off, leaving bankers looking for deals and considering less lucrative refinancing deals as pricing continues to fall. \nRefinancing activity is 37.5% lower at US$25.1bn as of January 25, but is picking up quickly, with at least 12 repricing deals launched last week and seven refinancing deals hitting the market. \nCrown Holding did not return request for comment. (Reporting by Jonathan Schwarzberg; Editing By Tessa Walsh and Michelle Sierra)", "external_links": [], "published": "2018-01-26T17:34:00.000+02:00", "crawled": "2018-01-26T17:50:30.017+02:00", "highlightTitle": ""}