{"organizations": [], "uuid": "12b896fd2e9d77382e4e5aee5da9f935a645e3b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936244-GettyImages-902289350.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/09/michael-wolffs-fire-and-fury-reveals-a-president-in-crisis.html", "country": "US", "domain_rank": 767, "title": "Michael Wolff’s Fire and Fury reveals a president in crisis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:52:00.000+02:00", "replies_count": 0, "uuid": "12b896fd2e9d77382e4e5aee5da9f935a645e3b5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/michael-wolffs-fire-and-fury-reveals-a-president-in-crisis.html", "ord_in_thread": 0, "title": "Michael Wolff’s Fire and Fury reveals a president in crisis", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the old saying goes, every cause begins as a movement, becomes a business, and ends as a racket. Donald Trump 's political career has proceeded in reverse. It began as a racket, became a business, sparked a movement, and ended in a presidency. It is that bizarre, benighted progression, argues Michael Wolff in his book Fire and Fury: Inside the Trump White House , that explains much of the Trump administration's irresolvable dysfunction.\nWolff's tell-all has launched to enviable press, publicity, and controversy. President Trump dismissed it as \"a Fake Book, written by a totally discredited author,\" while also directing his lawyers to try to stop its publication. (They failed, though the effort shot the book up the best-seller lists).\nAt the same time, Trump has treated its revelations as gospel truth, launching a blood feud against Steve Bannon , his former chief strategist, based on Wolff's recounting of Bannon 's comments. The media has delighted over the backbiting, sniping, leaking, and despair that Wolff got on the record — or, depending on whom you believe , did not get on the record but published anyway.\nRead more from Vox: \nThis might be the best map of the 2016 election you ever see \nRoseanne Barr attempts to explain both her — and her character's — Trump support. Sort of. \nWe can draw school zones to make classrooms less segregated. This is how well your district does. \nFire and Fury has its limits. It's heavily based on a few sources — Ben Domenech, in an allusion to Hillary Clinton's post-election tome, calls it \"Steve Bannon's What Happened \" — and riddled with typos and small but glaring factual errors (like that John Boehner left the House in 2011, rather than 2015).\nAt the same time, the book, read as a whole, contains real insight into the inner workings of the Trump administration. Though it presents itself as an insider account of Trump's first months in office, it is too narrow in scope to serve that purpose: Wolff is clearly bored by questions of governance and policy, so there's relatively little about what the Trump administration actually did, and why it did it.\nInstead, Wolff has written an insider's account of what it's like to work for Donald Trump. This is a book about the collection of cronies, opportunists, misfits, functionaries, family members, and public servants who have tried to construct something that acts and operates like a presidency around a man who neither acts nor operates like a president, a man they all know shouldn't be the president.\nMore importantly, it is a book about why they're failing.\nTrump wasn't supposed to win What you need to understand about Trump's presidency, Wolff says, it that it was never meant to happen. And if it had never happened, perhaps it would have all worked out fine.\nThe beginning of Fire and Fury is about what Trump's team, including the candidate, expected to do after he lost. Steve Bannon \"would become the de facto head of the Tea Party movement,\" Kellyanne Conway \"would now be one of the leading conservative voices on cable news,\" Reince Priebus and Katie Walsh \"would get their Republican Party back,\" Jared Kushner and Ivanka Trump \"would have transformed themselves from relatively obscure rich kids into international celebrities,\" and Melania Trump \"could return to inconspicuously lunching.\"\nAs for Donald Trump? His plans were, well, yuge. He \"would be the most famous man in the world.\" Alongside Roger Ailes, he was thinking of launching his own television network — Trump TV, a network by him, about him, and for the millions and millions of people he had proven he understood better than the Republican Party, Fox News, or Paul Ryan .\n\"I don't think about losing because it isn't losing,\" Trump reportedly told Ailes a week before the election, when he and everyone else thought he was going to lose. \"We've totally won.\"\nThe Trump campaign began as a nice racket. Get some money from the rich guy with the big ego and the checkbook to match. It took off, and it became a nice business — if you'd jumped aboard early, you rocketed to the forefront of conservative politics, bypassing the careerists and operatives who got the blue-chip political jobs you couldn't, the bootlickers and Ivy Leaguers who had looked down on you for so long. To get a candidate that flawed to the nomination, to a respectable loss, that was miracle work, and you would be seen as a miracle worker.\nTrump's staff, Wolff says, knew that it wasn't meant to go beyond that. \"Almost everybody in the campaign, still an extremely small outfit, thought of themselves as a clear-eyed team, as realistic about their prospects as perhaps any in politics. The unspoken agreement among them: not only would Donald Trump not be president, he should probably not be. Conveniently, the former conviction meant nobody had to deal with the latter issue.\"\nThen they had to. Wolff frames the reckoning nicely:\nThe Trump campaign had, perhaps less than inadvertently, replicated the scheme from Mel Brooks's The Producers. In that classic, Brooks's larcenous and dopey heroes, Max Bialystock and Leo Bloom, set out to sell more than 100 percent of the ownership stakes in the Broadway show they are producing. Since they will be found out only if the show is a hit, everything about the show is premised on its being a flop. Accordingly, they create a show so outlandish that it actually succeeds, thus dooming our heroes.\nTo Wolff, many of the Trump administration's current problems lie in this cracked foundation. Why release your tax returns if you're never going to win? What's the harm in sucking up to Russia's government if you're likelier to build a hotel in Moscow than to occupy the White House? Who needs to build a real policy operation, or work through a process of educating the candidate on major policy issues, if he's never going to govern? Why concern yourself with conflicts of interest or business entanglements if they're never going to matter?\nBut all of this raises the question: What was so awful about Trump that even his own staff, his own family, believed he shouldn't be president?\n\"The central issue of the Trump presidency\": Trump is not fit to be president Wolff's book is full of, um, candid assessments of Donald Trump's intellectual capacity — although many of them, it should be said, appear to be second- or thirdhand, so believe the specific wording at your own risk.\n\"An idiot,\" according to Treasury Secretary Steve Mnuchin and, separately, former Chief of Staff Reince Priebus , Wolff wrote.\n\"A fucking idiot,\" according to Rupert Murdoch .\n\"A fucking moron,\" according to Secretary of State Rex Tillerson .\n\"A child,\" according to former Deputy Chief of Staff Katie Walsh.\n\"A dope,\" according to National Security Adviser H.R. McMaster .\n\"Dumb as shit,\" according to National Economics Council Director Gary Cohn .\nThe value of Wolff's book, though, isn't in the judgments themselves, but in the more nuanced portrait of Trump's deficiencies. For instance:\nHere was, arguably, the central issue of the Trump presidency, informing every aspect of Trumpian policy and leadership: he didn't process information in any conventi", "external_links": [], "published": "2018-01-09T18:52:00.000+02:00", "crawled": "2018-01-09T19:16:35.054+02:00", "highlightTitle": ""}