{"organizations": [], "uuid": "d97b53faa65d3cc29944faa1e399c4f9127cbbc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-893130712.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&topic=b&output=rss", "section_title": "Business - Google News", "url": "http://fortune.com/2018/01/31/data-sheet-health-care-bezos-amazon/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Why Jeff Bezos Just Might Crack the Health Care Challenge - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:18:00.000+02:00", "replies_count": 0, "uuid": "d97b53faa65d3cc29944faa1e399c4f9127cbbc6"}, "author": "", "url": "http://fortune.com/2018/01/31/data-sheet-health-care-bezos-amazon/", "ord_in_thread": 0, "title": "Data Sheet—Why Jeff Bezos Just Might Crack the Health Care Challenge - Fortune", "locations": [], "entities": {"persons": [{"name": "jeff bezo", "sentiment": "negative"}, {"name": "jeff bezos", "sentiment": "negative"}, {"name": "mandel ngan", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "aaron pressman", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "washington dc", "sentiment": "none"}], "organizations": [{"name": "health care challenge amazon", "sentiment": "negative"}, {"name": "health care challenge - fortune data sheet data sheet", "sentiment": "negative"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman and Adam Lashinsky 9:18 AM EST \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nJamie Dimon, the boss of J.P. Morgan Chase , has proven to be a master of risk management. Berkshire Hathaway’s Warren Buffett, the greatest investor of our lifetimes, is adept at identifying value—and owning it for the long term. \nBut the key to understanding the new unnamed health care initiative announced Tuesday by J.P. Morgan, Berkshire, and Amazon is Jeff Bezos, CEO of the retailer turned online services provider turned entertainment titan. \nThe three companies are vague about their plans, but they intimated two broad themes about how they intend to improve the experience of administering health care. First, it will involve technology, prompting speculation this will mean better digital records, intelligent physician provisioning, and cleverer insurance schemes. Second, the three heavyweights will experiment on their own million-plus employees, a diverse workforce spanning low-wage normal folk to the most elite of our society. \nThis brew of technology and in-house experimentation—tech companies call this “eating the dog food”—plays to the strengths of Bezos. Amazon was a good, not great, technology company that hit on a better way to sell retail goods. Where it became a technologist for the ages was by offering for sale the online systems it built for its own use—Amazon Web Services. AWS combined both elements of what the trio hopes to achieve in health care, technology with inside-the-walls trials. \nBezos is doing this in other spheres. At The Washington Post he is lending his technical smarts and love of knowledge to an industry he ostensibly knows little about. If Amazon, along with its friends in banking, insurance and diversified industry, can hit on a better approach to health care, the world will be a better place for it. Adam Lashinsky @adamlashinsky NEWSWORTHY \nSpared and not spared. South Korea decided not to ban digital currency exchanges. “There is no intention to ban or suppress cryptocurrency,” Finance Minister Kim Dong-yeon said on Wednesday, though more regulations will be forthcoming, he added. But Facebook has had enough of scammy digital currency ads. The social network said it was banning all ads promoting virtual currencies, related binary options as well as initial coin offerings. \nLong way to go . Venture capitalists beset by allegations of sexual bias and sexual harassment got another troubling data point about their industry. Startups with all-women founders got only 2% of the $85 billion invested last year versus 79% that went to all-male teams, according to PitchBook (another 12% went to mixed gender teams and 7% could not be confirmed). \nPleasing Wall Street. In the public markets, Advanced Micro Devices reported fourth quarter revenue jumped 25% to $1.5 billion and adjusted profit of eight cents a share, up from a loss of one cent, slightly beat analyst expectations. Its stock rose 3% in premarket trading on Wednesday. Samsung had record fourth quarter net income of $11 billion and the annual revenue of its semiconductor unit, at $69 billion, surpassed Intel (and its $63 billion) for the first time giving the South Korean company the title of biggest chipmaker. \nMore dough for Fido . SoftBank’s Vision Fund found another startup to back but this one’s a real bow wowser. The giant fund is putting $300 million into Wag , the nation’s largest on-demand mobile dog walking and care app. The L.A. company also said it hired tech industry veteran Hilary Schneider as its new CEO. \nSlap on the wrist approaching . Apple could be in more trouble over its slowing of iPhone performance on models with aging batteries. The Securities and Exchange Commission and the Justice Department are looking into whether Apple’s disclosures about the issue violated securities laws by misleading investors. \nNot working out. First, Google scaled back its Fiber unit’s plans to wire up homes for broadband service. Now the company has pulled back on its related wireless Internet service, offered under the WebPass brand, in Boston. WebPass, acquired last year, will still offer service in seven cities, but the pullback doesn’t bode well for Google’s broadband efforts. FOOD FOR THOUGHT \nThe TOP500 supercomputer list ranks the fastest known computing devices on the planet twice a year. University of Texas computer science professor Jack Dongarra created the list back in 1992 and chose the benchmark tests which are used to measure supercomputer performance. But times have changed as far as the fastest of the fast, as Asian Scientist noted in an article about the history of the rankings: \nThe most powerful supercomputer on the first TOP500 list, the Fujitsu Numerical Wind Tunnel at Japan’s National Aerospace Laboratory, topped the list with a peak performance of 124 gigaFLOPS. In comparison, the most powerful computer on the November 2017 list was the Sunway TaihuLight, which at 93 petaFLOPS is almost a million times faster. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-31T16:18:00.000+02:00", "crawled": "2018-01-31T16:34:36.003+02:00", "highlightTitle": ""}