{"organizations": [], "uuid": "b53c41ef6fa8892710e97367530fbbed2b93e360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/health-tobacco-pmi/u-s-health-advisers-weigh-risks-of-novel-philip-morris-tobacco-device-idUSL2N1PJ0RS", "country": "US", "domain_rank": 408, "title": "U.S. health advisers weigh risks of novel Philip Morris tobacco device", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-25T00:54:00.000+02:00", "replies_count": 0, "uuid": "b53c41ef6fa8892710e97367530fbbed2b93e360"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/health-tobacco-pmi/u-s-health-advisers-weigh-risks-of-novel-philip-morris-tobacco-device-idUSL2N1PJ0RS", "ord_in_thread": 0, "title": "U.S. health advisers weigh risks of novel Philip Morris tobacco device", "locations": [], "entities": {"persons": [{"name": "philip mo", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "international inc", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 4:54 PM / in 24 minutes U.S. health advisers weigh risks of novel Philip Morris tobacco device Toni Clarke 4 Min Read \nWASHINGTON, Jan 24 (Reuters) - U.S. health advisers on Wednesday began to consider whether Philip Morris International Inc should be allowed to claim its novel electronic tobacco product is less harmful than cigarettes, potentially making it the first such device to carry a reduced risk claim. \nThe panel of tobacco and public health experts, convened by the Food and Drug Administration, will vote on Thursday on whether data provided by the company supports one of three potential claims that would be used on the product’s label and in marketing. The vote is not binding but will influence the FDA’s decision. \nIts iQOS device heats actual tobacco rather than burns it. Most toxic chemicals in cigarette smoke are produced when tobacco combusts. Other electronic devices usual a nicotine-laced liquid. \nA positive vote from the panel could move more U.S. smokers away from cigarettes to electronic alternatives. \nThe panel discussion comes amid an intense debate over whether electronic cigarettes can help reduce smoking-related disease and death. \nFDA staff this week said that iQOS contains fewer harmful chemicals than cigarettes but that it was unclear whether reduced exposure translates into reduced risk of disease. \nResults from an 18-month toxicity and carcinogenicity study in mice is expected by the end of June. Some of the data is included in the company’s application. Full results of the study could shed additional light on any potential cancer risk, the FDA said. \n(For a Reuters investigation on Philip Morris's clinical trials of iQOS, see here here ) \nThe advisory panel will decide whether the company can say iQOS “can reduce the risks of tobacco-related diseases” or it “presents less risk of harm than continuing to smoke cigarettes.” These would be the hardest-to-prove claims. \nA third option would state that iQOS “significantly reduces your body’s exposure to harmful or potentially harmful chemicals.” \nManuel Peitsch, the company’s chief scientific officer, told the committee on Wednesday that ”iQOS emits toxicants and is not risk free,” he said. “Nevertheless, iQOS emits significantly lower levels of toxicants than cigarettes.” \nTaken together, he said, “these results show that switching to iQOS can reduce the risk of tobacco-related disease.” \nOn Tuesday, the National Academies of Sciences, Engineering and Medicine, summarizing data from hundreds of scientific studies, said e-cigarettes are safer than cigarettes and help smokers quit. \nBut the report also found “substantial evidence” that youths who use e-cigarettes are more likely to try traditional cigarettes. \nThe National Academies’ report said the overall long-term public health impact of e-cigarettes remained unclear. \nThe FDA is expected to decide whether Philip Morris can sell iQOS within the next few months. It will decide separately whether to authorize the modified risk claims. \nIf cleared, iQOS would be sold in the United States by Philip Morris’ partner Altria Group Inc. (Reporting by Toni Clarke; Editing by Michele Gershberg and Jeffrey Benkoe)", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T00:54:00.000+02:00", "crawled": "2018-01-24T19:16:09.004+02:00", "highlightTitle": ""}