{"organizations": [], "uuid": "69bf1bf6429297d032d5d1d9cd15f6415a109987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-vuzix-announces-30000000-above-market-intra-day-registered-direct-offering.html", "country": "US", "domain_rank": 767, "title": "Vuzix Announces $30,000,000 Above Market Intra-Day Registered Direct Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:15:00.000+02:00", "replies_count": 0, "uuid": "69bf1bf6429297d032d5d1d9cd15f6415a109987"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-vuzix-announces-30000000-above-market-intra-day-registered-direct-offering.html", "ord_in_thread": 0, "title": "Vuzix Announces $30,000,000 Above Market Intra-Day Registered Direct Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}], "organizations": [{"name": "vuzix® corporation", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Vuzix® Corporation ( VUZI ), a supplier of Smart Glasses and Augmented Reality (AR) products in the consumer and enterprise markets, today announced the entry into agreements with institutional investors relating to the sale of 3,000,000 shares of its common stock at an offering price of $10.00 per share together with 1 year warrants to purchase an aggregate 1,200,000 shares of its common stock at $10.00 per share, and will be immediately exercisable for a period of one year. The offering price was based above the closing consolidated bid price as of January 23, 2018. The gross proceeds from the offering will be $30,000,000 before deducting commissions and estimated offering expenses.\nThe Company intends to use the net proceeds from the offering for general corporate purposes, including expanding its product offering and the commercial launch of its Blade Smart Glasses, featuring its proprietary waveguide technology products and for general working capital purposes.\n\"This financing significantly improves Vuzix' balance sheet and helps ensure that the Company has sufficient operating capital to execute on its aggressive business plans while also putting Vuzix in a stronger position to effectively negotiate and conclude discussions with potential licensing and strategic partners,\" explained Paul Travers, President and CEO of Vuzix Corporation. He continued, \"With all the increased business activities from the recent launch of the Vuzix Blade and the growing deployments around our workhorse M300, the response from both consumer and enterprise segments has been overwhelming. As a result, we felt that it would be prudent to strengthen our balance sheet.\"\nChardan acted as the lead placement agent for this transaction and Maxim Group LLC acted as a co-placement agent and Craig-Hallum Capital Group as a financial advisor.\nThe shares of common stock and warrants sold in the Offering will be issued separately. The offering is expected to close on January 26, 2018, subject to satisfaction of customary closing conditions.\nThis press release does not constitute an offer to sell, or the solicitation of an offer to buy, any securities described herein, nor will there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nThe shares are being offered by Vuzix Corporation pursuant to an effective \"shelf\" registration statement previously filed with and subsequently declared effective on February 4, 2016 by the Securities and Exchange Commission. The securities are being offered only by means of a prospectus, including a prospectus supplement, forming a part of the effective registration statement. Copies of the final prospectus supplement and accompanying base prospectus may be obtained, when available, by contacting Chardan Capital Markets, LLC, 150 East 58th Street, 28th Floor, New York, NY 10155, at (646) 465-9028, or the Securities and Exchange Commission's website at http://www.sec.gov .\nAbout Vuzix Corporation\nVuzix is a leading supplier of Smart-Glasses and Augmented Reality (AR) technologies and products for the consumer and enterprise markets. The Company's products include personal display and wearable computing devices that offer users a portable high-quality viewing experience, provide solutions for mobility, wearable displays and virtual and augmented reality. Vuzix holds 59 patents and 42 additional patents pending and numerous IP licenses in the Video Eyewear field. The Company has won Consumer Electronics Show (or CES) awards for innovation for the years 2005 to 2018 and several wireless technology innovation awards among others. Founded in 1997, Vuzix is a public company (NASDAQ: VUZI) with offices in Rochester, NY, Oxford, UK and Tokyo, Japan.\nForward-Looking Statements Disclaimer\nCertain statements contained in this news release are \"forward-looking statements\" within the meaning of the Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. Forward looking statements contained in this release relate to the new Blade 3000 Smart Glasses, our latest waveguide and projection optics, their technological advancements and proposed features, use of proceeds, capital needs, and among other things, the Company's leadership in the Video Eyewear and AR display industry. They are generally identified by words such as \"believes,\" \"may,\" \"expects,\" \"anticipates,\" \"should\" and similar expressions. Readers should not place undue reliance on such forward-looking statements, which are based upon the Company's beliefs and assumptions as of the date of this release. The Company's actual results could differ materially due to risk factors and other items described in more detail in the \"Risk Factors\" section of the Company's Annual Reports and MD&A filed with the United States Securities and Exchange Commission and applicable Canadian securities regulators (copies of which may be obtained at www.sedar.com or www.sec.gov ). Subsequent events and developments may cause these forward-looking statements to change. The Company specifically disclaims any obligation or intention to update or revise these forward-looking statements as a result of changed events or circumstances that occur after the date of this release, except as required by applicable law.\nFor further information:\nMedia and Investor Relations Contact:\nMatt Margolis, Director of Corporate Communications and Investor Relations, Vuzix Corporation matt_margolis@vuzix.com Tel: (585) 359-5952\nAndrew Haag, Managing Partner, IRTH Communications\nvuzi@irthcommunications.com Tel: (866) 976-4784\nVuzix Corporation, 25 Hendrix Road, Suite A, West Henrietta, NY 14586 USA,\nInvestor Information – IR@vuzix.com www.vuzix.com\n with multimedia: releases/vuzix-announces-3 -above-market-intra-day-registered-direct-offering-300587927.html\nSOURCE Vuzix Corporation", "external_links": ["http://www.vuzix.com/", "https://finance.yahoo.com/q?s=vuzi", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/vuzix-announces-30000000-above-market-intra-day-registered-direct-offering-300587927.html", "http://www.sedar.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51439382&newsitemid=20161014005319&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=6912bf150fceb0cc556ae405bdbf7a6d"], "published": "2018-01-25T02:15:00.000+02:00", "crawled": "2018-01-25T03:30:43.000+02:00", "highlightTitle": ""}