{"organizations": [], "uuid": "d2c6b9e3b346d6a7a3ba10e4d7cc4f290b376cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-northwestern-mutual-appoints-lori-brissette-to-vice-president-of-insurance-and-annuities-client-services.html", "country": "US", "domain_rank": 767, "title": "Northwestern Mutual Appoints Lori Brissette to Vice President of Insurance and Annuities Client Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:00:00.000+02:00", "replies_count": 0, "uuid": "d2c6b9e3b346d6a7a3ba10e4d7cc4f290b376cb7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-northwestern-mutual-appoints-lori-brissette-to-vice-president-of-insurance-and-annuities-client-services.html", "ord_in_thread": 0, "title": "Northwestern Mutual Appoints Lori Brissette to Vice President of Insurance and Annuities Client Services", "locations": [], "entities": {"persons": [{"name": "lori brissette", "sentiment": "negative"}, {"name": "lori", "sentiment": "negative"}, {"name": "brissette", "sentiment": "none"}, {"name": "john schlifske", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "usaa", "sentiment": "none"}, {"name": "northwestern mutual", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, - Northwestern Mutual today announced the appointment of Lori Brissette to vice president of insurance and annuities client services. Effective January 2, 2018, Brissette assumed her title as vice president and executive officer and will help drive innovation as a leader on the insurance products and client services team.\n\"Our service to clients and financial representatives is a key priority, and we are thrilled to have Lori lead these efforts,\" said John Schlifske, chairman and CEO, Northwestern Mutual. \"Lori's skill set, experience and deep understanding of our industry will help her play a critical role in accelerating our transformation to provide a leading client experience.\"\nBrissette comes to Northwestern Mutual after spending seven years with USAA in San Antonio, Texas, where she most recently served as assistant vice president, USAA Protection Experience. Brissette has extensive background in leading diverse teams through change, while fostering a mindset and culture of continuous learning and improvement, as well as experience in omni-channel servicing of life and health insurance products. Brissette also helped develop and lead a new corporate strategy and operating model at USAA, driving alignment across the company.\nPrior to joining USAA, Brissette led a law firm that provided services to financial security companies. She also served as an elected district judge for the State of Texas. Brissette earned her Bachelor of Arts degree from the University of Texas at Austin and her J.D., Magna Cum Laude, from South Texas College of Law.\nAbout Northwestern Mutual\nNorthwestern Mutual has been helping families and businesses achieve financial security for 160 years. Through a distinctive, whole-picture planning approach including both insurance and investments, we empower people to be financially confident so they can live life differently. We combine the expertise of our financial professionals with a personalized digital experience to help our clients navigate their financial lives every day. With $250.4 billion in assets, $28.2billion in revenues, and more than $1.6 trillion worth of life insurance protection in force, Northwestern Mutual delivers financial security to more than 4.4 million people who rely on us for life, disability income and long-term care insurance, annuities, brokerage and advisory services, trust services, and discretionary portfolio management solutions. The company holds more than $100 billion of client assets as a part of its wealth management company and investment services. Northwestern Mutual ranks 97 on the 2017 FORTUNE 500 and is recognized by FORTUNE® as one of the \"World's Most Admired\" life insurance companies in 2017.\nNorthwestern Mutual is the marketing name for The Northwestern Mutual Life Insurance Company (NM), Milwaukee, WI (life and disability insurance, annuities, and life insurance with long-term care benefits) and its subsidiaries. Northwestern Mutual and its subsidiaries offer a comprehensive approach to financial security solutions including: life insurance, long-term care insurance, disability income insurance, annuities, life insurance with long-term care benefits, investment products, and advisory products and services. Subsidiaries include Northwestern Mutual Investment Services, LLC ( NMIS) (securities), broker-dealer, registered investment adviser, member FINRA and SIPC; the Northwestern Mutual Wealth Management Company® (NMWMC) (fiduciary and fee-based financial planning services), federal savings bank; and Northwestern Long Term Care Insurance Company (NLTC) (long-term care insurance).\nView original content with multimedia: http://www.prnewswire.com/news-releases/northwestern-mutual-appoints-lori-brissette-to-vice-president-of-insurance-and-annuities-client-services-300580417.html\nSOURCE Northwestern Mutual", "external_links": ["https://www.northwesternmutual.com/", "http://www.prnewswire.com/news-releases/northwestern-mutual-appoints-lori-brissette-to-vice-president-of-insurance-and-annuities-client-services-300580417.html"], "published": "2018-01-10T18:00:00.000+02:00", "crawled": "2018-01-10T18:40:19.046+02:00", "highlightTitle": ""}