{"organizations": [], "uuid": "31e7641ea05808d84ff438ee16879c8a7bc60557", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-swipeclock-acquires-shugo.html", "country": "US", "domain_rank": 767, "title": "SwipeClock Acquires Shugo", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.746, "site_type": "news", "published": "2018-01-12T04:35:00.000+02:00", "replies_count": 0, "uuid": "31e7641ea05808d84ff438ee16879c8a7bc60557"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-swipeclock-acquires-shugo.html", "ord_in_thread": 0, "title": "SwipeClock Acquires Shugo", "locations": [], "entities": {"persons": [{"name": "coleman barney", "sentiment": "none"}, {"name": "shugo", "sentiment": "none"}], "locations": [{"name": "lake city", "sentiment": "none"}], "organizations": [{"name": "swipeclock llc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 11, 2018 /PRNewswire/ -- SwipeClock LLC today announced it has acquired Shugo , a leader in providing innovative SaaS-based workforce products and services for small- and medium-sized businesses. The acquisition enables SwipeClock to broaden its workforce management offerings and provide channel partners and their clients with additional solutions that make managing workforces easier and more cost effective.\n\"As a long-time integration partner that has been closely aligned with SwipeClock's mission, we are excited to acquire Shugo,\" said Coleman Barney, CEO of SwipeClock. \"Because we have tremendous overlap with Shugo's sales channel, a shared customer base, and solutions that are already integrated, this acquisition is a clear fit for both companies. Additionally, SwipeClock can now help our sizeable installed base of partners and clients better manage their workforces by delivering a more unified and complete solution.\"\nA Natural Fit\nShugo is a natural fit with SwipeClock's goal to expand the number of innovative workforce management solutions it offers to small- and medium-sized businesses beyond scheduling and timekeeping . Shugo's product line includes an intuitive and customizable employee portal with punch clock, access to payroll information, company communications and alerts, a company directory, and options for HR tasks and workflow processes. The combined product offerings will enable SwipeClock to offer an even more powerful and intuitive employee and manager portal that already has wide adoption across both companies' customer bases.\nShugo has focused on integrating its solutions with payroll software products and building a distribution channel using payroll service bureaus, both important facets of SwipeClock's growth objectives. Finally, Shugo's expertise in unifying user interfaces and providing an innovative set of products and services that employers and employees want to use is key for SwipeClock to become a more complete workforce management solution provider.\nTerms of the acquisition were not disclosed.\nAbout SwipeClock LLC\nSwipeClock is a leading provider of simple and affordable integrated workforce management solutions that enable employers to more easily and cost effectively manage their workforces. The company's products, which include TimeWorksPlus, TimeSimplicity, and Workforce Management Suite, are sold through over 850 partners that empower more than 26,000 businesses to lower labor costs, comply with regulatory mandates, and maximize their profits. Learn more about SwipeClock at www.swipeclock.com and on Facebook.\nView original content: http://www.prnewswire.com/news-releases/swipeclock-acquires-shugo-300581813.html\nSOURCE SwipeClock", "external_links": ["http://bit.ly/2FkCTu6", "http://bit.ly/2Db2swH", "http://www.myshugo.com/Home", "http://www.prnewswire.com/news-releases/swipeclock-acquires-shugo-300581813.html", "http://bit.ly/2DcToYt"], "published": "2018-01-12T04:35:00.000+02:00", "crawled": "2018-01-12T06:16:25.009+02:00", "highlightTitle": ""}