{"organizations": [], "uuid": "ce015ddd8343342755db03105d1e8b4e45f16078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221567837&w=1200&r=LYNXMPEE0B1KZ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-germany-b04-bay/bayern-down-leverkusen-3-1-as-bundesliga-restarts-idUKKBN1F12P0", "country": "US", "domain_rank": 408, "title": "Bayern down Leverkusen 3-1 as Bundesliga restarts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:07:00.000+02:00", "replies_count": 0, "uuid": "ce015ddd8343342755db03105d1e8b4e45f16078"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-germany-b04-bay/bayern-down-leverkusen-3-1-as-bundesliga-restarts-idUKKBN1F12P0", "ord_in_thread": 0, "title": "Bayern down Leverkusen 3-1 as Bundesliga restarts", "locations": [], "entities": {"persons": [{"name": "reuters/wolfgang rattay  javi martinez", "sentiment": "none"}, {"name": "franck ribery", "sentiment": "none"}, {"name": "kevin volland", "sentiment": "none"}, {"name": "james rodriguez", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "leipzig", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "leverkusen", "sentiment": "negative"}, {"name": "bayern", "sentiment": "negative"}, {"name": "schalke", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "bayern munich", "sentiment": "none"}, {"name": "bayer leverkusen", "sentiment": "none"}, {"name": "bayern munich - bayarena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:11 PM / Updated 6 hours ago Bayern down Leverkusen 3-1 as Bundesliga restarts Reuters Staff 3 Min Read \nBERLIN (Reuters) - Champions Bayern Munich survived some late pressure to win 3-1 and end Bayer Leverkusen’s 12-game unbeaten league run as they stretched their lead at the top to 14 points on Friday when the Bundesliga resumed after the winter break. Soccer Football - Bundesliga - Bayer Leverkusen vs Bayern Munich - BayArena, Leverkusen, Germany - January 12, 2018. Bayern Munich players celebrate after the match. REUTERS/Wolfgang Rattay \nJavi Martinez and Franck Ribery scored either side of the break for Bayern before Kevin Volland pulled one back for the hosts to set up a frantic finale. \nThe visitors, without top scorer Robert Lewandowski and central defender Mats Hummels, made sure of the points when James Rodriguez curled a free kick into the top corner in the first minute of stoppage time to lift them to 44 points. \n“Tactically and defensively my team did it well for long stretches,” coach Jupp Heynckes told reporters. \n“We lost our concentration a bit after leading 2-0 but it is just difficult to win here. Leverkusen are young and talented and they attacked today.” \nNew Bayern signing Sandro Wagner, who made a late substitute appearance, set a club record with his league comeback for the Bavarians over 10 years after his previous Bundesliga game for them. The 30-year-old Germany striker joined from Hoffenheim. Soccer Football - Bundesliga - Bayer Leverkusen vs Bayern Munich - BayArena, Leverkusen, Germany - January 12, 2018. Bayern Munich's James Rodriguez celebrates scoring their third goal. REUTERS/Wolfgang Rattay \nSecond-placed Schalke 04 are in action at RB Leipzig on Saturday while Leverkusen stay fourth on 28. Borussia Dortmund, in third also on 28 points, host VfL Wolfsburg on Sunday. \nLeverkusen initially showed the fine form they have displayed over the past few months with a strong start that saw them press Bayern high and launch lightning quick counter attacks with speedy wingers Leon Bailey and Karim Bellarabi. Slideshow (2 Images) \nDominik Kohr’s 18th minute header narrowly missed the target but was their best chance before Bayern gradually took control. \nThe visitors took the lead in the 32nd minute when Martinez fired in from close range after Leverkusen failed to clear an Arturo Vidal header. \nRibery, battling for a contract extension, added the second goal on the hour, shaking off two players to score with a low shot past Bernd Leno before Volland’s 70th minute deflected strike saw Leverkusen get back into the match. \nHowever, Rodriguez’s free kick dashed home hopes as Bayern won at Leverkusen for the first time since their 2013 treble-winning season. Reporting by Karolos Grohmann; Editing by Ken Ferris", "external_links": [], "published": "2018-01-13T00:07:00.000+02:00", "crawled": "2018-01-13T00:15:18.005+02:00", "highlightTitle": ""}