{"organizations": [], "uuid": "81c4ef0c58cf5763969339702c5d91bbefbfe369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-borqs-technologies-inc-announces-repurchase-of-shares.html", "country": "US", "domain_rank": 767, "title": "Borqs Technologies, Inc. Repurchase of Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:30:00.000+02:00", "replies_count": 0, "uuid": "81c4ef0c58cf5763969339702c5d91bbefbfe369"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-borqs-technologies-inc-announces-repurchase-of-shares.html", "ord_in_thread": 0, "title": "Borqs Technologies, Inc. Repurchase of Shares", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif., Jan. 12, 2018 (GLOBE NEWSWIRE) -- Borqs Technologies, Inc. (Nasdaq:BRQS) (the “Company”), a global leader in embedded software, products and cloud solutions for the Internet of Things (IoT), announces repurchase of shares from Zhengqi International Holding Limited (“Zhengqi”).\nOn January 10, 2018, the Company repurchased 966,136 ordinary shares issued to Zhengqi under the Backstop and Subscription Agreement dated May 11, 2017 and amended August 16, 2017, at Zhengqi’s original purchase price of $10.40 per share, or an aggregate of $10,047,814. Zhengqi was the sponsor of the special purpose acquisition company that merged with Borqs International Holding Corp in August 2017 to form the Company. The repurchased shares have been retired. In connection with the repurchase, 1,278,776 ordinary shares previously subject to a net income escrow will be treated as merger consideration, with 1,227,625 shares released to former shareholders of Borqs International Holding Corp and 51,151 shares treated as additional indemnity shares, while 1,000,000 shares will remain subject to the net income escrow for the benefit of Zhengqi and 73,509 shares will remain subject to the net income escrow for the benefit of EarlyBirdCapital, Inc. As a result of this transaction, the former shareholders of Borqs International Holding Corp increased their ownership of the Company from 70% to 76%.\nAbout Borqs\nBorqs Technologies is a global leader in software and products for IoT, providing customizable, differentiated and scalable Android-based smart connected devices and cloud service solutions. Borqs has achieved leadership and customer recognition as an innovative end-to-end IoT solutions provider leveraging its strategic chipset partner relationships as well as its broad software and IP portfolio. BORQS designs, develops and provides turnkey solutions across device form factors such as smartphones, tablets, smartwatches, trackers, automotive IVI, vertical application devices (for restaurants, payments etc.). For more information, please visit the Company’s website ( www.borqs.com ).\nForward-Looking Statements Disclosure\nThis press release includes “forward-looking statements” that involve risks and uncertainties that could cause actual results to differ materially from what is expected. Words such as “expects”, “believes”, “anticipates”, “intends”, “estimates”, “predicts”, “seeks”, “may”, “might”, “plan”, “possible”, “should” and variations and similar words and expressions are intended to identify such forward-looking statements, but the absence of these words does not mean that a statement is not forward-looking. Such forward-looking statements relate to future events or future results, based on currently available information and reflect our management’s current beliefs. Many factors could cause actual events or results to differ materially from the events and results discussed in the forward-looking statements, so the reader is advised to refer to the Risk Factors sections of the Company’s filings with the Securities and Exchange Commission for additional information identifying important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. Except as expressly required by applicable securities law, the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nContact\nSandra Dou, Investor Relations Sr. Manager\nEmail: sandra.dou@borqs.net\nSource:Borqs Technologies, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=AD_am3tVKPMNlZ2zAS0U7PcV2K280ed8z-2M_uI07EH1kT1E6gCghauYIYc-Y7lstdz9KtQB3ca6h7RdRPj4U9OoIDtrtAxbop94WEyodAo=", "https://www.globenewswire.com/Tracker?data=IWo1q7yvOUioOwgpydUoDQUhso7q4gVWgHVLwBObDCEchMm2bUJ4e0svtKEtpXLYmNR763HZGFTPpOp7JL0k4A=="], "published": "2018-01-13T00:30:00.000+02:00", "crawled": "2018-01-13T03:03:58.203+02:00", "highlightTitle": ""}