{"organizations": [], "uuid": "5c2429a7f9ffcc272c5b053e085da06d194282e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cision-welcomes-former-adobe-executive-as-chief-technology-officer.html", "country": "US", "domain_rank": 767, "title": "Cision Welcomes Former Adobe Executive as Chief Technology Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "5c2429a7f9ffcc272c5b053e085da06d194282e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cision-welcomes-former-adobe-executive-as-chief-technology-officer.html", "ord_in_thread": 0, "title": "Cision Welcomes Former Adobe Executive as Chief Technology Officer", "locations": [], "entities": {"persons": [{"name": "pritham shetty", "sentiment": "negative"}, {"name": "pritham", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nyse", "sentiment": "none"}, {"name": "cision", "sentiment": "none"}, {"name": "adobe", "sentiment": "none"}, {"name": "cisn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Industry veteran Pritham Shetty joins global provider of earned media software and services\nCHICAGO, Jan. 8, 2018 /PRNewswire/ -- Cision (NYSE: CISN) today announced it has hired Pritham Shetty as chief technology officer. As a former executive at Adobe, Pritham brings extensive experience in the digital marketing industry and will work to continue building out Cision's data and technology offerings. Pritham will oversee Cision's global software development teams and lead the company's technology roadmap and operations.\n\"This is an exciting time for Cision. The ascension of earned media as mission critical for any company has underscored the importance of measuring its true impact on business results,\" said Pritham. \"I look forward to leveraging my experience in the broader marketing industry to amplify and build upon the breakthrough products in earned media that Cision has historically provided to communications professionals globally.\"\nPritham most recently served as senior vice president of product and technology at GuideSpark, a leader in employee communication software, leading product strategy as well as cloud planning and execution. Prior to GuideSpark, Pritham held a 15-year tenure at Adobe holding a number of executive level positions including vice president of product development. Pritham managed a global team of over 450 engineers and led product strategy and execution for various offerings including Adobe Core Services, Adobe Audience Manager and Adobe Primetime for the Adobe Digital Marketing Cloud.\n\"Without a doubt, Pritham's impressive experience and operational prowess will help continue to fuel Cision's growth and scale,\" said Kevin Akeroyd, CEO of Cision. \"As CTO, Pritham will be instrumental to the executive leadership team as we continuously strive to innovate our earned media measurement technology, products, and comms cloud platform to shape and drive the future of the communications industry.\"\nAbout Cision\nCision Ltd. (NYSE: CISN ) is a leading global provider of earned media software and services to public relations and marketing communications professionals. Cision's software allows users to identify key influencers, craft and distribute strategic content, and measure meaningful impact. Cision has over 3,000 employees with offices in 15 countries throughout the Americas, EMEA, and APAC. For more information about its award-winning products and services, including the Cision Communications Cloud®, visit www.cision.com and follow Cision on Twitter @Cision .\nMedia Contact\nNick Bell\nVP, Marketing Communications\nCisionPR@cision.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/cision-welcomes-former-adobe-executive-as-chief-technology-officer-300578707.html\nSOURCE Cision", "external_links": ["http://markets.financialcontent.com/prnews/quote?Symbol=CISN", "https://twitter.com/Cision", "http://www.cision.com/", "http://www.prnewswire.com/news-releases/cision-welcomes-former-adobe-executive-as-chief-technology-officer-300578707.html"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:09:05.008+02:00", "highlightTitle": ""}