{"organizations": [], "uuid": "8980eacab9335fdc3b589cae87c83a750eb5ce40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-china-food-and-drug-administration-cfda-approves-biomerica-colorectal-screening-test-to-help-identify-the-early-warning.html", "country": "US", "domain_rank": 767, "title": "China Food and Drug Administration (CFDA) approves Biomerica colorectal screening test to help identify the early warning signs of colorectal cancer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-10T16:19:00.000+02:00", "replies_count": 0, "uuid": "8980eacab9335fdc3b589cae87c83a750eb5ce40"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-china-food-and-drug-administration-cfda-approves-biomerica-colorectal-screening-test-to-help-identify-the-early-warning.html", "ord_in_thread": 0, "title": "China Food and Drug Administration (CFDA) approves Biomerica colorectal screening test to help identify the early warning signs of colorectal cancer", "locations": [], "entities": {"persons": [{"name": "chen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "biomerica", "sentiment": "neutral"}, {"name": "china food and drug administration", "sentiment": "neutral"}, {"name": "biomerica, inc.", "sentiment": "neutral"}, {"name": "cfda", "sentiment": "neutral"}, {"name": "drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Biomerica, Inc. (Nasdaq:BMRA) announced the China Food and Drug Administration (CFDA) approval of the EZ Detect™ colorectal screening test designed to help identify the early warning signs of colorectal cancer.\nThe EZ Detect colorectal screening test is the simplest at home test to detect fecal occult (hidden) blood, an early warning sign of colorectal cancer. The test does not require handling of stool or dietary restrictions. The EZ Detect pad is tossed into the toilet after a bowel movement. A change in the pad’s color to blue/green, which would appear within two minutes, indicates the presence of blood in the stool. The pad is then simply flushed.\nWith increasing incidence and mortality, cancer is the leading cause of death in China and is a major public health problem. About 376,000 new cases of colorectal cancer were reported annually in China a recent study and about 191,000 die from the disease every year 1 .\n1 Chen et al., Cancer statistics in China, CA CANCER J CLIN 2016;66:115–132\nAbout Biomerica (NASDAQ:BMRA )\nBiomerica, Inc. ( www.biomerica.com ) is a global biomedical company that develops, manufactures and markets advanced diagnostic products used at the point-of-care (in home and in physicians' offices) and in hospital/clinical laboratories for the early detection of medical conditions and diseases. The Company's products are designed to enhance the health and well-being of people, while reducing total healthcare costs. Biomerica primarily focuses on products for Gastrointestinal Disease, Diabetes and esoteric testing.\nThe Biomerica InFoods ® IBS product identifies patient specific foods that when removed may alleviate an individual's IBS symptoms. This patent-pending, diagnostic-guided therapy is designed to allow for a patient specific, guided dietary regimen to improve Irritable Bowel Syndrome (IBS) outcomes. The point-of-care product is being developed to allow physicians to perform the test in-office using a finger stick blood sample while a clinical lab version of the product will be the first for which the company will seek regulatory approval. A billable CPT code that can be used by both clinical labs and physicians' offices is available for InFoods ® diagnostic products. Since the InFoods ® product is a diagnostic-guided therapy, and not a drug, it has no drug type side effects.\nThe Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for forward-looking statements. Certain information included in this press release (as well as information included in oral statements or other written statements made or to be made by Biomerica) contains statements that are forward-looking; such as statements relating to intended launch dates, sales potential, significant benefits, market size, prospects, new products, favorable outlook, new distributors, expansion, increases in productivity and margins, expected orders, leading market positions, anticipated future sales or production volume of the Company, the launch or success of product and new product offerings. Such forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future, and accordingly, such results may differ materially from those expressed in any forward-looking statements made by or on behalf of Biomerica. The potential risks and uncertainties include, among others, fluctuations in the Company's operating results due to its business model and expansion plans, downturns in international and or national economies, the Company's ability to raise additional capital, the competitive environment in which the Company will be competing, and the Company's dependence on strategic relationships. The Company is under no obligation to update any forward-looking statements after the date of this release.\nContact(s):\nMedia Relations\nMegan Daly | Account Supervisor\nInterdependence Public Relations\nChicago, IL\np 323.514.0078\ne mdaly@interdependence.com\nCorporate\nZack Irani | CEO\np. 949.645.2111\nwww.biomerica.com\nSource:Biomerica, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3461b9f0-3e95-484f-96e9-71608fc20239"], "published": "2018-01-10T16:19:00.000+02:00", "crawled": "2018-01-10T19:16:10.001+02:00", "highlightTitle": ""}