{"organizations": [], "uuid": "5ca313bf7974c3c2233e0d547fb108a3b13a17a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 1}, "linkedin": {"shares": 0}, "facebook": {"likes": 573, "shares": 573, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/04/rts12tfi.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/facebook-news-feed-change/", "country": "US", "domain_rank": 1196, "title": "Facebook News Feed Changes: How Users, Publishers Are Impacted | Fortune", "performance_score": 5, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.912, "site_type": "news", "published": "2018-01-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "5ca313bf7974c3c2233e0d547fb108a3b13a17a0"}, "author": "Jonathan Vanian", "url": "http://fortune.com/2018/01/12/facebook-news-feed-change/", "ord_in_thread": 0, "title": "Facebook News Feed Changes: How Users, Publishers Are Impacted | Fortune", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "jonathan vanian", "sentiment": "negative"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "facebook news", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jonathan Vanian January 12, 2018 \nFacebook CEO Mark Zuckerberg’s recently announced changes to the company’s news feed have the potential to dramatically affect how people interact on the social network. \nOver the next few weeks, Facebook’s news feed will start showing fewer news articles, and less marketing content and ads, Zuckerberg wrote on Thursday. Instead, users should start seeing more vacation videos from their friends, photos of their nephew’s college graduation, and other more family-friendly posts about the people they know. \nIt’s a major change for Facebook, which over the years has shifted from being a social networking service connecting friends and family to one of the world’s biggest distributors of news and online ads. \nHere’s what you need to know about Facebook’s big news feed change: Why is Facebook changing its news feed? \nTo hear Zuckerberg explain it, the increase in news articles and marketing has created an imbalance that “is crowding out the personal moments that lead us to connect more with each other.” Based on Facebook’s internal research and outside studies, he said that people are generally happier and have a better “well-being” when they use social media to connect “with people we care about.” What “may not be as good,” however, is merely “reading articles or watching videos,” even if they’re informative or entertaining. \nLeft unsaid are the controversies Facebook has faced in recent years over its relationship with the news industry. For example, critics slammed Facebook (fb) for failing to prevent the spread of misinformation , dubbed fake news, on the news feed during the run up to the U.S. 2016 presidential election. \nThe company also made an unpopular decision in 2016 to block a Norwegian newspaper editor from posting an iconic Vietnam War photo of a terrified, naked child fleeing her village after a vicious napalm attack. At the time, Facebook noted the photo’s historical relevance, but said it was “difficult to create a distinction between allowing a photograph of a nude child in one instance and not others.” Eventually, after a fierce backlash, Facebook allowed the photo on its service. \nFacebook has likely had enough of these kinds of editorial dilemmas, as the company has long argued it’s not a media company in the traditional sense, but rather a platform that happens to distribute other publishers’ content. Showing less of this kind of content eliminates some headache for Facebook, which can then put more energy into making money. Facebook says all that pesky news in your feed is making you cranky. Also, fake news is hard to fix. So let’s get rid of news in your feed! \nI cannot overstate how much Facebook is just screwing our news operations and our democracy over and over and over. https://t.co/TFQ5NlBqEn \n— Audrey Cooper (@audreycoopersf) January 12, 2018 facebook \"not a media company\" dot com hurts media companies….again https://t.co/RWdjQHOnzD pic.twitter.com/Ip2yFnuiMf \n— Ann-Marie Alcántara (@itstheannmarie) January 12, 2018 \nIt’s also possible that the number of hours people have been using Facebook is declining, and the company is trying to adjust the news feed to get people to stay online for longer than they have been, according to Pivotal Research Group analyst Brian Wieser. He analyzed Nielsen data about Facebook’s online audience over a 14-month period ending Sept. 2017, and found a small, but general decline in people’s use of Facebook. The report said that “Facebook (including Messenger but excluding Instagram) saw a decline in total person-hours (number of users multiplied by hours of consumption per person) during September of -0.1% year-over-year following a -0.9% decline in August.” \n“We can speculate that the concerns reflected in Zuckerberg’s post may very well have been driving these declines,” Wieser wrote in the research report. \nGet Data Sheet , Fortune’s technology newsletter. How will Facebook’s news feed change impact the news industry? \nWe won’t know how everything is going to play out, but it’s going to hurt in the short term, Wieser told Fortune . Publishers that have relied on Facebook for so-called organic distribution, essentially articles that publishers didn’t pay to have inserted into people’s news feeds, “will find Facebook a less accommodating environment,” he said. \nWith Facebook de-emphasizing news on its service, news organizations face the dilemma that traffic to their respective websites may tumble. “If you weren’t already reducing your reliance on Facebook before, you definitely are reducing your reliance on Facebook right now,” Wieser said. \nNews organizations have been attempting to create content that they believe could be widely shared on Facebook, such as short videos that are in line with Facebook’s desire to show more videos to its users. These efforts are mostly futile with Facebook’s news feed changes. \nPublishers that ignore Facebook now that Facebook has de-emphasized news will now be more likely to create more content tailored to match the interests of their readers—and not Facebook’s mysterious algorithms. So many publishers think they have audiences, when what they really have is traffic. \nI think we’re about to find out who has an audience \n— Casey Newton (@CaseyNewton) January 12, 2018 \nWieser also expects more publishers to deepen their existing relationships with Google to ensure that the search engine highlights their articles and videos. How will businesses and advertisers be affected? \nOnline advertisers and businesses that distribute marketing through the news feed will face similar challenges as the news industry. \n“Facebook has clearly put a stake in the ground that user experience is more important than the brands that pay them,” HubSpot’s senior product marketing manager Marcus Andrews said in a statement . “By making this shift they clearly prioritized one over the other, and are potentially a bit nervous about the current (really negative) narrative about the negative impact of social media on society.” \nBusinesses may actually end up buying more online ads on Facebook to promote themselves, because simply creating content and attempting to share it on the news feed for free will no longer work as well as it once did. “That definitely is a potential consequence” Wiseler said. How is Wall Street reacting to Facebook’s news feed changes? \nNot well. Facebook’s shares fell 4.5% to $179.37 on Friday, indicating that investors are worried that the news feed tweak will hurt the company’s revenue. It probably didn’t help that Zuckerberg conceded that the new changes could temporarily cause “some measures of engagement” to go down. \nAs Bank of America analyst Justin Post wrote in a research note, “the goal appears to be realigning Facebook as a social platform and less of a media/news outlet. \n“We expect the content shift and commentary on potential usage pressure to raise some concerns on potential revenue headwinds,” Post said. \nStill, Post believes that while Facebook’s advertising business “may face some added pressure in 2018,” an “improving user experience” (ie. happy Facebook users that aren’t bummed by the news) “could drive higher ad prices to counterbalance.” \nDaniel Ives, an analyst with GBH Insights, also share", "external_links": [], "published": "2018-01-12T02:00:00.000+02:00", "crawled": "2018-01-13T04:00:00.004+02:00", "highlightTitle": ""}