{"organizations": [], "uuid": "963601b5b05812cdaedafe068075e2fa6b94e8ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226292222&w=1200&r=LYNXMPEE0S0W4", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-lockheed-results/lockheed-martin-takes-2-billion-charge-adjusted-profit-beats-idUSKBN1FI1I2", "country": "US", "domain_rank": 408, "title": "Lockheed Martin takes $2 billion charge, adjusted profit beats", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:42:00.000+02:00", "replies_count": 0, "uuid": "963601b5b05812cdaedafe068075e2fa6b94e8ec"}, "author": "", "url": "https://www.reuters.com/article/us-lockheed-results/lockheed-martin-takes-2-billion-charge-adjusted-profit-beats-idUSKBN1FI1I2", "ord_in_thread": 0, "title": "Lockheed Martin takes $2 billion charge, adjusted profit beats", "locations": [], "entities": {"persons": [{"name": "reuter", "sentiment": "negative"}, {"name": "ankit ajmera", "sentiment": "none"}, {"name": "arun koyyur", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "lockheed martin", "sentiment": "negative"}, {"name": "lockheed martin corp", "sentiment": "none"}, {"name": "lockheed", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:42 PM / in 2 minutes Lockheed Martin revenue beats, outlook strong for 2018 Mike Stone , Ankit Ajmera 4 Min Read \n(Reuters) - Lockheed Martin Corp ( LMT.N ) reported quarterly revenue on Monday that beat Wall Street estimates, helped by higher F-35 fighter jet sales, and forecast better-than-expected 2018 profit. \nLockheed said quarterly sales in its aeronautics business, its biggest, rose 11.8 percent to $6.05 billion. The profit margin for division grew by 20 percent in the quarter as the F-35 program continued to mature. \nAt the same time, Lockheed took a $1.9 billion charge in the fourth quarter, mainly due to bringing back overseas profits and writing down the value of future tax benefits. Both charges were related to the new U.S. tax code was signed into law in December. \nLockheed gave an adjusted figure for earnings from continuing operations of $4.30 per share. \nThe Bethesda, Maryland-based company intends to take advantage of the tax cut windfall to front-load billions in pension contributions before tax rates fall in 2018. The move was foreshadowed by Chief Financial Officer Bruce Tanner during the third-quarter conference call with analysts. \nLockheed plans to pump $5 billion into its pension before Sept. 15, allowing them to be redesignated to 2017. \nLike its peers in the United States, Lockheed is also expected to gain from an increase in defense spending under U.S. President Donald Trump’s administration. \nShares of the U.S. defense contractor rose half a percent to $346.70 after touching an all time high of $354.26 during morning trading after it posted a record annual sales in 2017 of $51 billion. \nExcluding a deferred non-cash gain of $122 million, or 43 cents per share, and the tax charges, Thomson Reuters I/B/E/S calculations showed Lockheed earned $3.87 per share versus analysts estimate of $4.07 per share. \nStrength in the aeronautics business helped boost overall net sales to $15.14 billion from $13.75 billion a year earlier, beating Wall Street estimates of $14.72 billion. Lockheed Martin's logo is seen during Japan Aerospace 2016 air show in Tokyo, Japan, October 12, 2016. REUTERS/Kim Kyung-Hoon \nAdjusted for new accounting standards from Jan. 1, Lockheed said it expects 2018 net sales in the range of $50 billion to$51.5 billion and earnings per share of $15.20 to $15.50. \nAnalysts on average had previously expected full-year earnings per share of $14 and revenue of $51.2 billion. \nTrump is expected to ask for $716 billion in defense spending in the 2019 budget he is set to unveil next month, a 7 percent increase over the 2018 budget. The 2018 $700 billion budget still has not passed through Congress. \nBut analysts have panned the news of Trump’s 2019 increase as small once adjusted for inflation. \nThe U.S. Defense Department expects to spend some $391 billion over 15 years to develop and buy 2,456 of the supersonic F-35 warplanes. \nFor the year, sales in Lockheed’s aeronautics division rose to $20.1 billion from $17.7 billion while profit margins increased slightly to 10.7 percent. \nRotary and Mission Systems, which makes Sikorsky helicopters and ships, ended the year strong with quarterly net sales up 14 percent to $4.35 billion from $3.81 billion. \nLockheed’s CFO said that the CH-53K helicopter, a new program for the U.S. Marines, is expected to ramp up as the Black Hawk program slows. \nTanner told analysts during the post-earnings call on Monday, “you should think of the downturn in Black Hawk helicopter deliveries being offset by upticks in 53K volume.” \nTanner said the CH-53K is slated to debut at the Berlin air show in April as Reuters had reported in November. \nLockheed said accounting issues it had identified at Sikorsky had been rectified while reporting no significant problems. Lockheed purchased Sikorsky Aircraft from United Technologies Corp ( UTX.N ) in November 2016. Reporting by Mike Stone in Washington and Ankit Ajmera in Bengaluru; Editing by Meredith Mazzilli", "external_links": [], "published": "2018-01-29T14:42:00.000+02:00", "crawled": "2018-01-29T14:48:15.004+02:00", "highlightTitle": ""}