{"organizations": [], "uuid": "bfc12a5d092e051aaa438aef880da210d2c90366", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225187462&w=1200&r=LYNXMPEE0O17U", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-carillion-restructuring-insurance/most-uk-suppliers-uninsured-against-carillions-collapse-idUSKBN1FE28Y", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Most UK suppliers uninsured against Carillion's collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:20:00.000+02:00", "replies_count": 0, "uuid": "bfc12a5d092e051aaa438aef880da210d2c90366"}, "author": "", "url": "https://www.reuters.com/article/us-carillion-restructuring-insurance/most-uk-suppliers-uninsured-against-carillions-collapse-idUSKBN1FE28Y", "ord_in_thread": 0, "title": "UPDATE 2-Most UK suppliers uninsured against Carillion's collapse", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "negative"}, {"name": "carolyn cohn", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "association of british insu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:28 PM / in 31 minutes Most UK suppliers uninsured against Carillion's collapse Carolyn Cohn 3 Min Read \nLONDON (Reuters) - British suppliers to collapsed contractor Carillion ( CLLN.L ) stand to recover only a tiny proportion of their estimated losses of 1.2 billion pounds from insurers because most were not covered against the risk. \nThe construction and outsourcing company collapsed on Jan. 15 under the weight of at least 2.2 billion pounds in debt and pension liabilities in Britain’s biggest corporate failure in a decade. \nCarillion was working on 450 state projects, including the building and maintenance of hospitals and schools, defense sites and a high-speed rail line, and its collapse left a trail of unpaid bills to thousands of small subcontractors. \nBut most UK suppliers to Carillion were not insured against the risk of not being paid for the goods and services they provided, data released on Thursday showed. \nInsurers expect to pay out only 31 million pounds in trade credit insurance claims to affected suppliers, the Association of British Insurers (ABI) said. \nThat is less than 3 percent of their estimated losses. \nCarillion’s collapse has raised concerns about the hundreds of small British companies that have not been paid for the services they provided, forcing some to lay off staff. \n“One insolvency can risk a domino effect to hundreds of firms in the supply chain,” said Mark Shepherd, assistant director at the ABI. \nCreditors are only expected to recover between less than one penny and 6.6 pence of every pound they are owed in insolvency proceedings, according to court papers. \nBritain’s biggest banks have announced a range of measures to support firms and contractors hit by Carillion’s collapse, including opening funds for suppliers. \nFirms can buy trade credit insurance, often from specialist providers such as Euler Hermes ( ELER.PA ), to cover the risk of not being paid for the goods and services they provide in case of insolvency or other problems. \nTrade credit insurers paid 210 million pounds to businesses in 2016 for non-payment claims, the ABI said. Businesses held almost 12,000 such policies, up 1 percent on the previous year. \nHowever, insurance purchases among small businesses tend to be relatively low, industry specialists said. \n“In most classes of (insurance) business, we see significant gaps between economic (actual) loss and insured loss,” said one senior executive in the Lloyd’s of London speciality insurance market, speaking on condition of anonymity. \nTrade credit insurers are also getting nervous about offering policies for non-payment by similar companies, he added. \n“When you have high-profile events like this, it is inevitable that (insurers) will look across the affected sector to see if they need to adapt their underwriting appetite,” he said. Reporting by Carolyn Cohn, additional reporting by Andrew MacAskill; editing by Jason Neely and Adrian Croft", "external_links": [], "published": "2018-01-25T17:20:00.000+02:00", "crawled": "2018-01-25T17:56:14.033+02:00", "highlightTitle": ""}