{"organizations": [], "uuid": "5792ba40595592ccb79957a7ca72e6598f5bb2e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218745873&w=1200&r=LYNXMPEE0106C", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/hyundai-motor-kia-motors-sales/hyundai-kia-2017-global-sales-at-7-25-million-vehicles-miss-target-idINKBN1ER0BN", "country": "US", "domain_rank": 408, "title": "Hyundai Motor, Kia Motors flag slow sales recovery in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T10:24:00.000+02:00", "replies_count": 0, "uuid": "5792ba40595592ccb79957a7ca72e6598f5bb2e3"}, "author": "", "url": "https://in.reuters.com/article/hyundai-motor-kia-motors-sales/hyundai-kia-2017-global-sales-at-7-25-million-vehicles-miss-target-idINKBN1ER0BN", "ord_in_thread": 0, "title": "Hyundai Motor, Kia Motors flag slow sales recovery in 2018", "locations": [], "entities": {"persons": [{"name": "hyunjoo jin", "sentiment": "none"}, {"name": "joyce lee", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "hyundai motor", "sentiment": "negative"}, {"name": "kia motors", "sentiment": "negative"}, {"name": "kia", "sentiment": "none"}, {"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s Hyundai Motor and Kia Motors on Tuesday flagged 4 percent sales growth in 2018, suggesting a slow recovery from a slump linked to their lack of SUVs in the United States and diplomatic tensions with China.\nEmployees of Hyundai Motor walk past the company's logo after the company's New Year ceremony in Seoul, South Korea, January 2, 2018. REUTERS/Kim Hong-Ji Hyundai and smaller affiliate Kia said demand was expected to soften in the U.S. and Chinese markets as they unveiled a combined sales target of 7.55 million vehicles this year, from 7.25 million vehicles last year.\n”The market environment is expected to be difficult due to a slowdown in major markets like the U.S. and China, prolonged low growth in the global economy and trade protectionism in major countries,” Hyundai Motor said in a statement.\nSales slumped 7 percent last year from 2016, falling well short of the firms’ target of 8.25 million vehicles and marking their third consecutive annual miss, as buyers in China and the United States increasingly shunned sedans for SUVs.\nA diplomatic row between China and South Korea over Seoul’s deployment of a U.S. missile defence system also hit the carmakers’ sales in the world’s biggest auto market, although two countries recently agreed to normalise ties.\n“This year’s target for Hyundai and Kia is lower than expected. It seems to be a conservative target, reflecting a slow recovery in China and ongoing U.S difficulties,” Kim Jin-woo, an analyst at Korea Investment & Securities said.\nHyundai Motor shares ended down 4.2 percent on Tuesday, and Kia Motors stocks finished 2.1 percent lower. The broader market rose 0.5 percent.\nThe grim outlook came as the Korean won strengthened to a more than three-year high against the dollar on Tuesday, threatening the competitiveness of South Korean exporters as their Japanese rivals benefit from the weakening yen.\nThe expiration of a tax cut on small-engine cars in China also would be a negative for Hyundai’s sedan-heavy line-up, they said.\nWhile Hyundai Motor has plans to offer more SUVs in the United States and China this year, analysts said new models such as the redesigned Santa Fe SUV may come too late in the year to significantly impact sales.\nHyundai Motor Group chairman Chung Mong-koo said in a statement it would “actively venture into” new markets like Southeast Asia, as protectionism was expected to grow elsewhere.\nSouth Korea and the United States will hold talks on a trade deal on Jan. 5 although U.S. President Donald Trump has threatened to withdraw from the pact.\nChung, 79, skipped his annual New Year speech to employees for a second year in a row. He has not made any public appearances since December, 2016.\nReporting Hyunjoo Jin and Joyce Lee; Editing by Stephen Coates\n ", "external_links": [], "published": "2018-01-02T10:24:00.000+02:00", "crawled": "2018-01-02T10:46:41.019+02:00", "highlightTitle": ""}