{"organizations": [], "uuid": "8bf9f64b73e41b2e4895b54bbeca4594f364543b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/30/104681315-_Y2A7721.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/how-warren-buffetts-past-financial-predictions-have-panned-out.html", "country": "US", "domain_rank": 767, "title": "How Warren Buffett's past financial predictions have panned out", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.215, "site_type": "news", "published": "2018-01-11T18:26:00.000+02:00", "replies_count": 0, "uuid": "8bf9f64b73e41b2e4895b54bbeca4594f364543b"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/11/how-warren-buffetts-past-financial-predictions-have-panned-out.html", "ord_in_thread": 0, "title": "How Warren Buffett's past financial predictions have panned out", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "warren", "sentiment": "negative"}, {"name": "cramer", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}], "locations": [{"name": "omaha", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Weighing in on the current cryptocurrency craze, billionaire investor Warren Buffett said that he believes the future of bitcoin is bleak. \"In terms of cryptocurrencies, generally, I can say with almost certainty that they will come to a bad ending,\" Buffett told CNBC on \"Squawk Box\" Wednesday.\nIn the wake of Buffett's remarks, Jim Cramer, host of CNBC's \"Mad Money\" tweeted out, \"Does anyone else think it is as comedic as I do that the cryptomaniacs trashed Buffett as an old hack who doesn't understand good investments?\"\n\"Buffett has admitted that he missed Amazon and Google . But how about the fact that he has outperformed every other manager on earth? Cryptomaniacs hate that, too?\" Cramer wrote.\nTWEET\nTWEET\nIndeed, the CEO of Berkshire Hathaway is famous because so many of his financial predictions have come true. That's how he ended up with a net worth of over $81 billion and the nickname \"The Oracle of Omaha.\"\nStill, Buffett investment ideas aren't bulletproof, as Cramer notes. He has been wrong. Here's how some of the billionaire's most important past predictions have shaped up.\nHe bet on Bank of America's comeback — and won In 2011, when Bank of America was struggling post-financial crisis with legal issues, Buffett boldly bet on the bank's comeback. That decision paid off, big-time.\nBuffett's Berkshire struck up a deal with the bank in which, for $5 billion, Berkshire would receive preferred shares of Bank of America, which paid out an annual dividend of 6 percent, as well as the right to buy warrants of 700 million shares of the bank's common stock at a deeply-discounted exercise price of $7.14 each by 2021.\n\"This is a vote of confidence by a savvy investor,\" Bank of America's chairman Chad Holliday said in an interview with The Wall Street Journal in 2011. \"We've got some work to do. We understand that. He understands that.\"\nIn the summer of 2017, when the bank passed the Federal Reserve's \"stress tests,\" it was able to boost its annual dividend, which triggered Buffett's ability to exercise those warrants. At that time, Bank of America common stock shares were worth over $24. He was able to turn a profit of $12 billion from his $5 billion investment, CNBC reports .\nDavid A. Grogan | CNBC Warren Buffett He was right about airlines, and also wrong For years, Buffett criticized the airline industry for not being a sound investment.\n\"Investors have poured their money into airlines and airline manufacturers for 100 years with terrible results,\" Buffett said in a shareholder meeting in 2013, Fortune reports . \"It's been a death trap for investors.\"\nHis aversion dated back to 1989, when Berkshire bought $358 million in preferred shares in U.S. Airways that quickly dropped in value. While he ultimately did make money on the deal, Buffett reportedly called the investment a mistake in nearly every annual letter from 1989 to 1996, according to CNBC .\nIn a 2007 note to shareholders, he even wrote, \"… if a farsighted capitalist had been present at Kitty Hawk, he would have done his successors a huge favor by shooting Orville down.\"\nBut the billionaire has evolved, and Berkshire made a surprisingly big bet in the industry: In 2016, revealed big stakes in several U.S. airlines.\n\"It's true that the airlines had a bad 20th century. They're like the Chicago Cubs. And they got that bad century out of the way, I hope,\" Buffett said in 2016 on \"Squawk Box.\" \"The hope is they will keep orders in reasonable relationship to potential demand.\"\nHe nailed it on S&P index funds A long-time, vocal advocate for S&P 500 low-cost index funds, in 2007, Buffett made a $1 million bet against Protégé Partners that hedge funds wouldn't outperform an S&P index fund over a decade.\nBuffett won: His choice fund, the Vanguard 500 Index Fund Admiral Shares, returned 7.1 percent compounded annually, while his competitor's basket of hedge funds returned an average of 2.2 percent, according the The Wall Street Journal.\nAs a result of the win, Buffett donated the prize, which appreciated faster than expected to $2.22 million, to Girls Inc. in Omaha.\nHe was very wrong on tech Buffett didn't initially believe in tech giants like Google and Amazon.\nIn 2017, the billionaire investor admitted that passing up on Google years before, when the company was receiving $10 or $11 per advertising click from Berkshire Hathaway consumer insurance company subsidiary Geico, was a mistake, CNBC reports .\nBuffett also expressed regret over not investing in Amazon when he had the opportunity. \"I did not think [founder Jeff Bezos] could succeed on the scale he has,\" Buffett said to shareholders in May 2017.\nSo far he's called the U.S. economy under Trump Although the billionaire openly backed 2016 Democratic candidate Hillary Clinton, he remained optimistic about what the economy would be like after President Donald Trump was elected even when others were worried.\nShortly before Trump's inauguration, Buffett proclaimed that the U.S. economy would continue chugging along under the new president.\n\"America works,\" Buffet told CNBC in January 2017 . \"I've said this before. It'll work wonderfully under Hillary Clinton, and I think it'll work fine under Donald Trump.\"\n\"There will be hiccups from time to time in the economy,\" he said. \"[But] we'll do well over time.\"\nBerkshire's optimism has seemed to hold true. In December, The CNBC All-American Economic Survey found that for the first time in at least 11 years, over half of the respondents rated the economy as good or excellent. The Dow Jones industrial average has also recently hit record highs , reaching some pretty major milestones.\nDon't miss : Warren Buffett is one step closer to naming his successor—here's a key trait he'll be looking for\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Warren Buffett thinks cryptocurrencies will end badly 21 Hours Ago | 00:59", "external_links": [], "published": "2018-01-11T18:26:00.000+02:00", "crawled": "2018-01-11T18:27:44.078+02:00", "highlightTitle": ""}