{"organizations": [], "uuid": "309cca6c584f4a67e594b2992e81996a3b8ce5ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-united-states-lime-minerals-reports-fourth-quarter-and-full-year-2017-results-and-declares-regular-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "United States Lime & Minerals Reports Fourth Quarter And Full Year 2017 Results And Declares Regular Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:43:00.000+02:00", "replies_count": 0, "uuid": "309cca6c584f4a67e594b2992e81996a3b8ce5ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-united-states-lime-minerals-reports-fourth-quarter-and-full-year-2017-results-and-declares-regular-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "United States Lime & Minerals Reports Fourth Quarter And Full Year 2017 Results And Declares Regular Quarterly Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 30, 2018 /PRNewswire/ -- United States Lime & Minerals, Inc. (NASDAQ: USLM) today reported fourth quarter and full year 2017 results: Revenues in the fourth quarter 2017 were $35.2 million, compared to $34.2 million in the comparable prior year quarter, an increase of $1.1 million, or 3.1%. Revenues from the Company's Lime and Limestone Operations in the fourth quarter 2017 increased $1.1 million, or 3.4%, to $34.7 million from $33.6 million in the comparable 2016 quarter, while revenues from its Natural Gas Interests decreased $65 thousand, or 10.8%, to $537 thousand from $602 thousand in the comparable prior year quarter. For the full year 2017, revenues were $144.8 million, compared to $139.3 million in 2016, an increase of $5.6 million, or 4.0%. Revenues from the Company's Lime and Limestone Operations in 2017 increased $5.4 million, or 4.0%, to $142.6 million from $137.2 million in 2016. Revenues from its Natural Gas Interests increased $0.1 million, or 6.7%, to $2.2 million in 2017 from $2.1 million in 2016.\nThe increase in lime and limestone revenues in the fourth quarter 2017, as compared to the fourth quarter 2016, resulted primarily from increased demand from the Company's oil and gas services and industrial customers, partially offset by decreased demand from its environmental and construction customers. The increase in the Company's lime and limestone revenues in the full year 2017, compared to 2016, resulted primarily from increased sales volumes due to increased demand, principally from its oil and gas services and industrial customers, partially offset by reduced demand from its environmental customers. Prices realized for the Company's lime and limestone products were slightly higher in each of the fourth quarter and full year 2017, compared to the comparable 2016 periods.\nProduction volumes from the Company's Natural Gas Interests in the fourth quarter 2017 totaled 133 thousand MCF, sold at an average price of $4.03 per MCF, compared to 151 thousand MCF, sold at an average price of $3.98 per MCF, in the comparable 2016 quarter. Production volumes in the full year 2017 from Natural Gas Interests totaled 559 thousand MCF, sold at an average price of $3.99 per MCF, compared to 2016 when 625 thousand MCF was produced and sold at an average price of $3.35 per MCF. The Company's average prices per MCF were higher in the 2017 periods, compared to the prior year periods, due to increases in market prices for natural gas and natural gas liquids .\nThe Company's gross profit was $7.8 million in the fourth quarter 2017, compared to $7.4 million in the comparable 2016 quarter, an increase of $0.3 million, or 4.3%. Gross profit in 2017 was $34.4 million, an increase of $1.3 million, or 3.9%, from $33.1 million in 2016.\nIncluded in gross profit in the fourth quarter and full year 2017 were $7.4 million and $33.7 million, respectively, from the Company's Lime and Limestone Operations, compared to $7.4 million and $33.0 million, respectively, in the comparable 2016 periods. Gross profit for the Company's Lime and Limestone Operations in the fourth quarter 2017 was essentially flat compared to the fourth quarter 2016, as increased revenues were largely offset by higher costs of operations. The increased gross profit in the full year 2017, compared to 2016, resulted primarily from the increased revenues in 2017 discussed above.\nGross profit from the Company's Natural Gas Interests in the fourth quarter and full year 2017 were $318 thousand and $728 thousand, respectively, compared to gross profit of $79 thousand and $60 thousand in the fourth quarter and full year 2016, respectively. The increase in gross profit from the Company's Natural Gas Interests in each of the fourth quarter and full year 2017, compared to the comparable 2016 periods, was primarily due to lower depletion and lease operating expenses and price increases in the 2017 periods, compared to the comparable 2016 periods.\nIncome tax benefit was $6.2 million and $2.2 million in the fourth quarter and full year 2017, compared to income tax expense of $1.2 million and $5.9 million in the fourth quarter and full year 2016, respectively. Income tax benefit in the fourth quarter and full year 2017 included a benefit of $7.4 million ($1.33 per share diluted in each of the fourth quarter and full year 2017) due to a reduction in the enacted federal income tax rates in the United States and the one-time impact of the lower rate on deferred tax liabilities, net.\nThe Company reported net income of $11.6 million ($2.07 per share diluted) in the fourth quarter 2017, compared to net income of $3.9 million ($0.70 per share diluted) in the fourth quarter 2016, an increase of $7.7 million, or 195.5%. The Company reported net income of $27.1 million for the full year 2017 ($4.86 per share diluted), compared to net income of $17.8 million ($3.19 per share diluted) in 2016, an increase of $9.4 million, or 52.9%. The increases in net income in the 2017 periods, compared to the 2016 periods, include the $7.4 million income tax benefit discussed above.\nOn November 17, 2017, the Company announced a 12-month extension of its repurchase program to repurchase up to the approximately $7.2 million of its common stock remaining under the program. No additional shares have been repurchased to date.\n\"Demand for our lime and limestone products in the fourth quarter and full year 2017 remained steady. In addition to the St. Clair replacement kiln project, we continue to seek innovative ways to enhance efficiencies at all of our facilities so we can compete in what remains a challenging pricing environment,\" said Timothy W. Byrne, President and Chief Executive Officer.\nMr. Byrne added: \"The Company is pleased to announce a $500 bonus for all non-executive employees. I am excited to invest a portion of the savings to the Company from the recently passed tax legislation directly back to our employees, which are our most important asset and the foundation of our continued success.\"\nDividend\nThe Company also announced today that the Board of Directors has declared a regular quarterly cash dividend of $0.135 (13.5 cents) per share on the Company's common stock. This dividend is payable on March 16, 2018 to shareholders of record at the close of business on February 23, 2018.\nUnited States Lime & Minerals, Inc., a NASDAQ-listed public company with headquarters in Dallas, Texas, is a manufacturer of lime and limestone products, supplying primarily the construction (including highway, road and building contractors), industrial (including paper and glass manufacturers), environmental (including municipal sanitation and water treatment facilities and flue gas treatment processes), metals (including steel producers), oil and gas services, roof shingle and agriculture (including poultry and cattle feed producers) industries. The Company operates lime and limestone plants and distribution facilities in Arkansas, Colorado, Louisiana, Oklahoma and Texas through its wholly owned subsidiaries, Arkansas Lime Company, Colorado Lime Company, Texas Lime Company, U.S. Lime Company, U.S. Lime Company – Shreveport, U.S. Lime Company – St. Clair and U.S. Lime Company – Transportation. In addition, the Company, through its wholly owned subsidiary, U.S. Lime Company – O & G, LLC, has royalty and non-operating working interests pursuant to an oil and gas lease and a drillsite agreement on its Johnson County, Texas property, located in the Barnett Shale Formation.\nAny statements contained in this news release that are not statements of historical fact are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. The Company undertakes no obligation to publicly update or revise any forward-looking statements, and investors are cautioned that such statements involve risks and uncertainties that could cause actual results to differ materially from expectations, including without limitation those risks and uncertainties indicated from time to time in the Company's filings with the Securities and Exchange Commission.\n(Tables Follow)\nUnited States Lime & Minerals, Inc.\nCONDENSED CONSOLIDATED FINANCIAL DATA\n(In thousands, except per share amounts)\n(Unaudited)\nThree Months Ended\nYear Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nINCOME STATEMENTS\nRevenues\nLime and limestone operations\n$\n34,702\n$\n33,564\n$\n142,612\n$\n137,190\nNatural gas interests\n537\n602\n2,232\n2,092\nTotal\n$\n35,239\n$\n34,166\n$\n144,844\n$\n139,282\nGross profit (loss)\nLime and limestone operations\n$\n7,434\n$\n7,355\n$\n33,652\n$\n33,032\nNatural gas interests\n318\n79\n728\n60\nTotal\n$\n7,752\n$\n7,434\n$\n34,380\n$\n33,092\nOperating profit\n$\n5,194\n$\n5,035\n$\n24,227\n$\n23,480\nInterest expense\n67\n61\n241\n246\nInterest and other income, net\n(292)\n(146)\n(957)\n(384)\nIncome tax (benefit) expense\n(6,164)\n1,200\n(2,205)\n5,864\nNet income\n$\n11,583\n$\n3,920\n$\n27,148\n$\n17,754\nIncome per share of common stock:\nBasic\n$\n2.08\n$\n0.70\n$\n4.87\n$\n3.19\nDiluted\n$\n2.07\n$\n0.70\n$\n4.86\n$\n3.19\nWeighted-average shares outstanding:\nBasic\n5,579\n5,565\n5,577\n5,568\nDiluted\n5,592\n5,572\n5,588\n5,572\nCash dividends per share of common stock\n$\n0.135\n$\n0.125\n$\n0.540\n$\n0.500\nDecember 31,\nDecember 31,\n2017\n2016\nBALANCE SHEETS\nAssets:\nCurrent assets\n$\n118,015\n$\n105,036\nProperty, plant and equipment, net\n109,718\n104,981\nOther assets, net\n713\n142\nTotal assets\n$\n228,446\n$\n210,159\nLiabilities and Stockholders' Equity:\nCurrent liabilities\n$\n9,359\n$\n9,108\nDeferred tax liabilities, net\n12,374\n19,832\nOther liabilities\n1,461\n1,580\nStockholders' equity\n205,252\n179,639\nTotal liabilities and stockholders' equity\n$\n228,446\n$\n210,159\nView original content: http://www.prnewswire.com/news-releases/united-states-lime--minerals-reports-fourth-quarter-and-full-year-2017-results-and-declares-regular-quarterly-cash-dividend-300590720.html\nSOURCE United States Lime & Minerals, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/united-states-lime--minerals-reports-fourth-quarter-and-full-year-2017-results-and-declares-regular-quarterly-cash-dividend-300590720.html"], "published": "2018-01-31T01:43:00.000+02:00", "crawled": "2018-01-31T02:08:10.003+02:00", "highlightTitle": ""}