{"organizations": [], "uuid": "fda1f65dcdbea74b72137fb7ede59859618f287a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-selligent-strengthens-relationship-management-and-consulting-leadership.html", "country": "US", "domain_rank": 767, "title": "Selligent Strengthens Relationship Management and Consulting Leadership", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "fda1f65dcdbea74b72137fb7ede59859618f287a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-selligent-strengthens-relationship-management-and-consulting-leadership.html", "ord_in_thread": 0, "title": "Selligent Strengthens Relationship Management and Consulting Leadership", "locations": [], "entities": {"persons": [{"name": "selligent", "sentiment": "none"}, {"name": "melville", "sentiment": "none"}, {"name": "rob melville", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "redwood city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "selligent’s relationship management", "sentiment": "none"}, {"name": "silicon valley ceo", "sentiment": "none"}, {"name": "coo", "sentiment": "none"}, {"name": "experian cross channel marketing", "sentiment": "none"}, {"name": "cheetah digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "REDWOOD CITY, Calif. and BRUSSELS, Belgium, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Selligent, a provider of relationship marketing SaaS solutions based on consumer insights, is announcing several important additions to its global leadership team. The new hires join the company as it accelerates its growth globally and looks to underline its marketplace position as the preferred vendor of choice for ambitious brands seeking an intuitive and flexible alternative to the industry’s marketing cloud giants.\nFollowing recent additions to the executive team, including blue chip Silicon Valley CEO, COO and CFO hires, Selligent has moved to deepen its bench with seasoned, client-focused leaders who have proven track records in delivering the best products and services on the market at scale.\nRob Melville joins Selligent as Vice President of Relationship Management. Melville will work with Selligent’s Relationship Management team to deepen client relationships and drive customer success programs. He comes to Selligent from Cheetah Digital (Formerly Experian Cross Channel Marketing). Melville started with Cheetah Mail in 2003, where he held both client and partnership management roles. Melville brings a combination of deep tactical knowledge and operational excellence that will help Selligent deliver high quality service to its fast-growing client roster.\nKevin Evans also joins the Selligent leadership team as Vice President of Strategic Alliances. Evans will oversee strategic technical partnerships to grow Selligent’s technology and product partner ecosystem. Evans spent over five years at Salesforce in sales strategy and business development roles, most recently leading strategic product partnerships for the Service Cloud division.\nTodd McCaslin is being promoted from VP to SVP of Global Solution Consulting a move that underlines the premium Selligent places on strong leadership. In this role, he will lead consulting services and strategy globally. McCaslin, who has a background in engineering, joined Selligent from Oracle, where he was the Director of Service Solutions.\n“Rob and Kevin are fantastic additions to the Selligent team, with successful track records at some of the largest marketing technology companies in the world,” said Selligent CEO John Hernandez. “It is also my pleasure to announce Todd’s well-deserved promotion to SVP, as he has consistently delivered growth and operational excellence in Solution Consulting for Selligent. Our team has a deep bench with the experience and drive to take Selligent to the next level of performance and growth.”\nAbout Selligent\nSelligent’s omnichannel marketing platform empowers marketers to engage with consumers using relevant insights. Our technology was built to support our Consumer-First Marketing philosophy, which makes consumer needs the trigger for all brand actions. With Selligent, B2C brands can bridge the gap between big data and real-time campaign execution, creating valuable interactions across channels that become more relevant over time.\nMore than 700 brands across retail, travel, automotive, publishing, and financial services rely on Selligent’s proven platform, including InterContinental Hotels Group and ING. With 10 offices across the United States and Europe and more than 50 agency partners and resellers, Selligent serves over 30 countries with local, personalized service.\nLearn more at www.selligent.com and connect with the team at Twitter , LinkedIn , and our blog .\nContact\nEmily Riley\nWIT Strategy\n(914) 330-1128\neriley[at] witstrategy.com\nSource: Selligent", "external_links": ["https://www.globenewswire.com/Tracker?data=ZTGCewkvT2V1ZU_SA5gou0Jg9dF3ygxIVwfeoDOwTCqqKt2xZ2bqdC2-n_-krGX1P75DFW2uHzJZoAJUlj54VSPpO-9lw0ywfOWgj7XwPd4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9c5b6c84-718a-4422-992a-8b9b2c4fa0d0", "https://www.globenewswire.com/Tracker?data=cjOA7yOoq9i6R4YN0xLBt9rbn7R94dNOOiuytmYk-_xeqJXRzvXzcdl-N_KS4NGL4SMslwIridG--j1EvbGIiA==", "https://www.globenewswire.com/Tracker?data=AGu_2VuBmmdluO6HLVLkObiqBP3mZkok8Alj-Z1E1lsxIZzFAJeVVpxNDkEgdi1Hk5y6MCNOKnnIRTvfsEhqlw==", "https://www.globenewswire.com/Tracker?data=G_vc_TUoIMTOO7a7IZTTF0HOEYiImnte_oIy_dgNa0sfFSHj29rXx8PlHCx2TjQ7S1kz6S6uN9m6C2q41BcJrg=="], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:50:16.001+02:00", "highlightTitle": ""}