{"organizations": [], "uuid": "28a34320f303293a50168373ce5a9ed9e074589a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-one-rock-capital-partners-to-acquire-robertshaw.html", "country": "US", "domain_rank": 767, "title": "One Rock Capital Partners To Acquire Robertshaw", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.206, "site_type": "news", "published": "2018-01-05T17:00:00.000+02:00", "replies_count": 0, "uuid": "28a34320f303293a50168373ce5a9ed9e074589a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-one-rock-capital-partners-to-acquire-robertshaw.html", "ord_in_thread": 0, "title": "One Rock Capital Partners To Acquire Robertshaw", "locations": [], "entities": {"persons": [{"name": "robertshaw", "sentiment": "negative"}, {"name": "mark l. balcunas", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "itasca", "sentiment": "none"}], "organizations": [{"name": "rock capital partners", "sentiment": "negative"}, {"name": "robertshaw holdings s.a.r.l.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, One Rock Capital Partners, LLC (\"One Rock\") announced today that one of its affiliates has signed a definitive agreement to acquire Robertshaw Holdings S.a.r.l. (\"Robertshaw\"). Financial terms of the transaction were not disclosed.\nHeadquartered in Itasca, IL, Robertshaw is a global leader in thermal, flow and control management products and solutions for residential and commercial appliances, HVAC and transportation applications. Robertshaw services its global blue-chip customer base through manufacturing, R&D, support and distribution facilities in 11 countries around the world.\nMark L. Balcunas, who has been with Robertshaw since 1979, will remain CEO and stated, \"We will become an even stronger supplier of controls and solutions to the industries we serve through our One Rock partnership. With their support, my leadership team and I are excited about our future. Robertshaw will continue to invest in new product offerings, state of the art engineering and manufacturing capabilities, and the expansion of our market-leading product positions through targeted niche acquisitions, with the most recent being Burner Systems International.\"\nTony W. Lee, Managing Partner of One Rock, commented, \"Robertshaw is a proven industry leader with a strong reputation in the market and proven commitment to its customers. We are excited to work alongside Robertshaw's management team to continue developing the business and enhancing its ability to serve customers globally.\" One Rock Managing Partner R. Scott Spielvogel added, \"One Rock's Operating Partners have decades of experience in businesses related to Robertshaw, and we believe that pairing One Rock's operational resources with Robertshaw's proven management team can deliver more value for customers and accelerated growth for the company.\"\nABOUT ROBERTSHAW\nRobertshaw is a leading global provider of components, systems, and services used in the appliance industry and in heating, air conditioning and refrigeration for the residential and commercial markets. Robertshaw has more than 6,100 employees in 11 countries, and is headquartered in Itasca, Illinois.\nABOUT ONE ROCK CAPITAL PARTNERS, LLC\nOne Rock makes controlling investments in companies with potential for growth and operational improvement using a rigorous approach that utilizes highly experienced Operating Partners to identify, acquire and enhance businesses in select industries. The involvement of these Operating Partners affords One Rock the ability to conduct due diligence and consummate acquisitions and investments in all types of situations, regardless of complexity. One Rock works collaboratively with company management and its Operating Partners to develop a comprehensive business plan focused on growing the enterprise and enhancing its profitability to enhance long-term value. For more information, visit www.onerockcapital.com .\nContact\nOne Rock Capital Partners, LLC: 212-605-6000\n releases/one-rock-capital-partners-to-acquire-robertshaw-300578023.html\nSOURCE One Rock Capital Partners, LLC", "external_links": ["http://www.onerockcapital.com/", "http://www.prnewswire.com/news-releases/one-rock-capital-partners-to-acquire-robertshaw-300578023.html"], "published": "2018-01-05T17:00:00.000+02:00", "crawled": "2018-01-05T17:52:47.009+02:00", "highlightTitle": ""}