{"organizations": [], "uuid": "9a57c8a8597a419155aacac6ee4931b0eebf8cd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-magellan-mids-pipeline-regulator/oil-producers-want-new-hearing-on-impact-of-magellan-proposal-idUSKBN1F62C8", "country": "US", "domain_rank": 408, "title": "Oil producers want new hearing on impact of Magellan proposal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:28:00.000+02:00", "replies_count": 0, "uuid": "9a57c8a8597a419155aacac6ee4931b0eebf8cd7"}, "author": "", "url": "https://www.reuters.com/article/us-magellan-mids-pipeline-regulator/oil-producers-want-new-hearing-on-impact-of-magellan-proposal-idUSKBN1F62C8", "ord_in_thread": 0, "title": "Oil producers want new hearing on impact of Magellan proposal", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters sta", "sentiment": "negative"}, {"name": "magellan", "sentiment": "negative"}, {"name": "magellan midstream partners", "sentiment": "none"}, {"name": "energy transfer partners", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "wpx energy", "sentiment": "none"}, {"name": "u.s. federal energy regulatory commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "plains all american’s plains marketing lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 5:33 PM / a few seconds ago Oil producers want new hearing on impact of Magellan proposal Reuters Staff 3 Min Read \nNEW YORK (Reuters) - Oil and gas producers WPX Energy and Chevron have asked a U.S. regulator for a new hearing on the broad industry impact of Magellan Midstream Partners’ request to launch a marketing arm, signaling concerns about the effect it could have on shipping oil in the United States. \nThe two firms late on Tuesday became the latest energy companies, including Plains All American’s Plains Marketing LP and Energy Transfer Partners , to raise questions after Magellan requested another hearing on the marketing arm issue. \nOn Nov. 22, the U.S. Federal Energy Regulatory Commission (FERC) denied Magellan’s proposal to establish a marketing affiliate to buy, sell and ship crude oil. Marketing arms are common in the pipeline industry and most of the top 10 largest U.S. pipeline operators have already established their own marketing or trading arms. \nMagellan requested a rehearing on Dec. 22. That request has drawn opposition from several companies that originally favored the proposal, saying Magellan is raising broad issues that could jeopardize existing marketing affiliates and disrupt existing practices. \nWPX and Chevron were the latest to weigh in with FERC, saying in a filing that the regulator should request comments from industry participants “so that any changes to long-held existing practices can be determined on the basis of a comprehensive factual record.” \n“Multiple questions have arisen within the industry” related to the Nov. 22 FERC ruling, and its “impact on the oil market in the future,” WPX Energy Marketing LLC and Chevron Products Co, a unit of Chevron USA Inc, said in their filing. \nIf FERC intends to change its policies in a way that would have “substantive changes to existing commonplace, industry-wide practices,” then a final ruling on Magellan’s request should be postponed until a broader hearing is finished, they said. \n“It would be manifestly unfair to find violations within the industry prior to ensuring that the Commission’s policies are clearly stated, clearly understood, and all industry participants have been provided notice,” the companies said. \nMagellan, in an emailed statement to Reuters, noted that following the November response from FERC, it “filed a request to FERC for additional clarification,” adding that it has not “assumed the creation of such a marketing affiliate in our future projections.” Reporting by Devika Krishna Kumar in New York; Editing by Tom Brown", "external_links": [], "published": "2018-01-17T19:28:00.000+02:00", "crawled": "2018-01-17T19:48:02.008+02:00", "highlightTitle": ""}