{"organizations": [], "uuid": "b74c999d7adc50f38c37a27e30427673b184bb43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-havertys-reports-sales-for-fourth-quarter-and-impact-of-tax-act.html", "country": "US", "domain_rank": 767, "title": "Havertys Reports Sales for Fourth Quarter and Impact of Tax Act", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-08T14:29:00.000+02:00", "replies_count": 0, "uuid": "b74c999d7adc50f38c37a27e30427673b184bb43"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-havertys-reports-sales-for-fourth-quarter-and-impact-of-tax-act.html", "ord_in_thread": 0, "title": "Havertys Reports Sales for Fourth Quarter and Impact of Tax Act", "locations": [], "entities": {"persons": [{"name": "clarence h. smith", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, HAVERTYS (NYSE:HVT) (NYSE:HVT.A) today reported sales for the quarter ended December 31, 2017.\nHavertys sales for the fourth quarter 2017 decreased 2.6% to $215.0 million, compared with $220.6 million for the fourth quarter of 2016. On a comparable store basis, sales for the quarter were down 3.5%. Comparable store sales do not include locations opened, closed or otherwise non-comparable during the last 12 months. Sales for the twelve months of 2017 totaled $819.9 million, compared with $821.6 million in 2016, representing a decrease of 0.2%. On a comparable store basis, sales decreased 1.3% for the twelve months.\nTotal written sales for the fourth quarter of 2017 were up 0.3% and written comparable store sales decreased 0.7% over the same period last year.\nSales in Millions\n(unaudited) Total\nSales\n% Change Comparable\nStore Sales\n% Change 2017 2016 Fourth Quarter $215.0 $220.6 -2.6% -3.5% Twelve Months $819.9 $821.6 -0.2% -1.3% Clarence H. Smith, chairman, president and CEO, said, “The fourth quarter sales were disappointing. There was a heavy concentration of traffic and sales during the traditional shopping period around Thanksgiving and much softer business before and afterwards. We did see an increase in our conversion rate on traffic and the average ticket increased 2.2% over last year’s quarter.\nWe believe the recently enacted tax law changes will be beneficial to our customers and to Havertys. Our effective tax rate has historically included a 35% Federal rate and the lowering to 21% along with the immediate deductions for certain new investments instead of deductions for depreciation expense over time will be favorable to our financial results.”\nImpact of Tax Act\nOn December 22, 2017, the President signed into law Public Law No. 115-97, commonly referred to as the Tax Cuts and Jobs Act (the “Tax Act”). The Tax Act contains significant changes to corporate taxes, including a permanent reduction of the corporate tax rate from 35% to 21% effective January 1, 2018. The reduction in the corporate rate will require a one-time revaluation of certain tax-related assets. Based on preliminary estimates, it is currently expected the revaluation will result in a one-time tax charge of $3.5 million to $4.0 million, which will be recorded as additional income tax expense in Havertys’ consolidated statement of comprehensive income for the fourth quarter of 2017. This estimated range is based upon a review and analysis of the net deferred tax assets at September 30, 2017, and expected adjustments in the fourth quarter. Havertys actual write-down may vary from this range as it is dependent on the final net deferred tax assets as of December 31, 2017.\nHavertys anticipates subsequent regulations and interpretations to be released associated with the Tax Act that will provide additional guidance on its application; however, we currently estimate that Havertys effective tax rate for 2018 will be in the range of 24% to 26%.\nThe Company will release fourth quarter 2017 financial results on Tuesday, February 20, 2018, after the market closes. Havertys will host a conference call with analysts and investors on Wednesday, February 21, 2018 at 10:00 a.m. (ET).\nAbout Havertys\nHavertys (NYSE:HVT) (NYSE:HVT.A), established in 1885, is a full-service home furnishings retailer with 124 showrooms in 16 states in the Southern and Midwestern regions providing its customers with a wide selection of quality merchandise in middle to upper-middle price ranges. Additional information is available on the Company’s website havertys.com .\nNews releases include , which are subject to risk and uncertainties. Factors that might cause actual results to differ materially from future results expressed or implied by such include, but are not limited to, general economic conditions, the consumer spending environment for large ticket items, competition in the retail furniture industry and other uncertainties detailed from time to time in the Company’s report filed with the SEC.\nContact:\nHaverty Furniture Companies, Inc. 404-443-2900\nRichard B. Hare\nEVP & CFO\nJenny Hill Parker\nSVP, Finance, Secretary and Treasurer\nSource: Havertys\nSource:Haverty Furniture Companies, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e3a7c976-2cd0-467f-8aeb-10acbbd8106d", "https://www.globenewswire.com/Tracker?data=UNR8VYnO5W5tikH81mPBRuMreTPKWqBHujwnBkZVRJg1HYsmYMWtPUQN59sLKKAkWroUb4MijEAtgi3Tryqh-Q=="], "published": "2018-01-08T14:29:00.000+02:00", "crawled": "2018-01-08T15:30:26.101+02:00", "highlightTitle": ""}