{"organizations": [], "uuid": "8d5450019b48fc07b65a96348eb2dad57cc093f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958982-GettyImages-908544070.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-day-3-a-deal-remains-elusive.html", "country": "US", "domain_rank": 767, "title": "Government shutdown, day 3: A deal remains elusive", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.142, "site_type": "news", "published": "2018-01-22T16:56:00.000+02:00", "replies_count": 0, "uuid": "8d5450019b48fc07b65a96348eb2dad57cc093f8"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-day-3-a-deal-remains-elusive.html", "ord_in_thread": 0, "title": "Government shutdown, day 3: A deal remains elusive", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "none"}, {"name": "andrew harrer", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "bloomberg | getty images senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Government shutdown, day 3: A deal remains elusive The federal government woke up Monday to the first real day of the shutdown, with hundreds of thousands of workers expected to stay home. Negotiations on Capitol Hill broke down again late Sunday, with few signs that an easy fix was within reach. As long as the shutdown continues, the president's schedule is effectively paralyzed, including a planned trip to Davos, Switzerland, later this week. SHARES Andrew Harrer | Bloomberg | Getty Images Senate Majority Leader Mitch McConnell, a Republican from Kentucky, walks to the Senate Chamber at the U.S. Capitol in Washington, D.C., U.S., on Sunday, Jan. 21, 2018. \nThe federal workforce woke up Monday to the first real day of the government shutdown, with hundreds of thousands of civil servants expected to stay home from work until a spending bill is approved in Congress and signed by the president. \nNegotiations on Capitol Hill broke down again late Sunday, where Senate Democrats are seeking a permanent fix for some 800,000 undocumented young people who were shielded from deportation under Obama-era DACA rules until last fall, when President Donald Trump canceled the DACA program. \nSenate Majority Leader Mitch McConnell said he \"hoped\" to hold a vote on immigration reform measures, including DACA, soon after Democrats agree to reopen the government. \nBut on Monday morning it was becoming clear that Senate Democrats would need more firm verbal assurances from the Republican leader that DACA would receive a vote. \n\"I'm seeking reassurances from Republicans in his caucus that they will also insist on this process,\" Sen. Chris Coons, D-Del., said on CNN. \"I think we can get there today ... but I've got to have trust.\" \nBoth Democrats and Republicans in the Senate are scheduled to meet with their caucuses on Monday morning, with a vote planned for midday on a bill to keep the government open for another three weeks, while negotiators work out a more permanent immigration fix. Republicans are hoping that enough Democrats will cross party lines to support the bill now that McConnell has promised to address their issues. \nAsked whether he believes the government will reopen by the end of the day Monday, Republican Sen. Lindsey Graham, S.C. told MSNBC, \"I hope so.\" \nGraham added: \"Opening the government up is not winning. It's stopping losing. Winning is finding solutions.\" \nStill, trust appeared to be in short supply, both on Capitol Hill and at the White House, where Trump accused Democrats of \"turning down services and security for citizens in favor of services and security for non-citizens,\" meaning the undocumented young people, who were brought to this country as children by their parents, and have lived here all their lives. Trump tweet \nTrump has not spoken to any Democrats since the shutdown began on Friday night. \"We're not going to start having negotiations about immigration reform until the government is open,\" said White House press secretary Sarah Huckabee Sanders on Monday. As for why the president was not seen on camera over the weekend, Sanders said, \"he is focused on managing the shutdown. That's the biggest part of part of the process that he plays at this point.\" \nAs long as the shutdown continues, the president's schedule is effectively paralyzed, including a planned trip to Davos, Switzerland later this week, where he is expected to address the World Economic Forum. \nAs of Monday morning, White House aides said that the president's schedule was being made on a \"day-to-day\" basis. \"I don't know that it's very likely\" Trump would go to Davos if the government remains shut down, Sanders said. \nThis is a developing story, please check back for updates.", "external_links": [], "published": "2018-01-22T16:56:00.000+02:00", "crawled": "2018-01-22T17:01:25.017+02:00", "highlightTitle": ""}