{"organizations": [], "uuid": "9a75edaff53b829c02d18249f340f9706845e318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226824550&w=1200&r=LYNXMPEE0U07I", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-germany-wages/german-industrial-workers-start-24-hour-strikes-in-row-over-pay-hours-idUKKBN1FK0G5", "country": "US", "domain_rank": 408, "title": "German industrial workers start 24-hour strikes in row over pay, hours", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:35:00.000+02:00", "replies_count": 0, "uuid": "9a75edaff53b829c02d18249f340f9706845e318"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-wages/german-industrial-workers-start-24-hour-strikes-in-row-over-pay-hours-idUKKBN1FK0G5", "ord_in_thread": 0, "title": "German industrial workers start 24-hour strikes in row over pay, hours", "locations": [], "entities": {"persons": [{"name": "joerg hofmann", "sentiment": "none"}, {"name": "maria sheahan", "sentiment": "none"}, {"name": "robert bosch", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "stuttgart", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "zf friedrichshafen", "sentiment": "none"}, {"name": "ig metall", "sentiment": "none"}, {"name": "handelsblatt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:05 AM / Updated 23 minutes ago German industrial workers start 24-hour strikes in row over pay, hours Maria Sheahan 5 Min Read \nFRANKFURT (Reuters) - Industrial workers in Germany held the first of a series of planned 24-hour strikes over pay and working hours on Wednesday, affecting companies including Volkswagen’s ( VOWG_p.DE ) truck maker MAN and automotive supplier ZF Friedrichshafen [ZFF.UL]. \nPowerful German union IG Metall has called for full-day walkouts through Friday, firing a last warning shot before it ballots for extended industrial action that could be crippling to companies reliant on a well-oiled supply chain of car parts and other components. \n“This has become necessary because the employers are moving sideways and have thrown into question compromises that had already been agreed,” IG Metall’s head Joerg Hofmann told daily Handelsblatt. \nAcross Germany, around 260 companies are expected to be hit by walkouts in support of IG Metall’s demands from Wednesday to Friday. At automotive supplier Robert Bosch [ROBG.UL] in Stuttgart workers were due to go on strike at 2100 GMT on Wednesday, to be followed by Mercedes-Benz maker Daimler ( DAIGn.DE ) and sportscar firm Porsche ( VOWG_p.DE ) on Friday. \nEmboldened by Germany’s fastest economic growth in six years and record low unemployment, the union is demanding an 8 percent pay rise over 27 months for 3.9 million metals and engineering workers across Europe’s largest economy. \nThe union has also asked for workers to be given the right to reduce their weekly hours to 28 from 35 to care for children, elderly or sick relatives, and return to full time after two years. \n“I switched from full-time to part-time work because of my children and now I don’t have the opportunity to return to full-time,” Souad Benchakra, a worker at Geberit, a German maker of toilet bowls and faucets, told Reuters TV when strikes there began during the night. \nThis is IG Metall’s first major push for a change in hours since workers staged seven weeks of strikes in 1984 to help secure a cut of the working week to 35 hours from 40 hours. Slideshow (8 Images) \nEmployers have offered a 6.8 percent wage increase but rejected the demand for shorter hours unless they can also increase workers’ hours when necessary. LOST REVENUES \nWorkers at printing press maker Heidelberger Druckmaschinen ( HDDG.DE ) in Heidelberg were among those downing their tools on Wednesday, as were staff at Kion’s ( KGX.DE ) Still brand of forklift trucks in Hamburg and at lighting company Zumtobel ( ZUMV.VI ) in Lemgo. \nBoth the union and the employers have left the door open to resuming talks after the planned strikes end on Friday but each said they demanded more willingness to make concessions. \nEmployers in Bavaria said they had filed a legal challenge to the walkouts on Wednesday, demanding that workers return to work and the union pay damages. Other regional associations have said they will do the same. \n“We still want a compromise. Causing such high damage to companies and the economy with full-day strikes is counter-productive and irresponsible,” Bertram Brossardt, head of the Bavarian employers’ group, said in a statement. \nLate on Wednesday though, IG Metall said a labour court in the western town of Krefeld had backed the union’s demands over an injunction filed by a company that had denounced the day-long walkouts as disproportionate action. \n“There must be an end now to the legal red herrings, whether it’s assessments, injunctions or claims for damages,” said Knut Giesler, head of IG Metall in North Rhine-Westphalia. “I‘m calling on all employers to stop this legal frippery immediately and seek a deal at the bargaining table.” \nThe DIW economic institute estimates that the strikes could cost the affected companies a total of 62 million euros (54.28 million pounds) a day in lost revenues, assuming that around 50,000 workers, or on average 200 per company, stop working for one day each. Reporting by Maria Sheahan; Additional reporting by Reuters TV and Andreas Cremer; Editing by Mark Heinrich/Raissa Kasolowsky/Susan Fenton", "external_links": [], "published": "2018-01-31T21:35:00.000+02:00", "crawled": "2018-01-31T22:06:37.009+02:00", "highlightTitle": ""}