{"organizations": [], "uuid": "1c852838bbfe797a70cd6cfcc5fcff2632e9a7b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-tim-wilson-joins-search-discovery.html", "country": "US", "domain_rank": 767, "title": "Tim Wilson Joins Search Discovery", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:15:00.000+02:00", "replies_count": 0, "uuid": "1c852838bbfe797a70cd6cfcc5fcff2632e9a7b8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-tim-wilson-joins-search-discovery.html", "ord_in_thread": 0, "title": "Tim Wilson Joins Search Discovery", "locations": [], "entities": {"persons": [{"name": "tim wilson", "sentiment": "negative"}, {"name": "wilson", "sentiment": "none"}, {"name": "michael helbling", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "search discovery , inc.", "sentiment": "negative"}, {"name": "analytics", "sentiment": "none"}, {"name": "zion market research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 17, 2018 /PRNewswire/ --\nSearch Discovery , Inc., has appointed Tim Wilson to the role of Senior Director of Analytics, reporting to Michael Helbling, Analytics Practice Lead.\nSearch Discovery is a business intelligence and analytics company that delivers solutions to help organizations drive improved business performance across many industries and functions.\nThe global business intelligence market was valued at USD 16.33 billion in 2015 and is expected to reach USD 26.50 billion by 2021, according to Zion Market Research .\nWilson says, \"The volume and complexity of business data is exploding. The potential to tap into this data, integrate it, understand customers, and drive business change is vast and largely untapped. Search Discovery has experienced tremendous growth in the past few years as a result of their pragmatic approach to this set of business challenges.\nJoining Search Discovery is exciting for me given their focus on people, the dire need for a capacity building approach to analytics, and a commitment to being at the forefront of our industry.\"\nThe addition of Wilson marks Search Discovery's 100th employee. \"We are committed to building a team that allows us to provide solutions and services that help companies realize the full impact their data can have on their business,\" says Mike Gustafson, President, Search Discovery.\nSays Lee Blankenship, founder and CEO, Search Discovery says: \"Our goal is to enable businesses to continually raise the bar in business analytics and by doing so increase revenue and reduce costs. Recruiting top talent, developing new technology solutions and providing world-class services are the key pillars to help us achieve this for our clients.\"\nAbout Tim Wilson, Senior Director of Analytics\nTim has worked with the many dimensions of marketing and customer data for over 15 years. From running the business intelligence department for a $500 million high-tech business-to-business company, to driving initiatives to clean up customer data at a major insurance and financial services company, to working at a leading digital agency to help consumer brands ranging from Hewlett-Packard to Purina to act on their digital and social data, to consulting with multiple Top 50 Internet Retailer brands on the application of digital analytics to their business, Tim is a marketer-friendly data geek.\nWhile his heart remains in Austin, Tim has been based in Columbus, Ohio, since 2007, where he started and continues to run monthly Web Analytics Wednesdays. For the last three years, he has been a co-host of the Digital Analytics Power Hour podcast. He holds a B.S. in Architecture from the Massachusetts Institute of Technology and an M.B.A. from The University of Texas at Austin.\nAbout Search Discovery\nSearch Discovery is a business intelligence and analytics company that empowers organizations to use data to improve business performance. We engage clients at every stage of data enablement including strategy, implementation, business experiments, optimization and organizational change management.\nOur solutions enable more efficient operations, clear business insights and improved decision making across marketing, sales, finance, operations and human resources. We partner with Fortune 5000 companies like Marriott, Chick Fil A, Adobe, Michael Kors and others who are transforming their businesses by leveraging the value of data.\nFor more information see searchdiscovery.com.\nView original content with multimedia: http://www.prnewswire.com/news-releases/tim-wilson-joins-search-discovery-300583826.html\nSOURCE Search Discovery", "external_links": ["http://www.prnewswire.com/news-releases/tim-wilson-joins-search-discovery-300583826.html", "https://www.searchdiscovery.com/", "https://www.zionmarketresearch.com/report/business-intelligence-market"], "published": "2018-01-17T15:15:00.000+02:00", "crawled": "2018-01-17T16:34:30.007+02:00", "highlightTitle": ""}