{"organizations": [], "uuid": "16d69c928c91c3ee5db2299fd55ae1b8248a411f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223702535&w=1200&r=LYNXMPEE0J0UF", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-shawcross/shawcross-shows-stokes-way-back-to-the-future-idUKKBN1F9141", "country": "US", "domain_rank": 408, "title": "Shawcross shows Stoke's way back to the future", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T22:58:00.000+02:00", "replies_count": 0, "uuid": "16d69c928c91c3ee5db2299fd55ae1b8248a411f"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-shawcross/shawcross-shows-stokes-way-back-to-the-future-idUKKBN1F9141", "ord_in_thread": 0, "title": "Shawcross shows Stoke's way back to the future", "locations": [], "entities": {"persons": [{"name": "shawcross", "sentiment": "negative"}, {"name": "ryan shawcross", "sentiment": "none"}, {"name": "paul lambert", "sentiment": "none"}], "locations": [{"name": "bournemouth", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}], "organizations": [{"name": "stoke", "sentiment": "negative"}, {"name": "huddersfield", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "eil robinson", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 59 PM / Updated 13 minutes ago Shawcross shows Stoke's way back to the future Neil Robinson 3 Min Read \n(Reuters) - On the 10th anniversary of the week he signed on as a Stoke City player, Ryan Shawcross provided compelling evidence that the best way to retain their Premier League status is to remember the virtues that won it in the first place. \nStrong defence, a vibrant crowd and tenacity all round the pitch provided the club with the perfect mix over the past decade. \nThose will need to be on show again in their next three games, all potentially winnable fixtures against fellow strugglers Watford, Bournemouth and Brighton. \n“We’ve been disappointed by some of our performances this season but we are not too far off 10th place,” said the 30-year-old captain who delivered a standout display in Saturday’s 2-0 win over Huddersfield. \nStoke are 17th in the table, but trail 10th-placed Watford by just three points. \nShawcross, whose craggy presence in defence has come to epitomise the club, deflected the credit on to Paul Lambert, as the new manager, team and fans finally delivered the united front that has been lacking all season. \n“The impact of the manager made a huge difference -- and the fans right behind us like the old days,” he said. “The intensity came from the manager. We’ve been working on it all week. When we win the ball high up we have the players who can really damage teams.” \nSignificantly, Saturday marked Shawcross’s return to a defence that has creaked unexpectedly this season. \nThe captain, who had last played in the 1-1 draw at Huddersfield on Dec. 26, took his place in a four-man defence with Kurt Zouma as Lambert ditched the three-man backline favoured by Mark Hughes in his final days as Stoke manager. \nTo an extent, the defensive tweaking had been forced on Hughes by some woeful performances. \nEven Shawcross drew criticism, notably for one sub-standard display at Crystal Palace last November when his two defensive lapses led to goals. To add to Shawcross’s misery, his comic miss from one metre out at the end added to the questions over his form and fitness. \nInjury followed as Stoke hurtled further down the table, but Saturday’s win showed what might still be possible with a revived talisman back to his best. \nThe captain headed away danger an impressive 14 times against Huddersfield, providing the sort of defensive platform that the bet365 stadium used to take for granted. \n“It was like the first days in the Premier League with the crowd so loud it spurred us on,” he said. \nBack to the future seems the only way forward. Reporting by Neil Robinson; Editing by Toby Davis", "external_links": [], "published": "2018-01-20T22:58:00.000+02:00", "crawled": "2018-01-20T23:16:55.001+02:00", "highlightTitle": ""}