{"organizations": [], "uuid": "25deaf2fde7b8881e106892224be52a148c2741e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-compass-diversified-holdings-subsidiary-sterno-products-announces-add-on-acquisition-of-rimports.html", "country": "US", "domain_rank": 767, "title": "Compass Diversified Holdings Subsidiary, Sterno Products, Announces Add-on Acquisition of Rimports", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.093, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "25deaf2fde7b8881e106892224be52a148c2741e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-compass-diversified-holdings-subsidiary-sterno-products-announces-add-on-acquisition-of-rimports.html", "ord_in_thread": 0, "title": "Compass Diversified Holdings Subsidiary, Sterno Products, Announces Add-on Acquisition of Rimports", "locations": [], "entities": {"persons": [{"name": "rimports", "sentiment": "none"}], "locations": [{"name": "rimports westport", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "provo", "sentiment": "none"}, {"name": "ut", "sentiment": "none"}], "organizations": [{"name": "sterno products", "sentiment": "none"}, {"name": "rimports inc.", "sentiment": "none"}, {"name": "codi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTPORT, Conn., Jan. 24, 2018 /PRNewswire/ -- Compass Diversified Holdings (NYSE: CODI) (\"CODI\" or the \"Company\"), an owner of leading middle market businesses, announced that on January 23, 2018, its subsidiary, Sterno Products, LLC (\"Sterno Products\"), entered into a definitive agreement to acquire Rimports Inc. (\"Rimports\") for a purchase price of $145 million (excluding working capital and a potential earn-out payment of up to $25 million based on future financial performance). The acquisition is expected to close within the next 45 days, subject to customary closing conditions.\nRimports is a leading manufacturer and distributor of branded and private label scented wickless candle products used for home décor and fragrance. Headquartered in Provo, UT, the company offers an extensive line of wax warmers, scented wax cubes, essential oils and diffusers, and other home fragrance systems, through the mass retailer channel. For the trailing twelve months ended November 30, 2017, Rimports reported net revenue of approximately $155 million. CODI expects to fund the purchase price through a draw on its revolving credit facility.\n\"This marks our second accretive acquisition since the year began, including our recent platform acquisition,\" said Alan Offenberg, CEO of Compass Diversified Holdings. \"This transaction will strengthen Sterno Products by adding a complementary product line of scented wickless candle products, and expanded retail channel penetration.\"\nElias Sabo, CODI's CEO-elect, stated, \"This will be Sterno Products' third add-on acquisition since we acquired the company in 2014. We look forward to continuing to support Sterno Products' strategic expansion into complementary markets and products. Looking ahead, we will continue to pursue opportunities to grow our subsidiaries through compelling add-on acquisitions as well as platform acquisitions that build shareholder value.\"\nDon Hinshaw, President and CEO of Sterno Products, commented, \"We are thrilled with the acquisition of Rimports, a leader in scented wax products, adding to our current Sterno Products' portfolio of companies in our retail and foodservice channels. Rimports is an excellent fit, given our mutual commitment to high quality products, with a focus on customer-centric processes and a passion for innovation.\"\nAbout Compass Diversified Holdings (\"CODI\")\nCODI owns and manages a diverse family of established North American middle market businesses. Each of its current subsidiaries is a leader in its niche market.\nCODI maintains controlling ownership interests in each of its subsidiaries in order to maximize its ability to impact long term cash flow generation and value. The Company provides both debt and equity capital for its subsidiaries, contributing to their financial and operating flexibility. CODI utilizes the cash flows generated by its subsidiaries to invest in the long-term growth of the Company and to make cash distributions to its shareholders.\nOur nine majority-owned subsidiaries are engaged in the following lines of business:\nThe design and marketing of purpose-built tactical apparel and gear serving a wide range of global customers ( 5.11 );\nThe manufacture of quick-turn, small-run and production rigid printed circuit boards ( Advanced Circuits );\nThe manufacture of engineered magnetic solutions for a wide range of specialty applications\nand end-markets ( Arnold Magnetic Technologies );\nEnvironmental services for a variety of contaminated materials including soils, dredged material, hazardous waste and drill cuttings ( Clean Earth );\nThe design, manufacture and marketing of airguns, archery products, optics and related accessories ( Crosman );\nThe design and marketing of wearable baby carriers, strollers and related products ( Ergobaby );\nThe design and manufacture of premium home and gun safes ( Liberty Safe );\nThe manufacture and marketing of branded, hemp-based food products ( Manitoba Harvest ); and\nThe manufacture and marketing of portable food warming fuels and creative ambience solutions for the hospitality and consumer markets ( Sterno Products ).\nThis press release may contain certain forward-looking statements, including statements with regard to the future performance of CODI. Words such as \"believes,\" \"expects,\" \"projects,\" and \"future\" or similar expressions, are intended to identify forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions. Certain factors could cause actual results to differ materially from those projected in these forward-looking statements, and some of these factors are enumerated in the risk factor discussion in the Form 10-K filed by CODI with the SEC for the year ended December 31, 2016 and other filings with the SEC. Except as required by law, CODI undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/compass-diversified-holdings-subsidiary-sterno-products-announces-add-on-acquisition-of-rimports-300587264.html\nSOURCE Compass Diversified Holdings", "external_links": ["http://www.prnewswire.com/news-releases/compass-diversified-holdings-subsidiary-sterno-products-announces-add-on-acquisition-of-rimports-300587264.html"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T16:52:39.001+02:00", "highlightTitle": ""}