{"organizations": [], "uuid": "faf0e37ececebb3adfb75cb2ef825648b897ac3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-mt-bank-corporation-announces-2017-fourth-quarter-and-full-year-results.html", "country": "US", "domain_rank": 767, "title": "M&T Bank Corporation Announces 2017 Fourth Quarter And Full-Year Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-18T15:04:00.000+02:00", "replies_count": 0, "uuid": "faf0e37ececebb3adfb75cb2ef825648b897ac3f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-mt-bank-corporation-announces-2017-fourth-quarter-and-full-year-results.html", "ord_in_thread": 0, "title": "M&T Bank Corporation Announces 2017 Fourth Quarter And Full-Year Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}], "organizations": [{"name": "mtb", "sentiment": "negative"}, {"name": "m&t bank corporation", "sentiment": "negative"}, {"name": "gaap results of operations", "sentiment": "none"}, {"name": "m&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUFFALO, N.Y., Jan. 18, 2018 /PRNewswire/ -- M&T Bank Corporation (\"M&T\") (NYSE: MTB) today reported its results of operations for 2017.\nGAAP Results of Operations. Diluted earnings per common share measured in accordance with generally accepted accounting principles (\"GAAP\") for the fourth quarter of 2017 were $2.01, up 2% from $1.98 in the similar 2016 quarter. GAAP-basis net income in the recent quarter aggregated $322 million, compared with $331 million in the final quarter of 2016. Diluted earnings per common share and GAAP-basis net income were $2.21 and $356 million, respectively, in the third quarter of 2017. GAAP-basis net income for the fourth quarter of 2017 expressed as an annualized rate of return on average assets and average common shareholders' equity was 1.06% and 8.03%, respectively, compared with 1.05% and 8.13%, respectively, in the year-earlier quarter and 1.18% and 8.89%, respectively, in the third quarter of 2017.\nM&T's financial results for the final quarter of 2017 reflected several notable items. The Tax Cuts and Jobs Act (\"the Tax Act\") was enacted on December 22, 2017, reducing the corporate Federal income tax rate from 35% to 21% and making other changes to U.S. corporate income tax laws. GAAP requires that the impact of the provisions of the Tax Act be accounted for in the period of enactment. Accordingly, the estimated incremental income tax expense recorded by M&T in the fourth quarter of 2017 related to the Tax Act was $85 million, representing $.56 of diluted earnings per common share. The additional expense was largely attributable to the reduction in carrying value of net deferred tax assets reflecting lower future tax benefits resulting from the lower corporate tax rate. Also during the recent quarter, M&T realized investment securities gains of $14 million (after-tax effect), or $.09 of diluted earnings per common share, largely resulting from the sale of a portion of M&T's Fannie Mae and Freddie Mac preferred stock holdings. Finally, M&T contributed an additional $44 million to The M&T Charitable Foundation in the final 2017 quarter, reducing net income by $27 million, or $.18 of diluted earnings per common share. In the aggregate, these items lowered net income by $98 million, or $.65 per diluted common share.\nEarnings Highlights\nChange 4Q17 vs.\n($ in millions, except per share data)\n4Q17\n4Q16\n3Q17\n4Q16\n3Q17\nNet income\n$\n322\n$\n331\n$\n356\n-2\n%\n-9\n%\nNet income available to common shareholders - diluted\n$\n302\n$\n308\n$\n336\n-2\n%\n-10\n%\nDiluted earnings per common share\n$\n2.01\n$\n1.98\n$\n2.21\n2\n%\n-9\n%\nAnnualized return on average assets\n1.06\n%\n1.05\n%\n1.18\n%\nAnnualized return on average common equity\n8.03\n%\n8.13\n%\n8.89\n%\nFor the year ended December 31, 2017, diluted earnings per common share were $8.70, up 12% from $7.78 in 2016. GAAP-basis net income for 2017 aggregated $1.41 billion, 7% higher than $1.32 billion in 2016. Expressed as a rate of return on average assets and average common shareholders' equity, GAAP-basis net income for 2017 was 1.17% and 8.87%, respectively, compared with 1.06% and 8.16%, respectively, in 2016.\nDarren J. King, Executive Vice President and Chief Financial Officer, commented on M&T's financial performance, \"Financial results in 2017 highlight what was a successful year for M&T. Strong growth in net interest income, credit costs that were significantly below our historical norms, and well controlled expenses led to a 12% rise in earnings per common share for the year. Fourth quarter results were negatively impacted by the newly enacted tax legislation, but a lower corporate tax rate in the future should provide many benefits to M&T. We are proud to carry on the legacy of our long-time Chairman and Chief Executive Officer, Bob Wilmers, through investing in the communities we serve by contributing $50 million during 2017 to The M&T Charitable Foundation, the highest annual amount in our history.\"\nSupplemental Reporting of Non-GAAP Results of Operations. M&T consistently provides supplemental reporting of its results on a \"net operating\" or \"tangible\" basis, from which M&T excludes the after-tax effect of amortization of core deposit and other intangible assets (and the related goodwill, core deposit intangible and other intangible asset balances, net of applicable deferred tax amounts) and expenses associated with merging acquired operations into M&T, since such items are considered by management to be \"nonoperating\" in nature. The amounts of such \"nonoperating\" expenses are presented in the tables that accompany this release. Although \"net operating income\" as defined by M&T is not a GAAP measure, M&T's management believes that this information helps investors understand the effect of acquisition activity in reported results.\nDiluted net operating earnings per common share were $2.04 in the fourth quarter of 2017, compared with $2.01 in the year-earlier quarter and $2.24 in the third quarter of 2017. Net operating income during the recent quarter was $327 million, compared with $336 million in the final quarter of 2016 and $361 million in 2017's third quarter. Expressed as an annualized rate of return on average tangible assets and average tangible common shareholders' equity, net operating income was 1.12% and 11.77%, respectively, in the recent quarter, compared with 1.10% and 11.93%, respectively, in the fourth quarter of 2016 and 1.25% and 13.03%, respectively, in the third quarter of 2017.\nFor the year ended December 31, 2017, diluted net operating earnings per common share were $8.82, up 9% from $8.08 in 2016. Net operating income in 2017 increased 5% to $1.43 billion from $1.36 billion in 2016. Expressed as a rate of return on average tangible assets and average tangible common shareholders' equity, net operating income was 1.23% and 13.00%, respectively, in 2017 and 1.14% and 12.25%, respectively, in 2016.\nTaxable-equivalent Net Interest Income. Net interest income expressed on a taxable-equivalent basis aggregated $980 million in the fourth quarter of 2017, up 11% from $883 million in the year-earlier quarter. That growth resulted predominantly from a widening of the net interest margin to 3.56% in the recent quarter from 3.08% in the final 2016 quarter. Taxable-equivalent net interest income in the recent quarter was 2% higher than $966 million in the third quarter of 2017. Contributing to that improvement were a 3 basis point widening of the net interest margin and an increase in average earning assets in the recent quarter as compared with the third quarter of 2017. Taxable-equivalent net interest income for the year ended December 31, 2017 aggregated $3.82 billion, up 9% from $3.50 billion in 2016. That improvement was predominantly the result of a widening of the net interest margin from 3.11% in 2016 to 3.47% in 2017.\nTaxable-equivalent Net Interest Income\nChange 4Q17 vs.\n($ in millions)\n4Q17\n4Q16\n3Q17\n4Q16\n3Q17\nAverage earning assets\n$\n109,412\n$\n114,254\n$\n108,642\n-4\n%\n1\n%\nNet interest income - taxable-equivalent\n$\n980\n$\n883\n$\n966\n11\n%\n2\n%\nNet interest margin\n3.56\n%\n", "external_links": ["http://www.prnewswire.com/news-releases/mt-bank-corporation-announces-2017-fourth-quarter-and-full-year-results-300584527.html", "http://ir.mandtbank.com/events.cfm"], "published": "2018-01-18T15:04:00.000+02:00", "crawled": "2018-01-18T16:21:18.008+02:00", "highlightTitle": ""}