{"organizations": [], "uuid": "fc56dd486fd2dbf79ed061e44dfa38aa29deca24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-stone-point-capital-partners-with-ceo-of-amtrust-financial-and-karfunkel-family-to-jointly-propose-acquiring-all-shares-of.html", "country": "US", "domain_rank": 767, "title": "Stone Point Capital Partners with CEO of AmTrust Financial and Karfunkel Family to Jointly Propose Acquiring All Shares of AmTrust Financial Common Stock Not Controlled by Family for $12.25 Per Share in Cash", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.719, "site_type": "news", "published": "2018-01-10T00:23:00.000+02:00", "replies_count": 0, "uuid": "fc56dd486fd2dbf79ed061e44dfa38aa29deca24"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-stone-point-capital-partners-with-ceo-of-amtrust-financial-and-karfunkel-family-to-jointly-propose-acquiring-all-shares-of.html", "ord_in_thread": 0, "title": "Stone Point Capital Partners with CEO of AmTrust Financial and Karfunkel Family to Jointly Propose Acquiring All Shares of AmTrust Financial Common Stock Not Controlled by Family for $12.25 Per Share in Cash", "locations": [], "entities": {"persons": [{"name": "barry d. zyskind", "sentiment": "none"}, {"name": "leah karfunkel", "sentiment": "none"}, {"name": "george karfunkel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "amtrust financial", "sentiment": "neutral"}, {"name": "stone point capital llc", "sentiment": "neutral"}, {"name": "stone point capital partners", "sentiment": "neutral"}, {"name": "amtrust financial services, inc.", "sentiment": "none"}, {"name": "amtrust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Private equity funds managed by Stone Point Capital LLC (“Stone Point”), together with Barry D. Zyskind, Chairman and CEO of AmTrust Financial Services, Inc. (Nasdaq: AFSI) (“AmTrust”), George Karfunkel and Leah Karfunkel (collectively, the “Karfunkel-Zyskind Family”), announced today that they have jointly proposed to acquire all of the outstanding shares of common stock of AmTrust that the Karfunkel-Zyskind Family does not already own or control for $12.25 per share in cash, which represents a 20.8% premium over AmTrust’s closing stock price on January 8, 2018.\nThe Karfunkel-Zyskind Family owns or controls approximately 43% of the outstanding shares of AmTrust common stock.\nStone Point and the Karfunkel-Zyskind Family believe the proposed transaction will provide AmTrust’s common stockholders with immediate liquidity and certainty of value at a significant premium to the current share price while allowing AmTrust to focus on the long term without the emphasis on short-term results.\nStone Point and the Karfunkel-Zyskind Family expect that a special committee of independent directors of the AmTrust board of directors will consider the proposed transaction and make a recommendation to the AmTrust board of directors, and that the special committee will retain independent legal and financial advisors to assist in its review of the proposed transaction.\nStone Point and the Karfunkel-Zyskind Family will not proceed with the proposed transaction unless it is approved by the special committee. In addition, the proposed transaction will be subject to a non-waivable condition requiring approval by holders of a majority of AmTrust common shares not owned or controlled by the Karfunkel-Zyskind Family, senior management or their respective affiliates.\nThe Karfunkel-Zyskind Family have informed AmTrust that they are interested only in acquiring the remaining shares of AmTrust common stock that they do not currently own or control, and have no interest in selling any of the shares they own or control, nor would they expect, in their capacity as stockholders, to vote in favor of any alternative sale, merger or similar transaction involving AmTrust. If the special committee does not recommend, or the stockholders of AmTrust do not approve, the proposed transaction, the Karfunkel-Zyskind Family intend to continue as long-term stockholders of AmTrust.\nStone Point has engaged Skadden, Arps, Slate, Meagher & Flom LLP as its legal advisor and the Karfunkel-Zyskind Family have engaged Paul, Weiss, Rifkind, Wharton & Garrison LLP as their legal advisor in connection with the proposed transaction.\nAdditional Information and Where to Find It\nAn agreement in respect of the proposed transaction described in this press release has not yet been executed, and this press release is not an offer to purchase or a solicitation of an offer to sell any securities. Any solicitation or offer will only be made through materials filed with the Securities and Exchange Commission (the “SEC”). AmTrust stockholders and other interested parties are urged to read these materials if and when they become available because they will contain important information. AmTrust stockholders will be able to obtain such documents (when available) free of charge at the SEC’s web site, www.sec.gov .\nForward-Looking Statements\nThis press release contains statements regarding the proposed transaction that may be deemed to be “ ” within the meaning of applicable securities laws and the Karfunkel-Zyskind Family or Stone Point may make related oral, on or following the date hereof. Forward-looking statements, by their nature, are subject to a variety of inherent risks and uncertainties that could cause actual results to differ materially from the results projected. Many of these risks and uncertainties cannot be controlled by the Karfunkel-Zyskind Family or Stone Point and include the possibility that discussions with the special committee of the AmTrust board of directors may not be successful and the possibility that the proposed transaction may not be entered into or completed on the terms described in this press release or at all, including as a result of changes in the business or prospects of AmTrust. Any in this press release are made only as of the date of this press release. Neither the Karfunkel-Zyskind Family nor Stone Point assumes any obligation to publicly update any except as required by law. No information contained on any website referenced in this press release is incorporated by reference herein.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006745/en/\nSard Verbinnen & Co\nPaul Scarpetta / David Isaacs / Nikki Ritchie\n212-687-8080 / 415-618-8750\nKarfunkel-SVC@sardverb.com\nSource: The Karfunkel-Zyskind Family", "external_links": ["http://www.businesswire.com/news/home/20180109006745/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51740672&newsitemid=20180109006745&lan=en-US&anchor=www.sec.gov&index=1&md5=62287893097375383a08a937e65623cf"], "published": "2018-01-10T00:23:00.000+02:00", "crawled": "2018-01-10T02:26:12.000+02:00", "highlightTitle": ""}