{"organizations": [], "uuid": "f03ee24b5a43b048949a290d12eff81aadc707a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-art-zeidman-joins-wyng-as-chief-growth-officer.html", "country": "US", "domain_rank": 767, "title": "Art Zeidman Joins Wyng as Chief Growth Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.853, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "f03ee24b5a43b048949a290d12eff81aadc707a3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-art-zeidman-joins-wyng-as-chief-growth-officer.html", "ord_in_thread": 0, "title": "Art Zeidman Joins Wyng as Chief Growth Officer", "locations": [], "entities": {"persons": [{"name": "zeidman joins wyng", "sentiment": "negative"}, {"name": "art zeidman", "sentiment": "negative"}, {"name": "wyng", "sentiment": "negative"}, {"name": "zeidman", "sentiment": "none"}, {"name": "john yapaola", "sentiment": "none"}], "locations": [{"name": "wyng", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "pixability", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "news corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wyng hires Art Zeidman as Chief Growth Officer to accelerate revenue growth and capture market share\nArt Zeidman previously held sales leadership roles at Google, Unruly Media (acquired by News Corp), Pixability and Vuble Video\nNEW YORK--(BUSINESS WIRE)-- Digital campaign platform Wyng today announced that Art Zeidman will join its leadership team as Chief Growth Officer. Art Zeidman comes with a wealth of experience within the industry as an accomplished sales leader for over 25 years, helping drive sales results for digital and traditional media, advertising, and marketing technology companies. During his 4-year tenure at Google, Art helped build their agency business, establishing relationships and structuring deals with Google’s largest ad agency and enterprise partners.\n“Art is an experienced and operationally strong executive and we’re very excited to have Art join our team at Wyng,” said John Yapaola, Chief Executive Officer, Wyng. “The most successful software companies combine an outstanding product with superior go-to-market execution. Art completes this picture for us -- with Art leading sales and focusing on major accounts, the company is positioned for strong growth.”\nArt will be joining Wyng at a time of growth and opportunity for the company, seeing tremendous demand across consumer industries, including media & entertainment, CPG, beauty and travel. Wyng is experiencing its fastest growth from large enterprises and agencies in these industries. Art will oversee the company’s sales acceleration and revenue strategies aimed at capturing market share with larger enterprises and agencies, drawing from his success and reputation in the advertising industry.\n“Market demand is being fueled by brands adapting their marketing and advertising strategies in response to the changes in consumer behavior driven by mobile, social and emerging technologies,” said Art Zeidman. “Wyng sits squarely at the intersection of these trends and has an exceptional roster of brand name customers, and the most innovative and complete platform in a fast-growing market. It’s an exciting time and I'm thrilled to join the Wyng team.”\nAbout Wyng\nWyng technology powers compelling digital campaigns and promotions for the world’s largest brands and their agencies. In 2011, Wyng powered the first ever hashtag campaign in connection with a Super Bowl ad, and continues to evolve its platform to align with shifts in consumer behavior. We believe great products are defined by intelligent architecture and a passion for innovation. Wyng is headquartered in New York City’s NoMad neighborhood. To learn more, visit wyng.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005416/en/\nWyng\nMatthew Scott, 646-795-6277\nDirector of Content and Communications\nmatthew.scott@wyng.com\nSource: Wyng", "external_links": ["http://www.businesswire.com/news/home/20180130005416/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wyng.com&esheet=51750616&newsitemid=20180130005416&lan=en-US&anchor=wyng.com&index=1&md5=87444f9eb1e6c6185c94cbc5f094e0a8"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:42:32.015+02:00", "highlightTitle": ""}