{"organizations": [], "uuid": "0c5dd61ff9281f0499bca6a2667f207db50e7902", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940971-GettyImages-890999164.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/jeff-sessions-home-state-of-alabama-supports-legal-weed-survey-commentary.html", "country": "US", "domain_rank": 767, "title": "Jeff Sessions home state of Alabama supports legal weed: Survey-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:35:00.000+02:00", "replies_count": 0, "uuid": "0c5dd61ff9281f0499bca6a2667f207db50e7902"}, "author": "Cynthia Salarizadeh", "url": "https://www.cnbc.com/2018/01/11/jeff-sessions-home-state-of-alabama-supports-legal-weed-survey-commentary.html", "ord_in_thread": 0, "title": "Jeff Sessions home state of Alabama supports legal weed: Survey-commentary", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "green market report and consumer research around cannabis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Attorney General Jeff Sessions outraged the legal cannabis industry last week when he rescinded the Cole Memo , which allowed states to implement their own marijuana laws without fear of federal interference. Now, another pot protection is at risk, one that Sessions would like to see disappear.\nSessions was born and raised in Alabama, where he also served as the state's attorney general back in the nineties at the height of America's War on Drugs. The deep-south is not known for its liberal drug policy, however, according to a new survey from the Green Market Report and Consumer Research Around Cannabis , the majority of Alabama's citizens support cannabis legalization.\nThe survey was given to residents from the Birmingham metropolitan area who have voted in the last year, including 21 counties surrounding the city and not limited to more democratic-leaning urban areas. Of the 788 respondents, 63.8 percent said they support legalizing cannabis for medical and/or recreational use. This is on par with the latest national data from Gallup , which reported 64 percent of Americans support full legalization.\nWhat's more, the majority of Republicans in the area also support cannabis legalization. The survey found 55.3 percent of \"conservatives\" in the Birmingham metro area are also in favor of legalization. Once again, Alabama was quite close to Gallup's national average which shows 51 percent of Republicans support full legalization.\nEvidently, Sessions views on pot are not supported by his home state or his political party. In fact, only 15.2 percent of voters in the Birmingham area are against legalizing cannabis.\nFellow Southerner and Governor of Louisiana, John Bel Edwards, wrote a letter to President Trump on Tuesday regarding the matter. Louisiana is trying to enact medical cannabis policy, and according to the governor, 70 percent of his state's residents support this undertaking.\nHowever, with Sessions' latest move, Louisiana is uncertain about the future of its program. The governor's letter asked President Trump to protect state's rights by renewing the Rohrabacher-Blumenauer Amendment , which prevents the Department of Justice from using federal funds to prosecute legal cannabis users and business owners. It expires in less than two weeks if not renewed, on January 19 th .\nThe governor notes that an effort is underway at the Department of Justice to eliminate the amendment.\n\"If this were to take place, it would be devastating to so many men, women and children who are anxiously awaiting access to this treatment option,\" Governor Edwards wrote.\nIf the Rohrabacher-Blumenauer Amendment expires, Sessions could have the power and resources to federally prosecute cannabis business owners and consumers operating under state law. It's up to Congress to renew the amendment as part of their 2018 omnibus spending package , or take things even further by ending cannabis prohibition once and for all.\nAccording to a recent Quinnipiac poll , 70 percent of Americans are against a federal crackdown on legal pot. Without the Rohrabacher-Blumenauer Amendment, rogue operators like Sessions will be able to do just that – crackdown. It would not only hurt a growing industry that's creating jobs and tax revenue, but restrict access to patients who need the plant for relief.\nInstead of being a representative of the people, Sessions is pushing his own personal agenda against pot. That's not how American democracy works, Mr. Sessions. The Rohrabacher-Blumenauer Amendment keeps Sessions and other rogue operators in check. Congress should renew the amendment and protect states' rights.\nCommentary by Cynthia Salarizadeh, co-founder of Green Market Report and publisher of the Cannabis Trend Report. Follow her on Twitter @ CynthiaMarie78 .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-11T18:35:00.000+02:00", "crawled": "2018-01-11T19:06:16.018+02:00", "highlightTitle": ""}