{"organizations": [], "uuid": "0051a98b874dddc81e0e81d9e4b2033dbb60630b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-ing-ceo-ralph-hamers-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with ING CEO, Ralph Hamers, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:41:00.000+02:00", "replies_count": 0, "uuid": "0051a98b874dddc81e0e81d9e4b2033dbb60630b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-ing-ceo-ralph-hamers-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with ING CEO, Ralph Hamers, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "steve sedgwick", "sentiment": "negative"}, {"name": "ralph hamers", "sentiment": "negative"}, {"name": "ralph", "sentiment": "none"}, {"name": "messina", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "ing", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Ralph Hamers, ING CEO and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Well, let's get to another European top banker, Ralph Hamers joins us, who is the CEO of ING. Ralph, really nice to see you. Look, I don't want to be too sycophantic, but your bank has transformed itself, while others haven't, whilst others have dallied around, as well, and you're paying the dividends now, the market really appreciates, in terms of, you know, measures like price-to-book of what you've done, as well. Do you still feel, though, and I've had this conversation with Mr. Messina, and others, do you still feel there are problem areas in European banking that just still are just waiting to be found?\nRH: Yes, I actually think there is still an issue with NPLs in some-, some areas. There are still banks that are in the midst of restructuring, transforming themselves to where they want to go. Some of them are still soul-searching, and until that is really over, I think that we are not-, we are not really there-,\nSS: Yes.\nRH: And banks will not be the real push for economic growth. Overall, we are, I mean, we're growing like 4%, 5% every year, in terms of, you know, the assets that we put on the balance sheet, and we're charging ahead, but the banking system in total is not going at-, at full cylinders, on all cylinders.\nSS: Do you think the ECB is terrified-, I know their mandate is inflation, but are they also having a nod to those points you just mentioned, those other banks, and actually making it more difficult for you, and obviously, everyone wants an improved NIM in the sector, as well-,\nRH: Yes-,\nSS: The net interest margins. Are they making it more difficult for you to make money, because they've still got an eye to these other banks?\nRH: Yes, they're certainly making it more difficult, not only because of the accommodating policies that they have, which are really pressurizing margins, on one side. On the other side, it's the SSM that has done a really good job, over the last three, four years, making it a, kind of, a level playing field in supervision, that it's not yielding its benefit yet, with-, in terms of liquidity transfer between countries, and capital transfer between countries, and therefore, it's still not very efficient, as to-, as to how you manage the European banking system.\nSS: So, if you had to lobby-,\nRH: Yes-,\nSS: Mario, and others-,\nRH: Yes.\nSS: Who we've just spoken to, I mean, I know-, I'm sure you know him very well, anyway. But, if you had to lobby him for one thing that the European banking sector needs, or, as a priority on the reform front at the moment, what is it you want to see?\nRH: Well, the next step-, we really have to finish the European Banking Union, and the next step in that is, one way or the other, we have to get our head around how do we create a European deposit guarantee system? Because that seems to be a political point, on one side, which I understand, but it is the real next step that we need to do, in order to open up, and get a much more efficient liquidity pooling, and capital transfer, within banks in the Eurozone.\nSS: Do you think change in leadership, or change of direction, or change in the composition of the government in Germany, is going to actually increase appetite in that country, for some form of common deposit insurance?\nRH: Well, what you read, and I can only see-, I can only talk about what I read, because the coalition is in its first days, right-,\nSS: Yeah.\nRH: Of being formed, but this is certainly a pro-euro, and a pro-European coalition, so that should help.\nSS: Yes, Mr. Schulz-, doesn't come more European, do they, really? I mean-,\nRH: Exactly. Exactly.\nSS: The former boss of the Parliament.\nRH: So, it should really help us. Go ahead.\nSS: No, I was just going to move on, because I know we've got a limited amount of time, so, in terms of where you take your business next, and, I mean, everyone in the UK remembers the old ING accounts, and so you've always been at the forefront-,\nRH: Yes.\nSS: Of-, of technical developments. What's the next big thing for you, stroke threat, as well? Because we talk about fintech as a dual-edged sword.\nRH: Yes. Well, actually, the next big thing is what's happening in Europe at the moment, with the PSD2 coming in-,\nSS: Mm-hm.\nRH: In place, which is creating Open Banking, which is where the UK is a frontrunner already. So, we're testing a lot of models in the UK, with our app, called Yolt, which is bank-agnostic. And if that's successful here, you can actually, also, launch it anywhere else.\nSS: Mm.\nRH: So, what it does, basically, is it-, it asks the customers to connect to your different banks, and gives you a complete, aggregated view, and then you can actually, integrally, manage your banking stuff. And, again, you know, the\nUK is a frontrunner there, and the European market is opening up, as well, under PSD2. The good thing is that it will give fintechs room to maneuver, and to build a business. What we have to be cautious about, though is that customers should really understand what kind of permission they're giving to these new parties, in terms of the data usage-,\nSS: And-,\nRH: And that is something-, that's a duty of care that we, banks have, in order to ensure that, you know, data privacy is well-understood, data protection is-, is well-understood.\nSS: But, if you guys don't do it, if the banks don't do it, the tech companies are going to do it, aren't they?\nRH: Exactly.\nSS: So, you're in a race against time, against these people, aren't you?\nRH: Exactly. We are, we are. The fintechs, I can see, will have that role. The global techs, though, the big guys, if they go after this, their power will just increase-,\nSS: Mm.\nRH: And-, and that's where we need to be careful, as well, in terms of, how do we want this market to really develop?\nSS: We've got to leave it there, I'm told that we've got a whole queue of guests lining up, but-,\nRH: Sure. Sure.\nSS: Nice to see you again, nice to see ING in such fine fettle, as well. So, Ralph Hamers, CEO of ING, thank you very much indeed. Nice to see you, sir.\nRH: Thank you.\nENDS", "external_links": [], "published": "2018-01-24T12:41:00.000+02:00", "crawled": "2018-01-24T15:07:50.000+02:00", "highlightTitle": ""}