{"organizations": [], "uuid": "9c4a98331b532a6001e2f44cbe44553e47082c0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-usa-amazon-hq/amazons-hq2-will-bring-strain-as-well-as-gain-to-winning-city-say-experts-idUSKBN1FI1DJ", "country": "US", "domain_rank": 408, "title": "Amazon's 'HQ2' will bring strain as well as gain to winning city, say experts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:01:00.000+02:00", "replies_count": 0, "uuid": "9c4a98331b532a6001e2f44cbe44553e47082c0a"}, "author": "", "url": "https://www.reuters.com/article/us-usa-amazon-hq/amazons-hq2-will-bring-strain-as-well-as-gain-to-winning-city-say-experts-idUSKBN1FI1DJ", "ord_in_thread": 0, "title": "Amazon's 'HQ2' will bring strain as well as gain to winning city, say experts", "locations": [], "entities": {"persons": [{"name": "arthur nelson", "sentiment": "none"}, {"name": "gregory scruggs", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "min read  seattle", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "university of arizona", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 08 PM / in 16 minutes Amazon's 'HQ2' will bring strain as well as gain to winning city, say experts Gregory Scruggs 5 Min Read \nSEATTLE (Thomson Reuters Foundation) - As the 20 shortlisted cities vying to host Amazon.com’s second North American headquarters hone their bids to attract thousands of high-paid jobs, they should also plan for rising housing costs and strains on infrastructure, experts said. \nThe winning city should ensure community benefits, such as support for affordable housing, new schools and beefed-up public transport are part of any deal, said academics and city planners. \n“If the price to pay Amazon exceeds the resources Amazon generates that can be used to manage the stress, the winning city may also be the loser,” said Arthur Nelson, an urban planning professor at the University of Arizona. \nAmazon said in September it will build a second headquarters, dubbed Amazon HQ2, that would be a full equal to its existing downtown Seattle campus. \nThe e-commerce giant estimates the new corporate location would generate $5 billion in real estate investment and bring in 50,000 well-paid jobs. \nThe list of 20 final candidates, announced on Jan. 18, leans heavily to the eastern half of North America, and includes the cities of Atlanta, Boston, and Washington, D.C. \nAccording to the Urban Institute, a policy think tank in Washington, D.C., there is a housing affordability crisis in the United States affecting the poorest renters, with the problem most acute in metropolitan areas. \nThat situation will be exacerbated in whichever city Amazon chooses to land, experts said. \n“There is no city on the list that can avoid upward rents and house prices, probably pretty sharp ones,” Stockton Williams, executive vice president at the Urban Land Institute, a global network of real estate and land use experts, told the Thomson Reuters Foundation. \nWhile the Amazon HQ2 shortlist does not include the nation’s most expensive housing market – metro San Francisco – it does include many other expensive cities like Boston, Los Angeles, New York City, Toronto, and Washington, D.C. \nWilliams believes some are better equipped than others to handle a potential Amazon HQ2. \nAustin, Boston, Denver, Nashville, New York City, and Washington, D.C. have all shown “a sustained effort, commitment, and growing capacity” to increasing their supply of affordable housing, he said. “It’s a good start, if not enough,” he said. \nOne of the bidding cities, the U.S. capital Washington D.C. said it would work to ensure the rewards of hosting Amazon’s second headquarters countered any negative impacts. \n“Our job is to ensure that the benefits of Amazon HQ2 significantly outweigh the costs,” said a spokeswoman for the city’s Department of Economic Development. \n“If we do our job well, we will be able to leverage the benefits, such as additional revenues, to address the needs of residents, such as affordable housing.” BIDDING WAR \nThe search for a second North American headquarters after Seattle set off a frenzied competition, with some 238 initial applications, offering incentives including big tax breaks. \nThe largest has been on behalf of Newark, where New Jersey offered $7 billion in financial incentives for Amazon to choose the city for the new campus, which itself only promises $5 billion in direct investment. \nEfforts to lure Amazon with taxpayer funds are a “big mistake”, said urbanist Richard Florida. \n“An auction that pits more than 200 cities against each other in a bidding war makes no sense for anyone,” said Florida, a scholar at the Penn Institute for Urban Research. \n“The company should issue an ‘Amazon Pledge’ that it will not accept any tax or financial incentives, but invest alongside cities to create better jobs, build more affordable housing, and develop better schools, transit, and other badly needed public goods, along with paying its fair share of taxes,” Florida said. \nAn Amazon spokesperson said the company had no comment on the proposed Amazon Pledge. \nIn May 2017, Amazon announced a plan to host homeless families on six floors of a new office building in Seattle in partnership with a local non-profit. \nAccording to company surveys, about one-fifth of Amazon’s Seattle employees walk to work, while another 35 percent cycle or use public transportation. \nOnce the company settles on the winner, the city has the opportunity to extract concessions, said Williams of the Urban Land Institute. \n“Cities do have leverage to ensure that big corporate redevelopment projects generate community benefits, in particular benefits that can offset some of the negative impact that comes along with many of the positive impacts of a company like Amazon locating in a city,” he said. \nAmazon could work with a housing developer, contribute to local affordable housing funds, or support grassroots groups providing affordable housing themselves. \n“I don’t see a city on this list that wouldn’t on net be better off as a result of Amazon arriving,” Williams said. \nOthers were skeptical of Amazon’s willingness to make concessions. “It is as hard-nosed a company as America has seen,” said Nelson. Reporting by Gregory Scruggs. Editing by Ros Russell and Astrid Zweynert. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": [], "published": "2018-01-29T14:01:00.000+02:00", "crawled": "2018-01-29T14:38:54.002+02:00", "highlightTitle": ""}