{"organizations": [], "uuid": "60b81649bfe90f725a9090047b45089d4f68bacd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL3N1PB3Q7", "country": "US", "domain_rank": 408, "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:13:00.000+02:00", "replies_count": 0, "uuid": "60b81649bfe90f725a9090047b45089d4f68bacd"}, "author": "", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL3N1PB3Q7", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [{"name": "shari redstone", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "at&t inc", "sentiment": "none"}, {"name": "viacom inc", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "huawei technologies co ltd", "sentiment": "none"}, {"name": "polyus", "sentiment": "none"}, {"name": "cbs corp", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kroger co", "sentiment": "none"}, {"name": "china mobile ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:14 AM / Updated 8 minutes ago Deals of the day-Mergers and acquisitions Reuters Staff 6 Min Read \n(Adds Energizer, Blackhawk Network, Israel Chemicals, Engie, HNA Group, Petronas and Niki; updates Niki) \nJan 16 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 1400 GMT on Tuesday: \n** Battery maker Energizer Holdings Inc said it would buy the battery and portable lighting business of Spectrum Brands in a $2 billion cash deal, adding brands such as Rayovac and Vatra to its lineup. \n** U.S. financial technology firm Blackhawk Network Holdings Inc said on Tuesday it would be acquired by private equity firms Silver Lake and P2 Capital Partners in an all-cash deal worth about $3.5 billion including debt. \n** Shares in Israel Chemicals rose in Tel Aviv trading after Canada’s Nutrien said it would sell its 13.8 percent stake in the firm, removing uncertainty about plans for the sale that had weighed on the stock. \n** French utility Engie said it had acquired two West African industrial energy services companies - Afric Power and Tieri - in a bid to expand its business in the region. \n** HNA Group’s commodity trading and logistics unit, which last month bought a big stake in Glencore’s oil storage business, will not chase U.S. deals in 2018 partly due to Washington’s increased scrutiny of Chinese investments, a senior executive of the unit said. \n** Malaysian energy firm Petroliam Nasional Berhad, or Petronas, said the Sarawak state government will take an equity stake in one of its liquefied natural gas production facilities. \n** Grocery chain Kroger Co has considered buying online wholesaler Boxed, according to a person familiar with the matter, as more shoppers place food orders online and as competition with Amazon.com Inc heats up. \n** Viacom Inc and CBS Corp are not in active merger discussions, although controlling shareholder Shari Redstone has had exploratory conversations with CBS directors about recombining the companies, two sources familiar with the situation told Reuters on Friday. \n** U.S. lawmakers are urging AT&T Inc, the No. 2 wireless carrier, to cut commercial ties to Chinese phone maker Huawei Technologies Co Ltd and oppose plans by telecom operator China Mobile Ltd to enter the U.S. market because of national security concerns, two congressional aides said. \n** Russia’s largest gold miner Polyus said that plans to sell a 10 percent stake to a consortium led by China’s Fosun International had been dropped after one of the conditions of the agreement was not met. \n** Germany’s Continental AG has hired JP Morgan to advise on a possible break-up, sources told Reuters, as the auto parts maker repositions for a market focused on electric and self-driving vehicles. \n** Fiat Chrysler Automobiles NV’s (FCA) has no intention to break up the company or sell individual brands to China or other parties, the company’s chief executive said, adding that the group was counting on its coveted Jeep brand to drive future profits. \n** Auckland International Airport said it would sell its stake in North Queensland Airports (NQA) to existing investors for A$370 million ($294.82 million), as it looks to focus on its domestic business. \n** The state owners of Germany’s HSH Nordbank on Monday agreed to exclusive talks with potential buyers J.C. Flowers and Cerberus as long-running attempts to privatise the ailing bank near conclusion, three people close to the matter said. \n** Killer Content Inc, the movie producer that has partnered with philanthropist Abigail Disney in a consortium vying to acquire the Weinstein Company, said on Monday that a bankruptcy may be the best way forward for the U.S. film and TV studio. \n** Turnaround specialist Melrose appealed directly to GKN’s investors to back its 7 billion pound ($9.6 billion) takeover offer after the British engineering company’s board rejected it. \n** GKN faces pressure to open takeover talks with suitor Melrose Industries from U.S. activist investor Elliott, which disclosed a stake in the British engineering company just days after it rejected a 7 billion pound ($9.66 billion) bid. \n** Struggling commodities trader Noble Group has completed the sale of its U.S.-focused oil business to the world’s largest oil trader Vitol, but net proceeds from the deal are lower than a previously announced estimate, the company said on Monday. \n** Czech-based lottery and gaming group Sazka Group, which is considering a stock market listing in London, has increased its stake in Casinos Austria, it said on Monday. \n** Chinese developer Yuzhou Properties said on Monday it would buy seven projects from Coastal Greenland for 3.8 billion yuan ($591 million). \n** Air France on Saturday denied it had made an offer to buy the struggling airline Alitalia, a day after an Italian government minister said the French flag carrier had made a joint bid with budget airline EasyJet. \n** Japan’s Softbank will invest 460 million euros ($561 million) in used-car dealing platform Auto1, marking the first investment in Germany by its Vision Fund, according to sources familiar with the matter. \n** Premier Foods said on Monday any talks it has had with third parties as part of a business review had not yet gone beyond “an exploratory stage”, playing down talk of a possible sale of its Batchelors noodles to Nissin Foods Holdings . \n** IDFC Bank Ltd, one of India’s two newest banks, will acquire non-bank financial firm Capital First Ltd in a share swap deal valued at about $1.5 billion as it looks to boost its retail lending activities. \n** Settling a legal dispute, airline Niki’s German and Austrian administrators agreed to cooperate to resolve the insolvent carrier’s future swiftly and guarantee legal certainty for its buyer. \n** CEZ Chief Executive Daniel Benes views an option to split the electricity producer into two parts as creating value for shareholders, he said in an interview published on Monday. (Compiled by Ahmed Farhatha in Bengaluru)", "external_links": [], "published": "2018-01-16T13:13:00.000+02:00", "crawled": "2018-01-16T13:28:25.030+02:00", "highlightTitle": ""}