{"organizations": [], "uuid": "5a9482dbf7e70c7047ca13dec86deb1b8360226c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/01/reuters-america-update-1-oil-rises-to-mid-2015-high-in-strongest-year-opening-since-2014.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Oil rises to mid-2015 high in strongest year opening since 2014", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T04:22:00.000+02:00", "replies_count": 0, "uuid": "5a9482dbf7e70c7047ca13dec86deb1b8360226c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/01/reuters-america-update-1-oil-rises-to-mid-2015-high-in-strongest-year-opening-since-2014.html", "ord_in_thread": 0, "title": "UPDATE 1-Oil rises to mid-2015 high in strongest year opening since 2014", "locations": [], "entities": {"persons": [{"name": "rystad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent, WTI crude begin year above $60, 1st time since 2014\n* Ongoing OPEC supply cuts have lifted crude prices\n* Strong demand also supports, despite rising U.S. output\n* U.S. production capacity has reached 10 mln bpd - Rystad (Re-leads, adds comment and chart; updates prices)\nSINGAPORE, Jan 2 (Reuters) - Oil prices had their highest January opening since 2014 on Tuesday, with Brent and WTI crude prices rising to mid-2015 highs, supported by ongoing supply cuts led by OPEC and Russia as well as strong demand.\nU.S. West Texas Intermediate (WTI) crude futures were at $60.64 a barrel at 0220 GMT, up 22 cents, or 0.4 percent, after hitting a June 2015 high of $60.68 earlier in the day.\nBrent crude futures - the international benchmark for oil prices - were at $67.20 a barrel, up 33 cents, or 0.5 percent, after hitting a May 2015 high of $67.23 a barrel earlier in the day.\nIt was the first time since January 2014 that both crude oil benchmarks opened the year above $60 per barrel.\n\"Falling inventories globally and strong economic growth offset the restart of the Forties pipeline and the resumption of production following a pipeline outage in Libya,\" said Jeffrey Halley, senior market analyst at futures brokerage Oanda in Singapore.\nThe 450,000 barrels per day (bpd) capacity Forties pipeline system in the North Sea returned to full operations on Dec. 30 after an unplanned shutdown.\nMore fundamentally, oil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries (OPEC) and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018.\nStrong demand growth, especially from China, has also been supporting crude.\n\"Oil inventories have been declining since March 2017 and OPEC have agreed to extend production cuts until the end of 2018 so it is probably uncontroversial to say that the fundamental outlook for oil has improved since the beginning of 2017,\" said William O'Loughlin, investment analyst at Australia's Rivkin Securities.\nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels.\nOnly rising U.S. production, which is on the verge of breaking through 10 million bpd, is somewhat hampering the outlook into 2018.\n\"The higher prices are expected to stoke U.S. shale output,\" O'Loughlin said.\nU.S. oil production <C-OUT-T-EIA> has risen by almost 16 percent since mid-2016, to 9.75 million bpd at the end of last year.\nHowever, consultancy Rystad Energy said \"U.S. crude oil production capacity has reached 10 million barrels per day.\"\n(Reporting by Henning Gloystein; editing by Richard Pullin)", "external_links": [], "published": "2018-01-02T04:22:00.000+02:00", "crawled": "2018-01-03T04:33:40.009+02:00", "highlightTitle": ""}