{"organizations": [], "uuid": "1eef293cce57673330e9706b9d0e6fc948508776", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-all-new-autotrader-brings-more-trust-and-speed-to-online-car-shopping-and-buying.html", "country": "US", "domain_rank": 767, "title": "All-New Autotrader Brings More Trust and Speed to Online Car Shopping and Buying", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-29T17:30:00.000+02:00", "replies_count": 0, "uuid": "1eef293cce57673330e9706b9d0e6fc948508776"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-all-new-autotrader-brings-more-trust-and-speed-to-online-car-shopping-and-buying.html", "ord_in_thread": 0, "title": "All-New Autotrader Brings More Trust and Speed to Online Car Shopping and Buying", "locations": [], "entities": {"persons": [{"name": "jessica stafford", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 29, 2018 /PRNewswire/ -- Autotrader , which became the first nationwide online car shopping site more than 20 years ago, will undergo a dramatic transformation throughout 2018, resulting in a faster, more personalized online shopping experience that delivers true price confidence for today's consumers. These enhancements also will result in more engagement, higher quality leads and actual car sales for Autotrader's dealer clients.\n\"Car shoppers have set clear expectations of how they like to shop and transact online: to have a trusted and transparent experience that's fast and enjoyable,\" said Jessica Stafford, senior vice president and general manager of Autotrader. \"At Autotrader, we've made bigger, smarter and bolder investments to create a more modern and complete digital shopping experience that will improve site satisfaction with consumers and generate more opportunities for dealers to connect with local, ready-to-buy shoppers.\"\nThe following enhancements will deliver solutions that better serve Autotrader's consumers and clients:\nSeamless Shopping Across Device: Shopping all the cars on Autotrader will be easier than ever before with a sleek new look that is consistent across desktop, tablet and mobile, offering faster loading times and a more efficient shopping journey that connects more consumers with the cars they want to buy. Price Confidence with Kelley Blue Book ® Price Advisor: Autotrader will be the only third-party car shopping site to feature the Kelley Blue Book® Fair Market Range on all eligible vehicle inventory listings, giving car shoppers the confidence to purchase with expert, up-to-date and data-driven pricing information from the industry's most trusted resource. Online Deal Making: Through digital retailing, Autotrader is providing all-new opportunities to move shoppers from searching to buying when they are ready, empowering consumers to start the deal online, reducing the time it takes to complete the purchase, and making it faster and easier than ever for dealers to close sales. Refined Search Experience: A modernized search experience to drive relevance and speed – up to 25 percent faster – will sort listings by shopper search criteria, previous shopping history, and a combination of distance, value and merchandising. Increased user engagement and enhanced inventory results will help shoppers find what they are looking for sooner, connecting them to nearby dealers. Personalized Shopper Content: For an even more personalized connection with today's car shopper, Autotrader will leverage the power of Cox Automotive data to provide every visitor with a personalized, frictionless experience that will help them find the right car and feel confident in their choice.\nThe new Autotrader will go live in January 2018 with the launch of a new, mobile-first homepage, and will have a staged roll-out throughout the calendar year.\nFor more information on the all-new Autotrader, visit https://agameautotrader.com/all-new .\nFor more information and news from Autotrader, visit press.autotrader.com , follow us on Twitter at https://twitter.com/Autotrader_com (or @Autotrader_com), Instagram at https://www.instagram.com/autotrader_com/ (or @autotrader_com), like our page on Facebook at https://www.facebook.com/autotrader/ , add us on Snapchat (@Autotrader_com), and get updates at Google+ at https://plus.google.com/+Autotrader .\nAbout Autotrader\nAutotrader is the most visited third-party car shopping site, with the most engaged audience of in-market shoppers. As the foremost authority on automotive consumer insights and expert in online and mobile marketing, Autotrader makes the car shopping experience easy and fun for today's empowered consumer looking to find or sell the perfect new, used or Certified Pre-Owned car. Using technology, shopper insights and local market guidance, Autotrader's comprehensive marketing solutions guide dealers to personalized digital marketing strategies that grow brand, drive traffic and connect the online and in-store shopping experience. Autotrader is a Cox Automotive™ brand. Cox Automotive is a subsidiary of Cox Enterprises. For more information, please visit http://press.autotrader.com .\nAbout Cox Automotive\nCox Automotive Inc. is transforming the way the world buys, sells and owns cars with industry-leading digital marketing, financial, retail and wholesale solutions for consumers, dealers, manufacturers and the overall automotive ecosystem worldwide. Committed to open choice and dedicated to strong partnerships, the Cox Automotive family includes Autotrader ® , Dealer.com ® , Dealertrack ® , Kelley Blue Book ® , Manheim ® , NextGear Capital ® , vAuto ® , Xtime ® and a host of other brands. The global company has 34,000-plus team members in more than 200 locations and is partner to more than 40,000 auto dealers, as well as most major automobile manufacturers, while engaging U.S. consumer car buyers with the most recognized media brands in the industry. Cox Automotive is a subsidiary of Cox Enterprises Inc., an Atlanta-based company with revenues exceeding $20 billion and approximately 60,000 employees. Cox Enterprises' other major operating subsidiaries include Cox Communications and Cox Media Group. For more information about Cox Automotive, visit www.coxautoinc.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/all-new-autotrader-brings-more-trust-and-speed-to-online-car-shopping-and-buying-300589345.html\nSOURCE Autotrader", "external_links": ["https://www.coxautoinc.com/", "http://www.prnewswire.com/news-releases/all-new-autotrader-brings-more-trust-and-speed-to-online-car-shopping-and-buying-300589345.html", "https://www.autotrader.com/", "http://press.autotrader.com/", "https://plus.google.com/+Autotrader", "https://www.facebook.com/autotrader/", "https://agameautotrader.com/all-new", "https://twitter.com/Autotrader_com", "https://plus.google.com/+AutoTrader", "https://www.instagram.com/autotrader_com/"], "published": "2018-01-29T17:30:00.000+02:00", "crawled": "2018-01-29T19:38:16.000+02:00", "highlightTitle": ""}