{"organizations": [], "uuid": "2be422cef3ea8df371988aa6e00e4bde4f6df76c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/08/104698786-RTX3FBVG.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/21324812/device/rss/rss.html", "section_title": "Personal Finance", "url": "https://www.cnbc.com/2018/01/29/equifax-extends-free-credit-freezes-to-june-30.html", "country": "US", "domain_rank": 767, "title": "Equifax extends free credit freezes to June 30", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "2be422cef3ea8df371988aa6e00e4bde4f6df76c"}, "author": "Sarah O'Brien", "url": "https://www.cnbc.com/2018/01/29/equifax-extends-free-credit-freezes-to-june-30.html", "ord_in_thread": 0, "title": "Equifax extends free credit freezes to June 30", "locations": [], "entities": {"persons": [{"name": "tami chappell", "sentiment": "none"}, {"name": "litt", "sentiment": "none"}, {"name": "mike litt", "sentiment": "none"}], "locations": [{"name": "transunion", "sentiment": "none"}], "organizations": [{"name": "equifax", "sentiment": "negative"}, {"name": "u.s. pirg", "sentiment": "none"}, {"name": "equifax inc", "sentiment": "none"}, {"name": "experian", "sentiment": "none"}, {"name": "reuters credit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you want to freeze your credit report for free at Equifax, the deadline to do so has been extended to June 30, a company spokeswoman said today. The original deadline was Jan. 31.\nHowever, consumers still have only until Jan. 31 to sign up for one year of free credit-monitoring through Equifax. Both offers came last fall after the credit-reporting company revealed that up to 145 million consumers' private data had been compromised in a massive data breach.\nBe aware, however, that both of these moves only offer partial protection against identity theft. And they do nothing to protect your credit report at the other two major credit-reporting firms, Experian and TransUnion .\n\"Whether your information was stolen in the Equifax breach or not, the best thing you can do is get credit freezes at all three,\" said Mike Litt, consumer campaign director at consumer advocacy group U.S. PIRG.\n\"You'll have peace of mind and you could save yourself the time and stress of dealing with fraudulent debt on your credit reports,\" Litt said.\nTami Chappell | Reuters Credit reporting company Equifax Inc. corporate offices are pictured in Atlanta, Georgia. Equifax also will start a service on Jan. 31 that allows consumers to lock and unlock their credit reports for free, which is similar to a freeze. This service, too, applies only to your Equifax report.\nThe personal data compromised in the Equifax cyberattack included names, birth dates, Social Security numbers, addresses and some driver's license numbers.\nWhile signing up for Equifax's free credit-monitoring service can't hurt, you only are alerted if there's a change to your credit report. This means that by the time you're notified, fraud already may have occurred.\nAbout 15.4 million consumers were victims of identity theft or fraud in 2016, according to a 2017 report from Javelin Strategy & Research. That's a 16 percent increase from 2015, and the highest amount recorded since the firm began tracking such fraud in 2004.\n\"Whether your information was stolen in the Equifax breach or not, the best thing you can do is get credit freezes at all three credit bureaus.\" -Mike Litt , Consumer campaign director at U.S. PIRG Meanwhile, the basic benefit behind freezing your credit report is that if a scammer attempts to take out a loan or establish credit using your personal information, the lender will be unable to check your credit score or history and generally won't approve the application. You also can temporarily unfreeze your report if you want to apply for a specific loan or credit card.\nFor the best protection, you should activate freezes at all three credit-reporting companies. Doing so costs anywhere from $2 to $10 a pop in the states where freeze fees are charged.\nIn some states, you'll also pay a fee to unfreeze your report when you need a lender to approve a valid application. (Some states waive the fees for certain consumers, such as seniors or active-duty military members.)\n(Click on the interactive map below to check fees in your state.)\nSource: U.S. PIRG\nU.S. PIRG research shows that with just eight states requiring credit freezes to be offered for free, it would cost a collective $4.1 billion for 158 million consumers between ages 18 and 65 to freeze their reports at all three firms.\nKeep in mind that freezing your report is different from putting a short-term or longer-term fraud alert on your report, which is free.\nAnd in that case, you only need to alert one credit reporting firm, which in turn is legally obligated to share that with the others. The alert means that a lender seeking to approve an application must first contact you to verify the request is from you, not an imposter.\nshow chapters Spotting errors on your credit report 2:53 PM ET Fri, 16 Jan 2015 | 01:11 Litt said his group is group is working with policymakers at the state level to make freezes free.\nStates where legislation has been introduced include California, Illinois, Massachusetts, Oregon, Washington and Wisconsin. Additionally, several congressional bills that would make credit freezes free in all states are pending on Capitol Hill.\n(Update: The story has bee updated to reflect the extension of the free credit freeze offer.)\nTo knock out debt faster, it's time to reassess your payoff plan\nReady, set, file: Tax season begins\nMillennials, this retirement hack is for you", "external_links": ["https://www.google.com/maps/d/embed?mid=1mbK8460K0auiTUsxWsvu4bVnJ4Q", "https://www.equifax.com/personal/education/identity-theft/fraud-alert-security-freeze-credit-lock"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T23:25:52.001+02:00", "highlightTitle": ""}