{"organizations": [], "uuid": "fda7f4d16e55d6512818ca675dd7e0660e818b9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-thoma-bravo-acquires-and-merges-motus-and-runzheimer-to-create-market-leading-vehicle-management-platform.html", "country": "US", "domain_rank": 767, "title": "Thoma Bravo Acquires and Merges Motus and Runzheimer to Create Market Leading Vehicle Management Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-17T23:00:00.000+02:00", "replies_count": 0, "uuid": "fda7f4d16e55d6512818ca675dd7e0660e818b9f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-thoma-bravo-acquires-and-merges-motus-and-runzheimer-to-create-market-leading-vehicle-management-platform.html", "ord_in_thread": 0, "title": "Thoma Bravo Acquires and Merges Motus and Runzheimer to Create Market Leading Vehicle Management Platform", "locations": [], "entities": {"persons": [{"name": "merges motus", "sentiment": "negative"}, {"name": "thoma bravo", "sentiment": "negative"}, {"name": "thoma", "sentiment": "negative"}, {"name": "motus", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "runzheimer", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 17, 2018 /PRNewswire/ -- Thoma Bravo, a leading private equity investment firm, today announced an innovative deal to acquire the premier vehicle management and reimbursement platforms of Motus and Runzheimer. The combined organization - with approximately 2,000 customers and more than 220,000 end users - is positioned to better serve the rapidly growing needs of the addressable fleet market and provide customers with significant alternatives to today's \"company car\" or limited vehicle reimbursement options.\nThe proliferation of mobile devices and cloud capabilities has created an increasingly mobile workforce, expanding the definition of those that drive for work beyond the historical context of truck and delivery drivers. As more drivers take to the road to do their jobs, fleet solutions have flourished into a $2+ billion industry, one that demands technologies that improve mobile workforce efficiency and maximize driver productivity. Integrating Runzheimer's 80+ years of expertise and world-class customer base with Motus' cutting-edge technology means the combined organization can more aggressively compete with large traditional fleet solutions and providers of company cars by providing customers with innovative products and solutions that empower true mobile workforce optimization while reducing vehicle program costs.\n\"As employee mobility continues to rise, the need for solutions that are tailored to address the unique challenges that drivers and their employers face has emerged,\" said Craig Powell, CEO of Motus. \"Forward-thinking customers want more than just a mileage reimbursement solution – they want access to a broad array of solutions and data analytics that enhance overall fleet productivity. Bringing Motus and Runzheimer under one roof creates the opportunity to better meet this demand by providing the advanced tools businesses need to better run their fleets.\"\n\"This is an exciting day for the fleet market,\" said Rex Runzheimer, Chairman of Runzheimer. \"Customers will get the best of both worlds – Runzheimer's more than 80 years of expertise and market leading service delivery and Motus' technology-first approach.\"\nThis transaction will enable the combined organization to extend technology investments into areas to provide customers with the most accurate data available and best-in-class data security and privacy protections. Through these enhancements, the combined organization expects to be able to improve management capabilities and increase product functionality for existing Fortune 500 customers such as Bosch, Coca-Cola Bottling Company Consolidated, Kellogg's, National Grid and Papa Johns.\n\"It's a rare moment in our business when we have an opportunity to simultaneously combine two world-class companies like Motus and Runzheimer,\" said A.J. Rohde, a Partner at Thoma Bravo. \"Combined scale will enable us to invest in new applications, both organically and inorganically. Couple this with Thoma Bravo's operational processes and integration expertise, and we believe this will be a huge win for current and future customers alike. Working with our new CEO Craig Powell and an A+ executive team will help us deliver on that premise from day one.\"\nCanaccord Genuity Inc. served as the financial advisor to Thoma Bravo and Motus. Robert W. Baird & Co. served as the financial advisor to Runzheimer. Goodwin Procter LLP served as legal counsel for Thoma Bravo. Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. served as legal counsel for Motus, and Godfrey & Kahn, S.C. as legal counsel for Runzheimer. Financing for the transaction was provided by TPG Sixth Street Partners and Owl Rock Capital.\nAbout Motus\nFor companies with mobile workers that drive more than 5,000 business miles per year, Motus is the premier vehicle management and reimbursement platform. Through its sophisticated configuration engine that incorporates real-time data across hundreds of variables, Motus drives significant reductions in cost, ensures compliance, and reimburses employees exactly what they deserve. For more information about the company, please visit www.motus.com or connect with us on Twitter, Facebook, or LinkedIn.\nAbout Runzheimer\nFounded in 1933, Runzheimer connects people, companies and their vehicles in ways that drive superior productivity and impactful business intelligence. Runzheimer provides expertise, technology and world class customer service that empowers companies to move their businesses forward with confidence. As a result, its customers are able to better manage cost, reduce business risk and increase employee satisfaction in the mobile workplace. Runzheimer is the leader in workforce mobility programs, designing and delivering fair, accurate and defensible™ business vehicle programs, relocation information services and business expense solutions. Runzheimer is highly renowned and recognized for its market leading service delivery focus, an integral part of its corporate culture.\nAbout Thoma Bravo, LLC\nThoma Bravo is a leading private equity investment firm building on a 30+ year history of providing equity and strategic support to experienced management teams and growing companies. The firm seeks to create value by collaborating with company management to improve business operations, invest in growth initiatives and make accretive acquisitions. Thoma Bravo invests with a particular focus on application and infrastructure software and technology enabled services. The firm currently manages a series of private equity and debt funds representing more than $18.0 billion of capital commitments. More information about Thoma Bravo can be found at www.thomabravo.com .\nMedia Contact for Thoma Bravo:\nMatthew Gorton\nHiltzik Strategies\n212-776-1161\nmgorton@hstrategies.com\nMedia Contact for Motus:\nJessica MacGregor\nfama PR\n617-986-5024\nmotus@famapr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/thoma-bravo-acquires-and-merges-motus-and-runzheimer-to-create-market-leading-vehicle-management-platform-300583806.html\nSOURCE Thoma Bravo, LLC", "external_links": ["http://www.prnewswire.com/news-releases/thoma-bravo-acquires-and-merges-motus-and-runzheimer-to-create-market-leading-vehicle-management-platform-300583806.html", "http://www.thomabravo.com/"], "published": "2018-01-17T23:00:00.000+02:00", "crawled": "2018-01-17T23:53:25.000+02:00", "highlightTitle": ""}