{"organizations": [], "uuid": "88f894177a2565c6689768e6c8ab388e5a6b1ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-euronet-worldwide-statement-regarding-the-termination-of-the-moneygram-and-ant-financial-merger-agreement.html", "country": "US", "domain_rank": 767, "title": "Euronet Worldwide Statement Regarding the Termination of the MoneyGram and Ant Financial Merger Agreement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-03T04:00:00.000+02:00", "replies_count": 0, "uuid": "88f894177a2565c6689768e6c8ab388e5a6b1ef9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-euronet-worldwide-statement-regarding-the-termination-of-the-moneygram-and-ant-financial-merger-agreement.html", "ord_in_thread": 0, "title": "Euronet Worldwide Statement Regarding the Termination of the MoneyGram and Ant Financial Merger Agreement", "locations": [], "entities": {"persons": [{"name": "euornet", "sentiment": "none"}], "locations": [{"name": "leawood", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}], "organizations": [{"name": "moneygram", "sentiment": "negative"}, {"name": "euronet worldwide, inc.", "sentiment": "neutral"}, {"name": "euronet worldwide, inc", "sentiment": "none"}, {"name": "euronet worldwide", "sentiment": "none"}, {"name": "euronet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LEAWOOD, Kansas, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Euronet Worldwide, Inc. (\"Euronet\" or the “Company”) (NASDAQ:EEFT) today issued the following statement in response to numerous inquiries regarding Euronet’s intentions following the announcement by MoneyGram and Ant Financial of the termination of their Merger Agreement.\nEuronet continues to believe there is compelling commercial logic to a combination between Euronet and MoneyGram. However, significant developments have been disclosed by MoneyGram since Euornet’s offer and Euronet has not conducted any evaluation of the business in that time. While we continue to view a transaction with MoneyGram as logical, there is no guarantee any offer will be made or any transaction will ultimately occur.\nAbout Euronet Worldwide, Inc.\nEuronet Worldwide is an industry leader in processing secure electronic financial transactions. The Company offers payment and transaction processing solutions to financial institutions, retailers, service providers and individual consumers. These services include comprehensive ATM, POS and card outsourcing services, card issuing and merchant acquiring services, software solutions, cash-based and online-initiated consumer-to-consumer and business-to-business money transfer services, and electronic distribution of prepaid mobile phone time and other prepaid products.\nEuronet's global payment network is extensive - including 38,105 ATMs, approximately 227,000 EFT POS terminals and a growing portfolio of outsourced debit and credit card services which are under management in 53 countries; card software solutions; a prepaid processing network of approximately 673,000 POS terminals at approximately 306,000 retailer locations in 39 countries; and a global money transfer network of approximately 332,000 locations serving 146 countries. With corporate headquarters in Leawood, Kansas, USA, and 61 worldwide offices, Euronet serves clients in approximately 160 countries. For more information, please visit the Company's website at www.euronetworldwide.com .\nForward-Looking Statements\nStatements contained in this news release that concern Euronet's or its management's intentions, expectations, or predictions of future performance, are forward-looking statements. Euronet's actual results may vary materially from those anticipated in such forward-looking statements as a result of a number of factors, including: conditions in world financial markets and general economic conditions, including the effects in Europe of the Brexit vote and economic conditions in specific countries or regions; the effects of demonetization in India; technological developments affecting the market for the Company's products and services; foreign currency exchange rate fluctuations; the effects of any breaches in the security of our computer systems or those of our customers or vendors; the Company's ability to renew existing contracts at profitable rates; changes in fees payable for transactions performed for cards bearing international logos or over switching networks such as card transactions on ATMs; changes in the Company's relationship with, or in fees charged by, the Company's business partners; competition; the outcome of claims and other loss contingencies affecting the Company; and changes in laws and regulations affecting the Company's business, including immigration laws. These risks and other risks are described in the Company's filings with the Securities and Exchange Commission, including our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Copies of these filings may be obtained via the SEC's Edgar website or by contacting the Company or the SEC. Any forward-looking statements made in this release speak only as of the date of this release. Except as may be required by law, Euronet does not intend to update these forward-looking statements and undertakes no duty to any person to provide any such update under any circumstances. The Company regularly posts important information to the investor relations section of its website.\nContact: Euronet Worldwide, Inc. Stephanie Taylor T: 913-327-4200 E: staylor@eeft.com\nSource:Euronet Worldwide, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=WuUw13rVBaGpPxbfsvIyMoDovoFcDCvK0A084fF9cZJUUwesVweME2Y5S_JfMKvgAtpvKqpBRsBcSLl137pLAg==", "https://www.globenewswire.com/Tracker?data=BYvD-C6FuWkmi9gVe_W4KEKxUePxTuNzcRawsj5wnoCh4uI4PWBc5qjgI7-dsIEuTi8PwUEMY9TuOytZ69KTSuWW8v7_5k11B04ziTm8f7Q=", "https://www.globenewswire.com/Tracker?data=ANaWre73yriYzPMxo-gszjHLdBFJygB7l_MhzotoBMzciOCTfhs_7-UOmUV_xsD0OKaalwOgfabkCIuESdS2ZQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/33631690-665d-4414-bd00-a33b798e88ba", "https://www.globenewswire.com/Tracker?data=e3a1yfapE1ZG_B8420n7o_ZMQBpmi2HC1dkJNcERcS2PrSztnNTPrpb1RT3GD9dh-yHK5twrRL6QV_i2FzKG3bHY0vPrO8PAfJiYtW2TcbA="], "published": "2018-01-03T04:00:00.000+02:00", "crawled": "2018-01-03T06:30:23.006+02:00", "highlightTitle": ""}