{"organizations": [], "uuid": "8560a3ba543df27f20b7e35489b88797b3e3b3f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-teens-bullying-suicide/childhood-bullying-linked-to-suicide-risk-for-teens-idINKBN1F52TD", "country": "US", "domain_rank": 408, "title": "Childhood bullying linked to suicide risk for teens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:16:00.000+02:00", "replies_count": 0, "uuid": "8560a3ba543df27f20b7e35489b88797b3e3b3f4"}, "author": "", "url": "https://in.reuters.com/article/us-health-teens-bullying-suicide/childhood-bullying-linked-to-suicide-risk-for-teens-idINKBN1F52TD", "ord_in_thread": 0, "title": "Childhood bullying linked to suicide risk for teens", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Adolescents who experienced severe bullying by their peers earlier in childhood may be more likely to suffer from depression, anxiety and suicidal thoughts than teens who weren’t routinely victimized by other kids, a Canadian study suggests.\nResearchers examined data on 1,363 children who were surveyed about peer victimization and bullying from ages 6 to 13 and monitored for any mental health issues through age 15. Most participants experienced little or no victimization, but about 26 percent reported some bullying and almost 15 percent said they suffered severe, long-lasting victimization.\nCompared to teens who experienced little or no bullying as kids, adolescents who suffered chronic tormenting by their peers were more than twice as likely to be depressed and more than three times more likely to be anxious or seriously consider suicide, the study found.\n“We found that exposure to peer victimization decreases by the end of childhood,” said lead study author Marie-Claude Geoffroy, a psychiatry researcher at McGill University in Montreal.\n“However, the 15 percent of adolescents exposed to the most severe levels of victimization when they entered kindergarten were still exposed to the highest levels in high school,” Geoffroy said by email.\nAll of the kids in the study were born in Quebec in 1997 and 1998.\nResearchers assessed peer victimization based on questionnaires kids completed to detail physical and verbal abuse as well as online bullying. These surveys, done in the second half of the school year, asked kids to detail how often they experienced any victimization since the start of school.\nAt age 15, researchers asked teens about the frequency of depression, anxiety, social problems, conduct issues or behavior challenges in the previous 12 months.\nOverall, about 7 percent of the teens exposed to little or no victimization as kids had depression, compared with almost 18 percent of adolescents who had suffered severe bullying by their peers, researchers report in CMAJ.\nAt the same time, 7 percent of teens with little or no exposure to bullying had general anxiety, compared with 20 percent of youth who had been constantly victimized by their peers.\nAdolescents who were chronically bullied as kids were also much more likely to experience social anxiety, eating problems, conduct issues and behavior challenges, the study found.\nAbout 3 percent of teens who had little previous exposure to bullying had suicidal thoughts, compared to 13 percent of teens who had suffered from routine peer victimization growing up.\nThe study wasn’t a controlled experiment designed to prove whether or how peer victimization early in childhood might influence mental health in adolescence. Another limitation is that researchers relied on kids to accurately recall and report on any mental health problems or experiences with victimization.\nStill, the findings add to the body of evidence already linking bullying and peer victimization to future mental health problems, said Dieter Wolke, a psychology researcher at the University of Warwick in the UK who wasn’t involved in the study.\n“One of the most painful feelings is to be socially rejected, ridiculed, beaten and embarrassed by other classmates,” Wolke said by email. “If this continues chronically, it not only increases anxiety of social contacts, it leads to defeat and internalization that one is useless, worthless, incapable, not worth loving.”\nThe study results underscore the need for teachers, parents and other adults involved in kids’ lives to intervene early to stop any events of victimization from turning into a routine problem, said Bonnie Leadbeater, a psychology researcher at the University of Victoria in British Columbia, Canada who wasn’t involved in the study.\n“Without adult help, victimization can be chronic,” Leadbeater said by email. “Anxiety and depression can also worsen victimization, catching children in a cycle of abuse and mental illness.”\nTo avoid this, parents should ask kids about bullying, and let them know that if they experience this, they aren’t alone, said Dr. Matthew Davis of the Ann & Robert Lurie Children’s Hospital of Chicago.\n“If your children are being bullied, focus on supporting their sense of self-worth, to help nurture their self-esteem despite bullying,” Davis said by email.\nSOURCE: bit.ly/2FJGCkU CMAJ, online January 15, 2018.\n ", "external_links": [], "published": "2018-01-17T00:16:00.000+02:00", "crawled": "2018-01-17T00:43:38.012+02:00", "highlightTitle": ""}