{"organizations": [], "uuid": "7eb1ecd3d1f73b0342cd0f4ebc5233127a489735", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218803408&w=1200&r=LYNXMPEE010IC", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-stocks/wall-street-set-for-positive-start-to-2018-idUSKBN1ER0Y9", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall Street set for positive start to 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T14:37:00.000+02:00", "replies_count": 0, "uuid": "7eb1ecd3d1f73b0342cd0f4ebc5233127a489735"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/wall-street-set-for-positive-start-to-2018-idUSKBN1ER0Y9", "ord_in_thread": 0, "title": "US STOCKS-Wall Street set for positive start to 2018", "locations": [], "entities": {"persons": [{"name": "sruthi shankar", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 12:40 PM / Updated 7 minutes ago Wall Street begins 2018 with gains; tech drives momentum Caroline Valetkevitch 4 Min Read \nNEW YORK (Reuters) - U.S. stocks rose on Tuesday in the first session of the new year, pushing the S&P 500 and Nasdaq to record closing highs, as investors were optimistic that 2018 will bring more gains for the market. \nGains were driven the most by technology, but consumer discretionary, healthcare, energy and materials sectors were also up more than 1 percent each. \nApple ( AAPL.O ), Facebook ( FB.O ), Alphabet ( GOOGL.O ) and Microsoft ( MSFT.O ) pulled the technology index .SPLRCT up 1.4 percent, following a 37-percent surge in 2017 that made it the best-performing S&P sector. \nMajor stock indexes had closed out 2017 with their best performances since 2013. Many investors say the rally could continue this year with help from the recently approved U.S. tax overhaul that is anticipated to boost profits as well as the economy. \n“We’re off to the races once again,” said Stephen Massocca, senior vice president at Wedbush Securities in San Francisco. \n“I don’t expect the kind of moves we saw last year. But as long as monetary policy stays the way it is ... my view is stocks are going to have a decent year. And fiscal policy has become stimulative, as well, given the tax bill.” \nThe Dow Jones Industrial Average .DJI rose 104.79 points, or 0.42 percent, to 24,824.01, the S&P 500 .SPX gained 22.18 points, or 0.83 percent, to 2,695.79 and the Nasdaq Composite .IXIC added 103.51 points, or 1.5 percent, to 7,006.90. \n“Our best guess is the first quarter or half of the year can be OK as a continuation of last year,” said Paul Nolte, portfolio manager at Kingsview Asset Management in Chicago. FILE PHOTO: The trading floor is seen on the final day of trading for the year at the New York Stock Exchange (NYSE) in Manhattan, New York, U.S., December 29, 2017. REUTERS/Andrew Kelly \nBut, he said, there are risks ahead. “Valuations are still stretched, interest rates are still rising, and those will provide headwinds to the market at some point.” \nThe S&P consumer discretionary index .SPLRCD was up 1.5 percent, helped by a gain in Amazon.com ( AMZN.O ) of 1.7 percent. \nJ.C. Penney ( JCP.N ), Nordstrom ( JWN.N ) and Kohl’s ( KSS.N ) climbed after a bullish Citigroup note on the retail sector detailed benefits from the corporate tax cuts. \nEnergy shares were up even though oil prices dipped. Oil hovered near mid-2015 highs amid large anti-government rallies in major exporter Iran and ongoing supply cuts led by OPEC and Russia. The S&P energy index .SPNY rose 1.8 percent. \nShares of casino operators Wynn Resorts ( WYNN.O ) and Melco Resorts & Entertainment ( MLCO.O ) were down after a report showed lower-than-expected rise in Macau gambling revenue in December. \nAbbott Labs ( ABT.N ) jumped 3 percent and hit an intraday record of $59.20 after two brokerages upgraded the company’s stock to “overweight.” \nShares of Allstate ( ALL.N ) were down 2.7 percent on a brokerage downgrade. \nAdvancing issues outnumbered declining ones on the NYSE by a 1.64-to-1 ratio; on Nasdaq, a 2.01-to-1 ratio favored advancers. Additional reporting by Sruthi Shankar   Sriraj Kalluvila and Nick Zieminski", "external_links": [], "published": "2018-01-02T14:37:00.000+02:00", "crawled": "2018-01-02T14:54:17.059+02:00", "highlightTitle": ""}