{"organizations": [], "uuid": "4196a76d113bcd3f17fe8c5088f38c3a147397c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-tumble-anew-amid-bond-yield-pressure-idUSL2N1PP2AF", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks tumble anew amid bond yield pressure", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T04:03:00.000+02:00", "replies_count": 0, "uuid": "4196a76d113bcd3f17fe8c5088f38c3a147397c6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-tumble-anew-amid-bond-yield-pressure-idUSL2N1PP2AF", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks tumble anew amid bond yield pressure", "locations": [], "entities": {"persons": [{"name": "herbert lash", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds gold, oil settlement prices)\n* MSCI world stocks index in biggest two-day selloff in six months\n* Dollar reverses gains as Fed starts two-day meeting\n* Oil falls on evidence of increased U.S. output\nBy Herbert Lash\nNEW YORK, Jan 30 (Reuters) - World stocks declined in their biggest two-day dive in almost six months on Tuesday as tumbling oil prices and a jump in global borrowing costs cooled the year’s euphoric start in financial markets.\nLackluster German inflation curbed a rise in U.S. Treasury yields - the benchmark for world lending rates - after they touched their strongest level in nearly four years overnight at 2.733 percent.\nStocks on Wall Street shed around 1 percent, led by a plunge in healthcare-related companies after Amazon.com, Berkshire Hathaway and JPMorgan said they plan to form a venture to cut healthcare costs for their U.S. employees.\nHealthcare tumbled 2.06 percent, the biggest decline among the 11 major S&P 500 sectors.\nHealth insurer UnitedHealth and drugmaker Pfizer were among the top five decliners in the S&P 500, falling 4.05 percent and 3.66 percent, respectively.\nPfizer had risen about 2 percent in pre-market trading after the company’s quarterly results and full-year forecasts beat expectations.\nStocks were also pulled lower by a decline in energy shares amid ongoing evidence of rising U.S. crude output.\nThe S&P energy sector fell 1.85 percent.\nInvestors were spooked by the two-day decline on Wall Street, which prompted a flight to the safety of U.S. government bonds, said Gennadiy Goldberg, interest rates strategist at TD Securities in New York.\nInvestors awaited President Donald Trump’s first State of the Union address to Congress Tuesday night, a Federal Reserve statement on Wednesday and a jobs report on Friday that serves as a key barometer of the U.S. economy.\nThe Fed will be watched for comments that could quicken the pace of expected interest rate hikes this year as the inflation outlook has firmed in recent readings.\n“Investors are getting a bit worried about inflation, which has led some people to believe that the Fed might be more aggressive when it comes to raising rates,” said Robert Pavlik, chief investment strategist at SlateStone Wealth.\n“Despite this selloff, all indications point to a firming economy and I do expect to see some bargain hunters step in soon,” Pavlik said.\nOn Wall Street, the Dow Jones Industrial Average fell 374.55 points, or 1.42 percent, to 26,064.93. The S&P 500 lost 30.64 points, or 1.07 percent, to 2,822.89 and the Nasdaq Composite dropped 72.40 points, or 0.97 percent, to 7,394.10.\nThe pan-European FTSEurofirst 300 index closed down 0.83 percent and MSCI’s gauge of stock performance in 47 countries around the globe shed 0.95 percent.\nBenchmark 10-year U.S. Treasury notes fell 4/32 in price to yield 2.7142 percent.\nGermany’s 10-year bond fell to 0.68 percent, down about 1 basis point on the day. After going positive for the first time since late 2015 on Monday, five-year German bond yields slipped back into negative territory.\nThe dollar reversed Monday’s gains. After six straight weekly declines, the dollar index was on track to fall about 3.4 percent for the month, which would be its biggest monthly fall since March 2016.\nThe dollar index fell 0.15 percent, with the euro up 0.16 percent to $1.2401. The Japanese yen strengthened 0.17 percent versus the greenback at 108.79 per dollar.\nBrent crude futures settled down 44 cents to $69.02 a barrel, while West Texas Intermediate futures slid $1.06 to settle at $64.50.\nExpectations for U.S. crude inventories to rise for the first time in 11 weeks may also be keeping oil under pressure, according to a preliminary poll by Reuters on Monday.\n“The global trend seems to be indicating more oil is coming into the market despite best efforts by the Saudis and Russians to curtail output,” said John Kilduff, partner at Again Capital LLC in New York.\nGold slipped back to a one-week low.\nU.S. gold futures for February delivery settled down $4.90 at $1,335.40 per ounce.\nReporting by Herbert Lash; Editing by Nick Zieminski and James Dalgleish\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T04:03:00.000+02:00", "crawled": "2018-01-31T04:38:45.007+02:00", "highlightTitle": ""}