{"organizations": [], "uuid": "15c0fec84d7143e95347abd940287be332a9cb54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-determine-to-announce-third-quarter-fiscal-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Determine to Announce Third Quarter Fiscal 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "15c0fec84d7143e95347abd940287be332a9cb54"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-determine-to-announce-third-quarter-fiscal-2018-financial-results.html", "ord_in_thread": 0, "title": "Determine to Announce Third Quarter Fiscal 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "carmel", "sentiment": "none"}], "organizations": [{"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARMEL, Ind., Determine, Inc. (NASDAQ:DTRM), a pioneering leader in global Source-to-Pay and Enterprise Contract Lifecycle Management (ECLM) Cloud Platform solutions, announced today that the company will report third quarter fiscal year 2018 financial results after market close on Thursday, February 8, 2018. Results will be announced via a press release and detailed financial results will be available on the same day via conference call and webcast.\nConference Call and Webcast: Thursday, February 8, 2018 at 5:00 PM (Eastern Time)\nParticipant Dial-In Numbers:\nToll-Free: 1-877-407-0789 Toll/International: 1-201-689-8562 Participant Webcast Link: http://public.viavid.com/index.php?id=128017 Replay Dial-In Numbers: Toll-Free: 1-844-512-2921 Toll/International: 1-412-317-6671 From: 02/08/18 at 8:00 pm Eastern Time To: 02/15/18 at 11:59 pm Eastern Time Replay Pin Number: 13675586 Related: http://investor.determine.com\nForward-looking Statements\nCertain statements in this release and elsewhere by Determine are forward-looking statements within the meaning of the federal securities laws and the Private Securities Litigation Reform Act of 1995. Such statements may include, without limitation, statements regarding business outlook, assessment of market conditions, anticipated financial and operating results, strategies, product and channel development, future plans, contingencies and contemplated transactions of the company. Such forward-looking statements are not guarantees of future performance and are subject to known and unknown risks, uncertainties and other factors which may cause or contribute to actual results of company operations, or the performance or achievements of the company or industry results, to differ materially from those expressed, or implied by the forward-looking statements. In addition to any such risks, uncertainties and other factors discussed elsewhere herein, risks, uncertainties and other factors that could cause or contribute to actual results differing materially from those expressed or implied for the forward-looking statements include, but are not limited to fluctuations in demand for Determine’s products and services, risks of losing key personnel or customers, protection of the company’s intellectual property and government policies and regulations, including, but not limited to those affecting the company’s industry. Determine undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise. Additional risk factors concerning the company can be found in the company’s most recent Form 10-K as filed by the company with the Securities and Exchange Commission.\nSupporting Resources\nDetermine blog\nDetermine on LinkedIn\nDetermine on Twitter\nDetermine Resources\nAbout Determine, Inc.\nDetermine, Inc. (NASDAQ:DTRM) is a leading global provider of SaaS Source-to-Pay and Enterprise Contract Lifecycle Management (ECLM) solutions. The Determine Cloud Platform provides procurement, legal and finance professionals analytics of their supplier, contract and financial performance. Our technologies empower customers to drive new revenue, identify savings, improve compliance and mitigate risk.\nThe Determine Cloud Platform seamlessly integrates with major ERP or third-party systems such as SAP, Oracle, Sage, QAD and Microsoft. Modular solutions can be configured to add more as needed to provide additional value beyond spend management. Our unified master database and business process approach empower users at every level to make more informed and smarter decisions.\n please visit: www.determine.com .\nContact\nMedia Relations:\nMike Mitchell\nDetermine Inc.\n+1.650-532-1590\npr@determine.com\nSource:Determine, Inc.", "external_links": ["https://www.determine.com/?utm_source=PR&utm_medium=Website&utm_campaign=PR&utm_content=TextLink&elqCampaignId=656", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d9c1e4d3-0f57-4118-9f5e-b4600628d0f8", "https://twitter.com/Determine", "http://investor.determine.com/", "http://public.viavid.com/index.php?id=128017", "https://www.determine.com/resources", "https://www.determine.com/", "http://www.determine.com/blog?utm_source=PR&utm_medium=Website&utm_campaign=PR&utm_content=TextLink&elqCampaignId=656", "https://www.linkedin.com/company/determine"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:34:14.000+02:00", "highlightTitle": ""}