{"organizations": [], "uuid": "ef9f8888621cf73ecf6ff99ffd7abdd16ebb95d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-steve-madden-announces-fourth-quarter-and-fiscal-year-2017-sales-results.html", "country": "US", "domain_rank": 767, "title": "Steve Madden Announces Fourth Quarter and Fiscal Year 2017 Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:59:00.000+02:00", "replies_count": 0, "uuid": "ef9f8888621cf73ecf6ff99ffd7abdd16ebb95d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-steve-madden-announces-fourth-quarter-and-fiscal-year-2017-sales-results.html", "ord_in_thread": 0, "title": "Steve Madden Announces Fourth Quarter and Fiscal Year 2017 Sales Results", "locations": [], "entities": {"persons": [{"name": "steve madden", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "schwartz & benjamin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Updates Fiscal Year 2017 EPS Guidance\nNEW YORK--(BUSINESS WIRE)-- Steve Madden (Nasdaq:SHOO), a leading designer and marketer of fashion footwear and accessories for women, men and children, today announced preliminary sales results for the fourth quarter and fiscal year ended December 31, 2017 and updated its fiscal year 2017 EPS guidance.\nFor the fourth quarter, net sales were $364.4 million, up 8.3% compared to the same period of 2016. Net sales for the wholesale division increased 10.6% to $278.2 million, or 2.5% to $257.9 million excluding results from Schwartz & Benjamin. Retail net sales increased 1.5% to $86.2 million. Retail comparable store sales for the fourth quarter of 2017 decreased 5.1%.\nFor fiscal year 2017, net sales were $1.5 billion, a 10.5% increase compared to fiscal year 2016. Wholesale net sales increased 12.1% to $1.3 billion, or 5.0% to $1.2 billion excluding results from Schwartz & Benjamin. Retail net sales increased 3.6% to $272.2 million. Retail comparable store sales for fiscal year 2017 decreased 3.2%.\nDiluted EPS for fiscal year 2017 is now expected to be at the high end of the Company’s previously provided guidance range.\nEdward Rosenfeld, Chairman and Chief Executive Officer, commented, “We are pleased with our fourth quarter results, with earnings per share expected to be at the high end of our guidance range. Solid performance in our wholesale business was offset by softness, as expected, in our retail segment driven by weakness in the boot category. Overall, 2017 was a strong year for Steve Madden. We delivered robust sales and earnings growth driven by the outstanding performance of our flagship Steve Madden brand in the wholesale channel. We also took a number of steps to position the Company for future growth, including the acquisition of Schwartz & Benjamin and the formation of new joint ventures in China and Taiwan. As we look ahead, we are confident that our strong brands and increasingly diversified business model position us to continue to drive top- and bottom-line gains for years to come.”\nReported results are preliminary and remain subject to adjustment until the filing of the Company's Annual Report on Form 10-K with the SEC.\nThe Company will be presenting at the 20th Annual ICR Conference held at the JW Marriott Orlando Grande Lakes in Orlando, FL, on Monday, January 8, 2018, at 4:00 pm Eastern Time. The audio portion of the presentation will be webcast live over the internet and can be accessed through the Investor Relations section at http://www.stevemadden.com . An online archive will be available for a period of 90 days following the presentation.\nAbout Steve Madden\nSteve Madden designs, sources and markets fashion-forward footwear and accessories for women, men and children. In addition to marketing products under its own brands, including Steve Madden ®, Dolce Vita ®, Betsey Johnson ®, Report ®, Blondo ®, Big Buddha®, Brian Atwood ®, Cejon®, and Mad Love®, Steve Madden is a licensee of various brands, including Kate Spade®, Superga ® and Avec Les Filles®. Steve Madden also designs and sources products under private label brand names for various retailers. Steve Madden's wholesale distribution includes department stores, specialty stores, luxury retailers, national chains and mass merchants. Steve Madden also operates 205 retail stores (including four Internet stores). Steve Madden licenses certain of its brands to third parties for the marketing and sale of certain products, including for ready-to-wear, outerwear, intimate apparel, eyewear, hosiery, jewelry, fragrance, luggage and bedding and bath products. For local store information and the latest Steve Madden booties, pumps, men’s and women’s boots, dress shoes, sandals and more, visit http://www.stevemadden.com/ .\nSafe Harbor\nThis press release and oral statements made from time to time by representatives of the Company contain certain “forward looking statements” as that term is defined in the federal securities laws. The events described in forward looking statements may not occur. Generally, these statements relate to business plans or strategies, projected or anticipated benefits or other consequences of the Company's plans or strategies, projected or anticipated benefits from acquisitions to be made by the Company, or projections involving anticipated revenues, earnings or other aspects of the Company's operating results. The words \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"project,\" \"plan,\" \"intend,\" \"estimate,\" and \"continue,\" and their opposites and similar expressions are intended to identify forward looking statements. The Company cautions you that these statements concern current expectations about the Company’s future results and condition and are not guarantees of future performance or events and are subject to a number of uncertainties, risks and other influences, many of which are beyond the Company's control, that may influence the accuracy of the statements and the projections upon which the statements are based. Factors which may affect the Company's results include, but are not limited to, the risks and uncertainties discussed in the Company's Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K filed with the Securities and Exchange Commission. Any one or more of these uncertainties, risks and other influences could materially affect the Company's results of operations and financial condition and whether forward looking statements made by the Company ultimately prove to be accurate and, as such, the Company's actual results, performance and achievements could differ materially from those expressed or implied in these forward looking statements. The Company undertakes no obligation to publicly update or revise any forward looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005512/en/\nICR, Inc.\nInvestor Relations\nJean Fontana/Megan Crudele\n203-682-8200\nwww.icrinc.com\nSource: Steve Madden", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.superga-usa.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Superga&index=8&md5=2b1de8b9e59f4b5a74fa2df1676b67ac", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.stevemadden.com&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=http%3A%2F%2Fwww.stevemadden.com&index=1&md5=c4fb86b09b755a6ed2a5c001dcdd0167", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.icrinc.com&esheet=51739155&lan=en-US&anchor=www.icrinc.com&index=10&md5=10b9697da336dbe460b05ba4c0a9ca0b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.dolcevita.com&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Dolce+Vita&index=3&md5=39205937b223e21c83ffd308db7f3767", "http://www.businesswire.com/news/home/20180108005512/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.blondo.ca&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Blondo&index=6&md5=85a83817b1dd5d7fbe229d9da5a6a2c1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.stevemadden.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Steve+Madden&index=2&md5=5604e1f53d529a514681e35321b8422a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.brianatwood.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Brian+Atwood&index=7&md5=22ce6a02c64a241ef6fe6ffa32c84ca9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.betseyjohnson.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Betsey+Johnson&index=4&md5=399e59a54251616e10f8ec9828ebb937", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.reportshoes.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=Report&index=5&md5=bf5a207082c5fefc4461656111c0a8a2", "http://www.stevemadden.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.stevemadden.com%2F&esheet=51739155&newsitemid=20180108005512&lan=en-US&anchor=http%3A%2F%2Fwww.stevemadden.com%2F&index=9&md5=8b3db2976bf120a2feaee61382df94f4"], "published": "2018-01-08T14:59:00.000+02:00", "crawled": "2018-01-08T15:33:55.064+02:00", "highlightTitle": ""}