{"organizations": [], "uuid": "487393d0bfc2b20e24e5250f1a3a134813044194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-liquid-web-acquires-ithemes-to-continue-its-focus-on-managed-wordpress-and-managed-woocommerce-hosting.html", "country": "US", "domain_rank": 767, "title": "Liquid Web Acquires iThemes to Continue its Focus on Managed WordPress and Managed WooCommerce Hosting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:00:00.000+02:00", "replies_count": 0, "uuid": "487393d0bfc2b20e24e5250f1a3a134813044194"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-liquid-web-acquires-ithemes-to-continue-its-focus-on-managed-wordpress-and-managed-woocommerce-hosting.html", "ord_in_thread": 0, "title": "Liquid Web Acquires iThemes to Continue its Focus on Managed WordPress and Managed WooCommerce Hosting", "locations": [], "entities": {"persons": [{"name": "cory miller", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "lansing", "sentiment": "none"}, {"name": "oklahoma city", "sentiment": "none"}], "organizations": [{"name": "focus on managed wordpress", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LANSING, Mich., Jan. 31, 2018 /PRNewswire/ -- Liquid Web, LLC, ( www.liquidweb.com ), the market leader in managed hosting services to SMBs and web professionals announced their acquisition of iThemes, a leader in WordPress plugins that include BackupBuddy, iThemes Security Pro, multiple site management Sync and iThemes Sales Accelerator.\nLocated in Oklahoma City, iThemes will continue to function as an independent unit within Liquid Web. All employees remain with iThemes and Cory Miller, founder, will remain as General Manager of iThemes while joining the Liquid Web leadership team.\nLiquid Web partnered with iThemes in 2016 to bundle iThemes Sync Pro with Liquid Web's Managed WordPress hosting offering. As part of this acquisition, the company will further integrate iThemes BackupBuddy, and iThemes Security into their current Managed WordPress hosting product as well as offer the product lines for sale to Liquid Web customers with unmanaged WordPress sites. Their recently launched iThemes Sales Accelerator, a data and e-commerce insights plugin, will be integrated into Liquid Web's Managed WooCommerce hosting product launching in early January 2018.\n\"The acquisition of iThemes supports Liquid Web's mission to empower web professionals worldwide and further demonstrates our commitment to being a leader in the WordPress and WooCommerce marketplace,\" said Jim Geiger, CEO. \"We believe that the combination of the Liquid Web and iThemes teams and products will be very beneficial to our Managed WordPress hosting customers and our newly launched Managed WooCommerce Hosting product, the industry's first platform dedicated to WooCommerce Stores. I look forward to bringing in WordPress expert Cory Miller to help our company shape our Managed WordPress and Managed WooCommerce hosting strategies.\"\n\"Liquid Web has launched the premier product in eCommerce hosting for WooCommerce sites, and we have a lot of plans for that product line,\" said Cory Miller, Founder of iThemes. \"While remaining an independent business unit, iThemes will grow with access to the leadership strategies of Liquid Web, capital and strong marketing. I'm excited about the Liquid Web roadmap and I believe together we will bring great solutions to the marketplace.\"\nTo learn more about iThemes offerings visit: https://www.liquidweb.com/products/add-ons/ithemes/\nAbout Liquid Web\nMarking its 20th year anniversary, Liquid Web powers content, commerce, and potential for SMB entrepreneurs and the designers, developers and digital agencies who create for them. An industry leader in managed hosting, managed WordPress and cloud services, Liquid Web is known for its high-performance services and exceptional customer support. Liquid Web offers a broad portfolio designed so customers can choose a hosting solution that is hands-on or hands-off or a hybrid of the two. The company owns and manages its own core data centers, providing a diverse range of offerings spanning from bare metal servers and fully managed hosting to managed WordPress and continues to evolve its service offerings to meet the ever-changing needs of its web-reliant, professional customers. With over 32,000 customers spanning 150 countries, the company has assembled a world-class team, global data centers and an expert group of 24/7/365 solution engineers. As an industry leader in customer service*, the rapidly expanding company has been recognized among INC Magazine's 5000 Fastest Growing Companies for ten years. Liquid Web is part of the Madison Dearborn Partners family of companies. Madison Dearborn Partners, LLC (\"MDP\") is a leading private equity investment firm based in Chicago. For more information, please visit www.liquidweb.com , or read our blog posts at http://www.liquidweb.com/blog . Stay up to date with all Liquid Web events on Twitter and LinkedIn.\n*2016 Net Promoter Score of 71\nContact: Mayra Pena, mpena@liquidweb.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/liquid-web-acquires-ithemes-to-continue-its-focus-on-managed-wordpress-and-managed-woocommerce-hosting-300591230.html\nSOURCE Liquid Web", "external_links": ["http://www.liquidweb.com/blog", "https://www.liquidweb.com/products/add-ons/ithemes/", "http://www.prnewswire.com/news-releases/liquid-web-acquires-ithemes-to-continue-its-focus-on-managed-wordpress-and-managed-woocommerce-hosting-300591230.html"], "published": "2018-01-31T20:00:00.000+02:00", "crawled": "2018-01-31T22:52:55.015+02:00", "highlightTitle": ""}