{"organizations": [], "uuid": "986b82680fc448a32d08a5c0217357b44ef80986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-brookfield-business-partners-to-acquire-westinghouse-electric-company.html", "country": "US", "domain_rank": 767, "title": "Brookfield Business Partners to Acquire Westinghouse Electric Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T17:10:00.000+02:00", "replies_count": 0, "uuid": "986b82680fc448a32d08a5c0217357b44ef80986"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-brookfield-business-partners-to-acquire-westinghouse-electric-company.html", "ord_in_thread": 0, "title": "Brookfield Business Partners to Acquire Westinghouse Electric Company", "locations": [], "entities": {"persons": [{"name": "cyrus madon", "sentiment": "none"}], "locations": [{"name": "brookfield", "sentiment": "none"}, {"name": "brookfield", "sentiment": "none"}], "organizations": [{"name": "brookfield business partners l.p.", "sentiment": "negative"}, {"name": "brookfield business partners to acquire westinghouse electric company", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "brookfield business partners", "sentiment": "none"}, {"name": "toshiba corp", "sentiment": "none"}, {"name": "westinghouse electric company", "sentiment": "none"}, {"name": "westinghouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BROOKFIELD, NEWS, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Brookfield Business Partners L.P. (NYSE:BBU) (TSX:BBU.UN) (\"Brookfield Business Partners\"), together with institutional partners (collectively \"Brookfield\"), announced today that it has entered into an agreement to acquire 100% of Westinghouse Electric Company (“Westinghouse” or “the Company”), a leading global provider of infrastructure services to the power generation industry, which is currently owned by Toshiba Corp.\nThe transaction provides for a purchase price of approximately $4.6 billion, expected to be funded with approximately $1 billion of equity, approximately $3 billion of long-term debt financing and the balance by the assumption of certain pension, environmental and other operating obligations.\n“Westinghouse is a high-quality business that has established itself as a leader in its field, with a long-term customer base and a reputation for innovation,” said Cyrus Madon, CEO of Brookfield Business Partners. “We look forward to bringing our significant expertise and reputation as a long-term owner and operator of critical infrastructure in the U.S. and globally, as well as our deep facilities management capabilities, to enhance the Company’s position as a leading global infrastructure services provider to the power generation industry.”\nBusiness Overview:\nWestinghouse is among the world’s leading suppliers of infrastructure services to nuclear power generating facilities. The Company provides sophisticated engineering, maintenance, facilities management and repair services to its global customer base.\nBusiness highlights:\nStrong market position. Westinghouse is a leader in its field, as the largest service provider to the world’s nuclear power facilities. The Company operates within a complex regulatory and licensing environment requiring depth of expertise and capability.\nGlobal, diversified customer base. Westinghouse has a well-established installed base of long-term customers globally.\nAttractive revenue and cash flow profile. The majority of the Company’s profitability is delivered through regularly scheduled services which are provided under long-term contracts. Westinghouse’s core business has generated stable margins and consistent free cash flow.\nStrong reputation driven by focus on innovation. An iconic American company, Westinghouse offers a full suite of specialized parts and components, many of which are licensed or patented, as well as industry-leading engineering and other services that enhance the safety, efficiency and reliability of its customers’ facilities.\nFunding\nBrookfield Business Partners will commit to fund approximately 50% of the equity on closing using existing liquidity. Prior to or following closing, a portion of Brookfield Business Partners' investment may be syndicated to other institutional investors.\nTransaction Process\nClosing of the transaction remains subject to Bankruptcy Court approval and customary closing conditions including, among others, regulatory approvals. Closing is expected to occur in the third quarter of 2018.\nBrookfield Business Partners is a business services and industrials company focused on owning and operating high-quality businesses that benefit from barriers to entry and/or low production costs. Brookfield Business Partners is listed on the New York and Toronto stock exchanges. Important information may be disseminated exclusively via the website; investors should consult the site to access this information.\nBrookfield Business Partners is the flagship listed business services and industrials company of Brookfield Asset Management Inc. (NYSE:BAM) (TSX:BAM.A) (EURONEXT:BAMA), a leading global alternative asset manager with over $265 billion of assets under management, of which approximately $141 billion are in the U.S. For more information, please visit our website at https://bbu.brookfield.com .\nMedia contact:\nSuzanne Fleming\nTel: (212) 417-2421\nEmail: suzanne.fleming@brookfield.com Investor contact:\nCourtney Burke\nTel: (416) 369-2629\nEmail: courtney.burke@brookfield.com\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS AND INFORMATION\nNote: This news release contains \"forward-looking information\" within the meaning of Canadian provincial securities laws and \"forward-looking statements\" within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, Section 21E of the U.S. Securities Exchange Act of 1934, as amended, \"safe harbor\" provisions of the United States Private Securities Litigation Reform Act of 1995 and in any applicable Canadian securities regulations. The words \"will,\" \"expect,\" “assume,” “enhance,” “provide,” “generate,” \"may,\" derivatives thereof and other expressions which are predictions of or indicate future events, trends or prospects and which do not relate to historical matters will tend to identify forward-looking statements.\nForward-looking statements in this news release include statements regarding the expected completion of the transaction described herein and the anticipated timing thereof, and the future performance and operation of the acquired business.\nAlthough we believe that the forward-looking statements we make are based upon reasonable assumptions and expectations, the reader should not place undue reliance on them or any other forward-looking statements or information in this news release. The future performance and prospects of Brookfield Business Partners are subject to a number of known and unknown risks, uncertainties and other factors, many of which are beyond our control. Factors that could cause actual results to differ materially from those contemplated or implied by forward-looking statements in this news release include, but are not limited to: the impact or unanticipated impact of general economic, political and market factors in the countries in which we do business; the behavior of financial markets, including fluctuations in interest and foreign exchange rates; global equity and capital markets and the availability of equity and debt financing and refinancing within these markets; strategic actions including acquisitions and dispositions; the ability to complete and effectively integrate acquisitions into existing operations and the ability to attain expected benefits and in particular completion of the acquisition referred to in this news release, which cannot be assured; changes in accounting policies and methods used to report financial condition (including uncertainties associated with critical accounting assumptions and estimates); the ability to appropriately manage human capital; the effect of applying future accounting changes; business competition; operational and reputational risks; technological change; changes in government regulation and legislation within the countries in which we operate; governmental investigations; litigation; changes in tax laws; ability to collect amounts owed; catastrophic events, such as earthquakes and hurricanes; the possible impact of international conflicts and other developments including terrorist acts and cyber terrorism; and other risks and factors detailed from time to time in our documents filed with the securities regulators in Canada and the United States.\nWe caution that the foregoing list of important factors th", "external_links": ["https://www.globenewswire.com/Tracker?data=TWFPF-6b0JHNYUzELDAg_U2zRQjzDbJxWP4r8ZJ-YfNVZoLHxPhu0pTdTbnHfeKxyOJq4bXsJnMAAm6ZB34fxNxRroyXkQOLENrej3kNuUNwbWjRUgJ94-1-ohSKksd82FZz2pYpAbFIgiYrZFXbKKRgSkFJZU7Z-dqNlPE0rEIpjz-wFp4io7DbYb3XskKn30McrSXFJ5Mqn6zeWqKMm9xoHJFxE1_jG53F3Hz4ova6Jo0w1IJG5jOucaSd1zbB1h1nh-RiWFmzaTGnjORpIA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/26770ab4-c795-45a7-bcc4-0635093d9c83"], "published": "2018-01-04T17:10:00.000+02:00", "crawled": "2018-01-04T16:39:10.021+02:00", "highlightTitle": ""}