{"organizations": [], "uuid": "73750c919c5b4b3e286124e9c340ba700beea994", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-fandango-to-launch-google-pay-as-a-new-digital-payment-option-for-fast-and-easy-movie-ticket-buying.html", "country": "US", "domain_rank": 767, "title": "FANDANGO TO LAUNCH GOOGLE PAY AS A NEW DIGITAL PAYMENT OPTION FOR FAST AND EASY MOVIE TICKET BUYING", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-08T21:09:00.000+02:00", "replies_count": 0, "uuid": "73750c919c5b4b3e286124e9c340ba700beea994"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-fandango-to-launch-google-pay-as-a-new-digital-payment-option-for-fast-and-easy-movie-ticket-buying.html", "ord_in_thread": 0, "title": "FANDANGO TO LAUNCH GOOGLE PAY AS A NEW DIGITAL PAYMENT OPTION FOR FAST AND EASY MOVIE TICKET BUYING", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 8, 2018 /PRNewswire/ -- Fandango, the nation's ultimate digital network for all things movies, announced today it will be rolling out Google Pay as a new digital payment option for movie ticket purchases across its online, mobile and social ticketing platforms. Google Pay brings together all the different ways to make purchases with Google, including Android Pay and Google Wallet, into one single brand.\nAccording to a recent survey of more than 1,000 Fandango users, 81% say they currently use some sort of digital payment service.\n\"With Google Pay on Fandango, you can buy tickets with ease—making checkout simpler than ever,\" says Pali Bhat, VP of Product Management, Payments at Google.\n\"Fandango is always looking for new ways to make discovering movies and purchasing tickets faster and easier for moviegoers,\" says Mark Young, SVP, Strategy & Business Development, Fandango. \"Google Pay provides a simple, intuitive option for Fandango customers to speed through checkout with just one tap. We look forward to working with Google as they grow this exciting new payment platform.\"\nMoviegoers can expedite their checkout process on Fandango by selecting Google Pay as a payment option after choosing the show time and entering the quantity of tickets they want to purchase. To celebrate the introduction of Google Pay on Fandango, the companies are offering $5 off movie ticket orders to fans using Google Pay on the Fandango Android app and entering the promo code, \"GooglePay2018.\" (Offer available while supplies last, with a limit of one code per person; see Fandango for details.)\nIn 2017, Fandango saw record-breaking ticket sales with more than 70% of its ticket sales coming from mobile devices. In December, the company closed its acquisition of MovieTickets.com , which will join ticketing brands Fandango, Flixster, Ingresso and Fandango Latin America to create a global suite of movie ticketing properties, serving hundreds of millions of moviegoers worldwide.\nAbout Fandango\nFandango is the ultimate digital network for all things movies, serving consumers with best-in-class movie information, ticketing to more than 33,000 screens worldwide, movie trailers and original video content for movie discovery, home entertainment and movie fan merchandise. Its portfolio reaches more than 67 million unique visitors per month globally, with 210 million app downloads in the U.S. and South America, and includes popular movie properties Flixster, Rotten Tomatoes and the Tomatometer™ rating, and Fandango Movieclips, the No. 1 movie trailers and content channel on YouTube. Its new premium on demand video service, FandangoNOW offers new release and catalog movies and next-day TV shows on a wide variety of connected, over-the–top (OTT) and mobile devices. Also part of the Fandango family are Latin America's leading online ticketers, Ingresso.com , and Fandango Latin America (formerly CinePapaya).\nView original content with multimedia: http://www.prnewswire.com/news-releases/fandango-to-launch-google-pay-as-a-new-digital-payment-option-for-fast-and-easy-movie-ticket-buying-300579187.html\nSOURCE Fandango", "external_links": ["http://www.prnewswire.com/news-releases/fandango-to-launch-google-pay-as-a-new-digital-payment-option-for-fast-and-easy-movie-ticket-buying-300579187.html"], "published": "2018-01-08T21:09:00.000+02:00", "crawled": "2018-01-09T09:40:35.561+02:00", "highlightTitle": ""}