{"organizations": [], "uuid": "3b6795ef18cf0a32b2ae7dbffd313e5016944950", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-higher-as-consumer-and-bank-stocks-gain-idUSL4N1P74DV", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall Street higher as consumer and bank stocks gain", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.571, "site_type": "news", "published": "2018-01-12T23:11:00.000+02:00", "replies_count": 0, "uuid": "3b6795ef18cf0a32b2ae7dbffd313e5016944950"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-higher-as-consumer-and-bank-stocks-gain-idUSL4N1P74DV", "ord_in_thread": 0, "title": "US STOCKS-Wall Street higher as consumer and bank stocks gain", "locations": [], "entities": {"persons": [{"name": "sruthi shankar jan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wells fargo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Consumer prices rise 0.3 pct in Dec. vs est. rise of 0.2 pct\n* Retail sales up 0.4 pct vs est increase of 0.4 pct\n* Facebook falls after making changes to News Feed\n* Indexes up: Dow 0.42 pct, S&P 0.19 pct, Nasdaq 0.07 pct (Updates to open)\nBy Sruthi Shankar\nJan 12 (Reuters) - Wall Street’s main indexes were higher on Friday as strong December retail sales data drove gains in consumer stocks and bank results pushed up the financial sector.\nThe S&P consumer discretionary index jumped 0.55 percent after data showed households bought a range of goods and figures for the prior month were revised higher, suggesting the economy exited 2017 with strong momentum.\nAmazon rose 1.3 percent and provided the biggest boost to the S&P and the Nasdaq.\nJPMorgan Chase & Co rose 0.5 percent in choppy trading after the biggest U.S. bank by assets reported profit that beat estimates, benefiting from higher interest rates and loan growth.\nWells Fargo fell 0.7 percent as the bank set aside more money in fourth quarter to cover expenses related to probes into its mortgage and sales practices.\nThe S&P financial index rose 0.5 percent.\n“I don’t think you would’ve seen a big pop in bank stocks, no one’s surprised by these numbers,” said Ron Weiner president and founder of RDM financial in Westport Connecticut.\nWhile tax-related costs are expected to weigh on banks’ earnings, they are expected to benefit in the long run from lower tax burden.\nEarnings for S&P 500 companies are expected to increase on an average by 11.8 percent in the quarter with profit for financial services companies growing as much, according to Thomson Reuters I/B/E/S.\nAt 9:38 a.m. ET (1438 GMT), the Dow Jones Industrial Average was up 106.44 points, or 0.42 percent, at 25,681.17 and the S&P 500 was up 5.24 points, or 0.19 percent, at 2,772.8.\nThe Nasdaq Composite was up 5.27 points, or 0.07 percent, at 7,217.04. The index was dragged by a 4 percent fall in Facebook’s shares after the company started changing the way it filters posts and videos on News Feed.\nAdvanced Micro Devices fell 2.66 percent after the company said its microprocessors are prone to both variants of the Spectre security flaw, days after saying its risk for one of them was “near zero”.\nFutures fell briefly on Friday after consumer prices for December posted their biggest gains in 11 months, raising expectations of inflation gaining momentum this year.\nThe Labor Department’s Consumer Price Index, which excludes the volatile food and energy components, rose 0.3 percent last month. Economists polled by Reuters had forecast core CPI rising 0.2 percent.\nCore CPI increased 1.8 percent in the 12 months through December, picking up from 1.7 percent in November.\nAdvancing issues outnumbered decliners on the NYSE by 1,462 to 1,035. On the Nasdaq, 1,445 issues rose and 969 fell.\nReporting by Sruthi Shankar in Bengaluru; Editing by Arun Koyyur\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T23:11:00.000+02:00", "crawled": "2018-01-13T14:50:05.007+02:00", "highlightTitle": ""}