{"organizations": [], "uuid": "eaba340e6bd62f26416801f3994af3ca920f8ff7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-mostly-rises-as-emaar-continues-rebound-egypt-blue-chips-weak-idUSL8N1OY0W4", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Gulf mostly rises as Emaar continues rebound; Egypt blue chips weak", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:10:00.000+02:00", "replies_count": 0, "uuid": "eaba340e6bd62f26416801f3994af3ca920f8ff7"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-gulf-mostly-rises-as-emaar-continues-rebound-egypt-blue-chips-weak-idUSL8N1OY0W4", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Gulf mostly rises as Emaar continues rebound; Egypt blue chips weak", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "emaar", "sentiment": "negative"}, {"name": "emaar properties", "sentiment": "none"}, {"name": "emaar development", "sentiment": "none"}, {"name": "jan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "emaar malls", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 10 PM / in 21 minutes MIDEAST STOCKS-Gulf mostly rises as Emaar continues rebound; Egypt blue chips weak Reuters Staff \n* Dubai index rebounding from bottom of long-term uptrend channel \n* Banks lead Saudi market higher \n* Riyad Capital predicts price/earnings multiples will expand \n* Kuwait blue chips surge \n* Egypt’s Global telecom slips as tax authorities seize funds \nBy Andrew Torchia \nDUBAI, Jan 3 (Reuters) - Most major Gulf stock markets rose on Wednesday as some buyers returned from New Year holidays, and shares in Dubai’s blue chip Emaar group rebounded for a second straight day. \nEgypt lagged, however, led lower by a few blue chips. \nDubai’s index added 1.4 percent to 3,459 points in rising volume as Emaar Properties, which had surged 3.6 percent on Tuesday, gained a further 2.9 percent. Emaar Development jumped 3.8 percent and Emaar Malls added 1.8 percent. \nShares in the group fell sharply last year because of a slump in Dubai’s real estate market, but they have become the focus of investors betting that heavy spending by the government will buoy the economy and help the market stabilise this year. \nSeveral other beaten-down Dubai stocks also rebounded on Wednesday, with amusement park operator DXB Entertainments surging 5 percent, although logistics firm Aramex stayed weak, edging down 0.2 percent. \nThe Dubai index has turned technically bullish this week, beginning to rebound from the bottom of an uptrend channel dating back to early 2016. Technically, a rise in coming months to near the top of the channel would not be surprising, and would take the index above 3,700 points. \nSaudi Arabia’s index, which had fallen in the first two days of this year after the government hiked domestic gasoline prices, rebounded 0.7 percent to 7,224 points. \nBanks led the market with 10 of 12 gaining ground. National Commercial Bank, the biggest, surged 3.1 percent, although trading volume was modest. \nThe Saudi index edged up just 0.2 percent last year but many fund managers expect a better 2018 because of higher government spending. Santhosh Balakrishnan and Faisal Potrik, analysts at Riyad Capital, issued a report predicting the index would hit 7,936 points this year. \nThey based the forecast on the market trading at 14.5 times estimated corporate earnings for 2019, helped by economic reform, expected decisions by MSCI and FTSE to include Riyadh in their emerging markets indexes, and the planned listing of oil giant Saudi Aramco in late 2018 fuelling interest in the market. \nAfter three years of decline, Saudi corporate earnings have started to improve, led by banks and petrochemical firms. This should let price/earnings multiples expand, even though firms’ top lines have so far been stagnant, the analysts argued. \nBlue chips were bought in Kuwait on Wednesday with National Bank of Kuwait, the biggest lender, gaining 2.4 percent and logistics giant Agility rising 1.6 percent. The Kuwaiti index climbed 1.4 percent. \nEgypt’s blue-chip index fell 1.3 percent on Wednesday, although the broader EGX100 fared much better, slipping only 0.4 percent. \nThe blue-chip index was dragged down by Commercial International Bank, which fell 1.9 percent, and Global Telecom, which slipped 2.7 percent after saying Egyptian tax authorities were seizing money from its local bank accounts to obtain a contested tax payment of 990 million pounds ($56 million). The company said it would contest the action. HIGHLIGHTS \n* The index rose 0.7 percent to 7,224 points. DUBAI \n* The index gained 1.4 percent to 3,459 points. ABU DHABI \n* The index climbed 0.9 percent to 4,481 points. QATAR \n* The index edged down 0.1 percent to 8,608 points. EGYPT \n* The index fell 1.3 percent to 14,834 points. KUWAIT \n* The index surged 1.4 percent to 6,401 points. BAHRAIN \n* The index rose 0.3 percent to 1,325 points. OMAN \n* The index edged down 0.1 percent to 5,089 points. Editing by Susan Fenton", "external_links": [], "published": "2018-01-03T16:10:00.000+02:00", "crawled": "2018-01-03T16:33:05.017+02:00", "highlightTitle": ""}