{"organizations": [], "uuid": "f33681248303356ac87eb0dcd9cf72e97d8c0338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/26/the-associated-press-trump-plan-offers-citizenship-path-to-1-point-8-million-immigrants.html", "country": "US", "domain_rank": 767, "title": "Trump plan offers citizenship path to 1.8 million immigrants", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T07:18:00.000+02:00", "replies_count": 0, "uuid": "f33681248303356ac87eb0dcd9cf72e97d8c0338"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/the-associated-press-trump-plan-offers-citizenship-path-to-1-point-8-million-immigrants.html", "ord_in_thread": 0, "title": "Trump plan offers citizenship path to 1.8 million immigrants", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "white house", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "obama-era deferred action for childhood arrivals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The White House has unveiled a proposal that provides a pathway to citizenship for 1.8 million young immigrants living in the country illegally, in exchange for new restrictions on legal immigration and $25 billion in border security.\nThe plan, announced Thursday, was applauded by some in Congress, but blasted by conservative activists as \"amnesty\" and slammed by a slew of Democrats, who accused President Donald Trump of holding \"Dreamers\" hostage to his hard-line immigration agenda.\nSenior White House officials cast the plan as a centrist compromise that could win support from both parties and enough votes to pass the Senate. But it comes with a long list of concessions that many Democrats, and also conservative Republicans, especially in the House, may find impossible to swallow.\nThe plan would provide a pathway to citizenship for the roughly 690,000 younger immigrants protected from deportation by the Obama-era Deferred Action for Childhood Arrivals program — as well as hundreds of thousands of others who independent estimates say qualify for the program, but never applied.\nTrump announced last year that he was doing away with the program, but gave Congress until March to come up with a legislative fix.\nThe plan would not allow parents of those immigrants to seek lawful status, the officials said.\nIn exchange, Trump's plan would dramatically overhaul the legal immigration system. Immigrants would only be allowed to sponsor their spouses and underage children to join them in the U.S., and not their parents, adult children or siblings. The officials said it would only end new applications for visas, allowing those already in the pipeline to be processed. Still, immigration activists said the move could cut legal immigration in half.\nIt would also end a visa lottery aimed at diversity, which drew Trump's attention after the New York City truck attack last year, redirecting the allotment to bringing down the existing backlog in visa applications.\nThe officials spoke on the condition of anonymity because they were not authorized to publicly discuss the plan before its release.\nOn Wednesday, Trump said he was open to a pathway to citizenship for the younger immigrants. \"We're going to morph into it,\" Trump told reporters. \"It's going to happen, at some point in the future, over a period of 10 to 12 years.\" It was a reversal for the president, who had previously said he was opposed to a pathway to citizenship for Dreamer immigrants.\nUnder the plan, recipients could have their legal status revoked due to criminal behavior or national security threats, the officials said, and eventual citizenship would require still-unspecified work and education requirements — and a finding that the immigrants are of \"good moral character.\"\nThe nonpartisan Migration Policy Institute said it believes the largest share of the White House's 1.8 million people who'd be eligible for citizenship — 1.3 million — are people who currently meet all of DACA's eligibility requirements. These include years in the U.S., their ages now and when they entered this country, and whether they have a high school or equivalent education.\nAnother 400,000 are people who'd be eligible for DACA protection but for their education. And 100,000 more are people who are under age 15 —the minimum age allowed for most people requesting protection under the program.\nTrump ended the DACA program in September, setting a March 5 deadline for Congress to provide legal protections or the program's recipients would once again be subject to deportation. The officials said Trump would only sign legislation providing those protections if the other immigration changes he is proposing are implemented.\nTrump earlier this month had deferred to a bipartisan, bicameral group of lawmakers to craft an immigration proposal, saying he would sign whatever they passed. But as talks on Capitol Hill broke down — in part because of controversy Trump ginned up using vulgar language to describe African countries — the White House decided to offer its own framework.\nSenate Majority Leader Mitch McConnell and others had also complained the president had failed to sufficiently lay out his priorities, leaving them guessing about what he might be willing to sign. One official said the Thursday release represents a plan for the Senate, with the administration expecting a different bill to pass the House.\nMcConnell thanked the president and his aides for providing the outline. \"I am hopeful that as discussions continue in the Senate on the subject of immigration, Members on both sides of the aisle will look to this framework for guidance as they work towards an agreement,\" he said in a statement.\nDoug Andres, a spokesman for House Speaker Paul Ryan, echoed the sentiment saying: \"We're grateful for the president showing leadership on this issue and believe his ideas will help us ultimately reach a balanced solution.\"\nRep. Tom Cotton, R-Ark., an immigration hard-liner, called Trump's plan \"generous and humane, while also being responsible\" and said he'd work toward its passage. He said that besides protecting DACA recipients, \"It also will prevent us from ending up back here in five years by securing the border and putting an end to extended-family chain migration.\"\nBut some of Congress' more conservative members seemed unwilling to open the citizenship door for the Dreamers.\n\"DACA itself didn't have a pathway to citizenship,\" said Sen. Ted Cruz, R-Texas, who battled Trump in 2016 for the GOP presidential nomination. \"So I think it would be a profound mistake and not consistent with the promises we made to the voters to enact a pathway to citizenship to DACA recipients or to others who are here illegally.\"\nRep. Jim Jordan, R-Ohio, said he supports a more conservative, more sweeping immigration bill proposed by House members, including House Judiciary Committee Chairman Bob Goodlatte, R-Va., which has won strong support from House conservatives. Speaker Paul Ryan has promised to push for support for that measure.\nThe conservative Breitbart News, seen as a barometer of Trump's nationalist base, declared it \"Don's Amnesty Bonanza.\"\nDemocrats were also raging. House Democratic leader Nancy Pelosi, D-Calif., blasted the plan as \"an act of staggering cowardice which attempts to hold the Dreamers hostage to a hateful anti-immigrant scheme.\"\nIn a statement Thursday night, Pelosi said the framework was \"part of the Trump Administration's unmistakable campaign to make America white again.\"\nDemocratic Whip Dick Durbin, D-Ill., urged Republicans to join together with Democrats to reach a bipartisan alternative.\n\"Dreamers should not be held hostage to President Trump's crusade to tear families apart and waste billions of American tax dollars on an ineffective wall,\" he said in a statement.\nRep. Michelle Lujan Grisham, D-N.M., who chairs the Congressional Hispanic Caucus, said the White House was using DACA recipients \"as bargaining chips for sweeping anti-immigrant policies.\"\nAnd Lorella Praeli, with the American Civil Liberties Union, called it \"a hateful, xenophobic immigration proposal that would slash legal immigration to levels not seen since the racial quotas of the 1920s, eliminate legal immigration channels for African countries, and spend $25 billion for a harmful, wasteful border wall and an increase in Border Patrol and ICE agents.\"\nFollow Colvin, Miller and Fram on Twitter at https://twitter.com/colvinj , https://twitter.com/ZekeJMiller and https://twitter.com/asfram", "external_links": [], "published": "2018-01-26T07:18:00.000+02:00", "crawled": "2018-01-26T11:21:24.002+02:00", "highlightTitle": ""}