{"organizations": [], "uuid": "39def2710b536b694b8d35f59c1260825c41d640", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220305749&w=1200&r=LYNXMPEE07137", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-paris-bicycles-velib/velib-bike-sharing-scheme-hits-road-bump-in-french-capital-idUSKBN1EX1RM", "country": "US", "domain_rank": 408, "title": "Velib bike-sharing scheme hits road bump in French capital", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:18:00.000+02:00", "replies_count": 0, "uuid": "39def2710b536b694b8d35f59c1260825c41d640"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-paris-bicycles-velib/velib-bike-sharing-scheme-hits-road-bump-in-french-capital-idUSKBN1EX1RM", "ord_in_thread": 0, "title": "Velib bike-sharing scheme hits road bump in French capital", "locations": [], "entities": {"persons": [{"name": "selle", "sentiment": "none"}, {"name": "reuters/gonzalo fuentes a smovengo", "sentiment": "none"}, {"name": "charles maguin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "jcdecaux", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - Paris’ pioneering Velib bicycle hire service, which has been copied from London to Seattle, has ground to a virtual standstill after the new concession holder failed to install revamped docking stations on schedule.\nIn May 2017, Paris awarded a new contract to the French-Spanish Smovengo consortium to operate its bike-sharing scheme from 2018 to 2032, replacing outdoor advertising group JCDecaux, which had run it since 2007.\nUnder the 700 million euro ($838 million) contract, about half of the new bikes should have become available at the start of 2018, but fewer than 100 out of a planned 1,400 stations opened on time, while the old Velib bikes have been withdrawn.\n“There are major delays to the new Velib system. Very few docking stations have been installed and hardly any bikes are available,” said Charles Maguin, head of Paris cyclist organization Paris en Selle.\nNew Velib' Metropole self-service public bikes by the Smovengo are seen at a distribution point in Paris, France January 8, 2018. REUTERS/Gonzalo Fuentes A Smovengo spokeswoman said that of the roughly 100 newly-installed stations about 60 were operational and that the group aimed to get all 1,400 stations and more than 20,000 bicycles operational by the end of March.\nThe consortium - which includes bike share operator Smoove, car park operator Indigo, mobility group Mobivia and Spanish transport group Moventia - said in a statement that legal action by JCDecaux and technical problems with electricity supply to the new stations were part of the reason for the delays.\nSlideshow (2 Images) With fewer Velibs available, many Parisians have returned to using public transport or cars, or one of three new Asian-owned dockless bike-sharing schemes which have mushroomed during the switch between the old and new Velib.\nGobee.bike, oBike and Ofo’s brightly colored free-floating Asian bikes - which have no docking stations and can be parked anywhere - have already become a fixture in Paris, although with just a few thousand bikes on the road, they cannot make up for the missing Velibs.\nParis city hall is offering Velib subscribers three hours for free on Velib’s new electric bikes and a 50 percent discount on new subscriptions from January to March to compensate for the inconvenience.\nReporting by Geert De Clercq; editing by Richard Lough and Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T00:18:00.000+02:00", "crawled": "2018-01-09T17:11:29.002+02:00", "highlightTitle": ""}