{"organizations": [], "uuid": "f95308fcabb35bb4e1ab946cb2f0fd6901bd639a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-europe-migrants-macron/ahead-of-uk-summit-macron-visits-migrants-in-port-of-calais-idUSKBN1F5195", "country": "US", "domain_rank": 408, "title": "Ahead of UK summit, Macron visits migrants in port of Calais", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:33:00.000+02:00", "replies_count": 0, "uuid": "f95308fcabb35bb4e1ab946cb2f0fd6901bd639a"}, "author": "", "url": "https://www.reuters.com/article/us-europe-migrants-macron/ahead-of-uk-summit-macron-visits-migrants-in-port-of-calais-idUSKBN1F5195", "ord_in_thread": 0, "title": "Ahead of UK summit, Macron visits migrants in port of Calais", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "gerard collomb", "sentiment": "none"}], "locations": [{"name": "calais", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "hauts-de-france", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "calais marine pennetier", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:35 AM / Updated 6 minutes ago Ahead of UK summit, Macron visits migrants in port of Calais Marine Pennetier 4 Min Read \nCALAIS, France (Reuters) - French President Emmanuel Macron visited a migrant reception center and quizzed refugees in Calais on Tuesday, taking stock of the pressure on the Channel port ahead of a summit with British Prime Minister Theresa May this week. \nCalais and the surrounding Hauts-de-France region are among the poorest areas of France, with unemployment above the national average and public resources strained by an influx of migrants from Africa and the Middle East. \nWhile the previous government bulldozed a vast tented camp, dubbed the “jungle” and once home to around 8,000 people on the outskirts of the town, in late 2016, several hundred asylum seekers, refugees and economic migrants remain in Calais and others continue to come, usually seeking to make it to Britain. \nInterior minister Gerard Collomb, joining Macron for the visit, told locals the town would “bounce back” and not be known “just for the issue of migrants and migration”. He promised more investment in reception centers and asylum processing, and emphasized numbers were being brought down. \n“There were once seven or eight thousand migrants in Calais, but now we’re talking about four hundred,” he said. “We need to have a balanced policy that combines reception and inspection.” \nMacron will meet Britain’s May in England on Thursday to discuss Brexit, migration and the Le Touquet accord, a 2003 treaty that effectively allows Britain to establish its border in France, and France to run its border checks in Britain. \nFrench officials believe the accord favors Britain and has contributed to the gathering of migrants to Calais, the closest point to the UK’s shores. From Calais, many try to jump on trucks and trains going under the Channel into Britain, just 30 km (20 miles) away. BORDER TALKS \nAt the meeting with May, Macron is expected to push for a new “additional protocol” to supplement the Le Touquet treaty that would involve Britain paying more to France for border security and accepting more asylum seekers. \nBritain says it already provides extra security to France. Pro-Brexit lawmakers from Britain’s governing Conservative Party have dismissed suggestions London should pay more as “absurd”. \nIf agreement cannot be reached, both Britain and France have the right to back out of the treaty, which would mean reverting to hard national borders. Such a move would reinforce the complete separation of Britain from Europe once the exit from the European Union comes into force in March 2019. \nMacron’s government is drafting legislation to tighten immigration rules, in part a response to soaring asylum requests. Last year there were more than 100,000 applications, a record high. \nWhile the president has been criticized for taking a tough line on migration, he sent a conciliatory message on Tuesday. Meeting migrants from Sudan who had reached France via Italy and Libya, he acknowledged the difficulty of their plight. \n“We have a responsibility to protect those who are in danger,” he was quoted as saying by BFMTV. “(But) we can’t welcome millions of people who live in peace in their countries.” Reporting by Marine Pennetier in Calais; additional reporting by Matthias Blamont in Paris; Writing by Luke Baker; Editing by Richard Lough and Richard Balmforth", "external_links": [], "published": "2018-01-16T13:33:00.000+02:00", "crawled": "2018-01-16T13:49:20.007+02:00", "highlightTitle": ""}