{"organizations": [], "uuid": "d73d4af77e1d9edf90aa667bce90a60f3d74f5c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-on-safe-haven-buying-after-u-s-govt-shutdown-idUSL4N1PH05S", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold up on safe haven buying after U.S. govt shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T03:02:00.000+02:00", "replies_count": 0, "uuid": "d73d4af77e1d9edf90aa667bce90a60f3d74f5c4"}, "author": "", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-on-safe-haven-buying-after-u-s-govt-shutdown-idUSL4N1PH05S", "ord_in_thread": 0, "title": "PRECIOUS-Gold up on safe haven buying after U.S. govt shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "john cornyn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 22 (Reuters) - Gold prices edged up on Monday amid a softer dollar as investors sought safe haven assets after the U.S. government shutdown due to a funding impasse. FUNDAMENTALS * Spot gold rose 0.2 percent to $1,334.10 an ounce by 0046 GMT. * Spot gold fell 0.5 percent last week, its first weekly decline in six weeks. * U.S. gold futures were up 0.1 percent at $1,333.80. * The dollar index , which measures the greenback against a basket of currencies fell 0.1 percent to 90.489. * Funding for federal agencies ran out at midnight on Friday, and was not renewed amid a dispute between U.S. President Donald Trump and Democrats over immigration. * Republican and Democratic leaders of the U.S. Senate held talks on Sunday seeking to break an impasse that has kept the U.S. government shut down for two days, but it was unclear if a deal could be struck to reopen federal agencies by the start of the work week. * Republican Senator John Cornyn predicted on Sunday that the U.S. government would remain shut on Monday, as lawmakers meet to negotiate an end to the impasse, Fox News Channel reported. * Flows of palladium out of UK stocks to Hong Kong are picking up as demand from Asian industry grows, pointing to a tightening market that could keep record-high prices on the boil. * Holdings of SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, rose 0.70 percent to 846.67 tonnes on Friday from Thursday. * Hedge funds and money managers raised their net long position in COMEX gold contracts in the week to Jan. 16, U.S. Commodity Futures Trading Commission (CFTC) data showed on Friday. * Gold imports to Turkey hit a record 370 tonnes in 2017, more than trebling from 106.1 tonnes, data from Borsa Istanbul showed. * Gold demand in China firmed last week as retailers stocked up ahead of the Chinese New Year while price discounts widened in India, partly on expectations of a reduction in import duty in next month's budget. * Leading Russian gold producer Polyus said on Friday it would issue $250 million worth of bonds, with the proceeds of the sale mainly going towards refinancing its debt. * South Africa's National Union of Mineworkers (NUM) said on Friday that its branch chairman at Eastern Platinum Mine, a unit of Lonmin , , was killed by unknown assailants. DATA AHEAD (IN GMT) 1330 U.S. National activity index Dec (Reporting by Nallur Sethuraman in Bengaluru; editing by Richard Pullin)\n ", "external_links": [], "published": "2018-01-22T03:02:00.000+02:00", "crawled": "2018-01-22T04:01:39.026+02:00", "highlightTitle": ""}