{"organizations": [], "uuid": "d625006912fec1565270701fcf0698b7a6f12428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-richard-kennedy-named-skanska-usa-president-and-ceo.html", "country": "US", "domain_rank": 767, "title": "Richard Kennedy named Skanska USA President and CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:21:00.000+02:00", "replies_count": 0, "uuid": "d625006912fec1565270701fcf0698b7a6f12428"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-richard-kennedy-named-skanska-usa-president-and-ceo.html", "ord_in_thread": 0, "title": "Richard Kennedy named Skanska USA President and CEO", "locations": [], "entities": {"persons": [{"name": "richard kennedy", "sentiment": "negative"}, {"name": "paul hewins", "sentiment": "none"}, {"name": "anders danielsson", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "skanska usa", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "skanska ab", "sentiment": "negative"}, {"name": "skanska usa", "sentiment": "negative"}, {"name": "skanska", "sentiment": "none"}, {"name": "group leadership team", "sentiment": "none"}, {"name": "skanska usa building", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Skanska AB (NASDAQ:SKA B) named Richard Kennedy an Executive Vice President of Skanska AB and President and Chief Executive Officer of Skanska USA, overseeing the company's construction operations in the United States, the US corporate staff functions and Skanska's infrastructure development operations. Kennedy will be a member of Skanska AB's six-member Group Leadership Team (GLT). He succeeds Anders Danielsson, who recently assumed the role of Skanska AB President and CEO.\nConcurrently, Paul Hewins moves into the role of President and Chief Executive Officer for the Skanska USA Building unit, succeeding Kennedy.\nKennedy has been with Skanska for 14 years. In his most recent role as business unit president, he oversaw a tremendously stable building construction operation, delivering consistently profitable projects for Skanska while supporting the goals of its customers to ensure repeat and new business. First joining the company as a general counsel, Kennedy then served as Chief Operating Officer of New York and New Jersey building operations beginning in 2009 before ascending to oversee all US building construction operations in 2016.\n\"Richard's career is marked by a sensible approach to risk that delivers great results for shareholders and project stakeholders,\" said Skanska AB President and Chief Executive Officer Anders Danielsson. \"He has been a leader in finding ways for Skanska's various units in the United States to collaborate on complex projects and deliver consistent profitability. Richard has also been a strong voice in support of key drivers for our business such as safety and diversity.\"\nKennedy added: \"I am proud and humbled to take this new post, leading one of the most respected and recognizable names in our industry. Skanska's success is built on our amazingly talented people who unlock new possibilities for their customers and communities. It is a great honor to lead them.\"\nStepping into Kennedy's prior role, Hewins will be responsible for all building operations across the US, reporting to Kennedy. A 32-year industry veteran, 19 of those with Skanska, Hewins has consistently demonstrated exceptional operations and financial acumen while serving as a role model for Skanska's values-based culture. Prior to his most recent role of Chief Operating Officer overseeing building operations in New York, New Jersey, Tennessee and Ohio, he held the same role for other Skanska regions including New England and Pennsylvania.\nKennedy will be based in New York and Hewins will be based in Boston.\nThis and previous releases can also be found at www.usa.skanska.com\nSkanska USA is one of the largest, most financially sound construction and development companies in the U.S., serving a broad range of clients including those in transportation, power, industrial, water/wastewater, healthcare, education, sports, data centers, government, aviation and commercial. Headquartered in New York with offices in 31 metro areas, we have more than 10,000 employees committed to being leaders in safety, project execution, sustainability, ethics and people development. In 2016, our work in building construction, civil and power/industrial construction, commercial development and infrastructure development (public-private partnerships) generated $6.8 billion in revenue. Global revenue of parent company Skanska AB, headquartered in Stockholm and listed on the Stockholm Stock Exchange, totaled $17.7 billion in 2016. Skanska shares are publicly traded in the U.S. on the OTC market under the symbol SKBSY through a Level I American Depository Receipt program.\nView original content with multimedia: http://www.prnewswire.com/news-releases/richard-kennedy-named-skanska-usa-president-and-ceo-300583741.html\nSOURCE Skanska USA", "external_links": ["http://www.usa.skanska.com/", "http://www.prnewswire.com/news-releases/richard-kennedy-named-skanska-usa-president-and-ceo-300583741.html"], "published": "2018-01-17T10:21:00.000+02:00", "crawled": "2018-01-17T11:34:42.040+02:00", "highlightTitle": ""}