{"organizations": [], "uuid": "2487f5fdf81681ad71f4f6e47097842b94a14073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226528784&w=1200&r=LYNXMPEE0T0E0", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-economy-pmi/chinas-factory-growth-seen-fading-slightly-in-january-idUSKBN1FJ0VS", "country": "US", "domain_rank": 408, "title": "China's factory growth seen fading slightly in January", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:59:00.000+02:00", "replies_count": 0, "uuid": "2487f5fdf81681ad71f4f6e47097842b94a14073"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-economy-pmi/chinas-factory-growth-seen-fading-slightly-in-january-idUSKBN1FJ0VS", "ord_in_thread": 0, "title": "China's factory growth seen fading slightly in January", "locations": [], "entities": {"persons": [{"name": "yang zhao", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "januar", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s manufacturing sector likely expanded at a slightly slower pace in January as the government’s punishing war on air pollution and a cooling property market dampened activity, a Reuters poll showed.\nBut the pace of expansion is expected to remain relatively healthy, reinforcing analysts’ views that the world’s second-largest economy will see only a modest slowdown in growth this year after a forecast-beating 2017.\nThe official manufacturing Purchasing Managers’ Index (PMI) on Wednesday is expected to dip marginally to 51.5 for January from 51.6 in December, according to a median forecast of 42 economists polled by Reuters.\nThat would mark the 19th straight month of expansion for China’s manufacturers, who are posting their strongest profits in six years thanks to a prolonged building boom and resurgent export demand. The 50-mark divides expansion from contraction on a monthly basis.\n“We still think the overall economy is slowing, with growth in exports, retail sales and real estate investment all showing signs of fatigue,” said Yang Zhao, chief China economist at Nomura.\nChina is also expected to continue a wide-ranging crackdown this year on riskier types of financing and debt. The campaign is slowly pushing up companies’ borrowing costs and making it harder and more expensive for weaker firms to raise funds.\nThe vice central bank governor said this week the country may step up regulatory efforts by including shadow banking, property financing and internet financing in its macro-prudential assessment (MPA), which is used to help gauge the health of the country’s banks.\nA slowdown has already started to take hold in the manufacturing sector in the last few months.\nPollution restrictions have forced some “smokestack” industries to reduce output over the winter, while China’s export and import growth slowed in December after surging in the previous month.\nEconomists polled by Reuters expected China’s economic growth will moderate to around 6.5 percent this year from 6.9 percent in 2017.\n“In the short term, we think the slowdown (in industrial activity) is still quite moderate, as what we have seen with rather gradual softening in real estate,” Zhao said.\nEconomists expect a private survey on China’s factory activity on Thursday will show a similar trend as the official reading, with activity in January expanding at slightly slower but still solid pace.\nThey predict the private Caixin/Markit Manufacturing Purchasing Managers’ index (PMI) will be 51.3 in January versus 51.5 the previous month.\nThe private survey tends to focus on small and mid-sized firms, which have not benefited as much from a year-long, state-led construction boom as large, government-owned industrial heavyweights.\nThe official PMI survey will be published on Jan. 31, along with a similar official survey covering the services sector.\nThe private Caixin PMI will be published on Feb. 1, with the Caixin services PMI to be released on Feb. 5.\nReporting by Yawen Chen and Ryan Woo; Polling by Shaloo Shrivastava; Editing by Kim Coghill\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T15:59:00.000+02:00", "crawled": "2018-01-30T16:36:18.003+02:00", "highlightTitle": ""}