{"organizations": [], "uuid": "4b1a57a84e77c495a3efd29e864bad9fe38b0c34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221912499&w=1200&r=LYNXMPEE0D0DX", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-skat-tech/ice-master-aims-to-aid-scorching-times-in-gangneung-idUSKBN1F30LX", "country": "US", "domain_rank": 408, "title": "'Ice master' aims to aid scorching times in Gangneung", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T15:35:00.000+02:00", "replies_count": 0, "uuid": "4b1a57a84e77c495a3efd29e864bad9fe38b0c34"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-skat-tech/ice-master-aims-to-aid-scorching-times-in-gangneung-idUSKBN1F30LX", "ord_in_thread": 0, "title": "'Ice master' aims to aid scorching times in Gangneung", "locations": [], "entities": {"persons": [{"name": "simon jennings", "sentiment": "none"}, {"name": "mark messer", "sentiment": "none"}, {"name": "messer", "sentiment": "none"}], "locations": [{"name": "gangneu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "gangneung oval", "sentiment": "none"}, {"name": "gangneung", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 1:39 PM / Updated 8 hours ago 'Ice master' aims to aid scorching times in Gangneung Simon Jennings 4 Min Read \n(Reuters) - Conventional wisdom says the Gangneung Oval’s lack of elevation will make it impossible for any speed skaters to break a world record at the Winter Olympics, but Canadian Mark Messer is hoping to turn that perception on its head. \nSpeed skaters move so fast over the ice - hitting speeds above 55 kph - that elevation plays a pivotal role in whether a world record can be set, since skaters at lower altitudes have to battle more wind resistance. \nAll the sport’s current world records were set at high altitude ovals in Salt Lake City and Canada’s Calgary, while the Olympic venue in Gangneung sits just above sea level. \nMesser, known as an ‘Ice Master’, has made the ice at four previous Olympics and said records might fall in South Korea. \n“Most people say it’s impossible because it’s basically five kilometers from the ocean and it’s also three meters above sea level, so traditionally it would not be the conditions to do it,” he told Reuters from the Calgary Oval. \n“(But) I think with people peaking, because everybody trains for four years to come to that one race, if we can make the ice as good as possible there’s an opportunity for some records to be broken.” \nMesser made the ice for the Olympic venue at Gangneung at a test event in February at which the skaters hit speeds that were unexpected at sea level. \n“One of the world records we missed by less than half a second,” he added. “Some of the other world records we were very, very close to.” FORMULA FOR SUCCESS \nIce makers use reverse osmosis equipment to produce vast quantities of purified water which is blended with natural water to make ice that will not crack. \n“We seem to have a good formula for what we want (in Gangneung),” Messer said. “We used a blend of purified water with a little bit of just natural, domestic water.” \nBart Schouten, a coach with Canada’s Olympic speed skating team, has little doubt about the 57-year-old’s ability to make record-breaking ice. \n“I think he’s one of the top three (ice makers in the world),” Schouten said. \n”There’s a lot of technology that goes into it, but there’s also a lot of ‘fingerspitzengefuehl’ as they say in Germany -- a lot of feel that goes into it. I think Mark has a really good feel. \n”I don’t think we saw the same fast ice in Sochi the year before the (last) Olympics. At the World Single Distance Championships in Korea, the ice was faster than everybody expected it to be at sea level. \n“That’s why there’s more speculation now about world records in Korea than there was in Sochi.” \nMesser said when he first started making ice in Calgary more than three decades ago it would have been impossible for skaters to reach the speeds they might in Gangneung next month. \n“We didn’t have enough refrigeration capacity,” he said. \n”The biggest technological things that have happened since is the way you can control the ice to get more precise temperature control. \n“There’s more efficient equipment out there now.” \nHe is, however, worried that he has not had enough time to learn the characteristics of the venue, since only one test event has been held in Gangneung. \n”I kind of came into the mix a little bit too late for what I would have liked,“ he said. ”I wish that we had more opportunities to try some things. \n”Usually it takes a few years to learn the best conditions for a different building, because every building changes. \n“It would have been nice to have had another chance, but we will take the knowledge we have and apply it in the Games.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-14T15:35:00.000+02:00", "crawled": "2018-01-14T16:42:40.005+02:00", "highlightTitle": ""}