{"organizations": [], "uuid": "f5396c51b772e1a6b9d1419b2992a5cb67385fb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-o2micro-reports-fourth-quarter-and-yearly-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "O2Micro Reports Fourth Quarter and Yearly 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "f5396c51b772e1a6b9d1419b2992a5cb67385fb6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-o2micro-reports-fourth-quarter-and-yearly-2017-financial-results.html", "ord_in_thread": 0, "title": "O2Micro Reports Fourth Quarter and Yearly 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GEORGE TOWN, Grand Cayman, Jan. 31, 2018 (GLOBE NEWSWIRE) --\nOperational and Strategic Highlights:\nQ4 2017 results were within the range of guidance provided in November 2017.\nFiscal 2017 revenue increased 6.4% over fiscal 2016.\nGAAP net loss per ADS in the fourth quarter of 2017 was 7 cents, with non-GAAP net loss of 6 cents per ADS.\nDue to market seasonality, revenue in Q1 2018 is expected to range between -2% and -8% compared to Q4 2017.\nWe remain optimistic about our growth drivers including backlighting, battery management and power products.\nO2Micro ® International Limited (NASDAQ:OIIM), a global leader in the design, development and marketing of high-performance integrated circuits and solutions, reported its financial results today for the fourth quarter and year ending December 31, 2017.\nFinancial Highlights for the Fourth Quarter and Fiscal Year ending December 31, 2017:\nO2Micro International Limited (“Company”) reported yearly revenue of $60.2 million, a 6.4% increase over 2016. Fourth quarter 2017 revenue was $15.2 million which was down 2% sequentially and down 4.3% from the same quarter in the previous year. The gross margin in the fourth quarter of 2017 was 50.5%, which was up from 50.3% in the prior quarter, and down from 54.1% in the fourth quarter of 2016. The gross margin remains in our target range and varies primarily with the quarterly revenue and product mix. During the fourth quarter of 2017, the Company recorded total GAAP operating expenses of $9.4 million, compared to $9.5 million in the third quarter of 2017, and $9.0 million in the year-ago Q4 period. The GAAP operating margins for the fourth quarter of 2017, the third quarter of 2017, and fourth quarter of 2016 were (11.5%), (11.1%), and (2.4%), respectively.\nQ4 2017 GAAP net loss was $1.9 million. This compares to a GAAP net loss of $1.4 million in the third quarter of 2017 and a GAAP net income of $12,000 in Q4 2016. GAAP net loss per fully diluted ADS was $0.07 in Q4 2017. This compares to a GAAP net loss per fully diluted ADS of $0.05 in Q3 2017 and a GAAP net income per fully diluted ADS of $0.00 in Q4 2016.\nYearly GAAP net loss was $6.1 million in 2017. GAAP net loss in 2016 was $3.0 million including a $2.7 million one-time gain. GAAP net loss per fully diluted ADS was $0.24 in 2017. This compares to a GAAP net loss of per fully diluted ADS of $0.12 in 2016.\nSupplementary Data:\nThe Company ended the fourth quarter of 2017 with $46.1 million in unrestricted cash and short-term investments or $1.80 per outstanding ADS. The accounts receivable balance was $9.2 million and represented 54 days sales outstanding at the end of Q4 2017. Inventory was $9.3 million or 119 days and turned over 3 times during Q4 2017. As of December 31, 2017, the Company had $58.7 million in working capital and the book value was $76.6 million, or $2.98 per outstanding ADS. As of December 31, 2017, O2Micro International Limited had a total of 372 employees worldwide, including 228 engineers.\nManagement Commentary:\n“Our first quarter of 2018 revenue guidance reflects continuing design activities in the growth drivers of the consumer and industrial markets. We are pleased with our continued acceptance our technology including high end backlighting for the TV, power tools, household appliances, and automotive, despite the current dynamic market,” said Sterling Du, O2Micro’s Chairman and CEO. “We believe our solutions for these product segments will continue to contribute to our top-line growth in upcoming quarters and lead O2Micro back to long term profitability.”\nConference Call:\nO2Micro will hold its fourth quarter conference call today, January 31st, 2018, at 6:00AM. Pacific, 9:00AM Eastern. You may participate using the following dial-in information.\nConference ID: 3027751\nParticipants, Int'l Toll: 719-325-2370\nParticipants, US/CAN: 800-967-7134\nThe Call-in Audio Replay will be available from January 31st, 2018 12:00 Eastern Time (US & Canada) through February 7th, 2018 12:00 Eastern Time (US & Canada)\nhttps://event.mymeetingroom.com/Public/WebRegistration/Y29uZmVyZW5jZUlkPTE3MTA4OTYmdHlwZT1yZXBsYXkmbGFuZ3VhZ2U9ZW5nbGlzaA==\nA live webcast will also be available on the Company's website at http://ir.o2micro.com , and an online replay will be available on the website for one week.\nAbout O2Micro:\nFounded in April 1995, O2Micro develops and markets innovative power management components for the Computer, Consumer, Industrial, Automotive and Communications markets. Products include LED General Lighting, Backlighting, Battery Management, and Power Management. The Company maintains offices worldwide. Additional Company and product information can be found on the Company website at www.o2micro.com .\nO2Micro, the O2Micro logo, and combinations thereof are registered trademarks of O2Micro. All other trademarks or registered trademarks are the property of their respective owners.\nStatements made in this release that are not historical, including statements regarding O2Micro or its management's intentions, hopes, beliefs, expectations, representations, projections, plans or predictions of the future, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other Federal Securities Laws. Such statements involve risks, speculation and uncertainties that may cause actual results to differ materially from those set forth in these statements or from management's current views and expectations. Risks and uncertainties in this release may include, without limitation, any one or combination of the following: the effect of competitive and economic factors; real property value fluctuations and market demand; legal changes in any relevant rules and regulations pertaining to O2Micro's business; changes in technology and industry standards, and O2Micro's reaction to those factors; consumer and business buying decisions with respect to our customers' products incorporating O2Micro's products; continued competitive pressures in the marketplace; the ability of O2Micro to deliver to the marketplace, and stimulate customer demand therein, for new products and technological innovations on a timely basis; the effect that product introductions and transitions, changes in product pricing or mix, and/or increases in component costs could have on O2Micro's gross margins; the inventory risk associated with O2Micro's need to order, or commit to order, product components and product capacity in advance of forecast customer orders; the continued availability of acceptable terms of certain components and services essential to O2Micro's business which are currently obtained by the Company from sole or limited sources; the effect that O2Micro's dependency on manufacturing and logistics services provided by third parties may have on the quality, quantity, availability or cost of products manufactured or services rendered; risks associated with O2Micro's international operations; the potential impact of a finding that O2Micro has infringed on the intellectual property rights of others, or that any third party may have infringed on O2Micro's intellectual property that may negatively affect O2Micro's business; O2Micro's legal classifications with governmental and regulatory agencies; O2Micro's dependency on the performance of distributors, carriers, independent sales representatives, and other resellers of O2Micro's products; the effect that product and service quality problems could have on O2Micro's sales ability and operating profits; the ability of O2Micro to deliver its products in a timely fashion to its customers, and the possible negative ramifications if such is not possible; the continued service and availability of key executives and employees; war, terrorism, public health issues, natural disasters, and other circumstances that could disrupt supply, delivery, or demand of products; and unfavorable results of other legal proceedings. Actual results may differ materially due to numerous risk factors. Such risk factors are more fully enumerated in O2Micro's 20-F Annual Filings, Annual Report(s), 6-K's, the Form F-1 filed in connection with the Company's initial public offering in August 2000, information posted on our website at www.o2micro.com , and other documents filed with the SEC, NASDAQ or any other public agency from time to time. The statements herein are based on dated information on the dates mentioned herein, which is subject to change. O2Micro assumes no obligation to update or revise the information provided on today, or any other forward-looking information, whether as a result of new information, future events or any other information that may arise. This information only speaks to the respective dates mentioned in said information.\nO 2 MICRO INTERNATIONAL LIMITED AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (In Thousand U.S. Dollars, Except Per Share Amounts) Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 (Unaudited) (Unaudited) (audited) NET SALES $ 15,217 $ 15,909 $ 60,205 $ 56,561 COST OF SALES 7,525 7,302 29,426 27,317 GROSS PROFIT 7,692 8,607 30,779 29,244 OPERATING EXPENSES Research and development (1) 4,774 4,118 17,989 15,645 Selling, general and administrative (1) 4,673 4,866 19,047 19,481 Litigation income - - (19 ) (23 ) Total Operating Expenses 9,447 8,984 37,017 35,103 LOSS FROM OPERATIONS (1,755 ) (377 ) (6,238 ) (5,859 ) NON-OPERATING INCOME Interest income 87 77 344 301 Foreign exchange (loss) gain – net (84 ) 367 53 63 Gain on sale of real estate - - - 1,725 Gain on sale of long-term investments - - 20 948 Other – net 202 283 686 894 Total Non-operating Income 205 727 1,103 3,931 INCOME (LOSS) BEFORE INCOME TAX (1,550 ) 350 (5,135 ) (1,928 ) INCOME TAX EXPENSE 329 338 1,010 1,058 NET INCOME (LOSS) (1,879 ) 12 (6,145 ) (2,986 ) OTHER COMPREHENSIVE INCOME Foreign currency translation adjustments 319 (905 ) 984 (397 ) Unrealized (loss) gain on available-for-sale securities - - (1 ) 1 Unrealized pension loss (63 ) (14 ) (61 ) (13 ) Total Other Comprehensive Income (Loss) 256 (919 ) 922 (409 ) COMPREHENSIVE LOSS $ (1,623 ) $ (907 ) $ (5,223 ) $ (3,395 ) EARNINGS (LOSS) PER ADS Basic $ (0.07 ) $ - $ (0.24 ) $ (0.12 ) Diluted $ (0.07 ) $ - $ (0.24 ) $ (0.12 ) ADS UNITS USED IN EARNINGS (LOSS) PER ADS CALCULATION: Basic (in thousands) 25,696 25,592 25,780 25,643 Diluted (in thousands) 25,696 26,050 25,780 25,643 (1) INCLUDES STOCK-BASED COMPENSATION CHARGE AS FOLLOWS: Research and development $ 53 $ 52 $ 221 $ 231 Selling, general and administrative $ 335 $ 320 $ 1,368 $ 1,375\nO 2 MICRO INTERNATIONAL LIMITED AND SUBSIDIARIES CONSOLIDATED BALANCE SHEETS (In Thousand U.S. Dollars, Except Share Amounts) December 31, December 31, 2017 2016 ASSETS (Unaudited) (Audited) CURRENT ASSETS Cash and cash equivalents $ 28,520 $ 31,332 Restricted cash 35 32 Short-term investments 17,601 21,532 Accounts receivable – net 9,184 7,205 Inventories 9,330 9,275 Prepaid expenses and other current assets 1,245 1,106 Total Current Assets 65,915 70,482 LONG-TERM INVESTMENTS 3,112 4,253 PROPERTY AND EQUIPMENT – NET 13,755 13,736 OTHER ASSETS 2,300 2,218 TOTAL ASSETS $ 85,082 $ 90,689 LIABILITIES AND SHAREHOLDERS’ EQUITY CURRENT LIABILITIES Notes and accounts payable $ 2,460 $ 4,329 Income tax payable 341 180 Accrued expenses and other current liabilities 4,379 4,102 Total Current Liabilities 7,180 8,611 OTHER LONG-TERM LIABILITIES Accrued pension liabilities 355 281 Deferred income tax liabilities 906 930 Other liabilities 86 83 Total Other Long-Term Liabilities 1,347 1,294 Total Liabilities 8,527 9,905 COMMITMENTS AND CONTINGENCIES SHAREHOLDERS’ EQUITY Preference shares at $0.00002 par value per share Authorized – 250,000,000 shares - - Ordinary shares at $0.00002 par value per share Authorized – 4,750,000,000 shares Issued – 1,669,036,600 shares as of December 31, 2017 and 2016, respectively\nOutstanding –1,284,146,100 and 1,279,124,900 shares as of December 31, 2017 and 2016, respectively 33 33 Additional paid-in capital 142,946 142,738 Accumulated deficits (47,517 ) (41,372 ) Accumulated other comprehensive income 5,337 4,415 Treasury stock – 384,890,500 and 389,911,700 shares as of December 31, 2017 and 2016, respectively (24,244 ) (25,030 ) Total Shareholders’ Equity 76,555 80,784 TOTAL LIABILITIES AND SHAREHOLDERS’ EQUITY $ 85,082 $ 90,689\nContact Information: Investor Relations, O2Micro Phone: 408.987.5920, x8888 Email: ir@o2micro.com\nSource:O2Micro, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4e2aba9d-40ce-41cf-acd6-fd6c2e7f3630", "https://www.globenewswire.com/Tracker?data=kmYcmZtPZdzU0IGLhwS56o5T730-BnugvRzREuW1fRDwWPr5SMWHqVbg9Z96yGfvlFnu5VSOe1Dh_aJJ6yVDONW-SM_LiZA2IBNaee3MWpu-F2RBXBj9uXnunrS23P0R0jnJqYmZZjhBY4Mejp56QYxE0__G3xbovCDXNUBgPBv85ojrIH_P_8twfV6ce1sx1fl-XLUif0PY18JXrypiT6GVhuzIz8SBgL-gvAmPJSwIM4UOfTlGGufQwiugIubJuuKkZIN4_qcFW4gjrxDMb_763X7jffcGRAwldzdUF1LbBZizWnSRtp7iB7zkewWiTpnP929EHGIj1X6OvCG2WW0rgMP2tYebtk4M45uwzU0=", "https://event.mymeetingroom.com/Public/WebRegistration/Y29uZmVyZW5jZUlkPTE3MTA4OTYmdHlwZT1yZXBsYXkmbGFuZ3VhZ2U9ZW5nbGlzaA==", "https://www.globenewswire.com/Tracker?data=RtYABW_IsO8-yo0dq8AVgYTfR5En649XCUfy-1QBQLfrzEz-1ly5tUtFWVup6nB1RHkbVODR4fJb-C8SBWlSuw8mOJqxw5yJUGTYX4ewO4E=", "https://www.globenewswire.com/Tracker?data=HmfkIq326ccllcadjfkziM9acbQS8YbwTU247hry3gJ9HPPjQnv64hjPLwPrIu7Q6vI_i6EWMWJgiRXhpde6ew=="], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T18:58:55.031+02:00", "highlightTitle": ""}