{"organizations": [], "uuid": "c5255e494bd3c5bf51140bdeb2f85cd085701c2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220945532&w=1200&r=LYNXMPEE091JC", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-argentina-politics-reforms/argentina-details-measures-to-slash-government-red-tape-idUSKBN1EZ2UZ", "country": "US", "domain_rank": 408, "title": "Argentina details measures to slash government red tape", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-11T06:05:00.000+02:00", "replies_count": 0, "uuid": "c5255e494bd3c5bf51140bdeb2f85cd085701c2e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-argentina-politics-reforms/argentina-details-measures-to-slash-government-red-tape-idUSKBN1EZ2UZ", "ord_in_thread": 0, "title": "Argentina details measures to slash government red tape", "locations": [], "entities": {"persons": [{"name": "buenos aires", "sentiment": "negative"}, {"name": "francisco cabrera", "sentiment": "none"}, {"name": "cabrera", "sentiment": "none"}, {"name": "mauricio macri", "sentiment": "none"}, {"name": "macri", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUENOS AIRES (Reuters) - Argentina’s government announced a series of measures on Wednesday to reduce bureaucratic tasks that business-friendly President Mauricio Macri thinks are holding back much-needed investment.\nThe government will publish 170 changes in Thursday’s official gazette that eliminate old regulations that reduce the state’s efficiency and harm the country’s competitiveness, Production Minister Francisco Cabrera said in a news conference.\n“The goal is to get rid of or simplify norms that for whatever reason are outdated and pose obstacles,” Cabrera said.\nThe move is the latest in a string of measures Macri has taken to consolidate his reform agenda following his “Let’s Change” coalition’s sweep of midterm legislative elections last October. Late last year, congress approved tax and pension reforms designed to boost investment and cut the deficit.\nBut a long-promised wave of foreign investment has been slow to arrive since Macri took office in December 2015 following more than a decade of populist rule, as companies note that labor and logistics costs remain high. Macri is aiming to pass labor and capital markets reforms next month.\nThe measures, to be published Thursday, include the elimination of a national business registry dating back to 1972, which had required all companies to undergo an eight-month process to be listed. They will also enable the South American country’s social security administration to invest retirement savings using new instruments, like trusts.\nThe resolution will also allow companies to automatically obtain licenses to import some 314 items which currently need government approval, Cabrera said. Those will include industrial inputs like rolled steel, semi-fabricated aluminum and cotton yarn used in the automotive, home electronics and agricultural machinery manufacturing industries, among others.\nMacri had faced complaints from importers with goods stuck in the country’s Byzantine customs system.\n“It is a great regulation-busting decree that will clearly lower companies’ production costs,” said economist Roberto Cachanosky.\nReporting by Eliana Raszewski; Writing by Luc Cohen; Editing by Lisa Shumaker\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T06:05:00.000+02:00", "crawled": "2018-01-11T00:19:02.002+02:00", "highlightTitle": ""}