{"organizations": [], "uuid": "3989d28f8cce0479e0ce68eb68b91aa3d5375ce4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 45, "shares": 45, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/02/104507581-20170602-0594-2387.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/cramer-remix-apples-stock-wont-slow-down-in-2018.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Apple's stock won't slow down in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T01:59:00.000+02:00", "replies_count": 0, "uuid": "3989d28f8cce0479e0ce68eb68b91aa3d5375ce4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/cramer-remix-apples-stock-wont-slow-down-in-2018.html", "ord_in_thread": 0, "title": "Cramer Remix: Apple's stock won't slow down in 2018", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One controversial stock was at the top of Jim Cramer's mind as the CNBC host looked back on its annual gains on the first official trading day of 2018: Apple .\n\"Apple's about as hard to own right now as it's been at any point in the last couple of years,\" the \" Mad Money \" host acknowledged. \"From all the negative comments of late, you'd think that Apple's stock must have lost people fortunes, but it actually finished last year up 46.1 percent.\"\nBut Cramer said that the weakness, caused in part by bearish chartists predicting a correction and in part by the smartphone maker's \"battery gate\" debacle, shouldn't continue this year.\n\"I bet the company's service revenue continues to grow — Apple still, after two years, isn't getting enough credit for that one,\" Cramer said. \"While the stock may not be ready for a shortfall, we haven't heard enough negative things from worthwhile sources to make me want to give up on this one. No way.\"\nBetter yet, Apple's $269 billion cash hoard overseas could still be put to work as the new tax law implements bigger incentives for corporations to repatriate their cash, Cramer added.\n\"I'm sticking to my guns: you own Apple, you don't trade it,\" the \"Mad Money\" host concluded.\n2017 and the Trump effect Carlos Barria | Reuters President Donald Trump delivers a speech on tax reform legislation at the White House in Washington, U.S., December 13, 2017. As the first trading day of 2018 wrapped up on a rosy note for the averages , Cramer noticed a hint of discord in the market layout.\n\"I swear people are bored with what's going on with stocks,\" Cramer said. \"Either they don't want to say anything good about the market because of politics, as the president has done a very good job of linking himself with the performance of the averages, or they're just prone to sleep.\"\nWhatever the reason, the 54 percent of U.S. citizens who do own stocks should be entering the year on a high note , Cramer said.\nWith the S&P 500 having gained nearly 20 percent overall for 2017, investors have likely benefited from the monster rallies that rocketed nearly every sector higher, he said.\n\"That's what progress is all about. Is it related to President Trump's policies? Look, love him or hate him, the answer is yes,\" Cramer said. \"The president has created a pro-growth environment and along with a new tax code that will take money from the government ... and give it to the corporations.\"\nOff the charts: S&P and Dow in 2018 Don Emmert | AFP | Getty Images Revelers takes part in New Year's Eve celebrations in Times Square on December 31, 2017 in New York. In light of the new year, Cramer wanted to zoom in on two of the market's top benchmarks to see how they'll fare in 2018: the S&P 500 and the Dow Jones industrial average .\nSo the \"Mad Money\" host recruited technician Bob Lang, the founder of ExplosiveOptions.net and one of the three minds behind TheStreet.com's Trifecta Stocks newsletter, to get an analytical take on the averages' action .\nCramer and Lang began with the weekly chart of the S&P. For the first time ever, the index did not have a single losing month in all of 2017, perhaps even more impressive than its nearly 20 percent annual gain.\n\"With so much momentum coming into this year, Lang thinks it would be a big mistake to get too bearish on this one,\" Cramer said.\nA positive outlook for oil? Brittany Sowacke | Bloomberg | Getty Images Oil workers in the Permian Basin outside Midland, Texas With oil prices fresh off their strongest start to a calendar year since 2014, Cramer wanted to help investors pinpoint some of the energy sector's most lucrative areas.\n\"How do you play this fantastic run in oil, with the price of crude flying through $60 a barrel thanks to OPEC production cuts and increased demand from an accelerating global economy?\" he said.\nThere was a time investors could pick almost any oil play and profit. But amid a glut of natural gas , Cramer said oil and gas companies with natural gas exposure become riskier investments.\nPure natural gas picks with holdings in the Pennsylvanian Marcellus shale or the Ohioan Utica shale like EQT or Chesapeake Energy , respectively, are even riskier, Cramer said.\nBut some stocks in the energy space outshine the rest. Here are Cramer's top picks .\nWhere auto retail stocks stand After a wild 2017 for the stocks of CarMax and AutoNation , Cramer wanted to revisit the automotive retail space for potential investing ideas.\nThe group's biggest hurdle in 2017 was the \"peak auto\" thesis, which suggested that there was an oversupply of cars on the market and that demand (and, subsequently, prices) would inevitably fall.\nAs a result, both CarMax and AutoNation's stocks declined. CarMax even sustained its weakness through the summer's hurricanes, which destroyed hundreds of thousands of cars and gave the car sales business a boost.\n\"Where do we come down on these two used car giants? For starters, CarMax and AutoNation both look darned cheap, the kind of cheap that's hard to find in this market,\" Cramer said. \"If you're looking for a value play, you have my blessing to pick up some CarMax right here, right now, which is the more consistent of the two, and it's pulled back nicely.\"\nLightning Round: Hold off on HAIN In Cramer's lightning round , he rattled off his take on some callers' favorite stocks:\nHain Celestial : \"It had some financial irregularities. They are now behind. The problem is a lot of people feel it's a takeover [target], and I don't think that Irwin Simon, who runs it, feels that way. So I would say, you know what? There are better fish to fry right now, but it's not as bad as when it had those financial problems.\"\nCarnival Corp. : \"The answer is buy, buy, buy! I'll tell you, they delivered an amazing quarter and didn't get enough credit.\"\nDisclosure: Cramer's charitable trust owns shares of Apple.\n ", "external_links": [], "published": "2018-01-03T01:59:00.000+02:00", "crawled": "2018-01-03T02:17:09.011+02:00", "highlightTitle": ""}