{"organizations": [], "uuid": "4550c049812ca897345fbee97e60221901b33964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 142, "shares": 142, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF128_FIVEG0_SOC_20180128232629.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/u-s-memo-urges-big-push-on-5g-wireless-technology-1517200319", "country": "US", "domain_rank": 387, "title": "U.S. Memo Urges Big Push on 5G Wireless Technology - WSJ", "performance_score": 1, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T06:31:00.000+02:00", "replies_count": 0, "uuid": "4550c049812ca897345fbee97e60221901b33964"}, "author": "John D. McKinnon", "url": "https://www.wsj.com/articles/u-s-memo-urges-big-push-on-5g-wireless-technology-1517200319", "ord_in_thread": 0, "title": "U.S. Memo Urges Big Push on 5G Wireless Technology - WSJ", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "wsj washington", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "national security council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "119 COMMENTS WASHINGTON—Some White House officials view next-generation 5G wireless service as a “key area of competition,” and they say that the threat from China, in particular, justifies a “moonshot” government effort like the construction of the interstate highway system, an internal memo shows.\nThe memo—produced by officials at the National Security Council—urges the Trump administration to consider extraordinary efforts to clear the way for the new technology or even to help build it in order to counter the growing economic and political threat from China’s aggressive efforts to develop 5G. \n“It is necessary and possible to build a secure, high-performance, world-leading 5G network platform by the end of the first term,” the memo says. The memo was first reported by news website Axios. Such an effort could secure the U.S. position as the world leader in internet technology and encourage a renaissance of U.S. telecommunications manufacturing, the memo suggests.\nThe ambitious goals outlined in the memo, however, were greeted with skepticism by some telecommunications experts, who said the proposed effort’s rapid timetable was likely unrealistic, particularly given the huge costs associated with building a nationwide 5G network. They also predicted widespread industry opposition, as did the memo itself.\nStill, the memo underscores the growing significance of 5G as a policy and political debate for the administration. The anticipated 5G service would offer significantly faster speeds and expanded capacity that could accommodate emerging technologies such as self-driving vehicles and the internet of things. \nIt relies in part on employing parts of the airwaves that haven’t previously been viewed as useful for wireless service. \nSome experts have predicted in recent days that President Donald Trump might even seek to draw attention to the need to accelerate 5G efforts in his State of the Union address. Industry officials have been invited to the White House Monday for a round-table discussion of infrastructure efforts that could touch on 5G deployment.\nAT&T Inc. said in a statement that it couldn’t comment on a memo it hadn’t seen. But, more broadly, it said, “thanks to multi-billion dollar investments made by American companies, the work to launch 5G service in the United States is already well down the road....We have no doubt that America will lead the 5G revolution.”\nA Verizon Communications Inc. spokesman declined to comment.\nIn December, Mr. Trump pledged in his National Security Strategy document: “We will improve America’s digital infrastructure by deploying a secure 5G Internet capability nationwide.” \nThe problem, according to people working on the White House’s 5G plan, is that the U.S. is almost uniquely ill-suited to build such a national network due to several factors, including an effective oligopoly among telecommunications and cable companies, tight regulations and the lack of indigenous manufacturers. Meanwhile, China is progressing swiftly with its development of 5G, and whoever ends up deploying the technology more quickly will gain a significant competitive advantage, these people say, because 5G is expected to provide the underlying architecture of the global information economy. A national network is a prerequisite for self-driving cars, automated farming and other technologies.\nSome in the White House have concluded that the only path forward for the U.S. is to build a single network because multiple networks wouldn’t have enough bandwidth. The current debate is focused on whether the government should build the network or if a private consortium of companies should get together to build it, according to people familiar with the discussions. The plans being discussed at the White House are only focused on midband 5G technology—officials always planned to leave private- industry players to build their own low- and high-band 5G, which is where most of the margins are, these people said. Officials had been planning soon to begin formal outreach to industry players to gauge their interest. \nThere are some early signs of resistance, with one senior telecom executive saying that rationale for nationalizing 5G networks seems to be based entirely on trying to mimic the way China is developing the network.\n“It would fly in the face of basically the entire history of US policy in terms of the private sector and government,” the person said. Even AT&T wasn’t government owned prior to its 1984 breakup, it was a government sanctioned monopoly.\nVerizon, AT&T and other carriers have already invested hundreds of millions of dollars developing standards and technology to roll out 5G. Verizon plans to launch a 5G network in Sacramento later this year that would deliver high speed home internet wirelessly.\nThe cable industry is undergoing a major transformation, as more Americans cut the cord on their cable subscriptions and flock to streaming services like Hulu and Netflix. So how did we get here? Illustration: Shaumbe Wright/WSJ Write to John D. McKinnon at john.mckinnon@wsj.com and Ryan Knutson at ryan.knutson@wsj.com", "external_links": [], "published": "2018-01-29T06:31:00.000+02:00", "crawled": "2018-01-29T07:33:10.014+02:00", "highlightTitle": ""}