{"organizations": [], "uuid": "6d099703e95990f85426da2d7531c2bdba1e2bff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226825821&w=1200&r=LYNXMPEE0U07N", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-trade-china/trump-vows-to-protect-u-s-intellectual-property-without-naming-china-idUSKBN1FK0GM", "country": "US", "domain_rank": 408, "title": "Trump vows to protect U.S. intellectual property, without naming China", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T07:09:00.000+02:00", "replies_count": 0, "uuid": "6d099703e95990f85426da2d7531c2bdba1e2bff"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trade-china/trump-vows-to-protect-u-s-intellectual-property-without-naming-china-idUSKBN1FK0GM", "ord_in_thread": 0, "title": "Trump vows to protect U.S. intellectual property, without naming China", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china lesley wroughton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:10 AM / in 9 hours Trump vows to protect U.S. intellectual property, without directly blaming China Lesley Wroughton 3 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump vowed on Tuesday to protect American intellectual property, but made little mention of China, which his administration has accused of trade abuses, in his first State of the Union speech to Congress. \nTrump had been expected to deliver strong warnings to countries about unfair trade practices, including stealing intellectual property and providing state aid to their industries. \nInstead, his comments on trade during the speech were restricted to several sentences that omitted China in which he repeated that “fair and reciprocal” trade was necessary. \n“We will work to fix bad trade deals and negotiate new ones,” Trump said, adding: “We will protect American workers and American intellectual property, through strong enforcement of our trade rules.” \nTrump has threatened to walk away from trade agreements like the North American Free Trade Agreement with Canada and Mexico, and the U.S-South Korean Free Trade Agreement, unless they bolster U.S. manufacturing and American jobs. \nLast week, he imposed tariffs on imported washing machines and solar panels in his first major trade actions since withdrawing the United States from the Trans Pacific Partnership trade agreement within weeks of taking office last year. \nTrump is considering broad tariffs or quotas on steel and aluminum following investigations by the U.S. Department of Commerce into whether rising steel and aluminum imports represent a threat to national security. \nIn his speech, Trump briefly referred to China as among “rivals” that challenge U.S. interests, values and the economy, prompting China’s Foreign Ministry to say that the United States should “abandon its Cold War mentality and outdated zero-sum game ideas.” \n“China and the United States have broad and important joint interests,” ministry spokeswoman Hua Chunying told a news briefing in Beijing on Wednesday when asked about Trump’s remarks, adding that those interests were bigger than the two countries’ differences. \nThe Alliance for American Manufacturing, a group representing steel and other basic industries, welcomed Trump’s remarks on trade in his speech but called for actions to combat Chinese imports. \n“This speech won’t change China’s behavior and defend American jobs. Only action will,” said AAM President Scott Paul, “It’s time for the president’s policies and actions to match his talk.” Reporting by Lesley Wroughton; Additional reporting by Michael Martina in Beijing; Editing by Peter Cooney and Nick Macfie", "external_links": [], "published": "2018-01-31T07:09:00.000+02:00", "crawled": "2018-01-31T07:13:28.013+02:00", "highlightTitle": ""}