{"organizations": [], "uuid": "a5fbf2afaf1a3e7dcf62c2a98b351dd5f507d12b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/europe-electricity/europe-power-prompt-prices-fall-coming-weeks-firmer-idUSL8N1P719A", "country": "US", "domain_rank": 408, "title": "EUROPE POWER-Prompt prices fall, coming weeks firmer", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T20:37:00.000+02:00", "replies_count": 0, "uuid": "a5fbf2afaf1a3e7dcf62c2a98b351dd5f507d12b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-electricity/europe-power-prompt-prices-fall-coming-weeks-firmer-idUSL8N1P719A", "ord_in_thread": 0, "title": "EUROPE POWER-Prompt prices fall, coming weeks firmer", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gw", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 12 (Reuters) - European wholesale prices for early next week declined on Friday on expected strong windpower generation for main producer Germany, though prices for coming weeks firmed on forecasts of colder weather.\n* “Germany is (forecast) to see minus temperatures later this month and France could see temperatures halve. That’s boosting buying,” one trader said.\n* Temperatures will turn lower next week, with Germany’s falling by 1.7 degrees Celsius on average and those in France easing by 0.1 degrees, Thomson Reuters data shows.\n* The German baseload electricity contract for the week starting Jan. 22 rose 7.1 percent to 41.25 euros ($50.02), with the following two weeks also rising.\n* The equivalent French contract for the week to Jan. 22 jumped by 8.2 percent to 49.50 euros.\n* Windpower generation in Germany is forecast to reach 19 gigawatts (GW) on Monday in one scenario Quote: d by Thomson Reuters data, which put expected Friday levels at 4.7 GW, weighing on Monday spot prices.\n* French nuclear availability has risen recently, but utility EDF reported overnight that the Cruas 3 reactor will be offline until Jan. 18 in an unscheduled outage.\n* Further ahead, Germany’s Cal ‘19 baseload contract gained 0.3 percent to 35.60 euros, tracking firmer carbon and coal.\n* The equivalent French year-ahead contract was up 0.5 percent at 41 euros.\n* Cif Europe coal for 2019 gained 0.6 percent to $85.25 a tonne.\n* December 2018 expiry carbon emissions permits were up 0.1 percent at 7.83 euros a tonne.\n* Among other related fuels, oil slipped while UK gas continued to post gains on expected cold weather.\n* In eastern Europe, the Czech Monday power contract was untraded, with Friday having closed at 44.11 euros. The Czech year-ahead contract was also untraded after a 36.90 euro close.\n* Germany’s hard coal imports fell by 10.5 percent last year to 51.2 million tonnes, lobby VDKI said in data released during its annual meeting in Hamburg. The group also said that sea-borne coal trade rose 1.5 percent as production rose and exporting countries stepped up trade activity. ($1 = 0.8247 euros) (Reporting by Vera Eckert; Editing by David Goodman)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T20:37:00.000+02:00", "crawled": "2018-01-13T14:40:25.000+02:00", "highlightTitle": ""}