{"organizations": [], "uuid": "450641b86e98c6e728348ab7d3b7190642b1a224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-atlantic-coast-financial-corporationas-fourth-quarter-2017-net-loss-of-0-point-04-per-diluted-share-included-0-point-14-in.html", "country": "US", "domain_rank": 767, "title": "Atlantic Coast Financial Corporation’s Fourth Quarter 2017 Net Loss of $0.04 Per Diluted Share Included $0.14 in Charges Related to Tax Act and Pending Merger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T00:05:00.000+02:00", "replies_count": 0, "uuid": "450641b86e98c6e728348ab7d3b7190642b1a224"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-atlantic-coast-financial-corporationas-fourth-quarter-2017-net-loss-of-0-point-04-per-diluted-share-included-0-point-14-in.html", "ord_in_thread": 0, "title": "Atlantic Coast Financial Corporation’s Fourth Quarter 2017 Net Loss of $0.04 Per Diluted Share Included $0.14 in Charges Related to Tax Act and Pending Merger", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "atlantic coast", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "atlantic coast financial corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "ameris bancorp", "sentiment": "none"}, {"name": "atlantic coast bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla.--(BUSINESS WIRE)-- Atlantic Coast Financial Corporation (Atlantic Coast or the Company, NASDAQ: ACFC):\nPortfolio loans increased $118 million since December 2016. Deposits increased $47 million during the last 12 months. Nonperforming assets declined 27% to $9.5 million year over year. Entered into an Agreement and Plan of Merger with Ameris Bancorp on November 16, 2017.\nAtlantic Coast Financial Corporation (Atlantic Coast or the Company, NASDAQ: ACFC), the holding company for Atlantic Coast Bank (the Bank), today reported a loss per diluted share of $0.04 and earnings per diluted share of $0.21 for the 3 and 12 months ended December 31, 2017, respectively, compared with earnings of $0.13 and $0.42 for the 3 and 12 months ended December 31, 2016, respectively. The results for the 3 and 12 months ended December 31, 2017, included a charge of $1.6 million, or $0.11 per diluted share, related to a reduction in the valuation of the Company's net deferred tax assets caused by the recently enacted tax legislation, which reduces the future statutory corporate income tax rate, and $0.4 million, or $0.03 per diluted share, of merger-related costs.\nCommenting on the Company's results, John K. Stephens, Jr., President and Chief Executive Officer, said, \"Aside from the impact of the new tax legislation on our deferred tax assets, which was anticipated as Congress began to consider reduced corporate income tax rates last fall, the fourth quarter demonstrated continued strength throughout our franchise. During the past year, total loans increased 16% while deposits increased 8%, with both reflecting the success of our strategies to increase our presence and visibility across our markets. Meanwhile, credit quality continued to improve, as indicated by an ongoing decline in nonperforming assets – both in total and relative to total assets. With this progress, we proudly look back on the Company's performance and accomplishments in 2017.\"\nSeparately, Stephens noted the Company's recent announcement to be acquired by Ameris Bancorp in a transaction that is expected to be completed in the second quarter of 2018, subject to regulatory and stockholder approvals, along with other customary conditions. \"We are excited about the prospects of joining forces with Ameris and together becoming the largest community bank in the Jacksonville market. We believe there is a good cultural fit between our two banks, which means that our customers will continue to see a strong commitment to high-touch service while benefiting directly from the additional resources and capabilities offered by Ameris.\"\nOther significant highlights of the fourth quarter of 2017 and the full year included:\nNet interest income was $7.2 million and $27.0 million for the 3 and 12 months ended December 31, 2017, respectively, compared with $7.1 million and $26.5 million for the 3 and 12 months ended December 31, 2016, respectively. Net interest margin was 3.24% and 3.20% for the 3 and 12 months ended December 31, 2017, respectively, compared with 3.30% and 3.12% for the 3 and 12 months ended December 31, 2016, respectively. Total loans (including portfolio loans, loans held-for-sale, and warehouse loans held-for-investment) increased 16% to $842.8 million at December 31, 2017, from $727.0 million at December 31, 2016. The Company's loan growth since December 31, 2016, was driven primarily by increased commercial real estate lending in all of its markets. This growth was supplemented by strategic loan purchases, somewhat offset by mortgage loan sales as part of the Company's interest rate risk and balance sheet management strategies and decreases in warehouse loans held-for-investment. Deposits increased 8% to $675.8 million at December 31, 2017, from $628.4 million at December 31, 2016. Deposits, excluding brokered certificates of deposit, increased 15% to $639.8 million at December 31, 2017, from $558.0 million at December 31, 2016. Wholesale funding, which includes brokered certificates of deposit and Federal Home Loan Bank advances, decreased 4% to $249.5 million at December 31, 2017, from $259.2 million at December 31, 2016. The increase in non-brokered deposits and resulting reduced reliance on wholesale funding was driven primarily by the Company's commercial deposit strategies put in place during 2016. Total assets increased to $983.3 million at December 31, 2017, from $907.5 million at December 31, 2016, primarily due to increases in portfolio loans and warehouse loans held-for-investment, which were partially offset by a decrease in cash and cash equivalents, investment securities and loans held-for-sale. Nonperforming assets, as a percentage of total assets, declined to 0.97% at December 31, 2017, from 1.44% at December 31, 2016. Due to the Company's generally stable credit quality during 2016 and continuing throughout 2017, reflecting an overall slowing pace of loan reclassifications to nonperforming, the Company’s loan loss provision remained at a low level for both the 3 and 12 months ended December 31, 2017, while maintaining, in management's view, a stable ratio of allowance for portfolio loan losses to total portfolio loans. The Bank's ratios of total risk-based capital to risk-weighted assets and Tier 1 (core) capital to adjusted total assets were 12.51% and 9.66%, respectively, at December 31, 2017, and each continued to exceed the levels required by regulation, currently 10% and 5%, respectively, for a bank to be considered well-capitalized.\nTracy L. Keegan, Executive Vice President and Chief Financial Officer, added, \"It was gratifying to see net interest margin increase 8 basis points during 2017, reflecting the success of the operating strategies we implemented this past year to grow loans and noninterest-bearing deposits, resulting in a more diversified balance sheet.\"\nCommenting on the revaluation adjustment made on the Company's net deferred tax assets, Keegan said \"The charge of $1.6 million was recorded as an increase in income tax expense for the fourth quarter of 2017. Deferred tax assets and liabilities occur due to temporary differences between the financial reporting and the tax bases of the Company's assets and liabilities at enacted tax rates expected to be in effect when such amounts are realized or settled. With the new tax legislation passed in December 2017, the Company's net deferred tax assets are now expected to be settled at a statutory rate of 21% rather than the statutory rate of 35% used previously to value these deferred tax assets.\" Keegan also noted that the Company incurred merger-related costs of approximately $0.4 million in the fourth quarter of 2017.\nBank Regulatory Capital At Key Capital Measures\nDec. 31, 2017 Dec. 31, 2016 Total risk-based capital ratio (to risk-weighted assets) 12.51 % 14.83 % Common equity tier 1 (core) risk-based capital ratio (to risk-weighted assets) 11.42 % 13.58 % Tier 1 (core) risk-based capital ratio (to risk-weighted assets) 11.42 % 13.58 % Tier 1 (core) capital ratio (to adjusted total assets) 9.66 % 9.44 % The decrease in risk-weighted capital ratios at December 31, 2017, compared with December 31, 2016, reflected an increase in risk-weighted assets due to growth in portfolio loans and a decrease in cash and cash equivalents and investment securities, as well as an increase in the risk weighting of certain portfolio loan categories, partially offset by an increase in equity due to accumulated earnings. The charge to remeasure net deferred tax assets, together with merger related expenses, reduced the Company's Tier 1 (core) capital ratio as of December 31, 2017, by approximately 20 basis points.\nCredit Quality\nAt Dec. 31, 2017 Dec. 31, 2016 (Dollars in millions) Nonperforming loans $ 7.8 $ 10.1 Nonperforming loans to total portfolio loans 1.02 % 1.57 % Other real estate owned $ 1.7 $ 2.9 Nonperforming assets $ 9.5 $ 13.0 Nonperforming assets to total assets 0.97 % 1.44 % Troubled debt restructurings performing for less than 12 months\nunder terms of modification (1) $ 15.2 $ 14.6 Troubled debt restructurings performing for more than 12 months\nunder terms of modification $ 15.7 $ 20.3\n(1) Includes $5.9 million and $7.9 million of nonperforming loans at December 31, 2017 and 2016, respectively.\nNonperforming assets have declined for five consecutive quarters as the Company's overall credit quality remained stable and the general pace of loans reclassified to nonperforming remained slow during the last 12 months. Importantly, OREO declined significantly as of December 31, 2017, compared with that at December 31, 2016, primarily due to the sale of a $2.4 million foreclosed property in the second quarter of 2017, partially offset by the foreclosure of a $1.6 million property in the fourth quarter of 2017, which was expected to occur and had been fully reserved for prior to the foreclosure.\nProvision / Allowance for Loan Losses\nAt and for the\nThree Months Ended\nAt and for the\nYear Ended\nDec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\n(Dollars in millions) Provision for portfolio loan losses $ 0.2 $ 0.2 $ 0.1 $ 0.7 $ 0.6 Allowance for portfolio loan losses $ 8.6 $ 8.4 $ 8.2 $ 8.6 $ 8.2 Allowance for portfolio loan losses to total portfolio loans 1.12% 1.12% 1.26% 1.12% 1.26% Allowance for portfolio loan losses to nonperforming loans 110.43% 88.16% 80.38% 110.43% 80.38% Net charge-offs (recoveries) $ 0.0 $ (0.0) $ 0.0 $ 0.3 $ 0.2 Net charge-offs (recoveries) to average outstanding portfolio loans (annualized) 0.02% (0.01)% 0.02% 0.04% 0.03% Net charge-offs totaled $39,000 and $38,000 for the three months ended December 31, 2017 and 2016, respectively, while net recoveries totaled $18,000 for the three months ended September 30, 2017. This reflects a trend of solid economic conditions across the Company's markets, which has led to continued low levels of net charge-offs during the last 12 months.\nThe Company's provision for portfolio loan losses has remained within a relatively narrow range over the past year. However, it was up $185,000 for the three months ended December 31, 2017, compared with the fourth quarter last year, and was up $74,000 for the 12 months ended December 31, 2017, versus full year 2016. The increase in the allowance for portfolio loan losses at December 31, 2017, compared with that at December 31, 2016, was attributable primarily to loan growth, which reflected organic growth supplemented by strategic loan purchases that were offset partially by loan sales, principal amortization, and increased prepayments of one- to four-family residential mortgages and home equity loans. Management believes the allowance for portfolio loan losses at December 31, 2017, is sufficient to absorb losses in portfolio loans as of the end of the period.\nNet Interest Income Three Months Ended Year Ended Dec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\n(Dollars in millions) Net interest income $ 7.2 $ 6.8 $ 7.1 $ 27.0 $ 26.5 Net interest margin 3.24 % 3.18 % 3.30 % 3.20 % 3.12 % Yield on investment securities 2.09 % 2.05 % 2.29 % 2.25 % 2.11 % Yield on loans 4.47 % 4.31 % 4.40 % 4.33 % 4.37 % Total cost of funds 1.03 % 0.98 % 0.78 % 0.93 % 0.92 % Average cost of deposits 0.85 % 0.80 % 0.66 % 0.77 % 0.62 % Rates paid on borrowed funds 1.83 % 2.02 % 1.14 % 1.88 % 1.70 % The slight decrease in net interest margin during the three months ended December 31, 2017, compared with net interest margin for the three months ended December 31, 2016, reflected an increase in rates paid on deposits and borrowed funds, with little to no change in rates on new loans due to highly competitive lending conditions. In addition, margin remains relatively stable given the improved mix in core deposits and growth in noninterest-bearing accounts. The increase in net interest margin during the 12 months ended December 31, 2017, compared with net interest margin for the 12 months ended December 31, 2016, primarily reflected a decrease in rates paid on funds due to an increase in noninterest-bearing deposits, and an increase in higher-margin interest-earning assets outstanding, reflecting the Company's ongoing redeployment of excess liquidity to grow its portfolio loans, loans held-for-sale, and warehouse loans held-for-investment.\nNoninterest Income / Noninterest\nExpense / Income Tax Expense\nThree Months Ended Year Ended Dec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\n(Dollars in millions) Noninterest income $ 1.3 $ 1.2 $ 1.9 $ 7.0 $ 9.2 Noninterest expense $ 6.4 $ 6.1 $ 6.0 $ 25.6 $ 25.1 Income tax expense $ 2.5 $ 0.6 $ 1.0 $ 4.6 $ 3.6 The decrease in noninterest income for the three months ended December 31, 2017, compared with that of the three months ended December 31, 2016, primarily reflected lower gains on the sale of portfolio loans and loans held-for-sale, as well as reduced service charges and fees. The decrease in noninterest income for the 12 months ended December 31, 2017, compared with that of the 12 months ended December 31, 2016, primarily reflected lower gains on the sale of investment securities, lower gains on the sale of portfolio loans, reduced service charges and fees, and a decrease in miscellaneous operating income related to an escrow account that was forfeited in 2016 in connection with an OREO sale, partially offset by higher gains on the sale of loans held-for-sale.\nThe increase in noninterest expense during the three months ended December 31, 2017, compared with that of the three months ended December 31, 2016, primarily reflected an increase in compensation and benefits, occupancy and equipment expense, and merger-related costs associated with the proposed merger with Ameris Bancorp, partially offset by reduced foreclosed asset expense and a decrease in data processing expenses. The increase in noninterest expense during the 12 months ended December 31, 2017, compared with that of the 12 months ended December 31, 2016, primarily reflected an increase in compensation and benefits, increased data processing expenses associated with efforts to improve the Company's IT infrastructure, an increase in occupancy and equipment expense, and the aforementioned merger-related costs, partially offset by the positive impact of an adjustment to the rate of accrual for FDIC insurance premiums, reducing the amount accrued for the full year, and a decrease in collection expense.\nThe increase in income tax expense for the 3 and 12 months ended December 31, 2017, compared with that of the 3 and 12 months ended December 31, 2016, primarily reflected the impact of newly enacted tax legislation, partially offset by a decline in income before income tax expense.\nUse of Non-GAAP Financial Measures\nA non-GAAP financial measure is generally defined as a numerical measure of a company's historical or future financial performance, financial position, or cash flows that either excludes or includes amounts, or is subject to adjustments, so as to be different from the most directly comparable measure calculated and presented in accordance with generally accepted accounting principles (GAAP). Core earnings and core earnings per diluted share exclude the effects of certain transactions that occurred during the period, as detailed in the following reconciliation of these measures.\nThree Months Ended Year Ended Dec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\n(Dollars in thousands) Net income, as reported $ (616 ) $ 1,115 $ 2,002 $ 3,168 $ 6,418 Less FHLB gain (1) -- -- (255 ) -- (255 ) Plus merger-related costs (2) 400 -- -- 411 -- Plus impact of newly enacted tax laws (3) 1,641 -- -- 1,641 -- Adjusted net income (core earnings) $ 1,425 $ 1,115 $ 1,747 $ 5,220 $ 6,163 Income per diluted share, as reported $ (0.04 ) $ 0.07 $ 0.13 $ 0.21 $ 0.42 Less FHLB gain -- -- (0.02 ) -- (0.02 ) Plus merger-related costs 0.03 -- -- 0.03 -- Plus impact of newly enacted tax laws 0.11 -- -- 0.11 -- Adjusted income per diluted share\n(core earnings per diluted share) (4) $ 0.09 $ 0.07 $ 0.11 $ 0.34 $ 0.40\n(1) The FHLB gain, which is included in noninterest income, totaled $412,000, and is shown above net of a tax expense adjustment of $157,000.\n(2) The merger-related costs, which are included in noninterest expense, totaled $443,000 and is shown above net of a tax expense adjustment of $43,000 for the three months ended December 31, 2017. The merger-related costs totaled $454,000 and is shown above net of a tax expense adjustment of $43,000 for the 12 months ended December 31, 2017.\n(3) The impact of newly enacted tax laws is included in income tax expense.\n(4) May not foot due to rounding.\nCore earnings and core earnings per diluted share should be viewed in addition to, and not as a substitute for or superior to, net income and income per diluted share on a GAAP basis. Atlantic Coast's management believes that the non-GAAP financial measures, when considered together with GAAP financial measures, provide information that is useful to investors in understanding period-over-period operating results separate and apart from items that may, or could, have a disproportionately positive or negative impact on results in any particular period. Atlantic Coast's management also believes that the non-GAAP financial measures aid investors in analyzing the Company's business trends and in understanding the Company's performance. In addition, the Company may utilize non-GAAP financial measures as guides in forecasting, budgeting and long-term planning processes and to measure operating performance for some management compensation purposes.\nAbout the Company\nAtlantic Coast Financial Corporation is the holding company for Atlantic Coast Bank, a Florida state-chartered commercial bank. It is a community-oriented financial institution serving the Northeast Florida, Central Florida and Southeast Georgia markets. Investors may obtain additional information about Atlantic Coast Financial Corporation on the Internet at www.AtlanticCoastBank.net , under Investor Relations.\nForward-looking Statements\nStatements in this press release that are not historical facts are forward-looking statements that reflect management's current expectations, assumptions and estimates of future performance and economic conditions, and involve risks and uncertainties that could cause actual results to differ materially from those anticipated by the statements made herein. Such statements are made in reliance upon the safe harbor provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements generally are identifiable by the use of forward-looking terminology such as \"believes,\" \"expects,\" \"may,\" \"will,\" \"should,\" \"plans,\" \"intends,\" \"projects,\" \"targets,\" \"estimates,\" \"preliminary,\" or \"anticipates\" or the negative thereof or comparable terminology, or by discussion of strategy or goals or other future events, circumstances or effects. Moreover, forward-looking statements in this release include, but are not limited to, those relating to: the expected merger with Ameris Bancorp; the strength of our ratio of allowance for portfolio loan losses to total portfolio loans; and the allowance for portfolio loan losses being sufficient to absorb losses in respect of portfolio loans. The Company's consolidated financial results and the forward-looking statements could be affected by many factors, including but not limited to: general economic trends and changes in interest rates; increased competition; changes in demand for financial services; the state of the banking industry generally; uncertainties associated with newly developed or acquired operations; market disruptions; and cyber-security risks. Further information relating to factors that may impact the Company's results and forward-looking statements are disclosed in the Company's filings with the Securities and Exchange Commission. In particular, please refer to \"Item 1A. Risk Factors\" beginning on page 38 of the Company's Annual Report on Form 10-K for the year ended December 31, 2016. The forward-looking statements contained in this release are made as of the date of this release, and the Company disclaims any intention or obligation, other than imposed by law, to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nAdditional Information and Where to Find It\nAmeris Bancorp has filed a registration statement on Form S-4 (Registration Number 333-222563) with the Securities and Exchange Commission to register the shares of Ameris Banorp’s common stock that will be issued to Atlantic Coast's stockholders in connection with the transaction. The registration statement includes a joint proxy statement/prospectus and other relevant materials in connection with the proposed merger transaction. BEFORE MAKING ANY VOTING OR INVESTMENT DECISION, INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE PROXY STATEMENT/PROSPECTUS REGARDING THE MERGER AND ANY OTHER RELEVANT DOCUMENTS CAREFULLY IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE MERGER. Investors and security holders may obtain free copies of these documents and other documents filed with the Securities and Exchange Commission on its website at http://www.sec.gov . Investors and security holders may also obtain free copies of the documents filed with the Securities and Exchange Commission by Ameris Bancorp on its website at http://www.AmerisBank.com and by Atlantic Coast on its website at https://www.AtlanticCoastBank.net/ .\nThis communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\nParticipants in the Merger Solicitation\nAmeris Bancorp and Atlantic Coast, and certain of their respective directors, executive officers and other members of management and employees, may be deemed to be participants in the solicitation of proxies from the stockholders of Atlantic Coast in respect of the proposed merger transaction. Information regarding the directors and executive officers of Ameris Bancorp and Atlantic Coast and other persons who may be deemed participants in the solicitation of the stockholders of Atlantic Coast in connection with the proposed transaction are included in the proxy statement/prospectus for Atlantic Coast's special meeting of stockholders, which has been filed by Ameris with the Securities and Exchange Commission. Information about Ameris Bancorp’s directors and executive officers can also be found in Ameris Bancorp’s definitive proxy statement in connection with its 2017 annual meeting of shareholders, as filed with the Securities and Exchange Commission on April 3, 2017, and other documents subsequently filed by Ameris Bancorp with the Securities and Exchange Commission. Information about Atlantic Coast’s directors and executive officers can also be found in Atlantic Coast’s definitive proxy statement in connection with its 2017 annual meeting of stockholders, as filed with the Securities and Exchange Commission on April 18, 2017, and other documents subsequently filed by Atlantic Coast with the Securities and Exchange Commission. Additional information regarding the interests of such participants is included in the proxy statement/prospectus and other relevant documents regarding the proposed merger transaction filed with the Securities and Exchange Commission when they become available.\nATLANTIC COAST FINANCIAL CORPORATION\nStatements of Operations (Unaudited)\n(In thousands, except per share amounts)\nThree Months Ended Year Ended Dec. 31,\n2017\nSept. 30,\n2017\nDec. 31,\n2016\nDec. 31,\n2017\nDec. 31,\n2016\nInterest and dividend income: Loans, including fees $ 8,951 $ 8,364 $ 8,282 $ 32,812 $ 31,681 Securities and interest-earning deposits in other financial institutions 401 347 423 1,560 2,208 Total interest and dividend income 9,352 8,711 8,705 34,372 33,889 Interest expense: Deposits 1,458 1,363 1,001 5,170 3,607 Securities sold under agreements to repurchase -- -- -- -- 1 Federal Home Loan Bank advances 676 595 588 2,208 3,808 Other borrowings -- -- -- -- 1 Total interest expense 2,134 1,958 1,589 7,378 7,417 Net interest income 7,218 6,753 7,116 26,994 26,472 Provision for portfolio loan losses 235 167 50 693 619 Net interest income after provision for portfolio loan losses\n6,983 6,586 7,066 26,301 25,853 Noninterest income: Service charges and fees 433 452 532 1,773 2,320 Gain on sale of securities available-for-sale -- 9 -- 409 1,321 Gain on sale of portfolio loans 38 -- 87 38 314 Gain on sale of loans held-for-sale 109 186 368 2,228 1,966 Bank owned life insurance earnings 118 117 116 470 465 Interchange fees 328 315 323 1,311 1,356 Other 244 156 514 756 1,505 Total noninterest income 1,270 1,235 1,940 6,985 9,247 Noninterest expense: Compensation and benefits 3,309 3,544 3,171 13,867 13,703 Occupancy and equipment 654 642 432 2,399 2,295 FDIC insurance premiums 94 34 134 384 607 Foreclosed assets, net (13 ) (6 ) 81 280 335 Data processing 542 581 653 2,316 2,209 Outside professional services 478 458 488 2,035 1,985 Collection expense and repossessed asset losses 83 82 140 399 503 Merger-related costs 443 -- -- 454 -- Other 778 810 877 3,425 3,413 Total noninterest expense 6,368 6,145 5,976 25,559 25,050 Income before income tax expense 1,885 1,676 3,030 7,727 10,050 Income tax expense 2,501 561 1,028 4,559 3,632 Net income (loss) $ (616 ) $ 1,115 $ 2,002 $ 3,168 $ 6,418 Net income (loss) per basic and diluted share $ (0.04 ) $ 0.07 $ 0.13 $ 0.21 $ 0.42 Basic and diluted weighted average shares outstanding 15,429 15,430 15,417 15,425 15,417 ATLANTIC COAST FINANCIAL CORPORATION\nBalance Sheets (Unaudited)\n(Dollars in thousands)\nDec. 31, 2017 Dec. 31, 2016 ASSETS Cash and due from financial institutions $ 3,432 $ 3,744 Short-term interest-earning deposits 46,977 56,149 Total cash and cash equivalents 50,409 59,893 Securities available-for-sale 37,683 65,293 Portfolio loans, net of allowance of $8,600 and $8,162, respectively 757,506 639,245 Other loans: Loans held-for-sale 3,623 7,147 Warehouse loans held-for-investment 81,687 80,577 Total other loans 85,310 87,724 Federal Home Loan Bank stock, at cost 9,892 8,792 Land, premises and equipment, net 14,172 14,945 Bank owned life insurance 18,005 17,535 Other real estate owned 1,739 2,886 Accrued interest receivable 2,267 1,979 Deferred tax assets, net 4,108 6,752 Other assets 2,165 2,415 Total assets $ 983,256 $ 907,459 LIABILITIES AND STOCKHOLDERS ' EQUITY Deposits: Noninterest-bearing demand $ 63,852 $ 59,696 Interest-bearing demand 97,350 106,004 Savings and money markets 294,674 224,987 Time 219,927 237,726 Total deposits 675,803 628,413 Federal Home Loan Bank advances 213,525 188,758 Accrued expenses and other liabilities 3,268 3,270 Total liabilities 892,596 820,441 Total stockholders' equity 90,660 87,018 Total liabilities and stockholders' equity $ 983,256 $ 907,459 ATLANTIC COAST FINANCIAL CORPORATION\nSelected Consolidated Financial Ratios and Other Data (Unaudited)\n(Dollars in thousands)\nAt and for the\nThree Months Ended\nDec. 31,\nAt and for the\nYear Ended\nDec. 31,\n2017 2016 2017 2016 Interest rate Net interest spread 3.08 % 3.20 % 3.06 % 3.01 % Net interest margin 3.24 % 3.30 % 3.20 % 3.12 %\nAverage balances Portfolio loans receivable, net $ 756,964 $ 650,269 $ 711,211 $ 645,946 Warehouse loans held-for-investment 33,907 90,996 36,294 65,974 Total interest-earning assets 889,950 862,303 842,921 848,013 Total assets 928,485 903,170 883,223 891,578 Deposits 685,210 606,441 672,591 579,429 Total interest-bearing liabilities 762,847 755,182 721,877 748,544 Total liabilities 836,014 816,064 792,678 806,488 Stockholders' equity 92,471 87,106 90,545 85,090\nPerformance ratios (annualized) Return on average total assets (0.27 )% 0.89 % 0.36 % 0.72 % Return on average stockholders' equity (2.66 )% 9.19 % 3.50 % 7.54 % Ratio of operating expenses to average total assets 2.74 % 2.65 % 2.89 % 2.81 %\nCredit and liquidity ratios Nonperforming loans $ 7,788 $ 10,154 $ 7,788 $ 10,154 Foreclosed assets 1,739 2,886 1,739 2,886 Impaired loans 33,001 37,302 33,001 37,302 Nonperforming assets to total assets 0.97 % 1.44 % 0.97 % 1.44 % Nonperforming loans to total portfolio loans 1.02 % 1.57 % 1.02 % 1.57 % Allowance for loan losses to nonperforming loans 110.43 % 80.38 % 110.43 % 80.38 % Allowance for loan losses to total portfolio loans 1.12 % 1.26 % 1.12 % 1.26 % Net charge-offs (recoveries) to average outstanding portfolio loans (annualized) 0.02 % 0.02 % 0.04 % 0.03 % Ratio of gross portfolio loans to total deposits 113.36 % 103.02 % 113.36 % 103.02 %\nCapital ratios Tangible stockholders' equity to tangible assets (1) 9.22 % 9.59 % 9.22 % 9.59 % Average stockholders' equity to average total assets 9.96 % 9.64 % 10.25 % 9.54 %\nOther Data Tangible book value per share (1) $ 5.83 $ 5.61 $ 5.83 $ 5.61 Stock price per share 9.43 6.80 9.43 6.80 Stock price per share to tangible book value per share (1) 161.78 % 121.19 % 161.78 % 121.19 %", "external_links": ["https://www.AtlanticCoastBank.net/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747254&newsitemid=20180123005465&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=ce710df03d2469039ac20a992ae3d47d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.AmerisBank.com&esheet=51747254&newsitemid=20180123005465&lan=en-US&anchor=http%3A%2F%2Fwww.AmerisBank.com&index=3&md5=637dfe626132bdfb951685146661b045", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.atlanticcoastbank.net&esheet=51747254&newsitemid=20180123005465&lan=en-US&anchor=www.AtlanticCoastBank.net&index=1&md5=bb1e866a2ade92c77e3945391b694b01", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.AtlanticCoastBank.net%2F&esheet=51747254&newsitemid=20180123005465&lan=en-US&anchor=https%3A%2F%2Fwww.AtlanticCoastBank.net%2F&index=4&md5=7a6a7e11ef1057eb45fde1af5b22adcc"], "published": "2018-01-24T00:05:00.000+02:00", "crawled": "2018-01-24T00:57:19.010+02:00", "highlightTitle": ""}