{"organizations": [], "uuid": "08bf832a3dfb398864e1cb537466458af5d6b6cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-los-angeles-times-loses-publisher-gets-union.html", "country": "US", "domain_rank": 767, "title": "Los Angeles Times loses publisher, gets union", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:37:00.000+02:00", "replies_count": 0, "uuid": "08bf832a3dfb398864e1cb537466458af5d6b6cc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-los-angeles-times-loses-publisher-gets-union.html", "ord_in_thread": 0, "title": "Los Angeles Times loses publisher, gets union", "locations": [], "entities": {"persons": [{"name": "ross levinsohn", "sentiment": "negative"}, {"name": "levinsohn", "sentiment": "none"}, {"name": "justin dearborn", "sentiment": "none"}, {"name": "mickie rosen", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "los angeles times", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "tronc inc.", "sentiment": "none"}, {"name": "national public radio", "sentiment": "none"}, {"name": "times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) — Los Angeles Times Publisher and Chief Executive Ross Levinsohn was placed on an unpaid leave of absence amid allegations of past improper behavior, it was announced Friday.\nThe news followed word that Times journalists had voted to join a union — a first in the paper's 136-year history.\nSome Times employees had called for Levinsohn to be fired after National Public Radio reported Thursday on allegations that he had engaged in what has been termed \"frat-boy\" behavior while serving as an executive at two previous companies and was a defendant in two sexual harassment lawsuits before he joined the Times on Aug. 21.\n\"Levinsohn has lost credibility as the leader of one of the country's top newspapers,\" said a petition to Times parent company Tronc Inc. signed by more than 200 staff members.\nLevinsohn will be replaced by President Mickie Rosen while Tronc investigates the allegations.\n\"We will not hesitate to take further action, if appropriate, once the review is complete,\" Tronc CEO Justin Dearborn said in an email to employees, the Times reported. He didn't say how long the investigation might last.\nLevinsohn was the Times' fifth publisher in as many years. That turnover has contributed to rising discontent in the newsroom, which also saw jobs slashed and benefits cut as the Times struggled with declining advertising revenues and circulation in the face of online competition.\nTimes daily circulation is now under 274,000, down from a high of more than 1 million in 1990.\nTimes union organizers also were incensed that while staff benefits were being cut, Tronc last month signed a $5 million-a-year contract with a consulting business owned by its chairman, Michael Ferro.\nOn Friday, a National Labor Relations Board tally found that newsroom workers voted 248 to 44 for representation by NewsGuild-Communications Workers of America. The vote was taken on Jan. 4.\nThe union must now negotiate for a collective bargaining agreement. The union said it will seek better pay and benefits as well as \"pay equity for women and people of color, greater diversity and better working conditions\" for reporters, copy editors, graphic artists and photographers.\n\"This was a long time coming, and we're all thrilled that this has finally happened,\" Kristina Bui, a Times copy editor and union organizer, told the newspaper. \"The newsroom has put up with so much disruption and mismanagement, and this vote just underscores how much of a say we need to have in the decision-making process. The newsroom is demanding a seat at the bargaining table.\"\n\"We respect the outcome of the election and look forward to productive conversations with union leadership as we move forward,\" Tronc said in a statement. \"We remain committed to ensuring that the Los Angeles Times is a leading source for news and information and to producing the award-winning journalism our readers rely on.\"\nTronc fought Times organizing efforts. A day before the vote, the paper's editor-in-chief and former interim executive editor sent employees an email arguing that \"a union won't solve most of the problems endemic to our industry.\"\nMost major news organizations in the United States, including The Associated Press, are unionized and digital media such as the Huffington Post also have seen successful organizing efforts.\nThe Times was owned for much of its history by the Chandler family and the paper was fervently anti-union. In 2000 it was sold to the Tribune Co., which went through a period of bankruptcy and turmoil. The company spun off its publishing arm as Tribune Publishing in 2014, which was later renamed Tronc, for Tribune Online Content.\nChicago-based Tronc is the nation's third-largest newspaper publisher and its properties include many venerable papers, including the Chicago Tribune, San Diego Union-Tribune, New York Daily News, Orlando Sentinel and Baltimore Sun.", "external_links": [], "published": "2018-01-19T23:37:00.000+02:00", "crawled": "2018-01-20T19:01:24.000+02:00", "highlightTitle": ""}