{"organizations": [], "uuid": "40da9764b63222c79c78c01ec30ef7fcc2fed8a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222431795&w=1200&r=LYNXMPEE0F0UD", "site_section": "https://www.reuters.com/places/russia", "section_title": "Russia", "url": "https://www.reuters.com/article/us-newsnow-jan16/tuesday-morning-briefing-idUSKBN1F51HX", "country": "US", "domain_rank": 408, "title": "Tuesday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:05:00.000+02:00", "replies_count": 0, "uuid": "40da9764b63222c79c78c01ec30ef7fcc2fed8a6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan16/tuesday-morning-briefing-idUSKBN1F51HX", "ord_in_thread": 0, "title": "Tuesday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "simone biles", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "general electric", "sentiment": "none"}, {"name": "huawei", "sentiment": "none"}, {"name": "china mobile", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump’s former strategist Steve Bannon is set to meet with the Russia probe panel, Olympic gold medalist Simone Biles says she was sexually abused and bitcoin slides 18 percent.\nBusiness\nBitcoin tumbled 18 percent to a four-week trough close to $11,000, after reports that a ban on trading of cryptocurrencies in South Korea was still an option drove fears grew of a wider regulatory crackdown.\nU.S. lawmakers are urging AT&T, the No. 2 wireless carrier, to cut commercial ties to Chinese phone maker Huawei and oppose plans by telecom operator China Mobile to enter the U.S. market because of national security concerns, two congressional aides said. Read the exclusive.\nU.S. industrial conglomerate General Electric said it would record an after-tax charge of $6.2 billion for the fourth quarter related to its finance arm’s run-off insurance portfolio.\nUnitedHealth, the largest U.S. health insurer, more than doubled its net profit in the fourth quarter , driven by a one-time tax gain due to U.S. tax code overhaul.\nThe collapse of British services group Carillion started to hurt thousands of small contractors , with some laying off workers after the rapid demise of a company that was winning state contracts as recently as November. The 200-year-old company, swamped by debt and pension liabilities and losing cash, went into liquidation, threatening suppliers, merchants and big banks.\nBreakingviews : Carillion collapse is UK outsourcing stress test\nThe world’s largest container shipping firm A.P. Moller-Maersk is teaming up with IBM to create an industry-wide trading platform it says can speed up trade and save billions of dollars.\nOil\nSurging shale production is poised to push U.S. oil output to more than 10 million barrels per day - toppling a record set in 1970 and crossing a threshold few could have imagined even a decade ago.\nSaudi Aramco has not invited UBS and Bank of America Merrill Lynch to pitch for senior advisory roles in its stock market listing because they have not lent money to the state oil giant in recent years, according to five finance sources .\nUnited States\nPresident Donald Trump’s former chief strategist Steve Bannon will meet behind closed doors with a U.S. House of Representatives committee that is probing whether Russia meddled in the 2016 presidential election.\nSixty-four trade groups, foreign governments, Republican candidates and others stayed at or held events at properties linked to Trump during Trump’s first year in office, a political watchdog group said in a report .\nThe 13 California siblings who police say were starved and chained to beds by their parents rarely left their disheveled house and, when they did, they appeared small and pale and acted strangely, neighbors said.\nFour-time Olympic gold medalist Simone Biles said she was sexually abused by former USA Gymnastics team physician Larry Nassar, the latest in a list of female athletes to accuse the doctor of misconduct.\nAna Ashury, a mixed-media artist, stores away her artwork on her rooftop in Ramat Gan, a suburb of Tel Aviv, Israel, November 19, 2017.REUTERS/Corinna Kern World\nChina’s economy is expected to cool this year as a government-led crackdown on debt risks and factory pollution drag on overall activity, a Reuters poll showed.\nJapanese public broadcaster NHK issued a false alarm about a North Korean missile launch on Tuesday, just days after a similar gaffe caused panic in Hawaii, but it managed to correct the error within minutes.\nLife began to look up for Gaza’s Palestinians when reconciliation between its Hamas Islamist rulers and the West Bank-based Palestinian Authority in October brought a drop in crippling prices. Three months on, discount stickers still adorn goods from clothes to cars but few of the two million people in the enclave blockaded by Israel are buying .\nNorth Korea\nA meeting of states that backed South Korea in the Korean war will look at ways to better implement sanctions to push North Korea to abandon its nuclear weapons, officials said, even as the North and South explore detente ahead of next month’s Winter Olympics.\nWhile Seoul forges ahead with plans to use the upcoming Winter Olympics to showcase inter-Korean unity, some South Korean athletes are “furious” at proposals to form joint teams with North Koreans, highlighting a broader lack of enthusiasm for some of the government’s peace-making plans.\nReuters TV : Koreas Olympics hockey team-up hits resistence\nMyanmar\nFormer New Mexico governor Bill Richardson said he would work toward securing the release of two Reuters journalists arrested in Myanmar in his capacity as a member of an international advisory board on the crisis in Rakhine state.\nBangladesh and Myanmar agreed to complete within two years the return of hundreds of thousands of Rohingya Muslims who had fled an army crackdown last year in Myanmar.\nCommentary\nWashington has been slow to grasp the reality on Iran’s streets, writes Roya Hakakian. Those who call for the United States to be passive about the latest protests advocate avoiding pressure on Tehran, assuming that stress of any kind would hamper the cause of democratic change. \"But if the history of post-revolutionary Iran is any guide, the opposite is in fact true.\"\n ", "external_links": ["https://www.reuters.tv/v/fGo/2018/01/16/koreas-olympics-hockey-team-up-hits-resistance", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T21:05:00.000+02:00", "crawled": "2018-01-16T23:14:40.003+02:00", "highlightTitle": ""}