{"organizations": [], "uuid": "cab966bfac1fd76018a7a825081a24e072f4a9a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974198-GettyImages-887872388_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/italy-election-could-mean-a-collision-with-the-rest-of-europe.html", "country": "US", "domain_rank": 767, "title": "Italy election could mean a collision with the rest of Europe", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.22, "site_type": "news", "published": "2018-01-30T08:25:00.000+02:00", "replies_count": 0, "uuid": "cab966bfac1fd76018a7a825081a24e072f4a9a7"}, "author": "Joumanna Bercetche", "url": "https://www.cnbc.com/2018/01/30/italy-election-could-mean-a-collision-with-the-rest-of-europe.html", "ord_in_thread": 0, "title": "Italy election could mean a collision with the rest of Europe", "locations": [], "entities": {"persons": [{"name": "stefano montesi", "sentiment": "negative"}, {"name": "matteo salvini", "sentiment": "none"}, {"name": "silvio berlusconi", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "five star movement", "sentiment": "none"}], "organizations": [{"name": "corbis", "sentiment": "negative"}, {"name": "forza italia", "sentiment": "none"}, {"name": "northern league", "sentiment": "none"}, {"name": "brothers of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In about six weeks' time, two of Europe's largest economies are likely to have no-one in charge.\nWith German coalition talks hitting a stumbling block of their own and unlikely to reach a conclusion before Easter, the other hurdle is Italian elections on March 4.\nWhile the anti-establishment party, the Five Star Movement, is in the lead on an individual party basis, the last few months have seen a strong push in favor of the center-right bloc. This is formed of ex-Prime Minister Silvio Berlusconi 's Forza Italia, the more right-wing Northern League party led by an outspoken Matteo Salvini, and the Brothers of Italy, a nationalist party.\nThese three together are polling around 37 percent of the votes, just shy of the 40 percent target needed to gain extra seats in parliament and ensuring an absolute majority.\nshow chapters Populist anti-EU position will not prevail in Italy, says Prime Minister Gentiloni 3:41 AM ET Wed, 24 Jan 2018 | 04:10 There is therefore two likely outcomes. Firstly, the center-right bloc could gain a majority. Citi economist Giada Giani sees this outcome as a short-term market positive, but a long-term negative due to the Northern League's anti-EU stance and the bloc's agenda of pursuing looser fiscal policy.\nThe other likely alternative is one which sees the Five Star Movement led by Luigi Di Maio enter into alliances either with the splintered left or with the Northern League. Both are populists parties and have built their agendas on Euroskeptic policies. This may provide a real shock to markets as it could set Italy on a collision course with the rest of Europe.\nOpen Europe analyst Enea Desideri told CNBC, however, that he thinks the latter option is unlikely to materialize due to reservations from members within both political parties. This is particularly prevalent within the Five Star Movement which is split between the \"pragmatists\" and the \"orthodox\" figures — the latter could threaten to desert the party if the tie-up does happen.\nshow chapters Italy’s M5S split between pragmatists and orthodox figures: Analyst 4:04 AM ET Mon, 29 Jan 2018 | 04:05 As we saw with German elections, investors are not exhibiting any signs of nervousness just yet. The election comes at a brighter period for Italy: Growth is back to 1.5 percent, the rating agency Standard & Poor's upgraded its rating by one notch back in October, while gross non-performing loans in the banking sector continue to decline (though this can be partially attributed to the cyclical recovery).\nPerhaps the bigger issue is the fact that none of the major parties are pushing for reforms and almost all of them are inclined toward looser fiscal policy.\nNeil Dwane, the chief investment officer at Allianz Equity Europe, agrees that while the risk to markets is not acute, the tragedy is that Europe currently has a window to fix the roof when the sun is shining. With Italy on the verge of another hung parliament, any efforts to reform will be set back again and Europe would have lost yet another opportunity to solve long-standing issues such as the health of the banking system and its debt overhang.", "external_links": [], "published": "2018-01-30T08:25:00.000+02:00", "crawled": "2018-01-30T08:25:32.002+02:00", "highlightTitle": ""}