{"organizations": [], "uuid": "d146a44b8c55b98be3edb3c7ddfbf251abd937b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-jane-gerhard-joins-cowenas-management-committee.html", "country": "US", "domain_rank": 767, "title": "Jane Gerhard Joins Cowen’s Management Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-22T17:34:00.000+02:00", "replies_count": 0, "uuid": "d146a44b8c55b98be3edb3c7ddfbf251abd937b4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-jane-gerhard-joins-cowenas-management-committee.html", "ord_in_thread": 0, "title": "Jane Gerhard Joins Cowen’s Management Committee", "locations": [], "entities": {"persons": [{"name": "jane gerhard", "sentiment": "negative"}, {"name": "jeffrey m. solomon", "sentiment": "none"}, {"name": "jane", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "cowen inc.", "sentiment": "negative"}, {"name": "cowen’s management committee", "sentiment": "neutral"}, {"name": "cowen", "sentiment": "none"}, {"name": "head of human resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Cowen Inc. (NASDAQ:COWN) (“Cowen” or the “Company”) today announced that Jane Gerhard, Cowen Managing Director and Head of Human Resources, has joined Cowen’s Management Committee. Established in 2017, Cowen’s Management Committee is comprised of senior executives from across the organization and is responsible for the development and execution of Cowen’s long-term strategy.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006018/en/\nJane Gerhard, Cowen Managing Director and Head of Human Resources (Photo: Business Wire)\n“Jane has been a key contributor to Cowen’s team for a long time and has played an integral role in the success of Cowen’s strategic acquisitions and initiatives,” said Jeffrey M. Solomon, Cowen Chief Executive Officer. “As a financial services organization, our most valuable asset is our people. Jane’s proven leadership, as well as her collaborative, creative and innovative spirit are an essential part our ability to attract, develop and retain world class talent. As a member of Cowen’s Management Committee, Jane is joining a very strong and skilled team of leaders who will continue to guide Cowen’s growth into the future.”\nCowen’s Management Committee, which reports to Mr. Solomon, is comprised of the following Cowen executives:\nDan Charney, Co-President, Cowen and Company Robert Fagin, Director of Research, Cowen and Company Fred Fraenkel, Head, Cowen Investment Management Jane Gerhard, Head of Human Resources, Cowen Inc. John Holmes, Chief Operating Officer, Cowen Inc. Stephen Lasota, Chief Financial Officer, Cowen Inc. Owen Littman, General Counsel, Cowen Inc. Tom Strauss, Chairman, Cowen Investment Management Larry Wieseneck, Co-President, Cowen and Company\nBiography:\nJane Gerhard currently serves as Managing Director and Head of Human Resources at Cowen. Ms. Gerhard was promoted to her current position following the 2009 merger between Cowen and Ramius. Prior to joining Ramius in 2004, Ms. Gerhard was Director of Human Resources at FutureBrand, a brand consulting firm owned by Interpublic Group. She has spent the largest part of her career in senior human resources positions at BMO/Harris Nesbitt, Daiwa Bank and Lloyds Bank. Ms. Gerhard has a Bachelor’s degree in Environmental Studies from Stockton University and is a board member of Msterio, a 501(c)(3) organization that connects children globally through the act of giving.\nAbout Cowen Inc.\nCowen Inc. is a diversified financial services firm and, together with its consolidated subsidiaries, provides alternative asset management, investment banking, research, sales and trading, prime brokerage, global clearing and commission management through its two business segments: Cowen Investment Management and its affiliates make up the Company’s alternative investment segment, while Cowen and Company, a member of FINRA and SIPC, and its affiliates make up the Company’s broker-dealer segment. Cowen Investment Management provides alternative asset management solutions to a global client base and manages a significant portion of Cowen’s proprietary capital. Cowen and Company and its affiliates offer industry focused investment banking for growth-oriented companies, domain knowledge-driven research, a sales and trading platform for institutional investors and a comprehensive suite of prime brokerage services. Founded in 1918, the firm is headquartered in New York and has offices worldwide. For additional information, visit www.cowen.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006018/en/\nMedia:\nCowen\nLynda Caravello, 646-562-1676\nlynda.caravello@cowen.com\nor\nGagnier Communications\nDan Gagnier, 646-569-5897\ndg@gagnierfc.com\nSource: Cowen Inc.", "external_links": ["http://www.businesswire.com/news/home/20180122006018/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cowen.com&esheet=51746698&newsitemid=20180122006018&lan=en-US&anchor=www.cowen.com&index=1&md5=b3069d50153b122c5f9572f455d93084"], "published": "2018-01-22T17:34:00.000+02:00", "crawled": "2018-01-22T20:24:50.008+02:00", "highlightTitle": ""}