{"organizations": [], "uuid": "4343d72aa2a4c32a7545c11eb0777837923b97c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928462-AP_18004607482659.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/stunning-images-of-the-bomb-cyclone.html", "country": "US", "domain_rank": 767, "title": "Stunning images of the 'bomb cyclone'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.212, "site_type": "news", "published": "2018-01-04T22:27:00.000+02:00", "replies_count": 0, "uuid": "4343d72aa2a4c32a7545c11eb0777837923b97c3"}, "author": "Adam Jeffery", "url": "https://www.cnbc.com/2018/01/04/stunning-images-of-the-bomb-cyclone.html", "ord_in_thread": 0, "title": "Stunning images of the 'bomb cyclone'", "locations": [], "entities": {"persons": [{"name": "matt rourke", "sentiment": "negative"}, {"name": "adam jeffery", "sentiment": "negative"}], "locations": [{"name": "atlantic city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "eastern seaboard", "sentiment": "none"}, {"name": "asbury park  sever", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stunning images of the 'bomb cyclone' Matt Rourke | AP Adam Jeffery | @ajefferyphoto 1 Hour Ago \nAfter a week of bone-chilling temperatures across much of the United States, a massive winter storm pounded the Eastern Seaboard today from Maine all the way down through Florida. \nThe storm, known as a bombogenesis storm or \"bomb cyclone,\" caused many states to declare a state of emergency, closing schools and nonessential government services. \nEmergency snow crews struggled to keep up with the blizzard conditions, which have hit the Northeast hardest, causing thousands of flight cancellations and delays in rail service and other public transportation. \nSnow days have been declared across the region, with millions of children getting a chance to enjoy the first snowstorm of 2018. \nFollowing are some of the stunning images from the storm. \nAbove: A pedestrian pushes his way through driving snow in Atlantic City, New Jersey. View from above \nA satellite image of the bomb cyclone, shaped like a comma, from the new GOESeast satellite. Source: GOESeast Stuck in the snow in Asbury Park \nSeveral men help a motorist after his vehicle was stuck in the snow near the boardwalk in Asbury Park, New Jersey. Julio Cortez | AP \nA jogger crosses the Brooklyn Bridge during the snowstorm in New York. Getty Images Armed and ready \nWorkers carry shovels while crossing a street near Union Square during the snowstorm in New York. Getty Images Picking up supplies \nShoppers brave the snow to stock up on items at a grocery store in Methuen, Massachusetts. Getty Images Underground snow \nMorning commuters walk down a New York subway platform covered in snow that drifted in from street level grates. Getty Images \nPeople ride snowmobiles on Medford Avenue in Medford, New York. Getty Images Attacking the storm old-school \nA man uses a tennis racket to clear his truck of snow in Atlantic City, New Jersey. Getty Images A rare sight in Savannah \nA snowman in Savannah, Georgia, was given hair of Spanish moss. Getty Images Winter fun in the South \nA woman uses a bodyboard to slide down a hill she made out of snow in Savannah, Georgia. Stephen B. Morton | AP \nA city worker removes snow from under a bus in New Haven, Connecticut. Getty Images Grab a shovel — you are going to need it \nA worker reaches for a snow shovel at a Home Depot store in Boston, Massachusetts. Adam Glanzman | Bloomberg | Getty Images A lonely commute \nA commuter waits outside a Metro-North train station in Greenwich, Connecticut. Timothy A. Clary | AFP | Getty Images Airports under siege \nCrews clear snow from around the gates at Logan International Airport in Boston, Massachusetts. Brian Snyder | Reuters Mountains of salt \nRows of trucks pick up salt at the Eastern Salt Company in Chelsea, Massachusetts, the day before the storm. Getty Images Facing the storm in style \nA man wearing ski goggles walks across the Brooklyn Bridge in New York. Angela Weiss | AFP | Getty Images", "external_links": [], "published": "2018-01-04T22:27:00.000+02:00", "crawled": "2018-01-04T22:40:21.009+02:00", "highlightTitle": ""}