{"organizations": [], "uuid": "cf9e92cb3649ddfd84114125473707cad949ae54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219709126&w=1200&r=LYNXMPEE041AV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-inter/simeone-foils-inter-with-last-gasp-equaliser-idUKKBN1EU25I", "country": "US", "domain_rank": 408, "title": "Simeone foils Inter with last-gasp equaliser", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:46:00.000+02:00", "replies_count": 0, "uuid": "cf9e92cb3649ddfd84114125473707cad949ae54"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-inter/simeone-foils-inter-with-last-gasp-equaliser-idUKKBN1EU25I", "ord_in_thread": 0, "title": "Simeone foils Inter with last-gasp equaliser", "locations": [], "entities": {"persons": [{"name": "simeone", "sentiment": "negative"}, {"name": "giovanni simeone", "sentiment": "none"}, {"name": "diego", "sentiment": "none"}, {"name": "stadio artemio franchi", "sentiment": "none"}, {"name": "mauro icardi", "sentiment": "none"}], "locations": [{"name": "florence", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "napoli", "sentiment": "none"}, {"name": "verona", "sentiment": "none"}], "organizations": [{"name": "inter", "sentiment": "negative"}, {"name": "juventus", "sentiment": "none"}, {"name": "min read  milan", "sentiment": "none"}, {"name": "cagliari", "sentiment": "none"}, {"name": "garofalo  inter", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "fiorentina", "sentiment": "none"}, {"name": "napoli", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 10:50 PM / Updated 8 minutes ago Simeone foils Inter with last-gasp equaliser Reuters Staff 3 Min Read \nMILAN (Reuters) - Inter Milan’s frustrating Serie A run continued on Friday when they were held to a 1-1 draw at Fiorentina by a last-gasp equaliser from Giovanni Simeone. Soccer Football - Serie A - Fiorentina vs Inter Milan - Stadio Artemio Franchi, Florence, Italy - January 5, 2018 Fiorentina's Giovanni Simeone scores their first goal REUTERS/Alessandro Garofalo \nInter went ahead in the 55th minute with a goal from their leading scorer Mauro Icardi, his 18th in Serie A this season, only for Simeone, son of Atletico Madrid coach Diego, to snatch a deserved point for Fiorentina in the 90th minute. \nThird-placed Inter were left on 42 points, six behind leaders Napoli and five adrift of second-placed Juventus, after extending their winless run in the league to five matches. \nNapoli host lowly Verona on Saturday while Juventus visit Cagliari. \nSeventh-placed Fiorentina should have been out of sight by halftime but wasted numerous promising counter-attacks. \nSimeone was close in the second minute and Cyril Thereau squandered two chances when he fired both attempts over the bar from free positions. \nInter survived more scares after the break before going ahead, Icardi reacting incredibly quickly to score at the second attempt after his bullet header was parried by Marco Sportiello. Soccer Football - Serie A - Fiorentina vs Inter Milan - Stadio Artemio Franchi, Florence, Italy - January 5, 2018 Fiorentina's Giovanni Simeone celebrates scoring their first goal REUTERS/Alessandro Garofalo \nInter goalkeeper Samir Handanovic saved Federico Chiesa’s deflected shot with his leg and tipped over an overhead kick by Khouma Babacar. \nHowever, the Slovenian was powerless when Simeone fired home from close range after being set up by a short pass from quick-thinking substitute Valentin Eysseric inside the area. Slideshow (2 Images) \nChievo had a goal chalked off by the video replay system (VAR) as they were held 1-1 at home by Udinese in the evening’s other match. \nIvan Radovanovic fired Chievo ahead after nine minutes and the Flying Donkeys thought they had gone two goals ahead shortly afterwards. \nFabrizio Cacciatore headed in at the near post, Chievo celebrated and Udinese, who made no protest over the goal, were ready to re-start when the referee signalled a replay by drawing a television image in the air. \nAfter a lengthy delay, the goal was disallowed for offside against Cacciatore. \nThere was further frustration for Chievo as Nenad Tomovic turned the ball into his own net four minutes before halftime. Writing by Brian Homewood in Bern, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-06T00:46:00.000+02:00", "crawled": "2018-01-06T01:03:07.000+02:00", "highlightTitle": ""}