{"organizations": [], "uuid": "0cf9be14d6e3a4f622e437b6a5ac066b954469c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-slip-slightly-on-wall-street-pause-nz-little-changed-idUSL3N1PE162", "country": "US", "domain_rank": 408, "title": "Australian shares slip slightly on Wall Street pause; NZ little changed", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T03:51:00.000+02:00", "replies_count": 0, "uuid": "0cf9be14d6e3a4f622e437b6a5ac066b954469c7"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-slip-slightly-on-wall-street-pause-nz-little-changed-idUSL3N1PE162", "ord_in_thread": 0, "title": "Australian shares slip slightly on Wall Street pause; NZ little changed", "locations": [], "entities": {"persons": [{"name": "christina martin", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Australia shares on track to end week lower\n* Weak gold prices drag material stocks down\n* New Zealand shares little changed by weak manufacturing data\nBy Christina Martin\nJan 19 (Reuters) - Australian shares inched down on Friday, following Wall Street which took a breather after a stretch of record highs, while gains in healthcare and consumer staples stocks kept the index afloat.\nWall Street fell on Thursday after a run of strong performances from the Dow Jones Industrial Average and the S&P 500 index.\nAustralia’s S&P/ASX 200 index inched down 0.1 percent, or 5.4 points, to 6009.2 by 0113 GMT, on track to mark its second weekly loss. The benchmark ended flat in the previous session.\nThe materials sector was the biggest drag on the index, weighed down by gold stocks, which slipped for a fourth straight session, down as much as 1.5 percent.\nWhile base metal prices were up on an upbeat performance from China’s industrial sector, gold prices were flat in a narrow range and under pressure from higher U.S. Treasury yields.\nNewcrest Mining Ltd lost as much as 2.2 percent and hit its lowest in more than three weeks, while fellow gold miner Saracen Mineral Holdings Ltd touched its lowest in more than five weeks, falling as much as 3.9 percent.\nOutput at BHP Billiton PLC’s Escondida mine in Chile, the largest copper mine in the world, fell 7.8 percent in 2017 versus the prior year because of a prolonged strike.\nRio Tinto also has a stake in the mine. BHP was flat, while Rio fell as much as 0.8 percent to the lowest in more than a week.\nReal estate stocks also pulled the benchmark index down, with Gateway Lifestyle Group sliding as much as 2.9 percent and Iron Mountain Inc hitting its lowest in more than five months, sliding by as much as 2.7 percent.\nU.S. home building fell more than expected in December, recording the biggest drop in just over a year, but the steep drop in groundbreaking activity will probably be temporary against the backdrop of a tightening labour market.\nFinancial stocks slipped, with three of the ‘Big Four’ banks losing between 0.2 percent and 0.4 percent. Commonwealth Bank of Australia inched up 0.2 percent.\nHealthcare stocks and consumer staples kept the index afloat.\nCSL Ltd added as much as 1.5 percent, hitting its highest in more than six weeks, while Wesfarmers Ltd rose as much as 1 percent.\n“We had a negative Wall Street, a soft commodity complex, but this may be counterbalanced by a nice set of China GDP numbers and December Aussie labour market numbers yesterday,” said Emmanuel Ng, FX strategist at Oversea-Chinese Banking Corporation Ltd.\n“In addition, global risk appetite remains in risk-on territory. Overall, interest towards cyclicals look to remain intact.”\nChina’s gross domestic product grew 6.8 percent in fourth-quarter 2017 from a year earlier.\nAustralian job growth in December topped expectations to match the longest run of monthly gains on record, yet unemployment still edged up as more people looked for work -putting an unwelcome brake on wages and inflation.\nNew Zealand’s benchmark S&P/NZX 50 index also traded flat, slightly dipping at 0.023 percent, or 1.93 points to 8274.6, but was on track to end the week higher.\nMarkets remained little changed after a survey showed manufacturing activity in New Zealand grew in December at its slowest pace in five years.\nMaterial and telecom shares pulled on the index but were offset by industrials and healthcare stocks.\nReporting by Christina Martin in Bengaluru; Editing by Eric Meijer\n ", "external_links": [], "published": "2018-01-19T03:51:00.000+02:00", "crawled": "2018-01-19T04:12:13.005+02:00", "highlightTitle": ""}