{"organizations": [], "uuid": "f2a1e1bca88d9d12c3601f63b24737a1e1d70bd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-progressive-care-continues-to-break-records-with-over-20-million-in-sales.html", "country": "US", "domain_rank": 767, "title": "Progressive Care Continues to Break Records with Over $20 Million in Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-10T16:31:00.000+02:00", "replies_count": 0, "uuid": "f2a1e1bca88d9d12c3601f63b24737a1e1d70bd7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-progressive-care-continues-to-break-records-with-over-20-million-in-sales.html", "ord_in_thread": 0, "title": "Progressive Care Continues to Break Records with Over $20 Million in Sales", "locations": [], "entities": {"persons": [], "locations": [{"name": "sales miami", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}], "organizations": [{"name": "progressive care continues to break records", "sentiment": "negative"}, {"name": "progressive care inc.", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "mtm", "sentiment": "none"}, {"name": "ehr implementation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 10, 2018 (GLOBE NEWSWIRE) -- Progressive Care Inc. (OTCQB:RXMD), through its subsidiary PharmCo, LLC, is a South Florida health services organization and provider of prescription pharmaceuticals, compounded medications, the sale of anti-retroviral medications, medication therapy management (MTM), the supply of prescription medications to long term care facilities, administration and practice management, utilization management, quality assurance, EHR Implementation, billing and coding, and health practice risk management, announces over $20 million in net revenues on approximately 225,000 prescriptions filled in 2017.\nPharmCo, LLC filled over 19,500 prescriptions during the month of December, generating approximately $1.6 million in net revenues. Prescriptions filled increased by approximately 8% over the same month last year. The company also filled over $360,000 (not included in net revenues) worth of prescriptions for 340B entities in December, generating fees to the pharmacy of over $15,000.\nThe company has been successful in breaking records in 2017. The company announced over $20 million in net revenues, an 11% increase over 2016. The company is expecting to achieve increased growth through 2018 as well as continued reporting of strong operational and financial performance. These all-time high sales figures indicate a positive outlook for the company into the coming year.\nDuring the Earnings Call held on November 14, 2017, S. Parikh Mars (CEO), discussed avenues of expansion and advancement for the company during the coming year. In addition to record breaking sales, the company has been successful in its efforts to upgrade its OTCMarkets listing tier to OTCQB. The sales reported are recognized from diversified revenue streams and ongoing development of the Company’s portfolio of healthcare services. Innovation is also a factor as the company launched numerous new and exciting programs in 2017, such as its tele-pharmacy platform.\n“2017 was a year of accomplishment and we are proud of all that this company has achieved,” stated S. Parikh Mars, CEO. \"Reaching $20 million in sales was a challenge this year given the ever changing climate in the healthcare industry. However, we have elevated our level of service and secured our footing for continued growth and expansion in 2018. We now embark on a new set of ambitious goals for the year. Our hard work and dedication will continue to drive us as we prepare for many possible and exciting outcomes.”\nAbout Progressive Care\nProgressive Care Inc. (OTCQB:RXMD), through its subsidiary PharmCo, LLC, is a South Florida health services organization and provider of prescription pharmaceuticals, compounded medications, the sale of anti-retroviral medications, medication therapy management (MTM), the supply of prescription medications to long term care facilities, administration and practice management, utilization management, quality assurance, EHR Implementation, billing and coding, and health practice risk management.\nCautionary Statement Regarding Forward Looking Statements\nStatements contained herein that are not based upon current or historical fact are forward-looking in nature and constitute forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such forward-looking statements reflect the Company’s expectations about its future operating results, performance and opportunities that involve substantial risks and uncertainties. These statements include but are not limited to statements regarding the intended terms of the offering, closing of the offering and use of any proceeds from the offering. When used herein, the words “anticipate,” “believe,” “estimate,” “upcoming,” “plan,” “target,” “intend” and “expect” and similar expressions, as they relate to Progressive Care Inc., its subsidiaries, or its management, are intended to identify such forward-looking statements. These forward-looking statements are based on information currently available to the Company and are subject to a number of risks, uncertainties, and other factors that could cause the Company's actual results, performance, prospects, and opportunities to differ materially from those expressed in, or implied by, these forward-looking statements.\nContact Armen Karapetyan Senior Advisor Business Development armen@progressivecareus.com\nSource:Progressive Care, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/94a120ca-b33e-4c08-8552-f3df31b4bb57"], "published": "2018-01-10T16:31:00.000+02:00", "crawled": "2018-01-10T18:37:31.016+02:00", "highlightTitle": ""}