{"organizations": [], "uuid": "5e47db90ddf41461d73d3699bac80520dcd6307b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/safrica-economy/south-african-mining-seen-a-winner-as-ramaphosa-woos-investors-idUSL8N1PJ4EN", "country": "US", "domain_rank": 408, "title": "South African mining seen a winner as Ramaphosa woos investors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:07:00.000+02:00", "replies_count": 0, "uuid": "5e47db90ddf41461d73d3699bac80520dcd6307b"}, "author": "", "url": "https://www.reuters.com/article/safrica-economy/south-african-mining-seen-a-winner-as-ramaphosa-woos-investors-idUSL8N1PJ4EN", "ord_in_thread": 0, "title": "South African mining seen a winner as Ramaphosa woos investors", "locations": [], "entities": {"persons": [{"name": "ramaphosa", "sentiment": "negative"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "olivia kumwenda-mtambo", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "anc", "sentiment": "none"}, {"name": "unctad", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 11 PM / in 8 minutes South African mining seen a winner as Ramaphosa woos investors Reuters Staff \n* Policy uncertainty in mining hampering investment \n* New ANC leader Ramaphosa has promised change \n* Reform talk has lifted rand, government bonds \nBy Olivia Kumwenda-Mtambo \nJOHANNESBURG, Jan 26 (Reuters) - South Africa’s embattled mining industry could be first in line to benefit from a boost in foreign direct investment (FDI) if the new leader of the ruling party Cyril Ramaphosa implements measures seen as vital to draw in more cash, analysts said. \nThe governing African National Congress (ANC) needs to water down black ownership targets in mining, roll out mobile broadband access and cut red tape in the labour market to revive investor interest, they say. \nSouth Africa has failed in recent years to attract significant direct investment due to slow economic growth, policy uncertainty and higher labour costs. \nSouth Africa recorded FDI inflows of $2.3 billion in 2016 against outflows of $3.4 billion, U.N. trade and development agency UNCTAD data show. A decade ago, it had average annual inflows of $4.5 billion against outflows of $3.3 billion. \nThe agency said on Monday South Africa’s FDI “still remained low by historical standards” in 2017 at $3.2 billion. \nRamaphosa, South Africa’s vice president who succeeded President Jacob Zuma as head of the ANC in December, has promised to deliver economic policy change. \n“Mining is definitely one area where we could do more to attract foreign investments. We have a lot of potential,” Old Mutual Multi-Managers investment strategist Izak Odendaal said. \nInvestors in particular want Ramaphosa to end an impasse over the Mining Charter, introduced as part of a wider drive designed to rectify the lingering disparities of apartheid. \nA revised charter drawn up under Zuma raised the target for black ownership in mining to 30 percent from 26 percent, a level being challenged in court by the industry. \nChanges to the Mineral and Petroleum Resources Development Act, yet to be passed by parliament, have added to uncertainty. \nAmendments include a move to give the state a 20 percent stake in any new gas and oil ventures, a level the industry said was too high to encourage investment. \nSouth Africa attracts more short-term portfolio flows than FDI, while local firms have tended to expand operations abroad. \nRamaphosa said at the Davos global forum that “if the Mining Charter is holding us back we must deal with that” and said South Africa did not want to miss out on a commodity boom. \nFinancial markets have cheered talk of economic reform. The rand has surged to 2-1/2 year highs against the dollar and bond yields have fallen. \n“RIPE FOR REFORM” \nMining firms are also encouraged. Anglo American said it was looking forward to engaging with the ANC leadership to build a competitive industry to attract investment. \nHarmony Gold said it was committed to South Africa and welcomed efforts to boost investor confidence. \n“The embattled mining industry is one of the lower hanging fruit which is ripe for reform, with the need to urgently address the policy uncertainty,” BNP Paribas South Africa economist Jeff Schultz said. \nHe said the investor mood would improve further if Zuma left the presidency early - a subject of persistent speculation after a series of scandals during his tenure - and if cabinet was reshuffled to shake up the mineral resources, public enterprises, energy and telecommunications departments. \n“Should the (reforms) be prioritised before the end of first quarter 2018, a slow and steady return of FDI and gross domestic fixed investment growth is possible,” Schultz said. \nAnalysts say South Africa’s telecoms industry, where the government plans to establish a Wireless Open Access Network to roll out mobile broadband access to the majority of the population, was another area that could attract FDI. \nPrivatisation of some state-owned firms, which economists say drain the public purse, could also draw foreign investors. \n“If you look at our state-owned enterprises, specifically power utility Eskom and South African Airways, there is an opportunity to sell a portion of those to foreign investors,” Odendaal said. \nBut Ramaphosa faces challenges in his bid to deliver change. \nThe former union leader, is likely to encounter resistance from former colleagues, particularly those in the COSATU labour union who backed his bid to lead the ANC, if he tries to shake up the labour market, which is prone to strikes. \n“He faces elections next year and will need to show he can turn around the decline in ANC’s popularity,” said Manik Narain, a strategist at UBS in London. \nThe ANC still dominates the political landscape, as it has since the end of the apartheid in 1994, but its popularity has been hit by a failure to fulfill expectations that it would transform the lives of the country’s poor. Additional reporting by Tanisha Heiberg in Johannesburg, Sujata Rao in London and Alexis Akwagyiram in Davos; Editing by Edmund Blair", "external_links": [], "published": "2018-01-26T14:07:00.000+02:00", "crawled": "2018-01-26T14:21:32.040+02:00", "highlightTitle": ""}