{"organizations": [], "uuid": "6dcb23af79d73523106848390ba00a4f0a611718", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223561161&w=1200&r=LYNXMPEE0J053", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-osaka/tennis-osaka-ends-local-challenge-with-barty-beating-idUSKBN1F908A", "country": "US", "domain_rank": 408, "title": "Tennis: Osaka ends local challenge with Barty beating", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T09:53:00.000+02:00", "replies_count": 0, "uuid": "6dcb23af79d73523106848390ba00a4f0a611718"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-osaka/tennis-osaka-ends-local-challenge-with-barty-beating-idUSKBN1F908A", "ord_in_thread": 0, "title": "Tennis: Osaka ends local challenge with Barty beating", "locations": [], "entities": {"persons": [{"name": "barty", "sentiment": "negative"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "ashleigh barty", "sentiment": "none"}, {"name": "naomi osaka", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "osaka", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 7:54 AM / Updated 13 minutes ago Osaka ends local challenge with Barty beating Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - A smiling Naomi Osaka overpowered Ashleigh Barty 6-4 6-2 to reach the fourth round of a grand slam for the first time and end the host nation’s involvement in the women’s draw at the Australian Open on Saturday. \nBarty’s quantum leap from the outside the top 200 to number 17 in the world rankings over the last year had awakened hopes in Australia that the former cricketer might be a contender to end their 40-year wait for a women’s champion. \nThe Japanese world number 72 shredded those hopes in one minute more than her ranking, breaking Barty to open both sets and combining 12 aces, the last on match point, with 24 winners in a ruthless display of power tennis. \nWith a beaming smile on her face even when things were not going her way, Osaka appeared to enjoy every moment of the encounter in front of a partisan and noisy crowd on Margaret Court Arena. \n“I feel really happy, but also kind of sorry because I know you guys really wanted her to win,” Osaka said on court. “I’ve always wanted to play against an Australian player, because on TV it seems really cool.” \nBarty was not completely blown away but even though she was frequently able to win points on Osaka’s serve, the 20-year-old, who said she had spent the close season working on fitness and her mindset, always appeared to have an answer. Tennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 20, 2018. Ashleigh Barty of Australia hits a shot against Naomi Osaka of Japan. REUTERS/Issei Kato \n“I think I was down on my serve love-30, like, every few games,” Osaka said. “Normally, you would think the game is basically over a little bit, and get really upset. But I tried to think positive and stuff.” \nThe Australian battled right until the end but Osaka produced four huge shots in a row to win the match and set up a fourth round meeting with world number one Simona Halep for a place in the quarter-finals. Slideshow (3 Images) \nOsaka, who beat defending champion Angelique Kerber at last year’s U.S. Open, joked that she sweated more over Halep’s epic struggle to subdue Lauren Davies than she had her own match and did not sound overawed to be meeting the top seed. \n“I’ve played her twice, and both times it was three sets. I had fun both times,” she said. \n”I feel like I learned a lot. I feel playing the number one is really an honour. No matter what happens, I’ll try my best. I’ll just see what happens from there. \n“I‘m grateful (to be in the fourth round),” she added. “But I‘m, like, I don’t want to stop here, if you know what I mean.” Reporting by Nick Mulvenney in Sydney; Editing by John O'Brien", "external_links": [], "published": "2018-01-20T09:53:00.000+02:00", "crawled": "2018-01-20T10:15:17.001+02:00", "highlightTitle": ""}