{"organizations": [], "uuid": "7dedda5e46c86456d1d5bc9a746df4e4bb5d3529", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-missouri-governor/missouri-governor-admits-to-extramarital-affair-before-taking-office-idUSKBN1F026V", "country": "US", "domain_rank": 408, "title": "Missouri governor admits to extramarital affair before taking office", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:32:00.000+02:00", "replies_count": 0, "uuid": "7dedda5e46c86456d1d5bc9a746df4e4bb5d3529"}, "author": "", "url": "https://www.reuters.com/article/us-missouri-governor/missouri-governor-admits-to-extramarital-affair-before-taking-office-idUSKBN1F026V", "ord_in_thread": 0, "title": "Missouri governor admits to extramarital affair before taking office", "locations": [], "entities": {"persons": [{"name": "eric greitens", "sentiment": "none"}, {"name": "sheena", "sentiment": "none"}, {"name": "greitens", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "navy", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "kmov-tv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Missouri Governor Eric Greitens said he had an extramarital affair with a woman before his election in November 2016 but denied a local television report that he tried to blackmail her to keep their relationship a secret. \nThe fast-moving turn of events prompted a Republican state senator on Thursday to circulate a letter among his 33 colleagues from both parties asking Missouri Attorney General Josh Hawley to investigate the blackmail allegation. \n“The seriousness of this allegation and the implications it will have on the integrity of our state government are deeply disturbing,” said the letter, written by Senator Doug Libla. \nThe admission late on Wednesday by Greitens, also a Republican, followed a report by a St. Louis television station that included a recording of a woman confessing to a sexual encounter with him to her now ex-husband. \nGreitens, 43, said in a joint statement with his wife, Sheena, that “there was a time” before he became governor when he was “unfaithful in our marriage,” and his wife had forgiven him. \n“This was a deeply personal mistake,” the couple posted on Twitter. “Eric took responsibility, and we dealt with this together honestly and privately.” \nGreitens’ lawyer, James Bennett of St. Louis, denied the governor threatened to blackmail the woman. \n“There was no ‘blackmail,’ and that claim is false,” Bennett said in a statement posted to Greitens’ Twitter account. “This personal matter has been addressed by the governor and Mrs. Greitens privately years ago when it happened.” \nEven before Libla circulated his letter, the Senate’s two top Democrats had called for an investigation into the blackmail allegation. \n“People accused of these egregious acts do not get to waive off the scrutiny of law enforcement simply because they are in a position of power,” Senate Minority Floor Leader Gina Walsh and Assistant Minority Floor Leader Senate Kiki Curls said in a joint statement. \nGreitens, a former Navy SEAL, described himself as a “very proud husband and father” during his campaign and often included his wife and two small children in his television ads. \nKMOV-TV in St. Louis aired a recording late on Wednesday of the unidentified woman with whom Greitens admitted having the affair as she confessed the March 2015 encounter to her then-husband. \nKMOV did not identify the woman or her husband in the recording, which it said was made just days after the encounter, but said the two were no longer married. The woman, who said she knew Greitens because she cut his hair, later emailed him to ask that he stop using her salon, KMOV said. \nIn the recording, the woman also told her husband that Greitens had taken a picture of her while naked and threatened to publicize it if she ever told anyone of their affair. \nReporting by Peter Szekely in New York; Editing by Lisa Von Ahn\n ", "external_links": [], "published": "2018-01-11T18:32:00.000+02:00", "crawled": "2018-01-11T18:47:51.016+02:00", "highlightTitle": ""}