{"organizations": [], "uuid": "1f11c80b42d03cf0142187f3012b6d5b9c58c687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/wells-fargo-results/update-1-wells-fargo-profit-boosted-by-one-time-tax-benefit-idUSL4N1P749F", "country": "US", "domain_rank": 408, "title": "UPDATE 5-Wells Fargo sees no end yet to sales scandal costs, gets tax boost", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:27:00.000+02:00", "replies_count": 0, "uuid": "1f11c80b42d03cf0142187f3012b6d5b9c58c687"}, "author": "", "url": "https://www.reuters.com/article/wells-fargo-results/update-1-wells-fargo-profit-boosted-by-one-time-tax-benefit-idUSL4N1P749F", "ord_in_thread": 0, "title": "UPDATE 5-Wells Fargo sees no end yet to sales scandal costs, gets tax boost", "locations": [], "entities": {"persons": [{"name": "fargo", "sentiment": "negative"}, {"name": "meredith mazzilli", "sentiment": "none"}, {"name": "tim sloan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "wells fargo & co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details from CFO interview, updates share price)\nBy Meredith Mazzilli\nNEW YORK, Jan 12 (Reuters) - Wells Fargo & Co is not certain it has fully uncovered and fixed all problems related to a long-running sales scandal that has hurt the bank’s reputation and sideswiped its efforts to cut costs, Chief Executive Tim Sloan said on Friday.\nThe third-largest U.S. bank by assets set aside a $3.25 billion reserve to cover litigation related to fake accounts and other customer issues in its fourth-quarter earnings on Friday.\nThe San Francisco-based company has been working to get to the bottom of its problems for more than a year, after reaching a $190 million settlement with regulators in September 2016 for employees creating phony bank and credit card accounts in customers’ names without their permission.\nSince then, it has discovered other problems in businesses ranging from mortgages to foreign exchange trading, while the number of possibly made-up accounts swelled to 3.5 million.\nWells Fargo has tried to rectify the situation by changing how employees get paid, improving corporate reporting structures and ousting several executives. Sloan’s predecessor, John Stumpf, abruptly retired after the scandal came to light.\nHowever, the bank is still scouring businesses for evidence of bad behavior, a process that will continue indefinitely, Sloan said on a conference call in response to an analyst who asked repeatedly why management could not give assurances that problems were resolved.\n“I’d love to live in a world where I could give you an absolute guarantee and certainty, but it’s not just the world we live in,” Sloan said.\nHe later added: “We’re never going to declare victory.”\nShares of the bank were down 1 percent at $62.40 on Friday afternoon.\nDespite that uncertainty, a new target management unveiled signaled that Wells Fargo’s effort to control costs are gaining traction.\nThe bank expects to spend up to $54.5 billion this year, in line with what analysts had generally expected. However, the $58.5 billion in expenses it reported for 2017 were well above the $54.62 billion non-interest expense analysts had predicted, on average.\nWall Street Wells Fargo to offer more detail on costs, which topped 60 cents per dollar of revenue in the aftermath of the sales scandal, a level Sloan has called “unacceptable.”\nThat figure, known as an efficiency ratio, is closely watched by Wall Street as a sign of how well a bank can manage extraneous costs. Elevated operating losses drove that ratio to 76 cents on the dollar for the fourth quarter, well above the 61 cents per dollar the bank had earlier predicted.\nFor all of 2017, the figure was 66.2 cents in costs per dollar of revenue, also higher than Wells Fargo’s target range of 55 to 59 cents.\nWells Fargo will provide more details at its investor day event in May, Chief Financial Officer John Shrewsberry said. The bank has already vowed to slash $4 billion in costs by 2019 through branch closures and other measures. Half of that will be reinvested into businesses.\nONE-TIME TAX BOOST Overall, Wells Fargo’s fourth-quarter profit rose to $5.74 billion, or $1.16 per share, up from $4.87 billion or 96 cents per share, in the year-earlier period.\nThe quarter included a $3.35 billion one-time boost from writing down its deferred tax liabilities to reflect new U.S. corporate tax rates.\nWhile other banks will likely report one-time charges related to the tax law, passed in December, Wells Fargo gets a boost to its bottom line because it will owe less tax in the future on income from a set of businesses, including mortgage servicing, where revenues are recognized at different times.\nAdditionally, the 14 percentage point corporate tax cut will apply to income earned in the United States, and unlike lenders with a larger global footprint, Wells Fargo does very little business outside the U.S.\nThe new tax law is the first tangible evidence that President Donald Trump is making progress on plans to stimulate economic growth, more than a year after his election sent markets soaring, Shrewsberry said in an interview.\nWells Fargo was one of several major U.S. companies to announce employee pay raises following the law’s passage. Shrewsberry expects that kind of extra income, plus increased business activity due to tax benefits, to have a positive effect on the U.S. economy.\n“The only piece of that pro-growth agenda people can really sink their teeth into is that tax reform that just occurred... I see a lot to like in it,” he said.\nReporting By Aparajita Saxena in Bengaluru; Writing by Lauren Tara LaCapra; Editing by Bernard Orr and Bill Rigby\n ", "external_links": [], "published": "2018-01-12T22:27:00.000+02:00", "crawled": "2018-01-13T09:47:55.003+02:00", "highlightTitle": ""}