{"organizations": [], "uuid": "e6a339fb32630447da65eb030aa8db125447fc09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/us-lipper-awards", "section_title": "U.S. Lipper Fund Awards", "url": "https://www.reuters.com/article/us-morgan-stanley-fraud/two-ex-morgan-stanley-advisers-to-plead-guilty-to-u-s-fraud-charges-idUSKBN1FK2AA", "country": "US", "domain_rank": 408, "title": "Two ex-Morgan Stanley advisers to plead guilty to U.S. fraud charges", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-31T23:45:00.000+02:00", "replies_count": 0, "uuid": "e6a339fb32630447da65eb030aa8db125447fc09"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-morgan-stanley-fraud/two-ex-morgan-stanley-advisers-to-plead-guilty-to-u-s-fraud-charges-idUSKBN1FK2AA", "ord_in_thread": 0, "title": "Two ex-Morgan Stanley advisers to plead guilty to U.S. fraud charges", "locations": [], "entities": {"persons": [{"name": "nate raymond", "sentiment": "none"}, {"name": "james polese", "sentiment": "none"}, {"name": "polese", "sentiment": "none"}, {"name": "cornelius peterson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "stanley", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 3:45 PM / in an hour Two ex-Morgan Stanley advisers to plead guilty to U.S. fraud charges Nate Raymond 3 Min Read \nBOSTON (Reuters) - Two former Morgan Stanley advisers have agreed to plead guilty to U.S. charges that they misused client funds to invest in a wind farm project they were involved with, federal prosecutors said on Wednesday. \nFederal prosecutors in Boston said James Polese, 51, and Cornelius Peterson, 28, without permission used $500,000 from the accounts of two clients to invest in and support the wind farm project. \nProsecutors said Peterson was personally involved in the project and Polese was an investor but that it needed additional funding. It was also not an investment opportunity that Morgan Stanley authorized for clients, prosecutors said. \nIn addition, both men without approval transferred $350,000 from one client’s account, which was used for a real estate investment and to pay for Polese’s own and family’s expenses, according to charging documents. \nPolese also used funds from that particular client’s account to pay for credit card bills and the college tuition of two of his children, according to court papers. \nThe conduct took place from 2014 to 2017, prosecutors said. Court papers did not identify Morgan Stanley by name, but records maintained by the Financial Industry Regulatory Authority show the bank terminated both men in June. \nLawyers for the two Massachusetts residents did not respond to request for comment. \nThe U.S. Securities and Exchange Commission in a related lawsuit also filed a related lawsuit on Wednesday against Polese and Peterson. \nThe SEC said that Peterson had been a director at a private fund through which an acquaintance was raising money for a wind-farm investment, which he was prohibited from recommending to Morgan Stanley’s clients. \nThe wind-farm investment ultimately failed, the SEC said. \nMorgan Stanley in a statement that it uncovered the conduct by the two former employees who worked in its Boston office. It said it immediately terminated them and reported their misconduct to regulatory and law enforcement agencies. \n“Morgan Stanley is strongly committed to the protection of client assets, and to act quickly when fraudulent activity is uncovered,” the bank said. \nNo plea hearing has been scheduled yet. Polese and Peterson were each charged with one count conspiracy and investment adviser fraud and several counts of bank fraud, prosecutors said. Polese also was charged with aggravated identity theft. Reporting by Nate Raymond in Boston; Editing by Nick Zieminski", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T23:45:00.000+02:00", "crawled": "2018-01-31T17:49:29.013+02:00", "highlightTitle": ""}