{"organizations": [], "uuid": "7fba4c094876dab7b09035be5e7cf27a643862d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews\r", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-ashes/cricket-ailing-root-resumes-in-sydney-as-england-dig-in-idINL4N1P313X", "country": "US", "domain_rank": 408, "title": "Cricket-Ailing Root resumes in Sydney as England dig in", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T03:44:00.000+02:00", "replies_count": 0, "uuid": "7fba4c094876dab7b09035be5e7cf27a643862d0"}, "author": "", "url": "https://in.reuters.com/article/cricket-ashes/cricket-ailing-root-resumes-in-sydney-as-england-dig-in-idINL4N1P313X", "ord_in_thread": 0, "title": "Cricket-Ailing Root resumes in Sydney as England dig in", "locations": [], "entities": {"persons": [{"name": "jonny bairstow", "sentiment": "none"}, {"name": "mooen ali", "sentiment": "none"}, {"name": "joe root", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:45 AM / Updated 10 hours ago Cricket-Ailing Root resumes in Sydney as England dig in Nick Mulvenney 2 Min Read \nSYDNEY, Jan 8 (Reuters) - Captain Joe Root took charge of England’s rearguard action despite being treated in hospital overnight for gastroenteritis and helped the tourists to 144 for five at lunch on the final day of the fifth Ashes test. \nThe 27-year-old, whose illness allowed a 43-ball cameo for Mooen Ali, reached the break on 58 not out with Jonny Bairstow unbeaten on 38 alongside him and England still 159 runs from forcing Australia to bat again. \nEngland’s best hope remains a face-saving second draw of the series after Australia ensured the return of the Ashes with victories in the first three tests of the five-match series. \nRoot was 42 not out at close of play on day four but experienced diarrhoea and vomiting overnight and was taken to hospital. \nEngland initially said he was treated for severe dehydration but later revised the diagnosis to viral gastroenteritis that had nothing to do with Sunday’s high temperatures at the Sydney Cricket Ground. \nThe skipper reached the ground in time for the start of play but out-of-form Moeen went out to bat in his stead, making 13 before almost inevitably falling lbw to Nathan Lyon. \nOff spinner Lyon has now dismissed all-rounder Moeen seven times in nine innings over the series with four of those leg before decisions. \nMoeen had already had one life in his short spell at the crease when he lifted the ball just over the fingers of a leaping Mitchell Marsh at point. \nRoot received an ovation when he came out to resume his innings and had soon secured his 37th test half century with three runs to fine leg. \nCameron Bancroft would probably have needed a trip to hospital himself had he not been wearing a helmet after he took a Root pull shot full in the grill while fielding at short leg. \nMarsh, his brother Shaun and Usman Khawaja all scored centuries as Australia made 649 declared in their reply to England’s first innings 346. (Editing by Peter Rutherford)", "external_links": [], "published": "2018-01-08T03:44:00.000+02:00", "crawled": "2018-01-08T04:14:02.007+02:00", "highlightTitle": ""}