{"organizations": [], "uuid": "33d7dd878988f82f00c8d9ab6d39f7cadac7540c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221407476&w=1200&r=LYNXMPEE0B0KQ", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-indonesia-protest-facebook/protest-by-indonesian-islamists-accuses-facebook-of-discrimination-idUSKBN1F111K", "country": "US", "domain_rank": 408, "title": "Protest by Indonesian Islamists accuses Facebook of discrimination", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:29:00.000+02:00", "replies_count": 0, "uuid": "33d7dd878988f82f00c8d9ab6d39f7cadac7540c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-indonesia-protest-facebook/protest-by-indonesian-islamists-accuses-facebook-of-discrimination-idUSKBN1F111K", "ord_in_thread": 0, "title": "Protest by Indonesian Islamists accuses Facebook of discrimination", "locations": [], "entities": {"persons": [{"name": "maarif", "sentiment": "none"}, {"name": "slamet maarif", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "facebook of discrimination jakarta", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "islamic defenders front", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "fpi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:29 AM / Updated 9 hours ago Protest by Indonesian Islamists accuses Facebook of discrimination Kanupriya Kapoor 3 Min Read \nJAKARTA (Reuters) - Several hundred Indonesian Islamists held a protest rally outside Facebook’s headquarters in Jakarta on Friday, accusing the social media giant of discrimination for blocking some pages operated by hardline groups for allegedly spreading hate. \nThe protesters, many dressed in white and including members of the hardline Islamic Defenders Front (FPI), marched from a mosque to Facebook’s offices in the capital of the world’s biggest Muslim-majority country. \n“We want to remind Facebook to remain neutral and balanced,” Slamet Maarif, a spokesman for FPI, told reporters. \n“There are many accounts that spread hate about Islam, ulamas, that are allowed to operate. There are accounts that talk about Islamic humanitarian aid, those are blocked,” said Maarif, adding that the group still planned to use Facebook and intended to open new accounts. \nFacebook said its policy was to delete content that violated its community standards. \n“Our community standards are made to prevent organizations or individuals that urge hate speech or violence against those who hold different views,” said a company representative, who declined to be identified. \nA spokesman for Indonesia’s communications ministry, Semuel Pangerapan, said, “We have never requested that FPI’s accounts be closed.” Islamists hold a protest rally outside Facebook's local headquarters accusing the social media giant of discrimination for blocking some pages operated by hardline groups in Jakarta, Indonesia January 12, 2018. REUTERS/Darren Whiteside \nSome Islamist groups in Indonesia use social media extensively and FPI usually has about 100 accounts on Facebook, as well as on other social media platforms such as Twitter. \nThe rally was peaceful, though more than 1,200 police officers were brought in to guard the offices, media said. \nIndonesians are avid users of social media and Facebook had 115 million users in the second quarter of 2017, according to media citing its country manager, ranking the country fourth globally after the United States, India and Brazil. Islamists hold a protest rally outside Facebook's local headquarters accusing the social media giant of discrimination for blocking some pages operated by hardline groups in Jakarta, Indonesia January 12, 2018. REUTERS/Darren Whiteside \nSome of the protesters on Friday made live video streams of the rally to air via Facebook. \nThe vast majority of Indonesians practice a moderate form of Islam, though a reputation for religious tolerance has come under scrutiny as hardline groups muscle their way into public and political life in the young democracy. \nPresident Joko Widodo has expressed concerns over hoax stories and hate speech spread online and has pledged to “clobber” any group threatening to destroy Indonesia’s tradition of pluralism and moderate Islam. \nAt a rally late last year in Jakarta by Muslims opposing U.S. President Donald Trump’s decision to recognize Jerusalem as the capital of Israel, a body of Muslim clerics urged a boycott of U.S. and Israel products if Trump did not revoke his action. \nSo far there has been no indication the measure will gain traction and Indonesia’s vice president said calls to stop using U.S. goods and technology were misguided. Additional reporting by Cindy Silviana; Writing by Ed Davies; Editing by Clarence Fernandez", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:29:00.000+02:00", "crawled": "2018-01-12T12:32:11.005+02:00", "highlightTitle": ""}