{"organizations": [], "uuid": "23e9c8b5ac3862a7c5537dce321b86746aa53875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/27/104736030-_Y2A9173.1910x1000.JPG", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/tony-robbins-a-to-do-list-isnt-the-way-to-achieve-your-goals.html", "country": "US", "domain_rank": 767, "title": "Tony Robbins: A to-do list isn’t the way to achieve your goals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:00:00.000+02:00", "replies_count": 0, "uuid": "23e9c8b5ac3862a7c5537dce321b86746aa53875"}, "author": "Shawn M. Carter", "url": "https://www.cnbc.com/2018/01/02/tony-robbins-a-to-do-list-isnt-the-way-to-achieve-your-goals.html", "ord_in_thread": 0, "title": "Tony Robbins: A to-do list isn’t the way to achieve your goals", "locations": [], "entities": {"persons": [{"name": "tony robbins", "sentiment": "negative"}, {"name": "robbins", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rapid planning method", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you're thinking about using a to-do list to tackle your New Year's resolutions , you may want to think again. There's a more effective way to manage your time and accomplish your goals , according to a blog post by self-made millionaire Tony Robbins.\nAlthough to-do lists can be great tools to help you organize your priorities , they can also \"make you feel like you're being productive without actually accomplishing anything,\" Robbins writes.\n\"Instead of taking time out of your day to create and worry over a to-do list, you should turn to a more effective system for time management.\"\nThat system is called the Rapid Planning Method, which he breaks down into these five steps:\nCapture and create Think about your ideas, wants and needs on a grand scale, or in a way that focuses on your motivations to accomplish a task, rather than day-to-day tasks themselves. Focus on why you want to achieve a specific goal, not just what you want to achieve.\nFor instance, identifying that you want to succeed professionally so you develop better self-esteem and can provide for your family is a more effective motivator than writing down, say, \"Talk to boss,\" or \"Plan how to get ahead,\" Robbins says.\nshow chapters These successful people share how to get more done in your 24-hour day      3:43 PM ET Thu, 6 Oct 2016 | 02:39 Ask yourself: \"What do I really want?\" \"Why do I really want it?\" \n\"When you take a step back and look at the bigger picture ,\" Robbins says, \"it will provide you with much more motivation than a to-do list organizer ever could.\"\nCommit Now it's time to get specific. With your motivating factors in mind, identify specific steps to achieve your goals, establish a time-frame in which to complete those steps and schedule it on your calendar.\nTry to eliminate distractions that could delay your progress, such as having a cluttered desk or cluttered agenda, and try to minimize procrastination, too.\nComplete Once you have a plan in place, it's time to take action. Commit to working toward your goals and think about how you will measure your progress. Actively track your status along the way. Maybe check in once per week or month to refocus and reenergize.\nshow chapters Marcus Lemonis shares his top productivity trick      5:02 PM ET Thu, 26 Jan 2017 | 01:11 Celebrate Don't just check off a box and move on to the next task, though. \"Take the time to celebrate your accomplishments,\" Robbins writes. \"Once you've hit a major milestone, treat yourself to a nice meal or give yourself time to dive into a book you've been longing to read.\"\nThose who succeed and are satisfied with their lives are successful for a reason: They reach beyond their to-do lists and \"create actionable RPM plans and conquer them,\" says Robbins.\n\"When you know what you want, why you want it and understand how to make your goal a reality, you'll become a master of time management and take control of your own happiness.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 3 habits that require 'no willpower' can 'almost guarantee' success, says author who studies millionaires \n\nshow chapters The email trick that makes Ryan Seacrest super efficient      12:13 PM ET Thu, 27 July 2017 | 00:58", "external_links": ["https://www.tonyrobbins.com/productivity-performance/reasons-to-ditch-to-do-list/", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-02T22:00:00.000+02:00", "crawled": "2018-01-02T21:10:06.045+02:00", "highlightTitle": ""}