{"organizations": [], "uuid": "bdfcdd68a1d51ab6104e79a8b59c966a115397d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/08/104829538-Dave_Grohl.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/foo-fighters-dave-grohl-saves-his-money-and-drives-a-family-car.html", "country": "US", "domain_rank": 767, "title": "Foo Fighters' Dave Grohl saves his money and drives a 'family car'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-28T18:30:00.000+02:00", "replies_count": 0, "uuid": "bdfcdd68a1d51ab6104e79a8b59c966a115397d9"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/26/foo-fighters-dave-grohl-saves-his-money-and-drives-a-family-car.html", "ord_in_thread": 0, "title": "Foo Fighters' Dave Grohl saves his money and drives a 'family car'", "locations": [], "entities": {"persons": [{"name": "dave grohl", "sentiment": "negative"}, {"name": "grohl", "sentiment": "none"}, {"name": "paul mccartney", "sentiment": "none"}, {"name": "john paul jones", "sentiment": "none"}], "locations": [], "organizations": [{"name": "getty images dave grohl  foo fighters", "sentiment": "neutral"}, {"name": "zeppelin", "sentiment": "none"}, {"name": "benihana", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Foo Fighters front-man Dave Grohl got his start as one-third of the iconic grunge band Nirvana in the early 1990's. Since then, he's produced numerous albums and films and worked alongside some of the biggest names in music, including Paul McCartney and Led Zeppelin's John Paul Jones.\nGrohl has also earned his fair share of awards. Out of 39 nominations, he's taken home 15 Grammys . And on Sunday, he's up for one more. The Foo Fighters are nominated in the category of best rock performance for their song \" Run .\" \nIt's safe to say Grohl's success is well-earned — but, though he enjoys the benefits of his lucrative career, he still watches his spending.\nWhen asked what he does with all his cash during an interview with The Red Bulletin , Grohl said, \"It goes straight into my bank account, where it turns all moldy and smelly.\"\nEven when Nirvana hit it big and Grohl got his first credit card, he stayed frugal. His inaugural purchase on the card was a dinner at Hibachi chain Benihana .\nshow chapters Dallas Cowboys running back Alfred Morris drives a $2 car      9:47 AM ET Thu, 19 Oct 2017 | 00:49 Though he says that money allows him the freedom to pursue the projects he wants without worry, it's never his top priority. \"I don't waste my time thinking about how I could make more when I already got enough,\" he tells The Red Bulletin. \"I'm not a banker, I'm a musician.\"\nThat viewpoint carries over into his personal life as well: \"I drive a family car — not a monster SUV, but a family car that fits five people,\" he says. \"I've got a house that is just big enough, too.\"\nGrohl is not pure practicality: He also owns a $140,000 Tesla which he acknowledges is 'impractical' and 'the stupidest thing.' \nThe musician's overall mindset about money was formed at a young age when his mother, a public school teacher, had a stroke while filing her taxes.\n\"I remember coming back to the house that night, alone with my sister and looking at the piece of paper she was writing to the IRS on as she started to have her stroke,\" he told The Guardian in 2014 . \"And it left this indelible mark on me that was 'Money will kill you', that people spend their lives dying inside because of money.\"\nshow chapters This billionaire started with nothing, but she made it anyway      10:00 AM ET Fri, 10 Feb 2017 | 00:47 That notion stuck with him even as his career exploded. \"The intention wasn't to become U2, it was to satisfy that need to accomplish something outside of the mainstream system,\" he said during a 2011 interview with Slate . Nirvana was born out of a love of music, not to make its members rich.\nGrohl also rejects the idea that coming from money and pursuing higher education is the only path to success. \"I never graduated school and I never had enough money for college,\" he told The Red Bulletin .\nGrowing up, Grohl worked blue collar jobs and played music on the side. \"Now I'm in the Rock and Roll Hall of Fame,\" he says. \"I'm not saying what a great guy I am, but I want everyone to imagine that same opportunity is possible.\"\nThis is an updated version of a previously published article . \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: \nWhy Rachel Bloom of 'Crazy Ex-Girlfriend' says draining her savings for a $3,000 music video paid off Why these 5 pro athletes earn millions but still drive super cheap cars Foo Fighters drummer Taylor Hawkins still drives the car he had in high school show chapters Chance the Rapper's unconventional rise to success      12:14 PM ET Thu, 24 Aug 2017 | 01:33", "external_links": [], "published": "2018-01-28T18:30:00.000+02:00", "crawled": "2018-01-28T18:31:52.005+02:00", "highlightTitle": ""}