{"organizations": [], "uuid": "82cea98562c10006c8fcfbc9aa70d8254207ef07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224306081&w=1200&r=LYNXMPEE0M00F", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-bofaml-wealth/bank-of-america-wants-more-brokerage-clients-to-be-bank-clients-idUSKBN1FC00F", "country": "US", "domain_rank": 408, "title": "Bank of America wants more brokerage clients to be bank clients", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:09:00.000+02:00", "replies_count": 0, "uuid": "82cea98562c10006c8fcfbc9aa70d8254207ef07"}, "author": "", "url": "https://www.reuters.com/article/us-bofaml-wealth/bank-of-america-wants-more-brokerage-clients-to-be-bank-clients-idUSKBN1FC00F", "ord_in_thread": 0, "title": "Bank of America wants more brokerage clients to be bank clients", "locations": [], "entities": {"persons": [{"name": "eliza", "sentiment": "negative"}, {"name": "dilts", "sentiment": "none"}, {"name": "greg mcbride", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "negative"}, {"name": "merrill lynch", "sentiment": "none"}, {"name": "bankrate.com", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Bank of America ( BAC.N ) is offering cash and interest rate incentives to Merrill Lynch clients for opening first-time checking and savings accounts as it tries to seize the large chunk of wealth that brokerage customers hold at other institutions.\nThe bank is missing out on as much as $200 billion in deposits and other assets from the roughly half of Merrill Lynch clients who bank elsewhere, a source familiar with the matter said on Monday. Clients with both bank and wealth management accounts have on average 15 percent more assets at Bank of America, according to a study the bank conducted last September.\n“The ultimate objective is developing a deeper relationship with their affluent wealth management clients,” said Greg McBride, chief financial analyst at the rate-comparing website Bankrate.com.\nThe effort comes the same day that an online petition criticizing Bank of America for charging fees on checking accounts with low balances gathered nearly 45,000 signatures on the website Change.org.\nCustomers in the bank’s core checking accounts, including many who were recently shifted out of e-banking accounts, will be charged $12 a month if their account balance falls below $1,500 or if they receive less than $250 a month in direct deposits, according to Bank of America.\nThe petition, started three weeks ago by a Bank of America client, called for the bank to preserve fee-free checking accounts.\nBank of America spokeswoman Carla Molina said the bank offers many ways to avoid paying a monthly fee, such as waivers for students under the age of 24, and by receiving $250 in monthly direct deposits, which works out to $3,000 annually.\n“This is one of the lowest qualifiers in the industry,” Molina said.\nStarting this week in the wealth business, select Merrill Lynch clients will receive letters in the mail offering them $200 cash if they open a new checking account and receive at least $4,000 in direct deposits in the first three months.\nClients must also open a new savings account at the same time and deposit at least $25,000 within 30 days, for which the bank will pay them 1.35 percent in interest the first year.\nThe $200 cash incentive is similar to what competitors offer, McBride said, but the interest rate is higher.\nOn the low end of offers, a money market deposit account currently pays just 0.17 percent on balances of $25,000. The highest-yielding savings account available at a national bank pays 1.70 percent, according to Bankrate.com.\nBig banks have been slow to raise the rates they pay customers on their deposits, despite making more on the money they loan to clients as a result of the U.S. Federal Reserve steadily raising interest rates over the last year.\nReporting by Elizabeth Dilts; Editing by Matthew Lewis\n ", "external_links": [], "published": "2018-01-23T02:09:00.000+02:00", "crawled": "2018-01-23T02:21:23.015+02:00", "highlightTitle": ""}