{"organizations": [], "uuid": "f4267a787d9b3f95dc25d7e8327d6b87ce63011d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-milost-global-closes-the-acquisition-of-primewaterview-holdings-nigeria-limited.html", "country": "US", "domain_rank": 767, "title": "Milost Global Closes The Acquisition of Primewaterview Holdings Nigeria Limited", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.109, "site_type": "news", "published": "2018-01-10T16:54:00.000+02:00", "replies_count": 0, "uuid": "f4267a787d9b3f95dc25d7e8327d6b87ce63011d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-milost-global-closes-the-acquisition-of-primewaterview-holdings-nigeria-limited.html", "ord_in_thread": 0, "title": "Milost Global Closes The Acquisition of Primewaterview Holdings Nigeria Limited", "locations": [], "entities": {"persons": [{"name": "adetunji ogunwusi", "sentiment": "none"}, {"name": "primewaterview", "sentiment": "none"}, {"name": "primewater", "sentiment": "none"}, {"name": "milost", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "medical city", "sentiment": "none"}, {"name": "primewaterview", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "milost", "sentiment": "none"}], "organizations": [{"name": "acquisition of primewaterview holdings nigeria limited", "sentiment": "negative"}, {"name": "milost global inc.", "sentiment": "negative"}, {"name": "isilo capital partners (pty) ltd", "sentiment": "none"}, {"name": "healthcare and power", "sentiment": "none"}, {"name": "milost ffo", "sentiment": "none"}, {"name": "isilo capital partners", "sentiment": "none"}, {"name": "primewaterview holdings nigeria limited", "sentiment": "none"}, {"name": "real estate, oil & gas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 10, 2018 (GLOBE NEWSWIRE) -- Milost Global Inc. (“Milost”) today announced that, together with its African subsidiary, Isilo Capital Partners (Pty) Ltd, it has closed the acquisition of a 100% interest in Primewaterview Holdings Nigeria Limited a large scale, diversified holding company with a portfolio of Real Estate, Oil & Gas, Quarry Mining, Healthcare and Power for a total consideration of $1, 1 billion.\nThe transaction is immediately accretive to Milost and Isilo Capital Partners, with Primewater’s stable revenue streams expected to contribute 10% accretion to Milost FFO on a run-rate basis.\nPrimewaterview represents Milost’s first meaningful investment in Nigeria and provides a platform for further growth in the sectors of Primewaterview operations. The transaction represents all the assets that are owned and controlled by HRH Prince Adetunji Ogunwusi and his partners, these include but are not limited to the 2000 bed Medical City project which is going in construction at the end of the first quarter of 2018 along with the tallest building project in Africa. As of 24 hours from the date of this Announcement, HRH Prince Adetunji Ogunwusi will be stepping down as Chairman and CEO of Primewaterview and Milost and Isilo will appoint a new management team that will immediately assume the management of the company as Milost will immediately takeover control.\nHRH Prince Adetunji Ogunwusi, the Founder, Chairman & CEO of Primewaterview Holdings Nigeria Limited, stated, “Have you not heard, do you not know that the everlasting GOD, the creator of the ends of the earth fainteth not, neither is He weary nor there is searching of His understanding, He gives power to the faint and to them that have no might He increases strength, even the youth shall faint hand be weary and the young men shall fall utterly but they that wait upon the lord shall renew their strength and shall mount upon wings of eagles, they shall run and not be weary, they shall walk and not faint. Isaiah 40 vrs 28-31. This is the simple word of GOD that best describes the story of Primewaterview and it’s marvellous in our eyes. Thank you Lord.”\nEric Balogun, Director, Primewaterview holdings Nigeria Limited, Stated, “The conclusion of the acquisition of Primewaterview Holdings Limited by Milost Global Inc. is a transaction made in heaven. The global reach and financial reach of Milost and the extensive presence of Primewaterview in Nigeria will definitely result in a new conglomerate that will become one of the biggest players in the Nigerian and African economies which will soon be an envy of all. I am happy to have seen the giant stride that Primewaterview has taken in the Nigerian economy and I am eagerly awaiting the performance of the new Primewaterview Holdings that will emerge from this new takeover.”\nDele Agkameh, shareholder, Primewaterview holdings Nigeria Limited, stated, “Conceptualized in this era of economic globalisation, this transaction will open the floodgates of new opportunities for Primewaterview as the emerging stronger mega-entity, to continue to provide trademark, excellent services in diverse aspects of the global economy. The bottom-line is that it is better to be a \"small fish\" in a bigger pond, than to be a \"bigger fish\" in a tiny pond.”\nFolusho Kolawole, shareholder, Primewaterview holdings Nigeria Limited, stated, “This acquisition is a welcome development as it brings in its wake much needed infusion of foreign direct investment into the economy of Nigeria as a whole. It also heralds a greater dimension of economic stimulation for the country. These are exciting times for Primewaterview holdings as the company looks forward to greater things in the near future.”\nAdetunji Fakile, Shareholder, Primewaterview holdings Nigeria Limited, stated, “This is a new dawn for Primewaterview holdings Nigeria Limited. This shows great works and success stories are performed not by strength only, but by perseverance, Patience and Persistence. Of all that is good, sublimity is supreme. Succeeding is the coming together of all that is beautiful. Furtherance is the agreement of all that is just. Perseverance is the foundation of all actions. Well done indeed to Primewaterview Holdings Nigeria Limited and Milost Global Inc.\nThe investment is expected to contribute approximately $900 million to Milost’s annual FFO. Primewaterview’s cash flows are underpinned by long-term contracts with creditworthy off-takers. The high quality assets in the portfolio have a long useful life remaining, consisting of old projects, recently constructed projects that have been operating for an average of 3 years and a large pipeline of good quality projects. Primewaterview will be Milost’s primarily vehicle for acquisitions of assets in Nigeria. This transaction is the first largest in Nigeria for 2018 and will be followed by a large Nigerian bank and an insurance company acquisition which will close before the end of March 2018.\nSolly Asibey, the Senior Partner & President of Milost Global Africa, stated, “This acquisition is in line with our strategy for the West African market, and also enables Milost to have a diversified portfolio that will serve all the various vertical industries in Nigeria. This bold step is a clear indication of our intentions to gain further traction within this market, and we are grateful for the opportunity to take Primewaterview to even greater heights.”\nTiny Deswai-Moreni, the CEO of Isilo Capital Partners (Pty) Ltd, also stated, “We are very happy about this acquisition. It is a very important investment for us at Isilo Capital Partners as it marks our entrance into the Nigerian market and economy which we consider the gateway into the rest of West Africa. The acquisition is in line with our strategy for investing the Isilo Fund in diversified portfolios to ensure multiple streams of income for the fund. We are excited and look forward to serving the Nigerian people and working with the regulatory authorities and other stakeholders.”\nAbout Milost Global Inc.\nMilost Global Inc. is an American Private Equity firm that is headquartered in New York City, with more than $25 billion in committed capital. Milost is at the intersection of creative investing and value creation. Milost is also a provider of alternative capital, mezzanine finance, and alternative lending to a broad range of industries across the globe including Technology, Transport, Cannabis, Education, Distribution, Mining, Oil & Gas, Financial Services, Healthcare, Pharmaceuticals, Real Estate, Alternative Energy and Infrastructure Development. www.milostglobal.com\nFor more information Solly Asibey info@milostglobal.com Tel: +1-212-709-8206 Fax: +1-212-943-2300\nSource:Milost Global Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dac64e60-c6f3-4d97-bf2d-20582f5b1ba0", "https://www.globenewswire.com/Tracker?data=wkg0TxJ0mtjlWG5J8lRMy7-NC06VzlInxd2zCDS_T37DuPrij0ll23zCZfbvR0qWYtXp-IrT_29xZjnIEr_ym93e9UPBuuBpS91RNYUl7_A="], "published": "2018-01-10T16:54:00.000+02:00", "crawled": "2018-01-10T18:49:44.009+02:00", "highlightTitle": ""}