{"organizations": [], "uuid": "1b25dc6a3fbef28f9b92789286a79623bd71af2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/20/104853700-GettyImages-841583088.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/4q-airline-earnings-what-to-expect.html", "country": "US", "domain_rank": 767, "title": "4Q Airline earnings: What to expect", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.802, "site_type": "news", "published": "2018-01-11T01:48:00.000+02:00", "replies_count": 0, "uuid": "1b25dc6a3fbef28f9b92789286a79623bd71af2c"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/10/4q-airline-earnings-what-to-expect.html", "ord_in_thread": 0, "title": "4Q Airline earnings: What to expect", "locations": [], "entities": {"persons": [{"name": "rona", "sentiment": "negative"}], "locations": [{"name": "u.s. capitol", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "delta", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "reagan national airport", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. airlines are on track for their eighth consecutive year of profits in 2017. As they report those 2017 and fourth-quarter profits investors will be focused on whether they can make those profits grow.\nDelta Air Lines kicks off earnings season on Thursday, reporting before the market opens. The second-largest U.S. carrier certainly had its share of disruptions in 2017 — a series of powerful storms , a nearly half-day blackout at its home airport in Atlanta . But the carrier is expected to post quarterly earnings per share of 0.88 cents, an increase of 7 percent on the year, according to analyst estimates compiled by Thomson Reuters.\nThe airline, like its competitors, is grappling with higher costs but strong passenger demand. Low fares and higher costs spook airline investors , but airlines need to strike a balance and not raise fares so high that it hurts demand. So far, full planes — as you know if you've looked around you on a flight lately — have not been a problem.\nOn the eve of airlines' earnings season, investors appear to be pleased, because shares surged. United and American raised their forecasts for how much they expect to make out of each seat they fly a mile, a key industry metric. United shares rose more than 6.7 percent, their biggest one-day percentage gain since August 2016. American and Delta each rose more than 3 percent.\nWhether it can continue depends on the outlook for 2018. Here are some key topics to look for as airlines report this month.\nFuel The biggest headache for any carrier, jet-fuel prices rose more than 20 percent in 2017, and they have continued to climb in the first few days of 2018, according to S&P Global Platts. This is an enormous cost for airlines, and the crash in oil prices in 2014 fueled record profits.\nLabor costs Executives will likely address higher labor costs due to richer profit-sharing programs or planned salary increases. Airlines including American, Southwest and JetBlue have said they would pay employees a $1,000 bonus due to the tax cut.\nFare increases Airlines have become creative at generating more passenger revenue: adding baggage fees , charging passengers to select their seats, and segmenting the cabin by creating a fare class that passengers dislike enough to pay a higher fare to avoid it. Base airfares had for years remained low, which is great for travelers, but investors will want to see that airlines are translating strong passenger demand into fares that are both higher and palatable. Several airlines are trying to fit more seats on board their planes, which is cheaper than operating multiple aircraft.\nFrequent flyer revenue exposed An accounting change that takes effect this year will force airlines to move some ancillary passenger revenue from the \"other\" category into the same bucket as revenue generated from airfares. That will leave the money that airlines generate from frequent flyer miles — which they sell to banks for their co-branded and other airline points-generating cards — in that \"other\" category. The result will be greater visibility into just how much airlines are earning from that business.\nTravel disruptions and infrastructure Airlines had detailed most of the costs associated with the series of deadly hurricanes that struck the U.S. and Caribbean last year, but they may also address the preparedness of U.S. infrastructure for such severe weather problems. For example, the recovery at New York's John F. Kennedy International Airport took days after a winter storm struck the East Coast. A ruptured pipe and a lack of available jets stranded thousands of passengers and left thousands of other arriving travelers stuck on runways for hours.\nWATCH: Airlines recover from the 'bomb cyclone' winter storm show chapters Airlines recover from the 'bomb cyclone' winter storm 1:42 PM ET Fri, 5 Jan 2018 | 01:05", "external_links": [], "published": "2018-01-11T01:48:00.000+02:00", "crawled": "2018-01-11T01:48:29.018+02:00", "highlightTitle": ""}