{"organizations": [], "uuid": "1a845a24dee49248ff28a9122dc15f4a4d08dee2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-official-plan-to-exclude-florida-from-drilling-isnt-final.html", "country": "US", "domain_rank": 767, "title": "Official: Plan to exclude Florida from drilling isn't final", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:54:00.000+02:00", "replies_count": 0, "uuid": "1a845a24dee49248ff28a9122dc15f4a4d08dee2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-official-plan-to-exclude-florida-from-drilling-isnt-final.html", "ord_in_thread": 0, "title": "Official: Plan to exclude Florida from drilling isn't final", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "walter cruickshank", "sentiment": "none"}, {"name": "cruickshank", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}, {"name": "rick scott", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "tallahassee", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "democrats", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}, {"name": "bureau of ocean energy management", "sentiment": "none"}, {"name": "house natural resources committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Trump administration's promise to exempt Florida from an offshore drilling plan is not a formal action, an Interior Department official said Friday in a statement that Democrats said contradicted a high-profile announcement by Interior Secretary Ryan Zinke.\nZinke has proposed opening nearly all U.S. coastline to offshore oil and gas drilling, but said soon after announcing the plan that he will keep Florida \"off the table\" when it comes to offshore drilling.\nZinke's Jan. 9 statement about Florida \"stands on its own,\" said Walter Cruickshank, the acting director of the Bureau of Ocean Energy Management, but there's been no formal decision on the five-year drilling plan.\n\"We have no formal decision yet on what's in, or out, of the five-year program,\" Cruickshank told the House Natural Resources Committee at a hearing Friday.\nZinke's announcement about keeping Florida off the table, made during a Tallahassee news conference with Florida Gov. Rick Scott, will be part of the department's analysis as it completes the five-year plan, Cruickshank said.\nDemocrats seized on the comment to accuse Zinke of playing politics by granting the Republican governor's request to exempt Florida while ignoring nearly a dozen other states that made similar requests.\nFlorida Sen. Bill Nelson called Cruickshank's comments \"stunning\" and said they confirm what he and other Democrats had suspected — that Zinke's statement was \"nothing more than a political stunt\" to help Scott run for Nelson's Senate seat.\nScott is a friend and ally of President Donald Trump, and Trump has urged him to run for the Senate.\nZinke's promise to take Florida off the table was \"just empty words\" until he takes formal steps needed to publish a new draft plan that excludes Florida, Nelson said.\nHeather Swift, a spokeswoman for Zinke, called the claims by Nelson and other Democrats false. \"Cruickshank simply said BOEM will finish the legally-required analysis of the planning areas, as is always done for all planning areas,\" she said in an email.\nScott said Friday he did not see Cruickshank's comments but was confident the Trump administration will not allow drilling in Florida.\n\"Secretary Zinke is a man of his word. He's a Navy Seal. He promised me that Florida would be off the table, and I believe Florida is off the table,\" Scott told reporters Friday.\nZinke announced plans two weeks ago to vastly expand offshore oil drilling from the Atlantic to the Arctic and Pacific oceans, including in more than a dozen states where drilling is now blocked. The five-year plan would open 90 percent of the nation's offshore reserves to development by private companies.\nThe plan has drawn bipartisan opposition by coastal state governors from California to New Hampshire, with at least 11 governors formally asking Zinke to remove their states from the plan. Seven governors from Massachusetts to North Carolina submitted a joint request for exemptions this week.\n\"Like Florida, each of our states has unique natural resources and an economy that is reliant on tourism as an essential driver,\" the governors wrote. The letter was signed by Republican leaders of Massachusetts and Maryland and Democrats from Rhode Island, Connecticut, Delaware, Virginia and North Carolina.\nBy exempting Florida but not other states, Zinke showed he is \"more concerned with politics than proper process when it comes to making key decisions that affect our coastal communities,\" said Sen. Maria Cantwell of Washington state, the top Democrat on the Senate Energy and Natural Resources Committee.\nZinke's action may violate the Outer Continental Shelf Lands Act, which governs drilling in U.S. coastal waters, Cantwell said. The law requires formal notice and a comment period before taking regulatory action.\nRep. Jared Huffman, D-Calif., a member of the natural resources panel, told Cruickshank that the Interior Department has not offered \"a single reason why Florida is more unique than California or Virginia or South Carolina or other coastal states.\"\nOil industry groups have praised Zinke's plan, while environmental groups say it would harm America's oceans, coastal economies, public health and marine life.\nNelson said this week he is blocking three Trump nominees for high-level Interior jobs to protest the drilling proposal.\nAssociated Press writer Gary Fineout in Tallahassee, Florida contributed to this report.", "external_links": [], "published": "2018-01-19T20:54:00.000+02:00", "crawled": "2018-01-20T19:01:32.032+02:00", "highlightTitle": ""}