{"organizations": [], "uuid": "f6d4acbeb69402f80c2b390f16b857603b23e7de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/ukraine-privatbank/update-1-ukraines-cenbank-says-privatbank-was-used-for-shady-deals-money-laundering-idUSL8N1PB35E", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Ukraine's cenbank says PrivatBank was used for shady deals, money-laundering", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:58:00.000+02:00", "replies_count": 0, "uuid": "f6d4acbeb69402f80c2b390f16b857603b23e7de"}, "author": "", "url": "https://www.reuters.com/article/ukraine-privatbank/update-1-ukraines-cenbank-says-privatbank-was-used-for-shady-deals-money-laundering-idUSL8N1PB35E", "ord_in_thread": 0, "title": "UPDATE 1-Ukraine's cenbank says PrivatBank was used for shady deals, money-laundering", "locations": [], "entities": {"persons": [], "locations": [{"name": "ukraine", "sentiment": "none"}, {"name": "kiev", "sentiment": "none"}], "organizations": [{"name": "privatbank", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kroll", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 12:00 PM / Updated 35 minutes ago UPDATE 2-Ukraine central bank says PrivatBank was used for shady deals, money-laundering Reuters Staff \n(Adds Kolomoisky comment, quote from central bank deputy governor, background) \nBy Natalia Zinets \nKIEV, Jan 16 (Reuters) - Ukraine’s central bank said on Tuesday an investigation into the country’s largest lender, PrivatBank, which was taken into state control in 2016, showed it had been used for money-laundering and shady deals over the course of at least a decade. \nOne of the bank’s former main shareholders, Ihor Kolomoisky, dismissed the report as “nonsense,” but a central bank deputy governor said the findings had been passed to prosecutors for use in a possible criminal investigation. \nThe allegations of the central bank, which echo those it made at the time of the bank’s nationalisation and follow a probe it commissioned by the global investigation firm Kroll, are part of a long-running dispute over PrivatBank that has spawned hundreds of legal cases. \n“The investigation has identified that PrivatBank was subjected to a large-scale and coordinated fraud over at least a 10-year period ending in December 2016, which resulted in the bank suffering a loss of at least $5.5 billion,” the central bank said in a statement. \nThe bank was nationalised as part of an International Monetary Fund-backed drive to clean up the financial system. Finance Minister Oleksandr Danylyuk has said the resulting legal fights will be a litmus test for the effectiveness of law enforcement. \nThe central bank, which asked Kroll and other international companies to dig into PrivatBank’s finances, said the investigation had revealed that 95 percent of corporate loans extended by the lender during the period had gone to companies linked to the former owners and their affiliates. \n“It is nonsense, which there is no point commenting on,” ex-shareholder Kolomoisky told online newspaper Ukrainska Pravda in response to the central bank’s statement. \n“The main question is where was the money withdrawn to and when? All the rest is fiction,” he said. \nHe has launched lawsuits to challenge the nationalisation, including a move to prevent Ukraine cooperating with external companies to investigate the reasons for PrivatBank’s insolvency. \nThe former owners have long disputed the central bank’s assessment of PrivatBank’s finances and say it was nationalised for political reasons. \nGennadiy Bogolyubov, the other main former shareholder, has previously said the Ukrainian authorities declared PrivatBank insolvent on grounds that were fabricated and unfounded, creating an “artificial hole” in the balance sheet. \nHe did not immediately respond to a Reuters request for comment on the latest development. \nThe results of the Kroll audit have been passed to prosecutors for use in a possible criminal investigation into the deals made before its nationalisation, central bank deputy governor Kateryna Rozhkova said at a briefing. \n“We received assurances from the general prosecutor that the results of the forensic audit were received by the general prosecutor’s office for use in carrying out a criminal investigation,” she said. (Reporting by Natalia Zinets; Writing by Matthias Williams and Alessandra Prentice; Editing by Gareth Jones)", "external_links": [], "published": "2018-01-16T13:58:00.000+02:00", "crawled": "2018-01-16T14:33:12.026+02:00", "highlightTitle": ""}