{"organizations": [], "uuid": "efcc0329fdc4a107d8e9632052716d4a58afb521", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-israel-palestinians/palestinian-authority-says-resuming-payment-for-gazas-israeli-electricity-idUSKBN1ES1HB", "country": "US", "domain_rank": 408, "title": "Palestinian Authority says resuming payment for Gaza's Israeli electricity", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:55:00.000+02:00", "replies_count": 0, "uuid": "efcc0329fdc4a107d8e9632052716d4a58afb521"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-israel-palestinians/palestinian-authority-says-resuming-payment-for-gazas-israeli-electricity-idUSKBN1ES1HB", "ord_in_thread": 0, "title": "Palestinian Authority says resuming payment for Gaza's Israeli electricity", "locations": [], "entities": {"persons": [{"name": "rami al-hamdallah", "sentiment": "none"}, {"name": "hussein", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}], "organizations": [{"name": "gaza", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "palestinian authority", "sentiment": "negative"}, {"name": "hamas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAZA (Reuters) - The Palestinian Authority said on Wednesday it asked Israel to fully restore Israeli electricity flows to the Gaza Strip, a move that could nearly double the daily connection time in an enclave suffering severe power shortages.\nThere was no immediate word from Israel whether it would comply at a time when it says the Islamist Hamas group, which controls Gaza, bears overall responsibility for recent cross-border rocket attacks launched by smaller militant factions.\nIn a statement, Hussein Al-Sheikh, Palestinian minister of civil affairs, said the Palestinian Authority would again guarantee payment of Gaza’s Israeli electricity bill and ask Israel to restore the 50 megawatts of power, out of a total 120 megawatts, that it had supplied to the area.\nA statement issued by Prime Minister Rami Al-Hamdallah said the request was to “alleviate the suffering of the people of Gaza and to improve living conditions.”\nGaza’s two million residents now receive only three to four hours of electricity a day, with schools, factories, hospitals and households affected. A Gaza economist said restoration of power from Israel, the enclave’s main electricity supplier, could raise that figure to six hours. Gaza’s sole power station generates only a small amount of electricity.\nIn April, Palestinian President Mahmoud Abbas announced he was cancelling the guarantee, part of a bid to press Hamas to loosen its hold over the enclave, a decade after the Islamist movement seized the territory from forces loyal to him.\nPrompted partly by Abbas’s sanctions and fears of financial and political isolation, Hamas signed an Egyptian-brokered reconciliation agreement with his Fatah movement in October and agreed to hand over administrative control of the Gaza Strip to the Western-backed Palestinian Authority.\nBut both groups have failed to finalize details of the deal, which had been due to be completed on December 1. The Authority’s decision to resume the electricity payments could help smooth the way towards completing the accord.\nThe PA’s request coincides with heightened Israeli-Palestinian tensions.\nPalestinians have been mounting protests in the occupied West Bank and violence has flared along the Israel-Gaza border since U.S. President Donald Trump announced on Dec. 6 that he was recognizing Jerusalem as Israel’s capital. Palestinians want East Jerusalem as the capital of a state they seek to establish in the occupied West Bank and the Gaza Strip.\nIn the West Bank on Wednesday, Israeli troops shot dead a 17-year-old Palestinian during a confrontation with stone-throwing protesters, Palestinian medics said. An Israeli military spokeswoman said he appeared to have been holding a firearm.\nHis death raised to 13 the number of Palestinians killed in clashes with Israeli forces since Trump’s declaration, according to the Palestinian Health Ministry. There have been no Israeli fatalities or serious injuries in the confrontations or as a result of the rocket strikes.\nTwo Hamas gunmen were killed in one Israeli retaliatory air strike in December.\nWriting by Ori Lewis; Editing by Jeffrey Heller and William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T00:55:00.000+02:00", "crawled": "2018-01-03T19:25:35.006+02:00", "highlightTitle": ""}