{"organizations": [], "uuid": "cdb3e205ea047363c5994c03ce53e9d9da05ab5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218827142&w=1200&r=LYNXMPEE010OR", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-airbus-deliveries/airbus-delivered-over-700-jets-in-2017-meeting-target-sources-idUSKBN1ER17V", "country": "US", "domain_rank": 408, "title": "Airbus delivered over 700 jets in 2017, meeting target -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:42:00.000+02:00", "replies_count": 0, "uuid": "cdb3e205ea047363c5994c03ce53e9d9da05ab5f"}, "author": "", "url": "https://www.reuters.com/article/us-airbus-deliveries/airbus-delivered-over-700-jets-in-2017-meeting-target-sources-idUSKBN1ER17V", "ord_in_thread": 0, "title": "Airbus delivered over 700 jets in 2017, meeting target -sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:51 PM / Updated 3 hours ago Airbus delivered over 700 jets in 2017, met target: sources Tim Hepher 3 Min Read \nLONDON (Reuters) - European planemaker Airbus ( AIR.PA ) delivered over 700 aircraft in 2017, breaking company records and meeting its core industrial target for the year, industry sources said. \nExact figures have been kept under wraps ahead of an announcement on January 15, but the sources said Airbus handed over a record monthly total of jets in December, surpassing the previous monthly peak of 111 seen in the closing weeks of 2016. \nComing on top of 591 deliveries posted between January and November last year, that implies deliveries of at least 703 aircraft in 2017 as a whole, up at least 2 percent from 2016. \nA spokesman for Airbus declined comment. \nAirbus stuck throughout 2017 to an official target of more than 700 deliveries for the year, but abandoned a more ambitious informal goal of more than 720 deliveries in October due to continued delays in engine deliveries for the A320neo family. \nAirbus officials have said the delays have now eased, following a two-year wrangle with supplier Pratt & Whitney ( UTX.N ) over late engines for the company’s fastest-selling jet. \nIt is the second year in a row that Airbus has been forced to accelerate sharply in December, with that month’s deliveries accounting for at least 16 percent of the annual total. \nWithout disclosing numbers, Chief Operating Officer Fabrice Bregier thanked staff in a memo for “huge collective efforts” that had seen the company break records for deliveries logged both in one month and in one year, industry sources said. \nStill, insiders said the strong industrial performance would be seen by many as a personal coup for Bregier, weeks before he is due to leave the company after losing a bid to succeed Chief Executive Tom Enders, who is himself leaving in 2019. \nAirbus is bracing for more internal changes this year as it emerges from a top-level power struggle and rows over the handling of corruption investigations, but ended 2017 with what appears to be a grand slam performance from its current regime. \nBesides ending the year on record output, Airbus is also heading for a record December in new business after soon-to-retire sales chief John Leahy announced the firming up of more than 700 orders, equivalent to a year’s production. \nBoth Leahy and Bregier are leaving Airbus in coming weeks, handing their responsibilities to executives from outside the planemaking inner circle: Airbus Helicopters CEO Guillaume Faury, who will replace Bregier as head of the planemaking division, and Rolls-Royce ( RR.L ) civil engines head Eric Schulz, who will replace Leahy after he retires later this month. \nAirbus will remain in second place on deliveries in 2017 behind the world’s largest planemaker, Boeing ( BA.N ), but analysts say the outcome of the order race depends on how many of the new sales make it into the end-year tally of net orders. Reporting by Tim Hepher; Editing by Ingrid Melander and Geert De Clercq", "external_links": [], "published": "2018-01-02T16:42:00.000+02:00", "crawled": "2018-01-02T17:29:43.014+02:00", "highlightTitle": ""}