{"organizations": [], "uuid": "e1ec49e40487b54d0f00a663126bf5305b8cc9b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-cnb-bank-shares-inc-and-jacksonville-bancorp-inc-announce-agreement-to-merge.html", "country": "US", "domain_rank": 767, "title": "CNB Bank Shares, Inc. and Jacksonville Bancorp, Inc. Announce Agreement to Merge", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:05:00.000+02:00", "replies_count": 0, "uuid": "e1ec49e40487b54d0f00a663126bf5305b8cc9b6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-cnb-bank-shares-inc-and-jacksonville-bancorp-inc-announce-agreement-to-merge.html", "ord_in_thread": 0, "title": "CNB Bank Shares, Inc. and Jacksonville Bancorp, Inc. Announce Agreement to Merge", "locations": [], "entities": {"persons": [{"name": "jacksonv", "sentiment": "none"}], "locations": [{"name": "carlinville", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "carlinville", "sentiment": "none"}], "organizations": [{"name": "jacksonville bancorp, inc", "sentiment": "neutral"}, {"name": "cnb bank shares, inc.", "sentiment": "neutral"}, {"name": "cnb bank & trust", "sentiment": "none"}, {"name": "cnb", "sentiment": "none"}, {"name": "jacksonville bancorp, inc.", "sentiment": "none"}, {"name": "missouri msa", "sentiment": "none"}, {"name": "jacksonville savings bank", "sentiment": "none"}, {"name": "jacksonville bancorp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARLINVILLE, Ill. and JACKSONVILLE, Ill., Jan. 18, 2018 (GLOBE NEWSWIRE) -- CNB Bank Shares, Inc. (“CNB Shares”) and Jacksonville Bancorp, Inc. (“Jacksonville Bancorp”) (NASDAQ:JXSB) jointly announced that they have entered into a definitive merger agreement whereby Jacksonville Bancorp will merge with and into CNB Shares. Following the merger, Jacksonville Savings Bank, the wholly-owned subsidiary of Jacksonville Bancorp, will merge with and into CNB Bank & Trust (“CNB B&T”), the wholly-owned subsidiary of CNB Shares.\nUnder the terms of the merger agreement, shareholders of Jacksonville Bancorp will receive $33.70 in cash for each share of Jacksonville Bancorp common stock. The transaction has an aggregate deal value of approximately $61.6 million.\nThe transaction combines two strong local community banks that share a common culture and core values. CNB B&T is headquartered in Carlinville, Illinois, with approximately $924 million in total assets at September 30, 2017 and operates thirteen full-service branches located throughout Illinois and in the St. Louis, Missouri MSA. Jacksonville Savings Bank is headquartered in Jacksonville, Illinois, operating four full-service branches and two limited service branches located throughout central Illinois, with approximately $337 million in total assets at September 30, 2017. With approximately $1.25 billion in pro forma assets, the combined bank will continue to operate all branches after closing.\nJacksonville Bancorp board chairman, Andy Applebee, said, “Our two banks are very complementary. We are confident CNB will continue our community bank traditions while capitalizing on the benefits that come with being a larger bank.” Said Rich Foss, President and CEO of Jacksonville Savings Bank, \"We are pleased to be partnering with another local community bank that shares our deep commitment to customer service and community involvement.\"\nFollowing the merger, Mr. Foss will serve as a director on the board of CNB Bank & Trust and Mr. Applebee will remain in an advisory capacity.\nThe acquisition is expected to close in the second quarter of 2018 and is subject to Jacksonville Bancorp shareholder approval, regulatory approval, and other conditions as set forth in the merger agreement. Upon completion of the holding company merger, we anticipate the two banks will be merged in the fourth quarter of 2018 or first quarter of 2019. The directors of CNB Shares and Jacksonville Bancorp have unanimously approved the merger agreement.\nCNB Shares also announced today that, subject to customary closing conditions, Castle Creek Capital Partners VI, L.P. (“Castle Creek”) will be making an investment of $30.0 million into CNB Shares with the proceeds being used both to fund the merger and support future organic growth. Upon closing of the transaction, Castle Creek will have one representative appointed to CNB Shares’ board of directors.\nCNB B&T President Shawn Davis said, “This merger will not only be a good fit geographically for CNB, but also culturally as Jacksonville Savings Bank has diligently committed resources to staff training in the areas of quality service and product development.” CNB Shares President Jim Ashworth added, “CNB Shares will benefit with an expansion of a familiar customer demographic, an investor group that is optimistic about our future, and additional experienced directors.”\nJacksonville Bancorp was advised by the investment banking firm of D.A. Davidson & Co., and the law firm of Luse Gorman, PC. CNB Shares was advised by the investment banking firm of Keefe, Bruyette and Woods, Inc. and the law firm of Barack Ferrazzano Kirschbaum & Nagelberg LLP. Castle Creek was advised by the law firm of Sidley Austin LLP. In addition, Keefe, Bruyette and Woods, Inc. acted as placement agent in conjunction with the offering by CNB Shares.\nAbout CNB Bank Shares, Inc.\nCNB Bank Shares, Inc. provides a full range of banking services to individual and corporate customers throughout south-central Illinois, suburban southwestern Chicago, and the St. Louis metropolitan area. The original institution was founded in Carlinville in 1888, expanding through four previous whole-bank acquisitions over the past 22 years, including one bank that was established in 1854. For all other information, visit www.cnbil.com .\nAbout Jacksonville Bancorp, Inc.\nJacksonville Bancorp is the holding company for Jacksonville Savings Bank, an Illinois-chartered savings bank headquartered in Jacksonville, Illinois. Originally chartered in 1916, Jacksonville Savings Bank has branch locations in the Illinois markets of Jacksonville, Virden, Litchfield and Chapin. Additional information can be found at www.jacksonvillesavings.com .\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include words like “believe,” “expect,” “anticipate,” “estimate,” and “intend” or future or conditional verbs such as “will,” “would,” “should,” “could,” or “may.” Certain factors that could cause actual results to differ materially from expected results include and the other factors detailed from time to time in Jacksonville Bancorp’s reports filed with the Securities and Exchange Commission, including those described in its Forms 10-K and the following: delays in completing or the inability to complete the merger, including delays in obtaining or the inability to obtain regulatory or shareholder approval, difficulties in achieving cost savings from the merger or in achieving such cost savings within the expected time frame, difficulties in integrating CNB B&T and Jacksonville Savings Bank, the reaction of the companies’ customers, employees and counterparties to the transaction, increased competitive pressures, changes in the interest rate environment, changes in general economic conditions, legislative and regulatory changes that adversely affect the business in which CNB Shares and Jacksonville Bancorp are engaged, changes in the securities markets and other risks and uncertainties. Undue reliance should not be placed on the forward-looking statements, which speak only as of the date hereof. Neither CNB Shares nor Jacksonville Bancorp undertakes, and each specifically disclaims any obligation, to publicly release the result of any revisions that may be made to update any forward-looking statement to reflect the events or circumstances after the date on which the forward-looking statement is made, or reflect the occurrence of unanticipated events, except to the extent required by law.\nAdditional Information\nIn connection with the proposed merger, Jacksonville Bancorp will provide its shareholders with a proxy statement and other relevant documents concerning the proposed transaction. Shareholders of Jacksonville Bancorp are urged to read the proxy statement and other relevant documents and any amendments or supplements to t", "external_links": ["https://www.globenewswire.com/Tracker?data=YvFJtq80Z9T3lWW22gTp3IIv3JAY26wU1SeYz8ywpBsiziyoxg-ghS25p4ozBa9oqVpsqbP7k5SKFEWHVyceN6DLnSjCXzFAs3-K8edA06ZUgwTLs_OgCI_Pdaw8tAlX", "https://www.globenewswire.com/Tracker?data=DsxVcd5vcM-o6hkebnqtgkhKm6A-cELMmagTvJtkrL6IIJhkSlEkG3Hw-8FbyhGjWbjC7K2Fv3uCUH0qe1U-zg==", "https://www.globenewswire.com/Tracker?data=7EFDQt3o-fxJDVv7lSAi0rLREU2Q6f2M-dR9uwiShxsvNxKa1IKtieneQavFIIKsZPFqFJg78hRNbCuavyjzOg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/bdc50e76-85b9-4d42-93d8-12db52ec56a2", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d5ced72b-b733-45d5-b9ff-67c3c5c9d7b5/en", "https://www.globenewswire.com/Tracker?data=YvFJtq80Z9T3lWW22gTp3IIv3JAY26wU1SeYz8ywpBtvGu_GSTWlLyoimVB2FNh1EgwA_Blo70eblge3mdLURdGu8zPPvPKtYSXjw50a4DYroyRYaXBnLEnwEHnRl6_J"], "published": "2018-01-18T17:05:00.000+02:00", "crawled": "2018-01-18T20:09:32.003+02:00", "highlightTitle": ""}