{"organizations": [], "uuid": "e6019e58cd515a27d5d41909e7bc5ae8f86e32ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-healthcare-trust-of-america-inc-expands-finance-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Healthcare Trust of America, Inc. Expands Finance Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.106, "site_type": "news", "published": "2018-01-03T16:22:00.000+02:00", "replies_count": 0, "uuid": "e6019e58cd515a27d5d41909e7bc5ae8f86e32ac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-healthcare-trust-of-america-inc-expands-finance-leadership-team.html", "ord_in_thread": 0, "title": "Healthcare Trust of America, Inc. Expands Finance Leadership Team", "locations": [], "entities": {"persons": [{"name": "caroline chiodo", "sentiment": "none"}, {"name": "scott d. peters", "sentiment": "none"}, {"name": "chiodo", "sentiment": "none"}, {"name": "caroline", "sentiment": "none"}], "locations": [{"name": "expands finance leadership team scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "healthcare trust of america, inc.", "sentiment": "neutral"}, {"name": "healthcare trust of america, inc", "sentiment": "neutral"}, {"name": "global research analyst at duff & phelps investment management company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 3, 2018 /PRNewswire/ -- Healthcare Trust of America, Inc. (NYSE:HTA), the largest dedicated owner and operator of medical office buildings in the United States, announced today the hiring of Caroline Chiodo, CFA, as Senior Vice President of Finance. In this role, Ms. Chiodo will focus on investor relations, capital markets, as well as operational and financial analysis.\n\"We are excited to welcome Caroline to the HTA team,\" stated Chairman and CEO Scott D. Peters. \"We have entered 2018 in the best position as a firm and believe Ms. Chiodo will greatly aid in articulating and executing on our future growth plan. Her analytical and strategic skill set will benefit HTA greatly in the future years.\"\nMs. Chiodo brings more than a decade of experience in the investment management industry, including roles with a REIT dedicated fund, as well as generalist roles at institutional investment firms. Most recently, Ms. Chiodo was a Global Research Analyst at Duff & Phelps Investment Management Company. In this role she was responsible for valuing individual securities on a fundamental basis across multiple real estate subsectors and producing investment recommendations in a dynamic market setting.\nCaroline holds a Bachelor of Science in Business from Indiana University, Kelley School of Business where she majored in Finance and International Studies. Ms. Chiodo is a Chartered Financial Analyst and member of the National Association of Real Estate Investment Trusts (NAREIT).\nAbout HTA\nHealthcare Trust of America, Inc. (NYSE: HTA) is the largest dedicated owner and operator of medical office buildings in the United States, based on gross leasable area. We provide the real estate infrastructure for the integrated delivery of healthcare services in highly desirable locations. Over the last decade, we have invested approximately $7.0 billion primarily in medical office buildings and other healthcare assets comprising over 24 million square feet of GLA. Our investments are targeted in key markets that we believe have superior healthcare demographics that support strong, long-term demand for medical office space. We have achieved, and continue to achieve, critical mass within these key markets by expanding our presence through accretive acquisitions, and utilizing our in-house operating expertise through our regionally located property management and leasing platform.\nFounded in 2006 and listed on the New York Stock Exchange in 2012, HTA has produced attractive returns for its stockholders that we believe have significantly outperformed the S&P 500 and US REIT indices. More information about HTA can be found on the Company's website at www.htareit.com .\nForward-Looking Language\nThis press release contains certain forward-looking statements. Forward-looking statements are based on current expectations, plans, estimates, assumptions and beliefs, including expectations, plans, estimates, assumptions and beliefs about HTA, stockholder value and earnings growth.\nThe forward-looking statements included in this press release are subject to numerous risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements. Assumptions relating to the foregoing involve judgments with respect to, among other things, future economic, competitive and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond HTA's control. Although HTA believes that the expectations reflected in such forward-looking statements are based on reasonable assumptions, HTA's actual results and performance could differ materially and in adverse ways from those set forth in the forward-looking statements. Factors which could have a material adverse effect on HTA's operations and future prospects include, but are not limited to:\nchanges in economic conditions affecting the healthcare property sector, the commercial real estate market and the credit market; competition for acquisition of medical office buildings and other facilities that serve the healthcare industry; economic fluctuations in certain states in which HTA's property investments are geographically concentrated; retention of HTA's senior management team; financial stability and solvency of HTA's tenants; supply and demand for operating properties in the market areas in which HTA operates; HTA's ability to acquire real properties, and to successfully operate those properties once acquired; changes in property taxes; legislative and regulatory changes, including changes to laws governing the taxation of REITs and changes to laws governing the healthcare industry; fluctuations in reimbursements from third party payors such as Medicare and Medicaid; changes in interest rates; the availability of capital and financing; restrictive covenants in HTA's credit facilities; changes in HTA's credit ratings; HTA's ability to remain qualified as a REIT; changes in accounting principles generally accepted in the United States of America, policies and guidelines applicable to REITs; delays in liquidating defaulted mortgage loan investments; and the risk factors set forth in HTA's most recent Annual Report on Form 10-K and in HTA's most recent Quarterly Reports on Form 10-Q.\nForward-looking statements speak only as of the date made. Except as otherwise required by the federal securities laws, HTA undertakes no obligation to update any forward-looking statements to reflect the events or circumstances arising after the date as of which they are made. As a result of these risks and uncertainties, readers are cautioned not to place undue reliance on the forward-looking statements included in this press release or that may be made elsewhere from time to time by, or on behalf of, HTA.\nFinancial Contact:\nRobert A. Milligan\nChief Financial Officer\nHealthcare Trust of America, Inc.\n480.998.3478\nRobertMilligan@htareit.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/healthcare-trust-of-america-inc-expands-finance-leadership-team-300576823.html\nSOURCE Healthcare Trust of America, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/healthcare-trust-of-america-inc-expands-finance-leadership-team-300576823.html"], "published": "2018-01-03T16:22:00.000+02:00", "crawled": "2018-01-03T16:27:31.018+02:00", "highlightTitle": ""}