{"organizations": [], "uuid": "67babfd5f93578e999302f6f3a964167c60cd462", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223032418&w=1200&r=LYNXMPEE0H115", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-canada/canada-heads-back-to-gold-medal-drawing-board-idUSKBN1F71QP", "country": "US", "domain_rank": 408, "title": "Canada heads back to gold medal drawing board", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:27:00.000+02:00", "replies_count": 0, "uuid": "67babfd5f93578e999302f6f3a964167c60cd462"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-canada/canada-heads-back-to-gold-medal-drawing-board-idUSKBN1F71QP", "ord_in_thread": 0, "title": "Canada heads back to gold medal drawing board", "locations": [], "entities": {"persons": [{"name": "steve keating", "sentiment": "negative"}, {"name": "sidney crosby", "sentiment": "none"}, {"name": "wayne gretzky", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "corner brook", "sentiment": "none"}, {"name": "hockey canada", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "newfoundland", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "national hockey league", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:30 PM / Updated 7 hours ago Canada heads back to gold medal drawing board Steve Keating 5 Min Read \nTORONTO (Reuters) - When the International Olympic Committee opened the doors of the Winter Games to National Hockey League players in 1998 picking a Team Canada was so simple everyone could do it. And they did. \nFrom bar stools in Corner Brook, Newfoundland to Victoria, British Columbia armchair coaches and general managers assembled their gold medal squads as thoughtfully and meticulously as those sitting around the table in the Hockey Canada war room. \nEvery four years the entire exercise became a fun-filled fantasy league national obsession. \nWith a Hall of Fame talent pool filled with names more familiar to hockey mad Canadians than Prime Ministers and pop stars it was a failsafe process. \nAfter all, it did not take a hockey genius IQ to fill up a roster card with names like Wayne Gretzky and Sidney Crosby, the only debate spinning around fourth line wingers and backup netminders. \nOnce the official Team Canada selections were made they were revealed to rapturous fanfare on prime time national television and everyone compared notes. \nBut with the NHL having decided it would no longer be part of the Olympics, at least not in South Korea, the unveiling of Canada’s men’s team for the Pyeongchang Winter Games on Jan. 10 was greeted with a collective shrug. \nThere was no breathless anticipation of the moment and no glitzy production as in the past, only a low key midday announcement conducted at Hockey Canada headquarters in Calgary where a mostly unknown collection of NHL castoffs cobbled together from far flung leagues and countries were tasked with bringing home a third consecutive Olympic gold medal. \nA few of the names like Chris Kelly, who played in 833 NHL games and won a Stanley Cup with the Boston Bruins, and Derek Roy, who suited up for 738 NHL contests and once scored 32 goals for the Buffalo Sabres, may have had a ring of familiarity for Canadian hockey fans. \nBut most are forgotten names playing in remote hockey outposts like Gilbert Brule, taken with the sixth overall selection in the 2005 NHL draft by the Columbus Blue Jackets, who now earns a living with Kunlun Red Star, the China-based team in KHL. \nSome like Chris Lee and Chay Genoway, who between them have one combined game of NHL experience, have found jobs in Russia with Metallurg Magnitogorsk and Lada Togliatti respectively. \nIt is a hand-crafted team constructed from spare parts unlike the top shelf products Canada has iced since 1998. \n”It’s not been done this way before,“ national team general manager Sean Burke told Reuters. ”There are some similarities to teams we had before the NHL was going but it really hasn’t been put together this way before so it is a challenge. \n”If you are sending the NHL to the Olympics you are sending the best of the best. \n”You know who the top players are. \n“This time around you really have to watch players in different leagues, project guys that are playing against different competition and try and build a team that way with older guys, younger guys, guys with some international experience, guys with none.” TEAM CONCEPT \nBefore the NHL decided in 1998 that Olympic participation was a good thing Canada constructed its Winter Games squad around the national team concept. \nBoth Burke and Hockey Canada CEO Tom Renney were part of that process with players and coaches centralizing in one location, living together and barnstorming the world playing tournaments and exhibition games culminating with the Olympics. \nThe last time the Olympic ice hockey tournament was played without NHL players was at the 1994 Lillehammer Winter Games where Canada lost to Sweden in the final. \nWithout NHLers Canada struggled to find the top of the Olympic podium, enduring a 50-year gold medal drought before finally reclaiming the crown at the 2002 Salt Lake City Winter Games. \nWith professionals Canada restored its status as the sport’s global superpower taking gold in 2002, 2010 and 2014. \nBut even with names like Gretzky and Crosby, gold was not a given as Canada’s best produced a couple of Olympic failures, coming home empty-handed in 1998 and 2006. \nAll stars or castoffs, Renney believes the Olympic tournament should not be devalued. \n“I think the tournament is going to be great,” Renney, coach of Canada’s silver medal-winning team in Lillehammer told Reuters. \n”That fact is this is the Olympic Games and it will draw out the very best in every single athlete. That is the spirit of the Olympic Games. \n“I think people will watch it, I think people should there will be 25 players, 25 phenomenal stories that will help people embrace the team and the event and be proud Canadians doing it.” Editing by Ed Osmond", "external_links": [], "published": "2018-01-18T15:27:00.000+02:00", "crawled": "2018-01-18T15:38:29.032+02:00", "highlightTitle": ""}