{"organizations": [], "uuid": "3ab526a8646adad15309ef4a18852026403335c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-auris-medical-announces-pricing-of-5-point-5-million-registered-direct-offering.html", "country": "US", "domain_rank": 767, "title": "Auris Medical Announces Pricing of $5.5 Million Registered Direct Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:31:00.000+02:00", "replies_count": 0, "uuid": "3ab526a8646adad15309ef4a18852026403335c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-auris-medical-announces-pricing-of-5-point-5-million-registered-direct-offering.html", "ord_in_thread": 0, "title": "Auris Medical Announces Pricing of $5.5 Million Registered Direct Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "zug", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "ladenb", "sentiment": "none"}], "organizations": [{"name": "auris medical holding ag", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "ladenburg thalmann & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Zug, Switzerland, January 29, 2018 - Auris Medical Holding AG (\"Auris Medical\", NASDAQ: EARS), a clinical-stage company dedicated to developing therapeutics that address important unmet medical needs in otolaryngology, today announced that it has entered into a securities purchase agreement with investors providing for the purchase and sale of 12,499,999 common shares at a price of $0.44 per share (payable in Swiss Francs) in a registered direct offering, resulting in total gross proceeds of approximately $5.5 million (or approximately CHF 5.1 million). The Company also agreed to issue warrants to purchase up to an aggregate of 7,499,999 common shares to the investors in a concurrent private placement. The warrants have an exercise price of $0.50 per share. The warrants will be exercisable immediately upon the closing date and will expire seven years from the date they become exercisable. The closing of the offering is expected to take place on or about January 30, 2018, subject to the satisfaction of customary closing conditions.\nLadenburg Thalmann & Co. Inc., a subsidiary of Ladenburg Thalmann Financial Services Inc. (NYSE American:LTS), is acting as exclusive placement agent for the registered direct offering and the concurrent private placement.\nThe common shares were offered pursuant to a shelf registration statement on Form F-3 (File No. 333-206710), which was declared effective by the United States Securities and Exchange Commission (\"SEC\") on September 10, 2015. The warrants and shares issuable upon exercise of the warrants were offered in a concurrent private placement not registered under the Securities Act of 1933, as amended. Auris Medical has agreed to file a registration statement on Form F-1 with the SEC covering the resale of the common shares issuable upon exercise of the warrants.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy these securities, nor will there be any sale of these securities in any jurisdiction in which such offer solicitation or sale are unlawful prior to registration or qualification under securities laws of any such jurisdiction. A prospectus supplement relating to the common shares will be filed by Auris Medical with the SEC. When available, copies of the prospectus supplement, together with the accompanying prospectus, can be obtained at the SEC's website at www.sec.gov or from Ladenburg Thalmann & Co. Inc., Attn: Syndicate Department, 277 Park Avenue, 26th Floor, New York, New York 10172 or by email at prospectus@ladenburg.com .\nAbout Auris Medical\nAuris Medical is a Swiss biopharmaceutical company dedicated to developing therapeutics that address important unmet medical needs in neurotology. The company is focused on the Phase 3 development of treatments for acute inner ear hearing loss (AM-111) and for acute inner ear tinnitus (Keyzilen ® ; AM-101) by way of intratympanic administration with biocompatible gel formulations. In addition, Auris Medical is developing intranasal betahistine for the treatment of vertigo (AM-125) as well as early-stage research and development projects. The Company was founded in 2003 and is headquartered in Zug, Switzerland. The shares of Auris Medical Holding AG trade on the Nasdaq Capital Market under the symbol \"EARS.\"\nForward-looking Statements\nThis press release may contain statements that constitute \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are statements other than historical fact and may include statements that address future operating, financial or business performance or Auris Medical's strategies or expectations. In some cases, you can identify these statements by forward-looking words such as \"may,\" \"might,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" \"projects,\" \"potential,\" \"outlook\" or \"continue,\" and other comparable terminology. Forward-looking statements are based on management's current expectations and beliefs and involve significant risks and uncertainties that could cause actual results, developments and business decisions to differ materially from those contemplated by these statements. These risks and uncertainties include, but are not limited to, Auris Medical's need for and ability to raise substantial additional funding to continue the development of its product candidates, the timing and conduct of clinical trials of Auris Medical's product candidates, including the likelihood that the TACTT3 clinical trial with Keyzilen ® will not meet its endpoints, the clinical utility of Auris Medical's product candidates, the timing or likelihood of regulatory filings and approvals, Auris Medical's intellectual property position and Auris Medical's financial position, including the impact of any future acquisitions, dispositions, partnerships, license transactions or changes to Auris Medical's capital structure, including future securities offerings. These risks and uncertainties also include, but are not limited to, those described under the caption \"Risk Factors\" in Auris Medical's Annual Report on Form 20-F and future filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made, and Auris Medical does not undertake any obligation to update them in light of new information, future developments or otherwise, except as may be required under applicable law. All forward-looking statements are qualified in their entirety by this cautionary statement.\nCompany contact: Hernan Levett, Chief Financial Officer, +41-61-201-1350, hle@aurismedical.com\nInvestor contact: Daniel Ferry, LifeSci Advisors, LLC, +1-617-535-7746, investors@aurismedical.com\nSource:Auris Medical AG", "external_links": ["https://www.globenewswire.com/Tracker?data=Sw1MhwupOGpFI2hU4DvAK8ywDsUrVHe5nzPrvox_QuLHZ1jrci_bq9jiQ7_ztbiBnZGY0sStEbg0xazBTX8rm7t-Wsh5OedJYjoIX4RU2P0=", "https://www.globenewswire.com/Tracker?data=XjYjXzGd0noM6baoE_UYrB3DYAqoaQLpN3az_oBiuMWFsJQr6KrRXMz4X6d5sqzW7rojGh9_CFIsQ2bnD9WJt2g8w-FsVl71tuRddxnreHtEJHyWbkMbL1XldQ20CZfFS453BtEcDiF1UUQhiUP9fMq9iiAJx41y1DCvChvCQC3sn_mwBU1jmJhh-swxW3Ot1Pk8QDfNCPr2G7FqBDU9DTGaY7ptwRPu9FCjqd_JhoUCbO-lphb9z9ouTlTiwqYPrLwb_ySEQ4Ag6885h7jgwZkHhaQPV2Qum57Ig2vhIhA="], "published": "2018-01-30T00:31:00.000+02:00", "crawled": "2018-01-30T03:53:35.022+02:00", "highlightTitle": ""}