{"organizations": [], "uuid": "c45f6d70bef0ead40f574e1b2d1871da68cb42b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936801-GettyImages-903030184.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/as-companies-give-bonuses-prospect-of-pay-gains-still-hazy.html", "country": "US", "domain_rank": 767, "title": "As companies give bonuses, prospect of pay gains still hazy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.765, "site_type": "news", "published": "2018-01-11T16:43:00.000+02:00", "replies_count": 0, "uuid": "c45f6d70bef0ead40f574e1b2d1871da68cb42b3"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/11/as-companies-give-bonuses-prospect-of-pay-gains-still-hazy.html", "ord_in_thread": 0, "title": "As companies give bonuses, prospect of pay gains still hazy", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of america and nationwide insurance", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "jetblue airways", "sentiment": "none"}, {"name": "u.s. bancorp", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "American Airlines is handing out $1,000 bonuses to its employees. So are AT&T , Bank of America and Nationwide Insurance. The same for Comcast , JetBlue Airways and U.S. Bancorp .\nSuch announcements , coming from dozens of companies, have followed the passage of the Republican tax plan that President Donald Trump signed into law last month. The plan slashed the corporate tax rate from 35 percent to 21 percent. The companies say the bonuses announced are a way to share some of the bounty with workers.\nThe bonuses are one-time payouts, not the permanent pay raises that Trump and congressional Republicans have said will eventually result from the corporate tax cuts. Over time, bonuses are far less valuable to employees than wage increases.\nSo far, most companies haven't said whether any permanent pay increases are in the works. Economists caution that the corporate income tax cut's effect on average pay, if any, might not become apparent for several years.\n\"As a worker, it's great to get a one-off bonus, but that doesn't guarantee anything for the next year,\" said Stephen Stanley, chief economist at Amherst Pierpont. \"You'd rather have the raise, because next year you're working off the higher base.\"\nEventually, Stanley thinks the lower corporate tax rates will lead to worker pay raises. He expects companies over the next several years to use some of their windfalls to invest in equipment that would make workers more productive and lead to higher wages.\nOther economists remain skeptical that workers stand to receive sharp wage increases. They note that the corporate tax cut will overwhelmingly benefit shareholders and company owners. That sentiment is one reason stock market indexes are setting new highs almost daily.\n\"The bulk of the corporate tax cuts should accrue to people who hold stock in companies,\" said Ethan Harris, chief economist at Bank of America Merrill Lynch. \"Workers benefit much more from a cut in taxes on ordinary income. In other words, better to get a direct cut than a spillover from cuts to others.\"\nBeyond the worker bonuses that have been announced, typically for $1,000, about a dozen banks have said a increase in minimum wages is coming. A handful of mostly small companies, including Washington Federal Bank , have announced pay increases for most of their workforces. And a few, including Visa and Aflac , have said there will be increased contributions to employees' retirement plans.\nOn Wednesday, Waste Management became the latest large company to announce bonuses. It said it would hand out $2,000 for up to 34,000 employees.\nIn addition, U.S. workers will begin receiving more take-home pay, likely by next month, as lower tax rates for individuals under the Republican plan kick in.\nThe Communications Workers of America, a labor union, asked CEOs of large corporations to give workers the $4,000 average income gain that White House officials said would flow eventually from lower corporate taxes. AT&T, the first company to announce bonuses, said it chose the $1,000 bonus instead.\nAmerican Airlines, which also employs the communication union's members, similarly decided to bestow a $1,000 bonus. The union said it appreciated the gesture but asserted in a statement that the bonus \"falls short of the permanent wage increase that working families were promised.\"\nThe White House has touted the announced bonuses as evidence that the corporate tax cut is benefiting workers, rather than just shareholders, and has dubbed the payouts a \"Trump bonus.\"\n\"Businesses across America have already started to raise wages, and more than 100 companies have already given bonuses and other benefits to hundreds of thousands of workers as a result of these massive tax cuts,\" Trump said Monday in Nashville.\nThe conservative group Americans for Tax Reform, which backed the tax cut, has compiled a list of more than 100 companies that have announced some kind of financial benefit for employees resulting from the tax cut.\nOnly a few have announced any broad-based pay increases. One that has is Nephron Pharmaceuticals , based in West Columbia, South Carolina . Nephron said it would give a 5 percent raise to most of its 640 employees.\nAndrew Chamberlain, chief economist at Glassdoor, said there are practical reasons why most companies would prefer bonuses over pay raises.\n\"It's a way for employers to benefit workers without being on the hook for a long-term pay increases,\" Chamberlain said.\nIn some cases, the companies are sharing only a sliver of their tax-cut windfalls. Bank of America's bonuses will cost it roughly $145 million — only about 4 percent of the $3.5 billion that Goldman Sachs estimates Bank of America will receive from the tax cut.\nLikewise, KBW, an investment firm, estimates that Wells Fargo's commitments to raise its minimum wage to $15 an hour and to boost its charitable contributions will equal about 5 percent of the additional profits the tax cut will provide Wells.\nMost economists do expect paychecks to start rising faster for most workers this year but for a different reason: The unemployment rate is projected to fall further and could reach a five-decade low of 3.5 percent. A rate that low would likely force many companies to sharply raise pay to keep and attract the workers needed.\nEconomists like Stanley, who expects the corporate tax cut to lift wages over time, think it will happen indirectly as companies channel their tax savings into machinery, computers and software, making workers productive and leading to higher pay.\n\"These things aren't going to happen right away, but they will gradually follow through in the next several years,\" Stanley said.", "external_links": [], "published": "2018-01-11T16:43:00.000+02:00", "crawled": "2018-01-11T16:43:12.002+02:00", "highlightTitle": ""}