{"organizations": [], "uuid": "5f55fc8ab5b152325f8d5d4c983ad1705ecc0c6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225540213&w=1200&r=LYNXMPEE0P128", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/honeywell-intl-results/honeywell-to-repatriate-7-billion-over-two-years-idINKBN1FF27O", "country": "US", "domain_rank": 408, "title": "Honeywell to repatriate $7 billion over two years", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:58:00.000+02:00", "replies_count": 0, "uuid": "5f55fc8ab5b152325f8d5d4c983ad1705ecc0c6d"}, "author": "", "url": "https://in.reuters.com/article/honeywell-intl-results/honeywell-to-repatriate-7-billion-over-two-years-idINKBN1FF27O", "ord_in_thread": 0, "title": "Honeywell to repatriate $7 billion over two years", "locations": [], "entities": {"persons": [{"name": "ankit ajmera", "sentiment": "none"}, {"name": "tom szlosek", "sentiment": "none"}, {"name": "darius adamczyk", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "honeywell", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "honeywell international inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - U.S. industrial conglomerate Honeywell International Inc said on Friday that it expected to bring back at least $7 billion of the $10 billion in cash held overseas in the next two years, taking advantage of the newly enacted tax law.\nShares of Honeywell, which makes everything from jet engines to thermostats, rose as much as 1.2 percent in morning trading to hit a record of $163.85.\nThe cash hoard will help fuel Honeywell’s M&A strategy under new Chief Executive Darius Adamczyk, who is looking to bolster its core operations such as aerospace following the spin off its home and transportation businesses later this year.\n“Our preference is for attractive bolt-on acquisitions,” said Chief Financial Officer Tom Szlosek, who also promised “competitive” dividend and share buybacks using the repatriated cash.\nAlthough the company reported a huge loss due to a $3.8 billion tax provision in the fourth quarter, its adjusted profit narrowly beat analysts’ estimates due to strength across all of its divisions.\nHoneywell also raised its 2018 earnings forecast and said it was seeing a greater level of confidence from its customers, who may now have more cash on hand to spend due to the new tax law.\n“Their capex is our revenue, and we do expect some level of investment to accelerate (later in 2018),” Adamczyk said on a conference call.\nSales in its aerospace unit, its biggest business that makes aircraft engines for Bombardier Inc, Textron Inc and General Dynamics Corp, rose 6.4 percent to $3.90 billion in the quarter ended Dec. 31.\nMuch of the growth in the business was driven by its commercial aviation aftermarket division as a rise in travel demand boosted sales of spare parts and services to the airline industry.\nHoneywell is also benefiting from increased demand from oil and gas customers in the wake of stabilizing oil prices, while its business that makes supply chain and warehouse automation equipment and software is riding an ecommerce boom.\nExcluding the tax-related charge, Honeywell earned $1.85 per share, compared with analysts’ expectations of $1.84, according to Thomson Reuters I/B/E/S.\nRevenue rose 8.6 percent to $10.84 billion, topping estimates of $10.75 billion.\nThe company raised its 2018 per-share earnings forecast range to $7.75 to $8.00 from $7.55 to $7.80 estimated previously.\nIt is conservatively using the higher end of the 22-23 percent tax rate for the updated forecast, suggesting healthy upside, RBC Capital Markets analyst Deane Dray said.\nUp to Thursday’s close, Honeywell’s stock had risen 37.3 percent in the past 12 months, far outperforming a 23.5 percent increase in the S&P 500 index.\nReporting by Ankit Ajmera in Bengaluru; Editing by Anil D'Silva\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-26T18:58:00.000+02:00", "crawled": "2018-01-26T19:18:57.000+02:00", "highlightTitle": ""}