{"organizations": [], "uuid": "42beb948de3af75be38e7ef8232cb75eadbc0b9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/kenya-budget/update-2-kenya-pledges-to-try-to-live-within-its-means-after-criticism-idUSL8N1PH2NI", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Kenya pledges to try to live within its means after criticism", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:57:00.000+02:00", "replies_count": 0, "uuid": "42beb948de3af75be38e7ef8232cb75eadbc0b9a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/kenya-budget/update-2-kenya-pledges-to-try-to-live-within-its-means-after-criticism-idUSL8N1PH2NI", "ord_in_thread": 0, "title": "UPDATE 2-Kenya pledges to try to live within its means after criticism", "locations": [], "entities": {"persons": [{"name": "henry rotich", "sentiment": "none"}, {"name": "duncan miriri", "sentiment": "none"}, {"name": "uhuru kenyatta", "sentiment": "none"}], "locations": [{"name": "nairobi", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "mombasa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Targets fiscal deficit of 6.0 pct of GDP in 2018/19\n* Says has a target of 3.0 pct deficit target by 2022\n* Lowers 2017 economic growth estimate to 4.8 pct (Adds finance minister, 2017 growth)\nBy Duncan Miriri\nNAIROBI, Jan 22 (Reuters) - Kenya plans to cut spending to lower its budget deficit to internationally acceptable levels in the next five years, the Treasury said in a budget document, after investors criticised the fiscal gap.\nThe deficit grew to 8.9 percent of gross domestic product in the financial year to last June. The ministry of finance said it would be reduced to 6.0 percent in the financial year from next July and to 3.0 percent by 2022.\n“We are clearly conscious of our limited fiscal space,” Henry Rotich, the finance minister, said in a draft budget policy statement seen by Reuters on Monday.\nKenya has been criticised for failing to cut borrowing after ramping up debt in the past five years. The funds went to fund a range of ambitious infrastructure projects, including a modern railway line from the port of Mombasa.\nPresident Uhuru Kenyatta’s government contracted debt from international capital markets, nations like China and other entities like the African Development Bank since 2013, to build much-needed roads, bridges and power plants.\nThat drove up total public debt to more than 50 percent of GDP, angering citizens who accuse the government of mortgaging future generations, and investors who said the debt was undermining Kenya’s economic credentials.\nLast month, the World Bank said the wide fiscal deficit was one of the main risks facing Kenya’s economic outlook.\nRotich said the government would partner with private companies to build infrastructure, allowing the government to use its own funds to roll out universal health care, boost food security, support manufacturing and build affordable houses.\nKenyatta, who was sworn in for a second term in late November, has identified the four areas as his priorities for the next five years.\n“This will accelerate economic growth, create jobs and reduce poverty,” Rotich said.\nEconomic growth was estimated at 4.8 percent last year, the finance ministry said in the document, lowering the government’s last estimate of 5.1 percent growth for the year, which was issued last November.\nIt blamed the uncertainty brought by the prolonged presidential election, after the Supreme Court nullified the initial vote and ordered a repeat, and a drought in the first quarter. The economy grew 5.8 percent the previous year.\nEditing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T21:57:00.000+02:00", "crawled": "2018-01-23T17:57:01.004+02:00", "highlightTitle": ""}