{"organizations": [], "uuid": "38365bddaeae72f50b1cf9198a0e0c8e654f453c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-avidbank-holdings-inc-announces-net-income-of-1009000-for-the-fourth-quarter-of-2017-and-5654000-for-the-year-ended-2017.html", "country": "US", "domain_rank": 767, "title": "Avidbank Holdings, Inc. Announces Net Income of $1,009,000 for the Fourth Quarter of 2017 and $5,654,000 for the Year Ended 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "38365bddaeae72f50b1cf9198a0e0c8e654f453c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-avidbank-holdings-inc-announces-net-income-of-1009000-for-the-fourth-quarter-of-2017-and-5654000-for-the-year-ended-2017.html", "ord_in_thread": 0, "title": "Avidbank Holdings, Inc. Announces Net Income of $1,009,000 for the Fourth Quarter of 2017 and $5,654,000 for the Year Ended 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "northern california", "sentiment": "none"}], "organizations": [{"name": "avidbank holdings, inc.", "sentiment": "neutral"}, {"name": "avidbank holdings, inc", "sentiment": "neutral"}, {"name": "avidbank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Avidbank Holdings, Inc. (\"the Company\") (OTC Pink: AVBH), a bank holding company and the parent company of Avidbank (\"the Bank\"), an independent full-service commercial bank serving businesses and consumers in Northern California, announced unaudited consolidated net income of $1,009,000 for the fourth quarter of 2017 compared to $1,122,000 for the same period in 2016. Results for the fourth quarter of 2017 included a $1.1 million charge to income tax expense as a result of the Tax Cuts and Jobs Act of 2017.\nFull Year and Fourth Quarter 2017 Financial Highlights\nNet income was $5,654,000 in 2017 compared to $7,263,000 in 2016. Net income in 2016 excluding benefits from life insurance proceeds of $1,472,000 was $5,791,000. Net income in 2017 excluding the $1.1 million impact from the tax law change was $6,755,000. Net income in 2017 included a loan loss provision of $1,985,000 while a loan loss provision of $813,000 was recognized in 2016. Net interest income was $30,528,000 in 2017, an increase of $6,267,000 or 26% over the figure recorded in 2016. Diluted earnings per common share (EPS) were $1.08 in 2017, compared to $1.56 in 2016. Diluted EPS for 2017 without the $1.1 million tax law change would have been $1.29. Weighted average common shares outstanding were 5,138,604 and 4,521,392 in 2017 and 2016, respectively. The increase was primarily the result of a $20,000,000 capital raise completed during the third quarter of 2017. Net interest income was $8,182,000 for the fourth quarter of 2017, an increase of $1,742,000 over the $6,440,000 we achieved in the fourth quarter of 2016. The 27% increase over the prior year quarter reflects the impact of our loan growth over the past twelve months. Net income was $1,009,000 for the fourth quarter of 2017, compared to $1,122,000 for the fourth quarter of 2016. Net income in the fourth quarter of 2017 excluding the $1.1 million impact from the tax law change would have been $2,110,000. Results for the fourth quarter of 2017 included a $106,000 loan loss provision compared to a loan loss provision of $813,000 in the fourth quarter of 2016. Diluted earnings per common share were $0.17 for the fourth quarter of 2017, compared to $0.24 for the fourth quarter of 2016. Diluted EPS for the fourth quarter of 2017 without the $1.1 million tax law change would have been $0.36. Total assets grew by 21% in 2017, ending the fourth quarter at $783 million. Total loans net of deferred fees grew by 26% in 2017, ending the fourth quarter at $648 million. Total deposits grew by 14% in 2017, ending the fourth quarter at $646 million. The Company continues to be well capitalized for regulatory purposes with a Tier 1 Leverage Ratio of 11.4%, a Tier 1 Risk Based Capital and Common Equity Tier 1 Risk Based Capital Ratio of 10.7%, and a Total Risk Based Capital Ratio of 13.1%.\nMark D. Mordell, Chairman and Chief Executive Officer, stated, \"Net interest income increased to $8.2 million in the fourth quarter of 2017, a 27% increase over the fourth quarter of 2016 due to our loan growth over the past twelve months. Loans grew a record $70 million in the fourth quarter as we achieved solid growth in all our divisions: specialty finance, commercial real estate, commercial and construction lending. We are committed to a growth strategy to achieve optimal profitability and have made substantial investments in personnel and facilities to help realize that goal responsibly. Our $20 million capital raise completed in July 2017 has provided us with the capacity required to grow the loan portfolio. We are well positioned to continue the franchise growth strategy to scale our balance sheet and infrastructure to serve our markets.”\nMr. Mordell continued, \"In 2017 we added both business development and support staff to sustain and manage our growth. We have also expanded and relocated our facilities to accommodate our growth in staff as well as increase staff retention due to more favorable commute times. Non-interest expenses increased by $0.7 million to $5.2 million in the fourth quarter of 2017 from $4.5 million in the fourth quarter of 2016, primarily due to these increased investments. Our efficiency ratio improved to 60.4% in the fourth quarter of 2017 from 64.5% in the fourth quarter 2016 due to increased earnings from our loan growth. Total deposits decreased by $13 million in the fourth quarter of 2017 compared to the third quarter of 2017 and increased by $78 million from the same quarter in 2016. The decline in deposits for the fourth quarter of 2017 was primarily due to a decrease in demand deposits and brokered deposits. Our net interest margin grew to 4.32% in 2017 compared to 4.06% in 2016 due to changes in the mix of earning assets in favor of higher yielding loans. Return on assets was 0.77% in 2017 compared to 1.14% in 2016. Return on assets excluding the impact of the tax law change was 0.91% in 2017.\"\nResults for the twelve months ended December 31, 2017\nNet interest income before provision for loan losses was $30.5 million in 2017, an increase of $6.3 million or 26% over the prior year. Higher outstanding average loan balances were the primary reason for the increase. Average total loans were $573 million for 2017 compared to $439 million for 2016. Average earning assets were $706 million in 2017, an 18% increase over the prior year. Net interest margin was 4.32% in 2017 compared to 4.06% for 2016. The increase in net interest margin was primarily caused by an increase in higher yielding loans in the mix of earning assets. A loan loss provision of $1,985,000 was recorded in 2017 and a loan loss provision of $813,000 was taken in 2016. We had no charge-offs and recoveries of $68,000 in 2017 compared to no charge-offs and recoveries of $37,000 for 2016.\nNon-interest income was $1,887,000 in 2017, a decrease of $1,333,000 or 41% compared to 2016. When the $1,472,000 in life insurance proceeds recognized in the second quarter of 2016 is excluded, non-interest income was $139,000 higher in 2017 as a result of increased service charges.\nNon-interest expense increased by $3.8 million to $19.6 million in 2017 compared to $15.8 million in 2016 due primarily to increased investments in loan production and support personnel and expanded facilities to accommodate the growth in staff.\nThe effective tax rate was 47.8% in 2017 compared to 33.2% for the same period in 2016. The unusually high effective tax rate in 2017 was due to the income tax expense charge from the passage of the Tax Cuts and Jobs Act at the end of the year. The lower effective tax rate in 2016 was due to non-taxable proceeds from life insurance benefits.\nResults for the quarter ended December 31, 2017\nFor the three months ended December 31, 2017, net interest income before provision for loan losses was $8.2 million, an increase of $1.7 million or 27% compared to the fourth quarter of 2016. The increase was primarily the result of higher average loans outstanding. Average total loans outstanding for the quarter ended December 31, 2017 were $599 million, compared to $477 million for the same quarter in 2016, an increase of 26%. Average earning assets were $750 million in the fourth quarter of 2017, a 21% increase over the fourth quarter of the prior year. Loans made up 80% of average earning assets at the end of the fourth quarter of 2017 compared to 77% at the end of the fourth quarter of 2016. Net interest margin was 4.33% for the fourth quarter of 2017, compared to 4.14% for the fourth quarter of 2016. A loan loss provision of $106,000 was taken in the fourth quarter of 2017 compared with a loan loss provision of $813,000 taken in the fourth quarter of 2016.\nNon-interest income was $475,000 in the fourth quarter of 2017, a decrease of $65,000 or 12% compared to the fourth quarter of 2016. The decrease was primarily due to $151,000 of income from an FHLB special dividend in the fourth quarter of 2016.\nNon-interest expense increased by $727,000 in the fourth quarter of 2017 to $5,232,000 compared to $4,505,000 for the fourth quarter of 2016. This increase was primarily due to higher compensation costs related to increased staffing and increased occupancy costs due to the expansion of our facilities. The Bank's full time equivalent employees at December 31, 2017 and 2016 were 84 and 68, respectively. The Bank's efficiency ratio improved from 64.5% in the fourth quarter of 2016 to 60.4% in the fourth quarter of 2017 due to growth in net interest income.\nBalance Sheet\nTotal assets increased to $783.0 million as of December 31, 2017, compared to $763.8 million at September 30, 2017 and $646.7 million on the same day one year ago. The increase in total assets of $19.2 million, or 3%, from September 30, 2017 was primarily due to FHLB borrowings in the fourth quarter of 2017. The Company reported total loans at December 31, 2017 of $648.3 million, which represented an increase of $69.8 million, or 12%, from $578.5 million at September 30, 2017, and an increase of $133.5 million, or 26%, over $514.8 million at December 31, 2016. The increase in total loans from September 30, 2017 was primarily attributable to growth in commercial real estate, multi-family, specialty finance and construction loans. The increase in loans from December 31, 2016 was primarily attributable to growth in commercial real estate, construction and commercial loans.\n\"We had $5.2 million in non-accrual loans comprising 0.79% of total loans from one relationship on December 31, 2017 compared to no non-accrual loans at the end of the prior year,” observed Mr. Mordell.\nThe Company’s total deposits were $646.4 million as of December 31, 2017, which represented a decrease of $13.3 million, or 2%, compared to $659.7 million at September 30, 2017 and an increase of $78.4 million, or 14%, compared to $568.0 million at December 31, 2016. The decrease in deposits from September 30, 2017 was due to a decrease in demand deposits and brokered deposits. The increase from December 31, 2016 was caused by an increase in demand deposits, CDs greater than $100,000 and money market accounts. The Company had $30 million of Federal Home Loan Bank advances outstanding as of December 31, 2017.\nDemand and interest bearing transaction deposits represented 45% of total deposits at December 31, 2017, compared to 47% at September 30, 2017 and 46% for the same period one year ago. Core deposits, which include transaction deposits, money market accounts and CDs below $250,000, represented 87% of total deposits at December 31, 2017, compared to 87% at September 30, 2017 and 86% at December 31, 2016. The Company’s loan to deposit ratio was 100% at December 31, 2017 compared to 88% at September 30, 2017 and 91% at December 31, 2016.\nAbout Avidbank\nAvidbank Holdings, Inc. (OTC Pink: AVBH), headquartered in San Jose, California, offers innovative financial solutions and services. We specialize in commercial & industrial lending, technology and asset-based lending, specialty finance, real estate construction and commercial real estate lending. Avidbank provides a different approach to banking. We do what we say.\nForward-Looking Statement:\nThis news release contains statements that are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts, and generally include the words “believes,” “plans,” “intends,” “expects,” “opportunity,” “anticipates,” “targeted,” “continue,” “remain,” “will,” “should,” “may,” or words of similar meaning. While we believe that our forward-looking statements and the assumptions underlying them are reasonably based, such statements and assumptions, are, by their nature subject to risks and uncertainties, and thus could later prove to be inaccurate or incorrect. Accordingly, actual results could materially differ from forward-looking statements for a variety of reasons, including, but not limited to local, regional, national and international economic conditions and events and the impact they may have on us and our customers, and in particular in our market areas; ability to attract deposits and other sources of liquidity; oversupply of property inventory and deterioration in values of California real estate, both residential and commercial; a prolonged slowdown or decline in construction activity; changes in the financial performance and/or condition of our borrowers; changes in the level of non-performing assets and charge-offs; the cost or effect of acquisitions we may make; the effect of changes in laws and regulations (including laws, regulations and judicial decisions concerning financial reform, capital requirements, taxes, banking, securities, employment, executive compensation, insurance, and information security) with which we and our subsidiaries must comply; changes in estimates of future reserve requirements and minimum capital requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; ability to adequately underwrite for our asset based and corporate finance lending business lines; our ability to raise capital; inflation, interest rate, securities market and monetary fluctuations; cyber-security threats including loss of system functionality or theft or loss of data; political instability; acts of war or terrorism, or natural disasters, such as earthquakes, or the effects of pandemic flu; destabilization in international economies resulting from the European sovereign debt crisis; the effects of the Tax Cuts and Jobs Act; the timely development and acceptance of new banking products and services and perceived overall value of these products and services by users; changes in consumer spending, borrowing and savings habits; technological changes; the ability to increase market share, retain customers and control expenses; ability to retain and attract key management and personnel; changes in the competitive environment among financial and bank holding companies and other financial service providers; continued volatility in the credit and equity markets and its effect on the general economy; the effect of changes in accounting policies and practices, as may be adopted by the regulatory agencies, as well as the Public Company Accounting Oversight Board, the Financial Accounting Standards Board and other accounting standard setters; changes in our organization, management, compensation and benefit plans, and our ability to retain or expand our management team; the costs and effects of legal and regulatory developments including the resolution of legal proceedings or regulatory or other governmental inquiries and the results of regulatory examinations or reviews; our success at managing the risks involved in the foregoing items. We do not undertake, and specifically disclaim any obligation to update any forward-looking statements to reflect occurrences or unanticipated events or circumstances after the date of such statements except as required by law.\nAvidbank Holdings, Inc. Consolidated Balance Sheets ($000, except share and per share amounts) (Unaudited) Assets\n12/31/17\n9/30/17\n6/30/17\n3/31/17\n12/31/16\nCash and due from banks $10,650 $11,068 $10,845 $17,431 $12,458 Fed funds sold 22,710 74,970 32,510 21,265 7,841 Total cash and cash equivalents 33,360 86,038 43,355 38,696 20,299 Investment securities - available for sale 74,364 76,742 82,986 86,905 89,686 Loans, net of deferred loan fees 648,273 578,524 584,342 556,969 514,769 Allowance for loan losses (8,297) (8,191) (8,076) (6,991) (6,244) Loans, net of allowance for loan losses 639,976 570,333 576,266 549,978 508,525 Bank owned life insurance 10,619 10,551 10,479 10,406 10,334 Premises and equipment, net 5,946 3,387 1,155 668 600 Accrued interest receivable & other assets 18,728 16,756 16,818 15,205 17,211 Total assets $782,993 $763,807 $731,059 $701,858 $646,655 Liabilities\nNon-interest-bearing demand deposits $275,925 $295,862 $264,514 $261,172 $241,362 Interest bearing transaction accounts 16,555 16,988 17,642 20,786 19,420 Money market and savings accounts 243,198 229,143 220,474 207,106 215,656 Time deposits 110,730 117,670 116,282 103,616 91,560 Total deposits 646,408 659,663 618,912 592,680 567,998 FHLB advances 30,000 - 30,000 30,000 - Subordinated debt, net 11,761 11,740 11,719 11,698 11,677 Other liabilities 5,717 4,421 3,572 2,425 3,471 Total liabilities 693,886 675,824 664,203 636,803 583,146 Shareholders' equity\nCommon stock/additional paid-in capital 66,996 66,704 47,421 47,259 47,289 Retained earnings 22,811 21,802 20,142 18,711 17,157 Accumulated other comprehensive income (loss) (700) (523) (707) (915) (937) Total shareholders' equity 89,107 87,983 66,856 65,055 63,509 Total liabilities and shareholders' equity $782,993 $763,807 $731,059 $701,858 $646,655 Capital ratios\nTier 1 leverage ratio 11.43% 11.87% 9.28% 9.52% 9.96% Common equity tier 1 capital ratio 10.70% 11.61% 8.94% 9.24% 9.67% Tier 1 risk-based capital ratio 10.70% 11.61% 8.94% 9.24% 9.67% Total risk-based capital ratio 13.13% 14.27% 11.61% 11.91% 12.41% Book value per common share $15.12 $14.99 $13.91 $13.57 $13.50 Total common shares outstanding 5,893,144 5,870,691 4,806,377 4,793,827 4,704,297 Other Ratios\nNon-interest bearing deposits to total deposits 42.7% 44.9% 42.7% 44.1% 42.5% Core deposits to total deposits 87.4% 86.7% 86.0% 86.6% 86.4% Loan to deposit ratio 100.3% 87.7% 94.4% 94.0% 90.6% Allowance for loan losses to total loans 1.28% 1.42% 1.38% 1.26% 1.21% Avidbank Holdings, Inc. Condensed Consolidated Statements of Income ($000, except share and per share amounts) (Unaudited) Quarter Ended Year-to-Date 12/31/17\n9/30/17\n12/31/16\n12/31/17\n12/31/16\nInterest and fees on loans and leases $8,186 $7,899 $6,401 $30,784 $24,036 Interest on investment securities 477 466 487 1,988 1,834 Other interest income 245 160 65 580 380 Total interest income 8,908 8,525 6,953 33,352 26,250 Deposit interest expense 496 475 300 1,727 1,135 Other interest expense 230 277 213 1,097 854 Total interest expense 726 752 513 2,824 1,989 Net interest income 8,182 7,773 6,440 30,528 24,261 Provision for loan losses 106 74 813 1,985 813 Net interest income after provision for loan losses\n8,076 7,699 5,627 28,543 23,448 Service charges, fees and other income 407 403 467 1,602 1,437 Income from bank owned life insurance 68 72 73 285 1,786 Gain (Loss) on sale of investment securities - - - - (4) Total non-interest income 475 475 540 1,887 3,220 Compensation and benefit expenses 3,126 3,421 2,889 12,436 9,923 Occupancy and equipment expenses 1,038 731 594 3,029 2,200 Other operating expenses 1,068 1,082 1,022 4,132 3,670 Total non-interest expense 5,232 5,234 4,505 19,597 15,793 Income before income taxes 3,319 2,940 1,662 10,833 10,875 Provision for income taxes 2,310 1,280 540 5,179 3,612 Net income $1,009 $1,660 $1,122 $5,654 $7,263 Basic earnings per common share $0.18 $0.30 $0.24 $1.10 $1.61 Diluted earnings per common share $0.17 $0.29 $0.24 $1.08 $1.56 Average common shares outstanding 5,712,595 5,552,977 4,596,713 5,138,604 4,521,392 Average common fully diluted shares 5,825,747 5,658,098 4,716,502 5,243,045 4,656,713 Annualized returns: Return on average assets 0.51% 0.88% 0.69% 0.77% 1.14% Return on average common equity 4.48% 7.75% 7.00% 7.38% 12.06% Net interest margin 4.33% 4.33% 4.14% 4.32% 4.06% Cost of funds 0.42% 0.45% 0.35% 0.43% 0.35% Efficiency ratio 60.44% 63.46% 64.55% 60.46% 57.47% Avidbank Holdings, Inc. Credit Trends ($000) (Unaudited) 12/31/17\n9/30/17\n6/30/17\n3/31/17\n12/31/16\nAllowance for Loan Losses\nBalance, beginning of quarter $8,191 $8,076 $6,991 $6,244 $5,431 Provision for loan losses, quarterly 106 74 1,085 721 813 Charge-offs, quarterly - - - - - Recoveries, quarterly - 41 - 26 - Balance, end of quarter $8,297 $8,191 $8,076 $6,991 $6,244 Nonperforming Assets\nLoans accounted for on a non-accrual basis $5,151 $5,543 $5,210 $0 $0 Loans with principal or interest contractually past due 90 days or more and still accruing interest\n- - - - - Nonperforming loans 5,151 5,543 5,210 - - Other real estate owned - - - - - Nonperforming assets $5,151 $5,543 $5,210 $0 $0 Loans restructured and in compliance with modified terms\n- - - - - Nonperforming assets & restructured loans $5,151 $5,543 $5,210 $0 $0 Nonperforming Loans by Type:\nCommercial $4,353 $4,730 $4,377 $0 $0 Real Estate Loans 704 714 724 - - Consumer Loans 94 99 109 - - Total Nonperforming loans $5,151 $5,543 $5,210 $0 $0 Asset Quality Ratios\nAllowance for loan losses (ALLL) / gross loans 1.28% 1.42% 1.38% 1.26% 1.21% ALLL / nonperforming loans 161.08% 147.77% 155.01% 0.00% 0.00% Nonperforming assets / total assets 0.66% 0.73% 0.71% 0.00% 0.00% Nonperforming loans / gross loans 0.79% 0.96% 0.89% 0.00% 0.00% Net quarterly charge-offs / gross loans 0.00% -0.01% 0.00% 0.00% 0.00%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005402/en/\nAvidbank Holdings, Inc.\nSteve Leen, 408-831-5653\nExecutive Vice President and Chief Financial Officer\nsleen@avidbank.com\nSource: Avidbank Holdings, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180125005402/en/"], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T16:21:41.000+02:00", "highlightTitle": ""}