{"organizations": [], "uuid": "6cd81075f69305308ce6bdc3d8e4952c494c902a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-live-ventures-announces-60-percent-increase-in-year-over-year-salesaduringarecord-holiday-seasonaforasubsidiary-vintage.html", "country": "US", "domain_rank": 767, "title": "Live Ventures Announces 60 Percent Increase in Year-Over-Year Sales During Record Holiday Season for Subsidiary Vintage Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.165, "site_type": "news", "published": "2018-01-02T19:30:00.000+02:00", "replies_count": 0, "uuid": "6cd81075f69305308ce6bdc3d8e4952c494c902a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-live-ventures-announces-60-percent-increase-in-year-over-year-salesaduringarecord-holiday-seasonaforasubsidiary-vintage.html", "ord_in_thread": 0, "title": "Live Ventures Announces 60 Percent Increase in Year-Over-Year Sales During Record Holiday Season for Subsidiary Vintage Stock", "locations": [], "entities": {"persons": [{"name": "rodney spriggs", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "vintage stock", "sentiment": "none"}, {"name": "& record lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Live Ventures Incorporated (Nasdaq:LIVE), a diversified holding company, today announces its wholly owned subsidiary, Vintage Stock, has achieved unprecedented sales during the 2017 holiday season.\nDuring the holiday season period from December 1 through December 24, 2017, compared to the same period last year, Vintage Stock demonstrated:\nAn increase in year-over-year sales by 60 percent from stores opened within the last year\nIncreases in all same store sales compared to the same period last season of:\nUsed toys sales up by 60 percent Used comics and books sales up by 24 percent New video games and hardware sales up by 22 percent Used music CD’s & Record LP’s sales up by 16 percent Previously owned DVD and Blu-Ray movies sales up by 8 percent\n“Regardless of predictions to the contrary, brick and mortar is alive and well, as shown by the results of Vintage Stock’s 2017 holiday sales,” said Rodney Spriggs, CEO of Vintage Stock. “We believe the record sales Vintage Stock experienced this holiday season demonstrates that perhaps it is not brick and mortar in general, but rather big box stores that have not changed their business model over the last decade, combined with the over saturation of ‘me too’ fashion retailers. We believe that expected strong growth in new video game and hardware sales in 2018 will fuel future growth on the used side of our business and an expected stronger 2018 movie box office will drive more foot traffic that we believe should, in turn, drive sales across all of our product lines. We anticipate that smart and value-conscious consumers will continue to visit our stores for the brand-new video games and movies and seek out lost favorites and discover new treasures that they can physically own from our pre-owned inventory.”\nAbout Live Ventures Incorporated\nLive Ventures Incorporated is a diversified holding company with several wholly owned subsidiaries and a strategic focus on acquiring profitable companies that have demonstrated a strong history of earnings power. Live Ventures Incorporated provides, among other businesses, marketing solutions that boost customer awareness and merchant visibility on the Internet. The company operates a deal engine, which is a service that connects merchants and consumers via an innovative platform that uses geo-location, enabling businesses to communicate real-time and provide instant offers to nearby consumers. Through its subsidiary, Marquis Industries, the company operates as a specialty, high-performance yarns manufacturer and hard-surfaces re-seller. Marquis Industries, which is a top-10 high-end residential carpet manufacturer in the United States, utilizes its state-of-the-art yarn extrusion capacity to market monofilament textured yarn products to the artificial turf industry. Marquis is the only manufacturer in the world that can produce certain types of yarn prized by the industry. Through its subsidiary Vintage Stock, Inc., an award-winning entertainment retailer, the company sells new and preowned movies, classic and current generation video games and systems, music on CD and LP, collectible comics, books, toys, and more. Vintage Stock, through its stores and website, ships product worldwide directly to the customer’s doorstep.\nForward-Looking and Cautionary Statements\nThis press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In accordance with the safe harbor provisions of this Act, statements contained herein that look forward in time that include everything other than historical information, involve risks and uncertainties that may affect the company’s actual results. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Live Ventures Incorporated may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission on Forms 10-K, 10-Q and 8-K, in its annual report to stockholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. There can be no assurance that such statements will prove to be accurate and there are a number of important factors that could cause actual results to differ materially from those expressed in any forward-looking statements made by the company, including, but not limited to, plans and objectives of management for future operations or products, the market acceptance or future success of our products, and our future financial performance. The company cautions that these forward-looking statements are further qualified by other factors including, but not limited to, those set forth in the company’s Form 10-K for the fiscal year ended September 30, 2016 and other filings with the U S. Securities and Exchange Commission (available at http://www.sec.gov ). The company undertakes no obligation to publicly update or revise any statements in this release, whether as a result of new information, future events, or otherwise.\nContact:\nLive Ventures Incorporated\nTim Matula, investor relations\n425-836-9035\ntmatula@live-ventures.com\nhttp://www.live-ventures.com\nSource:Live Ventures Incorporated", "external_links": ["https://www.globenewswire.com/Tracker?data=8EOnZ5bfw_3iZDK_BYjzJi-60UB3BlwE0rjfTuePzB8X3YiNQoXgM9Fy1s-0QPoGhoNMVXo90ng_qakmDtfuAWz01sFsrrVRPOJbwX6BmpoH23rYHE_UP8OgemifURHSTyrsa8LdEtWk7X0Q9rLslAKC1PQmI5Am9gL53ZY1MetfdCJdmnz3TtQ8z3sD9cxa2mRuNnDdke--eKgzVAO85a4c2zbp9VXdd4I8soL2PIdhMW1mM_jbTdfs_u1n_jiKQbaMe3b4wyfKXxxjmAVtrRmacwR-uEXPWV7Sh_31gFI7tBWL7hiyYkOuB6GQfxfr_XLinIsPhq2jdEag-91cKD1GzGWsnCajfyTGjmLp-3hpO6F3nOB3QURVC0ifgUM67bK6r2JyG87qwRJmaU2V-nr4K-o1uL6OwnlW1EiKLtg="], "published": "2018-01-02T19:30:00.000+02:00", "crawled": "2018-01-02T19:10:22.000+02:00", "highlightTitle": ""}