{"organizations": [], "uuid": "242682623c2bd0bb9a3544220e070939c349c8f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222936223&w=1200&r=LYNXMPEE0H0AG", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-britain-tillerson/tillerson-to-visit-london-hopes-to-visit-new-embassy-idUKKBN1F70HU", "country": "US", "domain_rank": 408, "title": "Tillerson to visit London, hopes to visit new embassy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T07:51:00.000+02:00", "replies_count": 0, "uuid": "242682623c2bd0bb9a3544220e070939c349c8f0"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-britain-tillerson/tillerson-to-visit-london-hopes-to-visit-new-embassy-idUKKBN1F70HU", "ord_in_thread": 0, "title": "Tillerson to visit London, hopes to visit new embassy", "locations": [], "entities": {"persons": [{"name": "tillerson", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:52 AM / Updated 25 minutes ago Tillerson to visit London, hopes to visit controversial new embassy David Brunnstrom 3 Min Read \nWASHINGTON (Reuters) - U.S. Secretary of State Rex Tillerson said he hopes to visit the controversial new U.S. embassy when he visits London next week, but the State Department said it had not been decided whether he would formally open the building. \nU.S. President Donald Trump canceled a trip to London to open the embassy scheduled for next month, saying he did not want to endorse a bad deal agreed by the Obama administration to sell the old one for “peanuts.” \nSpeaking to reporters while flying back to Washington from a trip to the North American west coast on Wednesday, Tillerson did not respond when asked if he would formally open the controversial building, but said he hoped to go there. \nState Department spokeswoman Heather Nauert told a news briefing on Thursday no “ribbon-cutting ceremony” by Tillerson was currently scheduled during his Jan. 21-23 London visit. \nWhile the deal on the sale of the old embassy site was concluded under President Barack Obama, the decision to move from Grosvenor Square in up-market Mayfair to the south bank of the Thames was agreed in 2008 under Republican President George W. Bush. \nNauert said the new embassy opened this week and the bulk of staff had moved from the old building. \nTrump addressed the controversy again at the end of a wide-ranging interview with Reuters on Wednesday, complaining that the new building “came out tremendously over budget.” The final pieces of construction work are completed on the new U.S. Embassy in Nine Elms in London, Britain January 12, 2018. REUTERS/Peter Nicholls \n“So now we have an embassy that cost $1.2 billion, I think it was much more than that ... in the wrong location.” \n“Just so you understand, it started in the Bush term, but the deal was made in the Obama term and the deal was built in the Obama term,” Trump said. \nAsked whether he would go to Britain this year, Trump said, “they’ve invited me,” but didn’t elaborate. He said his relationship with Britain was “very good.” \nAsked if he agreed with Trump that the embassy move had been a mistake, Tillerson said: “That’s a decision that’s already been taken, so I don’t think we need to revisit it.” \nThe cancellation of Trump’s trip was a further blow to relations between Britain and the United States, for long the closest of allies. More than a year into his presidency, Trump has yet to visit London, with many Britons vowing to protest against a man they see as crude, volatile and opposed to their values on a range of issues. \nTillerson rejected the suggestion that Trump might see Britain as less useful now that it was embroiled in Brexit and other political issues. \n”No, not at all,“ he said. ”I mean, we still have the special relationship with the British people. As you know, President Trump was supportive of the UK’s exit from the EU. He still thinks that was the right decision for them. \n“Britain needs to focus on those Brexit negotiations right now, which is really important to them, and I think the president realizes that’s where Prime Minister May really needs to focus her attention.” Reporting by David Brunnstrom; Editing by Andrea Ricci and James Dalgleish", "external_links": [], "published": "2018-01-18T07:51:00.000+02:00", "crawled": "2018-01-18T08:01:35.098+02:00", "highlightTitle": ""}