{"organizations": [], "uuid": "3258d0d706a81478297d7d66d70567509441c9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2011/08/23/33594912-gold_bars.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/04/gold-dips-from-3-12-month-high-ahead-of-us-payrolls-data.html", "country": "US", "domain_rank": 767, "title": "Gold pares losses after underwhelming US payrolls data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:55:00.000+02:00", "replies_count": 0, "uuid": "3258d0d706a81478297d7d66d70567509441c9a3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/gold-dips-from-3-12-month-high-ahead-of-us-payrolls-data.html", "ord_in_thread": 0, "title": "Gold pares losses after underwhelming US payrolls data", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "adp research institute", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold fell in choppy trading on Friday as the dollar rose in the wake of U.S. non-farm payrolls data for December, prompting traders to cash in gains from the metal's rally to 3-1/2 month highs this week.\nSpot gold was down 0.17 percent at $1,320.60 an ounce by 12:49 p.m. ET, off Thursday's high of $1,325.86. U.S. gold futures for February delivery were flat at $1,321.50.\nThe metal remains on track for a fourth straight weekly gain, however, for the first time since April. It has risen nearly 1 percent in the first trading week of the year, having climbed by 13 percent in 2017.\nThat has left gold looking overstretched, ABN Amro analyst Georgette Boele said. \"I think when the rest of the market returns, gold prices will be lower and the U.S. dollar will recover.\"\nThe dollar see-sawed in the wake of data showing U.S. job growth slowed more than expected last month, before turning higher. A pick-up in monthly wage gains pointed to labor market strength that could pave the way for the Federal Reserve to increase interest rates in March.\nTraders overall stuck to their conviction that the Federal Reserve will raise rates twice this year, a Reuters analysis of fed funds futures contracts traded at CME Group suggested.\nshow chapters While everyone's watching bitcoin, gold's having a record-breaking rally on the side 5:05 PM ET Wed, 3 Jan 2018 | 01:34 Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced.\nElsewhere physical gold demand across Asia remained subdued this week as prices rallied, keeping retail buyers away from the market. In top consumer China, premiums declined to $6-$7 an ounce from around $10 last week.\nAmong other precious metals, palladium was down 0.96 percent at $1,085.72, also retreating after hitting a record high of $1,105.70 on Thursday.\nIt was the best performer among major precious metals last year, rising 56 percent on fears that rising demand for the autocatalyst metal would further tighten the market after years of deficit.\n\"Prevailing bullish sentiment and the encouraging technical trend have pushed palladium prices to record highs,\" Julius Baer said in a note.\n\"We believe this is at odds with a slowdown in global car sales growth. Related headlines should eventually cool sentiment, trigger profit-taking and lead to a price correction,\" said Baer.\nSpot silver vacillated around $17.23 after touching its highest point in more than six weeks at $17.27 in the previous session.\nSpot platinum was 0.99 percent higher at $969.20 an ounce. It hit a 3-1/2 month peak at $965.40 on Thursday.", "external_links": [], "published": "2018-01-05T15:55:00.000+02:00", "crawled": "2018-01-05T19:00:07.000+02:00", "highlightTitle": ""}