{"organizations": [], "uuid": "8f3c4f750cdc3d26ee6135b9c14138f570190688", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-russia-sakhalin-oil-exclusive/exclusive-russias-exxon-led-sakhalin-1-rolls-back-plan-for-oil-output-hike-sources-idUSKBN1FC23C", "country": "US", "domain_rank": 408, "title": "Exclusive: Russia's Exxon-led Sakhalin-1 rolls back plan for oil output hike - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T23:39:00.000+02:00", "replies_count": 0, "uuid": "8f3c4f750cdc3d26ee6135b9c14138f570190688"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-sakhalin-oil-exclusive/exclusive-russias-exxon-led-sakhalin-1-rolls-back-plan-for-oil-output-hike-sources-idUSKBN1FC23C", "ord_in_thread": 0, "title": "Exclusive: Russia's Exxon-led Sakhalin-1 rolls back plan for oil output hike - sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "exxonmobil", "sentiment": "negative"}, {"name": "energy ministry", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russia’s Sakhalin-1 oil project, led by ExxonMobil, has ditched plans to raise output by a quarter this year after it was ordered by the authorities to return to previous lower production limits, industry sources told Reuters on Tuesday.\nIt was not immediately clear why the authorities blocked the rise, but higher output from the project might have jeopardized Russia’s pledge to curb national crude output in line with a deal agreed on with OPEC and other oil producers.\nSakhalin-1 operates under a Production Sharing Agreement struck in the mid-1990s and all plans must be run by local government.\nExxonMobil had received preliminary approval for a new quota in December and set output for January at 250,000 to 260,000 barrels per day (bpd), up from 200,000 bpd last year.\nBut the firm was ordered by the authorities this month to return to the old quota of 200,000 bpd, three industry sources told Reuters.\nSakhalin-1 was now operating under the production quota of 200,000 bpd, two sources familiar with the matter said.\nA source close to Russia’s Energy Ministry said Sakhalin-1 would continue to operate under previous quotas until the Natural Resources Ministry finished approving a new production scheme. He did not say when this new scheme would be approved.\nRussia’s Energy Ministry, the Natural Resources Ministry, Exxon and Russian oil major Rosneft, a minority shareholder in the Sakhalin-1 consortium, all declined immediate comment.\n“Everyone expected production to rise and Sokol supplies to increase, there was an understanding that everything’s approved, but then something went wrong,” said a source in a company which regularly buys the crude.\nSokol is the grade of crude oil produced at Sakhalin-1.\nCUT BACKS “I think this is related to the agreement with OPEC to cut oil production,” said Andrey Polishchuk, an analyst from Raiffeisenbank in Moscow, commenting on the move to block an output rise from Sakhalin-1.\nHe said the government had “limited production of all the large companies in Russia” in line with the deal on global supply curbs, which began in January 2017 and is due to run until the end of 2018.\nThe withdrawal of approval for increased production meant Sakhalin-1 shareholders had to reduce their schedule for Sokol crude loadings for January-March, the industry sources said.\nUnder the original schedule based on a production rise, 13 cargoes of 95,000 tonnes each were to be loaded from the De-Kastri terminal on Russia’s Pacific coast in January, compared to nine in December, traders said.\nIn February and March, Sokol crude exports had been set at 11 and 12 cargoes, respectively, traders said.\nAfter ExxonMobil was instructed to cut production, loading plans were decreased to 11 cargoes in January, nine cargoes for February and 10 cargoes for March, traders said.\nReporting by Olga Yagova and Oksana Kobzeva; Additional reporting by Florence Tan in Singapore; Writing by Vladimir Soldatkin; Editing by Edmund Blair\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T23:39:00.000+02:00", "crawled": "2018-01-23T20:37:08.003+02:00", "highlightTitle": ""}