{"organizations": [], "uuid": "873235cc18190f79a3c53b82b676cac854bb98ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-economy-output-fertiliser/chinas-war-on-smog-hits-fertilizer-pesticide-output-in-december-stats-idUSKBN1FB0ZB", "country": "US", "domain_rank": 408, "title": "China's war on smog hits fertilizer, pesticide output in December: stats", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:20:00.000+02:00", "replies_count": 0, "uuid": "873235cc18190f79a3c53b82b676cac854bb98ef"}, "author": "", "url": "https://www.reuters.com/article/us-china-economy-output-fertiliser/chinas-war-on-smog-hits-fertilizer-pesticide-output-in-december-stats-idUSKBN1FB0ZB", "ord_in_thread": 0, "title": "China's war on smog hits fertilizer, pesticide output in December: stats", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "national bureau of statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:25 AM / in 12 hours China's war on smog hits fertilizer, pesticide output in December: stats Reuters Staff 2 Min Read \nBEIJING (Reuters) - China’s fertilizer and pesticide output fell in December to their lowest on records going back to February 2015, data showed on Monday, as Beijing’s war on smog and efforts to ensure winter heating forced producers to suspend operations. \nFertilizer output dropped 7 percent from a year ago to 4.75 million tonnes, data from the National Bureau of Statistics showed on Monday. The volume was also down 9.3 percent from the previous month’s 5.24 million tonnes, the data also showed. \nThe drop came after natural gas shortages this winter forced many gas-based fertilizer plants to shut, tightening supplies and pushing up prices in the world’s top agricultural market amid a deepening winter heating crisis. \nThe closure of the plants prompted China’s state planner to ask local governments and companies to ensure fertilizer output for spring planting. \nFor all of 2017, China produced 60.65 million tonnes of fertilizer, down 2.6 percent from the previous year and the lowest in at least three years, the data showed. \nChina’s pesticide output in December also hit the lowest on government records at 263,000 tonnes, down 5.1 percent year on year, the data showed. The monthly figure was down from 274,000 tonnes in November. \nThis winter, China shut all pesticide plants that use volatile organic compounds during the winter heating season. \nChina produced 2.94 million tonnes of pesticide last year, down 8.7 percent from 2016 and also the lowest in at least three years, according to the data. \nBeijing has said it is targeting zero growth of chemical fertilizer and pesticide by 2020. Reporting by Hallie Gu and Josephine Mason; Editing by Christian Schmollinger and Tom Hogue", "external_links": [], "published": "2018-01-22T11:20:00.000+02:00", "crawled": "2018-01-22T11:39:52.018+02:00", "highlightTitle": ""}