{"organizations": [], "uuid": "8ac65f319911926c84fac4bff8fb4260b835edb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 94, "shares": 94, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-china-economy-forex-reserves/china-december-fx-reserves-rise-to-3-14-trillion-highest-since-sept-2016-central-bank-idUSKBN1EW061", "country": "US", "domain_rank": 408, "title": "China December forex reserves rise to $3.14 trillion, highest since September 2016", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-07T15:26:00.000+02:00", "replies_count": 0, "uuid": "8ac65f319911926c84fac4bff8fb4260b835edb7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-economy-forex-reserves/china-december-fx-reserves-rise-to-3-14-trillion-highest-since-sept-2016-central-bank-idUSKBN1EW061", "ord_in_thread": 0, "title": "China December forex reserves rise to $3.14 trillion, highest since September 2016", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s foreign exchange reserves rose to their highest in more than a year in December, blowing past economists’ estimates, as tight regulations and a strong yuan continued to discourage capital outflows, central bank data showed on Sunday.\nNotching up their 11th straight month of gains, reserves rose $20.2 billion in December to $3.14 trillion, the highest since September 2016 and the biggest monthly increase since July. That compares with an increase of $10 billion in November.\nEconomists polled by Reuters had expected reserves to rise by $6 billion to $3.125 trillion.\nCapital flight had been seen as a major risk for China at the start of 2017, but a combination of tighter capital controls and a faltering dollar helped the yuan stage a strong turnaround, bolstering confidence in the economy.\nThe yuan rose around 6.8 percent against the greenback in 2017, recovering from a 6.5 percent loss in 2016 and reversing three straight years of depreciation.\nFor the full year, China’s FX reserves rose $129.5 billion from $3.011 trillion at the end of 2016. That’s the first annual rise since 2014.\nChina’s foreign exchange regulator said in a statement on its website that it would keep the nation’s forex reserves and international balance of payments “balanced and stable” in 2018.\nThe country’s reserves dropped by nearly $1 trillion from a peak of $3.99 trillion in June 2014 to $2.998 trillion in January 2017 as it sought to shore up the yuan and reduce potentially destabilizing capital outflows. But reserves have since climbed by $142 billion.\nDespite the improved capital flow picture, China’s State Administration of Foreign Exchange has continued a clampdown on the movements of funds abroad. The regulator announced last month it would cap overseas withdrawals by people using domestic Chinese bank cards starting this year.\nSome major global acquisitions by Chinese firms have also been put on ice by regulators, who fear they are really intended to disguise movements of capital offshore, though Beijing has maintained genuine investments will still be approved.\nChina’s central bank reported net foreign exchange buying for the third consecutive month in November, marking a policy victory for the authorities after a long battle to stabilize the yuan, although analysts say capital flows are likely to remain volatile as the economy slows.\nEconomists polled by Reuters expect the yuan to depreciate slightly this year if the dollar firms.\nThe value of gold reserves rose to $76.47 billion at the end of December, from $75.833 billion at the end of November, data on the People’s Bank of China’s website showed.\nReporting by Josephine Mason, Meng Meng and Cheng Fang; Editing by Himani Sarkar\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-07T15:26:00.000+02:00", "crawled": "2018-01-07T12:36:12.017+02:00", "highlightTitle": ""}