{"organizations": [], "uuid": "954671f4f07942d7aa37a9c3bc66fbbcab0de157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-advanced-medical-isotope-corporation-admd-announces-corporate-name-change-to-vivos-inc-and-ticker-symbol-change-to-rdgl.html", "country": "US", "domain_rank": 767, "title": "Advanced Medical Isotope Corporation (ADMD) Announces Corporate Name Change to Vivos Inc., and Ticker Symbol Change to RDGL", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-02T17:00:00.000+02:00", "replies_count": 0, "uuid": "954671f4f07942d7aa37a9c3bc66fbbcab0de157"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-advanced-medical-isotope-corporation-admd-announces-corporate-name-change-to-vivos-inc-and-ticker-symbol-change-to-rdgl.html", "ord_in_thread": 0, "title": "Advanced Medical Isotope Corporation (ADMD) Announces Corporate Name Change to Vivos Inc., and Ticker Symbol Change to RDGL", "locations": [], "entities": {"persons": [{"name": "mike korenko", "sentiment": "none"}], "locations": [{"name": "wa", "sentiment": "none"}, {"name": "rdgl richland", "sentiment": "none"}], "organizations": [{"name": "vivos inc.", "sentiment": "neutral"}, {"name": "advanced medical isotope corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richland, WA, Advanced Medical Isotope Corporation (OTCPink: RDGL) announced today that it has changed its name to Vivos Inc., and that its shares are scheduled to trade under the new symbol, RDGL, on the OTC Markets on January 2, 2018. Both of these changes represent a rebranding of the Company to reflect its focus on RadioGel TM for the treatment of skin cancer. Our new name, which reflects the giving of life, captures the essence of our Company mission. In addition to these rebranding efforts, management anticipates qualifying the Company’s common stock for quotation on the OTCQB in the near-term with the longer-term goal of a listing on a national exchange.\nMike Korenko, CEO, said “Our new name better reflects the description of our current and near-term product and markets. After obtaining approval to treat skin cancer, we intend to grow by expanding the cancers that we treat over time. We will also consider non-cancer applications, such as treating infections imbedded in bones that currently lead to amputation, which can occur is diabetic patients.”\nMr. Korenko continued, “We are very excited about the prospects for RadioGel TM to treat animals and humans. We continue to believe that our Company’s valuation does not currently reflect the underlying value of RadioGel TM and the large market opportunity in both the animal and human market. We appreciate the continued support of our shareholders and our note holders, who as previously reported on Form 8-K, agreed to eliminate all variable price conversion through April 15, 2018. We are excited about 2018 and maintain a firm belief in our mission to provide patient friendly solutions utilizing the unique RadioGel™ technology and to grow shareholder value.”\nAbout Vivos Inc. (OTCPink: RDGL)\nThe strategic market sector of RDGL is isotope applications. Currently, the Company is engaged in the\ndevelopment of RadioGel TM , an Yttrium-90 based brachytherapy device, for the treatment of tumors. Brachytherapy uses radiation to destroy cancerous tumors by placing a radioactive isotope inside the treatment area.\nThe Company is engaging the FDA for permission to use RadioGel TM for the treatment of advanced basal and squamous cell skin cancers. The IsoPet Solutions division of RDGL is focused on demonstrating the safety and therapeutic effectiveness for different animal cancers in four different university veterinary hospitals. RDGL is positioning itself so that after this demonstration phase, The Company can begin to generate revenues through the sale of RadioGel TM to private animal clinics.\nThe Company currently is outsourcing material aspects of manufacturing of its product in the United States and intends to enter into licensing arrangements outside of the United States for the manufacturing and distribution of RadioGel TM in other countries.\nAbout RadioGel™\nRadioGel TM is a hydrogel liquid containing tiny Yttrium-90 phosphate particles to be injected into a tumor. This hydrogel is a liquid at temperatures below body temperature but begins to gel, harden, upon injection as the temperature increases to normal body temperature, thereby locking the particles in place. The particles emit a very high concentrated and contained beta irradiation to kill the tumor. The beta radiation has a short penetration distance so there is minimal collateral damage to healthy tissues outside of the injected area.\nRadioGel TM also has a short half-life – delivering more than 90% of its therapeutic radiation within 10 days. This compares favorably to other available treatment options requiring up to 6 weeks or more to deliver a full course of radiation therapy. This is an outpatient treatment much safer to the personnel treating the patient than competing brands and the patient can go home immediately with no risk to family members.\nPlease click the following link to view our website: https://www.radiogel.com/\nSafe Harbor Statement\nThis release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by the use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimates,\" \"projects,\" \"intends,\" and similar expressions. Forward-looking statements involve risks and uncertainties that could cause results to differ materially from those projected or anticipated. These risks and uncertainties include, but are not limited to, the Company's ability to successfully execute its expanded business strategy, including by entering into definitive agreements with suppliers, commercial partners and customers; general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, delays in completing various engineering and manufacturing programs, changes in customer order patterns, changes in product mix, continued success in technical advances and delivering technological innovations, shortages in components, production delays due to performance quality issues with outsourced components, regulatory requirements and the ability to meet them, government agency rules and changes, and various other factors beyond the Company's control.\nWe have changed our email and website to reflect our focus on RadioGel TM . Please visit our website located at www.radiogel.com , which contains a direct link to recent presentations and interviews at https://www.redchip.com/company/Biotech/ADMD/376/admd .\nCONTACT: Vivos Inc. Michael K. Korenko, President & CEO MKorenko@RadioGel.com 509-736-4000\nSource:Vivos Inc.", "external_links": ["https://www.radiogel.com/", "https://www.globenewswire.com/Tracker?data=hN1r7cx-u_6Jb_NxDBLgfdhas6wypC8On2_VJQ3kuZv974k_tXKVUrSFqqTn4XqyDt3m-4Dx6f4sUsxZwGTZeMIhArXypcSjFmgecHHOQOE=", "https://www.redchip.com/company/Biotech/ADMD/376/admd", "https://www.globenewswire.com/Tracker?data=n-y3SurODnmBu4sU9MFXI3Em_ayPYCzSrWUMC_gAAN4ztAmR-2Ons4ZOWJ6r4-1pVinT7iG3JXXMwkIV4Lfw4w=="], "published": "2018-01-02T17:00:00.000+02:00", "crawled": "2018-01-02T16:24:16.015+02:00", "highlightTitle": ""}