{"organizations": [], "uuid": "b84003b8208ab629100313514f44cd1c218b3cc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-franckline-casimir-benoit-joins-american-bankers-associationas-ctfa-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Franckline Casimir-Benoit Joins American Bankers Association’s CTFA Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.037, "site_type": "news", "published": "2018-01-02T22:00:00.000+02:00", "replies_count": 0, "uuid": "b84003b8208ab629100313514f44cd1c218b3cc2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-franckline-casimir-benoit-joins-american-bankers-associationas-ctfa-advisory-board.html", "ord_in_thread": 0, "title": "Franckline Casimir-Benoit Joins American Bankers Association’s CTFA Advisory Board", "locations": [], "entities": {"persons": [{"name": "franckline casimir-benoit", "sentiment": "none"}, {"name": "casimir-benoit", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "franckline casimir-benoit joins american bankers association", "sentiment": "negative"}, {"name": "fiduciary trust company international", "sentiment": "negative"}, {"name": "ctfa advisory board", "sentiment": "negative"}, {"name": "aba", "sentiment": "none"}, {"name": "american bankers association", "sentiment": "none"}, {"name": "ctfa", "sentiment": "none"}, {"name": "franklin templeton investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Fiduciary Trust Company International, a global wealth manager and wholly-owned subsidiary of Franklin Templeton Investments, announces that managing director and trust counsel Franckline Casimir-Benoit, CTFA will begin a four-year term on the American Bankers Association’s CTFA Advisory Board, effective January 1, 2018.\nThe American Bankers Association (ABA) helps set standards of excellence among trust and wealth advisors by providing them with the opportunity to obtain and maintain the CTFA (Certified Trust and Financial Advisor) professional designation. In her role on the organization’s CTFA Advisory Board, Ms. Casimir-Benoit will help shape the ABA curriculum for CTFA courses, and provide input on the ABA’s ongoing CTFA educational programming and industry events. More information about the CTFA certification is available at: https://www.aba.com/Training/Certifications/Pages/CTFA-roadmap.aspx .\n“Franckline has more than 25 years of experience advising high-net-worth individuals and families on preserving and growing their wealth, and establishing a legacy,” said Gerard F. Joyce, Jr., national head of trust and estates at Fiduciary Trust. “She is committed to not only helping our clients reach their goals, but also passing on what she has learned. Franckline is a credit to Fiduciary Trust as well as our profession, and we are happy she will be able to expand her impact on the industry in her new role.”\nMs. Casimir-Benoit joined Fiduciary Trust in November 2000 as assistant vice president and trust officer. She was promoted to managing director in November 2011 and became trust counsel in October 2013. Ms. Casimir-Benoit began her career as assistant vice president and trust officer at Merrill Lynch Trust Co. in October 1992. Her term on the ABA’s CTFA Advisory Board will run through December 31, 2021.\n“As a proud holder of the CTFA designation, I am eager to help prepare the next generation of trust and wealth advisors to develop professionally and forge fulfilling careers,” said Ms. Casimir-Benoit. “Advancing and maintaining this certification is important not only for advisors, but for the clients around the country who work with advisors to manage their wealth. I welcome the opportunity to shape and uphold the standards of excellence the CTFA designation represents.”\nMs. Casimir-Benoit earned her J.D. from the University of Connecticut School of Law, and holds a B.A. from Mount Holyoke College.\nAbout Fiduciary Trust\nFiduciary Trust Company International, a global wealth management firm, has served individuals, families, endowments and foundations since 1931. With over $78 billion in assets under administration and management as of September 30, 2017, the firm specializes in strategic wealth planning, investment management and trust and estate services, as well as tax and custody services. The firm and its subsidiaries maintain offices in New York, Coral Gables, FL, Boca Raton, FL, St. Petersburg, FL, Los Angeles, San Mateo, CA, Washington, DC, Wilmington, DE, Arlington, VA, and London. For more information, please visit fiduciarytrust.com .\nAbout Franklin Resources\nFranklin Resources, Inc. (NYSE:BEN) is a global investment management organization operating as Franklin Templeton Investments. Franklin Templeton Investments provides global and domestic investment management to retail, institutional and sovereign wealth clients in over 170 countries. Through specialized teams, the company has expertise across all asset classes—including equity, fixed income, alternative and custom solutions. The company's more than 650 investment professionals are supported by its integrated, worldwide team of risk management professionals and global trading desk network. With offices in over 30 countries, the California-based company has 70 years of investment experience and over $753 billion in assets under management as of September 30, 2017. For more information, please visit franklintempleton.com .\nCopyright © 2018. Fiduciary Trust Company International. All rights reserved.\nContacts:\nRebecca Radosevich: 212-632-3207\nrebecca.radosevich@franklintempleton.com\nJenna Focarino: 646-922-7763\njfocarino@jconnelly.com\nSource:Fiduciary Trust Company International", "external_links": ["https://www.globenewswire.com/Tracker?data=mhGTrX3CLIMGrksXWfbHx6KAXJUvBhGzF3PFjVE0P02D57dO4oys7-KsCOtPHNr2V3Wq4mH823aW70jiwKQ1vqmjX5fM9r4tADsIw4zwu9WGGCNKiTcIuZc06dhY1mQbH_wHPtNgUBZ7PRbodSvbgaAWv8-RQJ04YJBozQEWZXrbMteJWJC_IFl1xp6taZHiCSMOdCqpLZ1g1bHm_vFlog==", "https://www.globenewswire.com/Tracker?data=vOnxveb2bVN46DJk3G_gVxwTE823gLxAllefWhry697MjRVjx66DpK0nxrRQGP4Wgw1QeIqFzEHPiMwkalfKt5wIzLQQ3mmc0KT0oLSH0xY=", "https://www.aba.com/Training/Certifications/Pages/CTFA-roadmap.aspx", "https://www.globenewswire.com/Tracker?data=uHWbSd1mU8aYFxxAZgpI48sO-uUt_2JS79mqnwRBx9gaRekDKKnSzrdezt1-eWmwvhLqMxtGjnzqNN7Xj-UGQR1XCxeDo1ExWxuodySxGdg="], "published": "2018-01-02T22:00:00.000+02:00", "crawled": "2018-01-02T23:42:01.010+02:00", "highlightTitle": ""}