{"organizations": [], "uuid": "4e8c0b8773886d6134a6f191348e1f38477b1a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218710423&w=1200&r=LYNXMPEE0101S", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-northkorea-missiles-moon/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idUSKBN1ER041", "country": "US", "domain_rank": 408, "title": "South Korea's Moon says better inter-Korean relations go in hand with resolving North Korea nuclear issue", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2018-01-02T10:41:00.000+02:00", "replies_count": 0, "uuid": "4e8c0b8773886d6134a6f191348e1f38477b1a71"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-northkorea-missiles-moon/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idUSKBN1ER041", "ord_in_thread": 0, "title": "South Korea's Moon says better inter-Korean relations go in hand with resolving North Korea nuclear issue", "locations": [], "entities": {"persons": [{"name": "moon", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "negative"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "christine kim", "sentiment": "none"}, {"name": "michael perry", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:41 AM / Updated 25 minutes ago South Korea's Moon says better inter-Korean relations linked to resolving North Korea nuclear issue Christine Kim 4 Min Read \nSEOUL (Reuters) - South Korean President Moon Jae-in said on Tuesday the improvement of inter-Korean relations was linked to resolving North Korea’s nuclear program, a day after the North offered talks with Seoul but was steadfast on its nuclear ambitions. \n“The improvement of relations between North and South Korea cannot go separately with resolving North Korea’s nuclear program, so the foreign ministry should coordinate closely with allies and the international community regarding this,” Moon said in opening remarks at a cabinet meeting. \nMoon’s comments contrasted with those of North Korean leader Kim Jong Un, who said on Monday that Seoul should stop asking foreign countries for help in improving ties between the two Koreas. \n“This shows the Moon administration is looking at the situation from a very realistic, rational point of view,” said Jeong Yeung-tae, head of the Institute of North Korea Studies in Seoul. “It also shows resolving North Korea’s nuclear issue has a bigger priority (than improving inter-Korean relations).” \nMoon’s comments came after a New Year’s Day speech by Kim who said he was “open to dialogue” with Seoul, and for North Korean athletes to possibly take part in the Winter Games, but steadfastly declared North Korea a nuclear power. \nThe South Korean president requested the ministries of unification and sports to swiftly create measures to help North Korea participate in the upcoming Pyeongchang Winter Olympics. \nChoi Moon-soon, governor of Gangwon Province where the Pyeongchang Olympics is set to be held, has proposed South Korea would send cruise ships to bring North Korean athletes and officials to Pyeongchang, according to South Korean media. \nChoi met North Korea’s sports official Mun Woong in China on Dec. 18 on the sidelines of a international youth football tournament where North and South Korea soccer teams competed, the Dong-A Ilbo newspaper reported. \nChoi suggested sending cruise ships to North Korea’s Wonsan port to help the North minimize transportation costs and to use the ships as accommodation in South Korea, said the newspaper. \nThe governor did not immediately respond to a request by Reuters for comment on Tuesday. \nAs for talks between the two Koreas, Defence Ministry spokeswoman Choi Hyun-soo said Seoul was awaiting a more detailed reply from Pyongyang to already-existing offers for dialogue made back in July last year by Seoul. \n”We offered military talks in July and our offer still stands. We are waiting North Korea’s reply. We are willing to talk with North Korea on the peaceful resolution of the North’s nuclear program regardless of form, time and method,” said Choi in a regular briefing. \nKim’s offer of talks and sporting co-operation with South Korea follows a year dominated by fiery rhetoric and escalating tensions over Pyongyang’s nuclear weapons program. \nNorth Korea tested its most powerful intercontinental ballistic missile (ICBM) in November, 2017, which it said was capable of delivering a warhead to anywhere in the United States. \nOn Monday, Kim said the North would mass produce nuclear warheads and ballistic missiles in 2018 for operational deployment, warning he had a “nuclear button” on his desk which he would use if his country was threatened Reporting by Christine Kim; Additional reporting by Jane Chung; Editing by Michael Perry", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T10:41:00.000+02:00", "crawled": "2018-01-02T05:17:17.049+02:00", "highlightTitle": ""}