{"organizations": [], "uuid": "f304e6ba7fefe040e8d5a17f863450a06d6586b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220572073&w=1200&r=LYNXMPEE08125", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-bbc/after-china-editor-quits-bbc-asked-to-explain-itself-over-womens-pay-idUKKBN1EY1UL", "country": "US", "domain_rank": 408, "title": "After China editor quits, BBC asked to explain itself over women's pay", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:45:00.000+02:00", "replies_count": 0, "uuid": "f304e6ba7fefe040e8d5a17f863450a06d6586b1"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-bbc/after-china-editor-quits-bbc-asked-to-explain-itself-over-womens-pay-idUKKBN1EY1UL", "ord_in_thread": 0, "title": "After China editor quits, BBC asked to explain itself over women's pay", "locations": [], "entities": {"persons": [{"name": "matt hancock", "sentiment": "none"}, {"name": "carrie gracie", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "portland place", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 3:46 PM / Updated 2 hours ago After China editor quits, BBC asked to explain itself over women's pay Reuters Staff 3 Min Read \nLONDON (Reuters) - The BBC faced mounting pressure on Tuesday over why it pays some women less than men in equivalent jobs, with lawmakers as well as Britain’s anti-discrimination watchdog asking questions about the resignation of China Editor Carrie Gracie. FILE PHOTO - The main entrance to the BBC headquarters and studios in Portland Place, London, Britain, July 16, 2015. REUTERS/Peter Nicholls/File Photo \nAngry over the revelation that she was paid significantly less than male peers, the respected China specialist quit her post to fight against what she called the “secretive and illegal BBC pay culture”. \nHer resignation came after pay disclosures by the BBC, which is funded by a fee levied on TV viewers in Britain, dismayed many of its female staff by showing apparent discrepancies between what men and women were paid for similar work. \n“The brilliant women working at all levels of the BBC deserve better,” said Matt Hancock, newly appointed minister for culture and media, during a hastily arranged debate on BBC pay in parliament. \nHe also suggested that some of its prominent men were paid too much by a publicly funded organisation - a charge often levelled at the BBC by rival British media and other critics. \n“The BBC have begun to act and I welcome that, but more action, much more action is needed, especially when BBC foreign editors can earn more than Her Majesty’s ambassadors in the same jurisdiction,” he said. \nLawmaker Damian Collins, who chairs parliament’s media committee, announced he had invited the BBC’s Director-General Tony Hall to appear before the committee to answer questions about pay inequality at a session this month. \nCollins also invited Gracie to give evidence during the same session and said the committee may also hear from other BBC reporters, raising the prospect of uncomfortable scenes for Hall and BBC management as a whole. \n“Have been invited to give evidence to parliamentary selected committee on #equalpay for #BBCwomen. Yes! Let’s sort this pay mess now,” Gracie said on Twitter. \nSeparately, the Equalities and Human Rights Commission, in charge of enforcing anti-discrimination laws, said it was asking the BBC for information about its pay policy and the facts in Gracie’s case. \n“We will consider whether further action is required based on this information,” said the commission, which can use courts and tribunals to enforce people’s rights. \nThe BBC did not comment on the statements from the commission or from Collins, but reiterated that its gender pay gap was significantly better than the national average. \nHall has pledged to close the gender pay gap by 2020. \nGracie has disclosed that she was paid 135,000 pounds a year as China Editor. Her counterpart Jon Sopel, the North America Editor, is paid between 200,000 and 250,000 pounds according to the BBC. Reporting by Estelle Shirbon; editing by Stephen Addison", "external_links": [], "published": "2018-01-09T17:45:00.000+02:00", "crawled": "2018-01-09T18:06:13.001+02:00", "highlightTitle": ""}