{"organizations": [], "uuid": "4ade67b12d1e5bc4df8845ec6de264d737a96fcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-valley-national-bancorp-reports-fourth-quarter-net-income-and-solid-net-interest-margin.html", "country": "US", "domain_rank": 767, "title": "Valley National Bancorp Reports Fourth Quarter Net Income And Solid Net Interest Margin", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "4ade67b12d1e5bc4df8845ec6de264d737a96fcd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-valley-national-bancorp-reports-fourth-quarter-net-income-and-solid-net-interest-margin.html", "ord_in_thread": 0, "title": "Valley National Bancorp Reports Fourth Quarter Net Income And Solid Net Interest Margin", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}], "organizations": [{"name": "valley national bancorp", "sentiment": "negative"}, {"name": "usameribancorp, inc.", "sentiment": "none"}, {"name": "valley national bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WAYNE, N.J., Valley National Bancorp ( NYSE:VLY ), the holding company for Valley National Bank, today reported net income for the fourth quarter of 2017 of $26.1 million, or $0.09 per diluted common share, as compared to the fourth quarter of 2016 earnings of $50.1 million, or $0.19 per diluted common share, and net income of $39.6 million, or $0.14 per diluted common share, for the third quarter of 2017. The fourth quarter of 2017 results include $22.6 million of charges (representing a $0.09 per share decrease in earnings) from the impact of the Tax Cuts and Jobs Act (Tax Act) and $1.4 million (or $1.0 million after-tax) of merger expenses related to the USAmeriBancorp, Inc. (\"USAB\") acquisition effective January 1, 2018. Excluding these charges, our adjusted net income was $49.7 million, or $0.18 per diluted common share, for the fourth quarter of 2017. See the \"Consolidated Financial Highlights\" tables below for the reconciliation of this and other non-GAAP measures.\nNet income for the year ended December 31, 2017 was $161.9 million, or $0.58 per diluted common share, compared to 2016 earnings of $168.1 million, or $0.63 per diluted common share. The earnings for the year ended December 31, 2017 included the Tax Act charge, $9.9 million ($5.7 million after-tax) related to our LIFT earnings enhancement program and $2.6 million ($2.3 million after-tax) of USAB merger related expenses. Excluding these charges, our adjusted net income was $192.5 million, or $0.69 per diluted common share for the year ended December 31, 2017.\nKey financial highlights for the fourth quarter:\nNet Interest Income: Net interest income on a tax equivalent basis of $173.9 million for the fourth quarter of 2017 increased $7.1 million as compared to the third quarter of 2017 largely due to our solid loan growth and higher commercial loan fees. Net Interest Margin: Our net interest margin on a tax equivalent basis increased 9 basis points to 3.17 percent in the fourth quarter of 2017 as compared to 3.08 percent for the third quarter of 2017. See the \"Net Interest Income and Margin\" section below for more details. Loan Portfolio: Loans increased $130.1 million, or 2.9 percent on an annualized basis, to approximately $18.3 billion at December 31, 2017 from September 30, 2017 largely due to solid commercial, auto and consumer loan volumes, partially offset by increased secondary residential mortgage banking activity and a decline in construction loan advances during the fourth quarter. See additional information under the \"Loans, Deposits and Other Borrowings\" section below. Credit Quality : Net loan recoveries totaled $772 thousand for the fourth quarter of 2017, and represented our second consecutive quarter of net recoveries. Due to the strong collections, net charge-offs for year ended were only $2.1 million, or 0.01 percent of average loans for year ended December 31, 2017. Non-accrual loans also represented only 0.26 percent of total loans at December 31, 2017. Efficiency Ratio: Excluding LIFT program expenses, merger expense and amortization of tax credit investments (included in non-interest expense), our (non-GAAP) adjusted efficiency ratio was 57.44 percent for the fourth quarter of 2017 as compared to 59.21 percent for the third quarter of 2017. Tax Act: During the fourth quarter of 2017, we incurred a $22.6 million charge due the impact of the Tax Cuts and Jobs Act. Of the $22.6 million, $18.3 million relates to the estimated tax expense from the re-measurement of net deferred tax assets and the remaining $4.3 million is losses from adjustments to low income housing and tax-advantaged renewable energy investments included in non-interest expense.\nFinal financial results and other disclosures will be reported in our Annual Report on Form 10-K for the year ended December 31, 2017, and may differ materially from the results and disclosures in this document due to, among other things, the completion of final review procedures, the occurrence of subsequent events, or the discovery of additional information.\n\"Valley made substantial progress towards greater profitability in 2017,\" said Ira Robbins, CEO and President. \"Excluding infrequent charges, our adjusted net income for the fourth quarter of 2017 was up over 7 percent from the third quarter of 2017, and our full-year 2017 adjusted net income increased over 14 percent from 2016.\"\n\"Our previously announced LIFT initiative is well on track to deliver on the targets we laid out during our second quarter of 2017 earnings call. The recently closed acquisition of USAB has positioned us well to pursue strong organic growth in 2018 and beyond. Furthermore, we made significant progress implementing the first phase of our technology enhancements over the course of 2017, which is already helping to improve customer engagement. While there is still much heavy lifting to be done, we are pleased with the strides we have made on our quest to increase our relevance to our customers and the communities we serve. We look forward to demonstrating consistent progress as we achieve our strategic goals.\"\nNet Interest Income and Margin\nNet interest income on a tax equivalent basis totaling $173.9 million for the fourth quarter of 2017 increased $7.1 million and $7.3 million as compared to the third quarter of 2017 and fourth quarter of 2016, respectively. Interest income on a tax equivalent basis increased $8.8 million to $222.5 million for the fourth quarter of 2017 as compared to the third quarter of 2017 largely due to a 13 basis point increase in the yield on average loans and an increase of $236.4 million in average loans. The increase in loan yield was supplemented by a combined increase of $2.2 million in periodic commercial loan fee income related to derivative interest rate swaps executed with customers and loan prepayment penalty fees as compared to the third quarter of 2017, as well as higher interest accretion on certain acquired PCI loan pools caused by improvements in forecasted cash flows. Interest expense of $48.5 million for the three months ended December 31, 2017 increased $1.7 million and $11.8 million from the third quarter of 2017 and fourth quarter of 2016, respectively. During the fourth quarter of 2017, our interest expense on deposits increased by $2.2 million from the linked third quarter largely due to higher rates on certain retail money market and time deposit offerings. Interest expense on long-term borrowings also increased $1.2 million in the fourth quarter of 2017 as compared to the third quarter of 2017 due to an increase of $312.2 million in the average balances. Average long-term borrowings in the fourth quarter of 2017 increased as compared to the third quarter of 2017 mostly due to new long-term FHLB borrowings replacing a portion of our short-term borrowings that matured during the third and fourth quarters of 2017. Both the interest expense on short-term borrowings and average balances declined by $1.7 million and $526.4 million, respectively, during the fourth quarter of 2017 as compared to the third quarter of 2017 due to the partial shift to longer term funding and a reduction in borrowings due to the success of our deposit gathering initiatives in the second half of 2017.\nThe net interest margin on a tax equivalent basis was 3.17 percent for the fourth quarter of 2017, an increase of 9 basis points from 3.08 percent in the linked third quarter of 2017 and a 10 basis point decrease from 3.27 percent for the fourth quarter of 2016. The yield on average interest earning assets increased by 11 basis points on a linked quarter basis. The higher yield was mainly a result of the 13 basis point increase in the yield on average loans to 4.28 percent for the fourth quarter of 2017. The overall cost of average interest bearing liabilities increased by 3 basis points from 1.19 percent in the linked third quarter of 2017. The increase was primarily due to a 4 basis point increase in the cost of deposits. Our cost of deposits totaled 0.65 percent for the fourth quarter of 2017 as compared to 0.61 percent for the three months ended September 30, 2017.\nNon-Interest Income\nNon-interest income increased $1.5 million to $27.6 million for the three months ended December 31, 2017 from $26.1 million for the third quarter of 2017 mainly due to increases of $1.2 million and $855 thousand in other income and net gains on sales of loans, respectively, partially offset by moderate declines in several other categories.\nNon-Interest Expense\nNon-interest expense increased $3.8 million to $136.3 million for the fourth quarter of 2017 as compared to the third quarter of 2017. During the fourth quarter, the amortization of tax credit investments increased by $11.9 million due to the timing of tax credits and $4.3 million in impaired investment charges related to the Tax Act. Net occupancy and equipment expense increased $1.1 million due to moderate increases in depreciation, repairs and maintenance and real estate tax expenses as compared to the third quarter of 2017. These increases were partially offset by decreases of $5.4 million and $4.6 million in professional and legal fees and salary and employee benefits, respectively, as compared to the third quarter of 2017 largely due to charges related to LIFT program in the third quarter (See \"Earnings Enhancement Program\" section below for details). While salary and benefits declined during the fourth quarter, the decrease was net of additional salary and commissions expense related to investments in human capital primarily within our technology and residential mortgage consultant teams.\nEarnings Enhancement Program\nIn the third quarter of 2017, we completed the idea generation and approval phase of our company-wide earnings enhancement initiative called LIFT. As a result of these efforts, we currently expect to achieve approximately $22 million in total cost reductions and revenue enhancements on an annualized pre-tax run-rate. Implementation of the LIFT program resulted in employee severance and other implementation costs totaling approximately $9.9 million ($5.8 million after-tax) during both the third quarter and the year ended December 31, 2017. We estimate an additional $1.1 million of costs will be incurred during the planned implementation phase of the initiative enhancements which are expected to be fully phased-in by June 30, 2019. Mostly during the second half of 2017, Valley implemented several enhancements that resulted in pre-tax cost reductions of $5.6 million. These reductions are expected to be approximately $11.4 million on an annualized pre-tax basis beginning in the first quarter of 2018.\nIncome Tax Expense\nIncome tax expense was $35.0 million for the fourth quarter of 2017 and reflected the estimated impact of the Tax Act, consisting of an $18.3 million charge resulting from the re-measurement of Valley's estimated net deferred tax asset as of December 31, 2017. Excluding the $18.3 million charge and the $4.3 million impairment of tax credit investments related to the Tax Act, the effective tax rate was 25.5 percent for the fourth quarter of 2017 as compared to 30.1 percent and 26.8 percent for the third quarter of 2017 and fourth quarter of 2016, respectively. For 2018, we currently estimate that our effective tax rate will range from 21 percent to 23 percent primarily reflecting the impacts of the Tax Act, tax-exempt income, tax-advantaged investments and general business credits.\nLoans, Deposits and Other Borrowings\nLo ans . Loans increased $130.1 million to approximately $18.3 billion at December 31, 2017 from September 30, 2017, net of an $84.6 million decline in the PCI loan portion of the portfolio. During the fourth quarter of 2017, Valley also originated $243 million of residential mortgage loans for sale (rather than held for investment) and sold approximately $88 million of loans from the residential mortgage loan portfolio. Loans held for sale totaled $15.1 million and $13.3 million at December 31, 2017 and September 30, 2017, respectively.\nTotal commercial and industrial loans increased $34.5 million from September 30, 2017 to approximately $2.7 billion at December 31, 2017 due to a $44.4 million, or 7.1 percent on an annualized basis, increase in the non-PCI loan portfolio, partially offset by normal run-off in the PCI loan portfolio.\nTotal commercial real estate loans (excluding construction loans) increased $145.7 million from September 30, 2017 to $9.5 billion at December 31, 2017 mostly due to a $202.0 million, or 9.7 percent on an annualized basis, increase in the non-PCI loan portfolio. The increase in non-PCI loans was mainly caused by solid organic loan volumes in New York, New Jersey and Florida. The loan growth was partially offset by a $56.3 million decline in the acquired PCI loan portion of the portfolio and non-PCI loan repayments, partly caused by our continued focus to manage weaker credit relationships out of the portfolio. Construction loans decreased $52.5 million to $851.1 million at December 31, 2017 from September 30, 2017. The decrease was mainly due to completed construction projects during the fourth quarter and a decline in advances on new construction projects.\nTotal residential mortgage loans decreased $82.4 million, or 11.2 percent on annualized basis, to approximately $2.9 billion at December 31, 2017 from September 30, 2017 mostly due to a larger percentage of loans originated for sale rather than investment and the portfolio loans sold during the fourth quarter of 2017. Our growing team of home mortgage consultants continued to produce strong origination volumes during the fourth quarter. New and refinanced residential mortgage loan originations were approximately $291 million for the fourth quarter of 2017 as compared to $307 million for the third quarter of 2017. Of the $291 million in total originations, $23.0 million, or 7.9 percent, represented new residential mortgage loans originated in Florida.\nHome equity loans totaling $446.3 million at December 31, 2017 decreased by $2.6 million as compared to September 30, 2017 largely due to PCI loan repayment activity.\nAutomobile loans increased by $37.2 million, or 12.7 percent on an annualized basis, to $1.2 billion at December 31, 2017 as compared to September 30, 2017. New auto loan origination volumes increased approximately 11.4 percent during the fourth quarter of 2017 as compared to the third quarter of 2017 largely due to solid indirect auto application activity that has continued during the second half of 2017 without change to our underwriting criteria. Our Florida dealership network contributed over $34 million in new auto loans, representing approximately 21 percent of Valley's total auto loan production for the fourth quarter of 2017, as compared to approximately $25 million, or 17 percent, of Valley's total auto originations for the third quarter of 2017.\nOther consumer loans increased $50.2 million, or 29.6 percent on an annualized basis, to $728.1 million at December 31, 2017 as compared to September 30, 2017 mainly due to continued growth and customer usage of collateralized personal lines of credit.\nDeposits. Total deposits increased $840.7 million, or 4.9 percent, to approximately $18.2 billion at December 31, 2017 from September 30, 2017 mostly due to increases in money market accounts and time deposits resulting from ongoing retail and business account initiatives in 2017. Non-interest bearing deposit balances also increased $125.6 million at December 31, 2017 as compared to September 30, 2017 primarily due to normal seasonal commercial account activity. Non-interest bearing deposits; savings, NOW, money market deposits; and time deposits represented approximately 29 percent, 52 percent and 19 percent of total deposits as of December 31, 2017, respectively. The composition of deposits based upon the period end balances remained relatively unchanged at December 31, 2017 as compared to September 30, 2017.\nOther Borrowings. Short-term borrowings decreased $734.1 million, or 49.5 percent, to approximately $748.6 million at December 31, 2017 from September 30, 2017 mostly due to lower levels of short-term FHLB borrowings caused by the success of our current deposit gathering initiatives, and a partial shift to long-term borrowings in the fourth quarter. As a result, long-term borrowing increased $100.6 million, or 4.5 percent, to $2.3 billion at December 31, 2017 from September 30, 2017.\nCredit Quality\nNon-Performing Assets. Our past due loans and non-accrual loans discussed further below exclude PCI loans. Under U.S. GAAP, the PCI loans (acquired at a discount that is due, in part, to credit quality) are accounted for on a pool basis and are not subject to delinquency classification in the same manner as loans originated by Valley. At December 31, 2017, our PCI loan portfolio totaled $1.4 billion, or 7.6 percent of our total loan portfolio.\nTotal non-performing assets (NPAs), consisting of non-accrual loans, other real estate owned (OREO), other repossessed assets and non-accrual debt securities totaled $57.5 million at December 31, 2017 compared to $55.2 million at September 30, 2017. The $2.3 million increase in NPAs from September 30, 2017 was mostly due to an increase of $5.4 million in non-accrual loans, partially offset by a $975 thousand decrease in OREO at December 31, 2017. The increase in non-accrual loans was primarily related to taxi medallion loans totaling $8.8 million (See further discussion of our taxi medallion lending below). Despite the increase, non-accrual loans represented only 0.26 percent of total loans at December 31, 2017 as compared to 0.23 percent of total loans at September 30, 2017.\nTotal accruing past due loans (i.e., loans past due 30 days or more and still accruing interest) increased $50.3 million to $80.5 million, or 0.44 percent of total loans, at December 31, 2017 as compared to $30.1 million, or 0.17 percent of total loans, at September 30, 2017. The higher level of accruing past due loans was primarily caused by increases of $16.3 million and $12.9 million in construction loans past due 60 to 89 days and 30 to 59 days, respectively. The majority of the construction loans in these past due categories at December 31, 2017 are now either current to contractual terms or, if matured, in the normal process of renewal or collection. Our commercial real estate loans past due 30 to 59 days were $11.2 million at December 31, 2017 as compared to $4.8 million at September 30, 2017. The increase was largely related to 3 performing matured loans (in the normal process of renewal) with total combined balance of $7.6 million.\nDuring the fourth quarter of 2017, we continued to closely monitor our NYC and Chicago taxi medallion loans within the commercial and industrial loan portfolio. While the vast majority of the taxi medallion loans are currently performing, continued negative trends in the market valuations of the underlying taxi medallion collateral could impact the future performance and internal classification of this portfolio. At December 31, 2017, the NYC and Chicago taxi medallion loans totaling $127.7 million and $9.6 million, respectively, are largely classified as substandard and special mention loans. At December 31, 2017, the medallion portfolio included impaired loans of $63.9 million with related reserves of $9.1 million within the allowance for loan losses as compared to impaired loans of $40.5 million with related reserves of $5.0 million at September 30, 2017. At December 31, 2017, the impaired taxi medallion loans largely consisted of performing troubled debt restructured (TDR) loans classified as substandard loans, as well as $14.2 million of non-accrual taxi cab medallion loans classified as doubtful. Our non-accrual taxi medallion loans increased $8.6 million as compared to September 30, 2017 largely due to weakened levels of cash flow, collateral and guarantor support in relation to some medallion borrowers, and not due to actual loan performance.\nValley's historical taxi medallion lending criteria has been conservative in regards to capping the loan amounts in relation to market valuations, as well as obtaining personal guarantees and other collateral in certain instances. However, potential further declines in the market valuation of taxi medallions could negatively impact the future performance of this portfolio.\nThe following table summarizes the allocation of the allowance for credit losses to specific loan categories and the allocation as a percentage of each loan category (including PCI loans) at December 31, 2017, September 30, 2017, and December 31, 2016:\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\nAllocation\nAllocation\nAllocation\nas a % of\nas a % of\nas a % of\nAllowance\nLoan\nAllowance\nLoan\nAllowance\nLoan\nAllocation\nCategory\nAllocation\nCategory\nAllocation\nCategory\n($ in thousands)\nLoan Category:\nCommercial and industrial loans*\n$\n60,828\n2.22\n%\n$\n57,203\n2.11\n%\n$\n53,005\n2.01\n%\nCommercial real estate loans:\nCommercial real estate\n36,293\n0.38\n%\n36,626\n0.39\n%\n36,405\n0.42\n%\nConstruction\n18,661\n2.19\n%\n18,673\n2.07\n%\n19,446\n2.36\n%\nTotal commercial real estate loans\n54,954\n0.53\n%\n55,299\n0.54\n%\n55,851\n0.59\n%\nResidential mortgage loans\n3,605\n0.13\n%\n3,892\n0.13\n%\n3,702\n0.13\n%\nConsumer loans:\nHome equity\n579\n0.13\n%\n592\n0.13\n%\n486\n0.10\n%\nAuto and other consumer\n4,486\n0.23\n%\n4,494\n0.24\n%\n3,560\n0.21\n%\nTotal consumer loans\n5,065\n0.21\n%\n5,086\n0.22\n%\n4,046\n0.19\n%\nTotal allowance for credit losses\n$\n124,452\n0.68\n%\n$\n121,480\n0.67\n%\n$\n116,604\n0.68\n%\nAllowance for credit losses as a %\nof non-PCI loans\n0.73\n%\n0.73\n%\n0.75\n%\n* Includes the reserve for unfunded letters of credit.\nOur loan portfolio, totaling $18.3 billion at December 31, 2017, had net recoveries of loan charge-offs of $772 thousand and $1.2 million for the fourth quarter of 2017 and third quarter of 2017, respectively, as compared to net loan charge-offs of $110 thousand for the fourth quarter of 2016. Overall, net loan charge-offs decreased to $2.1 million for the year ended December 31, 2017 from $3.6 million for the year ended December 31, 2016. During the fourth quarter of 2017, we recorded a provision for credit losses totaling $2.2 million as compared to $1.6 million for the third quarter of 2017 and $3.8 million for the fourth quarter of 2016. Overall, our provision for credit losses was $9.9 million for the year ended December 31, 2017 as compared to $11.9 million for the year ended December 31, 2016.\nThe allowance for credit losses, comprised of our allowance for loan losses and reserve for unfunded letters of credit, as a percentage of total loans was 0.68 percent at both December 31, 2017 and December 31, 2016, and was 0.67 percent at September 30, 2017. At December 31, 2017, our allowance allocations for losses as a percentage of total loans remained relatively stable in most loan categories as compared to September 30, 2017, but increased 0.11 percent for commercial and industrial loans due, in part, to an increase in specific reserves for impaired loans.\nOur allowance for credit losses as a percentage of total non-PCI loans (excluding PCI loans with carrying values totaling approximately $1.4 billion) was 0.73 percent at December 31, 2017 as compared to 0.73 percent and 0.75 percent at September 30, 2017 and December 31, 2016, respectively. PCI loans, largely acquired through prior bank acquisitions, are accounted for on a pool basis and initially recorded net of fair valuation discounts related to credit which may be used to absorb future losses on such loans before any allowance for loan losses is recognized subsequent to acquisition. Due to the adequacy of such discounts, there were no allowance reserves related to PCI loans at December 31, 2017, September 30, 2017 and December 31, 2016.\nCapital Adequacy\nValley's regulatory capital ratios continue to reflect its strong capital position. Valley's total risk-based capital, Tier 1 capital, Tier 1 leverage capital, and common equity Tier 1 capital ratios were 12.61 percent, 10.41 percent, 8.03 percent and 9.22 percent, respectively, at December 31, 2017.\nInvestor Conference Call\nValley will host a conference call with investors and the financial community at 11:00 AM Eastern Standard Time, today to discuss the 2017 fourth quarter earnings. Those wishing to participate in the call may dial toll-free (800) 230-1951. Investor presentation materials will be made available prior to the conference call at www.valleynationalbank.com .\nAbout Valley\nValley National Bancorp is a regional bank holding company headquartered in Wayne, New Jersey with approximately $28 billion in assets, reflecting the recent acquisition of USAB. Its principal subsidiary, Valley National Bank, currently operates over 230 branch locations in northern and central New Jersey, the New York City boroughs of Manhattan, Brooklyn, Queens and Long Island, Florida and Alabama. Valley National Bank is one of the largest commercial banks headquartered in New Jersey and is committed to providing the most convenient service, the latest in product innovations and an experienced and knowledgeable staff with a high priority on friendly customer service. For more information about Valley National Bank and its products and services, please visit www.valleynationalbank.com or call our Customer Service Center at 800-522-4100.\nForward Looking Statements\nThe foregoing contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's expectations about new and existing programs and products, acquisitions, relationships, opportunities, taxation, technology, market conditions and economic expectations. These statements may be identified by such forward-looking terminology as \"should,\" \"expect,\" \"believe,\" \"view,\" \"opportunity,\" \"allow,\" \"continues,\" \"reflects,\" \"typically,\" \"usually,\" \"anticipate,\" or similar statements or variations of such terms. Such forward-looking statements involve certain risks and uncertainties. Actual results may differ materially from such forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by such forward-looking statements include, but are not limited to:\nweakness or a decline in the economy, mainly in New Jersey, New York, Florida and Alabama, as well as an unexpected decline in commercial real estate values within our market areas; less than expected cost reductions and revenue enhancement from Valley's cost reduction plans including its earnings enhancement program called \"LIFT\"; higher or lower than expected income tax expense or tax rates, including increases or decreases resulting from the impact of the Tax Act and other changes in tax laws, regulations and case law; damage verdicts or settlements or restrictions related to existing or potential litigations arising from claims of breach of fiduciary responsibility, negligence, fraud, contractual claims, environmental laws, patent or trade mark infringement, employment related claims, and other matters; the loss of or decrease in lower-cost funding sources within our deposit base may adversely impact our net interest income and net income; cyber attacks, computer viruses or other malware that may breach the security of our websites or other systems to obtain unauthorized access to confidential information, destroy data, disable or degrade service, or sabotage our systems; results of examinations by the OCC, the FRB, the CFPB and other regulatory authorities, including the possibility that any such regulatory authority may, among other things, require us to increase our allowance for credit losses, write-down assets, require us to reimburse customers, change the way we do business, or limit or eliminate certain other banking activities; changes in accounting policies or accounting standards, including the new authoritative accounting guidance (known as the current expected credit loss (CECL) model) which may increase the required level of our allowance for credit losses after adoption on January 1, 2020; our inability or determination not to pay dividends at current levels, or at all, because of inadequate future earnings, regulatory restrictions or limitations, changes in our capital requirements or a decision to increase capital by retaining more earnings; higher than expected loan losses within one or more segments of our loan portfolio; unanticipated loan delinquencies, loss of collateral, decreased service revenues, and other potential negative effects on our business caused by severe weather or other external events; unexpected significant declines in the loan portfolio due to the lack of economic expansion, increased competition, large prepayments, changes in regulatory lending guidance or other factors; the failure of other financial institutions with whom we have trading, clearing, counterparty and other financial relationships. the risk that the businesses of Valley and USAB may not be combined successfully, or such combination may take longer or be more difficult, time-consuming or costly to accomplish than expected; the diversion of management's time on issues relating to merger integration; the inability to realize expected cost savings and synergies from the merger of USAB with Valley in the amounts or in the timeframe anticipated; and the inability to retain USAB's customers and employees.\nA detailed discussion of factors that could affect our results is included in our SEC filings, including the \"Risk Factors\" section of our Annual Report on Form 10-K for the year ended December 31, 2016 and Quarterly Report on Form 10-Q for the period ended September 30, 2017.\nWe undertake no duty to update any forward-looking statement to conform the statement to actual results or changes in our expectations. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements.\nVALLEY NATIONAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\nSELECTED FINANCIAL DATA\nThree Months Ended\nYears Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n($ in thousands, except for share data)\n2017\n2017\n2016\n2017\n2016\nFINANCIAL DATA:\nNet interest income\n$\n171,969\n$\n164,854\n$\n164,395\n$\n668,312\n$\n618,149\nNet interest income - FTE (1)\n173,949\n166,878\n166,601\n676,615\n626,531\nNon-interest income\n27,604\n26,088\n32,660\n103,441\n103,225\nNon-interest expense\n136,317\n132,565\n124,829\n509,073\n476,125\nIncome tax expense\n34,958\n17,088\n18,336\n90,831\n65,234\nNet income\n26,098\n39,649\n50,090\n161,907\n168,146\nDividends on preferred stock\n3,172\n2,683\n1,797\n9,449\n7,188\nNet income available to common stockholders\n$\n22,926\n$\n36,966\n$\n48,293\n$\n152,458\n$\n160,958\nWeighted average number of common shares outstanding:\nBasic\n264,332,895\n264,058,174\n256,422,437\n264,038,123\n254,841,571\nDiluted\n265,288,067\n264,936,220\n256,952,036\n264,889,007\n255,268,336\nPer common share data:\nBasic earnings\n$\n0.09\n$\n0.14\n$\n0.19\n$\n0.58\n$\n0.63\nDiluted earnings\n0.09\n0.14\n0.19\n0.58\n0.63\nCash dividends declared\n0.11\n0.11\n0.11\n0.44\n0.44\nClosing stock price - high\n12.17\n12.40\n11.97\n12.76\n11.97\nClosing stock price - low\n11.00\n10.71\n9.46\n10.71\n8.31\nCORE ADJUSTED FINANCIAL DATA: (2)\nNet income available to common shareholders, as adjusted\n$\n46,560\n$\n43,919\n$\n48,293\n$\n183,046\n$\n160,958\nBasic earnings per share, as adjusted\n0.18\n0.17\n0.19\n0.69\n0.63\nDiluted earnings per share, as adjusted\n0.18\n0.17\n0.19\n0.69\n0.63\nFINANCIAL RATIOS:\nNet interest margin\n3.14\n%\n3.05\n%\n3.23\n%\n3.11\n%\n3.12\n%\nNet interest margin - FTE (1)\n3.17\n3.08\n3.27\n3.15\n3.16\nAnnualized return on average assets\n0.44\n0.67\n0.88\n0.69\n0.76\nAnnualized return on avg. shareholders' equity\n4.07\n6.34\n8.70\n6.55\n7.46\nAnnualized return on avg. tangible shareholders' equity (2)\n5.71\n8.96\n12.76\n9.32\n11.07\nEfficiency ratio (3)\n68.30\n69.43\n63.35\n65.96\n66.00\nCORE ADJUSTED FINANCIAL RATIOS: (2)\nAnnualized return on average assets, as adjusted\n0.83\n%\n0.79\n%\n0.88\n%\n0.82\n%\n0.76\n%\nAnnualized return on average shareholders' equity, as adjusted\n7.76\n7.45\n8.70\n7.79\n7.46\nAnnualized return on average tangible shareholders' equity, as adjusted\n10.87\n10.54\n12.76\n11.08\n11.07\nEfficiency ratio, as adjusted\n57.44\n59.21\n56.56\n58.93\n61.19\nAVERAGE BALANCE SHEET ITEMS:\nAssets\n$\n23,907,011\n$\n23,604,252\n$\n22,679,991\n$\n23,478,798\n$\n22,044,874\nInterest earning assets\n21,932,517\n21,642,846\n20,388,486\n21,488,498\n19,829,312\nLoans\n18,242,690\n18,006,274\n16,779,765\n17,819,003\n16,400,745\nInterest bearing liabilities\n15,919,382\n15,737,738\n14,928,160\n15,640,317\n14,524,881\nDeposits\n17,812,343\n17,353,099\n17,428,646\n17,456,115\n16,734,639\nShareholders' equity\n2,562,326\n2,502,538\n2,304,208\n2,471,751\n2,253,570\nVALLEY NATIONAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\nAs of\nBALANCE SHEET ITEMS:\nDecember 31,\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n(In thousands)\n2017\n2017\n2017\n2017\n2016\nAssets\n$\n24,002,306\n$\n23,780,661\n$\n23,449,350\n$\n23,220,456\n$\n22,864,439\nTotal loans\n18,331,580\n18,201,462\n17,710,760\n17,449,498\n17,236,103\nNon-PCI loans\n16,944,365\n16,729,607\n16,169,291\n15,794,797\n15,464,601\nDeposits\n18,153,462\n17,312,766\n17,250,018\n17,331,141\n17,730,708\nShareholders' equity\n2,533,165\n2,537,984\n2,423,901\n2,398,541\n2,377,156\nLOANS:\n(In thousands)\nCommercial and industrial\n$\n2,741,425\n$\n2,706,912\n$\n2,631,312\n$\n2,642,319\n$\n2,638,195\nCommercial real estate:\nCommercial real estate\n9,496,777\n9,351,068\n9,230,514\n9,016,418\n8,719,667\nConstruction\n851,105\n903,640\n881,073\n835,854\n824,946\nTotal commercial real estate\n10,347,882\n10,254,708\n10,111,587\n9,852,272\n9,544,613\nResidential mortgage\n2,859,035\n2,941,435\n2,724,777\n2,745,447\n2,867,918\nConsumer:\nHome equity\n446,280\n448,842\n450,510\n458,891\n469,009\nAutomobile\n1,208,902\n1,171,685\n1,150,343\n1,150,053\n1,139,227\nOther consumer\n728,056\n677,880\n642,231\n600,516\n577,141\nTotal consumer loans\n2,383,238\n2,298,407\n2,243,084\n2,209,460\n2,185,377\nTotal loans\n$\n18,331,580\n$\n18,201,462\n$\n17,710,760\n$\n17,449,498\n$\n17,236,103\nCAPITAL RATIOS:\nBook value per common share\n$\n8.79\n$\n8.81\n$\n8.76\n$\n8.67\n$\n8.59\nTangible book value per common share (2)\n6.01\n6.04\n5.98\n5.88\n5.80\nTangible common equity to tangible assets (2)\n6.83\n%\n6.92\n%\n6.95\n%\n6.90\n%\n6.91\n%\nTier 1 leverage capital\n8.03\n8.13\n7.69\n7.70\n7.74\nCommon equity tier 1 capital\n9.22\n9.22\n9.18\n9.12\n9.27\nTier 1 risk-based capital\n10.41\n10.42\n9.81\n9.76\n9.90\nTotal risk-based capital\n12.61\n12.61\n11.99\n11.96\n12.15\nVALLEY NATIONAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\nThree Months Ended\nYears Ended\nALLOWANCE FOR CREDIT LOSSES:\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n($ in thousands)\n2017\n2017\n2016\n2017\n2016\nBeginning balance - Allowance for credit losses\n$\n121,480\n$\n118,621\n$\n112,914\n$\n116,604\n$\n108,367\nLoans charged-off:\nCommercial and industrial\n(532)\n(265)\n(483)\n(5,421)\n(5,990)\nCommercial real estate\n(6)\n—\n(131)\n(559)\n(650)\nConstruction\n—\n—\n—\n—\n—\nResidential mortgage\n(42)\n(129)\n(116)\n(530)\n(866)\nTotal Consumer\n(1,097)\n(1,335)\n(911)\n(4,564)\n(3,463)\nTotal loans charged-off\n(1,677)\n(1,729)\n(1,641)\n(11,074)\n(10,969)\nCharged-off loans recovered:\nCommercial and industrial\n1,256\n2,320\n435\n4,736\n2,852\nCommercial real estate\n22\n42\n466\n552\n2,047\nConstruction\n579\n—\n—\n873\n10\nResidential mortgage\n113\n220\n171\n1,016\n774\nTotal Consumer\n479\n366\n459\n1,803\n1,654\nTotal loans recovered\n2,449\n2,948\n1,531\n8,980\n7,337\nNet recoveries (charge-offs)\n772\n1,219\n(110)\n(2,094)\n(3,632)\nProvision for credit losses\n2,200\n1,640\n3,800\n9,942\n11,869\nEnding balance - Allowance for credit losses\n$\n124,452\n$\n121,480\n$\n116,604\n$\n124,452\n$\n116,604\nComponents of allowance for credit losses:\nAllowance for loans\n$\n120,856\n$\n118,966\n$\n114,419\n$\n120,856\n$\n114,419\nAllowance for unfunded letters of credit\n3,596\n2,514\n2,185\n3,596\n2,185\nAllowance for credit losses\n$\n124,452\n$\n121,480\n$\n116,604\n$\n124,452\n$\n116,604\nComponents of provision for credit losses:\nProvision for loan losses\n$\n1,118\n$\n1,301\n$\n3,832\n$\n8,531\n$\n11,873\nProvision for unfunded letters of credit\n1,082\n339\n(32)\n1,411\n(4)\nProvision for credit losses\n$\n2,200\n$\n1,640\n$\n3,800\n$\n9,942\n$\n11,869\nAnnualized ratio of total net (recoveries) charge-offs to average loans\n(0.02)\n%\n(0.03)\n%\n0.00\n%\n0.01\n%\n0.02\n%\nAllowance for credit losses as a % of non-PCI loans\n0.73\n%\n0.73\n%\n0.75\n%\n0.73\n%\n0.75\n%\nAllowance for credit losses as a % of total loans\n0.68\n%\n0.67\n%\n0.68\n%\n0.68\n%\n0.68\n%\nVALLEY NATIONAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\nAs of\nASSET QUALITY: (4)\nDecember 31,\nSeptember 30,\nJune 30,\nMarch 31,\nDecember 31,\n($ in thousands)\n2017\n2017\n2017\n2017\n2016\nAccruing past due loans:\n30 to 59 days past due:\nCommercial and industrial\n$\n3,650\n$\n1,186\n$\n2,391\n$\n29,734\n$\n6,705\nCommercial real estate\n11,223\n4,755\n6,983\n11,637\n5,894\nConstruction\n12,949\n—\n—\n7,760\n6,077\nResidential mortgage\n12,669\n7,942\n4,677\n7,533\n12,005\nTotal Consumer\n8,409\n5,205\n4,393\n3,740\n4,197\nTotal 30 to 59 days past due\n48,900\n19,088\n18,444\n60,404\n34,878\n60 to 89 days past due:\nCommercial and industrial\n544\n3,043\n2,686\n341\n5,010\nCommercial real estate\n—\n626\n8,233\n359\n8,642\nConstruction\n18,845\n2,518\n854\n—\n—\nResidential mortgage\n7,903\n1,604\n1,721\n4,177\n3,564\nTotal Consumer\n1,199\n1,019\n1,007\n787\n1,147\nTotal 60 to 89 days past due\n28,491\n8,810\n14,501\n5,664\n18,363\n90 or more days past due:\nCommercial and industrial\n—\n125\n—\n405\n142\nCommercial real estate\n27\n389\n2,315\n—\n474\nConstruction\n—\n—\n2,879\n—\n1,106\nResidential mortgage\n2,779\n1,433\n3,353\n1,355\n1,541\nTotal Consumer\n284\n301\n275\n314\n209\nTotal 90 or more days past due\n3,090\n2,248\n8,822\n2,074\n3,472\nTotal accruing past due loans\n$\n80,481\n$\n30,146\n$\n41,767\n$\n68,142\n$\n56,713\nNon-accrual loans:\nCommercial and industrial\n$\n20,890\n$\n11,983\n$\n11,072\n$\n8,676\n$\n8,465\nCommercial real estate\n11,328\n13,870\n15,514\n15,106\n15,079\nConstruction\n732\n1,116\n1,334\n1,461\n715\nResidential mortgage\n12,405\n12,974\n12,825\n11,650\n12,075\nTotal Consumer\n1,870\n1,844\n1,409\n1,395\n1,174\nTotal non-accrual loans\n47,225\n41,787\n42,154\n38,288\n37,508\nOther real estate owned (OREO) (5)\n9,795\n10,770\n10,182\n10,737\n9,612\nOther repossessed assets\n441\n480\n342\n475\n384\nNon-accrual debt securities (6)\n—\n2,115\n1,878\n2,007\n1,935\nTotal non-performing assets\n$\n57,461\n$\n55,152\n$\n54,556\n$\n51,507\n$\n49,439\nPerforming troubled debt restructured loans\n$\n117,176\n$\n113,677\n$\n109,802\n$\n80,360\n$\n85,166\nTotal non-accrual loans as a % of loans\n0.26\n%\n0.23\n%\n0.24\n%\n0.22\n%\n0.22\n%\nTotal accruing past due and non-accrual loans\nas a % of loans\n0.70\n%\n0.40\n%\n0.47\n%\n0.61\n%\n0.55\n%\nAllowance for loan losses as a % of non-accrual\nloans\n255.92\n%\n284.70\n%\n276.24\n%\n301.51\n%\n305.05\n%\nNon-performing purchased credit-impaired loans (7)\n$\n38,088\n$\n25,413\n$\n33,715\n$\n25,857\n$\n27,011\nVALLEY NATIONAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\nNOTES TO SELECTED FINANCIAL DATA\n(1)\nNet interest income and net interest margin are presented on a tax equivalent basis using a 35 percent federal tax rate. Valley believes that this presentation provides comparability of net interest income and net interest margin arising from both taxable and tax-exempt sources and is consistent with industry practice and SEC rules.\n(2)\nThis press release contains certain supplemental financial information, described in the Notes below, which has been determined by methods other than U.S. Generally Accepted Accounting Principles (\"GAAP\") that management uses in its analysis of Valley's performance. Management believes these non-GAAP financial measures provide information useful to investors in understanding Valley's financial results. Specifically, Valley provides measures based on what it believes are its operating earnings on a consistent basis and excludes material non-core operating items which affect the GAAP reporting of results of operations. Management utilizes these measures for internal planning and forecasting purposes. Management believes that Valley's presentation and discussion, together with the accompanying reconciliations, provides a complete understanding of factors and trends affecting Valley's business and allows investors to view performance in a manner similar to management. These non-GAAP measures should not be considered a substitute for GAAP basis measures and results and Valley strongly encourages investors to review its consolidated financial statements in their entirety and not to rely on any single financial measure. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-GAAP financial measures having the same or similar names.\nThree Months Ended\nYears Ended\nDecember 31,\nSeptember 30,\nDecember 31,\nDecember 31,\n($ in thousands, except for share data)\n2017\n2017\n2016\n2017\n2016\nAdjusted net income available to common shareholders:\nNet income, as reported\n$\n26,098\n$\n39,649\n$\n50,090\n$\n161,907\n$\n168,146\nAdd: LIFT program expenses (net of tax)*\n—\n5,753\n—\n5,753\n—\nAdd: Merger related expenses (net of tax)**\n1,073\n1,200\n—\n2,274\n—\nAdd: Amortization of tax credit investments (Tax Act Impact Only)\n4,271\n—\n—\n4,271\n—\nAdd: Income Tax Expense (Tax Act Impact Only)\n18,290\n—\n—\n18,290\n—\nNet income, as adjusted\n$\n49,732\n$\n46,602\n$\n50,090\n$\n192,495\n$\n168,146\nDividends on preferred stock\n3,172\n2,683\n1,797\n9,449\n7,188\nNet income available to common shareholders, as adjusted\n$\n46,560\n$\n43,919\n$\n48,293\n$\n183,046\n$\n160,958", "external_links": ["http://www.valleynationalbank.com/"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:38:27.008+02:00", "highlightTitle": ""}