{"organizations": [], "uuid": "e7321f63397224246c9bc876f29d6ba007c8461a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220612543&w=1200&r=LYNXMPEE081C6", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-eu-markets-regulations/european-regulator-delays-dark-pool-trading-restriction-data-idUKKBN1EY22Z", "country": "US", "domain_rank": 408, "title": "EU regulator delays trading caps in new MiFID setback", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:57:00.000+02:00", "replies_count": 0, "uuid": "e7321f63397224246c9bc876f29d6ba007c8461a"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-markets-regulations/european-regulator-delays-dark-pool-trading-restriction-data-idUKKBN1EY22Z", "ord_in_thread": 0, "title": "EU regulator delays trading caps in new MiFID setback", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "none"}, {"name": "reuters/ralph orlowski", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "european securities and markets authority", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 5:27 PM / Updated 34 minutes ago EU regulator delays trading caps in new MiFID setback Helen Reid 3 Min Read \nLONDON (Reuters) - The European Union’s market watchdog suffered another setback on Tuesday in its efforts to bed down sweeping new securities rules that have already been delayed a year. FILE PHOTO - A trader walks past the German DAX Index board on the trading floor at the Frankfurt stock exchange, Germany, June 24, 2016, after Britain voted to leave the European Union in the EU BREXIT referendum. REUTERS/Ralph Orlowski \nThe European Securities and Markets Authority (ESMA) unexpectedly delayed until March the publication of data meant to specify which stocks will be subject to limits on trading in “dark pools”, meaning not on public exchanges. \nThe regulator said it was forced to delay the restrictions due to insufficient data, pushing back a core element of the bloc’s new MiFID II rules that came into force on Jan. 3, a year later than originally planned. \n“The current quality and completeness of the data does not allow for a sufficiently meaningful and comprehensive publication of double volume cap calculations,” ESMA said in a statement, adding that it expected to be able to publish the data in March. \nUnder the new Markets in Financial Instruments Directive II (MiFID II) regime, so-called “double volume” caps will require dark pools to suspend trading in stocks for which, on average, more than 8 percent of daily trading was transacted in the dark over the past 12 months. \nThe aim of the caps is to push more trading onto so-called “lit” or fully transparent exchanges where all investors can see the prices at which transactions are being made. \nESMA has been collecting data on dark trading but said the quality and completeness of the data fell short of the rigour it would have expected, and publication could have led to an “unlevel” playing field. \n“ESMA realised that the publication would have resulted in a biased picture covering only a very limited number of instruments and markets,” the watchdog said. \nIt marks the latest last-minute adjustment made by ESMA and national regulators in a bid to keep MiFID II on track. \nSeveral exchanges have been given temporary relief from competition in clearing. \nMarket participants have also been given an extra six months to obtain an identifier that is mandatory for reporting trades. \nESMA said it would be able to publish the volume cap data in March after consulting with trading venues and local regulators, and acknowledged that it had given limited time to submit data. \n“The time scales were just simply too tight for that volume of data,” said Toby Bayliss, head of electronic trading for Europe at Bernstein. \nThe reporting period closed on Dec. 31, and data had to reach ESMA by the close of business on Jan. 5. \nBrokers and other market participants have spent months preparing algorithms and trading systems for the introduction of dark pool caps, and were poised to apply the caps on Friday. \n“It’s not wasted work, but it’s perhaps unnecessary pressure that has been put on firms when perhaps there could have been a bit more breathing space,” said Bernstein’s Bayliss. Reporting by Helen Reid; Editing by Julien Ponthus and Hugh Lawson", "external_links": [], "published": "2018-01-09T20:57:00.000+02:00", "crawled": "2018-01-09T21:24:09.065+02:00", "highlightTitle": ""}