{"organizations": [], "uuid": "811df36370ee0e7c8eecd94c47e3e1ba4bca6790", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-train/update-1-canadian-jury-acquits-3-over-lac-megantic-derailment-idUSL1N1PE1JH", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Canadian jury acquits 3 over Lac Megantic derailment", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-20T04:26:00.000+02:00", "replies_count": 0, "uuid": "811df36370ee0e7c8eecd94c47e3e1ba4bca6790"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-train/update-1-canadian-jury-acquits-3-over-lac-megantic-derailment-idUSL1N1PE1JH", "ord_in_thread": 0, "title": "UPDATE 2-Canadian jury acquits 3 over Lac Megantic derailment", "locations": [], "entities": {"persons": [{"name": "allis", "sentiment": "negative"}, {"name": "anna mehler paperny", "sentiment": "negative"}, {"name": "bakken", "sentiment": "none"}, {"name": "jean demaître", "sentiment": "none"}, {"name": "richard labrie", "sentiment": "none"}, {"name": "lampert", "sentiment": "none"}, {"name": "tom harding", "sentiment": "none"}], "locations": [{"name": "lac megantic", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}], "organizations": [{"name": "montreal maine & atlantic", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "montreal maine & atlantic railway ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds remarks from Lac Megantic mayor, Canadian Transport Minister)\nBy Anna Mehler Paperny and Allison Lampert\nTORONTO/MONTREAL, Jan 19 (Reuters) - A Canadian jury on Friday found three former rail workers not guilty of criminal negligence causing death in connection with a 2013 crude-by-rail derailment that killed 47 in the town of Lac Megantic in Quebec.\nThe downtown section was destroyed following the July 2013 derailment of a Montreal Maine & Atlantic Railway Ltd train carrying crude oil, in one of Canada’s deadliest rail accidents.\nCalls to improve rail safety prompted Canada to end use of one-man crews to move dangerous goods and enhance protection standards for tank cars transporting crude.\nThe jury acquitted operations manager Jean Demaître, 53, rail traffic controller Richard Labrie, 59, and locomotive engineer Tom Harding, 56.\nThe three worked for the now-defunct Montreal Maine & Atlantic railway, which operated the runaway train carrying 7.7 million liters (2 million gallons) of volatile Bakken crude oil, according to a 2014 accident report.\n“It was a long process, but now it’s over and my only hope is that we can actually turn the page and become anonymous again, as we were before 2013,” an emotional Labrie told reporters in the courthouse.\nThe verdict followed nine days of deliberations and multiple questions posed by the jury which had initially hit an impasse.\nHarding’s lawyer, Tom Walsh, said this was “a very fair verdict,” adding that his client was “terribly relieved and terribly thankful to the system.”\n“He will always be the poster boy for Lac Megantic and the Lac Megantic tragedy, whether we like it or not,” his lawyer said.\nThe trial came amid an expected resurgence in rail shipments of less volatile Canadian crude in 2018 as tight pipeline capacity is pushing more oil onto railroads.\nJulie Morin, mayor of Lac Megantic, near the U.S. border with Maine, said she was not surprised by the jury’s decision and was glad that they were finally able to reach a verdict. While railway safety has improved since the 2013 tragedy, she said Lac Megantic was still asking for a detour so the track would bypass the town.\n“Whatever the verdict, it does not change what we are living here,” she said by phone.\nCanadian Transport Minister Marc Garneau said in a statement that “this accident reminds us of the importance of having effective legislation and a rigorous enforcement regime for our rail transportation system.”\nReporting by Anna Mehler Paperny in Toronto and Allison Lampert in Montreal; Editing by Sandra Maler and Richard Chang\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T04:26:00.000+02:00", "crawled": "2018-01-20T17:26:54.009+02:00", "highlightTitle": ""}