{"organizations": [], "uuid": "78f8b9c8045dbc9e2c8588cdaec314774de62c5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/23/104790115-Photo-Oct-23-2-12-04-PM.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/12/billionaire-saudi-prince-alwaleeds-time-is-running-out-commentary.html", "country": "US", "domain_rank": 767, "title": "Billionaire Saudi Prince Alwaleed's time is running out—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:14:00.000+02:00", "replies_count": 0, "uuid": "78f8b9c8045dbc9e2c8588cdaec314774de62c5e"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/12/billionaire-saudi-prince-alwaleeds-time-is-running-out-commentary.html", "ord_in_thread": 0, "title": "Billionaire Saudi Prince Alwaleed's time is running out—Commentary", "locations": [], "entities": {"persons": [{"name": "alwaleed", "sentiment": "negative"}, {"name": "prince alwal", "sentiment": "negative"}, {"name": "bin talal", "sentiment": "none"}, {"name": "talal", "sentiment": "none"}, {"name": "salman", "sentiment": "none"}, {"name": "al ha'ir", "sentiment": "none"}, {"name": "mohammed bin salman", "sentiment": "none"}, {"name": "al-araby al-jadeed", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "al ha'ir prison", "sentiment": "none"}, {"name": "riyadh ritz", "sentiment": "none"}, {"name": "riyadh ritz carlton hotel", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saudi Prince Alwaleed bin Talal. \nSaudi Arabia's richest man is running out of time. \nIt's been more than two months since Prince Alwaleed bin Talal was first arrested and detained in what the Saudi government still calls an \"anti-corruption\" sweep. Yet the first sign of things getting more serious came early this week when Alwaleed was moved out of his restricted quarters at the Riyadh Ritz Carlton Hotel and moved to Al Ha'ir prison, according to the London-based Arabic news site Al-Araby Al-Jadeed. \nAl Ha'ir is not exactly the Bastille , but the decision to get Alwaleed to a more secluded and secure location is ominous. \nFor more than two months, the prince had been held at the Riyadh Ritz along with what had originally been 200 of his fellow princes and top officials. That number has dwindled to just a few prisoners. Most of the former detainees have bought their freedom with payments and other forms of capitulation to the new Saudi Crown Prince Mohammed bin Salman. \nPrince bin Salman came to power last summer when King Salman made the extremely unusual move to change the order of succession and make bin Salman crown prince. \nSince then he has been beefing up Saudi Arabia's military defenses against Iran, strengthening ties to the U.S. and even Israel in the process. In the fall, he further moved to purge the country of anti-Semitic and anti-American Islamic clerics. In November, bin Salman's economic reforms morphed into this arrest of Alwaleed and those 200 other princes and officials who were at least potential rivals in the overall power grab. \nIt's not that many of the crown prince's goals aren't prudent or even admirable. But the matter of human rights is being pushed aside. So is due process. \nAnother example of that happened this week with the Saudi government's outright seizure of the Binladin Group construction giant . A Reuters report says the government has taken managerial control and may also erase up to $30 billion in debt it owes the company. This is happening as leading members of the Bin Laden family, yes the extended family of al Qaeda founder Osama bin Laden, were detained as well. \nOne of the most stunning aspects of bin Talal's detention is how quiet his long list of influential friends have been about it. This week brought at least some mention of his plight with a statement from two former French presidents who expressed concern over Alwaleed's status. But let's face it: a few words from a couple of French ex-presidents is peanuts. \nSo now we have bin Alwaleed in an actual prison, with a government aggressively taking cash and assets, and still no significant outcry from his foreign friends. \nIt may seem unrelated, but bin Salman has also been on an opulent buying spree. That includes record-breaking purchases of art, a yacht and a French chateau. It begs the question of whether some of this stems from his desire to be the most conspicuously wealthy leader in the country. \nThis is similar to some of the tactics Russian President Vladimir Putin has used to consolidate his political power and personal wealth at the same time. \nNone of this very public behavior is drawing public rebuke from the crown prince's friends in Trump administration and elsewhere. They are clearly okay with the ends justifying whatever means he's using to modernize the country and strengthen its ability to oppose Iran. \nThe fact that the lucrative Saudi Aramco IPO is coming soon could be another reason that Alwaleed's supposed friends in the world of finance aren't making a public stink. They want to curry favor with the Saudis now to gain access. \nThis week's moves only drives that point home. Prince Alwaleed's leverage to demand an actual trial or negotiate a better deal is dwindling by the day. The cavalry is not coming and the Saudi government has almost no fear of international reprisal. \nThe chances are greater than ever that Alwaleed will now rot in a literal jail for as long as the new government wants. Earlier reports that he was being hung upside down and beaten at the Ritz Carlton are still unconfirmed, but no one should be surprised if that's the next step – if it hasn't been taken already. \nPrince Alwaleed must have thought at some point that he had the option of holding out for a fair hearing before being forced to hand over billions to save his skin. He doesn't have that option now and probably never did. \nCrown Prince Mohammed bin Salman isn't betting on seeing any pushback. Neither should anyone else. \nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-12T21:14:00.000+02:00", "crawled": "2018-01-12T21:29:34.006+02:00", "highlightTitle": ""}