{"organizations": [], "uuid": "c44ac55e2ffd6657dbc865d1fa775ed3eca91f11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220240523&w=1200&r=LYNXMPEE070M4", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/oil-opec-unrest/opec-wont-react-to-small-short-lived-oil-supply-disruptions-senior-opec-source-idINKBN1EX0XW", "country": "US", "domain_rank": 408, "title": "OPEC won't react to small, short-lived oil supply disruptions: senior OPEC source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:20:00.000+02:00", "replies_count": 0, "uuid": "c44ac55e2ffd6657dbc865d1fa775ed3eca91f11"}, "author": "", "url": "https://in.reuters.com/article/oil-opec-unrest/opec-wont-react-to-small-short-lived-oil-supply-disruptions-senior-opec-source-idINKBN1EX0XW", "ord_in_thread": 0, "title": "OPEC won't react to small, short-lived oil supply disruptions: senior OPEC source", "locations": [], "entities": {"persons": [{"name": "rania el gamal", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "non-opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - OPEC is monitoring unrest in Iran as well as Venezuela’s economic crisis, but the group will only boost output if there are significant and sustained production disruptions from those countries, a senior OPEC source from a major Middle Eastern oil producer said.\nA flag with the Organization of the Petroleum Exporting Countries (OPEC) logo is seen during a meeting of OPEC and non-OPEC producing countries in Vienna, Austria September 22, 2017. REUTERS/Leonhard Foeger/File Photo Venezuela’s economic troubles have hit the country’s oil output, which is at near 30-year lows, but Iran’s output has not been affected by a wave of anti-government protests.\nTraders said political tensions in Iran, the third-largest producer in the Organization of the Petroleum Exporting Countries (OPEC), had pushed prices higher.\nBrent crude, the international benchmark, was trading at around $67.52 a barrel, on Monday. Brent hit $68.27 high last week, the highest since May 2015, on Iran tensions.\nSaudi Arabia, OPEC’s de-facto leader, wants to see oil prices above $60 a barrel, to boost the valuation of its national oil company Aramco ahead of an initial public offering (IPO) later this year and to reduce the gap in its state budget, Saudi sources have said.\n“Even if there was a supply disruption (from Iran or Venezuela)... OPEC will not raise output,” the senior OPEC source said.\n“OPEC’s policy is to bring inventories down to their normal levels and will stay the course, unless the disruption in supply of something like 1,000,000 barrels per day persists for more than a month, and causes shortages of crude supply to consumers.”\nVenezuela’s dilapidated energy sector is struggling as U.S. sanctions and a lack of capital hobble operations, and its economic crisis threatens to do further harm to the OPEC country.\nThe senior OPEC source also said the oil market was on its way to being re-balanced, but so far global oil inventories remained above their five-year average and much more time was needed to drain the oil glut.\n“Any change in production limits must be driven by a change in market fundamentals and not just speculations for a short period of time, for OPEC to change the output ceiling,” he said.\nThe protests in Iran that began in late December have posed no immediate threat to oil production but there is concern that U.S. President Donald Trump may reimpose sanctions on Iranian oil, which could disrupt oil exports.\nTrump must decide by mid-January whether to continue waiving U.S. sanctions on Iran’s oil exports under the terms of an international nuclear deal.\nThe senior OPEC source said that while more U.S. sanctions on Iranian oil were possible, they would take time to affect oil supplies and so their impact was difficult to gauge.\nOPEC, supported by Russia and other non-members, began to reduce output a year ago to remove an oil glut built up in the previous two years. Compliance has been high, as producers have decided to extend the supply pact until the end of 2018.\nOPEC’s cuts are helping to reduce global inventories, even as production continues to rise in the United States. U.S. production rose to 9.78 million barrels in the last week.\nReporting by Rania El Gamal. Editing by Dmitry Zhdannikov and Jane Merriman\n ", "external_links": [], "published": "2018-01-08T13:20:00.000+02:00", "crawled": "2018-01-08T13:48:39.004+02:00", "highlightTitle": ""}