{"organizations": [], "uuid": "ee7f79d8c69cb430beb8afeb4b0a4baf8d7ad46c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 156}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA771_cmomon_SOC_20180117115233.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/how-one-agency-is-trying-to-ease-advertisers-concerns-about-transparency-1516273201", "country": "US", "domain_rank": 387, "title": "How One Agency Is Trying to Ease Advertisers’ Concerns About Transparency", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "ee7f79d8c69cb430beb8afeb4b0a4baf8d7ad46c"}, "author": "Alexandra Bruell", "url": "https://www.wsj.com/articles/how-one-agency-is-trying-to-ease-advertisers-concerns-about-transparency-1516273201", "ord_in_thread": 0, "title": "How One Agency Is Trying to Ease Advertisers’ Concerns About Transparency", "locations": [], "entities": {"persons": [{"name": "martin cass", "sentiment": "none"}], "locations": [], "organizations": [{"name": "assembly", "sentiment": "neutral"}, {"name": "mdca", "sentiment": "none"}, {"name": "mdc partners", "sentiment": "none"}, {"name": "association for national advertisers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Media buying agency Assembly is teaming up with advertising technology consultancy AdFin to shed light on the murky process of digital ad buying—a proclamation to its clients that it has nothing to hide.\nAssembly, which is owned by MDC Partners , MDCA -2.16% has agreed to pay for its ad-buying clients to use an AdFin product that will make it easier for them to see how much their digital ad inventory actually costs and to verify that the agency didn’t mark up the price to make extra profit.\nIn 2016, the Association for National Advertisers commissioned a report that shed light on the many ways in which buyers and technology vendors were making money through digital ad buying. The revelations fueled fear among marketers that their agencies were collecting cash rebates or charging hidden fees without their knowledge.\n“Clients are lacking trust in their agencies,” said Assembly Chief Executive Martin Cass. “I don’t want them to not trust me.”\nThe AdFin product that Assembly is paying for its clients to use is called Ad:Box. It collects and stores data that’s logged during each digital media transaction and prepares the data so that it’s consistent and ready to analyze.\nClients will need to pay extra to use other AdFin analytics tools, which can then help them get a more comprehensive view of the flow of their ad dollars from agency to publisher.\nAssembly is paying somewhere in the low six figures for Ad:Box, according to a person familiar with the matter. While its Ad:Box contract is for a year, Mr. Cass said the agreement with AdFin is open-ended.\nElectronics manufacturer Belkin, which is an Assembly client, plans to use AdFin tools not necessarily to confirm that its agency is being transparent, but to validate the quality of its digital media and determine whether it should spend more on automated digital ad buying.\n“Outside digital, in broadcast, we have a pretty good sense, within the realm of margin of error, that what you purchased did satisfy the requirements,” said Belkin Chief Marketing Officer Kieran Hannon. “Go into the digital world, and it’s an abyss.”\nBelkin knows about the “pitfalls of programmatic” from experience, Mr. Hannon said. The company at one point found that it was buying digital ads, through a large ad retargeting firm, on websites that it had blacklisted. Since it didn’t have more data around the quality and cost of the media the company buys, Belkin has restricted automated ad buying to 10% or less of the company’s total media budget, he said.\nBut that may change with more quality testing from AdFin, he said, since AdFin can quickly alert a client like Belkin if its advertising is running on a blacklisted site.\nRelated Articles\nProbe Said to Find Rebates Lurking Behind U.S. Ad Deals The Rise of Transparent Digital Ad Buying The data that AdFin’s tools store and analyze typically comes from a demand-side platform, explained AdFin Chief Executive Andrew Altersohn. Demand-side platforms, known as DSPs, help advertisers and their agencies buy online ads through an automated process to target a specific group of people. Advertisers don’t always have access to the data from the DSP on their own, due to the terms of the agreement between the advertiser and DSP.\nAdFin, whose investors include co-founder Jonathan Leitersdorf and Cantor Fitzgerald, is hoping that advertisers will push their vendors to change those terms.\n“We’ve hit an inflection point where there’s greater understanding of how the programmatic ecosystem works,” said Mr. Altersohn. “We’ve tried to help people understand when they put a dollar into the ecosystem, the data should be something they inherently get.”\nOne large advertiser, who asked not to be named, said that it was no easy task getting its DSP to agree to terms that would grant it access to data on all of its transactions. In early conversations, the DSP refused to grant that kind of access, recalled the executive. The advertiser walked away from the deal. Weeks later, the DSP came back with an agreement reflecting the client’s wishes.\nNow that the advertiser has access to the data, it’s hoping AdFin can help it analyze the costs associated with its automated ad buys and the effectiveness of those buys.\n“My hope is that I can see more transparency—what people are paying [and] for what kind of media, and obviously what kinds of margins exist. You can deduct them from the transparency of the data,” said the executive.\nThat assumes the data and fees are always accurate and complete, which they sometimes aren’t, according to Mr. Altersohn. In those cases, AdFin works with the DSP to get clarity.\n“Getting access to your data in order for you to then mine it and learn from it is not as easy as it should be,” he said. “Getting your hands on it is step one.”\nWrite to Alexandra Bruell at alexandra.bruell@wsj.com", "external_links": [], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T18:53:01.004+02:00", "highlightTitle": ""}