{"organizations": [], "uuid": "5041958c9ba05a14fa1daf83775688a7cce8904c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/health", "section_title": "Health &amp; Fitness News | Reuters.com", "url": "https://www.reuters.com/article/us-health-pregnancy-birthweight/early-pregnancy-weight-gain-linked-to-babys-size-at-birth-idUSKBN1FJ20R", "country": "US", "domain_rank": 408, "title": "Early pregnancy weight gain linked to baby’s size at birth", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.947, "site_type": "news", "published": "2018-01-30T22:43:00.000+02:00", "replies_count": 0, "uuid": "5041958c9ba05a14fa1daf83775688a7cce8904c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-health-pregnancy-birthweight/early-pregnancy-weight-gain-linked-to-babys-size-at-birth-idUSKBN1FJ20R", "ord_in_thread": 0, "title": "Early pregnancy weight gain linked to baby’s size at birth", "locations": [], "entities": {"persons": [{"name": "retnakaran", "sentiment": "none"}, {"name": "ravi retnakaran", "sentiment": "none"}], "locations": [{"name": "liuyang", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "mount sinai hospital", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:43 PM / in 7 hours Early pregnancy weight gain linked to baby’s size at birth Anne Harding 3   gain more weight in early pregnancy are more likely to deliver unusually large babies, who may be prone to a host of health problems later in life, new research shows. \nBut a mother-to-be’s weight gain after 18 weeks was not associated with whether her newborn was large for gestational age, Dr. Ravi Retnakaran of Mount Sinai Hospital in Toronto, Ontario, and colleagues found. \n“Typically in pregnancy we’re very focused on weight gain, and pregnant women have their weight measured at every appointment to see how much they are gaining,” Dr. Retnakaran noted in a telephone interview with Reuters Health. “Traditionally in the past, it’s never been clear if the timing of the weight gain matters.” \nThe timing is difficult to study, he added, because researchers typically rely on a woman’s own reporting of her pre-pregnancy weight, which may not be accurate. \nIn the new study, reported last month in JAMA Pediatrics, Dr. Retnakaran and his team enrolled 1,164 newly married women living in the Liuyang region of China, measuring their weight before they became pregnant and at intervals throughout pregnancy. Participants’ weight was recorded an average of about 20 weeks before they became pregnant. \nMothers’ pre-pregnancy weight was consistently associated with babies’ birth weight. But only weight gain from pre-pregnancy to less than 14 weeks, and from 14 to 18 weeks, was   weight. On average, for every kilogram (2.2 lbs) a woman gained during this earliest period, her infant’s birth weight rose by 13.6 grams. For weight gained from 14-18 weeks, birth weight rose by 26.1 grams for each additional kilogram of maternal weight gain. But weight gain later in pregnancy had no effect on newborn size. \nEarly in pregnancy, the authors note, the fetus grows slowly, so weight gain mainly involves the mother’s body. Excess weight gain may expose the fetus to an excess of “maternal fuels,” such as glucose and amino acids, affecting development and increasing the risk of metabolic problems. \nAttempts to reduce a woman’s risk of delivering an unusually large infant by targeting diet and physical activity haven’t worked, Dr. Retnakaran noted, and the findings suggest it’s because they’re starting too late to make a difference. “This is adding further evidence that it may be particularly important to optimize weight before pregnancy.” \nHe added, “This is one of the amazing things about optimizing maternal health during this window. You actually are potentially talking about affecting two generations.” \nSOURCE: bit.ly/2rUPC43 JAMA Pediatrics, online December 26, 2017.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://bit.ly/2rUPC43"], "published": "2018-01-30T22:43:00.000+02:00", "crawled": "2018-01-30T16:46:37.024+02:00", "highlightTitle": ""}