{"organizations": [], "uuid": "0df58bdf0e1d6212a5a6663ea7e20aa232b5c72d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/19/103800260-RTSHL0P.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/18/us-stocks-earnings-morgan-stanley.html", "country": "US", "domain_rank": 767, "title": "Dow falls 150 points, pulls back from record highs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-18T17:30:00.000+02:00", "replies_count": 0, "uuid": "0df58bdf0e1d6212a5a6663ea7e20aa232b5c72d"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/18/us-stocks-earnings-morgan-stanley.html", "ord_in_thread": 0, "title": "Dow falls 150 points, pulls back from record highs", "locations": [], "entities": {"persons": [{"name": "bruce bittles", "sentiment": "none"}, {"name": "brendan mcdermid", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "baird", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "reuters traders", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow falls 95 points as concern over government shutdown looms The S&P 500 traded 0.1 percent lower, with utilities as the worst-performing sector. Congress needs to pass a spending bill by the end of Friday to avoid a government shutdown. Historically, a government shutdown has led to a short-term pullback in the stock market. 3 Hours Ago | 03:26 \nU.S. stocks traded lower on Thursday as investors assessed the possibility of the government shutting down at the end of the week. \nThe Dow Jones industrial average fell 94 points after falling more than 150 points at its session lows. The S&P 500 traded 0.1 percent lower, with utilities as the worst-performing sector. \nCongress needs to pass a spending bill by the end of Friday to avoid a government shutdown. Historically, a government shutdown has led to a short-term pullback in the stock market. \n\"This is definitely related to the shutdown,\" said Larry McDonald, head of the U.S. macro strategies at ACG Analytics and creator of The Bear Traps Report. \"The chances of a shutdown have increased in the past few weeks, but the market's been ignoring it.\" \nThe Dow and S&P 500 posted record closes on Wednesday, shaking off a sharp intraday reversal in the previous session. The Dow closed above 26,000 for the first time, while the S&P 500 finished above 2,800 for the first time. \nBruce Bittles, chief investment strategist at Baird, said he thinks this decline is bullish for stocks. \"It shows the optimism is there, but it's not exuberant,\" he said. Brendan McDermid | Reuters Traders work on the floor of the New York Stock Exchange. \nStocks are off to a strong start this year. The Dow, S&P 500 and Nasdaq are all up at least 4.8 percent for 2018, adding to last year's strong gains. \nEquities have been boosted this year by optimism in the U.S. economy and expectations for a strong earnings season. Thus far, the earnings season is off to a good start. \nOf the S&P 500 companies that had reported as of Wednesday morning, 78 percent have surpassed earnings-per-share estimates while 89 percent have beaten expectations on the top line, according to Nick Raich, CEO of The Earnings Scout. \nMorgan Stanley and BB&T Corp. both reported better-than-expected earnings and revenue on Thursday. Their shares rose in early trading. \n\"In our view, the market has not adjusted expectations up enough to reflect the current tailwinds for economic and EPS growth, especially given the recent tax legislation,\" Tony Dwyer, chief market strategist at Canaccord Genuity, said in a note Wednesday. Dwyer was referring to the tax bill signed by President Donald Trump last month, which cuts the corporate tax rate to 21 percent from 35 percent. \nElsewhere in corporate news, Amazon announced it narrowed the list of cities for its new headquarters to 20. \nDisclosure: NBCUniversal, parent of CNBC, is a minority investor in Kensho.", "external_links": [], "published": "2018-01-18T17:30:00.000+02:00", "crawled": "2018-01-18T19:41:12.026+02:00", "highlightTitle": ""}