{"organizations": [], "uuid": "ad56fa3c75860b220a110a6638e6a4a9a2d0d40d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-lbi-media-inc-announces-agreement-to-purchase-wgen-tv-in-miami.html", "country": "US", "domain_rank": 767, "title": "LBI Media, Inc. Announces Agreement to Purchase WGEN-TV in Miami", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.757, "site_type": "news", "published": "2018-01-08T21:07:00.000+02:00", "replies_count": 0, "uuid": "ad56fa3c75860b220a110a6638e6a4a9a2d0d40d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-lbi-media-inc-announces-agreement-to-purchase-wgen-tv-in-miami.html", "ord_in_thread": 0, "title": "LBI Media, Inc. Announces Agreement to Purchase WGEN-TV in Miami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BURBANK, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- LBI Media, Inc., through its subsidiaries, announces that it has entered into a definitive agreement to purchase the assets of full power television station WGEN-TV in the Miami, Florida DMA from Maple LLC.\nWGEN will begin broadcasting programming from LBI’s Spanish language television network, EstrellaTV®, as of March 1, 2018. EstrellaTV® programming previously has been available on the digital multicast channel of an affiliate in the Miami area.\n“We are very excited about moving from an affiliate arrangement to a fully owned and operated station with complete cable and satellite distribution throughout the DMA. This will allow us to better serve Miami viewers, as well as local businesses,” commented Lenard Liberman, CEO, LBI Media, Inc. “EstrellaTV’s original, fast-paced entertainment programming is a perfect fit for the Miami audience. Television shows such as our hit series ‘Rica Famosa Latina’ and ‘Tengo Talento, Mucho Talento’ will attract a large audience in this vibrant market where viewers are tiring of traditional novella programming,” concluded Liberman.\nIn addition to the greater audience reach afforded by WGEN, LBI Media Inc. will have a full local sales staff in the market as well as facilities in the Doral area to handle local production for clients. On a national spot level, LBI Media’s in-house rep firm, helmed by industry veteran Jason Hall, will represent WGEN.\nCompletion of the transaction is subject to the satisfaction of customary closing conditions, including approval by the Federal Communications Commission (FCC). LBI Media anticipates that the transaction will close and fund with cash on hand in the second or third quarter of 2018, subject to the satisfaction of the closing conditions.\nGreg Guy of Patrick Communications served as the broker on this transaction.\nAbout LBI Media, Inc.\nLBI Media is the largest privately held, minority-owned Spanish-language broadcaster in the United States, with ten television stations and seventeen radio stations operating in top U.S. Hispanic markets. LBI Media operates the EstrellaTV Network, Don Cheto Radio Network, Fenomeno Studios MCN, Que Buena Radio and La Raza Radio. The Company produces over 50 hours of original television programming at its Burbank Television Studios each week. The EstrellaTV® programming catalog consists of over 7,500 hours of original, Spanish-language television programming in genres including talk, drama, comedy, variety, reality, music and more. To learn more about LBI Media and see company updates, please visit www.lbimedia.com .\nCONTACT:\nMarco Gonzalez\nLBI Media, Inc.\n(818) 729-5334\nmagonzalez@lbimedia.com\nSource:LBI Media, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8567a30c-335a-4614-b3c2-8759496279ba", "https://www.globenewswire.com/Tracker?data=V3fgKtMXA6Ys5x5x1VvdK2z3rgCZd5AWHjd-Cut9GWgkAMjxeKt6WACTphR2JiKzVN3csjm1-g55Qzb-0gsMfg=="], "published": "2018-01-08T21:07:00.000+02:00", "crawled": "2018-01-09T09:36:42.085+02:00", "highlightTitle": ""}