{"organizations": [], "uuid": "7863dbdabb6de706bb055362acf9292265cba8ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104962455-RTX4IOQDr.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/trump-state-of-the-union-russia-scandal-gets-bigger.html", "country": "US", "domain_rank": 767, "title": "Trump State of the Union: Russia scandal gets bigger", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.779, "site_type": "news", "published": "2018-01-30T17:26:00.000+02:00", "replies_count": 0, "uuid": "7863dbdabb6de706bb055362acf9292265cba8ac"}, "author": "Mike Calia", "url": "https://www.cnbc.com/2018/01/30/trump-state-of-the-union-russia-scandal-gets-bigger.html", "ord_in_thread": 0, "title": "Trump State of the Union: Russia scandal gets bigger", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "jonathan ernst", "sentiment": "negative"}, {"name": "andrew mccabe", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mccabe", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump state", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "fbi  first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Russia scandal grew to even bigger dimensions this week, and it could not have come at a worse time for President Donald Trump .\nFresh off a fairly well-received, if unexciting, sojourn to the globalist-friendly World Economic Forum in Davos, Switzerland, Trump is due to deliver his first State of the Union address to a joint session of Congress on Tuesday night. Yet the latest developments in the ongoing Russia investigation, at home and abroad, threaten to overshadow the president's speech.\nJonathan Ernst | Reuters President Donald Trump sits at his desk after signing directives to impose tariffs on imported washing machines and solar panels in the Oval Office at the White House in Washington, January 23, 2018. Monday brought two major developments connected to the ongoing probes into Russian meddling in the 2016 election and possible collusion between Trump's camp and the Kremlin — and in both cases, it looks like Trump got exactly what he wanted, despite the backlash they generated.\nMcCabe out at the FBI First, Andrew McCabe stepped down immediately as deputy director of the FBI , reportedly because he felt pressured by the bureau's director , Christopher Wray, to take a demotion ahead of an inspector general's report on the FBI's investigations of both major party candidates in the 2016 presidential campaign.\nTrump has frequently targeted McCabe, accusing him of political bias toward Hillary Clinton , the president's Democratic rival in the general election. McCabe's wife reportedly received hundreds of thousands of dollars in campaign donations from a group tied to Clinton ally Terry McAuliffe to help her bid for Virginia state senate in 2015.\nGetty Images Federal Bureau of Investigation Deputy Director Andrew McCabe (C) is escorted by U.S. Capitol Police before a meeting with members of the Oversight and Government Reform and Judiciary committees in the Rayburn House Office Building December 21, 2017 in Washington, DC. McCabe's abrupt departure, which happened two months before his planned retirement, came a week after reports surfaced that Wray had threatened to resign due to pressure from Trump and Attorney General Jeff Sessions to fire the deputy director . McCabe, who took over as acting FBI director after Trump fired James Comey in May until Wray was confirmed in August, is the second man who served as head of the bureau under Trump to be out of a job.\nThe president's critics, such as former Obama Attorney General Eric Holder, seized on the news as yet another instance of Trump improperly intimidating the Justice Department.\nHolder tweet\nClassified GOP memo cleared for release The other major development revolved around a classified memo that Republicans say shows bias against Trump at the FBI. The House Intelligence Committee late Monday voted along party lines to release the memo , which has been hyped on social media by Trump partisans including the president's son Donald Jr., ignoring a warning from the Justice Department that releasing the document without a security review would be \"extraordinarily reckless.\" (The panel declined to release an opposing memo drawn up by Democrats.)\nBeyond the FBI, Trump has often targeted the Justice Department, including Sessions, for its handling of the Russia probe. More recently, though, reports indicate that Trump has zeroed in on Deputy Attorney General Rod Rosenstein , who has oversight over the Russia probe since Sessions recused himself from the investigation — a decision that reportedly continues to anger Trump. Rosenstein appointed Robert Mueller as special counsel to take over the Russia probe following Comey's sacking.\nGetty Images U.S. Deputy Attorney General Rod Rosenstein testifies during a a House Judiciary Committee hearing on December 13, 2017 in Washington, DC. Now, Rosenstein reportedly factors into the flap over the GOP memo. The document is said to allege that the deputy attorney general extended a surveillance warrant on former Trump campaign advisor Carter Page, a key figure in the Russia probe, without appropriate cause.\nThe decision to release the memo drew criticism from various corners, including from some Republicans.\nWhitman tweet\nCNN reported that Trump's aides had to talk him out of firing Rosenstein. White House press secretary Sarah Huckabee Sanders, however, said the president still has confidence in Rosenstein. \"When the president no longer has confidence in someone, you'll know,\" she told reporters Monday.\nAll of these developments come on the heels of a New York Times report saying Trump tried to fire Mueller in June , soon after he became special counsel. At Davos, the president did not explicitly deny the Times story, but he used his familiar refrain of \"fake news\" to respond to questions about it.\nNo sanctions yet, but new difficulties with Russia Whether the president uses his first State of the Union address to talk about the special counsel's probe into alleged links between Trump's 2016 campaign and the Kremlin remains to be seen . There's also a question of whether Trump will use the speech to address thorny links with Russia.\nThe relationship between Russia and the U.S. became even more fraught Monday night when the Treasury Department released a report listing a number of wealthy people with close ties to Russian President Vladimir Putin and his government.\nMikhail Metzel | TASS | Getty Images Russia's President Vladimir Putin looks on during a meeting with his election representatives at Moscows Gostiny Dvor; Putin is running for re-election in the 2018 Russian presidential election scheduled for March 18, 2018. While the report does not impose sanctions on any of the oligarchs or businesses it lists, it nonetheless drew swift criticism from Putin , who called it an unfriendly act that further complicates ties between Moscow and Washington. Still, the Russian president gave an indication that he hopes his government can smooth things over with the American government.\n\"We want to establish long-term and stable relations,\" Putin said, according to Reuters.\nTrump, who routinely denies his campaign colluded with Russia, has nonetheless often echoed Putin's sentiment to strengthen the nations' ties, and his administration has demonstrated a reticence to hammer Russia with reprimands or sanctions.\nOn Monday, the White House told Congress that it would not immediately impose any new sanctions on Russia stemming from a bill designed to punish Putin's government and associates for interfering in the 2016 election. The decision not to act is likely to keep fueling suspicions among Trump's critics that the president and Putin are a little too close for comfort – particularly after CIA Director Mike Pompeo, a Trump appointee, told the BBC he expects Russian operatives to target this year's midterm elections .\nThen in international airspace over the Black Sea on Monday, a Russian fighter jet got a little to close for comfort with a U.S. Navy plane. The State Department said the pilot of a Russian SU-27 fighter was \"closing to within 5 feet and crossing directly in front of\" the U.S. EP-3 aircraft's flight path.\n\"While the U.S. aircraft was operating under international law, the Russian side was flagrantly violating existing agreements and international law,\" the State Department said.\nWATCH: Lithuanian president says Russia aggressively engaged around world show chapters Lithuanian president: Russia is engaged aggressively around the world 5:53 AM ET Fri, 26 Jan 2018 | 02:24", "external_links": [], "published": "2018-01-30T17:26:00.000+02:00", "crawled": "2018-01-30T17:32:45.066+02:00", "highlightTitle": ""}