{"organizations": [], "uuid": "94279c974d915535cba8c1fdc7042a63b6413c3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-options-tech/options-traders-see-outsized-stock-moves-on-u-s-tech-results-idUSKBN1FK2WG", "country": "US", "domain_rank": 408, "title": "Options traders see outsized stock moves on U.S. tech results", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:35:00.000+02:00", "replies_count": 0, "uuid": "94279c974d915535cba8c1fdc7042a63b6413c3d"}, "author": "", "url": "https://www.reuters.com/article/us-usa-options-tech/options-traders-see-outsized-stock-moves-on-u-s-tech-results-idUSKBN1FK2WG", "ord_in_thread": 0, "title": "Options traders see outsized stock moves on U.S. tech results", "locations": [], "entities": {"persons": [{"name": "saqib iqbal ahmed", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "at&t inc", "sentiment": "none"}, {"name": "facebook inc", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "apple inc", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "trade alert", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "microsoft corp", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 7:39 PM / Updated an hour ago Options traders see outsized stock moves on U.S. tech results Saqib Iqbal Ahmed 3 Min Read \nNEW YORK (Reuters) - Options market traders expect shares of the biggest U.S. technology companies, including Apple Inc and Facebook Inc, to react more strongly to quarterly results than they have on average over the past two years, data showed on Wednesday. \nExpectations for increased turbulence in stock trading rises ahead of earnings, but traders have bid up volatility to multi-quarter highs, New York-based options analytics firm Trade Alert data showed. \nApple, Facebook, Microsoft Corp, Google parent Alphabet Inc and AT&T Inc, which account for nearly half of the $21.2 billion Technology Select Sector SPDR Fund, are expected to post results Wednesday through Thursday. \nWall Street expects technology companies to post strong results. Analysts estimate earnings for S&P 500 technology companies rose 18.5 percent compared with a year ago and compared with a growth of 13.7 percent for the S&P 500 as a whole, according to Thomson Reuters data. \nOptions traders expect Facebook shares to swing in either direction by 5.7 percent by Friday, compared with a one-day average move of 4.6 percent over the last eight quarters, the data showed. \nOptions-implied moves for other companies including Apple, Microsoft and Alphabet, also exceed their respective average reactions to results over the past eight quarters, the data showed. (Graphic: tmsnrt.rs/2nu9zsN ) \nWhile some of the pick-up in the volatility expectations may be linked to an overall lift in the stock swings in recent days, there does appear a growing concerns about lofty valuations in the sector. \n“Despite yesterday’s pullback many are probably taking a look at the valuation of these companies as being pretty rich,” said Mary Ryan, options strategist at online broker E*Trade Financial in Chicago. \nS&P 500 Information Technology sector sports a forward four quarter price-to-earnings ratio of 19.5, compared with 18.3 for the S&P 500 as a whole, according to Thomson Reuters I/B/E/S. \nKey sector exchange traded funds, PowerShares QQQ Trust and Technology Select Sector SPDR Fund, have drawn notable defensive options activity over the last two days, pointing to demand for protection against declines. \n“Some institutional investors are hedging exposure to large cap tech names,” Trade Alert analyst Fred Ruffy said. \n“While defensive positioning is not surprising given the market’s losses over the past two days, the timing also reflects concerns about further short-term losses across large-cap tech ahead of a flood of earnings from the sector,” he said. Reporting by Saqib Iqbal Ahmed; Editing by Daniel Bases and Lisa Shumaker", "external_links": [], "published": "2018-01-31T21:35:00.000+02:00", "crawled": "2018-01-31T21:46:20.010+02:00", "highlightTitle": ""}