{"organizations": [], "uuid": "58fdbebbdd30a9a14d03c3ce2dff0700bef28c44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-bucherer-announces-acquisition-of-tourneau-llc.html", "country": "US", "domain_rank": 767, "title": "Bucherer Announces Acquisition of Tourneau LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "58fdbebbdd30a9a14d03c3ce2dff0700bef28c44"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-bucherer-announces-acquisition-of-tourneau-llc.html", "ord_in_thread": 0, "title": "Bucherer Announces Acquisition of Tourneau LLC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Addition of Leading U.S. Luxury Watch Retailer Expands Footprint into Key Global Market for Fine Watches and Jewelry\nLUCERNE, Switzerland--(BUSINESS WIRE)-- Bucherer, the leading European retailer for fine watches and jewelry, announced today that it has acquired Tourneau, the largest U.S. based luxury watch retailer from an investor group led by Green Equity Investors IV, L.P. an affiliate of Leonard Green & Partners, L.P.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180131005772/en/\nEstablished in 1900 and based in New York, NY, Tourneau is the largest luxury watch retailer in the U.S. with 28 retail locations across 10 states and a fully integrated e-commerce website. The Company is renowned for its unparalleled customer service and extensive selection of new and Certified Pre-Owned watches.\n“With over a century of expertise as the preeminent purveyor of fine watches in the U.S., Tourneau provides an exciting opportunity for the Bucherer Group to establish a footprint and extend our offering of fine watches and jewelry to the United States,” said Guido Zumbühl, CEO of the Bucherer Group. “With this acquisition, we will immediately introduce the Bucherer brand to millions of potential customers in one of the most important global watch and jewelry markets. This is also a great opportunity to firmly establish the Carl F. Bucherer brand in the US and introduce Bucherer Fine Jewellery into the North American market.”\nZumbühl continued, “As a retail brand, we stand for the rich tradition of the Swiss quest for perfection, warm hospitality and constantly inspiring customers with fascinating brands and products. We will do everything to continue to provide our local and international customers the very best shopping experience both online and in our stores and are delighted that Tourneau’s management will join our team to ensure both continuity and to help us drive the future success of Bucherer within the U.S.”\nIra Melnitsky, Chief Executive Officer of Tourneau, commented, “Bucherer is a dream partner for Tourneau. A Swiss company with 130 years of history in the industry, Bucherer understands fine watches like few others, making them the ideal partner for Tourneau. As our business continues to perform and grow, this is a natural next step for the Company. With the backing of one the world’s leading watch retailers, Tourneau’s customers, business partners and employees will benefit from Bucherer’s expertise, innovation, unmatched product selection and services. I am extremely proud to be joining the Bucherer ‘family’ and look forward to an exciting future with our team.”\nJörg G. Bucherer, owner and President of Bucherer, said, “I am very delighted to bring my family’s brand to the United States. This strengthens the leadership of our company and brings the Bucherer name to one of the most important markets in the world. We want to inspire our American customers with outstanding choice and an impeccable Swiss service culture providing the very best shopping experience.”\nKPMG acted as financial advisor and Skadden, Arps, Slate, Meagher & Flom LLP acted as legal advisor to Bucherer. Houlihan Lokey acted as financial advisor and Latham & Watkins LLP acted as legal advisor to Tourneau.\nAbout Bucherer:\nBUCHERER – A TRADITION-STEEPED SWISS FAMILY-OWNED ENTERPRISE\nIn 1888, businessman and entrepreneur Carl-Friedrich Bucherer and his wife Luise opened their first watch and jewelry store in Lucerne at placid Lake Lucerne and thereby laid the foundation for the successful family-owned enterprise. Even at that time Switzerland was a popular destination for guests from all over the world and enjoyed an outstanding reputation for its art of watchmaking. Today, Bucherer is the largest provider of watches and jewelry in Europe. Steeped in tradition, the company has been fostering the art of making watches and jewelry for decades, and is proud to be able to offer its international clientele a broad range of luxury watch brands including what is arguably the most comprehensive range of Rolex watches. Bucherer’s collaboration with Rolex began as early as the 1920s and is one of the company’s most important cornerstones to this day.\nThe Bucherer retail brand is present in 33 exclusive locations in Europe, with 16 points of sale in Switzerland, 10 stores in Germany, 1 flagship boutique in Vienna, 1 boutique in Paris (the world’s largest watch and jewelry store), 1 boutique in Copenhagen, and since 2017, 4 stores in London. The company is led in the third generation by Jörg G. Bucherer, and employs over 1,750 people. Today, the Bucherer headquarters is still located in Lucerne.\nBucherer is much more than a watch retailer today. In addition to retail stores, Bucherer sets itself apart with its Carl F. Bucherer watch manufacturing brand and a separate jewelry line under the brand name Bucherer Fine Jewellery. The rich tradition and world-class quality of each of these lines speak for themselves and the competency of the Swiss house.\nIn fine Swiss watches, the Carl F. Bucherer name has been synonymous with quality, innovation and passion since 1888. Founded in Lucerne, it has become an internationally renowned global brand characterized by its founder’s pioneering spirit and the cosmopolitan esprit of its home. Carl F. Bucherer is one of the few remaining family-owned Swiss watch manufacturers.\nTimepieces and movements are developed and produced in the brand’s own workshops in Switzerland. Milestones are the manufacturer’s own movement families, which are partly driven by an external rotor – an innovation that Carl F. Bucherer was the first to put into series production. With its exclusive watch creations, Carl F. Bucherer epitomizes high-quality Swiss craftsmanship, unmistakable style and detailed sophistication.\nAt the same time, Bucherer has established an exclusive reputation over the past 130 years for first-class jewelry offered under the brand name Bucherer Fine Jewellery. Collections are designed and produced in the company’s own ateliers, and the company’s expertise is second to none in diamonds and unique gemstones. These unique elements are the core components of the Bucherer Fine Jewellery range. For more information, please visit www.bucherer.com\nWe are gladly available at your disposal for further information.\nAbout Tourneau:\nTourneau, established in 1900, is the largest luxury watch retailer in the United States with 28 retail locations across 10 states, welcoming more than four million visitors every year. Renowned for its unparalleled customer service, extensive selection of new and Certified Pre-Owned watches as well as expert service and repair facilities, Tourneau offers more than 8,000 unique styles from over 100 world-famous brands. For more information, please visit www.tourneau.com\nAbout Leonard Green & Partners:\nLeonard Green & Partners, L.P. is a leading private equity investment firm founded in 1989. Based in Los Angeles, the firm partners with experienced management teams to invest in market-leading companies. Since inception, LGP has invested in over 85 companies in the form of traditional buyouts, going-private transactions, recapitalizations, growth equity, and selective public equity and debt positions. The firm’s primary sectors of focus are consumer/ retail, healthcare/wellness and business/consumer services.\nThe firm’s most recent fund, Green Equity Investors VII, L.P., closed in 2016 with $9.6 billion of committed capital. For more information, please visit www.leonardgreen.com .\n //www.businesswire.com/news/home/20180131005772/en/\nBucherer AG\nJörg Baumann, +41 41 369 70 00\nDirector of Marketing & Business Development\njoerg.baumann@bucherer.com\nor\nFor Tourneau\nICR\nJessica Liddell, 203-682-8200\nJessica.Liddell@icrinc.com\nor\nLeonard Green & Partners, L.P.\nErika Spitzer, 310-954-0451\nInvestor Relations\nespitzer@leonardgreen.com\nSource: Tourneau", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tourneau.com&esheet=51751525&newsitemid=20180131005772&lan=en-US&anchor=www.tourneau.com&index=2&md5=eda28c24d2b9618e6ba568222e68f6af", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.leonardgreen.com&esheet=51751525&newsitemid=20180131005772&lan=en-US&anchor=www.leonardgreen.com&index=3&md5=898db28d7f44b7ee541ea7b8823aece6", "http://www.businesswire.com/news/home/20180131005772/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bucherer.com&esheet=51751525&newsitemid=20180131005772&lan=en-US&anchor=www.bucherer.com&index=1&md5=674637786d4599c8b25b8ac912ccbeb7"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:50:55.002+02:00", "highlightTitle": ""}