{"organizations": [], "uuid": "a05ae8abc5c2a142d8644cf65c942a764d773a8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224299260&w=1200&r=LYNXMPEE0L25U", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-evans-davos-commentary/harold-evans-will-davos-man-or-woman-take-on-trumpian-nihilism-idUSKBN1FB33Y", "country": "US", "domain_rank": 408, "title": "Harold Evans: Will Davos Man – or Woman – take on Trumpian nihilism?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.541, "site_type": "news", "published": "2018-01-23T07:36:00.000+02:00", "replies_count": 0, "uuid": "a05ae8abc5c2a142d8644cf65c942a764d773a8f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-evans-davos-commentary/harold-evans-will-davos-man-or-woman-take-on-trumpian-nihilism-idUSKBN1FB33Y", "ord_in_thread": 0, "title": "Harold Evans: Will Davos Man – or Woman – take on Trumpian nihilism?", "locations": [], "entities": {"persons": [{"name": "harold evans", "sentiment": "neutral"}, {"name": "westeros frostfangs", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "westeros", "sentiment": "none"}, {"name": "swiss alps", "sentiment": "none"}], "organizations": [{"name": "hbo", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The tens of millions of fans of the HBO mythical series Game of Thrones boil with frustration. They long to know what happens next in the ancient mountain kingdoms of Westeros where kings and queens and power-mad challengers betray and murder each other with satisfying consistency. HBO is keeping fans in suspense until 2019, so I am happy to bring news of comparable real-life dramas that will assuredly start at the end of this month in peaks as snowed and menacing as the Westeros Frostfangs.\nIn the fading weeks of January, more than a thousand moguls will trek to the Swiss Alps to pit their wits and tempers in the Davos World Economic Forum against the legendary fire-breather arriving from the west, the 45th president of the United States.\nAmerica First!\nDown with elites!\nDonald Trump will be the first sitting American president to join the Davos confab since 2000. These 18 years later, he could have landed with half a halo for the revival of the American economy – more Americans at work; a booming stock market; GDP growth edging above 3 percent; wages tilting up in a broader range of industries; tax cuts inducing Apple to bring home billions of hoarded profits for investment in the United States. Being Trump, of course, he can’t resist raining on his own parade and doing it without a sense of irony.\nIn 2010 the discriminating Davos audience gave Bill Clinton a hero’s welcome for his post-presidential leadership in helping Haiti after the earthquake that killed an estimated 220,000 people – including at least 25 percent of government workers. Trump flies in on the foul winds of his condemnation of Haiti as one of the “shithole countries,” its citizens disqualified by race as unworthy of entry to the United States.\nThe Davos agenda, summarized in the WEF Program Highlights, “worries about how a fractured world can collaborate to ease humanitarian crises. It notes a “surging anti-globalization sentiment” that threatens multilateral rules, provoking “retaliatory moves along global value chains” with alarming consequences for millions of refugee families and hundreds of thousands of Rohingya Muslims forced to flee Myanmar.\nDonald Trump speaks at the Hermitage, the home of 19th-century U.S. President Andrew Jackson, in March 2017. Trump told his audience that he knew how Jackson felt about confronting 'an arrogant elite.' REUTERS/Jonathan Ernst Treasury Secretary Steve Mnuchin, accompanying Trump, wants the world to know how much the Trumpians distance themselves from Davos as a “hang out for globalists.” Perish the thought! The Davos speakers include 10 heads of state and government from Africa, nine from the Middle East, six from Latin America; CEOs, company chairs and key NGOs.\nThey are indeed diverse in their political philosophies, but Trump’s strident nationalism is more at odds with the themes in papers to be debated at Davos than at any time in its 40 years. Trump will have the last word as the closing keynoter. He has already had the fun of announcing Fake News Awards for his media critics, but has so far been weirdly silent on the digital disruption that WEF itself highlights in its agenda: “Fake News versus Real Politics: Hacking, leaking and disputing the facts, it has never been easier to distort the truth. How can democracies be protected against the implications of a digitized world?”\nOnly in the wake of the 2016 U.S. presidential election did we become aware of the sinister malefactions created by Facebook and by Twitter robot accounts. Facebook’s Mark Zuckerberg laughed off as “crazy” the fears that his site had been corrupted. The joke was on the millions of Americans hoodwinked into believing they were reading the opinions of their fellow Americans instead of the inventions of an agitprop campaign by Russian secret services so massive that fully half the U.S. voting population was exposed to divisive messages. Facebook has profited immensely from the tsunami of fake news and advertising. Will WEF bring its collective voice to demand an end to the immunities enjoyed by the digital duopolies?\nSlideshow (4 Images) Last year’s big-tent speaker, China’s President Xi Jinping, was more in the mood of Davos. He delved into his knowledge of China’s long history, not to Quote: Mao Zedong and the Cultural Revolution (1966-76) condemnation of capitalism and bourgeois values, but on a Chinese adage that would serve well as the theme song of so-called Davos Man: “Victory is ensured when people pool their strength; success is secured when people put their heads together. As long as we keep to the goal of building a community of shared future for mankind and work hand in hand to fulfill our responsibilities and overcome difficulties, we will be able to create a better world and deliver better lives for our peoples.” (As a paranoid tweeter might have written: “Obviously plotted by WEF and the cunning Chinese. Sad.”)\nChina is not a democracy; it doesn’t have a free press and human rights are tenuous, but its leadership sees a chance to build a great middle class. It supports peacekeeping; it offers the best hope to contain North Korea. A realist has to reckon that China might relapse into belligerence as its economy manages another “great leap forward” ahead of the United States in gross national product, but it would not make sense today when the business world is beating a path to its door.\nIn the presidential election, Trump was obsessed with China’s economic challenge. Why has he now so readily yielded leadership to Xi? Pulling America out the Trans-Pacific Partnership negotiated by Barack Obama gave China the opportunity fill the void for its own exporters with its own Regional Comprehensive Economic Partnership among 12 countries, excluding the United States. As the Forum program highlights: “China is playing a robust role in international affairs from economic development to the environment.” The commentary underlines Trump’s precipitate rejection of the 195-nation Paris agreement to control emissions: “According to current estimates, the Earth is expected to warm 3.2 percent - more than double the Paris targets… A major extension of the West Antarctic ice sheet has broken off and Swiss glaciers continue to recede. Is there still time to limit warming by two degrees and, if so, how do we do it?”\nThe answer is “not a chance.” Not while Trump meets science with the wisecrack that he prefers to represent the citizens of Pittsburgh over Paris, (a view not shared by Pittsburgh’s mayor), not while from time to time he still calls global warming “bullshit” and a costly hoax, not while he sticks with the reckless polluter Scott Pruitt as head of the Environmental Protection Agency, not while Emmanuel Macron is president of France, ever faithful in his embrace of the globalist rallying cry Make The Planet Great Again. (Trump will meet him privately in Davos.)\nMaybe there has been too much soft consensus at previous Davos summits, but surely this time someone will take a stand against Trumpian nihilism. If not Davos Man, the product of four decades of male consensus, this year we have Davos Woman. The WEF reports that it will take another 217 years before women earn as much as men and have equal representation in the workspace. The Forum has for the first time designated seven women co-chairs for the event, including International Monetary Fund managing director Christine Lagarde, Norwegian Prime Minister Erna Solberg and IBM’s chief executive Ginni Rometty.\nAnd for its keynote interview on the future of Europe at its annual Woman of Impact dinner, Credit Suisse has chosen Ruth Davidson, Scotland’s Conservative Party leader and a possible UK Prime Minister. Stars aplenty – and enough imposing men and women of courage to form a bodyguard for any guest like Montenegro’s Prime Minister Duško Marković, shoved aside at a NATO summit for standing between Trump and a camera.\nAbout the Author Sir Harold Evans, Reuters Editor at Large, is the author of “The American Century.”\nThe views expressed in this article are not those of Reuters News.", "external_links": [], "published": "2018-01-23T07:36:00.000+02:00", "crawled": "2018-01-23T07:20:23.094+02:00", "highlightTitle": ""}