{"organizations": [], "uuid": "bdb93f2678791ffb880906b5f0f0d50c2d0077d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/sri-lanka-stocks/sri-lankan-shares-slip-from-near-7-week-high-on-profit-taking-idUSL4N1P43OQ", "country": "US", "domain_rank": 408, "title": "Sri Lankan shares slip from near 7-week high on profit-taking", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:40:00.000+02:00", "replies_count": 0, "uuid": "bdb93f2678791ffb880906b5f0f0d50c2d0077d8"}, "author": "", "url": "https://www.reuters.com/article/sri-lanka-stocks/sri-lankan-shares-slip-from-near-7-week-high-on-profit-taking-idUSL4N1P43OQ", "ord_in_thread": 0, "title": "Sri Lankan shares slip from near 7-week high on profit-taking", "locations": [], "entities": {"persons": [{"name": "atchuthan srirangan", "sentiment": "none"}, {"name": "john keells", "sentiment": "none"}], "locations": [{"name": "colombo", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "first capital holdings plc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:42 AM / Updated 23 minutes ago Sri Lankan shares slip from near 7-week high on profit-taking Reuters Staff 2 Min Read \nCOLOMBO, Jan 9 (Reuters) - Sri Lankan shares ended lower on Tuesday, slipping from a near seven-week high hit in the previous session, as investors booked profits in blue chip stocks, while foreign traders continued buying the island nation’s risky assets. \nThe Colombo Stock Index ended 0.2 percent weaker at 6,527.14. The bourse rose 2.3 percent last week, in its second straight weekly gain. \nTurnover stood at 546.8 million rupees ($3.56 million) on Tuesday, less than last year’s daily average of 915.3 million rupees. \nForeign investors net bought shares worth 205.5 million rupees on Tuesday, extending the net foreign inflow in this year to 2.2 billion rupees. \nThey had net bought 18.5 billion rupees worth equities in 2017 and 633.5 million rupees in 2016. \n“It’s a small pullback due to some kind of profit-taking,” said Atchuthan Srirangan, senior research analyst, First Capital Holdings PLC. \n“There was selling in John Keells. Investors will wait to see whether the selling will continue or will the market absorb the pressure.” \nAnalysts expect the market to settle at 6,600 levels. \nShares in leading fixed line telephone operator Sri Lanka Telecom Plc ended 4.8 percent down, while conglomerate John Keells Holdings Plc closed 0.7 percent lower. \nTreasury bill rates fell 188 basis points to 216 basis points between March and end-December 2017, mainly driven by foreign buying in treasury bonds, resulting in declining market interest rates. \nThe country’s 2018 economic growth trajectory is likely to help boost market sentiment, analysts said. \nSri Lanka’s economic growth in 2018 is forecast at 5-5.5 percent, against an anticipated four-year low of less than 4 percent last year, central bank governor Indrajit Coomaraswamy said on Wednesday. \nThe central bank kept its benchmark interest rates unchanged in December, saying inflation and private sector credit growth have cooled to manageable levels as policy makers focus on supporting a slowing economy. $1 = 153.7000 Sri Lankan rupees Reporting by Ranga Sirilal and Shihar Aneez; Editing by Sherry Jacob-Phillips", "external_links": [], "published": "2018-01-09T13:40:00.000+02:00", "crawled": "2018-01-09T14:11:31.011+02:00", "highlightTitle": ""}