{"organizations": [], "uuid": "a77e76421d08e5338ff56062201966f1fc4155fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sale-leaseback-demand-from-pontus-remains-robust.html", "country": "US", "domain_rank": 767, "title": "Sale-Leaseback Demand from Pontus Remains Robust", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.914, "site_type": "news", "published": "2018-01-17T18:00:00.000+02:00", "replies_count": 0, "uuid": "a77e76421d08e5338ff56062201966f1fc4155fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sale-leaseback-demand-from-pontus-remains-robust.html", "ord_in_thread": 0, "title": "Sale-Leaseback Demand from Pontus Remains Robust", "locations": [], "entities": {"persons": [], "locations": [{"name": "la jolla", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "pontus capital", "sentiment": "negative"}, {"name": "michael press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LA JOLLA, Calif., Jan. 17, 2018 /PRNewswire/ -- In its 8 th year of operation, Pontus Capital has continued its growth in the single-tenant net lease sector, particularly in its core strategy: sale-leasebacks. Over the last two years, Pontus has acquired 87 properties for over $342,000,000 across 11 transactions, 82% of which were sale-leasebacks.\nPontus values strong, longstanding partnerships, as exemplified by closing six of these transactions with existing tenants. As Managing Partner, Michael Press, told Globe Street in May: \"When a company needs capital, it looks to relationships to access that capital. So, for us, most transactions are brought through off-market relationships, not through brokers or an auction process. Since it's a corporate finance transaction, our financing is being used for certainty of close, and that's where our reputation comes into play. In a strong M&A environment, you tend to see more business and more opportunities. The number of companies looking to grow or acquire has increased and, as a function, our opportunity set has increased.\" Regarding 2018, Press commented: \"Given the current economic environment and recent tax law changes, the financial benefits of our transactions to tenants, our invaluable relationships and deepening market penetration, we expect to be very active in 2018.\"\nTenants and financials sponsors have consistently selected Pontus over other financing sources due to its ability to offer more proceeds or provide a portfolio solution, willingness to customize transactions using creative and flexible structuring, and certainty of execution.\nSelect 2017 transactions, totaling approximately $86,000,000, include:\nFollow on sale-leaseback of three in-patient facilities with an existing tenant to retire maturing debt. The facilities are located in South Florida and are complimentary to the tenant's treatment center, which Pontus acquired in 2015. Follow on sale-leaseback on a portfolio of auto dealerships with an existing tenant in California, including 100% construction financing to fund an expansion and reimaging project for the tenant. Sale-leaseback of a 465,000 SF manufacturing facility with an industry-leading marketing and advertising company, owned by a highly regarded financial sponsor. The transaction was structured as a stock purchase of an existing entity that owned the real estate and proceeds from the transaction were used to recapitalize the business. The facility is located in Florida and is the sole manufacturing plant for the tenant.\nPontus Partner, Scott Stokas, commented on the industrial transaction: \"We are very pleased to complete this acquisition with a top tier private equity sponsor. Our flexibility and capability to structure a complex entity transaction, in an accelerated timeframe, contributed to a successful outcome and favorable long-term solution for the seller, and our tenant.\"\nPontus is a real estate investment firm that acquires and manages long-term triple net leased properties to creditworthy tenants nationwide in partnership with select family offices and institutional investors. As principals, they have acquired over $4 billion of net lease properties over the last twenty years, through off-market sale-leaseback and portfolio transactions. For more information visit www.pontuscapital.com or contact Scott Stokas at sstokas@pontuscapital.com .\nView original content: http://www.prnewswire.com/news-releases/sale-leaseback-demand-from-pontus-remains-robust-300583725.html\nSOURCE Pontus Capital", "external_links": ["http://www.pontuscapital.com/", "http://www.prnewswire.com/news-releases/sale-leaseback-demand-from-pontus-remains-robust-300583725.html"], "published": "2018-01-17T18:00:00.000+02:00", "crawled": "2018-01-17T19:18:22.053+02:00", "highlightTitle": ""}