{"organizations": [], "uuid": "c13daa1b9b33f00d0001938c49dfc909638fea80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-codorus-valley-bancorp-inc-reports-earnings-for-the-quarter-and-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Codorus Valley Bancorp, Inc. Reports for the and Year Ended December 31,", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:45:00.000+02:00", "replies_count": 0, "uuid": "c13daa1b9b33f00d0001938c49dfc909638fea80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-codorus-valley-bancorp-inc-reports-earnings-for-the-quarter-and-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Codorus Valley Bancorp, Inc. Reports for the and Year Ended December 31,", "locations": [], "entities": {"persons": [{"name": "larry j. miller", "sentiment": "none"}], "locations": [{"name": "york", "sentiment": "none"}, {"name": "codorus valley", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "codorus valley bancorp, inc.", "sentiment": "neutral"}, {"name": "codorus valley bancorp, inc", "sentiment": "neutral"}, {"name": "codorus valley company", "sentiment": "none"}, {"name": "corporation", "sentiment": "none"}, {"name": "peoplesbank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YORK, Pa., Jan. 18, 2018 (GLOBE NEWSWIRE) -- Codorus Valley Bancorp, Inc. (Codorus Valley, or the Corporation) (NASDAQ:CVLY), parent company of PeoplesBank, a Codorus Valley Company (PeoplesBank), today announced net income available to common shareholders (earnings) of $1.5 million or $0.17 per share basic and diluted, for the three months ended December 31, 2017, as compared to earnings of $3.8 million or $0.44 per share basic and $0.43 per share diluted, for the three months ended December 31, 2016. For the year ended December 31, 2017, the Corporation earned $12.0 million or $1.35 per share basic and $1.34 per share diluted, compared to $13.1 million or $1.49 per share basic and $1.48 per share diluted for the year ended December 31, 2016. The decrease in net income and earnings per share, for the quarter and year, was primarily the result of a $2.8 million reduction in the net deferred tax asset value due to the new corporate tax rate of 21 percent enacted as part of the Tax Cuts and Jobs Act.\nChairman, President and CEO Larry J. Miller commented, “Thanks to the outstanding efforts of our dedicated associates, the continued support of our shareholders, and the loyalty of our clients, 2017 was yet another year of strong performance for Codorus Valley Bancorp, Inc. and PeoplesBank. Excluding the impact of the reduction in net deferred tax assets, net income for the year would have been $14.8 million, which represents an increase of 13 percent year over year. Our total loans and deposits both grew 10 percent year over year, with non-interest bearing deposits growing by more than 22 percent year over year.”\nMiller added, “Looking ahead to 2018, our Board of Directors, Leadership Team, and associates will be focused diligently on carrying out our strategic initiatives and maximizing opportunities that will enhance long-term shareholder and franchise value.”\nThe Corporation’s net interest income for the three months ended December 31, 2017 was $15.6 million, an increase of $1.6 million or 11 percent when compared to the net interest income of $14.0 million for the same period in 2016. For the full year of 2017, net interest income was $59.5 million, reflecting an increase of $6.0 million or 11 percent compared to $53.6 million for 2016. The Corporation’s net interest margin was 3.84 percent for the full year 2017, a decrease from the net interest margin of 3.89 percent for the same period in 2016.\nThe provision for loan losses for the three months ended December 31, 2017 and 2016 was $600,000. For the full year of 2017, the provision for loan losses was $4.2 million compared to $3.0 million for the same period in 2016. The increased provision for 2017 was a result of an increase in net-charge-offs in the Corporation’s builder and developer portfolio and due to the substantial commercial loan growth produced for the year. The allowance for loan losses to total loans at December 31, 2017 was 1.19 percent compared to 1.18 percent as of December 31, 2016.\nNoninterest income, excluding gain on sales of investment securities, for the three months ended December 31, 2017 was $3.2 million, an increase of 21 percent compared to noninterest income of $2.6 million during the same period of 2016. For the full year of 2017, noninterest income, excluding gain on sales of investment securities, was $11.4 million, an increase of 16 percent compared to $9.8 million for the same period in 2016. The increase in noninterest income, excluding gain on sales of investment securities, was attributed primarily to increases in gains on sales of loans, service charges on deposit accounts, wealth management income, and income from bank owned life insurance. There were no gains on sales of investment securities for the fourth quarter of 2017 or 2016. Gain on sales of investment securities decreased $115,000 for the full year of 2017 in comparison to 2016.\nNoninterest expense was $11.8 million for the fourth quarter of 2017, an increase of 12 percent as compared to noninterest expense of $10.5 million for the fourth quarter of 2016. For the full year of 2017, noninterest expenses totaled $45.0 million, an increase of 8 percent compared to $41.6 million for 2016. A majority of the increase in noninterest expenses were attributable to personnel costs, charitable donations, external data processing, director and committee fees, FDIC insurance premiums, memberships and subscriptions. The primary driver of the aforementioned increase in noninterest expense was our continued investment in our associates, our community, and expansion of our business and consumer banking services in our central Maryland and Pennsylvania markets.\nIncome tax expense for the quarter and year to date periods ended December 31, 2017 were $4.9 million and $9.9 million, respectively, compared to $1.7 million and $5.9 million for the same periods in 2016, respectively. The increase in income tax expense was primarily a result of a $2.8 million reduction in the net deferred tax assets value due to the new corporate tax rate.\nAbout Codorus Valley Bancorp, Inc.\nCodorus Valley Bancorp, Inc. is the largest independent financial services holding company headquartered in York, Pennsylvania. Codorus Valley primarily operates through its financial services subsidiary, PeoplesBank, A Codorus Valley Company. In addition to a full range of business and consumer banking services, the Corporation also offers mortgage banking, wealth management, and real estate settlement services through offices located in York, Cumberland and Lancaster Counties in Pennsylvania, and in Baltimore, Harford and Carroll Counties in Maryland. Additional information can be found on PeoplesBank’s website at www.peoplesbanknet.com . Codorus Valley Bancorp, Inc.’s common stock is listed on the NASDAQ Global Market under the symbol CVLY.\nForward-looking Statements\nCodorus Valley Bancorp, Inc. has made forward-looking statements in this Press Release. These forward-looking statements are subject to risks and uncertainties. Forward-looking statements include information concerning possible or assumed future results of operations of the Corporation and its subsidiaries. When words such as “believes,” “expects,” “anticipates,” or similar expressions occur in this Press Release, the Corporation is making forward-looking statements. Note that many factors could affect the future financial results of the Corporation and its subsidiaries, both individually and collectively, and could cause those results to differ materially from those expressed in the forward-looking statements contained in this Press Release. Those factors include, but are not limited to: credit risk, changes in market interest rates, inability to achieve merger-related synergies, competition, economic downturn or recession, and government regulation and supervision. The Corporation provides greater detail regarding these as well as other factors in its 2016 Form 10-K and 2017 Form 10-Qs, including Risk Factors sections of those reports, and in its subsequent SEC filings. The Corporation undertakes no obligation to update or revise any for", "external_links": ["https://www.globenewswire.com/Tracker?data=rvt5DCi5m_TakQKT0jTIaydgpYAB7EC0JQvOnf39vk2w4QLqtS-G_3BZY8vHv8919JD-hMW8T3EFMcfknUSHXLCvGYnW4CrM3n1TMLz4juVd33cSuBIj7NQht7g1a-o1", "https://www.globenewswire.com/Tracker?data=jcS7mQq4grTeVbr4j_72HPlXQS8ltFuEbFAd1WHYuM8YQc5W4nZfCmPva48I4KPenqQWBDVI8jWMDlaBC7f9XA0i7aeOm8KacSRUoWL6tLY=", "https://www.globenewswire.com/Tracker?data=BrbIlL-NL_m4pEIxKcCf1KF0q4icoaap3N1QIf5hehMYUOXUCetNXjHxZMfEJSv1oKKriiXELaHgGs_ca9MB8zovUrMYuThWoHbOzF4xWAM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3e835ebe-0037-45fd-b544-df6c2ab73ae4"], "published": "2018-01-19T00:45:00.000+02:00", "crawled": "2018-01-19T00:21:04.001+02:00", "highlightTitle": ""}