{"organizations": [], "uuid": "5336d6855e84a439bfd1919c7a08cc285e1776b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-corbin-advisors-finds-investor-optimism-holding-strong-heading-into-4q17-earnings-season-strengthening-economic-growth.html", "country": "US", "domain_rank": 767, "title": "Corbin Advisors Finds Investor Optimism Holding Strong Heading into 4Q17 Earnings Season; Strengthening Economic Growth Predictions and U.S. Tax Law Impact Overpowering Lofty Valuation Concerns", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-11T18:08:00.000+02:00", "replies_count": 0, "uuid": "5336d6855e84a439bfd1919c7a08cc285e1776b8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-corbin-advisors-finds-investor-optimism-holding-strong-heading-into-4q17-earnings-season-strengthening-economic-growth.html", "ord_in_thread": 0, "title": "Corbin Advisors Finds Investor Optimism Holding Strong Heading into 4Q17 Earnings Season; Strengthening Economic Growth Predictions and U.S. Tax Law Impact Overpowering Lofty Valuation Concerns", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "72% of surveyed institutional investors expect sequential earnings improvement while 95% expect In Line to Better Than results versus consensus; strengthening global economies and U.S. tax reform are expected to fuel earnings in 2018 Survey expectations for EPS, cash flow and organic growth acceleration register at all-time high, while margins largely predicted to remain unchanged QoQ Positive sentiment climbs to the highest level in over four years; investors describe most upbeat management tone since September 2014 In a broad-based uptick from 3Q17, all regions are predicted to experience economic improvement, with the U.S. and Mexico trending most positively; fewer than 25% expect China’s economy to strengthen from current levels U.S. equity valuations forecasted to Remain Flat or Expand in 2018 though more significant upside potential is predicted for Europe and Asia stocks\n56% now classify U.S. equities as overvalued, up from 44% last quarter; 43% of investors report Holding, a significant increase QoQ and only 6% are Selling Over 60% consider Europe and Asia equities fairly valued, with more than 50% expecting further expansion in 2018 Only 7% of surveyed institutional investors report trading Bitcoin though 30% expect the rally to continue Financials achieve record-level optimism and Energy bulls nearly double from last quarter; Utilities and REITs continue to remain out of favor\nClick here to access the full report\nHARTFORD, Conn.--(BUSINESS WIRE)-- Corbin Advisors, a specialized investor relations (IR) advisory firm, today released its quarterly Inside The Buy-side ® Earnings Primer report, which captures trends in institutional investor sentiment. The survey is based on responses from 87 institutional investors and sell-side analysts globally, representing over $2.6 trillion in assets under management.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180111005662/en/\n(Graphic: Business Wire)\nOptimism is at all-time high levels based on historical survey data and earnings momentum is expected to continue into 2018, with the majority anticipating organic growth, cash flow and EPS improvement. Tax reform is expected to further fuel growth, helping to drive the highest level of investor sentiment in over four years.\n“I expect 2018 full-year guidance to be stronger versus 2017 in many sectors due to tax relief and repatriation driving buybacks. We are mid-to-late in the economic cycle and there is low unemployment but inflation is not a factor, yet,” commented Steven Gattuso, Portfolio Manager at Courier Capital.\nOur survey reveals that investors increasingly consider U.S. equities overvalued, 56% versus 44% last quarter, though 78% expect valuations to hold or expand further in 2018. For Europe and Asia, equities are generally seen as fairly valued and thus more compelling. While global capex and Energy are expected to see continued positive momentum over the next six months, the geopolitical environment, particularly escalating North Korea tensions and the U.S. political climate, serve as leading concerns.\n“Heading into 2017, our research identified a meaningful shift in broad-based and prevalent positive investor sentiment. Fast forward 12 months, expectations remain at record levels following strengthening financial performance across most sectors. Management tone registers as the most upbeat since September 2014 despite more investors classifying U.S. equities as overvalued but it is important to note that most investors believe we are mid-to-late in the cycle,” commented Rebecca Corbin, Founder and CEO of Corbin Advisors. “Global capex and Oil & Gas saw the largest increases in bullish sentiment and U.S. tax reform is expected to supercharge markets in general. Still, lingering concerns remain, specifically U.S. political histrionics, geopolitical volatility and further interest rate hikes,” added Ms. Corbin.\nAll regions across the globe saw an increase in bullish sentiment, with the Eurozone remaining the top pick for economic improvement over the next six months for the third consecutive quarter. The U.S. and Mexico saw the largest boost of confidence QoQ, while China is expected to bump along or worsen.\nAs for sector views, Financials saw record positive sentiment, while Energy bulls nearly doubled from 3Q17. Conversely, views on Utilities and REITs continue to deteriorate and Consumer Staples saw the largest increase in bearish sentiment.\nSince 2006, Corbin Advisors has tracked investor sentiment on a quarterly basis. Access Inside The Buy-side ® and other research on real-time investor sentiment, IR best practices and case studies at CorbinAdvisors.com .\nAbout Corbin Advisors\nCorbin Advisors is a specialized investor relations (IR) advisory firm that partners with C-suite and IR executives to drive long-term shareholder value. We bring third-party objectivity as well as deep best practice knowledge and collaborate with our clients to execute sound, effective investor communication and engagement strategies. Our comprehensive services include perception studies, investor targeting and marketing, investor presentations, investor days, specialized research, and retainer and event-driven consulting.\nInside the Buy-side ® , our industry-leading research publication, is covered by news affiliates globally and regularly featured on CNBC.\nTo learn more about us and our impact, visit CorbinAdvisors.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005662/en/\nCorbin Advisors\nBronwyn Swanson, 203-283-7997\nbronwyn.swanson@corbinadvisors.com\nSource: Corbin Advisors", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.CorbinAdvisors.com&esheet=51741834&newsitemid=20180111005662&lan=en-US&anchor=CorbinAdvisors.com&index=6&md5=5448a3b1ca4805887f8e10836565874f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.corbinadvisors.com%2F%3FcID%3D277&esheet=51741834&newsitemid=20180111005662&lan=en-US&anchor=Inside+The+Buy-side%C2%AE&index=2&md5=0fc9bfbedb9b2d24441bd5d7f6cd653f", "http://www.businesswire.com/news/home/20180111005662/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.CorbinAdvisors.com&esheet=51741834&newsitemid=20180111005662&lan=en-US&anchor=CorbinAdvisors.com&index=4&md5=3d6901da6ecb2a603c5c75c496c43e28", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.corbinadvisors.com%2F%3FcID%3D277&esheet=51741834&newsitemid=20180111005662&lan=en-US&anchor=Inside+The+Buy-side%C2%AE&index=3&md5=6b237c0dd7c2afb96ac892c151a01f63", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.corbinadvisors.com%2Fresearch%2Fquarterly-earnings-primer%2Fquarterly-earnings-primer-january-2018&esheet=51741834&lan=en-US&anchor=Click+here+to+access+the+full+report&index=1&md5=ee265fada7a2d3be6d0a6344b9fdb0b4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.corbinadvisors.com%2F%3FcID%3D277&esheet=51741834&newsitemid=20180111005662&lan=en-US&anchor=Inside+the+Buy-side%C2%AE&index=5&md5=1da0e8e3458299e4c7178755cbac4bbf"], "published": "2018-01-11T18:08:00.000+02:00", "crawled": "2018-01-11T18:52:23.000+02:00", "highlightTitle": ""}