{"organizations": [], "uuid": "664d41d13dddae44726472481e76b0d1b67a693f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/kenya-electricity/kenya-says-major-wind-power-line-70-percent-finished-to-be-complete-by-june-idUSL8N1P329N", "country": "US", "domain_rank": 408, "title": "Kenya says major wind power line 70 percent finished, to be complete by June", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-08T21:10:00.000+02:00", "replies_count": 0, "uuid": "664d41d13dddae44726472481e76b0d1b67a693f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/kenya-electricity/kenya-says-major-wind-power-line-70-percent-finished-to-be-complete-by-june-idUSL8N1P329N", "ord_in_thread": 0, "title": "Kenya says major wind power line 70 percent finished, to be complete by June", "locations": [], "entities": {"persons": [{"name": "charles keter", "sentiment": "none"}], "locations": [{"name": "nairobi", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "loiyangalani", "sentiment": "none"}, {"name": "suswa", "sentiment": "none"}, {"name": "lake turkana wind power", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "petroleum cabinet", "sentiment": "none"}, {"name": "vestas wind systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI, Jan 8 (Reuters) - A power line linking a 310 megawatt (MW) wind power plant to Kenya’s national grid, delayed by landowners’ compensation demands and the closure of a major contractor, is expected to be ready in June, the energy minister said on Monday.\nWind power provides about 25 MW of electricity in Kenya, which depends heavily on geothermal and hydro power, providing the bulk of the country’s total output of 2,341 MW.\nThe 266-mile (428-km), 400-kilovolt power line is critical for the Lake Turkana Wind Power project, to move its electricity from Loiyangalani in the north to Suswa in the centre of Kenya.\nDanish wind turbine maker Vestas Wind Systems, supplier of the wind farm’s 365 turbines, said last year the wind farm was ready for launch but would be idle until the government installs the transmission line.\nEnergy and Petroleum Cabinet Secretary Charles Keter said it was 70 percent complete, with the remaining work putting up high voltage cables.\n“Already we are having six sub contractors on the site. What we are looking for now is the contractor to finish the stringing and some of the tower erection.”\n“We have up to June of this year, otherwise from June henceforth we will have to pay deemed energy, which as you are aware, is about 1 billion shillings ($9.7 million) per month.”\nConstruction of the power line started in November 2015 and had been due to be completed by December, and the timeline had once more shifted to September.\nIn addition to delays due to compensating land owners, the project also faced setbacks after its main contractor, Spain’s Grupo Isolux Corsan, closed due to financial difficulties.\nKeter said the Kenyan government was expected to decide in the next week whether to wait for Spain to assign another contractor, or go ahead and get their own contractor.\nThe Lake Turkana consortium consists of KP&P Africa, Aldwych International, Investment Fund for Developing Countries, Finnish Fund for Industrial Cooperation, Norwegian Investment Fund for Developing Countries, Sandpiper and Vestas.\nOnce completed, Google will acquire Vestas’ 12.5 percent stake in the project.\nKeter said 50 MW of power from a solar power plant in Garissa in eastern Kenya was also expected to be connected to the gird in September. (Reporting by George Obulutsa and John Ndiso, editing by David Evans)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T21:10:00.000+02:00", "crawled": "2018-01-09T17:04:28.019+02:00", "highlightTitle": ""}