{"organizations": [], "uuid": "7e34f7689907e65b182c1ae2e1439de87fdd50e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/russia", "section_title": "Russia", "url": "https://www.reuters.com/article/us-russia-chechnya-rights/activists-sound-alarm-after-chechnya-detains-human-rights-group-head-idUSKBN1EZ15F", "country": "US", "domain_rank": 408, "title": "U.S., Europe tell Russia to free rights activist detained in Chechnya", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.144, "site_type": "news", "published": "2018-01-10T19:23:00.000+02:00", "replies_count": 0, "uuid": "7e34f7689907e65b182c1ae2e1439de87fdd50e1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-chechnya-rights/activists-sound-alarm-after-chechnya-detains-human-rights-group-head-idUSKBN1EZ15F", "ord_in_thread": 0, "title": "U.S., Europe tell Russia to free rights activist detained in Chechnya", "locations": [], "entities": {"persons": [{"name": "estemirova", "sentiment": "none"}, {"name": "oyub titiev", "sentiment": "none"}, {"name": "natalia estemirova", "sentiment": "none"}, {"name": "titiev", "sentiment": "none"}], "locations": [{"name": "chechnya moscow", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "chechnya", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - The United States and Europe called on Russia to release a human rights activist detained in Chechnya on suspicion of possessing illegal drugs after his colleagues said on Wednesday he was framed to silence his criticism.\nChechen police on Tuesday detained Oyub Titiev, who runs the office of the Memorial Human Rights Centre in Chechnya, saying they had found what looked like 180 grams (6.35 oz) of cannabis in Titiev’s car after stopping him to check his documents.\nThe illegal possession of such a quantity of cannabis is punishable in Russia by a jail term of up to 10 years and a fine. Titiev says the drugs were planted.\nTitiev, 60, leads a team that has reported disappearances, torture, and punitive house burnings in the majority-Muslim Russian internal republic. His predecessor, Natalia Estemirova, was kidnapped and shot dead in 2009. Nobody has been convicted for her murder.\nTitiev continued Estemirova’s work despite colleagues saying he received threats to desist.\nThe U.S. State Department said it was troubled by his detention, saying concerns he would be mistreated in custody were well founded.\n“This is the latest in a string of reports of alarming recent human rights violations in Chechnya,” Heather Nauert, a U.S. spokeswoman, said in a statement on Wednesday.\n“We call on Chechen authorities to immediately release Mr. Titiev and allow independent civil society to operate free from harassment and intimidation.”\nNils Muiznieks, the Council of Europe’s commissioner for human rights, also called on Russia to free Titiev, saying he had been detained “under dubious charges that lack credibility”. A spokeswoman for the German Foreign Ministry said Berlin was watching the case closely.\nU.S. SANCTIONS Critics have accused the Kremlin of turning a blind eye to rights abuses in Chechnya saying it values stability above the rule of law. Chechnya fought two wars against Russia after the 1991 Soviet collapse, but now, in return for generous subsidies and a wide degree of autonomy, pledges loyalty to Moscow.\nA Kremlin spokesman on Wednesday referred a question about Titiev’s case to the police, saying specific allegations against the activist had been made.\nKatya Sokirianskaia, director at the Conflict Analysis and Prevention Centre, told Reuters Titiev’s detention looked like an attempt to squeeze Memorial and “all remaining seeds of activism” out of Chechnya.\nShe said Chechen officials had stepped up their rhetoric against rights defenders after the United States in December sanctioned Ramzan Kadyrov, the Kremlin-backed head of Chechnya, for alleged rights abuses.\nKadyrov was removed from the Facebook and Instagram social networks as a result, platforms he used assiduously for public relations purposes.\n“The Chechen authorities directly blamed human rights defenders for this,” said Sokirianskaia.\nKadyrov, who calls himself a foot soldier of President Vladimir Putin, denies any abuses, casting his critics as being motivated by foreign grants and a desire to weaken Russia.\nTanya Lokshina, of New York-based Human Rights Watch, said framing people for drug crimes had ”become an increasingly frequent tactic used by Chechnya’s authorities“ to punish and discredit their critics.”\nAdditional reporting by David Alexander in Washington and Madeline Chambers in Berlin; Editing by Richard Balmforth\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T19:23:00.000+02:00", "crawled": "2018-01-11T03:58:16.027+02:00", "highlightTitle": ""}