{"organizations": [], "uuid": "3403686b0210f07ad802d086da9eb4282c61042e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 63, "shares": 63, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220395475&w=1200&r=LYNXMPEE0800Y", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-golf-fritsch-doping/journeyman-golfer-fritsch-banned-for-three-months-for-doping-violation-idUSKBN1EY018", "country": "US", "domain_rank": 408, "title": "Journeyman golfer Fritsch banned for three months for doping violation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T02:29:00.000+02:00", "replies_count": 0, "uuid": "3403686b0210f07ad802d086da9eb4282c61042e"}, "author": "", "url": "https://www.reuters.com/article/us-golf-fritsch-doping/journeyman-golfer-fritsch-banned-for-three-months-for-doping-violation-idUSKBN1EY018", "ord_in_thread": 0, "title": "Journeyman golfer Fritsch banned for three months for doping violation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Canadian golfer Brad Fritsch has been banned for three months after he reported himself to PGA Tour officials for violating its anti-doping policy, the governing body said on Monday.\nThe 40-year-old, who plays on the secondary Buy.com Tour and is eligible to return to competition on Feb. 28, said the banned substance was in a supplement he had been taking to assist weight loss.\n“Mr. Fritsch self-reported this information after discovering that an ingredient in a supplement that he was taking was on the prohibited list,” the Tour said in a statement.\n“He has acknowledged his inadvertent error and accepted his suspension.”\nFritsch, in a Facebook posting, said his heart had “sank” when he realized that one of the supplements he was taking included dehydroepiandrosterone (DHEA).\n“That ... supplement ended up containing a substance called DHEA,” he wrote.\n“I‘m just so upset with myself that I didn’t think to question what was in the supplements. But I never did. And in the program rules, it stipulates that a self-report is the same as a positive test.”\nFritsch has won once on the Buy.com Tour.\nDHEA is a hormone produced by the adrenal glands and its production peaks when someone is in their mid-20s, according to the webmd.com website. In most people, production gradually declines with age.\nFritsch joins a small list of players suspended since the PGA Tour began drug testing in 2008.\nWith the exception of former world number on Vijay Singh, most have been little-known journeymen.\nSingh was suspended for 90 days in 2013 after saying in a magazine interview that he was using deer antler spray.\nThe tour banned Singh for using the spray, which contained an insulin-like growth factor on its banned list.\nThe suspension was lifted after the World Anti-Doping Agency (WADA) concluded that the spray should be removed from its list of banned substances.\nReporting by Andrew Both in Cary, North Carolina, editing by Pritha Sarkar\n ", "external_links": [], "published": "2018-01-09T02:29:00.000+02:00", "crawled": "2018-01-09T09:57:34.004+02:00", "highlightTitle": ""}