{"organizations": [], "uuid": "230f6cbfbde89e6686426896833fefbb2f283006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220484273&w=1200&r=LYNXMPEE080GP", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/us-europe-view-tuesday/daily-briefing-reshuffle-looks-like-a-misdeal-idUKKBN1EY0RM", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Reshuffle looks like a misdeal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:45:00.000+02:00", "replies_count": 0, "uuid": "230f6cbfbde89e6686426896833fefbb2f283006"}, "author": "", "url": "https://uk.reuters.com/article/us-europe-view-tuesday/daily-briefing-reshuffle-looks-like-a-misdeal-idUKKBN1EY0RM", "ord_in_thread": 0, "title": "Daily Briefing: Reshuffle looks like a misdeal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:45 AM / Updated an hour ago Daily Briefing: Reshuffle looks like a misdeal Reuters Staff 7 Min Read \n\"Night of the Blunt Stilettos\"; \"No, Minister\" - such are today's headlines in even pro-government media after British PM Theresa May's cabinet reshuffle went pear-shaped , with one minister quitting rather than be reshuffled and another simply refusing to budge. Britain's Prime Minister Theresa May poses with Brandon Lewis and James Cleverly and other members of their teams outside 10 Downing Street, London, January 8, 2018. REUTERS/Simon Dawson \nAnother of her ministers was erroneously announced as the new head of her ruling Conservative Party by a stray official Tweet . All this, you will recall, was intended to draw a line under last year's speculation about May's premiership and reassert her authority over government; instead the commentary about weak and accident-prone leadership has only intensified. \nTo cap it all, it has emerged this morning that a high-profile appointment to a top academic authority has resigned after a barrage of criticism over a series of misogynistic tweets - despite May only on Sunday saying he could remain if he desisted from further such tweets. \nPoland’s new prime minister, Mateusz Morawiecki, will be hoping his own reshuffle scheduled for today goes somewhat more smoothly. The long-expected shake-up will probably involve naming a new finance, foreign, environment and health minister, sources close to the ruling Law and Justice (PiS) party have suggested. \nMorawiecki is keen to improve relations with Brussels amid a stand-off over PiS’s revamping of the judiciary that will bring appointments of judges under more political control. For now, the only reason it is not facing EU sanctions over a move deemed undemocratic is that ally Hungary has said it will use its veto to block any punitive action. After the swearing-in of his new cabinet, Morawiecki heads to Brussels for talks with EU officials. \nGerman engineering trade union IG Metall's efforts to mobilise striking workers for a 6 percent wage hike claim are being closely watched ahead of a round of negotiations later this week. On Monday, more than 3,000 employees downed tools at Porsche in Stuttgart, taking the number of industrial workers who have taken action since the start of last week to more than 15,000. This is still a long way from creating a dent in the booming German economy: data this morning showed that industrial production rose by the most in more than eight years in November and the trade surplus widened as exports surged. \nGLOBAL MARKETS \nThe big picture for world markets remains the same, even if the breakneck opening to the year has slowed a touch as the U.S. Q4 earnings season is about to kick off. \nMSCI’s all-country world stocks index has eked out another record high , as did the S&P 500 on Wall St overnight. But there were more interesting moves under the bonnet in Asia trading. Shanghai, Hong Kong and Tokyo all advanced, but Seoul’s Kospi index was in the red after tech giant Samsung’s forward guidance underwhelmed markets, despite estimating a record fourth quarter, and its stock lost more than 3 percent. \nJapan's Nikkei 225 held on to its gains, meantime, despite a peculiar jump in the yen after what many saw as just a technical cut in the Bank of Japan’s routine bond purchases . Dollar/yen slipped as low as 112.49 at one point,having lost its perch above $113, before steadying. \nOverall, the dollar was steady to firmer, with euro/dollar down for the third day despite a series of economic numbers showing the German economy in rude health and offsetting any nerves around the unexpected decline in industrial orders seen on Monday. German industrial production beat forecasts and rose at its fastest pace in almost eight years in November, while exports, imports and the country’s trade surplus all exceeded expectations during the month, too. \nHowever, the euro has been backtracking in part because of evidence of extreme bullish positioning in the single currency at the back end of last year, with net euro longs recorded in the futures market the highest on record in the week to Jan 2. \nSterling was a touch weaker against the dollar and euro amid some fretting about the state of the UK retail sector. The British Retail Consortium said the country’s retailers reported that non-food spending fell the most since 2009 during the last quarter of 2017. \nHigh street names such as Mothercare and McBride suffered sharp falls in the previous session after poor trading updates. On the other hand, grocer Morrisons beat forecasts for its Christmas trading period and a upgrade to builder Persimmon ’s profit outlook cheered the mood on Tuesday. The pound is relatively stable, with implied volatility in its exchange rate at its lowest levels since 2014 despite the Brexit uncertainties and underperforming economy. Editing by Larry King", "external_links": [], "published": "2018-01-09T10:45:00.000+02:00", "crawled": "2018-01-09T11:44:19.018+02:00", "highlightTitle": ""}