{"organizations": [], "uuid": "169e0eea3a78036470b5d0c25959dafe5f6cd5fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-top-loan-originator-drew-stacey-joins-guaranteed-rateas-cincinnati-office.html", "country": "US", "domain_rank": 767, "title": "Top Loan Originator Drew Stacey Joins Guaranteed Rate’s Cincinnati Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.494, "site_type": "news", "published": "2018-01-09T19:00:00.000+02:00", "replies_count": 0, "uuid": "169e0eea3a78036470b5d0c25959dafe5f6cd5fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-top-loan-originator-drew-stacey-joins-guaranteed-rateas-cincinnati-office.html", "ord_in_thread": 0, "title": "Top Loan Originator Drew Stacey Joins Guaranteed Rate’s Cincinnati Office", "locations": [], "entities": {"persons": [{"name": "drew stacey", "sentiment": "negative"}, {"name": "stacey", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}], "organizations": [{"name": "top loan originator drew stacey joins guaranteed rate", "sentiment": "negative"}, {"name": "cincinnati office chicago", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chicago and Cincinnati, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Drew Stacey, a top loan originator who has consistently appeared on mortgage lending top producers lists, has joined Guaranteed Rate as Vice President, Mortgage Lending. Stacey, a 10-year industry veteran, has originated approximately $800 million throughout his career, including $107 million in 2016, $80 million in 2015 and around $65 million in 2014. From September through December alone, Guaranteed Rate has welcomed 142 loan originators, increasing production by nearly $2 billion.\nDrew Stacey, Vice President, Mortgage Lending\n“The number one reason I came to Guaranteed Rate is to double my production -- I wouldn’t have thought that was possible until I saw the systems in place at the company,” says Stacey. “There are hundreds of examples of loan officers here who have achieved that goal; it’s not an anomaly.”\nFollowing is additional insight into why he made the move to Guaranteed Rate:\nTo tap into the innovative vibe:\n“Guaranteed Rate has so much young energy, fresh ideas and a better way of doing things. Other mortgage companies are stuck in the past and resistant to change, whether that’s embracing social media or integrating innovative technologies. The systems in place at Guaranteed Rate to regulate my pipeline are more advanced than anything I’ve ever seen anywhere. It’s so easy for me to advertise and market, and that’s awesome.”\nBetter staffing and support:\n“When you look at the POD business model, there aren’t as many companies as you’d think that are implementing a system like that. Other companies lead you to believe that you can only have two assistants, as that’s all the profitability will allow. Coming to Guaranteed Rate has opened my mind to see that’s not the case. There is so much more opportunity here for my production to grow. You just can’t do that unless you’re adequately staffed.”\nTo concentrate on sales rather than administrative work:\n“I’m a member of my team who happens to be the best salesperson. Previously, I felt like I was the highest paid loan processor in the United States. I’ve got a team now that enables me to do my job as best as I can in the same way that members of my POD do what they’re best at doing. Everyone is in a situation where they can succeed in a highly efficient and effective manner.”\nBetter work/life balance:\n“I’m simply able to do more, including having more free time. There are so many people in place to support you and help you grow your business – it saves me time and money. I’m able to divvy out important tasks to people who can get them accomplished.”\nBest-in-class marketing and events team:\n“I absolutely plan on taking advantage of Guaranteed Rate’s marketing and event team expertise. I didn’t have most of these opportunities before. Now, they’re right there at my fingertips. It used to take me six or seven weeks to get something approved—when I’m trying to do hundreds of loans per year, that’s not worth my time. Guaranteed Rate makes it effortless to build your brand and own your market.”\nDivisional Sales Manager Denis St. Marie, who oversees the states of Kentucky, Ohio, Pennsylvania, Virginia and West Virginia, says Stacey will be an incredible asset to the Guaranteed Rate team and is confident Stacey will be able to meet his goal of doubling his production. “We’ve done a tremendous job bringing in loan officers who double or even triple their business,” says St. Marie. “Drew is already a top producer and now the sky is the limit; I can’t wait to watch him thrive at Guaranteed Rate with our additional resources and staffing support.”\nAbout Guaranteed Rate\nGuaranteed Rate is one of the largest retail mortgage lenders in the United States. Headquartered in Chicago, the company has approximately 195 offices across the U.S. and Washington, D.C., and is licensed in all 50 states. Since its founding in 2000, Guaranteed Rate has helped hundreds of thousands of homeowners with home purchase loans and refinances and funded nearly $23 billion in loans in 2016 alone. The company has become the Home Purchase Experts® by introducing the world's first Digital Mortgage technology and offering low rate, low fee mortgages through an easy-to-understand process and unparalleled customer service. Guaranteed Rate won an American Business Award for its Digital Mortgage technology in 2016, ranked No. 1 in Scotsman Guide's Top Mortgage Lenders 2016, was chosen as Top Lender 2016 and 2017 by Chicago Agent magazine and made the Chicago Tribune's Top Workplaces list seven of the past eight years. Visit rate.com for more information.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/e4b0eb83-2c14-48d8-ad8f-fe1336bbf328\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/17a7e99b-7751-4ff9-b867-c7530560d8bd\nLinda Marsicano Guaranteed Rate 773-354-2004 linda.marsicano@rate.com\nSource: Guaranteed Rate", "external_links": ["https://www.globenewswire.com/Tracker?data=3RJGcNnjmxKp5A5cUR9U0udrmpay86pva2zv4XwjB68xwcvSKSZS6GXG0OqIFP0NbTtElDSwqRLiacpbDbXzGAsY18N3EzSw9bPON01IXRYI-EHGKA8daT895tdStEBTsyH2_uUDnzMYkYfHoZVGGdijvC5rR_5AYrmvhaPdnLRmyWy-jqx5BjRklS22LeRyEVVLwQjDIo8FqnrRAn0XLnSG9YK8g4aMH3YmumJE-4PMswU6AI8-2uR4-gYGWhz1bf7qz8bf3GKszErS36Xf1Q==", "https://www.globenewswire.com/Tracker?data=3RJGcNnjmxKp5A5cUR9U0udrmpay86pva2zv4XwjB68xwcvSKSZS6GXG0OqIFP0NOUrbXWRFIhBGzx30sphNHE5_-F-pCWufxYtSAFqhU0qQr7s3q6Q_pSbL_gYmylM2S4ItUYYRjeyX0tL8XY2nSs3qVsmj3XDh9F-p_wb2cryfOXr6GjXeYW1nI3kXWGKLcqk494BYrpFRkBQcSWTt_fWR8Af8wcIeebz2QIrS0KC4scN1-VBHFWYHLip5Dw9b_ods_1QU_pkkR0KszAXjQQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e4b0eb83-2c14-48d8-ad8f-fe1336bbf328/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/17a7e99b-7751-4ff9-b867-c7530560d8bd/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/17a7e99b-7751-4ff9-b867-c7530560d8bd", "http://www.globenewswire.com/NewsRoom/AttachmentNg/e4b0eb83-2c14-48d8-ad8f-fe1336bbf328"], "published": "2018-01-09T19:00:00.000+02:00", "crawled": "2018-01-09T21:30:34.002+02:00", "highlightTitle": ""}