{"organizations": [], "uuid": "b66b04c2d46ace4ab759d8a7420019c7432c06a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarian-bonds-firmer-awaiting-cbank-irs-stimulus-idUSL8N1PD247", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Hungarian bonds firmer, awaiting cbank IRS stimulus", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:13:00.000+02:00", "replies_count": 0, "uuid": "b66b04c2d46ace4ab759d8a7420019c7432c06a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarian-bonds-firmer-awaiting-cbank-irs-stimulus-idUSL8N1PD247", "ord_in_thread": 0, "title": "CEE MARKETS-Hungarian bonds firmer, awaiting cbank IRS stimulus", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}], "organizations": [{"name": "irs", "sentiment": "negative"}, {"name": "national bank of hungary", "sentiment": "none"}, {"name": "nbh", "sentiment": "none"}, {"name": "mirs", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Hungarian central bank launches IRS tool to push down yields * Hungarian bond auction yields may fall despite global rise * Polish, Czech stock indices touch multi-year highs By Sandor Peto BUDAPEST, Jan 18 (Reuters) - Hungarian government bond yields eased mildly, bucking a global rise, ahead of the National Bank of Hungary's (NBH) first interest rate swap (MIRS) auctions to push long-term interest rates lower. The NBH, on of the most dovish central banks in the world, has also launched a mortgage-bond buying programme. Its policy to extend stimulus stands in contrast with monetary tightening in fellow Central European states, the Czech Republic and Romania which have followed the Federal Reserve's interest rate hikes due to concerns over a rise in inflation. Inflation in Hungary, and Poland has remained well within their targets. The NBH's 5- and 10-year swap auction will follow the government's bi-weekly bond auctions, and if it sells over 100 billion forints ($396.23 million) at a wide spread below the market, interest rate swaps (IRS) and long-term debt yields can fall in the market. \"You can feel, that the bond auctions will be good,\" one Budapest-based fixed income trader said. IRSs traded at 0.8 percent for 5 years and 1.5 percent for 10 years early in the session, unchanged from Wednesday, while bond yields for the same expiries were a tad lower, at 0.99 percent and 1.95 percent, respectively, traders said. Hungarian yields are around record lows along the curve. If the 10-year yield closes a less than 20 basis points spread over the corresponding Czech bond, Hungary will have the lowest yield curve among Central European countries which have not introduced the euro. Another trader said Thursday may not be the session when Hungarian long-term yields could fall further significantly as the global sentiment did not support such a move. Euro zone yields headed back towards recent multi-year highs on Thursday due to a sell-off in U.S. Treasuries and new supply from France, Spain and Austria. Polish and Czech yields also rose mildly. European stocks markets were mixed despite a rise in Asian stocks after a rally in Wall Street, and Warsaw's and Prague's stock indices quickly gave up ground after hitting multi-year highs in early trade. In regional currency markets, the forint firmed 0.1 percent to 308.3 against the euro by 0932 GMT, before the government's bond auction, approaching 3-month highs. The leu traded slightly stronger, after Romania's ruling Social Democrat party and its ardent critic, the country's president agreed that Viorica Dancila will be the next Romanian prime minister. The deal averts the risk of a long-drawn political crisis. CEE SNAPSHOT AT MARKETS 1032 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.3950 25.3930 -0.01% +0.58% crown > Hungary <EURHUF= 308.3000 308.6200 +0.10% +0.85% forint > Polish <EURPLN= 4.1642 4.1690 +0.12% +0.29% zloty > Romanian <EURRON= 4.6485 4.6500 +0.03% +0.67% leu > Croatian <EURHRK= 7.4330 7.4275 -0.07% -0.04% kuna > Serbian <EURRSD= 118.4200 118.4000 -0.02% +0.07% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1112.97 1115.630 -0.24% +3.23% 0 Budapest 39680.24 39543.26 +0.35% +0.77% Warsaw 2600.77 2600.37 +0.02% +5.67% Bucharest 8366.33 8316.59 +0.60% +7.90% Ljubljana <.SBITOP 827.70 829.48 -0.21% +2.64% > Zagreb 1878.19 1876.37 +0.10% +1.92% Belgrade <.BELEX1 768.92 770.84 -0.25% +1.20% 5> Sofia 709.70 709.86 -0.02% +4.76% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.7010 0.0920 +127bps +9bps R> 5-year <CZ5YT=R 1.0410 0.0020 +117bps +0bps R> 10-year <CZ10YT= 1.8150 0.0470 +123bps +3bps RR> Poland 2-year <PL2YT=R 1.5990 0.0010 +217bps -1bps R> 5-year <PL5YT=R 2.6330 0.0170 +276bps +1bps R> 10-year <PL10YT= 3.3050 0.0150 +272bps -1bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.04 1.24 1.38 0.77 <PRIBOR= > Hungary 0.09 0.14 0.21 0.02 Poland 1.75 1.78 1.85 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-18T18:13:00.000+02:00", "crawled": "2018-01-18T12:25:28.031+02:00", "highlightTitle": ""}