{"organizations": [], "uuid": "1f36755c38759879e5d2babe8a765b838c10c9ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/trump-white-house.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/donald-trump-shithole-countries-comment-haiti-dick-durbin/", "country": "US", "domain_rank": 1196, "title": "Commentary: I Live in a ‘Shithole’ Country. It’s the U.S. | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.259, "site_type": "news", "published": "2018-01-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "1f36755c38759879e5d2babe8a765b838c10c9ce"}, "author": "Josh Hoxie", "url": "http://fortune.com/2018/01/12/donald-trump-shithole-countries-comment-haiti-dick-durbin/", "ord_in_thread": 0, "title": "Commentary: I Live in a ‘Shithole’ Country. It’s the U.S. | Fortune", "locations": [], "entities": {"persons": [{"name": "josh hoxie", "sentiment": "negative"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Josh Hoxie January 12, 2018 \nIt takes a level of pomposity inconceivable to most of us to describe another country as a “shithole.” \nIt’s unfortunately just one more of the obnoxious, racist, and altogether absurd statements we’ve come to expect from President Donald Trump. If the president were to venture beyond the manicured lawns of Mar-a-Lago or the White House, he might see that the U.S. is not exactly in a position to judge, much less denigrate, our global neighbors. \nIn case you missed it, here’s what Trump reportedly said: “Why are we having all these people from shithole countries come here?” He was referencing Haiti, El Salvador, Honduras, and apparently most of Africa. He went on to ask why more people from Norway (a nearly all white country) weren’t coming to the U.S. \nThe story was first reported by the Washington Post . It’s been confirmed by Sen. Dick Durbin (D-IL), who heard the words firsthand. \nTrump and his defenders completely ignore the direct and disgraceful role America has played in making life worse in the countries he cited. Among many other things, we’ve backed right-wing death squads in El Salvador , supported cruel dictators in Haiti , and trapped poor countries the world over in debt through International Monetary Fund (IMF) loans with tight strings attached . \nI’ll leave it to foreign relations scholars to parse the rest. What I’m concerned about is Trump’s complete lack of concern over the “shit-holiness” of the country he leads. \nGandhi taught us that a country’s greatness is measured not by its richest, but by how it treats its most vulnerable members. By this measure, the U.S. is a certified shithole. \nThe U.S. is the wealthiest country on earth. Yet one in five children here will go to bed hungry tonight. Thirteen million American children live in poverty, the highest rate among the world’s wealthy countries. \nOne shining light for poor American kids is that almost all of them have health insurance, thanks to the Children’s Health Insurance Program (CHIP) put in place in 1997. That light is rather dim right now, however, as Congress waffles on funding the program, leaving millions of children’s lives in the balance. \nThe United Nations Special Rapporteur on extreme poverty, Philip Alston, conducted a two-week tour of the U.S. in late 2017. He found some of the most extreme inequality anywhere in the world. \n“The United States is one of the world’s richest and most powerful and technologically innovative countries,” Alston wrote in an op-ed for The Guardian , “but neither its wealth nor its power nor its technology is being harnessed to address the situation in which 40 million people continue to live in poverty.” \nAmerica also has the highest rate of incarceration in the world , the highest infant mortality rate among developed countries, and is the only industrialized country not to guarantee health care as a basic human right. The list goes on, but you get the point. \nAs Alston put it, “Americans can expect to live shorter and sicker lives, compared to people living in any other rich democracy.” \nThis is not to say that many, many Americans aren’t living happy, healthy, wealthy lives. They are. And some kids born into poverty will someday work their way to financial security. But the proportion of those actually succeed is steadily shrinking . \nStill, this is a country where disoriented hospital patients can be dumped on the street in freezing cold weather, wearing only their thin hospital gowns—as a viral video recently captured happening to a woman in Baltimore. \nFortunately, far from the halls of 1600 Pennsylvania Avenue, dedicated activists and organizers are working tirelessly to make the U.S. a better place. Social movements like the Women’s March, Black Lives Matter, Indivisible, #MeToo, and a new Poor People’s Campaign are leading the nation in this direction. \nLeaders, some whose names we’ll never know, are doing the tireless work to right the wrongs and correct deep-rooted injustices. They know that despite Trump’s slogan, this country has never really been “great” for everyone. They’re the ones working to clean this shithole up. \nJosh Hoxie is director of the Project on Opportunity and Taxation at the Institute for Policy Studies and co-editor of Inequality.org. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T02:00:00.000+02:00", "crawled": "2018-01-15T12:17:33.000+02:00", "highlightTitle": ""}