{"organizations": [], "uuid": "9ed2229067738e682884146f41f2fe485f51cb0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-another-strong-year-for-pe-and-ma-megadeals-energy-and-retail-dominated-restructuring-while-bankruptcy-spread-across-sectors.html", "country": "US", "domain_rank": 767, "title": "Another Strong Year for PE and M&A Megadeals, Energy and Retail Dominated Restructuring While Bankruptcy Spread Across Sectors and a Big Quarter for PIPEs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "9ed2229067738e682884146f41f2fe485f51cb0e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-another-strong-year-for-pe-and-ma-megadeals-energy-and-retail-dominated-restructuring-while-bankruptcy-spread-across-sectors.html", "ord_in_thread": 0, "title": "Another Strong Year for PE and M&A Megadeals, Energy and Retail Dominated Restructuring While Bankruptcy Spread Across Sectors and a Big Quarter for PIPEs", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "thestreet, inc.", "sentiment": "neutral"}, {"name": "energy", "sentiment": "neutral"}, {"name": "centerview", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, The Deal , a business unit of TheStreet, Inc. (NASDAQ: TST), today released its exclusive League Table rankings, revealing the top global advisers involved in mergers and acquisitions, bankruptcy, out-of-court restructuring, private equity and PIPEs deals between January 1 and December 31, 2017.\nTwo December megadeals capped M&A activity in the fourth quarter , which also featured three large unsolicited offers and several multi-billion dollar deals in which private equity firms cashed out of investments. Deal volume was steady but not frenetic and spread across a range of sectors. Goldman Sachs landed roles on five of the largest M&A situations of the 4 th quarter; Centerview is on four.\nRankings include the names of lead M&A and/or corporate partners at law firms that represented principals and investment advisers. Only deals involving a change of control at a target company with a market value of $100 million or more are included, and only when a key party involved is a U.S. company. Unless the target is a recognized stand-alone operating business, rankings will not include asset sales, unit sales, sales of subsidiaries, spin-offs or joint ventures.\n2017 saw robust private equity activity even as valuations stayed high and competition for quality assets remained intense. This year's largest deal was the agreement by the Bain Capital-led consortium in September to buy Toshiba Corp's chip unit in a transaction valued at 2 trillion yen ($17.7 billion), according to Dealogic.\nThe Deal's Private Equity League Tables include global deals involving PE firms, either on the buy side or sell side, regardless of whether financial terms were disclosed. Deal types range from leveraged buyouts, add-on acquisitions, management-backed buyouts and any deal where a PE firm had a stake in the target, buyer or seller. Transactions where the investment implied at least a 30% stake in the target are also included, as are minority investments where PE executives joined target boards.\nPredictions in the fall that the energy and healthcare industries would be most active for out-of-court restructurings in the fourth quarter were only about half correct. Restructuring attorneys and advisers correctly predicted that oil, gas and coal related companies would be among the most active in the fourth quarter, but they missed on the healthcare industry. The list of energy company out-of-court restructurings seemed to grow with each month. Among the most significant restructurings were coal producer Armstrong Energy Inc., Anton Oilfield Services Group and EP Energy Corp.\nThe Deal's Out-of-Court Restructuring league tables include advisors to distressed companies experiencing financial restructuring ongoing or completed during the period under review. There are neither geographic nor company value size restrictions for the distressed company.\nBankruptcy filings during the last three years have been dominated by one of two industries. In 2017, it was retail, while the prior two years saw a slew of oil and gas companies march into Chapter 11. With the expectation that interest rates will be rising, albeit slowly, indicators point to another active year ahead in restructuring across industry sectors.\nThe Deal's Bankruptcy League Tables are comprised of advisory assignments on business petitions with liabilities of at least $25 million, filed in U.S. courts, between January 1 and December 31, 2017.\nThe final quarter of 2017 was one of the most active ever for the private-investment-in-public-equity market , coming at the end of year when PIPE offerings raised more than $76 billion. The quarter saw more individual deals than almost any quarter since 2007, when the buildup to the global financial crisis drove deal flow the likes of which has seldom been seen. In terms of dollars raised – more than $20 billion – the fourth quarter was one of the few since the GFC to exceed that number.\nThe PIPEs League Tables are based on proprietary information from PrivateRaise, a service of The Deal. Data includes PIPEs (equity private placements and registered direct offerings) that are at least $1 million and have been completed or entered into by public corporations domiciled in the U.S. or by public, foreign companies that have primary listing or a significant or consistent trading presence on a U.S. stock exchange or market.\nRankings and analysis are available online . To learn more about The Deal's League Tables, contact Jonathan McReynolds at jmcreynolds@thedeal.com .\nAbout The Deal\nThe Deal ( www.thedeal.com ) provides actionable, intraday coverage of mergers, acquisitions and all other changes in corporate control to institutional investors, private equity, hedge funds and the firms that serve them. The Deal is a business unit of TheStreet, Inc. (NASDAQ: TST, www.t.st ), a leading financial news and information provider. Other business units include TheStreet ( www.thestreet.com) , an unbiased source of business news and market analysis for investors; BoardEx ( www.boardex.com ), a relationship mapping service of corporate directors and officers; and RateWatch ( www.rate-watch.com ), which supplies rate and fee data from banks and credit unions across the U.S.\nContact: Terri Smith, 212-321-5572, Terri.Smith at thestreet.com\n with multimedia: releases/another-strong-year-for-pe-and-ma-megadeals-energy-and-retail-dominated-restructuring-while-bankruptcy-spread-across-sectors-and-a-big-quarter-for-pipes-300577113.html\nSOURCE TheStreet, Inc.", "external_links": ["http://www.t.st/", "http://www.thedeal.com/", "http://www.rate-watch.com/", "http://www.boardex.com/", "http://www.thedeal.com/league-tables/overview/", "http://www.prnewswire.com/news-releases/another-strong-year-for-pe-and-ma-megadeals-energy-and-retail-dominated-restructuring-while-bankruptcy-spread-across-sectors-and-a-big-quarter-for-pipes-300577113.html"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:45:14.011+02:00", "highlightTitle": ""}