{"organizations": [], "uuid": "e75bb9062395a26dd0427f428b7f73c9a9e2a1e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219021606&w=1200&r=LYNXMPEE020HB", "site_section": "http://feeds.reuters.com/reuters/INhollywood\r", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-israel-palestinians-teen-singapore/singapore-bans-film-focused-on-indicted-palestinian-teen-activist-idINKBN1ES0P8", "country": "US", "domain_rank": 408, "title": "Singapore bans film focused on indicted Palestinian teen activist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:52:00.000+02:00", "replies_count": 0, "uuid": "e75bb9062395a26dd0427f428b7f73c9a9e2a1e1"}, "author": "", "url": "https://in.reuters.com/article/us-israel-palestinians-teen-singapore/singapore-bans-film-focused-on-indicted-palestinian-teen-activist-idINKBN1ES0P8", "ord_in_thread": 0, "title": "Singapore bans film focused on indicted Palestinian teen activist", "locations": [], "entities": {"persons": [{"name": "fathin ungku", "sentiment": "none"}, {"name": "ahed tamimi", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "palestin", "sentiment": "none"}, {"name": "west bank", "sentiment": "none"}, {"name": "ofer prison", "sentiment": "none"}, {"name": "ramallah", "sentiment": "none"}, {"name": "palestine-israeli", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "israeli prison service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "media development authority of singapore", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 10:52 AM / in 34 minutes Singapore bans film focused on indicted Palestinian teen activist Fathin Ungku 3 Min Read \nSINGAPORE (Reuters) - Singapore has banned a film festival from screening a documentary later this week that features a teenage Palestinian female activist whose arrest last month has made her a symbol of resistance to Israeli military occupation in the West Bank. Palestinian teen Ahed Tamimi (R) enters a military courtroom escorted by Israeli Prison Service personnel at Ofer Prison, near the West Bank city of Ramallah, January 1, 2018. REUTERS/Ammar Awad \nJustifying the ban, authorities in the Southeast Asian city state said the film “Radiance of Resistance” was “skewed” and potentially divisive for Singapore’s multi-ethnic population. \nThe documentary, which looks at the Palestine-Israeli conflict through the eyes of 16-year-old Ahed Tamimi and another young female activist, lacked “counterbalance”, the Info-communications Media Development Authority of Singapore (IMDA) said on its website. \n“The skewed narrative of the film is inflammatory and has the potential to cause disharmony amongst the different races and religions in Singapore,” the IMDA said. \nThe documentary was due to have been shown at the Singapore Palestinian Film Festival on Thursday. \nIt was screened at a number of festivals worldwide in 2017 and won Best Documentary at the Respect Human Rights Film Festival in Belfast, but has become even more topical following Tamimi’s arrest last month. \nTamimi was charged on Monday with counts of aggravated assault and will be tried in an Israeli military court. An adult found guilty of assaulting a soldier could be jailed for up to 10 years, but Tamimi is a minor so such an outcome is unlikely. \nWhile Singapore’s authorities are known to keep a tight rein on public speech and the media, especially when it comes to matters related to race and religion, outright bans are more rare. \nAdela Foo, the organizer of the Singapore festival, called the ban “understandable”, without elaborating. \n“At the end of the day, the IMDA’s position is one to be respected,” the 23-year-old student told Reuters. \nWith a sizable Muslim minority and surrounded by Muslim majority neighbors where sympathy for the Palestinian cause runs high, Singapore maintains friendly diplomatic and military ties with Israel. But it has lined up with many other countries opposed to U.S. President Donald Trump’s recognition of Jerusalem as Israel’s capital. \nAround 15 percent of Singapore’s 3.3 million resident population aged 15 years and over identify as Muslim, recent government surveys show. Reporting by Fathin Ungku; Editing by John Geddie & Simon Cameron-Moore", "external_links": [], "published": "2018-01-03T12:52:00.000+02:00", "crawled": "2018-01-03T13:14:37.044+02:00", "highlightTitle": ""}