{"organizations": [], "uuid": "ea69f85fe410c4e015eb3090c96dd65a1c52848e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223181850&w=1200&r=LYNXMPEE0I00E", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-astrazeneca-r-d/at-astrazeneca-fewer-drug-projects-bring-big-productivity-jump-idUSKBN1F8009", "country": "US", "domain_rank": 408, "title": "At AstraZeneca, fewer drug projects bring big productivity jump", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-19T08:06:00.000+02:00", "replies_count": 0, "uuid": "ea69f85fe410c4e015eb3090c96dd65a1c52848e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-astrazeneca-r-d/at-astrazeneca-fewer-drug-projects-bring-big-productivity-jump-idUSKBN1F8009", "ord_in_thread": 0, "title": "At AstraZeneca, fewer drug projects bring big productivity jump", "locations": [], "entities": {"persons": [{"name": "pascal soriot", "sentiment": "none"}, {"name": "soriot", "sentiment": "none"}, {"name": "mene pangalos", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "astrazeneca", "sentiment": "negative"}, {"name": "innovative medicines and early development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 12:06 AM / in a minute At AstraZeneca, fewer drug projects bring big productivity jump Ben Hirschler 4 Min Read \nLONDON (Reuters) - A focus on fewer diseases, together with cuts in laboratories and staff, has delivered a more than fourfold increase in research productivity at drugmaker AstraZeneca ( AZN.L ), based on one key measure of success. The analysis published on Friday comes at a time of soul-searching among large pharmaceutical companies as they compete with smaller biotech firms, which are getting new drugs to market more efficiently. The turnaround evident this decade at AstraZeneca follows a shrinking of its global research and development organization and a revision of R&D strategy in 2011, a year before the arrival of current chief executive Pascal Soriot. Soriot has since continued the shift to a deeper and narrower focus on priority therapeutic areas, notably cancer. “All these improvements have happened with less people, less sites and less money,” Mene Pangalos, who leads AstraZeneca’s Innovative Medicines and Early Development unit, told Reuters. Previously, AstraZeneca was a laggard in the pharmaceutical industry with a dismal track record in launching new medicines and a rapidly eroding base business, due to expiring patents on its older medicines. Its average success for getting a drug from the discovery phase through to successful completion of final-stage Phase III clinical trials was at an all-time low of 4 percent in 2005-10, below the industry average of 6 percent. But in the five years from 2012 to 2016, this jumped to 19 percent, while the industry average, according to consultancy CMR International, was little changed. AstraZeneca scientists published the latest findings in the journal Nature Reviews Drug Discovery. Significantly, there was a marked drop in the number of projects started at the discovery stage, with the total falling to just 76 in 2012-16 from 287 in 2005-10. “We’re working on far fewer programs and the probability of success on those programs is going up,” Pangalos said. “Going from 4 percent to nearly 20 percent is something we are all very happy with but I still want us to do better ... we’re still failing 80 percent of the time.” \nINVESTOR SENTIMENT The productivity boost coincides with an improvement in shareholder sentiment as investors have started to bet on AstraZeneca’s ability to replace older medicines with new products, particularly in oncology. A failed bid from Pfizer ( PFE.N ) in 2014 has also helped the investment story. \nToday, two-thirds of analysts recommend buying the shares, up from one in five in 2012. \nThe decision by Pangalos and his colleagues to detail the company’s successes and failures in two academic papers, the first of which appeared in 2014, is unusual. Rivals such as GlaxoSmithKline ( GSK.L ) and Pfizer have published some details of R&D productivity in the past but the AstraZeneca review is more comprehensive. Still, the data does not track the profitability of AstraZeneca’s research activities, since even when a new drug succeeds in final clinical tests and wins regulatory approval, commercial success is not guaranteed. A report last month by consultancy Deloitte found projected returns at 12 of the world’s top drugmakers had fallen in recent years, even though the overall of number of new drugs had increased. AstraZeneca itself has had some notable successes, such as its new cancer pills Tagrisso and Lynparza, but prospects for other approved products, including its high-profile immunotherapy drug Imfinzi, have been more mixed. Imfinzi suffered a major lung cancer trial setback in July 2017, although it then went on to show impressive results in another lung cancer setting. Reporting by Ben Hirschler; editing by Giles Elgood", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T08:06:00.000+02:00", "crawled": "2018-01-19T02:30:29.002+02:00", "highlightTitle": ""}