{"organizations": [], "uuid": "9b51e89c802d4d3954152bc5b3d1dcf044272b38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-beer-institute-names-dan-roth-senior-director-of-public-affairs.html", "country": "US", "domain_rank": 767, "title": "Beer Institute Names Dan Roth, Senior Director of Public Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:00:00.000+02:00", "replies_count": 0, "uuid": "9b51e89c802d4d3954152bc5b3d1dcf044272b38"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-beer-institute-names-dan-roth-senior-director-of-public-affairs.html", "ord_in_thread": 0, "title": "Beer Institute Names Dan Roth, Senior Director of Public Affairs", "locations": [], "entities": {"persons": [{"name": "dan roth", "sentiment": "negative"}, {"name": "dan", "sentiment": "none"}, {"name": "roth", "sentiment": "none"}, {"name": "jim mcgreevy", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "beer institute", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 18, 2018 /PRNewswire-USNewswire/ -- The Beer Institute, one of the nation's oldest trade associations representing America's brewers, beer importers and industry suppliers, announced today that Beer Institute communications director Dan Roth has been promoted to serve as the trade association's senior director of public affairs. Roth joined the Beer Institute in May 2016 as its communications director where he was instrumental in working on successful efforts to provide federal excise tax relief to brewers and beer importers.\n\"Dan is a thoughtful communications professional with a track record of success in the beer industry, communications, and in government at the federal, state and local levels. His continued contributions will be critical in our ongoing efforts to educate lawmakers, members of the media, and the American public about the more than 2.2 million Americans whose jobs depend on our nation's vibrant beer industry,\" said Jim McGreevy, Beer Institute President and CEO. \"We are looking forward to Dan stepping into this new role and building on our record of advocating for brewers, beer importers, and industry suppliers.\"\nBefore joining the Beer Institute in May 2016, Roth worked for Congressmember Karen Bass (D-CA) as her communications director. Roth was also communications director for the Democratic Legislative Campaign Committee, where he led communications efforts during the 2012 election cycle. Prior to moving to Washington, DC, Roth worked in the California Legislature as well as being the chief of staff for a Sacramento City Councilmember. In addition, Roth was the California media relations manager for the Nature Conservancy.\n\"I want to thank the Beer Institute as well as our member companies for the trust they have placed in me to lead our public affairs team as we continue our efforts to tell the story of beer--one of America's most iconic industries,\" said Roth. \"I have enjoyed meeting with our member company employees from across the nation and learning about their commitment to quality and their dedication to responsible drinking. I look forward to continuing these conversations as we educate policy makers, members of the media, and the general public about the important role beer played in America's history and continues to play in our national economy.\"\nThe Beer Institute is a national trade association for the American brewing industry, representing brewers of all sizes, as well as beer importers and industry suppliers. First founded in 1862 as the U.S. Brewers Association, the Beer Institute is committed today to the development of sound public policy and to the values of civic duty and personal responsibility. For additional updates from the Beer Institute, visit our website , follow @BeerInstitute on Twitter, like the Beer Institute on Facebook , and follow the Beer Institute on Instagram .\nView original content: http://www.prnewswire.com/news-releases/beer-institute-names-dan-roth-senior-director-of-public-affairs-300584695.html\nSOURCE Beer Institute", "external_links": ["https://www.facebook.com/BeerInstitute/", "http://www.beerinstitute.org/", "http://www.prnewswire.com/news-releases/beer-institute-names-dan-roth-senior-director-of-public-affairs-300584695.html", "https://twitter.com/beerinstitute/", "https://www.instagram.com/beerinstitute/"], "published": "2018-01-18T22:00:00.000+02:00", "crawled": "2018-01-18T21:49:14.017+02:00", "highlightTitle": ""}