{"organizations": [], "uuid": "2342e81a0568af830821bfa07b9b83bd74082ce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180113.html", "section_title": "Archive News &amp; Video for Saturday, 13 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/california-mudslides/california-police-hope-for-miracle-to-find-missing-in-mudslide-idUSL1N1P805K", "country": "US", "domain_rank": 408, "title": "California police hope for miracle to find missing in mudslide", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.368, "site_type": "news", "published": "2018-01-13T18:58:00.000+02:00", "replies_count": 0, "uuid": "2342e81a0568af830821bfa07b9b83bd74082ce9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/california-mudslides/california-police-hope-for-miracle-to-find-missing-in-mudslide-idUSL1N1P805K", "ord_in_thread": 0, "title": "California police hope for miracle to find missing in mudslide", "locations": [], "entities": {"persons": [], "locations": [{"name": "montecito", "sentiment": "none"}, {"name": "calif", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "santa barbara county sheriff’s office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTECITO, Calif, Jan 13 (Reuters) - Californian authorities called for public help in locating seven people still missing after mudslides that killed at least 18, as crews carried on searching for survivors on Saturday.\nThe Santa Barbara County Sheriff’s Office made a plea for information on any of the missing residents, while acknowledging that finding anyone alive would be a “miracle”.\n“The missing persons were reported by family and friends, and resided in areas that were heavily damaged during the storm and subsequent mudslides,” the sheriff’s office said.\nThe sheriff’s office listed the names of the missing, who range in age from two to 62, in a statement on Friday night.\nThe disaster struck on Tuesday after heavy rains soaked the area near Montecito, north of Los Angeles, where vegetation had been denduded by the largest wildfire in California’s history.\nSodden hillsides gave way, unleashing a torrent of mud, water, uprooted trees and boulders onto the valley below and causing what the police described as “traumatic injuries” to the victims, who ranged in age from 3 to 89.\nThe destruction covered 30 square miles and more than 2,100 personnel from local, state and federal agencies, including the U.S. Coast Guard, the U.S. Navy and the American Red Cross are involved in “challenging” search, recovery and relief efforts, the California Department of Forestry and Fire Protection said.\nOfficials ordered residents in most of the southeastern corner of Montecito, which is east of Santa Barbara, to leave their homes for what was likely to be one or two weeks.\nOne of California’s most celebrated roads, coastal Highway 101, was partially closed, with mud was two feet deep in places, while in Montecito, mud reached the roof lines of houses, as residents surveyed their damaged homes.\n“We have a yard to redo and hopefully our insurance will help out with that, but the people across from me, newer homes, gone,” Garrett Speirs, a 54-year-old artist who has been living in Montecito for 20 years, said.\n“Everybody down below gone, two girls gone ...Two sixth-graders in the school our kids went to,” Speirs added. (Additional reporting by Keith Coffman in Denver, Chris Kenning in Chicago, Gina Cherelus and Peter Szekely in New York and Jon Herskovitz in Austin, Texas; Writing by Scott Malone and Jon Herskovitz; editing by Jeffrey Benkoe, James Dalgleish, G Crosse and Alexander Smith)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T18:58:00.000+02:00", "crawled": "2018-01-14T20:27:37.008+02:00", "highlightTitle": ""}