{"organizations": [], "uuid": "923a037da5439598eb3b385b58b7181aaad310f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/philippines-media/philippine-news-site-head-meets-investigators-over-suspicious-complaint-idUSL4N1PH05X", "country": "US", "domain_rank": 408, "title": "Philippine news site head meets investigators over 'suspicious' complaint", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:20:00.000+02:00", "replies_count": 0, "uuid": "923a037da5439598eb3b385b58b7181aaad310f8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/philippines-media/philippine-news-site-head-meets-investigators-over-suspicious-complaint-idUSL4N1PH05X", "ord_in_thread": 0, "title": "Philippine news site head meets investigators over 'suspicious' complaint", "locations": [], "entities": {"persons": [{"name": "maria ressa", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "ressa", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "national bureau of investigation", "sentiment": "none"}, {"name": "nbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA, Jan 22 (Reuters) - The head of a Philippine news site ordered closed for ownership violations met state investigators on Monday to answer what she called a “suspicious” complaint about a five-year-old story, as domestic fears grow of an impending crackdown on media.\nMaria Ressa, chief of Rappler (www.rappler.com), maintains that the Jan. 11 Securities and Exchange Commission’s revoking of Rappler’s licence was designed to intimidate journalists whose reporting has challenged President Rodrigo Duterte, notorious for his public tirades against opponents.\nRessa was met by a phalanx of media after answering a subpoena by the National Bureau of Investigation (NBI) that she said was part of “a concerted effort to turn journalism into a crime”.\n“Although friendly, I still see this as a continuing pattern to harass and to shut down Rappler,” Ressa said of the 50-minute meeting, which centred on a complaint by a businessmen the NBI said was made last year about a 2012 story.\n“I still see it as part of a concerted effort that will have impact to press freedom in the country.”\nThe authorities say Rappler is not being punished, but broke the law in 2015 by granting American investor Omidyar Network the means to exercise some control over the news site, or veto powers on company decisions. Rappler says that is “ludicrous”.\nRappler has repeatedly drawn Duterte’s ire and he last week called it a “fake news outlet”. Rappler is operating as normal pending an appeal.\nPresidential spokesman Harry Roque said that although Duterte may not be happy with some journalists, he had done nothing to stop them.\n“If the president wanted to curb press freedom, he could have done it, but he only speaks against the press,” Roque told a regular briefing.\n“That’s all he can do and he has the right to be angry and curse the press.”\nThough Duterte has expressed bemusement at allegations he influenced the SEC, the complaint against Rappler was made by his ally, Solicitor General Jose Calida.\nDuterte has also vented fury at the Philippine Daily Inquirer, a broadsheet that has reported extensively on his bloody war on drugs, and broadcaster ABS-CBN , the licence of which the president has threatened not to renew in 2020.\nRappler’s reporting has included investigations into what it says is the “weaponizing” of the internet by a government that engages closely with pro-Duterte bloggers, whose postings influence “trolls” generating and directing online hate towards the president’s opponents.\nDuterte’s office denies engineering such a system and pro-Duterte bloggers typically say they are not responsible for how trolls behave.\nThe NBI cybercrime division chief, Manuel Antonio Duarte, said the NBI would be fair in its investigation and Ressa’s appearance showed Rappler trusted the NBI to do its job.\nRessa said the timing of her subpoena was puzzling.\n“What we were told is this is coincidental,” she said.\n“Again, too much coincidence creates a pattern. And the pattern is clear. This is political in nature.”\nAdditional reporting by Manuel Mogato; Writing by Martin Petty; Editing by Nick Macfie\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T13:20:00.000+02:00", "crawled": "2018-01-22T19:24:59.007+02:00", "highlightTitle": ""}