{"organizations": [], "uuid": "2992cb84f8d019eb109fb855f80b0ec1ca0de2f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/column-russell-lng-china/column-china-may-cause-larger-seasonal-swings-in-lng-prices-russell-idUSL3N1PD2Q7", "country": "US", "domain_rank": 408, "title": "COLUMN-China may cause larger seasonal swings in LNG prices: Russell", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "2992cb84f8d019eb109fb855f80b0ec1ca0de2f3"}, "author": "", "url": "https://www.reuters.com/article/column-russell-lng-china/column-china-may-cause-larger-seasonal-swings-in-lng-prices-russell-idUSL3N1PD2Q7", "ord_in_thread": 0, "title": "COLUMN-China may cause larger seasonal swings in LNG prices: Russell", "locations": [], "entities": {"persons": [{"name": "clyde russell", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "launceston", "sentiment": "none"}], "organizations": [{"name": "russell reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:00 PM / Updated 12 minutes ago COLUMN-China may cause larger seasonal swings in LNG prices: Russell Reuters Staff 5 Min Read \n(Repeats with no changes to text. The opinions expressed here are those of the author, a columnist for Reuters.) \n* GRAPHIC - China LNG imports vs spot price: reut.rs/2DJxrjH \nBy Clyde Russell \nLAUNCESTON, Australia, Jan 18 (Reuters) - There is little doubt that China’s voracious appetite for liquefied natural gas (LNG) is the prime mover behind the spot price for the fuel reaching its highest in more than three years, but what happens next? \nThe current market view seems to be that China will suck up the super-chilled fuel as it continues efforts to switch to natural gas from coal as part of efforts to lower air pollution. \nWhile that’s a reasonable assumption, it doesn’t answer the question as to how the Asian spot LNG price LNG-AS will be affected by the seasonal drop in demand over the northern summer. \nThe rise of China as a major driver of LNG pricing in Asia will no doubt have an influence on what happens during the lower demand periods. Thus, it is key to understand how seasonal China’s LNG demand is likely to be in 2018. \nSimilar to the other major North Asia LNG buyers - Japan and South Korea - China does show considerable seasonality in LNG import demand. \nIn the 2016/17 winter, China’s LNG imports LNG-CNIMP peaked at 3.73 million tonnes in December 2016, before dropping to a low of 1.99 million tonnes in March 2017. \nThe prior winter, imports topped out at 2.46 million tonnes in January 2016, before dropping to a low of 1.43 million tonnes in May of that year. \nThe 2016/17 winter saw a drop of 46 percent to the subsequent seasonal low, and the prior winter witnessed a decline of 42 percent. \nThe problem is how much China’s LNG imports have surged in 2017, yielding a winter peak that is far higher than what it was in previous years. \nOfficial customs figures for December aren’t available yet, but vessel-tracking and port data compiled by Thomson Reuters indicates record LNG imports for the month of around 5.18 million tonnes. \nThis is up from the previous record high of 4.22 million tonnes in November as estimated by shipping data. CHINA RISKS \nIf the pattern of prior years is followed, a 40 percent drop in imports from December to the seasonal low of 2018 would result in about 3.1 million tonnes as the lowest monthly volume for the year. \nThis may be somewhat optimistic given the nature of China’s LNG consumption, which is mainly used in heating and industrial processes such as glass manufacturing. \nWith heating demand likely to tail off sharply after winter, and slower manufacturing growth expected in 2018, it’s possible the fall from winter peak to summer lull may be larger than usual for China’s LNG demand. \nIn other words, the seasonal nature of China’s LNG demand may be amplified by current policy, with demand ramping up sharply in winter as the cleaner-burning fuel is used instead of coal for heating, but then also falling sharply in summer. \nBy itself, this would imply spot prices may experience a larger than usual seasonal decline this year, but China isn’t the sole factor influencing the cost of LNG. \nA further bearish factor is the increasing supply of LNG from newly-commissioned units in Australia, the United States and Russia. \nIn Australia, Chevron’s 8.9 million tonne per year Wheatstone project continues to ramp up, while Inpex’s similarly-sized Ichthys venture is coming closer to production, as is Royal Dutch Shell’s 3.6 million tonne floating Prelude project. \nIn the United States, Dominion’s Cove Point plant is in the process of commissioning and Russia’s Yamal facility loaded its first export cargo in December. \nOn the bullish side is that LNG demand in Asia, outside of the big three of Japan, China and South Korea, has been growing and could help absorb the new supply coming to market. \nBut as things stand, the risk has to be that spot prices will drop by at least as much in percentage terms as they have in previous years. \nThe peak last winter was $9.75 per million British thermal units (mmBtu), and the trough in summer was $5.40, a decline of 45 percent. The winter of 2015-2016 saw a drop of 49 percent from the peak in November 2015 to the nadir in April 2016. \nSpot LNG fetched $11.50 per mmBtu in the week to Jan. 12, and it may not yet have reached its winter peak. If it does experience a decline similar to previous years, it suggests a summer low in the region of $6.33 per mmBtu. Editing by Tom Hogue", "external_links": [], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T14:17:49.005+02:00", "highlightTitle": ""}