{"organizations": [], "uuid": "0349ef1fceebc5f62ff2e14ac60e7e29987189cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-eiger-biopharmaceuticals-announces-appointment-of-commercial-operations-industry-veteran-eldon-mayer-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Eiger BioPharmaceuticals Announces Appointment of Commercial Operations Industry Veteran Eldon Mayer to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "0349ef1fceebc5f62ff2e14ac60e7e29987189cf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-eiger-biopharmaceuticals-announces-appointment-of-commercial-operations-industry-veteran-eldon-mayer-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Eiger BioPharmaceuticals Announces Appointment of Commercial Operations Industry Veteran Eldon Mayer to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "eldon mayer", "sentiment": "negative"}, {"name": "mayer", "sentiment": "none"}, {"name": "thomas dietz", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "eiger biopharmaceuticals announces appointment of commercial operations industry veteran", "sentiment": "negative"}, {"name": "eiger biopharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "board and company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 8, 2018 /PRNewswire/ -- Eiger BioPharmaceuticals, Inc. (Nasdaq: EIGR), focused on the development and commercialization of therapies for rare diseases, announced today the appointment of Eldon Mayer to its Board of Directors. Mr. Mayer is a pharmaceutical industry veteran with broad commercial experience which spans over two decades in large pharma and specialty pharma across oncology, inflammatory disease, pulmonary disease, dermatology and rare diseases, with multiple successful exits by acquisition.\n\"Mr. Mayer has a proven track record that is recent and highly relevant in pharmaceutical commercial strategy, building and managing high performance sales and marketing teams, pricing and market access, and new product planning,\" stated Thomas Dietz, PhD, Chairman of the Board of Eiger. \"His broad industry and operational background will be invaluable as we prepare for late stage clinical development and begin commercial planning across the entire Eiger pipeline. We look forward to Mr. Mayer's strategic insights and contributions to the Board and Company.\"\n\"I am very pleased to join Eiger's Board at this exciting point in the Company's evolution to late stage development, and look forward to working closely with the other Board members and Eiger's management team to advance a diverse set of exciting clinical stage orphan disease programs in therapeutic areas of high unmet medical need,\" said Mr. Mayer.\nEiger concurrently announced that Chuck Bramlage is departing from the Board to focus on a newly accepted position as CEO at another start-up company. \"We want to sincerely thank Chuck Bramlage for his contributions to Eiger and wish him the best in his new role as CEO,\" concluded Dr. Dietz.\nEldon Mayer is currently Executive Vice President and Chief Commercial Officer of Rigel Pharmaceuticals. Prior to joining Rigel, Mr. Mayer successfully led the commercial function at Questcor Pharmaceuticals, a specialty biopharma company that focused on serious, ultra-rare diseases. As head of commercial operations, Mr. Mayer relaunched Acthar ® Gel (Repository Corticotropin Injection); repositioning the product, building out a specialty commercial team to over 400 people and growing annual sales to over $1 billion. Questcor was acquired by Mallinckrodt for approximately $5.6 Billion in 2014. Prior to that, he held positions of increasing responsibility at a number of biopharma companies including Schering-Plough, ALZA, Chiron, and Connetics, in functional areas including strategic planning, marketing, sales, market research and analytics, operations and finance. Mr. Mayer serves as a member of the Board of Promet Therapeutics LLC and the National Community Oncology Dispensing Association. Mr. Mayer holds a BS in Finance from Fairleigh Dickinson University and an MBA in Marketing from Syracuse University.\nAbout Eiger\nEiger is a clinical-stage biopharmaceutical company focused on the development and commercialization of targeted therapies for orphan diseases. We are committed to translational innovation and developing well-characterized drugs acting on newly identified or novel, validated targets. Our mission is to systematically reduce the time and cost of the drug development process to more rapidly deliver important medicines to patients with orphan diseases. For additional information about Eiger and its clinical programs, please visit www.eigerbio.com .\nInvestors: Ingrid Choong, PhD\nEmail: ichoong@eigerbio.com\nPhone: 1-650-619-6115\nView original content with multimedia: http://www.prnewswire.com/news-releases/eiger-biopharmaceuticals-announces-appointment-of-commercial-operations-industry-veteran-eldon-mayer-to-its-board-of-directors-300578593.html\nSOURCE Eiger BioPharmaceuticals, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/eiger-biopharmaceuticals-announces-appointment-of-commercial-operations-industry-veteran-eldon-mayer-to-its-board-of-directors-300578593.html", "http://www.eigerbio.com/"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:07:39.010+02:00", "highlightTitle": ""}