{"organizations": [], "uuid": "9ddbbb84d4d5e1a7f0bdadbc50e4897a9e6357be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-voice-commerce-software-solutions-top-trends-in-2018-finds-market-spotlight.html", "country": "US", "domain_rank": 767, "title": "Voice Commerce, Software Solutions Top Trends in 2018, Finds Market Spotlight", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "9ddbbb84d4d5e1a7f0bdadbc50e4897a9e6357be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-voice-commerce-software-solutions-top-trends-in-2018-finds-market-spotlight.html", "ord_in_thread": 0, "title": "Voice Commerce, Software Solutions Top Trends in 2018, Finds Market Spotlight", "locations": [], "entities": {"persons": [{"name": "jason oxman", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "voice commerce", "sentiment": "negative"}, {"name": "software solutions top trends", "sentiment": "negative"}, {"name": "eta", "sentiment": "none"}, {"name": "idc", "sentiment": "none"}, {"name": "electronic transaction association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 24, 2018 /PRNewswire/ -- A new payments industry research study released today finds that technology and financial services innovation in 2018 will focus on consumer interfaces, security and software innovation. The Electronic Transaction Association (ETA) sponsored IDC Market Spotlight, Payments Trends to Watch in 2018, highlights new channels, networks and opportunities for the acquiring community. The Market Spotlight provides specific insight into five trends in payments technology in 2018 that will drive the discussion at ETA's TRANSACT, April 17-19, the world's largest payments technology trade show.\n\"The financial institutions, networks, payment processors and FinTechs powering payments are using new interfaces and better security to drive commerce for consumers and retailers,\" stated Jason Oxman, CEO of the Electronic Transaction Association. \"As the trade association of the payments technology industry, ETA will use this research report to focus in 2018 on creating new opportunities for partnerships that integrate payments and technology.\"\nThe New Channels: Voice, AI and the Internet of Things\nIn the next 24 months, IDC forecasts 30 billion devices will be connected to the internet. 2018 will bring a serious discussion on how merchants and their vendors will contend with new channels – voice-enabled commerce through in-home devices, chatbots initiating payments on social networks, and connected devices managing purchasing decisions and payments. In 2018 alone, those connected devices will initiate $150 billion in transactions, ETA research finds.\n\"Voice is a natural way to communicate and it will become a very important part of commerce as we move forward,\" said James Wester, Research Director for IDC. \"2018 will be the year we see voice commerce provide a seamless and easier way to make a payment.\"\nIn 2018, the Market Spotlight concludes that financial institutions and payment technology vendors must focus on their preparedness in the face of this rapid buildout of IoT and the assignment of customer identities and accounts to connected devices.\nThe \"Point of Interaction\": The Changing State of the Point of Sale\nIDC forecasts that U.S. merchants will spend nearly $1.7 billion on POS hardware in each of the next two years. The continued evolution of the point of sale (POS) remains important in 2018 as large retailers look to their POS to handle more than the transaction, and small retailers seek powerful, integrated, competitively priced POS options.\n\"The POS is part of the entire retail experience,\" said Wester. \"The cash register has evolved and no longer just sits on a counter to be involved only in the transaction. The data captured during that transaction can help a retailer offer rewards and loyalty programs, or help them make decisions on logistics and pricing.\"\nToday's shoppers expect a seamless experience, one that follows them across channels and provides virtually unlimited choices. In 2018, POS vendors who provide retailers with the means to bring value to the shopping experience, along with providing a variety of payment types (chip, swipe and contactless) and services such as loyalty and rewards programs, will enable retailers to meet consumers demands.\nSoftware as the New Hardware\nThe POS is becoming a point of connection to a marketplace of applications and software that go beyond payment acceptance. The IDC Market Spotlight finds that U.S. merchants will spend $2.2 billion in 2018, and $2.4 billion in 2019, on POS software alone. Additionally, spending on customer analytics and loyalty management solutions will hit $1.4 billion in 2018 and $1.6 billion in 2019, the report finds.\n\"Companies building terminals are turning to software companies, some of who are just entering the payments landscape, to turn the POS into an integrated system that does more than just payments,\" stated Wester. \"Thanks to software, the POS is now an important part of omnichannel commerce. Days of a standalone payments terminal are over. Processors see the value of building networks on top of money movement.\"\nIn 2018, POS vendors and their payment partners will look for new revenue opportunities by offering access to an ecosystem that delivers new solutions in addition to card acceptance.\nEvolving Transmission Networks\n2018 will see an increased focus on new payments networks to carry transaction volume and on financial institutions upgrading their systems. IDC predicts that banks in the U.S. alone will spend nearly $5 billion on the effort, including hardware, software and IT services in the next two years. The IDC Market Spotlight specifically highlights Zelle, the bank-backed P2P network owned by Early Warning, as an example of a new network offering a solution for a specific use case.\n\"Financial institutions are improving their back-end-systems to better connect across multiple channels,\" said Wester. \"Institutions do not want to lose to a non-bank player and the 'next generation' platform for banks will allow faster connections to new networks.\"\nMultiple network options mean financial institutions can offer products for business and consumer customers such as dynamic routing of payments across multiple competing networks or support connected banking, where APIs provide links into banks systems for third parties to access data for aggregation or money movement.\nSecurity: Innovation to Support New Tools\nU.S. vendors are planning to spend $1 billion on security software this year, according to IDC. The payments industry has a chance to introduce new tools and technologies to meet the growing cybersecurity and fraud threats that merchants face online and in-store.\n\"We see how important data is and vendors will need to be able to answer questions on how secure are new technologies like AI, voice and even cryptocurrencies,\" stated Wester. \"As consumers assign their identities – and the financial accounts to those identities – to object and items such as cars and devices, the risk to the system grows.\"\nTo receive a copy of the IDC Market Spotlight, Payment Trends to Watch in 2018, or schedule an interview, please contact Laura Hubbard, director of communications at ETA, lhubbard@electran.org . To see and take part in the discussion with the companies that shape the payments industry, make plans to attend TRANSACT 2018, April 17-19 in Las Vegas. Jason Oxman and James Wester discussed the five trends for the inaugural issue of ETA's podcast, Transaction Trends. To listen to the podcast, visit www.transactiontrends.com and subscribe to Transaction Trends on Apple Podcasts, Google Play Music, SoundCloud and Stitcher.\nAbout ETA\nThe Electronic Transactions Association (ETA) is the global trade association representing more than 500 payments and technology companies. ETA members make commerce possible by processing more than $5 trillion in purchases in the U.S. and deploying payments innovations to merchants and consumers.\nMedia Inquiries:\nPatrick Nolan\n(202) 677-7415\npnolan@electran.org\nView original content: http://www.prnewswire.com/news-releases/voice-commerce-software-solutions-top-trends-in-2018-finds-market-spotlight-300587049.html\nSOURCE Electronic Transaction Association (ETA)", "external_links": ["http://www.transactiontrends.com/", "http://www.prnewswire.com/news-releases/voice-commerce-software-solutions-top-trends-in-2018-finds-market-spotlight-300587049.html"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:54:11.069+02:00", "highlightTitle": ""}