{"organizations": [], "uuid": "5919e703057108a2763562f009d5fecff0413c5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104932962-GettyImages-878291772.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/germanys-merkel-enters-high-stakes-talks-in-last-chance-to-form-a-government.html", "country": "US", "domain_rank": 767, "title": "Germany's Merkel enters high-stakes talks in last chance to form a government", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.055, "site_type": "news", "published": "2018-01-08T09:33:00.000+02:00", "replies_count": 0, "uuid": "5919e703057108a2763562f009d5fecff0413c5a"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/08/germanys-merkel-enters-high-stakes-talks-in-last-chance-to-form-a-government.html", "ord_in_thread": 0, "title": "Germany's Merkel enters high-stakes talks in last chance to form a government", "locations": [], "entities": {"persons": [{"name": "angel", "sentiment": "negative"}, {"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "virginia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "christian democratic union", "sentiment": "none"}, {"name": "csu", "sentiment": "none"}, {"name": "cdu", "sentiment": "none"}, {"name": "christian social union", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Germany's Chancellor Angela Merkel has entered talks with a rival party in a last-ditch effort to form a coalition government after months of political uncertainty and deadlock in the euro zone's largest economy.\nMerkel, the head of a conservative alliance made up of the Christian Democratic Union (CDU) and its Bavarian sister-party the Christian Social Union (CSU), will meet with Martin Schulz, the head of the Social Democratic Party (SPD), for preliminary talks this week. They are set to discuss whether they can renew a governing coalition that has been in operation in recent years.\nThe SPD had previously refused to enter into another coalition government given that its voters punished it in the last election for its previous alliance. But after coalition talks between Merkel and two other parties failed to find an agreement , the SPD has changed its stance.\nMerkel sounded optimistic ahead of the talks, commenting on Sunday that she believed an agreement \"can be done,\" but the SPD's Schulz has vowed to extract concessions from the CDU/CSU on many of its key policies.\nStumbling blocks The talks run until Thursday and are expected to encounter some stumbling blocks, particularly with Merkel's conservative union at odds with the center-left SPD over a number of issues, including social welfare reforms and the asylum status of refugees, many of whom entered Germany in 2015 at the height of Europe's migration crisis .\nIf the parties find enough common ground this week to proceed, the SPD must then get backing for the deal from its members at the party's congress later in January. If that succeeds, then the parties will proceed to full-blown coalition talks.\nAt best, a government could be sworn in late March or early April, according to Oxford Economics.\n\"The government formation in Germany is unlikely to be completed before the end of the first quarter even in an optimistic scenario,\" Oliver Rakau, chief German economist at Oxford Economics, said in a note last week.\n\"The main stumbling blocks are the final vote of the SPD party congress. The latter is extremely skeptical of a new cooperation with the CDU,\" he added.\nIf the talks fail to produce a deal, another election is likely. This would be a blow for Germany but more so for the wider euro zone that looks to its largest economy for political and economic stability. Germany accounts for 28 percent of the euro zone's gross domestic product (GDP) , according to the International Monetary Fund.\nGermany's economy is expected to have achieved 2.6 percent GDP growth in 2017, the country's Bundesbank said in December, and similar momentum is expected in 2018. But political uncertainty would be a distraction for business and worrying for voters.\nPepijn Bergsen, an analyst at the Economist Intelligence Unit, told CNBC Monday that the talks would not have much impact on the German economy in the short term, however.\n\"For the German economy I don't think it'll make much difference (if talks fail), the economy is running very well — 2.5 percent last year and probably above 2 percent this year so there's no need in the short term to reform in Germany. Over the medium to long term Germany still definitely needs to do quite a lot and for that, you'd want a stable government over the coming years.\n\"The real risk is more within Europe, there's an ambitious reform agenda for the next half a year and for that you need a German government in place,\" he said.\nHigh stakes Talks between Germany's political parties have taken place since an election last September failed to produce an overall majority for any party, although coalition governments are common in Germany.\nThe latest talks come after months of failed negotiations between Merkel's conservative alliance and smaller parties, the Greens and pro-business Free Democrats, failed to form a coalition government.\nThe stakes for the latest talks are high given the changing political landscape in Germany, however. The election in September saw the far-right Alternative for Germany (AfD) become the country's third largest party and enter the German Bundestag for the first time, unsettling the political establishment and many voters .\nThe center-left SPD has been reluctant to re-enter a coalition with Merkel's conservative bloc as its previous alliance seems to have put voters off with the party garnering just 20 percent of the vote in the September election, its worst result since World War II.", "external_links": [], "published": "2018-01-08T09:33:00.000+02:00", "crawled": "2018-01-08T09:33:42.037+02:00", "highlightTitle": ""}