{"organizations": [], "uuid": "044b05d6b42d6036fcacfc56a06927816ea3cbca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-penn-foster-names-lisa-rutsky-to-newly-created-position-of-vice-president-of-education-and-academic-dean.html", "country": "US", "domain_rank": 767, "title": "Penn Foster Names Lisa Rutsky to Newly Created Position of Vice President of Education and Academic Dean", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "044b05d6b42d6036fcacfc56a06927816ea3cbca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-penn-foster-names-lisa-rutsky-to-newly-created-position-of-vice-president-of-education-and-academic-dean.html", "ord_in_thread": 0, "title": "Penn Foster Names Lisa Rutsky to Newly Created Position of Vice President of Education and Academic Dean", "locations": [], "entities": {"persons": [{"name": "lisa rutsky", "sentiment": "negative"}, {"name": "rutsky", "sentiment": "none"}, {"name": "dara warn", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "scranton", "sentiment": "none"}, {"name": "penn.", "sentiment": "none"}, {"name": "penn", "sentiment": "none"}], "organizations": [{"name": "penn foster", "sentiment": "negative"}, {"name": "penn foster, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Scranton, Penn., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Penn Foster, Inc., a leading middle skilled education and skills training provider, today announced it has named Lisa Rutsky as Vice President of Education and Academic Dean.\nIn this role, Rutsky will be responsible for advancing Penn Foster’s educational mission by providing strategic academic leadership in the delivery of robust, interactive, and student-centered online courses and programs. She will also lead day-to-day management for all efforts related to designing and successfully implementing all Penn Foster courses, as well as direct recruiting, professional development, and support of Penn Foster’s education team.\n“Lisa is a dedicated education and student advocate, whose innovative ideas, vision and commitment to student success are matched by her desire for education to act as a catalyst to advancement of workplace success,” said Dara Warn, Chief Outcomes Officer, Penn Foster. “We are extremely pleased that she has joined our team as we work to ensure Penn Foster continues to offer individuals the most effective career pathways that lead to successful lives.”\nRutsky brings a wealth of experience in traditional, online and blended learning in secondary and higher education to her new role. She has served as an educational consultant since 2006, focusing on online secondary and higher education school program development and continuous improvement planning for client institutions including the DEAC (Distance Education Accrediting Commission).\nDuring that time, Rutsky also served as Vice President of Education at Ashworth College/James Madison High School in Norcross, GA, where she oversaw research, development, and execution of online course delivery and instructional technology and led academic planning. Rutsky has also taught education, student success and psychology courses at online schools across the country. Among other activities, she served as a team member for AdvancED K-12 external digital learning school reviews, evaluating online K-12 programs for adherence to rigorous AdvancED standards and continuous improvement protocols.\n“I’m honored and gratified to join Penn Foster, an organization with a rich history in providing career-focused online education—and one that has made enormous effort to ensure learning optimizes student engagement, knowledge, and outcomes,” said Rutsky. “My entire career has centered on leveraging tools to advance academics at the secondary and higher education level, and I’m thrilled for the opportunity to impact success for all Penn Foster students.”\nRutsky earned a Bachelor of Science in Psychology and Master of Education in School Psychology from Georgia State University, Atlanta.\nAbout Penn Foster\nStudents, employers and partner organizations rely on Penn Foster to build the skills and knowledge to power the 21st century workforce. For over 125 years, Penn Foster has been dedicated to helping people lead more meaningful and productive lives and to improving social outcomes through education. Penn Foster provides career pathways for opportunity youth and adult learners through diverse and affordable online diploma, certificate and degree programs, offered via its high school, career school and college. With more than 30,000 graduates each year, Penn Foster's online and blended learning programs are delivered in a self-paced, competency-based model wrapped by comprehensive academic, professional and personal support and coaching. For more information, visit https://www.pennfoster.edu/ or our partners site at https://partners.pennfoster.edu/ .\n###\nBoyle Public Affairs James A. Boyle ﻿Jim@boylepublicaffairs.com 571.213.3979﻿ ﻿ Penn Foster Kate Mosteller ﻿Kate.Mosteller@pennfoster.edu﻿ 570.﻿961.4032\nSource: Penn Foster", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c221ef6f-3696-4d6a-b2f9-1f9cd2298b40", "https://www.globenewswire.com/Tracker?data=l6otvB1AfDo3PLv0dh7Bp5yXqzreHAc8KQZwBD0YFgia_xRbX6o338pxR_0OQBmIqD2fd3Ph1M9gkauhBc3_znEspR3edg-n3qLmKag3JzE=", "https://www.globenewswire.com/Tracker?data=l6otvB1AfDo3PLv0dh7Bp-zTJQqF9PWpFV6pjSmSzt4cl2ImUTQlwTAxSU5pgHPd4H_YA1MkBflX1uPkIRPW-Xu6o-v8VsNYhmmNujQI1K_d9xGUXlw9TUGMmQndTwjQ", "https://www.pennfoster.edu/", "https://partners.pennfoster.edu/"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:50:42.003+02:00", "highlightTitle": ""}