{"organizations": [], "uuid": "d6057e7134aa01c1e278c0aade7e05b3289b9684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-chile-china/china-invites-latin-america-to-take-part-in-one-belt-one-road-idUSKBN1FB2CN", "country": "US", "domain_rank": 408, "title": "China invites Latin America to take part in One Belt, One Road", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T01:07:00.000+02:00", "replies_count": 0, "uuid": "d6057e7134aa01c1e278c0aade7e05b3289b9684"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-chile-china/china-invites-latin-america-to-take-part-in-one-belt-one-road-idUSKBN1FB2CN", "ord_in_thread": 0, "title": "China invites Latin America to take part in One Belt, One Road", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "wang yi", "sentiment": "none"}], "locations": [{"name": "one road santiago", "sentiment": "none"}, {"name": "one belt", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "caribbean states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "community of latin american", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTIAGO (Reuters) - China invited Latin American and Caribbean countries to join its “One Belt, One Road” initiative on Monday, according to a draft statement seen by Reuters, as Beijing continues to diverge from the United States’ increasingly protectionist tack.\nChinese Foreign Minister Wang Yi said the region was a natural fit for the initiative, which China has leveraged to deepen economic and financial cooperation with developing nations worldwide.\n“China will always stay committed to the path of peaceful development and the win-win strategy of opening up and stands ready to share development dividends with all countries,” Wang said in opening remarks on Monday at a meeting between China and 33 members of the Community of Latin American and Caribbean States (CELAC).\nRepresentatives from China and CELAC are expected to sign a declaration later on Monday in the second time China has met with CELAC - a bloc formed in Venezuela in 2011 that does not include the United States or Canada.\nThe “One Belt, One Road” initiative, proposed in 2013 by Chinese President Xi Jinping, promotes a vision of expanding links between Asia, Africa and Europe, with billions of dollars in infrastructure investment.\nChina has sought a bigger role overseas since U.S. President Donald Trump was elected, presenting its Regional Comprehensive Economic Partnership trade agreement as an alternative to the Trans-Pacific Partnership, which the United States has abandoned.\nThe country is already testing U.S. dominance in Latin America, offering the region $250 billion in investment over the next decade. It is the top trading partner of many countries in the region, including Brazil, Chile and Argentina.\nStill, Wang played down the idea of a race for influence.\n“It has nothing to do with geopolitical competition. It follows the principle of achieving shared growth through discussion and collaboration,” Wang said in his remarks. “It is nothing like zero sum game.”\nChilean President Michelle Bachelet, whose government updated its bilateral trade deal with China a few months ago, said the forum would give “strength to the political and strategic dialogue that provides mutual benefits and contributes to a new world order.”\nWang highlighted several areas of cooperation under a potential agreement with Latin American and Caribbean nations, including better connectivity between land and sea, and cited the need to jointly build “logistic, electricity and information pathways.”\nIn recent years, Chinese companies have moved away from merely buying Latin American raw materials and are diversifying into sectors such as auto manufacturing, e-commerce and even technology businesses such as car-hailing services.\nAdditional reporting by Felipe Iturrieta; Editing by Susan Thomas\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T01:07:00.000+02:00", "crawled": "2018-01-22T19:18:55.018+02:00", "highlightTitle": ""}