{"organizations": [], "uuid": "329aa91adde63eac4d9b052c8e27947b48b96863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223197427&w=1200&r=LYNXMPEE0I02E", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-fusion/sales-of-trump-properties-suggestive-of-money-laundering-researcher-idUKKBN1F8058", "country": "US", "domain_rank": 408, "title": "Sales of Trump properties suggestive of money-laundering - researcher", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T03:27:00.000+02:00", "replies_count": 0, "uuid": "329aa91adde63eac4d9b052c8e27947b48b96863"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-fusion/sales-of-trump-properties-suggestive-of-money-laundering-researcher-idUKKBN1F8058", "ord_in_thread": 0, "title": "Sales of Trump properties suggestive of money-laundering - researcher", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jim hines", "sentiment": "none"}, {"name": "jonathan landay", "sentiment": "none"}, {"name": "schiff", "sentiment": "none"}, {"name": "glenn simpson", "sentiment": "none"}, {"name": "warren strobel", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}, {"name": "simpson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "sales of trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:30 AM / Updated 3 minutes ago Sales of Trump properties suggestive of money-laundering - researcher Jonathan Landay , Warren Strobel 5 Min Read \nWASHINGTON (Reuters) - Testimony to the U.S. Congress by the head of a political research firm indicates that the Trump Organization’s sales of properties to Russian nationals may have involved money-laundering, the top Democrat on the House Intelligence Committee said on Thursday. \nThe panel released the transcript of a Nov. 14 closed-door interview with Fusion GPS founder Glenn Simpson, whose firm hired a former British spy to research then-presidential candidate Donald Trump’s campaign ties to Russians and produced a dossier. \n“Those transcripts reveal serious allegations that the Trump Organization may have engaged in money laundering with Russian nationals,” Representative Adam Schiff said. \nThe Trump Organization dismissed the allegations as unsubstantiated. \nAnother Democrat on the Republican-controlled committee, Representative Jim Hines, sought to temper Schiff’s comment, telling CNN that Simpson “did not provide evidence and I think that’s an important point. He made allegations.” \nThe House of Representatives panel is conducting one of the three congressional investigations into possible collusion between Trump’s 2016 campaign and Russia. Special Counsel Robert Mueller is leading a separate probe by the U.S. Justice Department. Moscow denies the conclusions of U.S. intelligence agencies that it interfered in the 2016 election to help Trump and Trump denies any collusion. \nIn his testimony, Simpson said that his firm closely examined sales of condominiums in Trump properties in New York, Miami, Panama City and Toronto. \n“There were a lot of real estate deals where you couldn’t really tell who was buying the property,” Simpson said. “And sometimes properties would be bought and sold, and they would be bought for one price and sold for a loss shortly thereafter, and it really didn’t make sense to us.” \n“We saw patterns of buying and selling that we thought were suggestive of money-laundering,” he continued. \nAlan Garten, the Trump Organization’s chief counsel, said that the deals Simpson referenced primarily involve properties to which Trump licensed his name, rather than owning, developing or selling them. \n“These accusations are completely reckless and unsubstantiated for a multitude of reasons,” Garten said. \n“These issues have nothing to do with the scope of the investigation” by the House intelligence committee, Garten said in a phone interview. “But it’s not surprising the minority (Democrats) would focus on this given they’ve found absolutely no evidence of collusion.” \nSimpson, under questioning by Rep. Jackie Speier, California Democrat, also said that Russia’s operation to influence U.S. politics included attempts to infiltrate the National Rifle Association (NRA) and other conservative organizations, such as groups promoting independence for the states of Texas and California. \n“They seem to have made a very concerted effort to get in with the NRA,” Simpson said, according to the transcript. \nThe NRA did not immediately respond to a request for comment. \nEarlier this month, Democratic U.S. Senator Dianne Feinstein released Simpson’s testimony before the Senate Judiciary Committee, where she is the ranking Democrat. The panel’s Republican chairman, Chuck Grassley, had not agreed to the release. \nFusion GPS, based in Washington, hired former British spy Christopher Steele to investigate Trump’s business dealings with Russia. It first investigated Trump on behalf of the conservative Washington Free Beacon online news site and then for the Democratic National Committee. \nTrump has repeatedly criticized the dossier, which was based on Steele’s investigation, calling it “bogus” and “discredited and phony.” \nSome Republicans critical of Mueller’s investigation have said that Steele’s dossier triggered the initial probe by the Federal Bureau of Investigation. \nThey have raised questions about whether the FBI may have relied on the Steele document to improperly obtain surveillance warrants to spy on Trump’s campaign associates. \nThe testimony by Fusion GPS’s Simpson before the Senate Judiciary Committee last August contradicted those claims. \nEver since Feinstein released the testimony on Jan. 9, House Intelligence Committee Democrats have been asking that Simpson’s testimony to their committee be made public. Additional reporting by John Walcott in Washington and Mark Hosenball in London; Editing by Jonathan Oatis and Grant McCool", "external_links": [], "published": "2018-01-19T03:27:00.000+02:00", "crawled": "2018-01-19T03:48:22.000+02:00", "highlightTitle": ""}