{"organizations": [], "uuid": "9cc02bb363f110cd5114e60638726a2bf295982c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-f5-announces-appointments-to-new-strategic-positions.html", "country": "US", "domain_rank": 767, "title": "F5 Appointments to New Strategic Positions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:10:00.000+02:00", "replies_count": 0, "uuid": "9cc02bb363f110cd5114e60638726a2bf295982c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-f5-announces-appointments-to-new-strategic-positions.html", "ord_in_thread": 0, "title": "F5 Appointments to New Strategic Positions", "locations": [], "entities": {"persons": [{"name": "kara sprague", "sentiment": "none"}, {"name": "ram krishnan", "sentiment": "none"}, {"name": "françois locoh-donou", "sentiment": "none"}, {"name": "tom fountain", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "new strategic positions executives", "sentiment": "negative"}, {"name": "fountain", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Executives will lead new Application Delivery and Security business units, Corporate Strategy, and Human Resources organizations\nSEATTLE--(BUSINESS WIRE)-- F5 Networks (NASDAQ: FFIV) today announced the addition of four new executives to its leadership team, reporting directly to President and CEO François Locoh-Donou.\nKara Sprague, in the new role of Senior Vice President, General Manager of Application Delivery Controller (ADC), and Ram Krishnan, in the new role of Senior Vice President, General Manager of Security, will lead product portfolio management and product and solutions marketing for their respective business units. They will have accountability for product success from development through sales across private and public cloud, software, hardware, and emerging technologies.\nTom Fountain has been named as the Executive Vice President and Chief Strategy Officer. In this new role, Fountain will lead the company’s mergers and acquisitions program. More broadly, he will be responsible for driving the business’ long-term strategy and working cross-functionally to accelerate growth and realize F5’s vision for application delivery and security. Fountain will also oversee corporate development initiatives, business development activities, technology partnerships, and new business incubation projects.\nIn addition, Ana White has joined F5 as the company’s first Executive Vice President and Chief Human Resources Officer. With over 4,500 F5 employees worldwide, White will lead people practices and professional growth programs, recruiting and diversity, organizational development, and employee advocacy initiatives.\n“As we continue to strengthen our offerings in the cloud and security markets, executive-level management and experience expanding global teams will be a critical factor in our success,” said Locoh-Donou. “I’m thrilled with the additions of Kara, Ram, Tom and Ana to F5 and look forward to working with them to bring new, innovative solutions to market that will set us up for growth in the years to come.”\nKara Sprague joins F5 from the global management consulting firm, McKinsey and Company, where in her thirteen-year tenure she held various leadership positions across their technology practice. Most recently she led the Technology, Media, and Telecom Practice for the Western Region. Sprague also contributed content to McKinsey’s research initiatives, including the popular ‘Grow Fast or Die’ series. Prior to McKinsey, Sprague was on the engineering staff of Oracle, Agilent Technologies, and HP. A trained computer scientist and electrical engineer, she holds two master’s degrees from the Massachusetts Institute of Technology and serves on the board of Girls Who Code. She is based in the Seattle office.\nRam Krishnan has held security and cloud-related general management and product leadership roles at diverse organizations ranging from start-ups to Fortune 100 corporations. He joins F5 from CloudPassage, where he was the Chief Product Officer of their SaaS-based cloud workload security solution. Previously, Krishnan served as General Manager for HP’s Applications business and led Symantec’s Risk and Compliance business. Earlier in his career, Krishnan held product and marketing leadership roles at GuardianEdge, Elemental and Netscape. Krishnan holds a MS in computer science from Pennsylvania State University and an MBA from the Kellogg School at Northwestern University. He is based in the San Jose office.\nTom Fountain joins F5 from the security company McAfee, where he was Senior Vice President of Strategy and Corporate Development. In this role, he was responsible for defining the company’s corporate strategy, building its technology partnerships and strategic alliances, managing the business’ operations, and leading corporate development. Fountain served a central role in McAfee’s spin-out and stand-up from Intel and led multiple acquisitions for the company. Prior to McAfee, Fountain held multiple leadership roles at Juniper Networks, including General Manager of the company’s Content & Media Business Unit and Vice President of Corporate Strategy. Earlier in his career, Fountain was a principal at the venture capital firm Mayfield Fund, the co-founder of network security firm Ingrian Networks (acquired by SafeNet), and a faculty member at Stanford University where he taught electrical engineering and computer science. Fountain earned a BS in computer systems engineering, MS in electrical engineering, MS in computer science, and an MBA from Stanford University. He is based in the San Jose office.\nAna White comes to F5 from Microsoft, having successfully led global HR teams for over 18 years across multiple business units. Most recently White acted as GM of Human Resources for Microsoft’s Marketing and Consumer Business organization, with responsibility for their team’s HR strategy, talent management, diversity & inclusion, and organizational capability. In addition, she acted as the Human Resources lead on many of Microsoft’s mergers and acquisitions, including LinkedIn and Skype. Prior to Microsoft, White was a Compensation & Benefits Consultant at Willis Towers Watson and holds a BS in mathematics from Seattle University. She is based in the Seattle office.\nAll four hires have begun work at F5.\nAbout F5\nF5 ( NASDAQ: FFIV ) makes apps go faster, smarter, and safer for the world’s largest businesses, service providers, governments, and consumer brands. F5 delivers cloud and security solutions that enable organizations to embrace the application infrastructure they choose without sacrificing speed and control. For more information, go to f5.com . You can also follow @f5networks on Twitter or visit us on LinkedIn and Facebook for more information about F5, its partners, and technologies.\nF5 is a trademark or service mark of F5 Networks, Inc., in the U.S. and other countries. All other product and company names herein may be trademarks of their respective owners.\nThis press release may contain forward looking statements relating to future events or future financial performance that involve risks and uncertainties. Such statements can be identified by terminology such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" or \"continue,\" or the negative of such terms or comparable terms. These statements are only predictions and actual results could differ materially from those anticipated in these statements based upon a number of factors including those identified in the company's filings with the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005814/en/\nF5 Networks\nNathan Misner, (206) 272-7494\nn.misner@f5.com\nor\nWE Communications\nHolly Lancaster, (415) 547-7054\nhluka@we-worldwide.com\nSource: F5 Networks", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Ff5networksinc&esheet=51747982&newsitemid=20180124005814&lan=en-US&anchor=Facebook&index=5&md5=b2f6fc62b5c21c0c1faafb9312745e72", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ff5.com%2F&esheet=51747982&newsitemid=20180124005814&lan=en-US&anchor=f5.com&index=2&md5=06e457de50d76c4342f087544b647bce", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FF5Networks&esheet=51747982&newsitemid=20180124005814&lan=en-US&anchor=%40f5networks&index=3&md5=e8f00ab6695b6dee254862437fc84172", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.google.com%2Ffinance%3Fq%3DFFIV&esheet=51747982&newsitemid=20180124005814&lan=en-US&anchor=NASDAQ%3A+FFIV&index=1&md5=2a69898bf96a3f4a3acbf2b547d1e474", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ff5-networks&esheet=51747982&newsitemid=20180124005814&lan=en-US&anchor=LinkedIn&index=4&md5=f8966f84da91acaa79a2bf8ec7392082", "http://www.businesswire.com/news/home/20180124005814/en/"], "published": "2018-01-25T00:10:00.000+02:00", "crawled": "2018-01-25T02:35:57.005+02:00", "highlightTitle": ""}