{"organizations": [], "uuid": "c6703ca1c68e74d6b757571e8b2f8c12f5697347", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226857898&w=1200&r=LYNXMPEE0U0BZ", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-skat-korea-controversy/olympics-korean-skating-back-on-thin-ice-ahead-of-pyeongchang-idUSKBN1FK0P8", "country": "US", "domain_rank": 408, "title": "Olympics: Korean skating back on thin ice ahead of Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-31T15:21:00.000+02:00", "replies_count": 0, "uuid": "c6703ca1c68e74d6b757571e8b2f8c12f5697347"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-skat-korea-controversy/olympics-korean-skating-back-on-thin-ice-ahead-of-pyeongchang-idUSKBN1FK0P8", "ord_in_thread": 0, "title": "Olympics: Korean skating back on thin ice ahead of Pyeongchang", "locations": [], "entities": {"persons": [{"name": "viktor ahn", "sentiment": "none"}, {"name": "jeon myung-gyu", "sentiment": "none"}, {"name": "park geun-hye", "sentiment": "none"}], "locations": [{"name": "pyeongchang seoul", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ksu", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - Four years after the Korea Skating Union (KSU) was supposed to have cleaned up its act, allegations of favoritism and athlete mistreatment have again roiled South Korean sport just weeks ahead of the Pyeongchang Winter Olympics.\nShort track powerhouse South Korea has won 21 of the 48 gold medals awarded in the sport since it joined the Olympic program in 1992 but stories of destructive rivalries, physical abuse and favoritism have long cast a shadow over the KSU.\nPublic anger with the organization boiled over in 2014 when Viktor Ahn, who won three gold medals for Korea at the 2006 Games, won three more for Russia in Sochi, raising questions about what drove him to turn his back on his homeland.\nWith then-President Park Geun-hye demanding answers and the Sports Ministry promising to “review the entire system,” the KSU’s vice chairman Jeon Myung-gyu, widely reported to be the most powerful figure in the short track set-up, stepped down.\nThe KSU has enjoyed a period of relative calm over the last few years but with the eyes of the world trained on Korea ahead of the Feb. 9-25 Winter Games, the organization has again blackened the host’s sporting reputation.\nA short track coach was banned from the sport for life last week after admitting to physically assaulting Shim Suk-hee, one of the country’s top female skaters. [nL4N1PI39F]\nThe KSU also came under fire after speed skater Noh Seon-yeong said she no longer wanted to compete for the national team due to favoritism in the selection process after an “administrative error” almost cost her a place at the Games.\nCoupled with the fact that the KSU welcomed its former vice chairman Jeon back to the organization last year, the fresh controversies suggest the post-Sochi investigation has done little to foster long-lasting change in Korean skating.\n‘CHRONIC PROBLEMS’\nA sports ministry official told Reuters the incident involving Shim, who won gold, silver and bronze medals in Sochi, showed the KSU had not truly reformed.\n“The KSU released a statement after the Sochi Olympics saying it would undergo reform in order to fix internal chronic problems such as factionalism and unfairness in selecting athletes,” said the official.\n“But the Shim case shows those chronic problems are still there,” he added. “The problem seems to lie in the people who are running the federation, including the executive team.”\nThe surprising absence of two Russian skaters from their Olympic contingent has since allowed speed skater Noh to regain her spot at Pyeongchang but she told local media she was tired of favoritism and bias at the KSU.\nShe said Jeon had handpicked three skaters to train personally, and that the KSU had decided among themselves who was going to get the chance to skate for medals in Pyeongchang.\n“I couldn’t focus on training amid such severe discrimination,” said Noh. “This has been going on for years but everybody is hushing it up.”\nThe incidents again stoked public fury with the KSU and over 200 online petitions have been filed with the presidential Blue House calling for it to be reformed or disbanded.\nKim Sang-hang, president of the KSU, apologized on Friday and vowed to “respond sternly to violence or any other act that violates human rights” at the organization. [nL4N1PM008]\nWhile the 2014 review was aimed at cleaning up the KSU, the Sports Ministry has been unable to provide Reuters with the report findings. The official said he was unsure how or when the investigation was wrapped up.\nThe Korean Sport and Olympic Committee told Reuters it had been involved in the probe in 2014 but did not know how it ended as the Sports Ministry was in charge.\nReuters has been unable to locate any report detailing the conclusions from the Sports Ministry’s review of the KSU.\n‘NOTHING WOULD CHANGE’\nWhile the ministry official said Jeon had stepped down in 2014 because he was “embroiled in factionalism and unfairness in selecting athletes,” the KSU has said only that he resigned to take responsibility for the poor performance of the men’s short track team on Sochi, where they failed to win a medal.\nThe KSU made no mention of issues such as infighting or favoritism when Jeon resigned in 2014 and has steadfastly denied he had been biased towards athletes of certain universities or backgrounds.\nWhen asked about such issues, a KSU official only referred Reuters to the statement from its president on Friday.\n“Our president has apologised for the ongoing issues on Friday, including those involving Shim Suk-hee and Noh Seon-yeong,” he said.\n“He promised to prevent such things from happening in the future and said he would come up with measures to reform the KSU and implement them as soon as the Olympics ends.”\nProfessor Chung Hee-joon of Dong-a University’s department of physical education said the South Korean system was rife with instances of athletes being mistreated.\n”Athletes rarely speak up when this kind of thing happens,“ he told Reuters. ”Shim Suk-hee returned to her training base after the assault without reporting it to the police or a related sports agency. Why is that?\n”She probable knew nothing would change even if she had reported it.\n“You can actually describe some of the people in South Korean sport as ‘gangsters.'”\nAdditional reporting by Haejin Choi; Editing by Greg Stutchbury\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T15:21:00.000+02:00", "crawled": "2018-01-31T09:36:03.000+02:00", "highlightTitle": ""}