{"organizations": [], "uuid": "c388f94b70dc9a9b81bb71cfe063eb7990a45d07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/13/104527286-GettyImages-695654674-jeff-sessions.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/attorney-general-jeff-sessions-to-end-policy-that-let-legal-pot-flourish.html", "country": "US", "domain_rank": 767, "title": "Attorney General Jeff Sessions to end policy that let legal pot flourish", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-04T16:40:00.000+02:00", "replies_count": 0, "uuid": "c388f94b70dc9a9b81bb71cfe063eb7990a45d07"}, "author": "Saul Loeb", "url": "https://www.cnbc.com/2018/01/04/attorney-general-jeff-sessions-to-end-policy-that-let-legal-pot-flourish.html", "ord_in_thread": 0, "title": "Attorney General Jeff Sessions to end policy that let legal pot flourish", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "negative"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "capitol hill", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "the associated press", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "us senate select committee on intelligence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Attorney General Jeff Sessions has rescinded an Obama -era policy that paved the way for legalized marijuana to flourish in states across the country, creating new confusion about enforcement and use just three days after a new legalization law went into effect in California.\nPresident Donald Trump 's top law enforcement official announced the change Thursday. Instead of the previous lenient-federal-enforcement policy, Sessions' new stance will instead let federal prosecutors where marijuana is legal decide how aggressively to enforce longstanding federal law prohibiting it.\nSessions' plan drew immediate strong objection from Republican Sen. Cory Gardner of Colorado, one of eight states that have legalized marijuana for recreational use.\nGardner said in a tweet that the Justice Department \"has trampled on the will of the voters\" in Colorado and other states. He said the action would contradict what Sessions had told him before the attorney general was confirmed and that he was prepared \"to take all steps necessary\" to fight the step including holding up the confirmation of Justice Department nominees.\nCory Gardner tweet 1: .@realdonaldtrump had it right. This must be left up to the states.\nCory Gardner tweet 2: I am prepared to take all steps necessary, including holding DOJ nominees, until the Attorney General lives up to the commitment he made to me prior to his confirmation.\nSessions rescinded the policy by president Barack Obama's Justice Department that has generally barred federal law enforcement officials from interfering with marijuana sales in states where the drug is legal.\nshow chapters US to end policy that let legal marijuana flourish 4 Hours Ago | 00:58 \"In deciding which marijuana activities to prosecute under these laws with the Department's finite resources, prosecutors should follow the well-established principles that govern all federal prosecutions,\" by considering the seriousness of the crime and its impact on the community, Sessions wrote in a one-page memo to the nation's federal prosecutors.\nThe move by Trump's attorney general likely is sure to add to confusion about whether it's OK to grow, buy or use marijuana in states where the drug is legal.\nIt comes just after shops opened in California, launching what is expected to become the world's largest market for legal recreational marijuana and as polls show a solid majority of Americans believe the drug should be legal.\nWhile Sessions has been carrying out a Justice Department agenda that follows Trump's top priorities on such issues as immigration and opioids, the changes to marijuana policy reflect his own concerns. Trump's personal views on marijuana remain largely unknown.\nSessions, who has assailed marijuana as comparable to heroin and has blamed it for spikes in violence, had been expected to ramp up enforcement. Marijuana advocates argue that legalizing the drug eliminates the need for a black market and will likely reduce violence, since criminals would no longer control the marijuana trade.\nThe Obama administration in 2013 announced it would not stand in the way of states that legalize marijuana, so long as officials acted to keep it from migrating to places where it remained outlawed and keep it out of the hands of criminal gangs and children. Sessions is rescinding that memo, written by then-Deputy Attorney General James M. Cole, which had cleared up some of the uncertainty about how the federal government would respond as states began allowing sales for recreational and medical purposes.\nThe marijuana business has since become a sophisticated, multimillion-dollar industry that helps fund some government programs. Eight states and the District of Columbia have legalized marijuana for recreational use, and California's sales alone are projected to bring in $1 billion annually in tax revenue within several years.\nBut the Sessions Justice Department believed the Cole memo created a \"safe harbor\" for marijuana sales that are federally illegal, Justice Department officials said. Sessions in the memo called the Obama guidance \"unnecessary.\"\nSessions' policy will let U.S. attorneys across the country decide what kinds of federal resources to devote to marijuana enforcement based on what they see as priorities in their districts. Officials couldn't say what the ultimate impact will be on the legal industry or whether it will lead to more pot prosecutions.\nNor is it clear how the memo might affect states where marijuana is legal for medical purposes. A congressional amendment blocks the Justice Department from interfering with medical marijuana programs in states where it is allowed. Justice officials said they would follow the law, but would not preclude the possibility of medical-marijuana related prosecutions.\nSessions and some law enforcement officials in states such as Colorado blame legalization for a number of problems, including drug traffickers who have taken advantage of lax marijuana laws to illegally grow and ship the drug across state lines, where it can sell for much more. The decision was a win for marijuana opponents who had been urging Sessions to take action.\n\"There is no more safe haven with regard to the federal government and marijuana, but it's also the beginning of the story and not the end,\" said Kevin Sabet, president and CEO of Smart Approaches to Marijuana, who was among several anti-marijuana advocates who met with Sessions last month. \"This is a victory. It's going to dry up a lot of the institutional investment that has gone toward marijuana in the last five years.\"\nThreats of a federal crackdown have united liberals who object to the human costs of a war on pot with conservatives who see it as a states' rights issue. Some in law enforcement support a tougher approach, but a bipartisan group of senators in March urged Sessions to uphold existing marijuana policy. Others in Congress have been seeking ways to protect and promote legal pot businesses.\nMarijuana advocates quickly condemned Sessions' move as a return to outdated drug-war policies that unduly affected minorities.\nSessions \"wants to maintain a system that has led to tremendous injustice ... and that has wasted federal resources on a huge scale,\" said Maria McFarland Sanchez-Moreno, executive director of the Drug Policy Alliance. \"If Sessions thinks that makes sense in terms of prosecutorial priorities, he is in a very bizarre ideological state, or a deeply problematic one.\"\nA task force Sessions convened to study pot policy made no recommendations for upending the legal industry but instead encouraged Justice Department officials to keep reviewing the Obama administration's more hands-off approach to marijuana enforcement, something Sessions promised to do since he took office.\nThe change also reflects yet another way in which Sessions, who served as a federal prosecutor at the height of the drug war in Mobile, Alabama, has reversed Obama-era criminal justice policies that aimed to ease overcrowding in federal prisons and contributed to a rethinking of how drug criminals were prosecuted and sentenced. While his Democratic predecessor Eric Holder told federal prosecutors to avoid seeking long mandatory minimum sentences when charging certain lower-level drug offenders, for example, Sessions issued an order demanding the opposite, telling them to pursue the most serious charges possible against most suspects.", "external_links": [], "published": "2018-01-04T16:40:00.000+02:00", "crawled": "2018-01-04T16:40:19.014+02:00", "highlightTitle": ""}