{"organizations": [], "uuid": "3b5a4ad42a9814ed6c410d230c3d4f522b66fdc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-seasoned-restructuring-veteran-joins-houlihan-lokey-in-sydney.html", "country": "US", "domain_rank": 767, "title": "Seasoned Restructuring Veteran Joins Houlihan Lokey in Sydney", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "3b5a4ad42a9814ed6c410d230c3d4f522b66fdc8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-seasoned-restructuring-veteran-joins-houlihan-lokey-in-sydney.html", "ord_in_thread": 0, "title": "Seasoned Restructuring Veteran Joins Houlihan Lokey in Sydney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jim McKnight Joins Firm as a Managing Director\nSYDNEY--(BUSINESS WIRE)-- Houlihan Lokey, Inc. (NYSE:HLI), the global investment bank, today announced that Jim McKnight has joined the firm as a Managing Director. He is based in Sydney and will lead the firm’s Financial Restructuring efforts in Australia.\nMr. McKnight joins from Fort Street Advisers, where he was a Principal and Head of Restructuring since 2013. Prior to Fort Street Advisers, he spent more than a decade at UBS, where he was Head of Asia Pacific Restructuring and Head of Debt Advisory for Australia. Mr. McKnight has advised corporates, lenders, governments, and shareholders across a wide range of sectors, including energy, real estate, transportation, retail, infrastructure, and public-private partnerships, among others. Noteworthy restructuring engagements include the Wiggins Island Coal Export Terminal, BrisConnections, Griffin Coal, Asciano, Centro Retail Trust, GPT, Hong Kong Disneyland, SK Global, Seiyu, Network Ten, and Reliance Rail.\n“With eighteen years of experience in investment banking, and having advised on many of the most high-profile and complex restructurings in the Asia-Pacific region, Jim is a perfect candidate to join our restructuring team in Australia,” said Eric Siegert, Co-Head of Financial Restructuring at Houlihan Lokey. “Our clients in Australia are already deriving substantial value from his expertise, and I’m confident that he will continue to be of tremendous benefit to them and to Houlihan Lokey’s continued growth as we add talented, experienced bankers around the world,” he continued.\n“Houlihan Lokey’s reputation as a stellar restructuring advisor for both companies and creditors is well-known, and joining a firm that consistently leads the bankruptcy and restructuring league tables around the world was a very easy decision. The firm’s growth and momentum in Australia represent an exciting opportunity for me, and I look forward to further enhancing client service and growing the firm’s client base in the region,” said Mr. McKnight.\nMr. McKnight holds a B.Acc. from the University of Glasgow and an MBA from Strathclyde Graduate Business School. He is also a Chartered Accountant with the Institute of Chartered Accountants of Scotland.\nHoulihan Lokey (NYSE:HLI) is a global investment bank with expertise in mergers and acquisitions, capital markets, financial restructuring, valuation, and strategic consulting. The firm serves corporations, institutions, and governments worldwide with offices in the United States, Europe, the Middle East, and the Asia-Pacific region. Independent advice and intellectual rigor are hallmarks of the firm's commitment to client success across its advisory services. Houlihan Lokey is ranked as the No. 1 M&A advisor for all U.S. transactions, the No. 1 global restructuring advisor, and the No. 1 global M&A fairness opinion advisor over the past 20 years, according to Thomson Reuters.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005095/en/\nHoulihan Lokey, Inc.\nInvestor Relations\n212.331.8225\nIR@HL.com\nor\nMedia Relations\nJohn T. Gallagher\n212.331.8223\nPR@HL.com\nSource: Houlihan Lokey, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180131005095/en/"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:47:46.002+02:00", "highlightTitle": ""}