{"organizations": [], "uuid": "2c7cab1c906ee9c1ac554192f295a469b8bcc95b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-starts-2018-in-doldrums-european-stocks-groggy-idUSL8N1OX15Y", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Dollar starts 2018 in doldrums, European stocks groggy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:54:00.000+02:00", "replies_count": 0, "uuid": "2c7cab1c906ee9c1ac554192f295a469b8bcc95b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-starts-2018-in-doldrums-european-stocks-groggy-idUSL8N1OX15Y", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar starts 2018 in doldrums, European stocks groggy", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "none"}, {"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Asia shares ex-Japan cheered by upbeat China survey\n* Dollar downtrodden after suffering worst year since 2003\n* Commodities benefit from dollar weakness, China demand\n* Oil prices hover near highest since mid-2015\n* European shares squeeze down by currency strength\nBy Marc Jones\nLONDON, Jan 2 (Reuters) - The ailing dollar fell to its lowest in over three months on Tuesday, while surprisingly upbeat Chinese manufacturing data ensured there was no serious new year hangover for world shares despite a groggy start for Europe.\nSentiment was also helped by news that North Korea had offered an olive branch to South Korea, with Kim Jong Un saying he was “open to dialogue” with Seoul.\nMSCI's broadest index of world shares climbed 0.15 percent, having set scores of record highs and risen by one-fifth in value last year alone. reut.rs/2zLv6kT\nThe driver had again been Asia and its emerging markets.\nShanghai blue chips climbed 1.4 percent and MSCIs 24-country EM index jumped over 1 percent after the Caixin index of Chinese industry rose to a four-month high of 51.5 in December, confounding forecasts for a decline.\nThe reading pointed to resilience in the world’s second-largest economy even as Beijing cracks down on industrial pollution and engineers a cooling property market.\n“Manufacturing operating conditions improved in December, reinforcing the notion that economic growth has stabilized in 2017 and has even performed better than expected,” said Zhengsheng Zhong, director of macroeconomic analysis at CEBM Group.\nIn currency markets, the dollar remained out of favour having already hit a three-month low against a basket of its peers on Friday. That brought its losses for 2017 to 9.8 percent, its worse performance since 2003.\nIts pain was the euro’s gain though, with the single currency enjoying its strongest year against the dollar in 14 years.\nOn Tuesday, it jetted to a three-month top of $1.2045 as data showed that euro zone manufacturers had ramped up activity last month at the fastest pace in more than two decades.\nIt had already sliced through major resistance on the yen in Asia too, reaching highs not seen since late 2015 at 135.45 yen .\n“Forward-looking indicators bode well for the new year,” Chris Williamson, chief business economist at IHS Markit which compiled the manufacturing data, pointing to a near record pace of new orders and job creation.\nThe pound, Swiss franc and scandinavian currencies were also up solidly against the dollar.\nThat combined with a two-month high in bond yields in Germany and Italy, two of the euro zone’s biggest debt markets, pushed stock markets in London, Frankfurt and Paris 0.3-0.6 percent into the red.\nA major hurdle for the U.S. currency will be Wednesday’s release of minutes from the Federal Reserve’s December meeting when it raised interest rates. Two policymakers voted against the move amid doubts inflation would accelerate as hoped.\nWith the market now pricing in a 68 percent chance of a March hike and two hikes for 2018, there will be close inspection to assess just how shaky their confidence is for any pick-up in inflationary trends said Chris Weston, chief markets strategist at broker IG in Sydney.\n“That said, the U.S. dollar is underloved and oversold and it won’t take much to promote a bout of profit-taking from the shorts.”\nThe skid in the dollar, combined with strength in Chinese demand, has benefited commodities priced into the currency.\nCopper dipped back a little on Tuesday to $7,223.50 a tonne, but that follows a rise of 31 percent in 2017 to a four-year top. Aluminium amassed gains of 34 percent.\nGold was 0.37 percent firmer at $1,310 an ounce, after advancing by 13 percent in 2017 for its best performance in seven years.\nBrent crude oil futures ended the year with a 17 percent rise, while U.S. crude climbed 12 percent on strong demand and declining global inventories.\nOn Tuesday, Brent dipped a few cents at $66.85 a barrel, while U.S. crude firmed 3 cents to $60.47.\nAdditional reporting by Wayne Cole in Sydney; Editing by Matthew Mpoke Bigg\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2zLv6kT"], "published": "2018-01-02T17:54:00.000+02:00", "crawled": "2018-01-02T18:24:40.005+02:00", "highlightTitle": ""}