{"organizations": [], "uuid": "e52b98afc87b6cd154078e83d8db1f607bad84b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224236978&w=1200&r=LYNXMPEE0L1UK", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-sanchez/united-sign-sanchez-from-arsenal-in-swap-deal-for-mkhitaryan-idUKKBN1FB2M4", "country": "US", "domain_rank": 408, "title": "United sign Sanchez from Arsenal in swap deal for Mkhitaryan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:14:00.000+02:00", "replies_count": 0, "uuid": "e52b98afc87b6cd154078e83d8db1f607bad84b3"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-sanchez/united-sign-sanchez-from-arsenal-in-swap-deal-for-mkhitaryan-idUKKBN1FB2M4", "ord_in_thread": 0, "title": "United sign Sanchez from Arsenal in swap deal for Mkhitaryan", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "jose mourinho", "sentiment": "none"}, {"name": "mkhitaryan simon evans", "sentiment": "none"}, {"name": "mkhitaryan", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "henrikh mkhitaryan", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "united", "sentiment": "negative"}, {"name": "arsenal", "sentiment": "negative"}, {"name": "manchester city", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:53 PM / Updated 10 minutes ago United sign Sanchez from Arsenal in swap deal for Mkhitaryan Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - Manchester United have signed Chile forward Alexis Sanchez from Arsenal in a deal that involves midfielder Henrikh Mkhitaryan moving to the London club, the Premier League clubs said on Monday. \nThe 29-year-old Sanchez, who was out of contract at Arsenal at the end of the season, has joined the Old Trafford club after local rivals Manchester City had pulled out of the running. \nBritish media reported that Sanchez, who will wear the club’s iconic No. 7 shirt, had joined United on a 4-1/2-year deal, while Arsenal said that Armenian Mkhitaryan, who turned 29 on Sunday, had signed a long-term contract. \nSanchez said: “I am thrilled to be joining the biggest club in the world. The chance to play in this historic stadium and to work with Jose Mourinho was something I could not turn down. \n“I am very proud to be the first Chilean player ever to play for United’s first team and I hope I can show our fans all around the world why the club wanted to bring me here.” \nSanchez missed Arsenal’s 4-1 win over Crystal Palace on Saturday to have a medical in Manchester on Sunday. \nHe would have been available on a free transfer when his contract expired in four months’ time but once City baulked at the amount of money involved in a mid-season deal, United manager Mourinho urged his club to step in. WORLD CLASS FILE PHOTO - Soccer Football - Champions League - Manchester United Training - Aon Training Complex, Manchester, Britain - November 21, 2017 Manchester United's Henrikh Mkhitaryan during training Action Images via Reuters/Jason Cairnduff \n“Alexis is one of the best attacking players in the world and he will complete our very young and talented group of attacking players,” said Mourinho. \n“He will bring his ambition, drive and personality, qualities that make a Manchester United player and a player that makes the team stronger and the supporters proud of their club’s dimension and prestige.” \nSanchez almost joined City at the end of the August transfer window but that deal fell through as Arsenal manager Arsene Wenger was unable to sign a replacement in time. \nHe scored 80 goals in 166 appearances after the London club paid 35 million pounds ($48.83 million) for him in July 2014, and won the FA Cup in 2015 and 2017, scoring in both finals. \nMissing out on the Champions League this season was a bitter disappointment, however, followed by another blow when Chile failed to qualify for this year’s World Cup finals. Related Coverage Mourinho hoping for big return on Sanchez gamble \nA move to either of the Manchester clubs became a preferable option to signing a new contract. Arsenal wanted Mkhitaryan in exchange and he was delighted to join the London club. \n“I’m very happy that we could finish this deal and I’m very happy to be here. It’s a dream come true because I’ve always dreamed of playing for Arsenal. Now that I’m here, I’ll do my best for this club to create history,” said Mkhitaryan. \nWenger added: “Henrikh is a very complete player. He creates chances, he defends well, he can absorb distances and he’s very committed as well. I must say he’s a player who has all the attributes.” Reporting by Simon Evans; additional reporting by Steve Tongue in London; Editing by Ken Ferris and Pritha Sarkar", "external_links": [], "published": "2018-01-22T21:14:00.000+02:00", "crawled": "2018-01-22T21:31:25.011+02:00", "highlightTitle": ""}