{"organizations": [], "uuid": "d582a7b0b0e5ae7f7cd31d0357617819f602f122", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-heritage-commerce-corp-earns-24-point-0-million-for-the-full-year-of-2017.html", "country": "US", "domain_rank": 767, "title": "Heritage Commerce Corp Earns $24.0 Million for the Full Year of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:45:00.000+02:00", "replies_count": 0, "uuid": "d582a7b0b0e5ae7f7cd31d0357617819f602f122"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-heritage-commerce-corp-earns-24-point-0-million-for-the-full-year-of-2017.html", "ord_in_thread": 0, "title": "Heritage Commerce Corp Earns $24.0 Million for the Full Year of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "heritage commerce corp", "sentiment": "negative"}, {"name": "united american bank", "sentiment": "none"}, {"name": "tri-valley bank", "sentiment": "none"}, {"name": "heritage bank of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Heritage Commerce Corp (Nasdaq:HTBK), the holding company (the “Company”) for Heritage Bank of Commerce (the “Bank”), today reported that for the fourth quarter of 2017, net income was $1.4 million, or $0.04 per average diluted common, which included a $7.1 million, or ($0.18) per average diluted common share, revaluation of its deferred tax assets in the fourth quarter of 2017 as described below. Net income for the fourth quarter of 2017 also included $671,000 of pre-tax acquisition costs incurred by the Company related to the Tri-Valley Bank (OTC: TRVB) and United American Bank (OTC: UABK) proposed mergers. Net income was $7.2 million, or $0.19 per average diluted common share for the fourth quarter of 2016, and $8.6 million, or $0.22 per average diluted common share for the third quarter of 2017. For the year ended December 31, 2017, net income was $24.0 million, or $0.62 per average diluted common share, compared to $27.4 million, or $0.72 per average diluted common share, for the year ended December 31, 2016. Net interest income before provision for loan losses increased 14% to $26.4 million for the fourth quarter of 2017, compared to $23.1 million for the fourth quarter of 2016. ﻿Income before income taxes increased 22% to $14.2 million for the fourth quarter of 2017, compared to $11.6 million for the fourth quarter of 2016. For the year ended December 31, 2017, net interest income increased 11% to $101.5 million, compared to $91.2 million for the year ended December 31, 2016. For the year ended December 31, 2017, income before income taxes increased 15% to $50.5 million, compared to $44.0 million for the year ended December 31, 2016. At December 31, 2017, total assets increased 11%, total loans increased 5%, and total deposits increased 10%, compared to December 31, 2016.\nOn December 22, 2017, H.R.1, commonly known as the Tax Cuts and Jobs Act (the “Tax Act”), was signed into law, which among other items reduces the federal corporate tax rate to 21% from 35%, effective January 1, 2018. U.S. generally accepted accounting principles requires companies to revalue certain tax-related assets and liabilities as of the date of enactment of the new legislation with resulting tax effects accounted for in the reporting period of enactment. While the benefits of lower tax rates in 2018 and beyond will be substantial for U.S. corporations, balance sheet adjustments for deferred tax assets and operating results for the fourth quarter of 2017 have had a material impact on financial institutions. We have concluded that the enactment of the Tax Act caused our net deferred tax assets (“DTA”) to be revalued at the new lower tax rate. The Company performed an analysis and determined the value of the net DTA was reduced by $7.1 million, which was recognized as a one-time, non-cash, incremental income tax expense for the fourth quarter of 2017. The impact of the Tax Act on the Company’s 2017 financial results are not necessarily indicative of the results to be achieved for any future periods. However, the Company does anticipate that the reduced federal corporate tax rate of 21% will reduce the Company’s effective tax rate for financial reporting periods beginning in 2018.\n“While the fourth quarter DTA adjustment reduced earnings by $7.1 million, we expect significant benefits in 2018 from reduced tax provisions,” said Walter Kaczmarek, President and Chief Executive Officer. “Additionally, our pre-tax profit for the fourth quarter of 2017 and for the year ended December 31, 2017 was a record high at $14.2 million and $50.5 million, respectively, despite $671,000 of pre-tax acquisition costs related to the proposed mergers.”\n“As previously announced in December 2017, we entered into a definitive agreement to acquire Tri-Valley Bank, expanding our presence in the San Francisco East Bay Area. Three weeks later, in January 2018, we entered into another agreement to acquire United American Bank, extending our footprint into San Mateo County, which is just south of San Francisco,” added Mr. Kaczmarek. “Both transactions will be accretive to earnings, once transaction costs have been assimilated in the first half of 2018. Going forward, we will continue with our strategic plan to deepen our presence in the Bay Area.”\n2017 Highlights (as of, or for the periods ended December 31, 2017, compared to December 31, 2016, and September 30, 2017, except as noted):\n♦ Diluted earnings per share was $0.04 for the fourth quarter of 2017, compared to $0.19 for the fourth quarter of 2016, and $0.22 for the third quarter of 2017. For the year ended December 31, 2017 diluted earnings per share was $0.62, compared to $0.72 per diluted share for the year ended December 31, 2016. The DTA adjustment reduced earnings per share by ($0.18) for both the fourth quarter of 2017 and the year ended December 31, 2017.\n♦ Due to the DTA adjustment, the return on average tangible assets decreased to 0.19%, and the return on average tangible equity decreased to 2.43% for the fourth quarter of 2017, compared to 1.14% and 13.81%, respectively, for the fourth quarter of 2016, and 1.22% and 15.41%, respectively, for the third quarter of 2017. For the year ended December 31, 2017 the return on average tangible assets was 0.89%, and the return on average tangible equity was 11.04%, compared to 1.15% and 13.55%, respectively, for the year ended December 31, 2016.\n♦ Net interest income before provision for loan losses increased 14% to $26.4 million for the fourth quarter of 2017, compared to $23.1 million for the fourth quarter of 2016, and remained relatively flat from $26.3 million for the third quarter of 2017. For the year ended December 31, 2017, net interest income increased 11% to $101.5 million, compared to $91.2 million for the year ended December 31, 2016.\nFor the fourth quarter of 2017, the fully tax equivalent (“FTE”) net interest margin contracted 4 basis points to 3.87% from 3.91% for the fourth quarter of 2016, primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, and the impact from the issuance of subordinated debt during the second quarter of 2017. This was partially offset by an increase in the average balances of loans and securities, and the impact of increases in the prime rate on loan yields and overnight funds. The net interest margin contracted 11 basis points for the fourth quarter of 2017 from 3.98% for the third quarter of 2017, primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, and lower loan yields. The average balance of other investments and interest-bearing deposits in other financial institutions increased $72.6 million to $397.5 million for the fourth quarter of 2017, compared to $324.9 million for the fourth quarter of 2016, and increased $61.8 million from $335.7 million for the third quarter of 2017.\nFor the year ended December 31, 2017, the net interest margin (FTE) contracted 13 basis points to 3.99%, compared to 4.12% for the year ended December 31, 2016. The contraction was primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, the issuance of the subordinated debt, and a decrease in the accretion of the loan purchase discount into loan interest income from the 2015 Focus Business Bank (“Focus”) acquisition. This was partially offset by an increase in the average balances of loans and securities, and the impact of increases in the prime rate on loan yields and overnight funds. The average balance of other investments and interest-bearing deposits in other financial institutions increased $89.7 million to $318.0 million for the year ended December 31, 2017, compared to $228.3 million for the year ended December 31, 2016.\n♦ The total purchase discount on loans from the Focus loan portfolio was $5.4 million at August 20, 2015 (“the acquisition date”), of which $1.2 million was remaining as of December 31, 2017.\nThe accretion of the loan purchase discount into loan interest income from the Focus transaction was $124,000 for the fourth quarter of 2017, compared to $456,000 for the fourth quarter of 2016, and $270,000 for the third quarter of 2017.\nThe accretion of the loan purchase discount into loan interest income from the Focus transaction was $865,000 for the year ended December 31, 2017, compared to $1.5 million for the year ended December 31, 2016.\n♦ Loans, excluding loans held-for-sale, increased $80.1 million, or 5%, to $1.58 billion at December 31, 2017, compared to $1.50 billion at December 31, 2016, which included an increase of $82.8 million, or 6% in the Company’s legacy portfolio, an increase of $6.4 million of purchased commercial real estate (“CRE”) loans, partially offset by a decrease of $8.3 million of purchased residential mortgage loans, and a decrease of $790,000 in the factored receivables portfolio.\nLoans increased $16.7 million, or 1%, to $1.58 billion at December 31, 2017, compared to $1.57 billion at September 30, 2017, which included an increase of $18.9 million, or 1% in the Company’s legacy portfolio, partially offset by decrease of $1.9 million of purchased residential mortgage loans, and a decrease of $292,000 of purchased CRE loans.\n♦ The allowance for loan losses (“ALLL”) was 1.23% of total loans at December 31, 2017, compared to 1.27% at December 31, 2016, and 1.26% at September 30, 2017. The ALLL to total nonperforming loans was 782.94% at December 31, 2017, compared to 624.03% at December 31, 2016, and 565.68% at September 30, 2017.\nNonperforming assets (\"NPAs\") were $2.5 million, or 0.09% of total assets, at December 31, 2017, compared to $3.3 million, or 0.13% of total assets, at December 31, 2016, and $3.5 million, or 0.12% of total assets, at September 30, 2017.\nClassified assets were $12.6 million, or 0.44% of total assets, at December 31, 2017, compared to $13.6 million, or 0.53% of total assets, at December 31, 2016, and $10.9 million, or 0.38% of total assets, at September 30, 2017.\nNet recoveries totaled $201,000 for the fourth quarter of 2017, compared to net charge-offs of $1.2 million for the fourth quarter of 2016, and net recoveries of $236,000 for the third quarter of 2017.\nThere was a ($493,000) credit to the provision for loan losses for the fourth quarter of 2017, compared to a $240,000 provision for loan losses for the fourth quarter of 2016, and $115,000 provision for loan losses for the third quarter of 2017. There was a ($103,000) credit to the provision for loan losses for the year ended December 31, 2017, compared to a $1.2 million provision for loan losses for the year ended December 31, 2016.\nTotal deposits increased $220.8 million, or 10%, to $2.48 billion at December 31, 2017, compared to $2.26 billion at December 31, 2016, and remained relatively flat from $2.48 billion at September 30, 2017.\nThe Company’s consolidated capital ratios exceeded regulatory guidelines and the Bank’s capital ratios exceeded the regulatory guidelines for a well-capitalized financial institution under the Basel III regulatory requirements at December 31, 2017.\nWell-capitalized Fully Phased-in Financial Basel III Institution Minimal Heritage Heritage Basel III Requirement (1) Commerce Bank of Regulatory Effective CAPITAL RATIOS Corp Commerce Guidelines January 1, 2019 Total Risk-Based 14.3 % 13.2 % 10.0 % 10.5 % Tier 1 Risk-Based 11.4 % 12.2 % 8.0 % 8.5 % Common Equity Tier 1 Risk-Based 11.4 % 12.2 % 6.5 % 7.0 % Leverage 7.9 % 8.5 % 5.0 % 4.0 %\n(1) Requirements for both the Company and the Bank include a 2.5% capital conservation buffer, except the leverage ratio.\nTri-Valley Bank and United American Bank Mergers\nOn December 20, 2017, the Company announced that it signed an agreement to acquire Tri-Valley Bank (“Tri-Valley”). The transaction is valued at approximately $31.6 million. Tri-Valley shareholders will receive an exchange ratio of 0.0489 of a share of the Company’s common stock, or an aggregate of approximately 1.9 million shares. The exchange ratio is fixed and the aggregate and per share values of the merger consideration will fluctuate between the date of the agreement and the date that the merger is completed, which is expected in the second quarter of 2018. Based on the Company’s stock price of $15.76 as of December 19, 2017, the last trading day before the announcement of the transaction, total consideration for each Tri-Valley share would be $0.77. The transaction is subject to the approval of state and federal bank regulatory agencies and the shareholders of Tri-Valley and other customary closing conditions. The Company does not need to obtain shareholder approval. Tri-Valley is a full-service commercial bank headquartered in San Ramon, California, and serves businesses, non-profits, entrepreneurs and professionals primarily in California’s Tri-Valley area, specifically the cities and communities of Pleasanton, Livermore, Dublin, San Ramon and Danville in the counties of Contra Costa and Alameda.\nOn January 11, 2018, the Company announced that it signed an agreement to acquire United American Bank (“United American”). The transaction is valued at approximately $44.2 million. United American common and preferred shareholders will receive an exchange ratio of 2.1644 of a share of the Company’s common stock and each common stock equivalent underlying the United American Series D Preferred Stock and Series E Preferred Stock, or an aggregate of approximately 2.8 million shares. The exchange ratio is fixed and the aggregate and per share values of the merger consideration will fluctuate between the date of the agreement and the date that the merger is completed which is expected in the second quarter of 2018. Based on the Company’s stock price of $15.65 as of January 9, 2018, the penultimate trading day before the announcement of the transaction, total consideration for each United American share would be $33.87. Additionally, holders of Series A Preferred Stock and Series B Preferred Stock will receive $1,000 per share in cash for a total of $9.1 million at closing. The transaction is subject to the approval of state and federal bank regulatory agencies and the shareholders of United American and other customary closing conditions. The Company does not need to obtain shareholder approval. United American Bank is a full-service commercial bank located in San Mateo County with full-service branches located in San Mateo, Redwood City and Half Moon Bay, California. The bank is dedicated to providing quality banking and financial services to businesses, professionals and individuals who prefer a high level of personalized client service and management.\nAt December 31, 2017, Tri-Valley had approximately $145.5 million in assets, $122.6 million in net loans and $126.6 million in deposits. At December 31, 2017, United American had approximately $330.3 million in assets, $225.9 million in net loans and $296.1 million in deposits. At December 31, 2017, on a pro forma consolidated basis the combined company, including the Company, Tri-Valley, and United American, would have approximately $3.3 billion in total assets, $1.9 billion in total loans, and $2.9 billion in total deposits. The pre-tax acquisition costs incurred by the Company related to the proposed mergers totaled $671,000 during the fourth quarter of 2017 and the year ended December 31, 2017.\nOperating Results\nNet interest income increased 14% to $26.4 million for the fourth quarter of 2017, compared to $23.1 million for the fourth quarter of 2016, and remained relatively flat from $26.3 million for the third quarter of 2017. Net interest income increased 11% to $101.5 million for the year ended December 31, 2017, compared to $91.2 million for the year ended December 31, 2016. The increase in net interest income for the fourth quarter of 2017 and for the year ended December 31, 2017, compared to the respective periods in 2016, was primarily due to an increase in the average balance of loans, investment securities, and other interest earning assets.\nFor the fourth quarter of 2017, the net interest margin (FTE) contracted 4 basis points to 3.87%, from 3.91% for the fourth quarter of 2016, primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, and the impact from the issuance of subordinated debt during the second quarter of 2017. This was partially offset by an increase in the average balances of loans and securities, and the impact of increases in the prime rate on loan yields and overnight funds. The net interest margin contracted 11 basis points for the fourth quarter of 2017 from 3.98% for the third quarter of 2017, primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, and lower loan yields. The average balance of other investments and interest-bearing deposits in other financial institutions increased $72.6 million to $397.5 million for the fourth quarter of 2017, compared to $324.9 million for the fourth quarter of 2016, and increased $61.8 million from $335.7 million for the third quarter of 2017.\nFor the year ended December 31, 2017, the net interest margin (FTE) contracted 13 basis points to 3.99%, compared to 4.12% for the year ended December 31, 2016. The contraction was primarily due to a higher average balance of lower yielding excess funds at the Federal Reserve Bank, the issuance of subordinated debt, and a decrease in the accretion of the loan purchase discount into loan interest income from the Focus acquisition. This was partially offset by an increase in the average balances of loans and securities, and the impact of increases in the prime rate on loan yields and overnight funds. The average balance of other investments and interest-bearing deposits in other financial institutions increased $89.7 million to $318.0 million for the year ended December 31, 2017, compared to $228.3 million for the year ended December 31, 2016.\nThere was a ($493,000) credit to the provision for loan losses for the fourth quarter of 2017, compared to a provision for loan losses of $240,000 for the fourth quarter of 2016, and a provision for loan losses of $115,000 for the third quarter of 2017. There was a ($103,000) credit to the provision for loan losses for the year ended December 31, 2017, compared to a provision for loan losses of $1.2 million for the year ended December 31, 2016.\nTotal noninterest income was $2.6 million for the fourth quarter of 2017, compared to $3.0 million for the fourth quarter of 2016 and $2.5 million for the third quarter of 2017. The decrease in noninterest income for the fourth quarter of 2017, compared to the fourth quarter of 2016, was primarily due to a $572,000 gain on sales of securities in the fourth quarter of 2016 not being repeated for the fourth quarter of 2017, partially offset by a $330,000 increase in gain on sales of SBA loans. For the year ended December 31, 2017, total noninterest income was $9.6 million, compared to $11.6 million for the year ended December 31, 2016. The decrease in total noninterest income for the year ended December 31, 2017, compared to the year ended December 31, 2016, was primarily due to a $1.1 million gain on proceeds from company-owned life insurance and a $1.1 million gain on sales of securities in the year ended December 31, 2016, and lower servicing income in the year ended December 31, 2017. The decrease was partially offset by increases in fee income from Bay View Funding during the year ended December 31, 2017, which is included in other noninterest income within the consolidated income statements.\nTotal noninterest expense for the fourth quarter of 2017 was $15.3 million, compared to $14.3 million for the fourth quarter of 2016, and $14.8 million for the third quarter of 2017. Total noninterest expense for the year ended December 31, 2017 was $60.7 million, compared to $57.6 million for the year ended December 31, 2016. The increase in total noninterest expense in the fourth quarter of 2017 and the year ended December 2017, compared to the respective periods in 2016, was primarily due to higher salaries and employee benefits as a result of annual salary increases and hiring additional employees, and costs related to the merger transactions, partially offset by lower professional fees. The increase in noninterest expense for the fourth quarter of 2017, compared to the third quarter of 2017, was primarily due to costs related to the merger transactions during the fourth quarter of 2017. The pre-tax acquisition costs incurred by the Company related to the proposed mergers totaled $671,000 during the fourth quarter of 2017 and the year ended December 31, 2017. Full time equivalent employees were 278 at December 31, 2017, 263 at December 31, 2016, and 282 at September 30, 2017.\nThe efficiency ratio for the fourth quarter of 2017 was 52.82%, compared to 54.57% for the fourth quarter of 2016, and 51.54% for the third quarter of 2017. The efficiency ratio for the year ended December 31, 2017 improved to 54.65%, compared to 56.04% for the year ended December 31, 2016.\nOn December 22, 2017, the Tax Act was signed into law, which among other items reduces the federal corporate tax rate to 21% from 35%, effective January 1, 2018. U.S. generally accepted accounting principles requires companies to revalue certain tax-related assets and liabilities as of the date of enactment of the new legislation with resulting tax effects accounted for in the reporting period of enactment. We have concluded that the enactment of the Tax Act caused our net DTA to be revalued at the new lower tax rate. The Company has performed an analysis and determined the value of the net DTA was reduced by $7.1 million, which was recognized as a one-time, non-cash, incremental income tax expense for the fourth quarter of 2017.\nIncome tax expense for the fourth quarter of 2017 increased to $12.8 million, compared to $4.4 million for the fourth quarter of 2016, and $5.2 million for the third quarter of 2017. Income tax expense for the year ended December 31, 2017 increased to $26.5 million, compared to $16.6 million for the year ended December 31, 2016. Excluding the DTA adjustment, income tax expense was $5.7 million for the fourth quarter of 2017 and $19.4 million for the year ended December 31, 2017. The effective tax rate for the fourth quarter of 2017 was 90.2%, compared to 38.0% for the fourth quarter of 2016, and 37.9% for the third quarter of 2017. The effective tax rate for the year ended December 31, 2017 was 52.6%, compared to 37.7% for the year ended December 31, 2016. Excluding the DTA adjustment, the effective tax rate was 40.2% for the fourth quarter of 2017 and 38.5% for the year ended December 31, 2017. The effective tax rate for the fourth quarter of 2017 was also higher due to some of the acquisition costs related to the Tri-Valley and United American transactions which are not tax deductible. The difference in the effective tax rate for the periods reported compared to the combined Federal and state statutory tax rate of 42%, is primarily the result of the Company’s investment in life insurance policies whose earnings are not subject to taxes, tax credits related to investments in low income housing limited partnerships (net of low income housing investment losses), and tax-exempt interest income earned on municipal bonds.\nBalance Sheet Review, Capital Management and Credit Quality\nTotal assets increased 11% to $2.84 billion at December 31, 2017, compared to $2.57 billion at December 31, 2016, and remained relatively flat $2.84 billion at September 30, 2017.\nSecurities available-for-sale, at fair value, totaled $391.9 million at December 31, 2017, compared to $306.6 million at December 31, 2016, and $390.1 million at September 30, 2017. At December 31, 2017, the Company’s securities available-for-sale portfolio was comprised of $374.8 million agency mortgage-backed securities (all issued by U.S. Government sponsored entities), and $17.1 million of single entity issue trust preferred securities. The pre-tax unrealized loss on securities available-for-sale at December 31, 2017 was ($1.5) million, compared to a pre-tax unrealized loss on securities available-for-sale of ($2.0) million at December 31, 2016, and a pre-tax unrealized gain on securities available-for-sale of $1.0 million at September 30, 2017. All other factors remaining the same, when market interest rates are rising, the Company will experience a lower unrealized gain (or a higher unrealized loss) on the securities portfolio. During the fourth quarter of 2017, the Company purchased $21.3 million of agency mortgage-backed investment securities available-for-sale, with a weighted average book yield of 2.43%, and a weighted average duration of 4.57 years.\nAt December 31, 2017, securities held-to-maturity, at amortized cost, totaled $398.3 million, compared to $324.0 million at December 31, 2016, and $379.5 million at September 30, 2017. At December 31, 2017, the Company’s securities held-to-maturity portfolio was comprised of $309.6 million agency mortgage-backed securities, and $88.7 million tax-exempt municipal bonds. During the fourth quarter of 2017, the Company purchased $31.0 million of agency mortgage-backed securities held-to-maturity, with a weighted average book yield of 2.66%, and a weighted average duration of 5.21 years.\nLoans, excluding loans held-for-sale, increased $80.1 million, or 5%, to $1.58 billion at December 31, 2017, compared to $1.50 billion at December 31, 2016, which included an increase of $82.8 million, or 6% in the Company’s legacy portfolio, an increase of $6.4 million of purchased commercial real estate (“CRE”) loans, partially offset by a decrease of $8.3 million of purchased residential mortgage loans, and a decrease of $790,000 in the factored receivables portfolio. Loans increased $16.7 million, or 1%, to $1.58 billion at December 31, 2017, compared to $1.57 billion at September 30, 2017, which included an increase of $18.9 million, or 1% in the Company’s legacy portfolio, partially offset by repayments of $1.9 million of purchased residential mortgage loans, and repayments of $292,000 of purchased CRE loans.\nThe loan portfolio remains well-diversified with commercial and industrial (“C&I”) loans accounting for 36% of the loan portfolio at December 31, 2017, which included $48.8 million of factored receivables. CRE loans accounted for 49% of the total loan portfolio, of which 41% were occupied by businesses that own them. Land and construction loans accounted for 6%, consumer and home equity loans accounted for 6% of total loans of total loans, and residential mortgage loans accounted for the remaining 3% of total loans at December 31, 2017.\nThe commercial loan portfolio of $573.3 million at December 31, 2017 decreased $31.0 million from $604.3 million at December 31, 2016, and decreased $14.0 million from $587.3 million at September 30, 2017. C&I line usage was 37% at December 31, 2017, compared to 42% at December 31, 2016, and 37% at September 30, 2017.\nThe CRE loan portfolio increased $110.6 million, or 17%, to $772.9 million at December 31, 2017, compared to $662.2 million at December 31, 2016, which included an increase of $104.3 million, or 17%, in the Company’s legacy portfolio, and an increase of $6.3 million of purchased CRE loans. The CRE loan portfolio increased $18.0 million, or 2%, from $754.9 million at September 30, 2017, primarily due to an increase in the Company’s legacy portfolio.\nThe average yield on the loan portfolio increased to 5.64% for the fourth quarter of 2017, compared to 5.46% for the fourth quarter of 2016, primarily due to increases in the prime rate, partially offset by a decrease in the accretion of the loan purchase discount into loan interest income from the Focus transaction. The average yield on the loan portfolio decreased from 5.72% for the third quarter of 2017. The average yield on the Company’s legacy loan portfolio (excluding the purchased residential loans, purchased CRE loans, factored receivables portfolio, and accretion of the loan purchase discount from the Focus transaction) increased 32 basis points for the fourth quarter of 2017, compared to the fourth quarter of 2016, and decreased 6 basis point from the third quarter of 2017. The average yield on the purchased residential loans was 2.72% for the fourth quarter of 2017, compared to 2.64% for the fourth quarter of 2016, and 2.67% for the third quarter of 2017. The average yield on the purchased CRE loans was 3.52% for the fourth quarter of 2017, the fourth quarter of 2016, and the third quarter of 2017.\nThe average yield on the loan portfolio increased to 5.64% for the year ended December 31, 2017, compared to 5.57% for the year ended December 31, 2016, primarily due to increases in the prime rate, partially offset by the impact of the lower yielding purchased residential mortgage loans and purchased CRE loans, a lower yield on the factored receivables portfolio, and a decrease in the accretion of the loan purchase discount into loan interest income from the Focus transaction. The average yield on the Company’s legacy loan portfolio (excluding the purchased residential loans, purchased CRE loans, factored receivables portfolio, and accretion of the loan purchase discount from the Focus transaction) increased 27 basis points for the year ended December 31, 2017, compared to the year ended December 31, 2016. The average yield on the purchased residential loans was 2.68% for the year ended December 31, 2017, compared to 2.85% for the year ended December 31, 2016. The yield on the purchased CRE loans was 3.51% for the year ended December 31, 2017, compared to 3.52% for the year ended December 31, 2016.\nThe accretion of the loan purchase discount in loan interest income from the Focus transaction was $124,000 for the fourth quarter of 2017, compared to $456,000 for the fourth quarter of 2016, and $270,000 for the third quarter of 2017. The accretion of the loan purchase discount into loan interest income from the Focus transaction was $865,000 for the year ended December 31, 2017, compared to $1.5 million for the year ended December 31, 2016. The total purchase discount on loans from the Focus loan portfolio was $5.4 million at the acquisition date, of which $1.2 million was remaining as of December 31, 2017.\nAt December 31, 2017, NPAs were $2.5 million, or 0.09% of total assets, compared to $3.3 million, or 0.13% of total assets, at December 31, 2016, and $3.5 million, or 0.12% of total assets, at September 30, 2017. There were no foreclosed assets at December 31, 2017, compared to foreclosed assets of $229,000 at December 31, 2016, and no foreclosed assets at September 30, 2017. The following is a breakout of NPAs at the periods indicated:\nEnd of Period: NONPERFORMING ASSETS December 31, 2017 September 30, 2017 December 31, 2016 (in $000’s, unaudited) Balance % of Total Balance % of Total Balance % of Total Commercial and industrial loans $ 1,084 44 % $ 1,206 35 % $ 2,097 64 % CRE loans 501 20 % 501 14 % 419 13 % Home equity and consumer loans 380 15 % 389 11 % 270 8 % Restructured and loans over 90 days past due and still accruing 235 9 % 931 27 % — 0 % SBA loans 166 7 % 281 8 % 74 2 % Land and construction loans 119 5 % 183 5 % 199 6 % Foreclosed assets — 0 % — — % 229 7 % Total nonperforming assets $ 2,485 100 % $ 3,491 100 % $ 3,288 100 % Classified assets were $12.6 million at December 31, 2017, compared to $13.6 million at December 31, 2016, and $10.9 million at September 30, 2017.\nThe following table summarizes the allowance for loan losses:\nFor the Quarter Ended For the Year Ended ALLOWANCE FOR LOAN LOSSES December 31, September 30, December 31, December 31, December 31, (in $000’s, unaudited) 2017\n2017 2016 2017 2016 Balance at beginning of period $ 19,748\n$ 19,397 $ 20,032 $ 19,089 $ 18,926 Provision (credit) for loan losses during the period (493) 115 240 (103) 1,237 Net recoveries (charge-offs) during the period 201 236 (1,183) 470 (1,074) Balance at end of period $ 19,456 $ 19,748 $ 19,089 $ 19,456 $ 19,089 Total loans, net of deferred fees $ 1,582,667 $ 1,565,950 $ 1,502,607 $ 1,582,667 $ 1,502,607 Total nonperforming loans $ 2,485 $ 3,491 $ 3,059 $ 2,485 $ 3,059 Allowance for loan losses to total loans 1.23 % 1.26 % 1.27 % 1.23 % 1.27 % Allowance for loan losses to total nonperforming loans 782.94 % 565.68 % 624.03 % 782.94 % 624.03 % The ALLL at December 31, 2017 was 1.23% of total loans, compared to 1.27% at December 31, 2016, and 1.26% at September 30, 2017. The ALLL to total nonperforming loans was 782.94% at December 31, 2017, compared to 624.03% at December 31, 2016, and 565.68% at September 30, 2017.\nTotal deposits increased $220.8 million, or 10%, to $2.48 billion at December 31, 2017, compared to $2.26 billion at December 31, 2016, and remained relatively flat from $2.48 billion at September 30, 2017. Deposits, excluding all time deposits and CDARS deposits, increased $244.6 million, or 12%, to $2.28 billion at December 31 2017, from $2.03 billion at December 31, 2016, and increased $13.1 million, or 1%, from $2.26 billion at September 30, 2017.\nThe cost of total deposits increased two basis points to 0.17% for the fourth quarter of 2017, compared to 0.15% for the fourth quarter of 2016, and remained the same at 0.17% for the third quarter of 2017. The cost of total deposits was 0.17% for the year ended December 31, 2017, and 0.15% for the year ended December 31, 2016.\nSubordinated debt, net of unamortized issuance costs, totaled $39.2 million at December 31, 2017, and qualifies as Tier 2 capital for the Company under the guidelines established by the Federal Reserve Bank. The issuance of subordinated debt during the second quarter of 2017 resulted in an increase in the Company’s total risk‑based capital ratio at December 31, 2017, compared to December 31, 2016, but had no effect on the other regulatory capital ratios of the Company. All of the Bank’s regulatory capital ratios increased at December 31, 2017, compared to December 31, 2016, primarily due to the downstream of $20.0 million of the proceeds of the subordinated debt from the Company to the Bank, partially offset by distributed dividends totaling $16.0 million from the Bank to the Company during the year ended December 31, 2017.\nTangible equity was $220.1 million at December 31, 2017, compared to $207.2 million at December 31, 2016, and $223.9 million at September 30, 2017. Tangible book value per share was $5.76 at December 31, 2017, compared to $5.46 at December 31, 2016, and $5.86 at September 30, 2017. The decrease in tangible book value per share at December 31, 2017, compared to September 30, 2017, was primarily due to the DTA adjustment.\nHeritage Commerce Corp , a bank holding company established in February 1998, is the parent company of Heritage Bank of Commerce, established in 1994 and headquartered in San Jose, CA with full-service branches in Danville, Fremont, Gilroy, Hollister, Los Altos, Los Gatos, Morgan Hill, Pleasanton, San Jose, Sunnyvale, and Walnut Creek. Heritage Bank of Commerce is an SBA Preferred Lender. Bay View Funding, a subsidiary of Heritage Bank of Commerce, is based in Santa Clara, CA and provides business-essential working capital factoring financing to various industries throughout the United States. For more information, please visit www.heritagecommercecorp.com .\nForward-Looking Statement Disclaimer\nThese forward-looking statements are subject to various risks and uncertainties that may be outside our control and our actual results could differ materially from our projected results. Risks and uncertainties that could cause our financial performance to differ materially from our goals, plans, expectations and projections expressed in forward-looking statements include those set forth in our filings with the Securities and Exchange Commission, Item 1A of the Company’s Annual Report on Form 10-K, and the following: (1) current and future economic and market conditions in the United States generally or in the communities we serve, including the effects of declines in property values, high unemployment rates and overall slowdowns in economic growth should these events occur; (2) effects of and changes in trade, monetary and fiscal policies and laws, including the interest rate policies of the Federal Open Market Committee of the Federal Reserve Board; (3) changes in inflation, interest rates, and market liquidity which may impact interest margins and impact funding sources; (4) volatility in credit and equity markets and its effect on the global economy; (5) changes in the competitive environment among financial or bank holding companies and other financial service providers; (6) changes in consumer and business spending and saving habits and the related effect on our ability to increase assets and to attract deposits; (7) our ability to develop and promote customer acceptance of new products and services in a timely manner; (8) risks associated with concentrations in real estate related loans; (9) an oversupply of inventory and deterioration in values of California commercial real estate; (10) a prolonged slowdown in construction activity; (11) other than temporary impairment charges to our securities portfolio; (12) changes in the level of nonperforming assets and charge-offs and other credit quality measures, and their impact on the adequacy of the Company’s allowance for loan losses and the Company’s provision for loan losses; (13) our ability to raise capital or incur debt on reasonable terms; (14) regulatory limits on Heritage Bank of Commerce’s ability to pay dividends to the Company; (15) changes in our capital management policies, including those regarding business combinations, dividends, and share repurchases, among others; (16) operational issues stemming from, and/or capital spending necessitated by, the potential need to adapt to industry changes in information technology systems, on which we are highly dependent; (17) our ability to keep pace with technological changes, including our ability to identify and address cyber-security risks such as data security breaches, “denial of service” attacks, “hacking” and identity theft; (18) inability of our framework to manage risks associated with our business, including operational risk and credit risk; (19) risks of loss of funding of Small Business Administration or SBA loan programs, or changes in those programs; (20) effect and uncertain impact on the Company of the enactment of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 and the rules and regulations promulgated by supervisory and oversight agencies implementing the new legislation; (21) significant changes in applicable laws and regulations, including those concerning taxes, banking and securities; (22) effect of changes in accounting policies and practices, as may be adopted by the regulatory agencies, as well as the Public Company Accounting Oversight Board, the Financial Accounting Standards Board and other accounting standard setters; (23) costs and effects of legal and regulatory developments, including resolution of legal proceedings or regulatory or other governmental inquiries, and the results of regulatory examinations or reviews; (24) availability of and competition for acquisition opportunities; (25) risks associated with the Tri-Valley Bank and United American Bank mergers, including obtaining related regulatory approvals and shareholder approvals, and the integration of Tri-Valley Bank and United American Bank; (26) risks resulting from domestic terrorism; (27) risks of natural disasters and other events beyond our control; and (28) our success in managing the risks involved in the foregoing factors.\nMember FDIC\nFor the Quarter Ended: Percent Change From: For the Year Ended: CONSOLIDATED INCOME STATEMENTS December 31, September 30, December 31, September 30, December 31, December 31, December 31, Percent (in $000’s, unaudited) 2017 2017 2016 2017 2016 2017 2016 Change Interest income $ 28,152 $ 27,955 $ 23,991 1 % 17 % $ 106,911 $ 94,431 13 % Interest expense 1,708 1,634 867 5 % 97 % 5,387 3,211 68 % Net interest income before provision for loan losses 26,444 26,321 23,124 0 % 14 % 101,524 91,220 11 % Provision (credit) for loan losses (493 ) 115 240 (529) % (305) % (103 ) 1,237 (108) % Net interest income after provision for loan losses 26,937 26,206 22,884 3 % 18 % 101,627 89,983 13 % Noninterest income: Service charges and fees on deposit accounts 821 869 768 (6) % 7 % 3,231 3,116 4 % Gain on sales of SBA loans 473 147 143 222 % 231 % 1,108 796 39 % Increase in cash surrender value of life insurance 407 417 430 (2) % (5) % 1,666 1,747 (5) % Servicing income 237 246 292 (4) % (19) % 973 1,398 (30) % Gain on proceeds from company- owned life insurance — — 100 N/A (100) % — 1,119 (100) % Gain (loss) on sales of securities — — 572 N/A (100) % (6 ) 1,099 (101) % Other 626 781 734 (20) % (15) % 2,640 2,350 12 % Total noninterest income 2,564 2,460 3,039 4 % (16) % 9,612 11,625 (17) % Noninterest expense: Salaries and employee benefits 9,263 9,071 8,608 2 % 8 % 37,029 34,660 7 % Occupancy and equipment 1,152 1,142 1,101 1 % 5 % 4,578 4,378 5 % Professional fees 543 695 852 (22) % (36) % 2,982 3,471 (14) % Other 4,364 3,926 3,716 11 % 17 % 16,149 15,130 7 % Total noninterest expense 15,322 14,834 14,277 3 % 7 % 60,738 57,639 5 % Income before income taxes 14,179 13,832 11,646 3 % 22 % 50,501 43,969 15 % Income tax expense 12,796 5,249 4,431 144 % 189 % 26,548 16,588 60 % Net income 1,383 8,583 7,215 (84) % (81) % 23,953 27,381 (13) % Dividends on preferred stock — — — N/A N/A — (1,512 ) (100) % Net income available to common shareholders 1,383 8,583 7,215 (84) % (81) % 23,953 25,869 (7) % Undistributed earnings allocated to Series C preferred stock — — — N/A N/A — (1,278 ) (100) % Distributed and undistributed earnings allocated to common shareholders $ 1,383 $ 8,583 $ 7,215 (84) % (81) % $ 23,953 $ 24,591 (3) % PER COMMON SHARE DATA (unaudited) Basic earnings per share $ 0.04 $ 0.22 $ 0.19 (82) % (79) % $ 0.63 $ 0.72 (13) % Diluted earnings per share $ 0.04 $ 0.22 $ 0.19 (82) % (79) % $ 0.62 $ 0.72 (14) % Weighted average shares outstanding - basic 38,200,325 38,152,633 37,931,317 0 % 1 % 38,095,250 33,933,806 12 % Weighted average shares outstanding - diluted 38,742,454 38,581,298 38,270,110 0 % 1 % 38,610,815 34,219,121 13 % Common shares outstanding at period-end 38,200,883 38,199,006 37,941,007 0 % 1 % 38,200,883 37,941,007 1 % Dividend per share $ 0.10 $ 0.10 $ 0.09 0 % 11 % $ 0.40 $ 0.36 11 % Book value per share $ 7.10 $ 7.21 $ 6.85 (2) % 4 % $ 7.10 $ 6.85 4 % Tangible book value per share $ 5.76 $ 5.86 $ 5.46 (2) % 5 % $ 5.76 $ 5.46 5 % KEY FINANCIAL RATIOS (unaudited) Annualized return on average equity 1.98 % 12.49 % 11.01 % (84) % (82) % 8.91 % 10.71 % (17) % Annualized return on average tangible equity 2.43 % 15.41 % 13.81 % (84) % (82) % 11.04 % 13.55 % (19) % Annualized return on average assets 0.19 % 1.20 % 1.12 % (84) % (83) % 0.87 % 1.13 % (23) % Annualized return on average tangible assets 0.19 % 1.22 % 1.14 % (84) % (83) % 0.89 % 1.15 % (23) % Net interest margin (fully tax equivalent) 3.87 % 3.98 % 3.91 % (3) % (1) % 3.99 % 4.12 % (3) % Efficiency ratio 52.82 % 51.54 % 54.57 % 2 % (3) % 54.65 % 56.04 % (2) % AVERAGE BALANCES (in $000’s, unaudited) Average assets $ 2,925,001 $ 2,836,807 $ 2,572,595 3 % 14\n% $ 2,755,618 $ 2,425,201 14\n% Average tangible assets $ 2,873,576 $ 2,785,092 $ 2,519,733 3 % 14\n% $ 2,703,686 $ 2,371,756 14\n% Average earning assets $ 2,743,706 $ 2,657,081 $ 2,381,141 3 % 15\n% $ 2,575,869 $ 2,244,169 15\n% Average loans held-for-sale $ 4,030 $ 3,737 $ 6,074 8 % (34) % $ 4,634 $ 4,947 (6) % Average total loans $ 1,558,976 $ 1,556,684 $ 1,455,558 0 % 7\n% $ 1,527,288 $ 1,417,760 8\n% Average deposits $ 2,550,500 $ 2,470,015 $ 2,245,336 3 % 14\n% $ 2,405,717 $ 2,110,458 14\n% Average demand deposits - noninterest-bearing $ 1,002,808 $ 980,554 $ 898,367 2 % 12\n% $ 944,275 $ 824,763 14\n% Average interest-bearing deposits $ 1,547,692 $ 1,489,461 $ 1,346,969 4 % 15\n% $ 1,461,442 $ 1,285,695 14\n% Average interest-bearing liabilities $ 1,586,940 $ 1,528,665 $ 1,347,032 4 % 18\n% $ 1,484,783 $ 1,286,185 15\n% Average equity $ 277,535 $ 272,666 $ 260,723 2 % 6\n% $ 268,890 $ 255,587 5\n% Average tangible equity $ 226,110 $ 220,951 $ 207,861 2 % 9\n% $ 216,958 $ 202,142 7\n%\nEnd of Period: Percent Change From: CONSOLIDATED BALANCE SHEETS December 31, September 30, December 31, September 30, December 31, (in $000’s, unaudited) 2017 2017 2016 2017 2016 ASSETS Cash and due from banks $ 31,681 $ 37,133 $ 27,993 (15) % 13 % Other investments and interest-bearing deposits in other financial institutions 284,541 308,987 238,110 (8) % 19 % Securities available-for-sale, at fair value 391,852 390,107 306,589 0 % 28 % Securities held-to-maturity, at amortized cost 398,341 379,550 324,010 5 % 23 % Loans held-for-sale - SBA, including deferred costs 3,419 4,602 5,705 (26) % (40) % Loans: Commercial 573,296 587,276 604,331 (2) % (5) % Real estate: CRE 772,867 754,856 662,228 2 % 17 % Land and construction 100,882 92,310 81,002 9 % 25 % Home equity 79,176 74,171 82,459 7 % (4) % Residential mortgages 44,561 46,489 52,887 (4) % (16) % Consumer 12,395 11,749 20,460 5 % (39) % Loans 1,583,177 1,566,851 1,503,367 1 % 5 % Deferred loan fees, net (510 ) (901 ) (760 ) (43) % (33) % Total loans, net of deferred fees 1,582,667 1,565,950 1,502,607 1 % 5 % Allowance for loan losses (19,456 ) (19,748 ) (19,089 ) (1) % 2 % Loans, net 1,563,211 1,546,202 1,483,518 1 % 5 % Company-owned life insurance 60,814 60,407 59,148 1 % 3 % Premises and equipment, net 7,353 7,539 7,490 (2) % (2) % Goodwill 45,664 45,664 45,664 0 % 0 % Other intangible assets 5,589 5,867 6,950 (5) % (20) % Accrued interest receivable and other assets 51,112 57,890 65,703 (12) % (22) % Total assets $ 2,843,577 $ 2,843,948 $ 2,570,880 0 % 11 % LIABILITIES AND SHAREHOLDERS’ EQUITY Liabilities: Deposits: Demand, noninterest-bearing $ 989,753 $ 943,723 $ 917,187 5 % 8 % Demand, interest-bearing 601,929 605,301 541,282 (1) % 11 % Savings and money market 684,131 713,693 572,743 (4) % 19 % Time deposits-under $250 51,710 53,479 57,857 (3) % (11) % Time deposits-$250 and over 138,634 147,422 163,670 (6) % (15) % CDARS - money market and time deposits 16,832 16,986 9,401 (1) % 79 % Total deposits 2,482,989 2,480,604 2,262,140 0 % 10 % Subordinated debt, net of issuance costs 39,183 39,137 — 0 % N/A Accrued interest payable and other liabilities 50,041 48,762 48,890 3 % 2 % Total liabilities 2,572,213 2,568,503 2,311,030 0 % 11 % Shareholders’ Equity 271,364 275,445 259,850 (1) % 4 % Total liabilities and shareholders’ equity $ 2,843,577 $ 2,843,948 $ 2,570,880 0 % 11 %\nEnd of Period: Percent Change From: CREDIT QUALITY DATA December 31, September 30, December 31, September 30, December 31, (in $000’s, unaudited) 2017 2017 2016 2017 2016 Nonaccrual loans - held-for-investment $ 2,250 $ 2,560 $ 3,059 (12) % (26) % Restructured and loans over 90 days past due and still accruing 235 931 — (75) % N/A Total nonperforming loans 2,485 3,491 3,059 (29) % (19) % Foreclosed assets — — 229 N/A (100) % Total nonperforming assets $ 2,485 $ 3,491 $ 3,288 (29) % (24) % Other restructured loans still accruing $ 289 $ 325 $ 131 (11) % 121 % Net charge-offs (recoveries) during the quarter $ (201 ) $ (236 ) $ 1,183 (15) % 117 % Provision (credit) for loan losses during the quarter $ (493 ) $ 115 $ 240 (529) % (305) % Allowance for loan losses $ 19,456 $ 19,748 $ 19,089 (1) % 2 % Classified assets $ 12,557 $ 10,909 $ 13,553 15 % (7) % Allowance for loan losses to total loans 1.23 % 1.26 % 1.27 % (2) % (3) % Allowance for loan losses to total nonperforming loans 782.94 % 565.68 % 624.03 % 38 % 25 % Nonperforming assets to total assets 0.09 % 0.12 % 0.13 % (25) % (31) % Nonperforming loans to total loans 0.16 % 0.22 % 0.20 % (27) % (20) % Classified assets to Heritage Commerce Corp Tier 1 capital plus allowance for loan losses 5 % 4 % 6 % 25 % (17) % Classified assets to Heritage Bank of Commerce Tier 1 capital plus allowance for loan losses 5 % 4 % 6 % 25 % (17) % OTHER PERIOD-END STATISTICS (in $000’s, unaudited) Heritage Commerce Corp: Tangible common equity (1) $ 220,111 $ 223,914 $ 207,236 (2) % 6 % Shareholders’ equity / total assets 9.54 % 9.69 % 10.11 % (2) % (6) % Tangible common equity / tangible assets (2) 7.88 % 8.02 % 8.23 % (2) % (4) % Loan to deposit ratio 63.74 % 63.13 % 66.42 % 1 % (4) % Noninterest-bearing deposits / total deposits 39.86 % 38.04 % 40.55 % 5 % (2) % Total risk-based capital ratio 14.3 % 14.6 % 12.5 % (2) % 14 % Tier 1 risk-based capital ratio 11.4 % 11.6 % 11.5 % (2) % (1) % Common Equity Tier 1 risk-based capital ratio 11.4 % 11.6 % 11.5 % (2) % (1) % Leverage ratio 7.9 % 8.3 % 8.5 % (5) % (7) % Heritage Bank of Commerce: Total risk-based capital ratio 13.2 % 13.4 % 12.3 % (1) % 7 % Tier 1 risk-based capital ratio 12.2 % 12.3 % 11.3 % (1) % 8 % Common Equity Tier 1 risk-based capital ratio 12.2 % 12.3 % 11.3 % (1) % 8 % Leverage ratio 8.5 % 8.8 % 8.4 % (3) % 1 %\n(1) Represents shareholders’ equity minus preferred stock, minus goodwill and other intangible assets\n(2) Represents shareholders’ equity minus preferred stock, minus goodwill and other intangible assets divided by total assets minus goodwill and other intangible assets\nFor the Quarter Ended For the Quarter Ended December 31, 2017 December 31, 2016 Interest Average Interest Average NET INTEREST INCOME AND NET INTEREST MARGIN Average Income/ Yield/ Average Income/ Yield/ (in $000’s, unaudited) Balance Expense Rate Balance Expense Rate Assets: Loans, gross (1)(2) $ 1,563,006 $ 22,234 5.64 % $ 1,461,632 $ 20,049 5.46 % Securities - taxable 694,061 3,808 2.18 % 503,881 2,428 1.92 % Securities - exempt from Federal tax (3) 89,082 865 3.85 % 90,714 872 3.82 % Other investments and interest-bearing deposits in other financial institutions 397,557 1,548 1.54 % 324,914 947 1.16 % Total interest earning assets (3) 2,743,706 28,455 4.11 % 2,381,141 24,296 4.06 % Cash and due from banks 35,716 36,786 Premises and equipment, net 7,470 7,581 Goodwill and other intangible assets 51,425 52,862 Other assets 86,684 94,225 Total assets $ 2,925,001 $ 2,572,595 Liabilities and shareholders’ equity: Deposits: Demand, noninterest-bearing $ 1,002,808 $ 898,367 Demand, interest-bearing 621,830 328 0.21 % 529,922 295 0.22 % Savings and money market 715,148 452 0.25 % 583,495 298 0.20 % Time deposits - under $100 18,745 13 0.28 % 20,722 17 0.33 % Time deposits - $100 and over 175,416 329 0.74 % 203,041 253 0.50 % Time deposits - brokered — — 0.00 % 1,891 3 0.63 % CDARS - money market and time deposits 16,553 2 0.05 % 7,898 1 0.05 % Total interest-bearing deposits 1,547,692 1,124 0.29 % 1,346,969 867 0.26 % Total deposits 2,550,500 1,124 0.17 % 2,245,336 867 0.15 % Subordinated debt, net of issuance costs 39,153 583 5.91 % — — 0.00 % Short-term borrowings 95 1 4.18 % 63 — 0.00 % Total interest-bearing liabilities 1,586,940 1,708 0.43 % 1,347,032 867 0.26 % Total interest-bearing liabilities and demand, noninterest-bearing / cost of funds 2,589,748 1,708 0.26 % 2,245,399 867 0.15 % Other liabilities 57,718 66,473 Total liabilities 2,647,466 2,311,872 Shareholders’ equity 277,535 260,723 Total liabilities and shareholders’ equity $ 2,925,001 $ 2,572,595 Net interest income (3) / margin 26,747 3.87 % 23,429 3.91 % Less tax equivalent adjustment (3) (303 ) (305 ) Net interest income $ 26,444 $ 23,124\n(1) Includes loans held-for-sale. Nonaccrual loans are included in average balance.\n(2) Yield amounts earned on loans include fees and costs. The accretion (amortization) of deferred loan fees (costs) into loan interest income was $162,000 for the fourth quarter of 2017, compared to ($1,300) for the fourth quarter of 2016\n(3) Reflects the fully tax equivalent adjustment for Federal tax-exempt income based on a 35% tax rate.\nFor the Year Ended For the Year Ended December 31, 2017 December 31, 2016 Interest Average Interest Average NET INTEREST INCOME AND NET INTEREST MARGIN Average Income/ Yield/ Average Income/ Yield/ (in $000’s, unaudited) Balance Expense Rate Balance Expense Rate Assets: Loans, gross (1)(2) $ 1,531,922 $ 86,346 5.64 % $ 1,422,707 $ 79,284 5.57 % Securities - taxable 636,160 13,724 2.16 % 501,347 10,432 2.08 % Securities - exempt from Federal tax (3) 89,762 3,471 3.87 % 91,822 3,523 3.84 % Other investments and interest-bearing deposits in other financial institutions 318,025 4,585 1.44 % 228,293 2,425 1.06 % Total interest earning assets (3) 2,575,869 108,126 4.20 % 2,244,169 95,664 4.26 % Cash and due from banks 33,542 33,899 Premises and equipment, net 7,553 7,624 Goodwill and other intangible assets 51,932 53,445 Other assets 86,722 86,064 Total assets $ 2,755,618 $ 2,425,201 Liabilities and shareholders’ equity: Deposits: Demand, noninterest-bearing $ 944,275 $ 824,763 Demand, interest-bearing 586,778 1,208 0.21 % 511,595 1,026 0.20 % Savings and money market 653,636 1,534 0.23 % 526,227 1,127 0.21 % Time deposits - under $100 19,789 57 0.29 % 22,079 65 0.29 % Time deposits - $100 and over 187,298 1,188 0.63 % 209,972 913 0.43 % Time deposits - brokered — — 0.00 % 7,590 62 0.82 % CDARS - money market and time deposits 13,941 4 0.03 % 8,232 6 0.07 % Total interest-bearing deposits 1,461,442 3,991 0.27 % 1,285,695 3,199 0.25 % Total deposits 2,405,717 3,991 0.17 % 2,110,458 3,199 0.15 % Subordinated debt, net of issuance costs 23,266 1,394 5.99 % — — 0.00 % Short-term borrowings 75 2 2.67 % 490 12 2.45 % Total interest-bearing liabilities 1,484,783 5,387 0.36 % 1,286,185 3,211 0.25 % Total interest-bearing liabilities and demand, noninterest-bearing / cost of funds 2,429,058 5,387 0.22 % 2,110,948 3,211 0.15 % Other liabilities 57,670 58,666 Total liabilities 2,486,728 2,169,614 Shareholders’ equity 268,890 255,587 Total liabilities and shareholders’ equity $ 2,755,618 $ 2,425,201 Net interest income (3) / margin 102,739 3.99 % 92,453 4.12 % Less tax equivalent adjustment (3) (1,215 ) (1,233 ) Net interest income $ 101,524 $ 91,220", "external_links": ["https://www.globenewswire.com/Tracker?data=o-9sbF-xrgD1loggm493CyDz2dgNJwtGapneLEkDFmx6RMN074Kg3B4WqRE5oEN2NgEbSjjJhls31drh4vvM9x7t0IZduiyZhvT790NRPPhitS6t32rISJTfwVg5E-M8"], "published": "2018-01-26T00:45:00.000+02:00", "crawled": "2018-01-26T01:44:37.000+02:00", "highlightTitle": ""}