{"organizations": [], "uuid": "4a74fa1ab3b71759948de23e920eb3f5b9ceaa94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221641468&w=1200&r=LYNXMPEE0C038", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-stephens/tennis-first-grand-slam-title-was-overwhelming-says-stephens-idUSKBN1F2054", "country": "US", "domain_rank": 408, "title": "Tennis: First grand slam title was 'overwhelming', says Stephens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T07:46:00.000+02:00", "replies_count": 0, "uuid": "4a74fa1ab3b71759948de23e920eb3f5b9ceaa94"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-stephens/tennis-first-grand-slam-title-was-overwhelming-says-stephens-idUSKBN1F2054", "ord_in_thread": 0, "title": "Tennis: First grand slam title was 'overwhelming', says Stephens", "locations": [], "entities": {"persons": [{"name": "stephens", "sentiment": "negative"}, {"name": "stephens reu", "sentiment": "negative"}, {"name": "sloane stephens", "sentiment": "none"}], "locations": [{"name": "flushing meadows", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 5:47 AM / Updated 8 hours ago Tennis: First grand slam title was 'overwhelming', says Stephens Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Without a victory since her stunning U.S. Open triumph last September, American Sloane Stephens admitted on Saturday that the experience of becoming a grand slam winner had been “overwhelming”. “I think it’s always a tough transition when you go from not playing tennis for 11 months to winning a grand slam,” Stephens told a news conference at the Australian Open, which begins on Monday. \n“It’s never going to be anything you expected. In terms of that, it’s a little bit overwhelming.” The 24-year-old has lost all six of her matches following her win at Flushing Meadows, struggling to cope with the expectations and extra demands on her time. \n“I think it’s hard,” she said. “I thought winning the U.S. Open was, like, the hardest two weeks of my life. I‘m, like, exhausted. ”But after the U.S. Open, after the match, I did three-and-a-half hours of press... and I was like, ‘this sucks, what have you done’? “I think things like that have changed. There’s obviously more demand. These things are mandatory now. With that, it’s been a bit challenging. But I only do the things that are mandatory, so it’s easy.” \nDespite her poor form, Stephens goes into the Australian Open with a chance to back up her U.S. Open victory. Her disappointing results, she said, were not a huge concern. “I think you have to kind of put everything in perspective, evaluate where you are,” she said. “I think personally I had a lot of things going on. I‘m not going to look back on it. It’s a new year, new season. I‘m hoping not to get injured. There’s tons of things to look forward to. I‘m not going to dwell too much on that.” \nStephens’ victory in New York came completely out of the blue, having only returned from a long-term foot injury which required surgery. Having won a grand slam once, though, why not again? “I would like to win another grand slam,” she said. “It was tough. Obviously, it’s doable because I did it. I’d definitely like to do it again.” \nSeeded 13th, Stephens will begin her Australian Open campaign with a first round encounter against China’s Zhang Shuai. Reporting by Simon Cambers; Editing by John O'Brien", "external_links": [], "published": "2018-01-13T07:46:00.000+02:00", "crawled": "2018-01-13T08:02:04.014+02:00", "highlightTitle": ""}