{"organizations": [], "uuid": "5fe13c0460abe370cde2e367366133452689e4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223227310&w=1200&r=LYNXMPEE0I05L", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-svitolina/tennis-ruthless-svitolina-ends-kostyuks-dream-debut-idUSKBN1F80BA", "country": "US", "domain_rank": 408, "title": "Tennis: Ruthless Svitolina ends Kostyuk's dream debut", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:53:00.000+02:00", "replies_count": 0, "uuid": "5fe13c0460abe370cde2e367366133452689e4c7"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-svitolina/tennis-ruthless-svitolina-ends-kostyuks-dream-debut-idUSKBN1F80BA", "ord_in_thread": 0, "title": "Tennis: Ruthless Svitolina ends Kostyuk's dream debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Elina Svitolina showed not an ounce of sentiment as she gave 15-year-old compatriot Marta Kostyuk a 59-minute lesson in grand slam tennis to reach the fourth round of the Australia Open for the first time on Friday.\nQualifier Kostyuk became the youngest player to reach the third round of a grand slam in over 20 years on Wednesday but her dream run was brought to a shuddering halt in a 6-2 6-2 loss to her fellow Ukrainian on Rod Laver Arena.\nThe teenager made an excellent start by breaking Svitolina in the first game of the match but from then on it was pretty much all one-way traffic as the in-form fourth seed set up a meeting with Czech qualifier Denisa Allertova.\n“How much do you have to pay Svitolina to have one-hour lesson? I got it for free,” said Kostyuk, who admitted she had been reduced to tears after conceding defeat with her ninth double fault.\n”I had the chances but because I thought, ‘she is incredible, like, she’s a god’, I cannot do anything against her.\n“I know that I could play much better. Honestly I played really, really bad today. I didn’t show even maybe even 10 percent of what I can do.”\nSvitolina showed no desire to spend a minute longer in the heat than necessary and no sign of the injury issues she reported after her second round match.\n“It’s very special to me, I always love coming to Australia but I never got beyond the third round,” Svitolina said on court.\n“It was sad that I was playing a Ukrainian girl, it’s always difficult playing someone from your own country, but I‘m happy that I‘m still alive in this tournament.”\nTennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 19, 2018. Elina Svitolina of Ukraine rests during a break in her match against Marta Kostyuk of Ukraine. REUTERS/Thomas Peter Svitolina was one of the pre-tournament favorites after winning five tour titles last year and the Brisbane International warm-up to start this campaign.\nOne of five players who have a chance to finish the Australian Open as world number one, she is now firming as a strong candidate to claim a maiden grand slam title.\n“It adds a little bit more pressure, but when you are out there playing on the court, I don’t have this thing in my head,” she said.\nSlideshow (3 Images) “I just have my opponent, I have my racket, the tennis ball, and, I know what I have to do.”\nSvitolina made a sluggish start in the searing heat but her serve was rock solid after the first game reverse and she broke three times to clinch the set when Kostyuk, on one knee, flopped a forehand into the net.\nKostyuk left the court for a change of clothes before the second set but it made no difference and Svitolina ruthlessly pounced on anything loose from the teenager, particularly from her second serve, to break another two times.\nSvitolina gave her opponent a big hug at the net and predicted a bright future for Kostyuk, who on Monday became the youngest player to win a match at the Australian Open since Martina Hingis’s quarter-final run in 1996.\n“She did an amazing job here,” Svitolina said. “I think she’ll remember this moment for all her life.”\nThe 23-year-old was less certain that Kostyuk got value for money in her “lesson”.\n“It was expensive, because we play for prize money,” she said with a smile.\nReporting by Nick Mulvenney in Sydney, editing by Amlan Chakraborty/Greg Stutchbury\n ", "external_links": [], "published": "2018-01-19T05:53:00.000+02:00", "crawled": "2018-01-19T06:06:15.023+02:00", "highlightTitle": ""}