{"organizations": [], "uuid": "03f9559251a0d883c513b4b118101c28b483d776", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/cba-insurance-indonesia/australias-cba-weighs-exiting-indonesian-insurance-unit-valued-at-up-to-250-mln-sources-idUSL4N1P634G", "country": "US", "domain_rank": 408, "title": "Australia's CBA weighs exiting Indonesian insurance unit valued at up to $250 mln-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:10:00.000+02:00", "replies_count": 0, "uuid": "03f9559251a0d883c513b4b118101c28b483d776"}, "author": "", "url": "https://www.reuters.com/article/cba-insurance-indonesia/australias-cba-weighs-exiting-indonesian-insurance-unit-valued-at-up-to-250-mln-sources-idUSL4N1P634G", "ord_in_thread": 0, "title": "Australia's CBA weighs exiting Indonesian insurance unit valued at up to $250 mln-sources", "locations": [], "entities": {"persons": [{"name": "anshuman daga", "sentiment": "none"}, {"name": "sumeet chatterjee", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "cba", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "commonwealth bank of australia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pt commonwealth life", "sentiment": "none"}, {"name": "commonwealth life", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:12 AM / Updated 22 minutes ago Australia's CBA weighs exiting Indonesian insurance unit valued at up to $250 mln-sources Reuters Staff \n* CBA owns 80 percent stake in Commonwealth Life \n* Lender expected to hire financial adviser soon for stake review \n* Review is part of CBA’s move to get out of insurance business \nBy Sumeet Chatterjee and Anshuman Daga \nHONG KONG, Jan 11 (Reuters) - Commonwealth Bank of Australia (CBA) will consider selling its majority stake in an Indonesian insurance venture, with any deal likely valuing the insurer at up to $250 million, people familiar with the matter said. \nAustralia’s biggest lender is in talks with some investment banks and is expected to hire a financial adviser soon to help it decide on its 80 percent stake in PT Commonwealth Life, the people said. \nThe review of the stake forms part of CBA’s move to exit non-core areas and a sale could value Commonwealth Life at about $200 million to $250 million, two of the people said. \nThe stake sale, if completed, will be another instance of Asian banks exiting the insurance sector to free up capital and focus on their core banking businesses amid tougher regulatory capital buffer requirements. \nMalaysia’s AMMB Holdings Bhd (AmBank) is weighing a sale of its general insurance business as part of a move to exit non-core businesses and focus on its main banking operations, Reuters reported in December. \nCBA itself in September agreed to sell insurance businesses in Australia and New Zealand to AIA Group for $3.1 billion, as Australian lenders struggle to cope with growing competition from large foreign firms in insurance. \nThere is no certainty that CBA would proceed with the stake sale plan even after the review is completed, the people said. It was not immediately clear if there was a timeline for the review to be completed. \nOne of the people said the insurance stake sale process was expected to be launched in the first half of this year. \nA spokeswoman for CBA in Sydney said that it was business as usual and the bank would not comment on rumour or speculation. Representatives at Commonwealth Life could not be immediately reached for a comment. \nAll the people spoke to Reuters on condition that they are not named, as the plans are not public yet. \nCommonwealth Life has a presence in 20 Indonesian cities with more than 5,000 sales staff and over 500,000 individuals and group customers, its website showed. Its premium income rose 4 percent in 2016 to 1.9 trillion rupiah ($141 million). \nGiven the relatively small size of the business, the potential bidders for CBA’s stake are mostly expected to be foreign insurers already present in Indonesia and looking to bolster their footprint in the country, the people said. \nThey said the venture is expected to be valued at about 2 times its book, the average for recent Indonesian insurance M&A deals. \nCBA raised its holding in Commonwealth Life to 80 percent in 2007 in what was then a 50:50 joint venture. The remaining 20 percent is owned by an Indonesian firm, PT Gala Arta Jaya, according to the insurer’s website. \nBesides the insurance joint venture, CBA also has a retail and business banking presence in Indonesia. \nLow insurance penetration in Indonesia, at about 2.3 percent of gross domestic product, and a rapidly growing middle-class population in the Southeast Asian nation has made it an attractive market for foreign insurers. \nMajor overseas insurers in Indonesia include Prudential Plc , German insurer Allianz SE and French insurer AXA, Canada’s Manulife Financial Corp, and AIA. ($1 = 13,438.0000 rupiah) (Aditional reporting by Paulina Duran in SYDNEY and Cindy Silviana in JAKARTA; Editing by Muralikumar Anantharaman)", "external_links": [], "published": "2018-01-11T11:10:00.000+02:00", "crawled": "2018-01-11T11:50:21.003+02:00", "highlightTitle": ""}