{"organizations": [], "uuid": "dee7849f5a2aa3501a0d80e3110b0e20b3f63e54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-western-digital-announces-pricing-of-2-point-3-billion-of-senior-notes-due-2026-and-1-point-0-billion-of-convertible-senior.html", "country": "US", "domain_rank": 767, "title": "Western Digital Announces Pricing of $2.3 Billion of Senior Notes Due 2026 and $1.0 Billion of Convertible Senior Notes Due 2024", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T07:23:00.000+02:00", "replies_count": 0, "uuid": "dee7849f5a2aa3501a0d80e3110b0e20b3f63e54"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-western-digital-announces-pricing-of-2-point-3-billion-of-senior-notes-due-2026-and-1-point-0-billion-of-convertible-senior.html", "ord_in_thread": 0, "title": "Western Digital Announces Pricing of $2.3 Billion of Senior Notes Due 2026 and $1.0 Billion of Convertible Senior Notes Due 2024", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "western digital", "sentiment": "neutral"}, {"name": "western digital corporation", "sentiment": "neutral"}, {"name": "rbc capital markets", "sentiment": "none"}, {"name": "mizuho securities and wells fargo", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Western Digital Corporation (NASDAQ: WDC) (“Western Digital” or the “company”) today announced that it has priced its concurrent offerings of $2.3 billion aggregate principal amount of senior unsecured notes due 2026 (the “2026 notes”) and $1.0 billion aggregate principal amount of convertible senior notes due 2024 (the “2024 convertible notes” and, together with the 2026 notes, the “notes”). The notes will be issued by Western Digital, and guaranteed, jointly and severally on a senior basis, by certain of Western Digital’s subsidiaries.\nThe 2026 notes were offered in a public offering, and will bear interest at a rate of 4.750% per annum. Western Digital intends to use the net proceeds of the 2026 notes offering, together with available cash on hand, to fund its concurrent cash tender (the “tender offer”) to purchase any and all of its currently outstanding 10.500% senior unsecured notes due 2024. BofA Merrill Lynch and J.P. Morgan Securities LLC are acting as lead book-running managers, and RBC Capital Markets, Mizuho Securities and Wells Fargo Securities are acting as book-running managers for the 2026 notes offering.\nThe 2024 convertible notes were offered in a private offering to only qualified institutional investors (“QIBs”) in accordance with Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”), and will bear interest at a rate of 1.50% per annum. The company granted the initial purchasers a 30-day option to purchase up to an additional $100 million aggregate principal amount of 2024 convertible notes. The company intends to use the net proceeds of the offering of the 2024 convertible notes, together with the net proceeds from the previously announced Term Loan A-1 facility and available cash on hand, to redeem all of its currently outstanding 7.375% senior secured notes due 2023 (the “2023 secured notes”), including all accrued interest, related premiums, fees, and expenses. The 2024 convertible notes will be convertible into cash, shares of Western Digital’s common stock or a combination thereof, at Western Digital’s election, at an initial conversion price of approximately $121.91 per share (which represents a premium of approximately 40% to the $87.08 per share closing price of Western Digital’s common stock on Jan. 30, 2018). The company may redeem all or part of the 2024 convertible notes, at its option, on or after Feb. 5, 2021 if the company’s common stock price has been at least 130% of the conversion price for at least 10 trading days out of a 20-day consecutive trading period.\nThe company agreed to repurchase approximately $153.5 million of its common stock concurrently with the offering of the 2024 convertible notes offering in privately negotiated transactions, at a purchase price per share equal to the $87.08 per share closing price of Western Digital’s common stock on Jan. 30, 2018 with available cash on hand.\nThe sale of both the 2026 notes and the 2024 convertible notes is expected to be completed on Feb. 13, 2018, subject to customary closing conditions.\nThe 2024 convertible notes, the common stock, if any, deliverable upon conversion of the 2024 convertible notes and the related guarantees have not been and will not be registered under the Securities Act or the securities laws of any other jurisdiction. They may not be offered or sold in the United States or to, or for the benefit of, U.S. persons absent registration under, or an applicable exemption from, the registration requirements of the Securities Act.\nThe 2026 notes and 2024 convertible notes offerings are being conducted as separate offerings. Neither offering is contingent upon the other.\nThe company has filed a registration statement (including a prospectus) with the Securities and Exchange Commission (the “SEC”) for the 2026 notes offering. Before you invest, you should read the prospectus in the registration statement and other documents the company has filed with the SEC for more complete information about the company and the offerings. You may obtain these documents for free by visiting EDGAR on the SEC website at www.sec.gov , from BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte, NC 28255-0001, Attn: Prospectus Department, or by email at dg.prospectus_requests@baml.com or from J.P. Morgan Securities LLC via Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by telephone at (866) 803-9204.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy the common stock, notes or any other security, nor will there be any sale of the common stock, notes or any other security in any state or jurisdiction in which such an offer, solicitation or sale is not permitted. Any offer or sale will be made only by means of a prospectus and, to the extent applicable, a free writing prospectus which has or will be filed with the SEC.\nAbout Western Digital\nWestern Digital creates environments for data to thrive. The company is driving the innovation needed to help customers capture, preserve, access and transform an ever-increasing diversity of data. Everywhere data lives, from advanced data centers to mobile sensors to personal devices, our industry-leading solutions deliver the possibilities of data. Western Digital ® data-centric solutions are marketed under the G-Technology™, HGST, SanDisk ® , Tegile™, Upthere™ and WD ® brands. Financial and investor information is available on the company's Investor Relations website.\nForward-Looking Statements\nThis press release contains within the meaning of the Private Securities Litigation Reform Act of 1995, including statements concerning the offering of senior notes. These are based on management’s current expectations and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the , including: volatility in global economic conditions; uncertainties with respect to the company’s business ventures with Toshiba; business conditions and growth in the storage ecosystem; impact of competitive products and pricing; market acceptance and cost of commodity materials and specialized product components; actions by competitors; unexpected advances in competing technologies; the development and introduction of products based on new technologies and expansion into new data storage markets; risks associated with acquisitions, mergers and joint ventures; difficulties or delays in manufacturing; impacts of new tax legislation; and other risks and uncertainties listed in the company's filings with the SEC, including the company’s Form 10-Q filed with the SEC on Nov. 7, 2017, to which your attention is directed. You should not place undue reliance on these , which speak only as of the date hereof, and the company undertakes no obligation to update these to reflect new events.\nWestern Digital, the Western Digital logo, G-Technology, HGST, SanDisk, Tegile, Upthere and WD are registered trademarks or trademarks of Western Digital Corporation or its affiliates in the U.S. and/or other countries.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006545/en/\nWestern Digital Corp.\nMedia Contact:\nJim Pascoe\n408.717.6999\njim.pascoe@wdc.com\nor\nInvestor Contact:\nBob Blair\n949.672.7834\nrobert.blair@wdc.com\nSource: Western Digital Corporation", "external_links": ["http://www.businesswire.com/news/home/20180130006545/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751205&newsitemid=20180130006545&lan=en-US&anchor=www.sec.gov&index=1&md5=4468d0f81d1b6387c9e7393dfcabb039"], "published": "2018-01-31T07:23:00.000+02:00", "crawled": "2018-01-31T07:35:05.008+02:00", "highlightTitle": ""}