{"organizations": [], "uuid": "848fede5bb28c611c8f757a9b3e33dae50c84a24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/usa-congress-shutdown/u-s-government-shuts-down-as-trump-feuds-with-democrats-idUSL1N1PF05C", "country": "US", "domain_rank": 408, "title": "U.S. government shuts down as Trump feuds with Democrats", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T18:09:00.000+02:00", "replies_count": 0, "uuid": "848fede5bb28c611c8f757a9b3e33dae50c84a24"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-congress-shutdown/u-s-government-shuts-down-as-trump-feuds-with-democrats-idUSL1N1PF05C", "ord_in_thread": 0, "title": "U.S. government shuts down as Trump feuds with Democrats", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 20 (Reuters) - The world’s most powerful government shut down on Saturday after President Donald Trump and the U.S. Congress failed to reach a deal on funding for federal agencies, highlighting the country’s deep political divisions.\nFor the first time since October 2013 - when a similar standoff that lasted 16 days kept only essential agency operations intact - federal workers were being told to stay at home or in some cases to work without pay until new funding is approved.\nThe shutdown began a year to the day after Trump was sworn in as president.\nHis inability to cut a deal despite having a Republican majority in both houses of Congress marks arguably the most debilitating setback for his crisis-plagued administration.\nDemocrats had insisted that any bill to renew government funding also contain permanent protections for approximately 700,000 young, undocumented immigrants who were brought illegally into the United States as children.\nLast week, Trump rejected a bipartisan Senate deal that would have accomplished that as well as hand the White House $2.7 billion in new money for immigration enforcement at America’s borders.\nMinutes before Friday’s midnight deadline for a funding deal, Trump’s White House issued a statement blaming Democrats for the shutdown. “We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands,” it said.\nThe shutdown was cemented when the Senate, meeting late into Friday night, blocked a bill to maintain the federal government’s funding through Feb. 16.\nThe vote was 50-49, well short of the 60 needed in the 100-member chamber to vault the bill over a procedural hurdle.\nFour Republicans joined most Democrats in killing the measure. A fifth Republican, Senate Majority Leader Mitch McConnell, voted “no” too, but only as part of a parliamentary maneuver to make it easier to bring another bill to the floor.\nThe breakdown ended a long day of closed-door meetings in Congress and at the White House.\nEven as they promised to work on getting the government back up again as soon as possible, Republicans and Democrats blamed each other for the predicament.\nBLAME GAME Senate Majority Leader Mitch McConnell joined Trump in attacking Democrats.\n“What we’ve just witnessed on the floor was a cynical decision by Senate Democrats to shove aside millions of Americans for the sake of irresponsible political games,” McConnell said.\nSenate Democratic Leader Chuck Schumer said his party took significant steps to reach a deal, including raising the possibility of funding for Trump’s proposed wall along the U.S. border with Mexico, which they have ardently opposed.\n“It’s almost as if you were rooting for a shutdown,” Schumer said in comments on the Senate floor aimed directly at Trump.\nRepublican and Democratic leaders were expected to renew negotiations on Saturday in the hope of restoring government financing before Monday.\nThe immediate impact of the government shutdown was also eased somewhat by its timing, starting on a weekend when most government employees normally do not work anyway.\nNo matter the timing, the Defense Department said its combat operations in Afghanistan and other military activities would continue, while federal law enforcement officers also would remain on duty.\nWithout a quick deal, most day-to-day operations in the federal government will be disrupted. Hundreds of thousands of government employees will be put on temporary unpaid leave, including many of the White House’s 1,700 workers.\nTrump’s administration said it planned to keep national parks open with rangers and security guards on duty. The parks were closed during the last shutdown in 2013, upsetting many tourists and resulting in the loss of $500 million in visitor spending in areas around the parks and at the Smithsonian museums.\nNo one is likely to be on hand, for instance, to manually wind an historic clock outside the U.S. Senate chamber. Many Capitol maintenance workers also were being instructed to stay home.\nThe shutdown will start to have more serious consequences on Monday as government employees ranging from financial regulators and tax collectors to scientists and civilian staff at the Pentagon will have to stay away from work.\nEarly on Saturday, McConnell offered up a new plan. Instead of the Feb. 16 end date for the temporary spending bill, he proposed Feb. 8.\nSenate Democrats had argued this week for an extension of just four or five days to force both sides into serious negotiations on the immigration issue. (Reporting By Richard Cowan, Susan Cornwell and Amanda Becker; Editing by Kieran Murray)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T18:09:00.000+02:00", "crawled": "2018-01-20T16:11:38.014+02:00", "highlightTitle": ""}