{"organizations": [], "uuid": "b82977225e8c1214bc42543a1731528b040db57d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-book/author-of-trump-book-contradicts-president-says-he-interviewed-him-idUSL1N1P00HZ", "country": "US", "domain_rank": 408, "title": "Author of Trump book contradicts president, says he interviewed him", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T22:47:00.000+02:00", "replies_count": 0, "uuid": "b82977225e8c1214bc42543a1731528b040db57d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-book/author-of-trump-book-contradicts-president-says-he-interviewed-him-idUSL1N1P00HZ", "ord_in_thread": 0, "title": "Author of Trump book contradicts president, says he interviewed him", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 5 (Reuters) - The author of a deeply critical book about Donald Trump’s first year in office said on Friday he had spoken with the president while working on it, contradicting Trump’s assertion that he had never talked to the writer for the book and had authorized “Zero access” to the White House.\nMichael Wolff’s book “Fire and Fury: Inside the Trump White House” went on sale on Friday, its release pulled forward after published excerpts this week set off a political firestorm, threats by Trump lawyers of legal action and an effort to halt publication.\nThe book, dismissed by Trump as full of lies, depicts a chaotic White House, a president who was ill-prepared to win the office in 2016, and Trump aides who scorned his abilities.\nWolff told NBC on Friday that he stood by his reporting and had talked to the president for the book.\n“I absolutely spoke to the president. Whether he realized it was an interview or not, I don’t know, but it was certainly not off the record,” he said on NBC’s “Today” program, adding that he had spoken to people who spoke to Trump on a daily, “sometimes minute by minute” basis.\nAsked to clarify what he meant when he wrote that Trump’s entire circle questioned his fitness for office, Wolff said, “Let me put a marker in the sand here: 100 percent of the people around him ... They all say he is like a child. And what they mean by that is he has a need for immediate gratification. It’s all about him.”\nOn Thursday evening, Trump tweeted that, “I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book.”\n“Full of lies, misrepresentations and sources that don’t exist. Look at this guy’s past and watch what happens to him and Sloppy Steve!” Trump added.\nThe early excerpts have also caused a deep public rift with Trump’s former chief strategist and top campaign aide, Steve Bannon, over his comments in the book about Trump and his family, shaking the president’s populist movement.\nLawyers for Trump had called on the book’s publisher, Henry Holt & Co, to halt the book’s release, originally scheduled for Tuesday. Instead, it began sales early. As of Friday, “Fire and Fury” was the top-selling book on Amazon.com.\nCustomers in Washington queued up in sub-freezing temperatures to purchase a copy at KramerBooks, which began selling copies at midnight. The bookstore had sold out of copies as of Friday morning at 9 am (1400 GMT).\nThe White House has said the book is riddled with errors. Spokeswoman Sarah Sanders, who has called the book trash, said again on Friday that Wolff had talked only briefly to the president and did not have wide access.\n“This is a guy who made up a lot of stories to try to sell books,” she said in an interview on Fox News.\nCharles Harder, Trump’s personal lawyer, in a legal notice provided to Reuters, warned on Thursday of possible claims including libel against Wolff and Henry Holt & Co and threatened to try to block publication of the book. Harder also told Reuters that “legal action is imminent” against Bannon.\nHenry Holt said it had received a cease-and-desist letter from Trump’s attorney but would go ahead with publishing the book.\nBannon’s reaction to the controversy has been muted. In interviews after the news broke with the conservative Breitbart News website, he called Trump a “great man” and pledged continued support for the president’s agenda.\nReporting by Makini Brice; Editing by Susan Heavey and Frances Kerry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T22:47:00.000+02:00", "crawled": "2018-01-05T22:39:14.032+02:00", "highlightTitle": ""}