{"organizations": [], "uuid": "d0fac5e6585e5e01a88a600fd36219435218a998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/banco-santander-brasil-farm-loans/update-1-brazils-santander-rural-loans-rise-to-4-bln-in-2017-idUSL1N1OZ14T", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Brazil's Santander rural loans rise to $4 bln in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:29:00.000+02:00", "replies_count": 0, "uuid": "d0fac5e6585e5e01a88a600fd36219435218a998"}, "author": "", "url": "https://www.reuters.com/article/banco-santander-brasil-farm-loans/update-1-brazils-santander-rural-loans-rise-to-4-bln-in-2017-idUSL1N1OZ14T", "ord_in_thread": 0, "title": "UPDATE 1-Brazil's Santander rural loans rise to $4 bln in 2017", "locations": [], "entities": {"persons": [{"name": "ana mano  sao paulo", "sentiment": "none"}, {"name": "aguiar", "sentiment": "none"}, {"name": "carlos aguiar", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "banco santander brasil", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 29   UPDATE 1-Brazil's Santander rural loans rise to $4 bln in 2017 Reuters Staff \n(Adds information and quote from interview) \nBy Ana Mano \nSAO PAULO, Jan 4 (Reuters) - The volume of Banco Santander Brasil’s farm loans rose about 44 percent last year as the Spanish bank’s local unit grew its presence in the country’s booming agribusiness sector, an executive said on Thursday. \nCarlos Aguiar, head of agribusiness lending, said the growth catapulted the bank to become the fifth-largest provider of farm loans in Latin America’s biggest economy. \nSantander’s loans to farmers and agribusiness companies stood at 13 billion reais ($4 billion) at the end of last year, up from 9 billion reais in 2016. \nThe bank’s farm lending in Brazil could grow between 10 percent and 15 percent in 2018, Aguiar said, as lower interest rates provide opportunities for private-sector banks to expand in a segment still dominated by state-run banks. \n“The fall of the Selic base rate is accelerating our strategy,” Aguiar told Reuters in a telephone interview. \nBrazil’s central bank reduced the benchmark interest rate to an all-time low of 7 percent in December, the latest in a long cycle of cuts that began in October 2016 amid government efforts to kick-start the economy. \nWith loans tailored to farmers and agribusinesses, Aguiar said the bank expects to thrive in the only sector relatively unscathed from Brazil’s deepest recession in decades from 2015 to 2017. \nSantander announced plans to open 16 “agro-stores” focused on selling financial products to farmers in the country last year, 14 of which have now been launched. About a third of those will be in the state of Mato Grosso, where recently grain growers have relied more on the barter system to finance their crop. \nUnder barter, multinational commodities trading firms and agriculture product resellers supply inputs to farmers in exchange for securing future delivery of a portion of their crops. \nFor the first time since the 2008/2009 crop season, barter represented more than half of crop financing for producers in the state, according to Imea, a research agency based in Brazil’s largest grain producing state. \n“Barter is only used in Brazil,” Aguiar said, adding the bank can offer loan options potentially more competitive to producers. \nState-run Banco do Brasil SA remains Brazil’s largest rural credit provider, with about 66 percent of farm loans totaling 188 billion reais as of last October, according a ranking compiled by bank association Febraban. ($1 = 3.2264 reais) (Reporting by Ana Mano; Editing by Nick Zieminski)", "external_links": [], "published": "2018-01-04T20:29:00.000+02:00", "crawled": "2018-01-04T20:56:07.008+02:00", "highlightTitle": ""}