{"organizations": [], "uuid": "331a42ba48a90c2a8783e22cff678697270e1f4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-starbucks-disappoints-after-holiday-drink-sales-lose-steam.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Starbucks disappoints after holiday drink sales lose steam", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T02:59:00.000+02:00", "replies_count": 0, "uuid": "331a42ba48a90c2a8783e22cff678697270e1f4c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-starbucks-disappoints-after-holiday-drink-sales-lose-steam.html", "ord_in_thread": 0, "title": "UPDATE 3-Starbucks disappoints after holiday drink sales lose steam", "locations": [], "entities": {"persons": [{"name": "kevin johnson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "starbucks corp", "sentiment": "negative"}, {"name": "starbucks", "sentiment": "none"}, {"name": "consensus metrix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on U.S. corporate tax cut, operational changes)\nJan 25 (Reuters) - Starbucks Corp on Thursday warned that 2018 global cafe sales growth would be at the low end of its forecast, after holiday drinks fell flat with U.S. customers during what is traditionally a blockbuster quarter.\nShares of the world's largest coffee chain slid 4.6 percent following the announcement to $57.75, after closing at $60.55 in regular trade.\nCompany executives reiterated that Starbucks, which sometimes locates stores across the street from each other, was not losing business to cannibalization or rising competition from both high-end and low-priced coffee sellers.\nBut sales at established Americas region cafes rose just 2 percent in the first quarter ended Dec. 31, as customers added food to their orders: the number of cafe visitors did not budge. Analysts polled by research firm Consensus Metrix expected a sales rise of 3.3 percent.\n\"Holiday (limited-time offers) and merchandise did not resonate with our customers as planned,\" Chief Executive Kevin Johnson said on a conference call with analysts.\nStarbucks offers holiday-themed drinks such as the Chestnut Praline Latte and Gingerbread Latte as well as gift cards, mugs, coffee and tea gift boxes and teddy bears to woo holiday shoppers.\nJohnson also blamed the quarter's disappointing same-store sales results on an ongoing shift towards online shopping from brick-and-mortar stores, as well as waning customer interest in the afternoon and evening hours.\nStarbucks said it now expects 2018 global same-store sales growth at the low end of its previously-issued view of 3 to 5 percent.\nChief Financial Officer Scott Maw said the company would continue to \"streamline\" its operations by removing underperforming and lower-margin merchandise from store lobbies and exiting businesses that don't meaningfully contribute to sales and profits - as Starbucks is doing by closing its Teavana retail stores and selling its Tazo tea brand.\nThe chain is also working to eliminate bottlenecks that can happen when users of its industry-leading mobile app flood crowded cafes with orders.\nThe same-store sales performance and outlook overshadowed the profit boost Starbucks expects to reap from a U.S. corporate tax cut.\nStarbucks raised its fiscal 2018 earnings forecast to a range of $2.48 to $2.53 per share, excluding items, from $2.30 to $2.33 per share previously. Maw said Starbucks expects a non-GAAP effective tax rate of 26 percent for 2018 and beyond, roughly 7 points below prior guidance.\nCHINA GROWTH?\nStarbucks has turned to China for growth, planning to more than triple its over 3,000-store network within a decade. It recently opened a massive, showcase Reserve Roastery in Shanghai.\nChina same-store sales were up 6 percent and the company's acquisition of 1,300 stores in China helped net income in the quarter to rise to $2.25 billion, or $1.57 per share, from $751.8 million, or 51 cents per share, a year ago.\nBut for the time being, investors want Johnson, who is still overshadowed by his predecessor and current Executive Chairman Howard Schultz, to deliver more robust growth in Starbucks' home market, with roughly 14,000 stores.\nThe stock is up 3.2 percent from a year ago, versus the 44 percent, turnaround-fueled gain at McDonald's Corp. (Reporting Additional reporting by Nichola Groom in Los Angeles, Editing by Rosalba O'Brien)", "external_links": [], "published": "2018-01-26T02:59:00.000+02:00", "crawled": "2018-01-26T11:21:30.019+02:00", "highlightTitle": ""}