{"organizations": [], "uuid": "b2cf4926dd5878de1d645b41999ac6310293d3b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222972551&w=1200&r=LYNXMPEE0H0M2", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-economy-homeprices/china-home-prices-edge-up-in-december-annual-growth-rate-slumps-idINKBN1F70WW", "country": "US", "domain_rank": 408, "title": "China home prices edge up in December, annual growth rate slumps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:47:00.000+02:00", "replies_count": 0, "uuid": "b2cf4926dd5878de1d645b41999ac6310293d3b1"}, "author": "", "url": "https://in.reuters.com/article/china-economy-homeprices/china-home-prices-edge-up-in-december-annual-growth-rate-slumps-idINKBN1F70WW", "ord_in_thread": 0, "title": "China home prices edge up in December, annual growth rate slumps", "locations": [], "entities": {"persons": [{"name": "yawen chen", "sentiment": "none"}, {"name": "ryan woo", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "national bureau of statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:51 AM / Updated 16 minutes ago China home prices edge up in December, annual growth rate slumps Yawen Chen , Ryan Woo 5 Min Read \nBEIJING (Reuters) - China’s housing market picked up slightly in December as mild declines in bigger metropolises stabilised and smaller cities gained some momentum, but price growth more than halved in 2017 as government curbs on speculation took effect. \nNew home prices in December rose 5.3 percent from a year earlier, up from November’s 5.1 percent increase, but well off the 12.4 percent growth seen in 2016 as the government worked to engineer a soft landing for the soaring housing market. \nAverage new home prices in China’s 70 major cities rose 0.4 percent in December from the previous month, reaching a modest five-month high after growth stabilised for two consecutive months, Reuters calculated from National Bureau of Statistics (NBS) data on Thursday. \nThe majority of the 70 cities surveyed by the NBS still reported a monthly price increase for new homes. Fifty-seven cities reported higher prices in December, up from November’s 50. \nSlightly higher prices outside the major cities could be due to an increase in supply as property developers chased sales targets towards year-end, despite government price caps, property analysts said.“A shift in government monetary and financial policies has put more liquidity pressure on some developers. It’s also becoming clearer to them that the tightening measures will remain for longer than expected,” said Joe Zhou, head of research for JLL China, a property services firm. \nProperty sales by floor area quickened to a six-month high in December, with growth picking up to 6.1 percent from a year earlier, Reuters calculated from a separate official release from the NBS on Thursday. \nTotal sales grew 7.7 percent in the full-year of 2017, falling sharply from the 22.5 percent increase in 2016. \nChina’s housing market has soared over the past two years, prompting more than 100 cities to impose measures to curtail speculative buying, with Chinese President Xi Jinping reiterating that “houses are built to be lived in, not for speculation”. \nA softening but still resilient property market, underpinned by steady prices, would please policymakers. \nThey are keen to keep the market - still a vital source of growth for the economy - stable as they campaign to reduce debt and financial risk nationwide. \nMonthly price rises peaked in September 2016 at 2.1 percent nationwide, but they have since softened only slowly as fear of missing out spooked would-be buyers. \nAs mega-cities such as Beijing and Shanghai imposed increasingly stringent measures, speculators moved to smaller centres where authorities offered cheap credit and imposed few restrictions in the hope of clearing a glut of unsold homes. \nProperty prices in China’s tier-2 cities, mostly sizable provincial capitals, recorded the strongest growth in December.They rose 0.6 percent versus a 0.5 percent increase in November, the NBS said. Tier-3 cities rose 0.5 percent against a 0.4 percent gain in November. \nWith official tightening measures widely expected to remain in place, market watchers do not anticipate significant price fluctuations in the year ahead. \nThe overall market is also cushioned by falling inventory, which dropped 15.3 percent in 2017, according to the NBS. \n“We expect an opposite trend in the year ahead from last year - smaller tier-3 and tier-4 cities will cool quickly and more housing supply will go into bigger cities where demand will catch up,” said JLL’s Zhou. \nChina’s housing minister said in December authorities would facilitate property purchases by first-time homebuyers and those wanting to improve their living conditions in 2018, signalling policies would continue to accommodate what Beijing deems as “rigid”, non-speculative, demand. \nA slowdown in sales has started to drag on real estate investment towards the year-end, however. Real estate investment growth eased to 2.4 percent in December, the lowest since July 2016, according to Reuters calculations. \nIt still rose 7 percent in 2017, marking the best annual growth since 2014, giving the economy a major boost in the past year. \nThe world’s second-largest economy grew an annual 6.9 percent in 2017, topping the government’s target and quickening from 2016 growth of 6.7 percent. \n($1 = 6.6088 Chinese yuan)", "external_links": [], "published": "2018-01-18T10:47:00.000+02:00", "crawled": "2018-01-18T11:19:25.004+02:00", "highlightTitle": ""}