{"organizations": [], "uuid": "2b2f9fd04e3dae67ecd68d43a274cb2f3a9f250a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2011/08/23/33594912-gold_bars.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/gold-strong-equities-and-higher-u-s-treasury-yields-in-focus.html", "country": "US", "domain_rank": 767, "title": "Gold: strong equities and higher U.S. Treasury yields in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.4, "site_type": "news", "published": "2018-01-10T06:05:00.000+02:00", "replies_count": 0, "uuid": "2b2f9fd04e3dae67ecd68d43a274cb2f3a9f250a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/gold-strong-equities-and-higher-u-s-treasury-yields-in-focus.html", "ord_in_thread": 0, "title": "Gold: strong equities and higher U.S. Treasury yields in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold jumped to its highest in nearly four months on Wednesday as a report that Chinese officials had recommended slowing or halting U.S. Treasury purchases sparked a broad-based sell-off of the dollar, lifting assets priced in the U.S. currency.\nThe dollar , already under pressure versus the yen after the Bank of Japan moved to trim its long-dated government bond purchases earlier this week, slid 0.6 percent versus a currency basket, its biggest one-day drop in a month.\nSpot gold was up 0.41 percent at $1,317.91 an ounce at 11:35 a.m. ET, having earlier touched its highest since Sept. 15 at $1,326.56. U.S. gold futures for February delivery were up 0.4 percent an ounce at $1,318.90.\n\"Gold is fueled by the weak dollar after the China news came out,\" Commerzbank analyst Daniele Briesemann said. \"U.S. Treasury yields are continuing to rise - that should be a headwind for gold, but it seems to be ignored after the news late morning. It all comes down to the weak dollar.\"\n\"Maybe with the opening of the U.S. we could see more gains in gold due to an even weaker dollar,\" he added.\nshow chapters Only asset classes left to invest in are gold and cash: Pro 6:50 AM ET Fri, 5 Jan 2018 | 04:09 The U.S. currency slumped on Wednesday after a report that China was reconsidering its stance on U.S. treasury purchases, with the greenback posting its biggest single-day drop against the Japanese yen in nearly eight months.\nOfficials reviewing China's foreign-exchange holdings have recommended slowing or halting purchases of U.S. Treasuries , Bloomberg News reported, citing people familiar with the matter.\nMajor government bond yields hit multi-month highs on Wednesday as investors reevaluated the likelihood of continued easy-money policies by the world's major central banks following the Bank of Japan's move.\nThe 10-year U.S. Treasury yield hit 2.57 percent for the first time since March. The dollar's slide helped gold shrug off the impact of rising global Treasury yields, which increase the opportunity cost of holding non-interest bearing bullion.\n\"If the reports turn out to be true and China no longer sees Treasuries as an attractive option, the repercussions could be significant as the country is one of the biggest holders of U.S. debt,\" OANDA said in a note. \"The tightening effect of such measures would likely have an impact on how many times the Federal Reserve raises interest rates this year, which is why we've seen a corresponding drop in the dollar.\"\nAmong other metals, palladium sunk 1.35 percent at $1,085.10 an ounce, after hitting a record high on Tuesday at $1,111.40.\nTightening emissions standards and a switch away from diesel cars to more palladium-heavy gasoline models has shored up demand expectations for the autocatalyst metal.\nSilver was up 0.29 percent at $17 an ounce, while platinum was 0.58 percent higher at $971 an ounce.", "external_links": [], "published": "2018-01-10T06:05:00.000+02:00", "crawled": "2018-01-10T06:37:41.002+02:00", "highlightTitle": ""}