{"organizations": [], "uuid": "fb9c9b899ccd6a105977556aa3be3eb8eb272c09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-milost-announces-the-appointment-of-a-new-leader.html", "country": "US", "domain_rank": 767, "title": "Milost Announces the Appointment of a New Leader", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:18:00.000+02:00", "replies_count": 0, "uuid": "fb9c9b899ccd6a105977556aa3be3eb8eb272c09"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-milost-announces-the-appointment-of-a-new-leader.html", "ord_in_thread": 0, "title": "Milost Announces the Appointment of a New Leader", "locations": [], "entities": {"persons": [{"name": "gwadiso", "sentiment": "none"}, {"name": "freeman", "sentiment": "none"}, {"name": "kim freeman", "sentiment": "none"}, {"name": "mj gwadiso", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "milost", "sentiment": "none"}], "organizations": [{"name": "milost global inc.", "sentiment": "negative"}, {"name": "board of directors of milost global inc", "sentiment": "none"}, {"name": "milost global inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Milost Global Inc. (“Milost”) announced today that its Board has appointed Mr. Kim Freeman as the new leader and Chief Executive Officer effective from February 1, 2018. Kim will be based in New York and he will report to the Board of Directors of Milost Global Inc. Kim is taking over from the founding partner and current CEO, MJ Gwadiso. Mr Gwadiso has stepped down from the position as CEO of Milost in December 2017 and will also be stepping down as a member of the Board at the end of March.\nMr. Freeman is currently Partner & Managing Director of Mining at Milost Global Inc, where he is responsible for the global mining portfolio of Milost. In connection with Mr. Freeman's appointment as Chief Executive Officer, the Firm and Mr. Freeman entered into an Employment Agreement dated as of December 12, 2017 (the \"Employment Agreement\"). The Employment Agreement includes the following material terms:\nContract Term: An initial term of months, followed by automatic renewals for successive 12-month periods unless 60 days' prior written notice of non-renewal is provided.\nCompensation: Mr. Freeman's total annual compensation will be $50, 150, 000. 00 and Solly Asibey, the incoming Chief Investment Officer’s total annual compensation is $30, 120, 000.00\nBonuses:\nMilestone Bonuses : For each of the fiscal years ending March 31, 2019, 2020, 2021 and 2022, the milestone bonus earned is based on the operating margin achieved by the Company in that fiscal year compared to the relevant target operating margin set forth below. For these purposes, operating margin is defined as operating income before income taxes divided by interest and fee income on finance receivables, adjusted in the sole discretion of the Compensation Committee, including without limitation for the following items: 1) changes resulting from a FASB Accounting Pronouncement, 2) dividends, 3) gain on sale and 4) provision for credit losses if less than charge-offs. The target operating margins are as follows:\nFiscal year ending March 31, 2019 7.50 % Fiscal year ending March 31, 2020 12.50 % Fiscal year ending March 31, 2021 20.00 % Fiscal year ending March 31, 2022 30.00 % If less than 80% of the target operating margin is achieved, no milestone bonus will be earned. If 80% or more of the target operating margin is achieved, the milestone bonus will equal the percentage of the target margin achieved multiplied by $150,000. For example, if the operating margin in the fiscal year ending March 31, 2019 is 9%, the bonus is 120% of the target margin multiplied by $150,000, or $180,000.\nLong Term Bonuses : For each of the fiscal years ending March 31, 2021 and 2022, the long-term bonus earned shall be based on the three-year rolling average annual growth in tangible book value over the three immediately preceding fiscal years, adjusted in the sole discretion of the Compensation Committee of the Board (the \"Compensation Committee\"), including without limitation for the following items: 1) changes resulting from a FASB Accounting Pronouncement, 2) share buy-backs, 3) dividends, 4) stock splits, 5) gain on sale and 6) provision for credit losses if less than charge-offs. The long-term bonus consists of two components: a cash component and a restricted stock component (valued at the average closing price of the common stock over the 90 calendar days immediately preceding the final day of the fiscal year with respect to which the bonus is calculated). For example, if the Firm were to grow book value by 12% on average over three years, Mr. Freeman would receive 100% of his salary as a bonus in cash and 100% of his salary in restricted stock (which will cliff-vest after three years).\nDiscretionary Bonus : For each fiscal year specified above beginning with the fiscal year ending March 31, 2018, the Compensation Committee retains sole discretion to pay an additional bonus of up to 50% of actual salary earned for such fiscal year.\nBenefits: Mr. Freeman will be entitled to fringe benefits and perquisites consistent with the practices of the Firm for similarly situated executives, except that premiums for Mr. Freeman's and his spouse's health insurance will be paid by the Firm.\nCommenting on the CEO changes, Mandla J. Gwadiso said: “Kim’s extensive experience leading strategy and operations for organizations make him ideally suited to lead the firm as it focuses on balancing operational execution with profitable growth and free cash flow generation for all our investee and portfolio companies.”\n\"On behalf of our employees, the Board, Limited Partners and shareholders, I want to thank MJ for his leadership and commitment to the Firm. It has been MJ's leadership and perseverance over the years that has positioned us for commercial success at this time,\" commented Egerton Forster, senior partner & Chairman of Milost Global Inc. \"I look forward to Kim leading the Firm through this transition as we build our investment teams to launch Milost in Middle East, Europe and other key markets.\nKim Freeman, incoming CEO of Milost Global Inc, also stated, “It certainly is a great honour to assume the leadership of Milost and I sincerely thank the Board for this privilege. I look forward to relocating to New York and working closely with the Chairman and all the Milost partners and staff worldwide. I will also continue to consult with Mr. Gwadiso and his vast experience and knowledge. I believe Milost is on a steep growth curve which I must sustain and consolidate. Profitability and cash flow generation are important requirements for all our investments going forward.\nAbout Milost Global Inc.\nMilost Global Inc. is an American Private Equity firm that is headquartered in New York City, with more than $25 billion in committed capital. Milost is at the intersection of creative investing and value creation. Milost is also a provider of alternative capital, mezzanine finance, and alternative lending to a broad range of industries across the globe including Technology, Transport, Cannabis, Education, Distribution, Mining, Oil & Gas, Financial Services, Healthcare, Pharmaceuticals, Real Estate, Alternative Energy and Infrastructure Development. www.milostglobal.com\nMilost Global Inc.\ninfo@milostglobal.com\nwww.milostglobal.com\n+1 212 918 4792 t\n+1 212 225 8246 f\n48 Wall St., 11th Floor\nNew York, NY 10005, USA\nSource:Milost Global Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dac64e60-c6f3-4d97-bf2d-20582f5b1ba0", "https://www.globenewswire.com/Tracker?data=Rm3D2gADTQjEacQfGyM1C_65HjOvdCBMbDwk657seeuDDAeQzcjjn45mj_o9R9q8GOPv6RBcfZ5UwvYRH69mIQJKitD16S23O6kvQeHIXN4agckIM1TpyyeLU4plImBnPGPGeCXedErAqpr1mwmxt3-Wo-KLSB5LFML6bNDYvVdCjbhmCOGHxqwXX7KtXHng2kxVsKCKPbZu6WLgpA1QydNP7OrQ-KUThSIFufQHD0ap3nA0q_PULX0Ai0_n3amuBLsvkllSM8sM_BXB8fRsn3vGRnvvATvXFfkSMU40y0tMFS2-CEbGQhrnEGHnonBhCJaoo7TkXmg6utA4qSB6S9rJgi6z746S7yYK-iD1yNQxq-jp4PIU1n5CTM4jIpjcVSDUQO1WhUgRc3JyBT88mrZCssdiwkDNDVnlWrlcPSO90oBRkIzug1z_VY_cZ5qeYhkQnt_-nmV5WhwzWRZ1hp8LT3QhW32DhBEi_PP", "https://www.globenewswire.com/Tracker?data=Rm3D2gADTQjEacQfGyM1CxJ2kT_mssAii9UkhzRZQxmoVh2oSfcmIEHOoEe6OZEptcUgGa-P49OTwM60p7VVF2PDQniRd8gzoSok3bquJgZg9MVYAnGCzbeON8xkfT7e0T9ve92DpA3L4S6h_tcrtXcuk10pu3Wt-mGl224EUMp5lj9IAv6oggF6scexlAZUfspkqsxne7vtUh0aO4PpqXBtSy7DY0_BxKS1CjetkApKshyVQY9npkSxXqHJl_JDqEknFEwrjkf2HCjtrWo41Q==", "https://www.globenewswire.com/Tracker?data=YPcrEiFYXxw-654Uz-z0WGKAU58GQ8u0ZzpFK2c0pI5UOryJQ8Ez4tgJ4h7ykXgY13NXZoIOz3AiU2T110eoSbzGL0Ss11FNNaIUxFUSTqpzMVFT8tF5JveFKEsoELkIYm3v-dGw6sZp8Fg7sHPZv5wOFhTyKffnx8PaznCD93jNl591w1itjiZ21QBmUo63sahULkPuUckpiyu5R89MtRBg_oiN_jJN5-X8xuhqeG6kfzJDzgx68WS5LVTbk9B19AxrDZizPyug5y_D-7c58EfspagTVE434QUhc2Dsnzul2IdtkcHa_T3B6WT8TpPgJXLhILvSl8HwygEPihbAvtlLOokE005lOU1hpiY7Nro9yjZsYP0sbxGm1bQgy6k5GtWvONgN_Ou2KuU5s27qpKnUeSKpmGpDtYDxZzuU7SYV-koFkbUHYO5tQVgvZWQla4afcV-xYcIDqr1cYOLMXAP29NOxkzVbHj8R1yH"], "published": "2018-01-30T17:18:00.000+02:00", "crawled": "2018-01-30T18:45:24.001+02:00", "highlightTitle": ""}