{"organizations": [], "uuid": "7afb4c7f4a143a7dc7e9c3905ecbb6c762c5dd18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224667319&w=1200&r=LYNXMPEE0N04X", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-hna-group-stocks-tradinghalts-factbox/factbox-units-of-chinas-indebted-hna-group-whose-shares-are-under-trading-halts-idUSKBN1FD07P", "country": "US", "domain_rank": 408, "title": "Factbox: Units of China's indebted HNA Group whose shares are under trading halts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:39:00.000+02:00", "replies_count": 0, "uuid": "7afb4c7f4a143a7dc7e9c3905ecbb6c762c5dd18"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hna-group-stocks-tradinghalts-factbox/factbox-units-of-chinas-indebted-hna-group-whose-shares-are-under-trading-halts-idUSKBN1FD07P", "ord_in_thread": 0, "title": "Factbox: Units of China's indebted HNA Group whose shares are under trading halts", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hna group", "sentiment": "negative"}, {"name": "hna investment group co ltd", "sentiment": "none"}, {"name": "china development bank", "sentiment": "none"}, {"name": "hna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Nearly half of Chinese conglomerate HNA Group’s [HNAIRC.UL] listed units have suspended trading in their shares since November as the group faces rising financing costs after a $50 billion acquisition spree over the past two years.\nSeven HNA firms, with a combined market value of $30.6 billion, halted trading of their shares, pending announcements. Investors are jittery about further suspensions as the group’s debt-fueled acquisitions and opaque ownership structure have sparked global regulatory scrutiny.\nThe U.S. government will not approve any investment by HNA until it provides adequate information on who its shareholders are, a source familiar with the situation said.\nThis week, the head of the aviation leasing arm of China Development Bank said the policy bank was willing to help HNA Group as the Hainan-based group has solid airline operations and it would serve nobody’s interest to see it collapse.\nBelow are lists of the units under trading halts and those still trading:\nUNDER TRADING SUSPENSIONS: 1. HNA Investment Group Co Ltd\n* Date of trading halt: 24 January, 2018\n* Market capitalization: $763.9 million\n* Major shareholders: HNA Capital Group Co Ltd holds 19.98 percent and HNA Investment Holding Co Ltd owns 1.27 percent\n* Core business: Formerly Yeland Investment Group Co Ltd, it is engaged in commercial and residential property development. It is also into fund management and provides retirement services in Beijing and Tianjin. 2. HNA Infrastructure Investment Group Co Ltd\n* Date of trading halt: 23 January, 2018\n* Market capitalization: $6.8 billion\n* Major shareholders: HNA Foundation Holdings Ltd holds a 57.56 percent\n* Core business: Formerly Hainan HNA Infrastructure Investment Group Co LTD, it is engaged in the commodities retailing business, and provides hotel and catering services in Hainan and Tianjin. 3. HNA-Caissa Travel Group Co Ltd\n* Date of trading halt: 19 January, 2018\n* Market capitalization: $1.6 billion\n* Major shareholders: HNA Tourism Group Co Ltd owns 32.18 percent\n* Core business: Formerly E-Food Group Co Ltd, it is mainly engaged in the tourism service business. It also provides aviation food, railway catering, and exhibition catering services.\n4. Bohai Capital Holding Co Ltd\n* Date of trading halt: 17 January, 2018\n* Market capitalization: $5.6 billion\n* Major shareholders: HNA Capital Group Co Ltd holds 34.64 percent\n* Core business: Formerly Bohai Leasing Co Ltd, the firm is engaged in specialised finance leasing business. Bohai Capital is the parent of the world’s third-largest aircraft leasing firm Avolon. The company is also involved in the leasing of containers, commercial property, machinery and equipment, as well as in the financial leasing business.\n5. Tianjin Tianhai Investment Co Ltd\n* Date of trading halt: 12 January, 2018\n* Market capitalization: $2.8 billion\n* Major shareholders: HNA Logistics Group Co Ltd holds 23.40 percent\n* Core business: Formerly Tianjin Marine Shipping Co Ltd, it is engaged in sales of electronic and information technology products. It is also involved in the international and domestic shipping container transportation business and provides ship chartering service.\n6. Hainan Airlines Holding Co Ltd\n* Date of trading halt: 10 January, 2018\n* Market capitalization: $8.5 billion\n* Direct HNA stake: Hainan Airlines Group Co Ltd holds 3.61 percent. HNA also holds a larger indirect stake.\n* Core business: Hainan Airlines Holding Co Ltd provides passenger air transportation service, freight air transportation service and charter flight service. It also produces in-flight supplies, aviation equipment, and aeronautical ground equipment.\n7. CCOOP Group Co Ltd\n* Date of trading halt: 28 November, 2017\n* Market capitalization: $4.5 billion\n* Major shareholders: Haihang Business Holding Co Ltd holds 15.31 percent, HNA Investment Holding Co Ltd owns 6.50 percent\n* Core business: Formerly Xi‘an Minsheng Co Ltd, the firm is engaged in the merchandise wholesaling and retailing business. It markets jewellery, textiles, machinery, construction materials, garments, cosmetics, and home appliances through supermarkets and department stores. It is also involved in property and financial business in north and central China.\nSTILL TRADING (in order of market value, as of Jan 19, 2018):\n1. Hong Kong International Construction Investment Management Group Co Ltd\n* Market capitalization: $1.0 billion\n* Major shareholders: HNA Group Co Ltd holds 74.66 pct stake\n* Core business: Formerly Tysan Holdings Ltd, it is involved in property development, foundation piling and site investigation. 2. HNA Innovation Co Ltd\n* Market capitalization: $884.8 million\n* Major shareholders: HNA Tourism Group Co Ltd holds 18.5 percent and Shanghai HNA Daxinhua Property Ltd owns 12.01 percent\n* Core business: The company manages tourist attractions, providing tourist resort integrated management, hotel management and exhibition services.\n3. CWT International Ltd\n* Market capitalization: $539.5 million\n* Major shareholders: HNA Holding Group Co Ltd holds 57.11 pct\n* Description of company: Formerly HNA Holding Group Co Ltd, it is engaged in commodity marketing, and provides financial and logistics services.\n4. HNA Infrastructure Co Ltd\n* Market capitalization: $457 million\n* Major shareholders: Oriental Patron Asia Ltd holds a 41.58 percent stake\n* Core business: The company is in the aviation-related business, providing terminal facilities, ground handling services and passenger services.\n5. Northeast Electric Development Co Ltd\n* Market capitalization: $453.9 million\n* Major shareholders: Beijing HaiHongYuan Investment Management Co Ltd holds a 13.2 percent stake in Shenzhen-listed shares\n* Core business: The company is in the power transmission business and is also engaged in providing transformation equipment in China.\n6. HNA Technology Investments Holdings Ltd\n* Market capitalization: $139.0 million\n* Major shareholders: 75 percent owned by HNA Ecological Technology Group Co Ltd\n* Core business: Formerly Advanced Card Systems Holdings Ltd, it is involved in the development and sales of smart card products, software and hardware.\n7. Jia Yao Holdings Ltd\n* Market capitalization: $82.9 million\n* Major shareholders: 65.2 percent owned by Hainan Airlines Group Co Ltd\n* Core business: The company designs, prints and sells paper cigarette packages in China.\n8. Hifood Group Holdings Co Ltd\n* Market capitalization: $75.1 million\n* Major shareholders: 74.96 percent owned by Hainan Airlines Group Co Ltd\n* Core business: Formerly KTL International Holdings Group Ltd, it is involved in the manufacturing and sales of jewellery products.\n(Note: Data on major shareholders and market capitalization is from Thomson Reuters)\nReporting by Donny Kwok in Hong Kong and Lee Chyen Yee in Singapore; Editing by Malcolm Foster and Muralikumar Anantharaman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T10:39:00.000+02:00", "crawled": "2018-01-24T08:26:05.009+02:00", "highlightTitle": ""}