{"organizations": [], "uuid": "a603dd8ad73eff88d9609f620233c22905ad750e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220363060&w=1200&r=LYNXMPEE071GC", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-book/bannons-treasonous-comment-directed-at-trump-jr-not-manafort-author-idUKKBN1EX2BP", "country": "US", "domain_rank": 408, "title": "Bannon's 'treasonous' comment directed at Trump Jr., not Manafort - author", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:33:00.000+02:00", "replies_count": 0, "uuid": "a603dd8ad73eff88d9609f620233c22905ad750e"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-book/bannons-treasonous-comment-directed-at-trump-jr-not-manafort-author-idUKKBN1EX2BP", "ord_in_thread": 0, "title": "Bannon's 'treasonous' comment directed at Trump Jr., not Manafort - author", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 9:35 PM / Updated 8 hours ago Bannon's 'treasonous' comment directed at Trump Jr., not Manafort - author Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - Former Trump adviser Steve Bannon’s comment that a meeting between Trump campaign officials and a group of Russians was “treasonous” focussed on President Donald Trump’s son and not his former campaign manager, as Bannon now maintains, the author of a book containing the remark said on Monday. Copies of the book \"Fire and Fury: Inside the Trump White House\" by author Michael Wolff are seen at the Book Culture book store in New York, U.S. January 5, 2018. REUTERS/Shannon Stapleton \nIn the book, “Fire and Fury: Inside the Trump White House,” Bannon labelled the June 2016 meeting at Trump Tower, which Donald Trump Jr. attended, as “treasonous” and “unpatriotic.” A British publicist who helped arrange the meeting had said one of the Russians would have damaging information on Trump’s presidential opponent, Hillary Clinton. \nOn Sunday, Bannon retreated from those comments, saying Trump Jr. was a patriot and that he had labelled the actions of Trump’s former campaign manager, Paul Manafort, as treasonous, not those of the president’s son. \nThe book’s author, Michael Wolff, disputed Bannon’s account. \n“Steve was incredibly helpful on this book, and his insights are penetrating, and I don’t feel great about putting him in what seems obviously a difficult position. But he was talking about Don Jr.,” Wolff told MSNBC. “He was not talking about Paul Manafort.” \nTrump and other White House officials have attacked Bannon and the book, which they have said is riddled with lies. \nThe book, which has dominated U.S. news media since excerpts began to surface on Wednesday, depicts a chaotic White House led by a man who is mentally unstable and unfit for the job. \n“I don’t believe there’s any way back for Mr. Bannon at this point,” White House spokesman Hogan Gidley told reporters on Air Force One on Monday. “When you go after somebody’s family in the manner in which he did ... it is repugnant, it is grotesque.” \nA lawyer for Trump, Charles Harder, last week threatened to block publication of the book and demanded an apology and retraction from its publisher, Henry Holt & Co. \nElizabeth McNamara, a lawyer for Macmillan, the publisher’s parent company, fired back in a letter to Harder on Monday. \n“My clients do not intend to cease publication, no such retraction will occur and no apology is warranted,” she said. \nU.S. intelligence agencies have concluded that Russia interfered in the 2106 presidential election to try to help Trump win. Russia has denied any meddling, and Trump has said there was no collusion. Reporting by Makini Brice; Additional reporting by Blake Brittain, Katanga Johnson and Jeff Mason; Editing by Tim Ahmann and Jonathan Oatis", "external_links": [], "published": "2018-01-08T23:33:00.000+02:00", "crawled": "2018-01-09T09:36:00.421+02:00", "highlightTitle": ""}