{"organizations": [], "uuid": "2912dc0e5c0e6eee9ed20d54db17ef2eeab3cad8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-howard-moseson-joins-mufg-as-chief-strategy-officer-for-the-americas.html", "country": "US", "domain_rank": 767, "title": "Howard Moseson Joins MUFG as Chief Strategy Officer for the Americas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:01:00.000+02:00", "replies_count": 0, "uuid": "2912dc0e5c0e6eee9ed20d54db17ef2eeab3cad8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-howard-moseson-joins-mufg-as-chief-strategy-officer-for-the-americas.html", "ord_in_thread": 0, "title": "Howard Moseson Joins MUFG as Chief Strategy Officer for the Americas", "locations": [], "entities": {"persons": [{"name": "howard moseson joins mufg", "sentiment": "negative"}, {"name": "johannes", "sentiment": "none"}, {"name": "moseson", "sentiment": "none"}, {"name": "howard", "sentiment": "none"}, {"name": "worsoe", "sentiment": "none"}, {"name": "howard moseson", "sentiment": "none"}], "locations": [{"name": "americas new york", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "mitsubishi ufj financial group, inc.", "sentiment": "neutral"}, {"name": "mufg americas", "sentiment": "none"}, {"name": "citibank", "sentiment": "none"}, {"name": "worsoe", "sentiment": "none"}, {"name": "mufg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- Mitsubishi UFJ Financial Group, Inc. (MUFG) today announced that Howard Moseson, 50, has joined the company as Chief Strategy Officer for the Americas, effective immediately.\nMoseson, a seasoned business executive with substantial experience in corporate strategy, business management, risk, and wholesale and consumer banking, reports to Chief Financial Officer Johannes (Johs) Worsoe and is based in New York.\nIn his role, Moseson will lead MUFG Americas strategy development and strategic planning efforts, including management of the annual and triennial strategic planning processes and driving strategic and transformational initiatives as the firm's internal strategy consultant to business and support unit leadership.\n\"Howard is an outstanding addition to our talented strategy team and will play an instrumental role in leading and integrating our strategic planning processes and driving strategic and transformational initiatives across the firm,\" said Worsoe.\nPrior to joining MUFG, Moseson was the Head of Strategy for Citibank's Global Consumer Banking Operations. Prior to this role, he was the Global Head of Strategy for Citi Commercial Bank. Before joining Citi in 2012, he was a Partner at McKinsey & Company where he led the Middle Market Banking Practice and was a senior member of Investment and Corporate Banking and Risk Practices. Prior to McKinsey, Moseson was an investment banker for 15 years at firms including Chase, CSFB and WestLB.\nMoseson holds BA degrees in Math/Computer Science and Philosophy from Emory University and an MBA from the Fuqua School of Business at Duke University.\nAbout MUFG Americas Holdings Corporation\nHeadquartered in New York, MUFG Americas Holdings Corporation is a financial holding company, bank holding company and intermediate holding company with total assets of $154.9 billion at September 30, 2017. Its main subsidiaries are MUFG Union Bank, N.A. and MUFG Securities Americas Inc. MUFG Union Bank, N.A. provides an array of financial services to individuals, small businesses, middle-market companies, and major corporations. As of September 30, 2017, MUFG Union Bank, N.A. operated 361 branches, comprised primarily of retail banking branches in the West Coast states, along with commercial branches in Texas, Illinois, New York and Georgia, as well as 18 PurePoint Financial Centers and two international offices. MUFG Securities Americas Inc. is a registered securities broker-dealer which engages in capital markets origination transactions, private placements, collateralized financings, securities borrowing and lending transactions, and domestic and foreign debt and equities securities transactions. MUFG Americas Holdings Corporation is owned by The Bank of Tokyo-Mitsubishi UFJ, Ltd. and Mitsubishi UFJ Financial Group, Inc. The Bank of Tokyo-Mitsubishi UFJ, Ltd. is a wholly-owned subsidiary of Mitsubishi UFJ Financial Group, Inc., which is one of the world's leading financial groups. Visit www.unionbank.com or www.mufgamericas.com for more information.\nAbout Mitsubishi UFJ Financial Group and Bank of Tokyo-Mitsubishi UFJ\nMitsubishi UFJ Financial Group, Inc. (MUFG) is one of the world's leading financial groups, with total assets of approximately US$2.7 trillion as of 30 September 2017. Headquartered in Tokyo and with approximately 350 years of history, MUFG is a global network with over 2,300 offices across more than 50 countries. The Group has about 150,000 employees and close to 300 entities, offering services including commercial banking, trust banking, securities, credit cards, consumer finance, asset management, and leasing. The Group's operating companies include Bank of Tokyo-Mitsubishi UFJ, Mitsubishi UFJ Trust and Banking Corporation (Japan's leading trust bank), and Mitsubishi UFJ Securities Holdings Co., Ltd., one of Japan's largest securities firms. The Bank of Tokyo-Mitsubishi UFJ, Ltd. is Japan's premier bank, with a global network spanning around 50 countries. Outside of Japan, the bank offers an extensive scope of commercial and investment banking products and services to businesses, governments and individuals worldwide. Through close partnerships among our operating companies, the Group aims to \"be the world's most trusted financial group\", flexibly responding to all of the financial needs of our customers, serving society, and fostering shared and sustainable growth for a better world. MUFG's shares trade on the Tokyo, Nagoya, and New York (NYSE: MTU) stock exchanges. For more information, visit www.mufg.jp/english .\nView original content with multimedia: http://www.prnewswire.com/news-releases/howard-moseson-joins-mufg-as-chief-strategy-officer-for-the-americas-300583262.html\nSOURCE MUFG Americas Holdings Corporation", "external_links": ["http://www.unionbank.com/", "http://www.prnewswire.com/news-releases/howard-moseson-joins-mufg-as-chief-strategy-officer-for-the-americas-300583262.html", "http://www.mufg.jp/english", "http://www.mufgamericas.com/"], "published": "2018-01-17T00:01:00.000+02:00", "crawled": "2018-01-17T02:07:05.009+02:00", "highlightTitle": ""}