{"organizations": [], "uuid": "4c786d64de9d533e94ca5f345f19716d8bddd2d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-patrick-industries-inc-announces-pricing-of-upsized-offering-of-150-million-convertible-senior-notes-due-2023.html", "country": "US", "domain_rank": 767, "title": "Patrick Industries, Inc. Announces Pricing of Upsized Offering of $150 Million Convertible Senior Notes Due 2023", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:38:00.000+02:00", "replies_count": 0, "uuid": "4c786d64de9d533e94ca5f345f19716d8bddd2d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-patrick-industries-inc-announces-pricing-of-upsized-offering-of-150-million-convertible-senior-notes-due-2023.html", "ord_in_thread": 0, "title": "Patrick Industries, Inc. Announces Pricing of Upsized Offering of $150 Million Convertible Senior Notes Due 2023", "locations": [], "entities": {"persons": [], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}], "organizations": [{"name": "patrick industries, inc.", "sentiment": "neutral"}, {"name": "patrick industries, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Jan. 17, 2018 /PRNewswire/ -- Patrick Industries, Inc. (NASDAQ: PATK) (\"Patrick\" or the \"Company\") announced today the pricing of its private offering of $150 million aggregate principal amount of its convertible senior notes due 2023 (the \"Convertible Notes\") in a private placement to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"). The Company also granted the initial purchasers of the Convertible Notes a 30-day option to purchase up to an additional $22.5 million aggregate principal amount of the Convertible Notes, solely to cover over-allotments, if any. The aggregate principal amount of the offering was increased from the previously announced offering size of $125 million. The sale of the Convertible Notes to the initial purchasers is expected to settle on or about January 22, 2018, subject to customary closing conditions, and is expected to result in approximately $145.1 million in net proceeds to the Company, after deducting the initial purchasers' discount and estimated offering expenses payable by the Company (assuming no exercise of the initial purchasers' over-allotment option) but before deducting the net cost of the convertible note hedge and warrant transactions referred to below.\nThe Convertible Notes will bear interest at a rate of 1.00% per year, payable semiannually in arrears on February 1 and August 1 of each year, beginning August 1, 2018, and will mature on February 1, 2023 unless earlier purchased or converted. The initial conversion rate for the Convertible Notes is 11.3785 shares of the Company's common stock per $1,000 principal amount of Convertible Notes (which is equivalent to an initial conversion price of approximately $87.89 per share, which represents a premium of approximately 35% over the $65.10 per share last reported sale price of the Company's common stock on January 17, 2018). Prior to August 1, 2022, the Convertible Notes may be converted at the option of the holders only upon the occurrence of specified events and during certain periods, and thereafter until the close of business on the second scheduled trading day immediately preceding the maturity date, the Convertible Notes may be converted at any time. Upon conversion, the Convertible Notes will settle for cash, shares of the Company's common stock, or a combination thereof, at the Company's option.\nIn connection with the offering, the Company entered into convertible note hedge transactions with certain of the initial purchasers of the Convertible Notes or their respective affiliates (in this capacity, the \"option counterparties\"). The Company also entered into warrant transactions with the option counterparties. The convertible note hedge transactions are expected generally to reduce potential dilution to the Company's common stock upon any conversion of the Convertible Notes and/or offset any cash payments the Company is required to make in excess of the principal amount of converted Convertible Notes, as the case may be. However, the warrant transactions could separately have a dilutive effect to the extent that the market value per share of the Company's common stock exceeds upon expiration the applicable strike price of the warrants. The strike price of the warrant transactions will initially be $113.9250 per share, which represents a premium of 75% over the last reported sale price of the Company's common stock on January 17, 2018 and is subject to certain adjustments under the terms of the warrant transactions.\nIn connection with establishing their initial hedges of the convertible note hedge and warrant transactions, the option counterparties or their respective affiliates expect to enter into various derivative transactions with respect to the Company's common stock concurrently with or shortly after the pricing of the Convertible Notes. This activity could increase (or reduce the size of any decrease in) the market price of the Company's common stock or the Convertible Notes at that time. In addition, the option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to the Company's common stock and/or purchasing or selling the Company's common stock or other securities of the Company in secondary market transactions following the pricing of the Convertible Notes and prior to the maturity of the Convertible Notes (and are likely to do so during any observation period related to a conversion of Convertible Notes). This activity could also cause or avoid an increase or a decrease in the market price of the Company's common stock or the Convertible Notes, which could affect the ability of noteholders to convert the Convertible Notes and, to the extent the activity occurs during any observation period related to a conversion of Convertible Notes, it could affect the number of shares and value of the consideration that a noteholder will receive upon conversion of the Convertible Notes.\nThe Company intends to use a portion of the net proceeds from this offering to pay the cost of the convertible note hedge transactions, after such cost is partially offset by the proceeds to the Company from the warrant transactions. The Company intends to use the remainder of the net proceeds from this offering in alignment with its capital allocation strategy, which includes funding future potential acquisitions, investing in its infrastructure through strategic capital expenditures and expansions, and for general corporate purposes. Pending these uses, the Company intends to use the remainder of the net proceeds from this offering to repay a portion of the amounts due under its current credit facility.\nIf the initial purchasers exercise their option to purchase additional Convertible Notes, the Company expects to sell additional warrants to the option counterparties and use a portion of the net proceeds from the sale of the additional Convertible Notes, together with the proceeds from the sale of the additional warrants, to enter into additional convertible note hedge transactions with the option counterparties. Any remaining proceeds will be used for the purposes as described above.\nThe offer and sale of the Convertible Notes are not being registered under the Securities Act, or the securities laws of any other jurisdiction. The Convertible Notes may not be offered or sold in the United States except in transactions exempt from, or not subject to, the registration requirements of the Securities Act and any applicable state securities laws.\nIn addition, the Company has received commitments from its existing lenders to increase the maximum amount available under its credit facility by an incremental $50.0 million to $484 million, subject to certain diligence conditions and expects that this increase in borrowing availability will be available in the first quarter of 2018.\nThis press release does not constitute an offer to s", "external_links": ["http://www.prnewswire.com/news-releases/patrick-industries-inc-announces-pricing-of-upsized-offering-of-150-million-convertible-senior-notes-due-2023-300584390.html"], "published": "2018-01-18T06:38:00.000+02:00", "crawled": "2018-01-18T08:20:31.025+02:00", "highlightTitle": ""}