{"organizations": [], "uuid": "c4c715e7f146b80b839dfa1bdab1abfad2872bca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-orbotech-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results-updates-2018-guidance-with-specific-revenue-outlook.html", "country": "US", "domain_rank": 767, "title": "Orbotech Announces Preliminary Fourth Quarter and Fiscal Year 2017 Results; Updates 2018 Guidance With Specific Revenue Outlook for the First Half of 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:00:00.000+02:00", "replies_count": 0, "uuid": "c4c715e7f146b80b839dfa1bdab1abfad2872bca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-orbotech-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results-updates-2018-guidance-with-specific-revenue-outlook.html", "ord_in_thread": 0, "title": "Orbotech Announces Preliminary Fourth Quarter and Fiscal Year 2017 Results; Updates 2018 Guidance With Specific Revenue Outlook for the First Half of 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "orbotech", "sentiment": "neutral"}, {"name": "orbotech ltd.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YAVNE, Israel, Jan. 17, 2018 /PRNewswire/ --\nOrbotech LTD. (NASDAQ: ORBK) (the \" Company \" or \" Orbotech \"), a leading global supplier of yield-enhancing and process-enabling solutions for the manufacture of electronics products, today announced preliminary fourth quarter and fiscal year 2017 results and is updating its full year 2018 guidance with a specific revenue outlook for the first half of 2018.\nPreliminary Fourth Quarter and Full Year 2017 Highlights:\nRevenue is expected to be approximately $256 million for the fourth quarter, and $900 million for the full year, of 2017 Gross margin is expected to be in the range of 47%-47.5% in the fourth quarter and for the full year of 2017. Gross margin is slightly lower than the Company anticipated in November 2017, due to strong demand that accelerated the volume of orders late in 2017 coupled with expedited shipments to meet customer demand in a tightening supply chain environment. Operating expenses in the fourth quarter of 2017 are expected to increase by 8%-10% compared to the previous quarter, due primarily to the acceleration of research and development projects and other variable expenses to support a higher level of growth expected in 2018. The increase in operating expenses is reducing proportionately the fourth quarter and full year net income, Adjusted EBITDA margin and GAAP and non-GAAP EPS guidance provided in November.\n2018 Guidance:\n12-14% revenue growth for full year 2018 reflecting the Company's view that its expected CAGR will be spread more evenly throughout the years of the Company's financial model. Revenues for the first half of 2018 are expected to be approximately $500 million, with approximately $235 million - $250 million in the first quarter. Gross margin for the first half of 2018 is expected to be in the range of 47.5%-48.0% and the quarterly operating expenses in the first half of 2018 are expected to be similar to those in the fourth quarter of 2017, based upon the Company's current expectations of product mix.\nCommenting on this announcement, Mr. Asher Levy, Chief Executive Officer, stated: \"As we highlighted at our Investor Day in November 2017, Orbotech offers unique solutions to the manufacturing processes for the world's most advanced consumer and industrial electronic products.\" He continued: \"Orbotech is part of a select group of companies that is, literally, shaping the future of electronics, and we benefit from the adoption of new technologies in the industries we serve. The innovativeness of our solutions and the recent introductions of new products and technologies is resulting in stronger revenue momentum and improved visibility as we enter 2018. We are proud of our growth and improving profitability year over year and believe the margin goals announced at our Investor Day remain solidly within our grasp.\"\nNeedham Growth Conference\nThe foregoing results are being provided in advance of Mr. Levy, Mr. Amichai Steimberg, President and Chief Operating Officer, and Mr. Alon Rozner, Chief Financial Officer, presenting at the 2018 Needham Growth Conference on January 17, 2018 at the Lotte New York Palace. The presentation is scheduled for 4:50 P.M., Eastern Time, on January 17, 2018, and will be webcast on the Investor events page of the Orbotech Ltd. website. A replay of the webcast will remain available for 90 days.\nPreliminary Financial Information\nThe preliminary results set forth above are based on management's initial review of the Company's operations for the quarter and year ended December 31, 2017, and are subject to revision based upon the Company's year-end closing procedures and the completion and external audit of the Company's year-end financial statements. Actual results may differ materially from these preliminary results as a result of the completion of year-end closing procedures, final adjustments and other developments arising between now and the time that the Company's financial results are finalized, and such changes could be material. In addition, these preliminary results are not a comprehensive statement of the Company's financial results for the fourth quarter or full year ended December 31, 2017, should not be viewed as a substitute for full, audited financial statements prepared in accordance with generally accepted accounting principles, and are not necessarily indicative of the Company's results for any future period. The Company expects to announce full 2017 financial results in advance of its quarterly conference call, currently scheduled for February 14, 2018. A conference call and webcast will be held at 8:30 A.M. Eastern time on that date. To access the call please dial +13237010225 or toll free 8883948218 passcode: 4004533. Investors may access the webcast from the Company's website at investors.orbotech.com . The replay will be available for two weeks. To access the replay please dial +17194570820 or toll free 8882031112.\nAbout Orbotech Ltd.\nOrbotech Ltd. is a leading global supplier of yield-enhancing and process-enabling solutions for the manufacture of electronics products. Orbotech provides cutting-edge solutions for use in the manufacture of PCBs, FPDs and SDs, designed to enable the production of innovative, next generation electronic products and improve the cost effectiveness of existing and future electronics production processes. Orbotech's core business lies in enabling electronic device manufacturers to inspect and understand PCBs and FPDs to verify their quality ('reading'); pattern the desired electronic circuitry on the relevant substrate and perform three dimensional shaping of metalized circuits on multiple surfaces ('writing'); and utilize advanced vacuum deposition and etching processes in SD and semiconductor manufacturing ('connecting'). Orbotech refers to this 'reading', 'writing' and 'connecting' as enabling the 'Language of Electronics'. For further information, visit http://www.orbotech.com .\nCautionary Statement Regarding Forward-Looking Statements\nExcept for historical information, the matters discussed in this press release are forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. These statements relate to, among other things, future prospects, developments and business strategies and involve certain risks and uncertainties. The words \"anticipate,\" \"believe,\" \"could,\" \"will,\" \"plan,\" \"expect\" and \"would\" and similar terms and phrases, including references to assumptions, have been used in this press release to identify forward-looking statements. These forward-looking statements are made based on management's expectations and beliefs concerning future events affecting Orbotech and are subject to uncertainties and factors relating to Orbotech's operations and business environment, all of which are difficult to predict and many of which are beyond the Company's control. Many factors could cause the actual results to differ materially from those projected including, without limitation, the risk that our actual revenue or other financial results for the fourth quarter and/or full year 2017 may differ materially from our estimated results for these periods as a result of the completion of year-end closing procedures, final adjustments or other developments arising between n", "external_links": ["http://www.orbotech.com/", "http://www.prnewswire.com/news-releases/orbotech-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results-updates-2018-guidance-with-specific-revenue-outlook-for-the-first-half-of-2018-300583788.html"], "published": "2018-01-17T14:00:00.000+02:00", "crawled": "2018-01-17T17:31:12.003+02:00", "highlightTitle": ""}