{"organizations": [], "uuid": "7c817b73d4f01898e26bc11a490b354425945825", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/11/reuters-america-rpt-column-oil-prices-expected-to-trade-around-60-70-through-2020-kemp.html", "country": "US", "domain_rank": 767, "title": "RPT-COLUMN-Oil prices expected to trade around $60-$70 through 2020: Kemp", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:00:00.000+02:00", "replies_count": 0, "uuid": "7c817b73d4f01898e26bc11a490b354425945825"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-rpt-column-oil-prices-expected-to-trade-around-60-70-through-2020-kemp.html", "ord_in_thread": 0, "title": "RPT-COLUMN-Oil prices expected to trade around $60-$70 through 2020: Kemp", "locations": [], "entities": {"persons": [{"name": "kemp", "sentiment": "negative"}, {"name": "john kemp", "sentiment": "neutral"}, {"name": "br", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats with no changes. John Kemp is a Reuters market analyst. The views expressed are his own)\n* Survey results: http://tmsnrt.rs/2DjWDNK\nLONDON, Jan 11 (Reuters) - Oil prices are expected to remain close to current levels, averaging around $60 to $70 per barrel through the end of the decade, according to the annual survey of energy professionals conducted by Reuters.\nForecast prices have changed very little since the last survey a year ago, and are only modestly higher than in the first survey conducted in 2016, when spot prices were much lower than they are today and near the bottom of the cycle.\nLong-term price expectations have become anchored around $70 per barrel - with forecasts clustered in a range of $60-$70 for 2018 widening to $60-$80 by 2020 (http://tmsnrt.rs/2DjWDNK).\nThe results are based on a questionnaire sent to over 7,000 energy market professionals. Responses were received from just over 1,000 between Jan. 9 and Jan. 11.\nBrent prices in 2018 are expected to average $65 per barrel, which is only marginally higher than the $60-65 forecast in last year's survey. Brent prices in 2019 are expected to average $65-70, up from about $65 in the 2017 survey.\nBy the end of the decade, prices are expected to average around $70 in 2020, basically unchanged since the surveys in 2017 and even 2016.\nForecasts for 2018 and even 2019 are tightly clustered, with only 5 percent of respondents expecting prices to average less than $55 per barrel in either year.\nSimilarly, only 5 percent of respondents think prices will average more than $75 in 2018 or more than $85 in 2019.\nEven by 2020, the majority of respondents think prices will average between $60 and $80, with few expecting prices to be below $55 or above $85.\nCompared with previous surveys, fewer forecasters expect prices to slump again to very low levels in the $30s and $40s which perhaps reflects growing confidence in the sustainability of the cyclical recovery.\nThere has been a lot of commentary about the risk of prices spiking towards the end of the decade because of the dearth of investment in new supply since prices slumped in 2014.\nBut only 4 percent of respondents expect prices to return to average $100 or more by 2020, the level that prevailed between 2011 and the first half of 2014.\nAmong survey respondents, 25 percent are involved directly in oil and gas production (exploration, drilling, production, refining, marketing and field services).\nMost of the rest are involved in banking and finance (18 percent), research (9 percent), hedge funds (9 percent), professional services (8 percent) and physical commodity trading (8 percent).\nThe results from respondents involved directly in the oil and gas industry were very similar to those in other sectors.\nOil and gas industry insiders and those outside the industry have identical views about the outlook for prices in 2018.\nInsiders are marginally more bullish than outsiders for prices by the end of the decade but the difference amounts only around $3 per barrel and is not really significant.\nRelated column:\n\"Oil price forecasts for 2017, 2018 rise as downside risks fall,\" Reuters, Jan. 12, 2017\n(Editing by David Evans)", "external_links": [], "published": "2018-01-12T03:00:00.000+02:00", "crawled": "2018-01-14T00:10:36.000+02:00", "highlightTitle": ""}