{"organizations": [], "uuid": "cbbf25bf3b7498faf201616147a65eefd7ab48a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/06/104204504-GettyImages-631018444.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/stocks-making-the-biggest-moves-premarket-dps-lmt-cbs-wynn-aapl-fb-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: DPS, LMT, CBS, WYNN, AAPL, FB & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.048, "site_type": "news", "published": "2018-01-29T15:11:00.000+02:00", "replies_count": 0, "uuid": "cbbf25bf3b7498faf201616147a65eefd7ab48a7"}, "author": "Peter Schacknow", "url": "https://www.cnbc.com/2018/01/29/stocks-making-the-biggest-moves-premarket-dps-lmt-cbs-wynn-aapl-fb-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: DPS, LMT, CBS, WYNN, AAPL, FB & more", "locations": [], "entities": {"persons": [{"name": "wynn", "sentiment": "none"}, {"name": "wells", "sentiment": "none"}], "locations": [], "organizations": [{"name": "aapl", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "negative"}, {"name": "lmt", "sentiment": "negative"}, {"name": "cbs", "sentiment": "negative"}, {"name": "wynn", "sentiment": "negative"}, {"name": "dps", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "dr pepper snapple", "sentiment": "none"}, {"name": "viacom", "sentiment": "none"}, {"name": "lockheed", "sentiment": "none"}, {"name": "keurig dr pepper", "sentiment": "none"}, {"name": "keurig green mountain", "sentiment": "none"}, {"name": "lockheed martin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nDr Pepper Snapple – The beverage maker will merge with privately held Keurig Green Mountain, forming a new company called Keurig Dr Pepper. Dr Pepper Snapple shareholders will receive $103.75 per share in cash, and will also hold 13 percent of the combined company.\nLockheed Martin – The defense contractor earned an adjusted $4.30 per share for the fourth quarter, beating estimates by 23 cents a share. Revenue easily exceeded forecasts. Lockheed took a $1.9 billion one-time charge related to the new tax law.\nCBS – The stock was downgraded to \"market perform\" from \"outperform\" at Wells Fargo, which has a negative opinion of a possible recombination of CBS and Viacom . Wells said it does not view such an event as a positive but rather a \"slapping together\" of two complete different companies just to get bigger.\nMarathon Petroleum – The energy producer raised its quarterly dividend by 15 percent to 46 cents per share.\nWynn Resorts – The casino operator's shares remain under pressure following Friday's allegations of sexual misconduct against CEO Steve Wynn. Wynn has vehemently denied those reports, but has resigned as Republican National Committee finance chair in the wake of the allegations.\nApple – The company is said to be cutting first-quarter iPhone product in half due to slower-than-expected holiday sales, according to Japan's Nikkei newspaper.\nLowe's – Lowe's authorized a new $5 billion stock buyback program, added to an already existing $2.1 billion authorization for the home improvement retailer.\nAblynx – Ablynx agreed to be bought by French drugmaker Sanofi . Sanofi beat out Novo Nordisk in the bidding for the Belgian biotech company, agreeing to pay $4.8 billion. Ablynx had rejected a roughly $3.2 billion offer from Novo Nordisk.\nFacebook – Facebook plans to publish its privacy principle for the first time , according to a blog post by Facebook chief privacy officer Erin Egan. It will also roll out educational videos detailing who has access to a user's information.\nDiebold , NCR – The ATM manufacturers have issued warnings that cybercriminals are targeting ATM machines with the aim of \"jackpotting,\" or getting the machines to give out large sums of cash. The two companies are among the world's largest makers of automated teller machines.\nAvon Products – The cosmetics company is being pushed by activist investors to seek a buyer, according to The Wall Street Journal. Shah Capital, Barington Capital, and NuOrion Partners have formed an alliance to make that push, according to the Journal.\nIntel – Intel is said to have told China-based customers of security flaws in its chips before it informed the U.S. government, according to people familiar with the matter Quote: d by The Wall Street Journal.\nPayPal – PayPal and others involved in digital payments could face a new rival in Softbank. London's Sunday Times is reporting that Softbank is working on creating a new digital payments system.\nVolkswagen – Volkswagen's stock was upgraded to \"buy\" from \"underperform\" at Bank of America/Merrill Lynch, which cited possible break-up value in the automaker's stock.", "external_links": [], "published": "2018-01-29T15:11:00.000+02:00", "crawled": "2018-01-29T15:19:37.021+02:00", "highlightTitle": ""}