{"organizations": [], "uuid": "2fb3badcb55cd587552443b9d952d2635372985a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/24/104303308-20150114-3992-1035rr.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/robert-shiller-says-bitcoin-is-an-interesting-experiment.html", "country": "US", "domain_rank": 767, "title": "Robert Shiller says bitcoin is an 'interesting experiment'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.157, "site_type": "news", "published": "2018-01-26T16:54:00.000+02:00", "replies_count": 0, "uuid": "2fb3badcb55cd587552443b9d952d2635372985a"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/26/robert-shiller-says-bitcoin-is-an-interesting-experiment.html", "ord_in_thread": 0, "title": "Robert Shiller says bitcoin is an 'interesting experiment'", "locations": [], "entities": {"persons": [{"name": "robert shiller", "sentiment": "negative"}, {"name": "shiller", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "cme group", "sentiment": "none"}, {"name": "cboe", "sentiment": "none"}, {"name": "cme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin has \"gone viral as a currency\" and its price instability is a concern, economist Robert Shiller said Thursday.\nSpeaking at the World Economic Forum (WEF) in Davos, Switzerland, Shiller compared the cryptocurrency to other attempts to \"change\" currency.\nReferring to concepts like the Unidad de Fomento — a Chilean unit of account that is constantly adjusted for inflation to maintain price stability — the Nobel Prize winner said bitcoin was \"another really clever idea.\"\n\"I tend to think of bitcoin as an experiment,\" he said. \"It is an interesting experiment, but it's not a permanent feature of our lives. We are over-emphasizing bitcoin, we should broaden it out to blockchain, which will have other applications.\" Blockchain is the technology that underpins bitcoin and other cryptocurrencies. It is a decentralized network that records cryptocurrency transactions.\nShiller said the world should be looking to mimic Chile's Unidad de Fomento instead.\nA number of critics have slammed the world of digital currencies recently over concerns of its volatile nature and of illegal activities associated with it — and the fact that it is near-impossible to regulate.\nshow chapters Bitcoin is like gambling, Bank of Canada governor says      8:11 AM ET Thu, 25 Jan 2018 | 05:58 South Korea, for instance, reportedly wants to ban the trading of cryptocurrencies via exchanges, while China is looking to block local access to Chinese and offshore cryptocurrency platforms.\nBitcoin futures Two huge derivatives operators, CME Group and the Cboe , have launched bitcoin futures contracts for the world's biggest digital currency to allow investors a venue in which to bet on price movements.\nExperts have said that they expect this development to bring in more institutional money to the asset.\nSpeaking about bitcoin futures, Shiller said he was \"struck\" by the fact that, although investors are able to short bitcoin, it is \"difficult\" to do so. Shorting refers to a method used by traders to sell an asset in advance of acquiring it at a lower price to make a profit.\n\"Financial theory says that if something is not shortable then it can be taken over by enthusiasts, and the doubters can no longer have an adequate way of vetting against,\" he said.\n\"We've just seen that both the Cboe and CME have both created futures markets for bitcoin and that might make it more stable.\"\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-26T16:54:00.000+02:00", "crawled": "2018-01-26T16:56:30.009+02:00", "highlightTitle": ""}