{"organizations": [], "uuid": "985e495ff7d4ccb96297fd67f980f35ea7abe0af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219255148&w=1200&r=LYNXMPEE030E1", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-bond-rules/china-tightens-bond-trading-rules-in-deleveraging-campaign-sources-idINKBN1ET0O2", "country": "US", "domain_rank": 408, "title": "China tightens bond trading rules in deleveraging campaign: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T09:36:00.000+02:00", "replies_count": 0, "uuid": "985e495ff7d4ccb96297fd67f980f35ea7abe0af"}, "author": "", "url": "https://in.reuters.com/article/china-bond-rules/china-tightens-bond-trading-rules-in-deleveraging-campaign-sources-idINKBN1ET0O2", "ord_in_thread": 0, "title": "China tightens bond trading rules in deleveraging campaign: sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "min read  shanghai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI (Reuters) - China’s financial authorities have published new rules to regulate bond trading, with a focus on restricting leverage and banning under-the-table deals designed to skirt regulations, people familiar with the matter told Reuters.\nChinese 100 yuan banknotes are seen in a counting machine while a clerk counts them at a branch of a commercial bank in Beijing, China, March 30, 2016. REUTERS/Kim Kyung-Hoon/Files The rules, jointly issued by the People’s Bank of China and China’s banking, securities and insurance regulators, come as Beijing launches a series of co-ordinated initiatives across government agencies designed to reduce leverage in the financial system.\nUnder the new rules, a copy of which was seen by Reuters and confirmed by three sources, institutions must sign written deals when conducting bond repurchase or bond forward transactions. Any deals designed to dodge regulatory requirements are to be banned, the rules stated.\nThe new rules order financial institutions to report financial data to regulators if their outstanding repurchase agreements, known as repos, and reverse repo volumes exceed a certain limit.\nThe PBOC did not immediately respond to faxed questions about the rules, which was distributed to financial institutions on Dec. 29.\nChina is escalating a campaign to reduce excessive leverage in the banking system that threatens financial stability.\nIn November, Beijing formally set up its State Council Financial Stability and Development Committee to strengthen financial supervision. In the same month, China’s central bank drafted sweeping rules to tighten supervision of the country’s $9 trillion asset management industry to curb shadow banking.\n“All these measures are aimed at deleveraging, and preventing systemic risks in the financial industry, after years of aggressive expansion by financial institutions,” said Zhang Zibing, chief investment officer at Shanghai-based asset manager Bona Capital.\nA China yuan note is seen in this illustration photo May 31, 2017. REUTERS/Thomas White/Illustration/Files “Banks must change their mentality, both in their growth models, and in how they allocate their assets,” Zhang said, adding he expects bond yields to remain elevated this year.\nYields of China’s benchmark 10-year government bonds climbed steadily in 2017, and on Thursday hovered around the highest level in three years, at 3.937 percent.\nBy publishing the new bond trading rules, regulators are seeking to avoid a repeat of the $2.4 billion bond scandal involving Chinese brokerage Sealand Securities in late 2016, which triggered panic across the country’s financial markets.\nAlthough Sealand Securities blamed “forged” bond agreements, analysts largely pointed to a popular practice called “daichi”, which is Chinese for “pledged financing” and works in a similar manner to repo agreements, although such transactions are made through informal, oral agreements.\nThe new rules would effectively terminate the practice, which traders have used to keep increased leverage off the regulatory radar.\nThey would also restrict leverage by setting a cap on repo or reserve transactions, tools which help some institutions to channel short-term borrowings into longer-term assets for profit.\nFor deposit-taking institutions, if the outstanding volume of such transactions exceeds 80 percent of their net assets, they need to report their financial data to regulators.\nThe cap is 120 percent for securities firms, fund houses and futures brokerages. For insurers, the limit is set at 20 percent of their total assets.\nReporting by Shanghai Newsroom; Editing by Richard Borsuk and Sam Holmes\n ", "external_links": [], "published": "2018-01-04T09:36:00.000+02:00", "crawled": "2018-01-04T09:57:05.000+02:00", "highlightTitle": ""}