{"organizations": [], "uuid": "9b602e6a564e369a4d7dc83264f75532196bfe69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/05/jared-kushner-ivanka-trump-white-house-family.jpg", "site_section": "https://news.google.com/news/feeds?output=rss&#038;q=graffiti+street+art", "section_title": "Top Stories - Google News", "url": "http://fortune.com/2018/01/16/kushner-trump-deng-murdoch-china-spy/", "country": "US", "domain_rank": 1196, "title": "What You Need to Know About Jared Kushner, Ivanka Trump, Wendi Deng Murdoch, and Chinese Spying - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T12:52:00.000+02:00", "replies_count": 0, "uuid": "9b602e6a564e369a4d7dc83264f75532196bfe69"}, "author": "", "url": "http://fortune.com/2018/01/16/kushner-trump-deng-murdoch-china-spy/", "ord_in_thread": 0, "title": "What You Need to Know About Jared Kushner, Ivanka Trump, Wendi Deng Murdoch, and Chinese Spying - Fortune", "locations": [], "entities": {"persons": [{"name": "wendi deng murdoch", "sentiment": "neutral"}, {"name": "hallie detrick", "sentiment": "neutral"}, {"name": "ivanka trump", "sentiment": "neutral"}, {"name": "jared kushner", "sentiment": "neutral"}, {"name": "deng wen gi", "sentiment": "none"}, {"name": "kushner", "sentiment": "none"}, {"name": "murdoch", "sentiment": "none"}, {"name": "deng murdoch", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "jake cherry", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "neutral"}, {"name": "yale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Hallie Detrick 5:52 AM EST \nOn Monday, the Wall Street Journal reported that counterintelligence officials in early 2017 warned Jared Kushner that Wendi Deng Murdoch might be using her relationship with Kushner and his wife, Ivanka Trump, to aid the Chinese government. Here’s what you need to know. Who is Wendi Deng Murdoch? \nBorn Deng Wen Gi in 1968 in China, Chinese-American businesswoman Wendi Deng Murdoch studied in the U.S. and holds an MBA from Yale. She gained a green card through her first marriage to Jake Cherry. She later worked at a television station in Hong Kong where she met her second husband, media magnate Rupert Murdoch. The couple were married from 1999 to 2013, when he filed for divorce. \nHer public life has been salacious and scandal-ridden, with particular attention on her relationships with men. Her first marriage reportedly broke up when her husband, who was 30 years her senior, found out she was seeing another man. When her marriage with Murdoch ended, there was speculation that the split was caused by Deng Murdoch’s alleged “crush” on former British Prime Minister Tony Blair. In 2016, there was speculation about a relationship between Deng Murdoch and Russian president Vladimir Putin. Why does the U.S. think she’s a foreign agent? \nPeople familiar with the matter told the Wall Street Journal that Deng Murdoch could be using her relationship with Jared Kushner and Ivanka Trump to push a Chinese agenda According to the Wall Street Journal , counterintelligence officials were especially concerned about a garden project at the National Arboretum in Washington, DC that they say Deng Murdoch has been lobbying for. Plans for the garden contain a tall tower, which officials say could be used for surveillance. \nA spokesperson for Deng Murdoch said she had no knowledge of such a project. Kushner and Ms. Trump said the warning came during a routine briefing and was not based on any official accusation, going on to defend the couple’s relationship with Deng Murdoch. Why does it matter? \nIn an administration that contains many staffers and advisers who are new to politics, foreign policy and diplomacy have been pursued in a sometimes-non-traditional manner, and members of the administration have sometimes been accused of misconduct in these matters. The administration is still trying to shake accusations of helping Russia meddle in the 2016 campaign, so any suspicion of further collusion with foreign agents is sure to be disruptive. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-16T12:52:00.000+02:00", "crawled": "2018-01-16T13:21:04.023+02:00", "highlightTitle": ""}