{"organizations": [], "uuid": "db2964db08571658f7260ddfda5a9be2f08cceb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224562850&w=1200&r=LYNXMPEE0M1O6", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/chile-politics/chilean-president-elect-names-larrain-as-finance-minister-again-idINKBN1FC2P2", "country": "US", "domain_rank": 408, "title": "Chilean president-elect names Larrain as finance minister again", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:05:00.000+02:00", "replies_count": 0, "uuid": "db2964db08571658f7260ddfda5a9be2f08cceb9"}, "author": "", "url": "https://in.reuters.com/article/chile-politics/chilean-president-elect-names-larrain-as-finance-minister-again-idINKBN1FC2P2", "ord_in_thread": 0, "title": "Chilean president-elect names Larrain as finance minister again", "locations": [], "entities": {"persons": [{"name": "larrain", "sentiment": "negative"}, {"name": "sebastian pinera", "sentiment": "none"}, {"name": "pinera", "sentiment": "none"}, {"name": "michelle bachelet", "sentiment": "none"}, {"name": "felipe larrain", "sentiment": "none"}, {"name": "fabian cambero", "sentiment": "none"}], "locations": [{"name": "chile", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  santiago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTIAGO (Reuters) - Chile’s conservative President-elect Sebastian Pinera on Tuesday named a former finance minister in the top copper exporter, Felipe Larrain, to fill the same spot again in his new cabinet.\nPinera, a billionaire businessman who won the presidency last month, governed the country from 2010 to 2014, at a time when high copper prices helped underpin a fast-growing economy.\nLarrain was finance minister throughout Pinera’s administration. The Harvard-trained economist will likely be seen by the market as a safe pair of hands, but this time around will inherit an economy that has slowed to an annual average of 1.8 percent growth, although rising copper prices have increased optimism.\nPinera, who is due to take over from outgoing President Michelle Bachelet on March 11, unveiled his full cabinet on Tuesday. He repeated campaign promises to jumpstart Chile’s sluggish economy and “correct” the progressive labour, tax and education reforms carried out by Bachelet’s centre-left administration.\n“We are going to have to make an enormous effort to perfect our democracy, to modernize our state and institutions so that they ... serve all Chileans,” he said at a press conference in the former Congress building in Santiago.\nThe new Minister of Finance, Felipe Larrain is seen after being appointed by Chilean President-elect Sebastian Pinera for his term 2018-2022, in Santiago, Chile, January 23, 2018. REUTERS/Pablo Sanhueza He named senator and long-time politician Baldo Prokurica as incoming mining minister.\nProkurica hails from the small city of Vallenar, in northern Chile, a region known for its vast copper and lithium deposits. A lawyer and legislator of nearly 30 years, he previously served as president of the legislature’s Commission on Mining and Energy.\nChilean President-elect Sebastian Pinera, shakes hands with his new mining minister, Baldo Prokurica, during the presentation of his presidential cabinet for his term 2018-2022 in Santiago, Chile January 23, 2018. REUTERS/Pablo Sanhueza Chile’s mining industry remains robust, accounting for as much as 15 percent of gross domestic product, depending on the copper price. But Prokurica will face many challenges, including declining ore grades, a relative lack of new investment and complex labour relations.\nWell-known local writer Roberto Ampuero, who served as culture minister during Pinera’s first term, will be foreign minister.\nAmpuero’s first task will likely be overseeing Chile’s defence against Bolivia at the United Nations’ International Court of Justice in The Hague.\nBolivia, Chile’s landlocked neighbour to the northeast, has demanded Chile grant it sovereign access to the sea.\nReporting by Fabian Cambero, Writing by Dave Sherwood; Editing by Jeffrey Benkoe and Rosalba O'Brien\n ", "external_links": [], "published": "2018-01-23T21:05:00.000+02:00", "crawled": "2018-01-23T21:44:52.007+02:00", "highlightTitle": ""}