{"organizations": [], "uuid": "6f5d2e269f1bc4c393a0bc2e73f360bbe43ba818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224925867&w=1200&r=LYNXMPEE0N249", "site_section": "http://feeds.reuters.com/reuters/UKScienceNews", "section_title": "Reuters: Science News", "url": "https://uk.reuters.com/article/us-science-brain/mind-bender-shape-of-human-brain-evolved-over-time-idUKKBN1FD2ZD", "country": "US", "domain_rank": 408, "title": "Mind bender: shape of human brain evolved over time", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T22:55:00.000+02:00", "replies_count": 0, "uuid": "6f5d2e269f1bc4c393a0bc2e73f360bbe43ba818"}, "author": "", "url": "https://uk.reuters.com/article/us-science-brain/mind-bender-shape-of-human-brain-evolved-over-time-idUKKBN1FD2ZD", "ord_in_thread": 0, "title": "Mind bender: shape of human brain evolved over time", "locations": [], "entities": {"persons": [{"name": "simon neubauer", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "max planck institute for evolutionary anthropology", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:56 PM / Updated a day ago Mind bender: shape of human brain evolved over time Will Dunham 3 Min Read \nWASHINGTON (Reuters) - An analysis of fossils including the oldest-known Homo sapiens specimen has revealed that brain shape in our species evolved over time to become less elongated and more globular, a change that appears to have accommodated key advances in its function. \nScientists said on Wednesday they examined brain size and shape based on 20 Homo sapiens fossils, with the oldest dating back to roughly 300,000 years ago. While brain size remained largely unchanged over time, the shape gradually became more rounded until achieving its current form between 100,000 and 35,000 years ago, they said. \nPhysical anthropologist Simon Neubauer of the Max Planck Institute for Evolutionary Anthropology in Germany said two features that contributed to the globular shape stand out: the bulging of the brain’s parietal areas and the cerebellum. \n“The parietal lobe is an important hub in connecting different brain regions and involved in functions like orientation, attention, sensorimotor transformations underlying planning and visuospatial integration,” said Neubauer, who led the study published in the journal Science Advances. \n“The cerebellum is involved in motor-related functions like the coordination of movements and balance, but also in functions like working memory, language, social cognition and affective (emotional) processing,” Neubauer added. \nNeubauer said brain globularity emerges developmentally in today’s humans during a few months around the time of birth. \n“Our new data, therefore, suggest evolutionary changes to early brain development in a critical and vulnerable period for neural wiring and cognitive development,” Neubauer added. \nThe time period for when the brain’s current shape emerged is in harmony with archaeological evidence that humans achieved what he called “the full suite of behavioral modernity” around 40,000 to 50,000 years ago, Neubauer said. \nThis includes “material indicators of manipulation of symbols and abstract thought” such as creation of art and ornamentation, use of pigments, burying the dead, complex multi-component tools and bone carvings, Neubauer added. \nThe earliest-known Homo sapiens fossils, from a site in Morocco dating to about 300,000 years ago and a site in Ethiopia dating to about 195,000 years old, possessed elongated brains resembling those of Neanderthals, our species’ closest relative that went extinct tens of thousands of years ago, while later ones become rounder. \nThe researchers analyzed Homo sapiens fossils from north, east and south Africa, the Middle East and Europe. \n“Our findings add to the accumulating archeological and paleoanthropological evidence demonstrating that Homo sapiens is an evolving species with deep African roots and long-lasting gradual changes in behavioral modernity, brain organization and potentially brain function,” Neubauer said. Reporting by Will Dunham; Editing by Sandra Maler", "external_links": [], "published": "2018-01-24T22:55:00.000+02:00", "crawled": "2018-01-25T19:11:27.047+02:00", "highlightTitle": ""}