{"organizations": [], "uuid": "bd25cc5e3a3169535e2e4b9ea391dd7dff72a4cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-trade-tariffs/rpt-wrapup-2-job-creator-or-job-killer-trump-angers-solar-installers-with-panel-tariff-idUSL2N1PI2EY", "country": "US", "domain_rank": 408, "title": "RPT-WRAPUP 2-Job creator, or job killer? Trump angers solar installers with panel tariff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:55:00.000+02:00", "replies_count": 0, "uuid": "bd25cc5e3a3169535e2e4b9ea391dd7dff72a4cd"}, "author": "", "url": "https://www.reuters.com/article/usa-trade-tariffs/rpt-wrapup-2-job-creator-or-job-killer-trump-angers-solar-installers-with-panel-tariff-idUSL2N1PI2EY", "ord_in_thread": 0, "title": "RPT-WRAPUP 2-Job creator, or job killer? Trump angers solar installers with panel tariff", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ayesha rascoe", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nichola groom  washington/los", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats to additional subscribers, adds writing credit, link to Q&A)\nBy Ayesha Rascoe and Nichola Groom\nWASHINGTON/LOS ANGELES Jan 23 (Reuters) - U.S. President Donald Trump signed into law a steep tariff on imported solar panels on Tuesday, a move billed as a way to protect American jobs but which the solar industry said would lead to thousands of layoffs and raise consumer prices.\nThe 30 percent tariff on solar panels is among the first unilateral trade restrictions imposed by the administration as part of a broader protectionist agenda to help U.S. manufacturers, but which has alarmed Asian trading partners that produce lower cost goods. The administration also introduced a tariff on imported washing machines.\n“You’re going to have people getting jobs again and we’re going to make our own product again. It’s been a long time,” Trump said as he signed the order.\nBut the solar industry countered that the move will raise the cost of installing panels, quash billions of dollars of investment, and kill tens of thousands of jobs, raising questions about whether Trump’s move will backfire by triggering mass layoffs.\n“We are not happy with this decision,” said Abigail Ross Hopper, president of the U.S. Solar Energy Industries Association, on a conference call with reporters on Tuesday. “It’s just basic economics - if you raise the price of a product it’s going to decrease demand for that product.”\nThe leading solar trade group predicted that the tariffs could cut forecast solar installations this year by nearly 20 percent, to 9 gigawatts from 11 gigawatts, and lead to the loss of 23,000 jobs in the United States, the world’s fourth-largest solar market after China, Japan and Germany.\nResearch firm Wood Mackenzie estimated that over the next five years the tariffs would reduce U.S. solar installation growth by 10 to 15 percent.\nThe U.S. solar industry employs more than 260,000 workers - about five times more than the coal industry - with the vast majority involved in installation rather than panel manufacturing.\nU.S. Republican Senator John McCain of Arizona, a big solar power producing state, said in a Twitter post that the tariffs amount to “nothing more than a tax on consumers.”\nThe main beneficiaries include U.S.-based solar manufacturers Suniva and SolarWorld - both controlled by foreign parent companies. They petitioned for the trade relief arguing they could not compete with the cheap imports that have caused panel prices to fall more than 30 percent since 2016 and asked for the equivalent of a 50 percent tariff.\nSuniva on Monday said the tariffs were “necessary,” while SolarWorld said it was “hopeful they will be enough.”\nBankrupt Suniva is majority-owned by Hong Kong-based Shunfeng International Clean Energy, and SolarWorld is the U.S. arm of Germany’s SolarWorld AG.\nShunfeng rose 2.6 percent after the announcement and SolarWorld was up 22 percent.\nOther U.S. solar stocks were mixed. SunPower Corp, which manufactures panels in Asia, was down more than 6 percent and residential installer SunRun Inc. was up about 6 percent. The tariffs were broadly in line with investor expectations, creating some relief in the market, analysts said.\nBoth SunPower and Sunrun said they disagreed with the decision to impose tariffs.\nWINNERS AND LOSERS Research firm CFRA said it expects the tariffs to increase solar system prices by about $0.10 per watt. It reckons First Solar, a U.S. company with offshore panel manufacturing whose technology is not included in the tariff, would be the biggest beneficiary, while China manufacturers such as JinkoSolar would be the biggest losers.\nGlobally, solar capacity soared to almost 400 GW last year from under 10 GW in 2007, according to the International Renewable Energy Administration.\nChina, the world’s biggest solar panel producer, branded the move an “overreaction” that would harm the global trade environment for affected products.\n“The U.S.’s decision ... is an abuse of trade remedy measures, and China expresses strong dissatisfaction regarding this,” Wang Hejun, the head of the commerce ministry’s Trade Remedy and Investigation Bureau, said in a statement on its microblog.\n“China will work with other WTO members to resolutely defend its legitimate interests in response to the erroneous U.S. decision.”\nSouth Korea’s trade minister Kim Hyun-chong said the new U.S. tariffs violated World Trade Organization (WTO) rules.\n“The United States has opted for measures that put political considerations ahead of international standards,” Kim told a meeting of industry officials. “The government will actively respond to the spread of protectionist measures to defend national interests.”\nTrump dismissed the prospect of a trade war and said during the signing that “a lot of manufacturers” will come to the United States to build solar plants.\nCFRA analyst Angelo Zino said he expected any added manufacturing jobs would be “minimal” given the 18 months to two years it takes to build and ramp up a new production facility and the industry’s shift toward automation.\nReporting by Nichola Groom, writing by Richard Valdmanis; Editing by Susan Thomas\n ", "external_links": [], "published": "2018-01-24T00:55:00.000+02:00", "crawled": "2018-01-24T01:16:58.000+02:00", "highlightTitle": ""}