{"organizations": [], "uuid": "c84228203df026d1167f6f4a2a010e63ce1e49ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-syria-chemicalweapons-france/france-to-launch-international-group-targeting-toxic-gas-attacks-idUKKBN1F72YW", "country": "US", "domain_rank": 408, "title": "France to launch international group targeting toxic gas attacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:25:00.000+02:00", "replies_count": 0, "uuid": "c84228203df026d1167f6f4a2a010e63ce1e49ef"}, "author": "", "url": "https://uk.reuters.com/article/uk-syria-chemicalweapons-france/france-to-launch-international-group-targeting-toxic-gas-attacks-idUKKBN1F72YW", "ord_in_thread": 0, "title": "France to launch international group targeting toxic gas attacks", "locations": [], "entities": {"persons": [{"name": "rex tillerson", "sentiment": "none"}, {"name": "francois delattre", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "none"}, {"name": "united nations/paris", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:29 PM / Updated 37 minutes ago France to launch international group targeting toxic gas attacks Reuters Staff 3 Min Read \nUNITED NATIONS/PARIS (Reuters) - France has asked some 30 countries to work together to preserve evidence of chemical weapons attacks and impose sanctions on those responsible after Russia ended an international inquiry into who is to blame for using toxic gas in Syria. \nFrance will host a meeting on Tuesday in Paris to launch the initiative, French U.N. Ambassador Francois Delattre told a United Nations Security Council meeting on nonproliferation of weapons of mass destruction on Thursday. \nU.S. Secretary of State Rex Tillerson is due to attend, the State Department said. \nThe group will work together “collecting, conserving, exchanging and using ... all the mechanisms at our disposal to name the guilty parties and impose the necessary sanctions on them,” according to the invitation sent to states and seen by Reuters. \n“It is important that, when the time comes and the political timing is right, all the information on the perpetrators of chemical weapons attacks and those who participated in their programmes is immediately available so as to ensure they are brought to justice for their actions,” the invitation said. \nThe move comes after an international investigation into who is to blame for chemical weapons attacks in Syria ended in November after Syrian ally Russia blocked for the third time in a month attempts at the United Nations to renew the inquiry, which Moscow has slammed as flawed. \nIn the past two years, the joint inquiry of the United Nations and the Organization for the Prohibition of Chemical Weapons (OPCW) had found the Syrian government used the nerve agent sarin in an April 4, 2017 attack and has also several times used chlorine as a weapon. It blamed Islamic State militants for using mustard gas. \n“The current paralysis of multilateral forums is preventing us from taking legal action against the perpetrators of these crimes and dissuading them from continuing down this path. This must change,” the French invitation said. \nSyria agreed to destroy its chemical weapons in 2013 under a deal brokered by Russia and the United States. The Syrian government has denied using chemical weapons. \nRussian Foreign Minister Sergei Lavrov said accusations against the Syrian government were “baseless” and accused Western states of ignoring a chemical weapons threat posed by extremist groups. \n“We are gravely concerned by the growing threat of chemical weapon terrorism in the Middle East. Specifically on the territory of Iraq and Syria,” Lavrov told the U.N. Security Council on Thursday. \n“We must bear in mind the real risks of chemical terrorism spilling over beyond the Middle East, taking into account the significant amounts of foreign fighters among extremists,” he said. Reporting by Michelle Nichols at the United Nations and John Irish in Paris; Editing by James Dalgleish", "external_links": [], "published": "2018-01-18T22:25:00.000+02:00", "crawled": "2018-01-18T22:56:01.005+02:00", "highlightTitle": ""}