{"organizations": [], "uuid": "8e1424d193103d4a46fedd1df16d44e667ad014b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225533936&w=1200&r=LYNXMPEE0P11N", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-tax-states-coalition/new-york-new-jersey-connecticut-form-coalition-against-tax-bill-idUSKBN1FF273", "country": "US", "domain_rank": 408, "title": "New York, New Jersey, Connecticut form coalition against tax bill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:29:00.000+02:00", "replies_count": 0, "uuid": "8e1424d193103d4a46fedd1df16d44e667ad014b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-tax-states-coalition/new-york-new-jersey-connecticut-form-coalition-against-tax-bill-idUSKBN1FF273", "ord_in_thread": 0, "title": "New York, New Jersey, Connecticut form coalition against tax bill", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staf", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The governors of New York, New Jersey and Connecticut said on Friday they are forming a multi-state coalition against a new federal tax bill and will file legal action challenging the constitutionality of the legislation signed in December.\nThe bill unfairly impacts their states with its repeal of state and local tax deductibility, the first federal double taxation in U.S. history, the governors said during a call with reporters.\nNew York Governor Andrew Cuomo said there were “very strong” arguments that the bill violates states’ rights as well as the Equal Protection clause in the U.S. Constitution.\n“The top 12 states that get hurt (by the bill) coincidentally all happen to be Democratic states,” he said.\nThe sweeping Republican tax bill signed into law by U.S. President Donald Trump introduces a cap, of $10,000, on deductions of state and local income and property taxes, known as SALT. The tax overhaul was the party’s first major legislative victory since Trump took office in January 2017.\nFILE PHOTO: New Jersey Governor Phil Murphy speaks after taking the oath of office in Trenton, New Jersey, U.S., January 16, 2018. REUTERS/Lucas Jackson The SALT provision will hit many taxpayers in states with high incomes, property values and taxes. These include New York, New Jersey, Connecticut and California, which are all generally Democratic leaning.\nNew Jersey Governor Phil Murphy, a Democrat sworn in earlier this month, said the states’ lawsuit against the bill could be filed in a “matter of a couple weeks.”\nFILE PHOTO: Connecticut governor Dannel Malloy speaks at the Democratic National Convention in Philadelphia, Pennsylvania, U.S. July 25, 2016. REUTERS/Mike Segar “We believe substantively there is a very strong case and the more like-minded states who join us I think the better our shot,” Murphy said.\nConnecticut Governor Dannel Malloy said the state, along with New Jersey and New York, is in conversations “offline” with other states about potential actions against the bill. Cuomo mentioned he had spoken with California Governor Jerry Brown.\nOther states are also mulling options to deal with the impact of the federal bill. Legislation that first surfaced in California, that gives taxpayers a way to avoid the new cap on state and local tax deductions by making charitable donations, has emerged in four more states so far.\nReporting by Stephanie Kelly; Editing by Daniel Bases and Bernadette Baum\n ", "external_links": [], "published": "2018-01-26T18:29:00.000+02:00", "crawled": "2018-01-26T18:39:48.038+02:00", "highlightTitle": ""}