{"organizations": [], "uuid": "4178e808a7f1953d17b5ff6132a7911d565ceec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221080673&w=1200&r=LYNXMPEE0A0K2", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUKKBN1F00Y7", "country": "US", "domain_rank": 408, "title": "French retailers sold Lactalis baby milk after salmonella recall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:09:00.000+02:00", "replies_count": 0, "uuid": "4178e808a7f1953d17b5ff6132a7911d565ceec0"}, "author": "", "url": "https://uk.reuters.com/article/us-france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUKKBN1F00Y7", "ord_in_thread": 0, "title": "French retailers sold Lactalis baby milk after salmonella recall", "locations": [], "entities": {"persons": [{"name": "picot", "sentiment": "none"}, {"name": "thierry desouches", "sentiment": "none"}, {"name": "milumel", "sentiment": "none"}, {"name": "leclerc", "sentiment": "none"}], "locations": [{"name": "sial", "sentiment": "none"}, {"name": "villepinte", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "platiau  retailers carrefour", "sentiment": "none"}, {"name": "systeme u", "sentiment": "none"}, {"name": "bfm tv", "sentiment": "none"}, {"name": "dgccrf", "sentiment": "none"}, {"name": "auchan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:18 AM / Updated an hour ago France blames Lactalis, retailers in deepening baby food scare Richard Lough , Dominique Vidalon 4 Min Read \nPARIS (Reuters) - France, seeking to limit reputational damage to its agri-business industry, threatened on Thursday to impose sanctions after the country’s biggest supermarkets said recalled baby foods made by Lactalis had still found their way onto shop shelves. French Finance Minister Bruno Le Maire (R) speaks during a news conference about Lactalis baby milk contamination scandal next to Virginie Beaumeunier, head of the Competition Policy, Consumer Affairs and Fraud Control Agency (DGCCRF), at the Bercy Finance Ministry in Paris, France, January 11, 2018. REUTERS/Christian Hartmann \nThe admissions by Carrefour ( CARR.PA ), Leclerc, Auchan [AUCH.UL] and Systeme U deepened a salmonella health scare that began in early December when France’s consumer protection agency ordered the halt to sales and a global recall of products from its Craon factory. Three dozen children have fallen ill. \nEconomy Minister Bruno Le Maire bluntly laid the blame on Lactalis, one of the world’s largest dairy groups, and the retailers as he tried to stem the fallout over the salmonella contamination. \nSalmonella infections can be life-threatening, particularly for young children, and the recall risks damaging Lactalis in China, a fast-growing market for baby food and dairy products where consumers are highly sensitive after melamine-tainted baby milk led to the deaths of six children in 2008. \nThe health scare in China caused distrust in locally produced infant formula and benefited foreign suppliers such as Nestle NESN.N, Danone ( DANO.PA ) and Lactalis. \n“This is a serious matter. There has been unacceptable behavior, which should be punished,” Le Maire told a news conference. \nIn a sign of how seriously France is taking the issue, President Emmanuel Macron weighed in from Italy, also promising punishment of those responsible. \nPrivately held Lactalis, which has annual sales of around 17 billion euros ($20 billion), has addressed the salmonella contamination by halting operations at the factory where it started. On Thursday, Lactalis announced the temporary lay off of 250 workers. \nThe product recall affected goods carrying the Picot, Milumel and Taranis brands destined for French and overseas markets and France’s consumer protection agency DGCCRF has begun an investigation and carried out 2,500 checks so far. A further 2,5000 checks will be carried out from next week. GLOBAL RECALL \nThe recall included products aimed for export to some 30 countries, including to China. Slideshow (3 Images) \nLactalis has been expanding its infant nutrition business, although its biggest categories are cheese and liquid milk. \nLe Maire said that the initial checks showed recalled products had remained on sale at 91 different sites in France, but that there were no indications so far that potentially contaminated products had been exported. \nJust back from a three-day official visit to China with Macron, Le Maire said he had discussed the Lactalis recall with his counterparts in Beijing, adding: “The best response is transparency”. \n“We made mistakes, as did all the big distribution companies,” Systeme U spokesman Thierry Desouches told BFM TV, adding that the recall had been complex and that the company had not dragged its feet. \n“We’re speaking about a volume of products that perhaps earned us a total margin of 300 euros. Would we risk our image for such a derisory amount?” Desouches said on Thursday. \nThe DGCCRF issued a first recall on Dec. 10 after Lactalis discovered salmonella contamination at its Craon factory, halting the sale of several baby food products made there. \nLe Maire said the DGCCRF was forced to issue the Dec. 10 recall because Lactalis was too slow to take action. \n“The state took over from a company which failed in its actions,” he said. \nLactalis announced an extension to the recall less than two weeks later, confirming that contamination occurred at Craon during work in the first half of the year. \nIn a statement on Thursday, Carrefour said it had sold 434 products at risk of contamination since the Dec. 21 recall, but that another 95,000 had been successfully removed from shelves. \nLeclerc, France’s biggest food retailer, said it had sold 984 products involved in the recall. Reporting by Richard Lough and Dominique Vidalon; Additional reporting by Gus Trompiz, Sybille de la Hamaide; Editing by Alexander Smith and Hugh Lawson", "external_links": [], "published": "2018-01-11T11:09:00.000+02:00", "crawled": "2018-01-11T11:32:13.002+02:00", "highlightTitle": ""}