{"organizations": [], "uuid": "68df50009ca577de6451865cd90a97497a8e8813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219214604&w=1200&r=LYNXMPEE03068", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-hongkongexchange-votingrights-breakin/breakingviews-hong-kong-will-start-atoning-for-missing-alibaba-idUSKBN1ET0C0", "country": "US", "domain_rank": 408, "title": "Hong Kong will start atoning for missing Alibaba", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T11:40:00.000+02:00", "replies_count": 0, "uuid": "68df50009ca577de6451865cd90a97497a8e8813"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hongkongexchange-votingrights-breakin/breakingviews-hong-kong-will-start-atoning-for-missing-alibaba-idUSKBN1ET0C0", "ord_in_thread": 0, "title": "Hong Kong will start atoning for missing Alibaba", "locations": [], "entities": {"persons": [{"name": "toutiao", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "alibaba hong kong", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG Losing Alibaba’s 2014 listing to New York was embarrassing for a city that has thrived connecting China to world markets. Hong Kong could go some way to making up for this in 2018.\nNew York has been the go-to venue for initial public offerings of Chinese technology firms. It hosts more internet companies than Hong Kong and the market is simply much bigger. U.S. investors have traditionally been more open to backing loss-makers. And founders can retain outsize control relative to their economic stakes, which is not possible in Hong Kong.\nThat is starting to change. The Fragrant Harbour hosted a string of well-received tech flotations in 2017, some of them unprofitable. The growing number of stocks means analysts and investors are increasingly well informed about the sector. And Hong Kong has an in-built cultural advantage: it is more welcoming of Chinese bosses who do not speak English, and of apps that would baffle an American audience.\nSo the stage is set for Hong Kong to win over China’s up-and-coming tech players. The biggest include news aggregator Toutiao, food-delivery to hotel-bookings group Meituan-Dianping, and ride-hailing firm Didi Chuxing. Actual or potential fundraisings in 2017 valued the three at $20 billion, $30 billion and $50 billion, respectively. All three could list in 2018. Assuming valuations rise by one-quarter by the time the trio list and they sell up to 25 percent stakes, the IPOs could raise over $30 billion. Lufax, a peer-to-peer lender backed by Ping An Insurance, is another prospective candidate.\nThe potential clincher for these companies is due in 2018, when firms will probably be allowed to list with multiple classes of shares. This is not great news for investors: Hong Kong lost Alibaba’s record-breaking IPO because of the regulator’s principled objection to unorthodox voting rights. There are some signs of movement in the other direction stateside. And weakening the system does not bode well for governance in an already scandal-prone market. But it will undoubtedly increase the city’s attraction for company founders. Expect Hong Kong’s tech sector to expand in 2018.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-04T11:40:00.000+02:00", "crawled": "2018-01-04T08:00:48.028+02:00", "highlightTitle": ""}