{"organizations": [], "uuid": "ab22eff3fba368f2d31fc2bd5c074bc83aa4d83a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-mack-cali-realty-corporation-announces-tax-treatment-of-2017-dividends.html", "country": "US", "domain_rank": 767, "title": "Mack-Cali Realty Corporation Announces Tax Treatment Of 2017 Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.176, "site_type": "news", "published": "2018-01-17T20:54:00.000+02:00", "replies_count": 0, "uuid": "ab22eff3fba368f2d31fc2bd5c074bc83aa4d83a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-mack-cali-realty-corporation-announces-tax-treatment-of-2017-dividends.html", "ord_in_thread": 0, "title": "Mack-Cali Realty Corporation Announces Tax Treatment Of 2017 Dividends", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "dividends jersey city", "sentiment": "none"}], "organizations": [{"name": "mack-cali realty corporation announces tax treatment of 2017", "sentiment": "negative"}, {"name": "mack-cali realty corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "mack-cali realty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERSEY CITY, N.J., Jan. 17, 2018 /PRNewswire/ -- Mack-Cali Realty Corporation (NYSE: CLI) today announced the tax treatment of its 2017 dividends. The Company's total distribution of $0.70 per share of common stock (CUSIP #554489104) is to be classified for income tax purposes as follows:\nRECORD\nDATE\nPAYMENT\nDATE\nCASH\nDISTRIBUTIONS\nPER SHARE\nTAXABLE\nORDINARY\nDIVIDENDS\n01/05/17\n01/13/17\n$ 0.150000\n$ 0.150000\n04/05/17\n04/13/17\n0.150000\n0.150000\n07/06/17\n07/14/17\n0.2\n0.2\n10/03/17\n10/13/17\n0.2\n0.2\nTotals\n$ 0.7\n$ 0.7\nThe fourth quarter 2017 distributions being made to shareholders of record as of January 3, 2018 are considered 2018 distributions for federal income tax purposes. Shareholders are encouraged to consult with their tax advisors as to their specific tax treatment of Mack-Cali Realty Corporation dividends.\nAbout Mack-Cali Realty Corporation\nOne of the country's leading real estate investment trusts (REITs), Mack-Cali Realty Corporation is an owner, manager and developer of premier office and multifamily properties in select waterfront and transit-oriented markets throughout the Northeast. Mack-Cali is headquartered in Jersey City, New Jersey, and is the visionary behind the city's flourishing waterfront, where the company is leading development, improvement and place-making initiatives for Harborside, a master-planned destination comprised of class A office, luxury apartments, diverse retail and restaurants, and public spaces.\nA fully-integrated and self-managed company, Mack-Cali has provided world-class management, leasing, and development services throughout New Jersey and the surrounding region for two decades. By regularly investing in its properties and innovative lifestyle amenity packages, Mack-Cali creates environments that empower tenants and residents to reimagine the way they work and live.\nFor more information on Mack-Cali Realty Corporation and its properties, visit www.mack-cali.com .\nStatements made in this press release may be forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements can be identified by the use of words such as \"may,\" \"will,\" \"plan,\" \"potential,\" \"projected,\" \"should,\" \"expect,\" \"anticipate,\" \"estimate,\" \"target,\" \"continue,\" or comparable terminology. Such forward-looking statements are inherently subject to certain risks, trends and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate, and involve factors that may cause actual results to differ materially from those projected or suggested. Readers are cautioned not to place undue reliance on these forward-looking statements and are advised to consider the factors listed above together with the additional factors under the heading \"Disclosure Regarding Forward-Looking Statements\" and \"Risk Factors\" in the Company's Annual Reports on Form 10-K, as may be supplemented or amended by the Company's Quarterly Reports on Form 10-Q, which are incorporated herein by reference. The Company assumes no obligation to update or supplement forward-looking statements that become untrue because of subsequent events, new information or otherwise.\nContacts:\nAnthony Krug\nMack-Cali Realty Corporation\nChief Financial Officer\n(732) 590-1030\nDeidre Crockett\nMack-Cali Realty Corporation\nVice President, Corporate Communications and\nInvestor Relations\n(732) 590-1025\nView original content with multimedia: http://www.prnewswire.com/news-releases/mack-cali-realty-corporation-announces-tax-treatment-of-2017-dividends-300584051.html\nSOURCE Mack-Cali Realty Corporation", "external_links": ["http://www.mack-cali.com/", "http://www.prnewswire.com/news-releases/mack-cali-realty-corporation-announces-tax-treatment-of-2017-dividends-300584051.html"], "published": "2018-01-17T20:54:00.000+02:00", "crawled": "2018-01-17T21:09:51.002+02:00", "highlightTitle": ""}