{"organizations": [], "uuid": "6592bf80c8c0841b62a7c5530ada7541f912384d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/fall-in-china-demand-leads-australia-to-predict-iron-ore-price-drop.html/", "country": "US", "domain_rank": 767, "title": "Fall in China demand leads Australia to predict iron ore price drop - VidLyf Blog", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.962, "site_type": "news", "published": "2018-01-08T09:41:00.000+02:00", "replies_count": 0, "uuid": "6592bf80c8c0841b62a7c5530ada7541f912384d"}, "author": "Nitin Patil", "url": "https://www.cnbc.com/2018/01/08/fall-in-china-demand-leads-australia-to-predict-iron-ore-price-drop.html/", "ord_in_thread": 0, "title": "Fall in China demand leads Australia to predict iron ore price drop - VidLyf Blog", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}], "organizations": [{"name": "facebook  australia", "sentiment": "neutral"}, {"name": "department of industry", "sentiment": "none"}, {"name": "fortescue metals group", "sentiment": "none"}, {"name": "bhp", "sentiment": "none"}, {"name": "vale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fall in China demand leads Australia to predict iron ore price drop 3 mins ago Facebook \nAustralia on Monday said it expects iron ore prices to average $51.50 a tonne this year, down 20 percent from 2017, because of rising global supply and moderating demand from top importer China as its steel sector shrinks. \nThe world’s top three mining companies, BHP and Vale rely heavily on iron ore sales for the bulk of their revenue despite efforts to diversify more into other industrial raw materials, such as copper, aluminium and coal. \nBrazil-based Vale is planning to lift iron ore exports 7 percent in 2018 to 390 million tonnes. In Australia, Rio Tinto and BHP, along with \nFortescue Metals Group aim to add about 170 million tonnes of new capacity over the next several years. \nThe forecast price decline — from an average of $64.30 a tonne in 2017 — continues into 2019, when the steelmaking raw material will average only $49 a tonne, according to the Department of Industry, Innovation and Science. \n“The iron ore price is expected to experience some ongoing volatility in early 2018, as the market responds to uncertainty regarding the impact of winter production restrictions on iron ore demand,” the department warned in its latest commodities outlook paper. \nIron ore currently sells for about $75 a tonne. \nThe lower prices will reflect growing supply from low-cost producers and moderating demand from China as the steel industry there contracts, the department said. \nChina is in the process of closing ageing, high-polluting steel mills and induction furnaces to curb overcapacity in the sector. \nChina’s President Xi Jinping said in October that fighting pollution was one of the country’s key tasks through 2020. \nAustralia’s liquefied natural gas (LNG) exports are forecast to climb to 76.5 million tonnes in the year to end-June 2019, from 63 million tonnes forecast for the 2017/18 fiscal year and 52 million tonnes last year. \nBetween 2016/17 and 2018/19, LNG should add A$14 billion ($11 billion) to Australia’s export earnings, while iron ore is forecast to subtract A$10 billion, according to the department. \nThe shift follows the construction of $180 billion of new gas projects. The rise in LNG earnings will be underpinned as three remaining projects under construction hit their stride, it said. These are Chevron’s Wheatstone project, Inpex’s Ichthys and Royal Dutch Shell’s Prelude. \nPrices for coking coal, another key steel-making ingredient, are forecast by the department to drift lower over the next eighteen months from last quarter’s benchmark price of $192 a tonne as rising supply more than offsets demand. \nIt also expects thermal coal prices to ease through 2018 and early 2019, with the Newcastle spot price forecast to drop 12 percent to an average $77 a tonne in 2018, and by a further 6 percent to $70 in 2019. ", "external_links": [], "published": "2018-01-08T09:41:00.000+02:00", "crawled": "2018-01-08T09:44:50.026+02:00", "highlightTitle": ""}