{"organizations": [], "uuid": "ea1a0ad6d547353574b6167181b0bd9a7d08f6da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891300-RTX3OCA9-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/us-disaster-costs-shatter-records-in-2017-the-third-warmest-year.html", "country": "US", "domain_rank": 767, "title": "US disaster costs shatter records in 2017, the third warmest year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-08T20:20:00.000+02:00", "replies_count": 0, "uuid": "ea1a0ad6d547353574b6167181b0bd9a7d08f6da"}, "author": "Robert Ferris", "url": "https://www.cnbc.com/2018/01/08/us-disaster-costs-shatter-records-in-2017-the-third-warmest-year.html", "ord_in_thread": 0, "title": "US disaster costs shatter records in 2017, the third warmest year", "locations": [], "entities": {"persons": [{"name": "gene blevins", "sentiment": "negative"}, {"name": "thomas fire", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ojai", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "noaa", "sentiment": "none"}, {"name": "national oceanic and atmospheric administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major hurricanes and wildfires fueled a record year for costs related to natural disasters in the United States, according to a new report from the National Oceanic and Atmospheric Administration.\nThat report also said 2017 was the third-warmest year in 123 years of record keeping, behind only 2014 and 2012.\nNatural disasters in the United States cost more than $300 million last year, far surpassing the previous record of $214.8 billion set in 2005, NOAA said Monday.\nNOAA counted 1 drought event, 2 flooding events, 1 freeze event, 8 severe storm events, 3 tropical cyclone events, and 1 wildfire event during the year that bore losses exceeding $1 billion each. There were also 362 deaths.\nThat would tie with 2011 for the largest number of such billion-dollar disasters, the agency said.\nHowever, that number would be even worse if not for the fact that NOAA counts billion-dollar wildfires together by region and season. Wildfires raged across both northern and southern California late in the year, resulting in a record $18 billion in damage. But the fires were counted as one event by NOAA.\nHurricanes were by far the largest contributor to the total. U.S. hurricanes cost about $265 billion in 2017. Hurricanes Harvey, Irma and Maria now join Katrina and Sandy in the new top 5 costliest U.S. hurricanes on record, the report said.\nAmong other destructive events were floods in California and the southeastern United States, tornado outbreaks, and a drought in Montana, North Dakota and South Dakota.\nThe estimates include insured and uninsured losses, and the data used were compiled from several sources, such as the Insurance Services Office, the Federal Emergency Management Agency, U.S. Department of Agriculture, National Interagency Fire Center, Energy Information Administration, U.S. Army Corps and various s tate agencies.\nIn calculating its records, NOAA compares years since 1980, when the agency began looking at the costs of disasters.\nData on some disasters could also still be forthcoming, especially on the damage caused by Hurricane Maria in Puerto Rico, said Adam Smith, an economist at NOAA's National Centers for Environmental Information. This is not that unusual. Data from damage due to Hurricane Katrina in 2005 was still pouring in several months after the storm.\n\"We may see the same in Puerto Rico, given the level of destruction,\" Smith said.", "external_links": [], "published": "2018-01-08T20:20:00.000+02:00", "crawled": "2018-01-08T20:20:39.042+02:00", "highlightTitle": ""}