{"organizations": [], "uuid": "f34da4b14acb16b4f066991e6992e09448e69130", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-oneok-announces-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "ONEOK Announces Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-05T00:26:00.000+02:00", "replies_count": 0, "uuid": "f34da4b14acb16b4f066991e6992e09448e69130"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-oneok-announces-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "ONEOK Announces Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "oneok", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "oneok, inc.", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "credit suisse securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla., Jan. 4, 2018 /PRNewswire/ -- ONEOK, Inc. (NYSE: OKE) today announced an underwritten public offering of 19 million shares of its common stock, subject to market and other conditions. ONEOK expects to grant to the underwriters a 30-day over-allotment option to purchase up to 2.85 million additional shares.\nONEOK expects to use the net proceeds from the offering to fund capital expenditures, including a portion of its recently announced natural gas liquids growth projects, to pre-fund additional projects which are in the late stages of development, and for general corporate purposes, which may include repaying a portion of outstanding indebtedness.\nCredit Suisse Securities (USA) LLC is acting as lead book-running manager in the offering.\nThe underwriters intend to offer the shares from time to time for sale in one or more transactions on the New York Stock Exchange, in the over-the-counter market, through negotiated transactions or otherwise at market prices prevailing at the time of sale, at prices related to prevailing market prices or at negotiated prices.\nThis news release is neither an offer to sell nor a solicitation of an offer to buy any of these securities and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale is unlawful.\nThis offering is being made pursuant to an effective shelf registration statement, including a base prospectus and preliminary prospectus supplement, relating to these securities, which is on file with and has been declared effective by the Securities and Exchange Commission. A copy of the prospectus and prospectus supplement may also be obtained from the underwriter:\nCredit Suisse Securities (USA) LLC\nAttn: Prospectus Department\nEleven Madison Avenue\nNew York, NY 10010\nPhone: 800-221-1037\nEmail: newyork.prospectus@credit-suisse.com\nONEOK, Inc. (pronounced ONE-OAK) (NYSE: OKE ) is one of the largest energy midstream service providers in the U.S., connecting prolific supply basins with key market centers. It owns and operates one of the nation's premier natural gas liquids (NGL) systems and is a leader in the gathering, processing, storage and transportation of natural gas. ONEOK's operations include a 38,000-mile integrated network of NGL and natural gas pipelines, processing plants, fractionators and storage facilities in the Mid-Continent, Williston, Permian and Rocky Mountain regions.\nONEOK is a FORTUNE 500 company and is included in Standard & Poor's (S&P) 500 index.\nFor information about ONEOK, Inc., visit the website: www.oneok.com .\nFor the latest news about ONEOK, find us on LinkedIn, Facebook or Twitter @ONEOKNews.\nSome of the statements contained herein are forward-looking statements as defined under federal securities laws. The forward-looking statements relate to our anticipated financial performance (including projected net income, capital expenditures, cash flow and projected levels of dividends), liquidity, management's plans and objectives for our future growth projects and other future operations (including plans to construct additional natural gas and natural gas liquids facilities and related cost estimates), our business prospects, the outcome of regulatory and legal proceedings, market conditions and other matters. We make these forward-looking statements in reliance on the safe harbor protections provided under federal securities legislation and other applicable laws.\nForward-looking statements include the items identified in the preceding paragraph, the information concerning possible or assumed future results of our operations and other statements contained herein identified by words such as \"anticipate,\" \"estimate,\" \"expect,\" \"project,\" \"intend,\" \"plan,\" \"believe,\" \"should,\" \"goal,\" \"forecast,\" \"guidance,\" \"could,\" \"may,\" \"continue,\" \"might,\" \"potential,\" \"scheduled\" and other words and terms of similar meaning.\nYou should not place undue reliance on the forward-looking statements. Known and unknown risks, uncertainties and other factors may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Those factors may affect our operations, markets, products, services and prices. In addition to any assumptions and other factors referred to specifically in connection with the forward-looking statements, factors that could cause our actual results to differ materially from those contemplated in any forward-looking statement include, among others, those factors listed in the prospectus supplement for the common stock offering under the heading \"Cautionary Statement Regarding Forward-Looking Statements.\"\nThese factors are not necessarily all of the important factors that could cause actual results to differ materially from those expressed in any of our forward-looking statements. Other factors could also have material adverse effects on our future results. These and other risks are described in greater detail under the caption \"Risk Factors\" in the prospectus supplement for the common stock offering, the accompanying base prospectus filed with the SEC, our Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and in our other filings that we make with the SEC, which are available via the SEC's website at www.sec.gov and our website at www.oneok.com . All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by these factors. Any such forward-looking statement speaks only as of the date on which such statement is made, and other than as required under securities laws, we undertake no obligation to update publicly any forward-looking statement whether as a result of new information, subsequent events or change in circumstances, expectations or otherwise.\nAnalyst Contact:\nMegan Patterson\n918-561-5325\nMedia Contact:\nStephanie Higgins\n918-591-5026\nView original content: http://www.prnewswire.com/news-releases/oneok-announces-public-offering-of-common-stock-300577920.html\nSOURCE ONEOK, Inc.", "external_links": ["http://studio-5.financialcontent.com/prnews?Page=Quote&Ticker=OKE", "http://www.prnewswire.com/news-releases/oneok-announces-public-offering-of-common-stock-300577920.html", "http://www.oneok.com/"], "published": "2018-01-05T00:26:00.000+02:00", "crawled": "2018-01-05T01:34:47.006+02:00", "highlightTitle": ""}