{"organizations": [], "uuid": "1908c28b7e2ee1790e46398c1f499291adebf92d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955375-GettyImages-499188662.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/31/malala-yousafzai-on-leadership-and-her-own-career-path.html", "country": "US", "domain_rank": 767, "title": "Malala Yousafzai: Anyone can bring about change at any point — and at any age", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:44:00.000+02:00", "replies_count": 0, "uuid": "1908c28b7e2ee1790e46398c1f499291adebf92d"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/31/malala-yousafzai-on-leadership-and-her-own-career-path.html", "ord_in_thread": 0, "title": "Malala Yousafzai: Anyone can bring about change at any point — and at any age", "locations": [], "entities": {"persons": [{"name": "malala yousafzai", "sentiment": "negative"}, {"name": "yousafzai", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It doesn't matter how young or how old you are, anyone can bring about change — and the action you take to deliver that change is valuable, Nobel Peace Prize laureate Malala Yousafzai said last week.\nSpeaking at the World Economic Forum (WEF) in Davos, Switzerland, the activist emphasized the importance of individual voices and actions.\nShe was responding to a question about how others, particularly young people, can help an initiative such as Yousafzai's own \"Malala Fund\", a non-profit dedicated to supporting girls' right to attend school and receive quality education.\nIn 2012, the Taliban attempted to assassinate Yousafzai, then aged 15. Yet she survived and went on to tell her story and set up the Malala Fund with her father in 2013, to raise awareness.\n\"I started speaking out when I was 11 years old and I had no idea if my voice can have an impact or not,\" Yousafzai said during a session titled \" An Insight, An Idea With Malala Yousafzai \" at this year's Davos summit.\nODD ANDERSEN | AFP | Getty Images Nobel Peace Prize laureate Malala Yousafzai displays her medal and diploma during the Nobel Peace Prize awards ceremony at the City Hall in Oslo, Norway, on December 10, 2014. \"But soon I realized that people were listening to me and my voice was reaching to people around the world. So change is possible and do not limit yourself, do not stop yourself, just because you are young.\"\nNow 20, Yousafzai became the youngest Nobel Laureate after receiving the Nobel Peace Prize in 2014. In addition to her work for the Malala Fund, the activist is a published author and a United Nations (UN) Messenger of Peace .\nWhen it comes to who has the power to bring about change, Yousafzai said you don't have to be the leader of a nation or a business, to be a pioneer of change.\n\"Often, we think that you have to become a prime minister or president or a CEO to be the change-maker — no, you don't. You can bring change at any point, at any age you want,\" she said.\n\"Change is possible and do not limit yourself, do not stop yourself, just because you are young.\" -Malala Yousafzai, Nobel Peace Prize Laureate In fact, when asked what message she would deliver to girls, boys and people in general, it was to \"believe in themselves, believe in their voice, believe in their actions,\" because people, especially children, are the future and present.\n\"They make up the community, and each and every action they take matters. It has an impact on the society, so they must get involved,\" said Yousafzai, who went on to emphasize the importance of getting an education and helping others.\nAny action that a person takes can \"have an impact,\" the activist said , suggesting that generating change can come in many formats, whether from blogging, fundraising, raising awareness on social media, or supporting the local community and taking part in petitions.\n\"All these things matter. So once you all start doing this, we create a global movement.\"\nWho said what at Davos 2018 FABRICE COFFRINI | AFP | Getty Images Like this story? Like CNBC Make It on Facebook .\nDon't miss:\nWhy fixing the Arab world's education crisis is Queen Rania's top priority\nApple CEO Tim Cook: 'Education is a great equalizing force'\nWWE's Stephanie McMahon: It's OK to make mistakes — as long as you learn from them\nshow chapters How this CEO went from Girl Scouts brownie to rocket scientist 2:32 PM ET Fri, 11 Aug 2017 | 01:07", "external_links": [], "published": "2018-01-31T17:44:00.000+02:00", "crawled": "2018-01-31T17:59:42.001+02:00", "highlightTitle": ""}