{"organizations": [], "uuid": "8f62783906c80135aa0776120cd4529f1dd6aa6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226616938&w=1200&r=LYNXMPEE0T0Z4", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-france-politics-darmanin/macron-minister-refuses-to-quit-over-rape-charge-he-denies-idUKKBN1FJ1XL", "country": "US", "domain_rank": 408, "title": "Macron minister refuses to quit over rape charge he denies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:03:00.000+02:00", "replies_count": 0, "uuid": "8f62783906c80135aa0776120cd4529f1dd6aa6a"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-politics-darmanin/macron-minister-refuses-to-quit-over-rape-charge-he-denies-idUKKBN1FJ1XL", "ord_in_thread": 0, "title": "Macron minister refuses to quit over rape charge he denies", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "pierre-olivier sur", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "gerald darmanin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "darmanin", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "macron", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rtl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:05 PM / Updated an hour ago Macron minister refuses to quit over rape charge he denies Reuters Staff 3 Min Read \nPARIS (Reuters) - French President Emmanuel Macron’s budget minister, targeted by a rape accusation he denies, will not resign, his lawyer said on Tuesday. \nThe case concerning 35-year-old minister Gerald Darmanin and an encounter dating back to 2009 could test Macron’s ability to reconcile the principle of innocence unless proven guilty with his pledges of exemplary government. \nFollowing the sex scandal surrounding U.S. movie mogul Harvey Weinstein, it also comes at a time of heightened demand for action against predatory sexual behaviour or abuse of power for sexual favours. \nLawyer Pierre-Olivier Sur spoke in defence of Darmanin after confirmation on Saturday that the rape accusation had triggered the opening of a preliminary judicial inquiry, a step in France where investigators assess whether a complaint merits pursuit. \n“There’s absolutely no question of that happening,” Sur said when asked in an RTL radio interview if the minister would stand down. \nDarmanin, a high-flyer who joined France’s main right-wing party, Les Republicains, in his teens, changed camps last year to join Macron’s government. \nHis former party was on the front line of those demanding he quit, while other lawmakers have warned against a witch-hunt and said the investigation should run its course. \nThe rape accusation was first lodged shortly after he joined Macron’s government but shelved after the plaintiff failed to meet investigators. The case was reopened on Jan. 22 after she told investigators she was ready to answer their questions. \nPending the outcome of the preliminary probe, Prime Minister Edouard Philippe and other colleagues have said their house rule is that ministers must resign if targeted by a full-blown inquiry. That is not the case right now. \nIn France, most legal complaints give rise to a preliminary inquiry. The issue is then dropped or a formal investigation begun, which can lead to trial. \nDarmanin denied the allegation earlier this year. \nHis lawyer Sur said the minister acknowledged spending time with his accuser but that the rape accusation was a “scam”. He said Darmanin would sue for grave slander. \nThe timing is sensitive, not just because the case may test perception of Macron’s promise of squeaky-clean government but also because of the global outcry triggered by accusations of serial sexual harassment by Weinstein. \nThat scandal also revives memories in France of ex-IMF chief Dominique Strauss-Kahn, who settled financially with a New York hotel maid who accused him of sexual assault in 2011, ending his presidential ambitions and prompting much soul-searching about the sexual escapades of France’s powerful men. Writing by Brian Love; Additional reporting by Sophie Louet; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-30T16:03:00.000+02:00", "crawled": "2018-01-30T16:12:25.005+02:00", "highlightTitle": ""}