{"organizations": [], "uuid": "d4d213a0fb9d0b00c8a7903e7ce155fd70209abb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-orchid-island-capital-announces-january-2018-monthly-dividend-and-december-31-2017-rmbs-portfolio-characteristics.html", "country": "US", "domain_rank": 767, "title": "Orchid Island Capital Announces January 2018 Monthly Dividend and December 31, 2017 RMBS Portfolio Characteristics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T01:35:00.000+02:00", "replies_count": 0, "uuid": "d4d213a0fb9d0b00c8a7903e7ce155fd70209abb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-orchid-island-capital-announces-january-2018-monthly-dividend-and-december-31-2017-rmbs-portfolio-characteristics.html", "ord_in_thread": 0, "title": "Orchid Island Capital Announces January 2018 Monthly Dividend and December 31, 2017 RMBS Portfolio Characteristics", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "vero beach", "sentiment": "none"}], "organizations": [{"name": "estimated gaap", "sentiment": "none"}, {"name": "orchid island capital, inc.", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2018 Monthly Dividend of $0.11 Per Share Estimated Book Value Per Share at December 31, 2017 of $8.71 Estimated GAAP net loss of $0.12 per share for the quarter ended December 31, 2017, including an estimated $0.58 per share of realized and unrealized losses on RMBS and derivative instruments Estimated GAAP net income of $0.04 per share for the year ended December 31, 2017, including an estimated $1.98 per share of realized and unrealized losses on RMBS and derivative instruments Estimated (0.2)% total return on equity for the quarter, or (0.9)% annualized. Estimated total return for the year was 2.9% RMBS Portfolio Characteristics as of December 31, 2017\nVERO BEACH, Fla., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Orchid Island Capital, Inc. (the “Company”) (NYSE:ORC) announced today that the Board of Directors declared a monthly cash dividend for the month of January 2018. The dividend of $0.11 per share will be paid February 9, 2018 to holders of record on January 31, 2018, with an ex-dividend date of January 30, 2018.\nCommenting on the change to the Company’s monthly distribution rate, Robert E. Cauley, Chairman and Chief Executive Officer, said, “The decision to reduce our monthly dividend from $0.14 to $0.11 was a difficult one but a necessary one. The current interest rate and investment environment has put downward pressure on the earnings power of the portfolio. In particular, continued upward movements in our borrowing costs driven by rate increases by the Federal Reserve, without a corresponding increase in yields available on the Agency RMBS assets we acquire, has depressed our net interest margin and necessitated the reduction in our monthly dividend.”\nThe Company intends to make regular monthly cash distributions to its stockholders. In order to qualify as a real estate investment trust (“REIT”), the Company must distribute annually to its stockholders an amount at least equal to 90% of its REIT taxable income, determined without regard to the deduction for dividends paid and excluding any net capital gain. The Company will be subject to income tax on taxable income that is not distributed and to an excise tax to the extent that a certain percentage of its taxable income is not distributed by specified dates. The Company has not established a minimum distribution payment level and is not assured of its ability to make distributions to stockholders in the future.\nAs of January 10, 2018, the Company had 53,061,904 shares outstanding. At September 30, 2017, the Company had 45,308,169 shares outstanding.\nEstimated December 31, 2017 Book Value Per Share\nThe Company’s estimated book value per share as of December 31, 2017 was $8.71. The Company computes book value per share by dividing total stockholders' equity by the total number of outstanding shares of common stock. At December 31, 2017, the Company's preliminary estimated total stockholders' equity was approximately $462.2 million with 53,061,904 shares of common stock outstanding. These figures and the resulting estimated book value per share are preliminary, subject to change, and subject to review by the Company’s independent registered public accounting firm.\nEstimated Net Income Per Share and Realized and Unrealized Gains and Losses on RMBS and Derivative Instruments\nThe Company estimates it generated a net loss per share of $0.12, which includes $0.58 per share of realized and unrealized losses on RMBS and derivative instruments for the quarter ended December 31, 2017. These figures compare to three monthly dividends declared during the quarter of $0.14, for a total of $0.42 declared during the quarter. Net income per common share calculated under generally accepted accounting principles can, and does, differ from our REIT taxable income. The Company views REIT taxable income as a better indication of income to be paid in the form of a dividend rather than net income. Many components of REIT taxable income can only be estimated at this time and our monthly dividends declared are based on both estimates of REIT taxable income to be earned over the course of the current quarter and calendar year and a longer-term estimate of the REIT taxable income of the Company. These figures are preliminary, subject to change, and subject to review by the Company’s independent registered public accounting firm.\nEstimated Return on Equity\nThe Company’s estimated total return on equity for the quarter ended December 31, 2017 was (0.2)%, or (0.9)% on an annualized basis. The Company calculates total return on equity as the sum of dividends declared and paid during the quarter plus changes in book value during the quarter, divided by the Company’s stockholders’ equity at the beginning of the quarter. The total return was $(0.02) per share, comprised of dividends per share of $0.42 and a decrease in book value per share of $0.44 from September 30, 2017.\nRMBS Portfolio Characteristics\nDetails of the RMBS portfolio as of December 31, 2017 are presented below. These figures are preliminary and subject to change and, with respect to figures that will appear in the Company’s financial statements and associated footnotes as of and for the quarter ended December 31, 2017, are subject to review by the Company’s independent registered public accounting firm.\nRMBS Valuation Characteristics RMBS Assets by Agency Investment Company Act of 1940 Whole Pool Test Results Repurchase Agreement Exposure by Counterparty RMBS Risk Measures\nAbout Orchid Island Capital, Inc.\nOrchid Island Capital, Inc. is a specialty finance company that invests in Agency RMBS that are either traditional pass-through Agency RMBS or structured Agency RMBS. Orchid Island Capital, Inc. has elected to be taxed as a REIT for federal income tax purposes.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other federal securities laws. These forward-looking statements include, but are not limited to, statements about the Company’s distributions. These forward-looking statements are based upon Orchid Island Capital, Inc.’s present expectations, but these statements are not guaranteed to occur. Investors should not place undue reliance upon forward-looking statements. For further discussion of the factors that could affect outcomes, please refer to the “Risk Factors” section of the Company’s Form 10-K for the year ended December 31, 2016.\nRMBS Valuation Characteristics ($ in thousands) Percentage Weighted Realized Current Fair Current of Average Dec 2017 CPR Asset Category Face Value Price Portfolio Coupon (Reported in Jan) As of December 31, 2017 Adjustable Rate RMBS $ 1,660 $ 1,754 $ 105.67 0.05 % 3.95 % 0.02% 10-1 Hybrid Rate RMBS 27,173 27,398 100.83 0.73 % 2.59 % 12.94% Hybrid Adjustable Rate RMBS 27,173 27,398 100.83 0.73 % 2.59 % 12.94% 15 Year Fixed Rate RMBS 39,193 40,729 103.92 1.09 % 3.50 % 12.10% 20 Year Fixed Rate RMBS 378,181 400,025 105.78 10.68 % 4.00 % 6.09% 30 Year Fixed Rate RMBS 2,947,170 3,153,779 107.01 84.22 % 4.29 % 5.71% Total Fixed Rate RMBS 3,364,544 3,594,533 106.84 95.99 % 4.25 % 5.83% Total Pass-through RMBS 3,393,377 3,623,685 106.79 96.77 % 4.24 % 5.88% Interest-Only Securities 701,740 86,918 12.39 2.32 % ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/81d763a5-ef7f-4117-be50-224e920dc982"], "published": "2018-01-11T01:35:00.000+02:00", "crawled": "2018-01-11T03:21:51.003+02:00", "highlightTitle": ""}