{"organizations": [], "uuid": "db320d658b7c532922594d26e21582a580181856", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-gambia-women-fgm/with-newfound-democracy-gambia-faces-resurgence-in-fgm-and-child-marriage-idUSKBN1FC0XA", "country": "US", "domain_rank": 408, "title": "With newfound democracy, Gambia faces resurgence in FGM and child marriage", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T17:08:00.000+02:00", "replies_count": 0, "uuid": "db320d658b7c532922594d26e21582a580181856"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-gambia-women-fgm/with-newfound-democracy-gambia-faces-resurgence-in-fgm-and-child-marriage-idUSKBN1FC0XA", "ord_in_thread": 0, "title": "With newfound democracy, Gambia faces resurgence in FGM and child marriage", "locations": [], "entities": {"persons": [{"name": "yahya jammeh", "sentiment": "none"}, {"name": "adama barrow", "sentiment": "none"}, {"name": "jammeh", "sentiment": "none"}, {"name": "njie", "sentiment": "none"}, {"name": "aminata njie", "sentiment": "none"}], "locations": [{"name": "gambia", "sentiment": "none"}, {"name": "banjul", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "fgm", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BANJUL (Thomson Reuters Foundation) - Wearing a long black veil with her newly circumcised daughter on her lap, Aminata Njie vehemently gives her justification for having the two-year-old cut.\n“Female circumcision is our religion and tradition,” says the tall, frail mother of five from her one-bedroom home.\n“If Gambia is a democracy now, why should anyone stop us from practicing our religion and tradition?”\nOne year after Gambia’s iron-fisted leader Yahya Jammeh flew into exile, residents of the tiny West African nation are enjoying newfound freedoms under president Adama Barrow, who ousted Jammeh with a shock election win.\nBut to the dismay of human rights activists, some are also returning to harmful practices that the former president - in a rare display of progressive values - had banned during his 22 years of autocratic rule.\nThree weeks ago, Njie, whose named has been changed to protect her from prosecution, traveled across the river to her husband’s village to have her youngest daughter circumcised.\nFemale circumcision, or female genital mutilation (FGM), involves the partial or total removal of the female genitalia and can cause fatal health problems, health experts say.\nJammeh instated steep fines and jail sentences for those taking part in the ancient ritual, which many Gambians believe is a requirement of Islam, in 2015.\n“Before the ban, all my three daughters were circumcised. By the time I had this one, the ban was in force and no one was doing it here,” said Njie, who lives down a dirt road in the working-class outskirts of the capital Banjul.\n“Now that (Jammeh) left we are free to do it because Barrow does not ban it and he is going to remove the law,” she said.\nIn fact, the law against FGM is still in effect and there are no plans to remove it, information minister Demba Jawo told the Thomson Reuters Foundation by phone.\n“We are convinced that FGM has serious health implications for women and girls. If anything, this government would be even more rigorous in enforcing the ban,” Jawo said.\nBut many people have been misinformed, rights groups say.\n“If you go into communities they tell you that the law went with the former president,” said Lisa Camara of the Gambian rights group Safe Hands for Girls.\nThe same is true of Jammeh’s 2016 law against child marriage. “It’s taken us back to square one,” she said.\nCULTURE OF FEAR No data has been collected on FGM or child marriage since they were outlawed, the U.N. children’s agency UNICEF said, so there is no evidence to prove the laws were respected under Jammeh or that they are now being widely broken.\nBefore the bans, about 75 percent of girls in Gambia were cut and 30 percent married before the age of 18, UNICEF says.\nLaws against traditional practices often go unheeded in African countries where local chiefs and religious leaders can wield more influence than the central government, experts say.\nBut Jammeh, who had a reputation for imprisoning and torturing perceived opponents, was so widely feared that people tended to obey him, several Gambians said.\n“Most people at first thought it was a joke,” 20-year-old medical student Haddy Bittaye said of the FGM ban.\nThey soon realized it was serious when a grandmother was arrested for allegedly cutting a young girl who died, said Bittaye, a youth activist.\nThe penalty for engaging in FGM is set as 50,000 Gambian dalasi ($1,050) or 3 years in prison or both, according to the government, but there have been no prosecutions to date.\n“The law has done a lot,” said Bittaye. “Nowadays (FGM) is not that common because people are aware, and because of the fines attached to the law.”\nYet other campaigners said the law has merely driven the practice underground. It is performed earlier now - on babies as young as one week old - to avoid detection, said Isatou Jeng, of local rights group Girls’ Agenda.\n“People said the law was forced on them,” said Jeng, an FGM survivor herself who traveled around the country last year on an awareness-raising campaign.\nIn villages, people said Barrow had promised them he would repeal the law, she said, likely a misconception that came from the president’s pledges to reform Jammeh-era legislation.\nThe new government needs to do more to make its position clear, said Jeng.\nPresident Barrow has not spoken publicly against FGM or child marriage, but the vice president and other members of his administration have condemned them, said Neneh Touray, a representative in the ministry of women’s affairs.\n“It takes time to put things in order. I know with time (Barrow) will make his pronouncement,” Touray said.\nOthers said the government may be intentionally leaving room for ambiguity, since the laws are so unpopular.\n“Politically, I think they’re trying to be very careful not to lose votes,” said Camara of Safe Hands for Girls.\nNEW GENERATION Campaigners from the government, the United Nations and local rights groups have launched national information campaigns to teach Gambians that Jammeh’s laws are still in effect.\nBillboards along the highway in the rundown seaside capital say “Stop FGM” with pictures of smiling girls.\nThe target is not the traditional cutters, but the younger generation. “The idea is that we are targeting a generation in hopes that they will be the agents of change,” said UNICEF’s Fatou Jah.\nCamara, whose organization works primarily with young people in schools, said she thinks when their generation has children they will see a large decline in FGM and child marriage.\nBut for other campaigners and survivors, the setbacks caused by the political transition have been disheartening.\n“It’s a practice that you have laid down your life for, and at some point you think it’s almost coming to an end but now you are drawn back, steps back to where you have been before,” said Jeng of the Girls’ Agenda.\n“That hurts a lot,” Jeng said.\n(This refiled version of the story fixes typo in ex-president’s first name in paragraph four).\nReporting by Nellie Peyton and Lamin Jahateh; Editing by Ros Russell; Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T17:08:00.000+02:00", "crawled": "2018-01-24T15:44:49.025+02:00", "highlightTitle": ""}