{"organizations": [], "uuid": "2db76354c5fa7f93b4c61700f240f23579a6306e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222854223&w=1200&r=LYNXMPEE0G1Y1", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/uk-britain-eu-france/with-eye-on-brexit-talks-may-to-deepen-security-ties-with-france-idUSKBN1F632D", "country": "US", "domain_rank": 408, "title": "With eye on Brexit talks, May to deepen security ties with France", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:34:00.000+02:00", "replies_count": 0, "uuid": "2db76354c5fa7f93b4c61700f240f23579a6306e"}, "author": "", "url": "https://www.reuters.com/article/uk-britain-eu-france/with-eye-on-brexit-talks-may-to-deepen-security-ties-with-france-idUSKBN1F632D", "ord_in_thread": 0, "title": "With eye on Brexit talks, May to deepen security ties with France", "locations": [], "entities": {"persons": [{"name": "elizabeth piper", "sentiment": "none"}, {"name": "michel rose", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sandhurst", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:42 PM / Updated an hour ago 'Be my guest' - France's Macron spells out reasons for Britain to stay in EU Elizabeth Piper 4 Min Read \nSANDHURST, England (Reuters) - “Be my guest,” French President Emmanuel Macron told Britain on Thursday, saying he would welcome any move by Prime Minister Theresa May to stay in the European Union’s single market. \nBut he added a warning - London’s prized financial centre could not enjoy the same level of access to the EU under May’s current Brexit plan. \nAt a summit where both leaders hailed the two neighbours’ friendship and historic ties and tried to focus on deepening security and defence cooperation, differences over Brexit once again threatened to sour the meeting - underlining the struggle May faces to negotiate a deal that will protect the economy. \n“The choice is on the British side, not on my side,” Macron told a news conference after being asked why he was opposed to Britain’s financial sector being included in any agreement on future trade between the two sides. \n“They can have no differentiated access to the financial services. If you want access to the single market, including the financial services, be my guest. But it means that you need to contribute to the budget and acknowledge European jurisdiction.” \nBritain has ruled out pursuing a deal with the EU that would mean it would have to pay into its budget or respect its four freedoms, including free movement of people. Instead May says she wants a bespoke free trade deal covering both goods and services. \nBut by pressing for the inclusion of the financial services sector - which accounts for about 12 percent of Britain’s economic output and pays more tax than any other industry, May has lit the fuse on what could become the argument that dominates the so-called second phase of the talks to dismantle more than 40 years of membership of the EU. \nLast year, Macron launched a charm offensive on banks working in London’s City, calling on them to rebase in Paris. \n“We recognise that as we’re leaving the European Union we will no longer be full members of the single market,” May told the joint news conference. Britain's Prime Minister Theresa May and France's President Emmanuel Macron hold a news conference at the Royal Military Academy in Sandhurst, Britain, January 18, 2018. REUTERS/Stefan Rousseau/Pool \n“I believe that is not just in the interests of the United Kingdom but also of the European Union as it goes forward to continue to have a good economic relationship.” BORDER AND BAYEUX \nThe two leaders fought hard to underline that Brexit had not dominated the talks. They played up a new agreement to bolster security at French border controls and for Britain to speed the process of bringing unaccompanied migrant children across the frontier from France. Slideshow (18 Images) \nThey lauded a raft of agreements on everything from a British commitment to send three Chinook helicopters to Mali, where France has forces to help fight Islamist militants, to support for French counter-terrorism operations and measures to boost school exchanges as a sign they could work together. \nMay also offered France 44.5 million pounds ($62 million) to help with border security, part of May’s strategy to use defence as one of her strongest arguments for gaining leverage in negotiations on Britain’s planned departure from the EU. \nBut Macron, visiting Britain’s army officer training academy for a guard of honour, was clear that, in his mind, there was no trade-off on the border in favour of Brexit. Related Coverage Macron hails UK defence cooperation, warns on single market post-Brexit \n“I am not here to either punish or reward,” he said. \nThere were choreographed displays of cordiality, including a loan to Britain of the 11th-century Bayeux Tapestry and a lunch visit to a Michelin-starred pub in May’s own constituency in the southern English town of Maidenhead. \nBut even the decision by France to loan the more than 900-year-old tapestry fell flat in Britain’s eurosceptic media. \n“What a stitch-up! Did borrowing the Bayeux Tapestry cost Britain 45 million pounds more to stop migrants at Calais?” the Daily Mail asked, while the Sun mocked up the depiction of how William the Conqueror invaded England in 1066 as a tale of the EU trying to stop Britain leaving the bloc. Additional reporting by William James in London and Michel Rose in Paris; editing by Mark Heinrich", "external_links": [], "published": "2018-01-18T00:34:00.000+02:00", "crawled": "2018-01-18T00:43:08.006+02:00", "highlightTitle": ""}