{"organizations": [], "uuid": "4203aaf7ccca720905be557eb3db8e4e258ebbee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226181752&w=1200&r=LYNXMPEE0S08D", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-economy-growth/china-eyes-black-swans-gray-rhinos-as-2018-growth-seen-slowing-to-6-5-6-8-percent-media-idUKKBN1FI0AO", "country": "US", "domain_rank": 408, "title": "China eyes black swans, grey rhinos as 2018 growth seen slowing to 6.5-6.8 percent - media", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:45:00.000+02:00", "replies_count": 0, "uuid": "4203aaf7ccca720905be557eb3db8e4e258ebbee"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-economy-growth/china-eyes-black-swans-gray-rhinos-as-2018-growth-seen-slowing-to-6-5-6-8-percent-media-idUKKBN1FI0AO", "ord_in_thread": 0, "title": "China eyes black swans, grey rhinos as 2018 growth seen slowing to 6.5-6.8 percent - media", "locations": [], "entities": {"persons": [{"name": "fan hengshan", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing daily", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "national development and reform commission", "sentiment": "none"}, {"name": "ndrc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 3:51 AM / Updated 31 minutes ago China eyes black swans, grey rhinos as 2018 growth seen slowing to 6.5-6.8 percent - media Reuters Staff 3 Min Read \nBEIJING (Reuters) - China’s economic growth will likely slow to 6.5-6.8 percent this year, a senior official at the country’s top economic planner wrote in the Beijing Daily on Monday, while warning about the risks of “Black Swan” and “Grey Rhino” events. \nBlack swans, or unforeseen occurrences, and grey rhinos, or highly obvious yet ignored threats, are likely to occur this year with adverse consequences, Fan Hengshan, vice secretary general of the National Development and Reform Commission (NDRC), wrote in a commentary in the state-controlled newspaper. \nChina’s economy grew 6.9 percent in 2017, the first annual acceleration since 2010. That pace easily beat the government’s 2017 target of around 6.5 percent, welcome news for policymakers looking to curb financial risks and cut corporate debt. \n“My personal opinion is that economic growth this year is very likely to exceed 6.5 percent, roughly between 6.5 and 6.8 percent,” Fan said. \nSeparately, former central bank chief economist Ma Jun said growth may ease to around 6.5 percent this year, due to a slowdown in property sales and lower infrastructure investment, Chinese financial news provider Yicai reported on Monday. \nPolicy sources have told Reuters that China will keep its target for economic growth at “around 6.5 percent” in 2018, unchanged from last year. \nAnalysts polled by Reuters earlier this month also predicted a slowdown to 6.5 percent this year as government-led crackdowns on debt risks and factory pollution drag on overall activity.[ECILT/CN] \nChina will focus on fending off risks this year, particularly risks that will impact regions and cause systemic fluctuations, the NDRC’s Fan said. \n“To this end, we must remain highly vigilant and enhance our sense of urgency,” Fan said. \nEarlier this month, China’s banking regulator chief told the official People’s Daily in an interview that a black swan event could threaten the country’s financial stability, adding that risks, while still manageable, are “complex and serious.” \nGlobal credit rating agencies S&P and Moody’s both downgraded China’s sovereign credit rating last year, citing worries about its rapid build-up in debt after years of credit-fueled stimulus used to meet official economic growth targets. \nChina’s finance ministry said the S&P downgrade was “a wrong decision” that ignored the economic fundamentals and development potential of the world’s second-largest economy. Reporting by Stella Qiu and Ryan Woo; Editing by Kim Coghill", "external_links": [], "published": "2018-01-29T08:45:00.000+02:00", "crawled": "2018-01-29T09:19:42.016+02:00", "highlightTitle": ""}