{"organizations": [], "uuid": "a6586b559e2231e4d398f8bde8928392a77d177b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219476414&w=1200&r=LYNXMPEE0402W", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-oil/oil-prices-hold-near-2015-highs-but-doubts-over-rally-emerge-idUKKBN1EU07K", "country": "US", "domain_rank": 408, "title": "Oil prices hold near 2015 highs, but doubts over rally emerge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T04:01:00.000+02:00", "replies_count": 0, "uuid": "a6586b559e2231e4d398f8bde8928392a77d177b"}, "author": "", "url": "https://uk.reuters.com/article/us-global-oil/oil-prices-hold-near-2015-highs-but-doubts-over-rally-emerge-idUKKBN1EU07K", "ord_in_thread": 0, "title": "Oil prices hold near 2015 highs, but doubts over rally emerge", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "bakersfield", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "brent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 2:18 AM / Updated 33 minutes ago Oil prices hold near 2015 highs, but doubts over rally emerge Henning Gloystein 3 Min Read \nSINGAPORE (Reuters) - Oil prices held firm on Friday, with Brent crude up by more than 10 percent from its December lows on the back of political tensions in OPEC-member Iran and a tightening U.S. market. A pump jack is seen at sunrise near Bakersfield, California October 14, 2014. REUTERS/Lucy Nicholson/File Photo \nU.S. West Texas Intermediate (WTI) crude futures CLc1 were at $61.95 a barrel at 0151 GMT, 5 cents below their last close but not far off the $62.21 May 2015 high reached the previous day. \nBrent crude futures LCOc1 were at $68.03 a barrel, 4 cents below their last settlement, but not far off the $68.27 high from the day before, also the highest since May 2015. \nBeyond a brief intraday spike in May 2015, these were the highest price levels since December 2014, during the oil price downturn. \nTraders said political tensions in oil producing Iran were supporting prices. \n“The protests in Iran add more fuel to the already bullish oil market mood,” said Norbert Ruecker, head of commodity research at Swiss Bank Julius Baer. \nOil prices have been supported by production cuts led by the Middle East dominated Organization of the Petroleum Exporting Countries (OPEC) and by Russia, which started in January last year and are set to last through 2018, as well as by strong economic growth and financial markets. [MKTS/GLOB] \nThis has helped tighten markets. U.S. Commercial crude inventories C-STK-T-EIA fell by 7.4 million barrels in the week to Dec. 29, to 424.46 million barrels, according to data from the Energy Information Administration (EIA). \nThat’s down 20 percent from their historic peaks last March and close to the five-year average of 420 million barrels. \n(For a graphic on 'U.S. oil production and storage levels' click reut.rs/2CqcWaC ) CAN THE BULL-RUN LAST? \nGiven that Iran’s oil production has not been affected by the unrest, and that U.S. production C-OUT-T-EIA will likely break through 10 million barrels per day (bpd) soon, a level so far only reached by Saudi Arabia and Russia, doubts are emerging whether the bull-run can last. \n“Prices above $60 per barrel project an overly rosy picture, so we see near-term downside,” Ruecker warned. \n“Oil production disruptions (in Iran) remain a very distant threat ... Disruptions in the North Sea have been removed with the Forties Pipeline system having resumed full operations. U.S. oil production surpassed the 2015 highs in October and is set to climb to historic highs this year,” he said. \nLukman Otunuga, analyst at futures brokerage FXTM, struck a similarly cautious tone. \n“Oil started the New Year on an incredibly bullish note ... in part due to ongoing tensions in Iran ... (and) over OPEC’s supply cut rebalancing the markets,” he said. \n“While the current momentum suggests that further upside is on the cards, it must be kept in mind that U.S. shale remains a threat to higher oil prices.” Reporting by Henning Gloystein; Editing by Richard Pullin", "external_links": [], "published": "2018-01-05T04:01:00.000+02:00", "crawled": "2018-01-05T05:10:26.046+02:00", "highlightTitle": ""}