{"organizations": [], "uuid": "a21d471cd286e38429de79c0df3692b498d71c3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-akebia-therapeutics-announces-positive-top-line-results-from-phase-2-study-of-vadadustat-in-japanese-patients-with-anemia.html", "country": "US", "domain_rank": 767, "title": "Akebia Therapeutics Announces Positive Top-Line Results from Phase 2 Study of Vadadustat in Japanese Patients with Anemia Associated with Dialysis-Dependent Chronic Kidney Disease", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.393, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "a21d471cd286e38429de79c0df3692b498d71c3a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-akebia-therapeutics-announces-positive-top-line-results-from-phase-2-study-of-vadadustat-in-japanese-patients-with-anemia.html", "ord_in_thread": 0, "title": "Akebia Therapeutics Announces Positive Top-Line Results from Phase 2 Study of Vadadustat in Japanese Patients with Anemia Associated with Dialysis-Dependent Chronic Kidney Disease", "locations": [], "entities": {"persons": [{"name": "akebia", "sentiment": "none"}], "locations": [{"name": "vadadustat", "sentiment": "none"}, {"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "anemia associated", "sentiment": "neutral"}, {"name": "mitsubishi tanabe pharma corporation", "sentiment": "none"}, {"name": "akebia therapeutics , inc.", "sentiment": "none"}, {"name": "mtpc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- Data Consistent with Findings from Previous Studies --\n-- Phase 3 Study of Non-Dialysis Patients in Japan Ongoing; Phase 3 Studies of Dialysis Patients to Begin in 2018 --\nCAMBRIDGE, Mass.--(BUSINESS WIRE)-- Akebia Therapeutics , Inc. (NASDAQ:AKBA), a biopharmaceutical company focused on delivering innovative therapies to patients with kidney disease through the biology of hypoxia-inducible factor (HIF), today announced positive top-line results from its Phase 2 study of vadadustat in patients with anemia associated with dialysis-dependent chronic kidney disease (DD-CKD) in Japan. The results are consistent with findings from previous studies of vadadustat. Akebia’s partner, Mitsubishi Tanabe Pharma Corporation (MTPC), is conducting a Phase 3 study of non-dialysis dependent (NDD-CKD) patients in Japan and, based upon the data announced today, is expected to begin Phase 3 studies in DD-CKD patients in Japan in 2018. Under the terms of the collaboration agreement with MTPC, Akebia will receive $10 million in milestone payments in conjunction with the start of the Phase 3 studies.\n“These positive top-line Phase 2 results in dialysis-dependent patients in Japan follow our recently-announced positive top-line Phase 2 results in Japanese patients who were not dialysis-dependent,” said Rita Jain, M.D., Senior Vice President and Chief Medical Officer at Akebia. “The data from both studies provide further confirmation of vadadustat’s potential to help patients, and we look forward to the results of the Phase 3 program in Japan by our partner, MTPC, and the potential launch of vadadustat in 2020.”\nThe double-blind, placebo-controlled, dose-finding Phase 2 study was designed to evaluate the efficacy, safety and tolerability of orally-administered vadadustat in Japanese patients with anemia associated with DD-CKD. This 16-week study evaluated 60 patients during a 6-week placebo-controlled, fixed-dose period and a 10-week active treatment, dose adjustment and maintenance period.\nThe primary efficacy endpoint was mean hemoglobin change from baseline to week 6 comparing vadadustat to placebo. Statistically significant improvements in the primary endpoint were observed in the vadadustat groups, 150 mg (p = 0.0004), 300 mg (p < 0.0001), and 600 mg (p < 0.0001), compared to placebo. The data indicate a dose-response for vadadustat.\nThe incidence of adverse events during the 6-week placebo-controlled, fixed-dose period in the vadadustat groups (150 mg, 300 mg and 600 mg) and placebo was 53%, 73%, 40%, and 40%, respectively. During the 16-week study and the 2-week follow-up period, the most common adverse events reported were nasopharyngitis (20%), diarrhea (13.3%), and headache (10%). Serious adverse events were consistent with prior studies and included 10 SAEs in 7 patients, none of which were considered drug related. No deaths were reported.\nAkebia and MTPC plan to present the data from the NDD-CKD and DD-CKD Phase 2 studies conducted in Japan at an upcoming scientific meeting and publish the results in a peer-reviewed journal.\nAbout Vadadustat\nVadadustat is an oral hypoxia-inducible factor (HIF) stabilizer currently in Phase 3 development for the treatment of anemia related to chronic kidney disease. Vadadustat exploits the same mechanism of action used by the body to adapt naturally to lower oxygen availability associated with a moderate increase in altitude. At higher altitudes, the body responds to lower oxygen availability with increased production of HIF, which coordinates the interdependent processes of iron mobilization and erythropoietin production to increase red blood cell production and, ultimately, improve oxygen delivery.\nAbout Akebia Therapeutics\nAkebia Therapeutics, Inc. is a biopharmaceutical company headquartered in Cambridge, Massachusetts, focused on delivering innovative therapies to patients with kidney disease through hypoxia-inducible factor biology. Akebia's lead product candidate, vadadustat, is an oral, investigational therapy in development for the treatment of anemia related to chronic kidney disease in both non-dialysis and dialysis patients and is not approved by the U.S. Food and Drug Administration or any regulatory authority. Akebia's global Phase 3 program for vadadustat, which includes the PRO 2 TECT studies for non-dialysis patients with anemia secondary to chronic kidney disease and the INNO 2 VATE studies for dialysis-dependent patients, is currently ongoing. In addition, the Company has initiated the Phase 2 FO 2 RWARD study of vadadustat in dialysis-dependent chronic kidney disease patients who are hyporesponsive to erythropoiesis-stimulating agents (ESAs), and expects to commence the Phase 3 TRILO 2 GY study to further evaluate a three-times-weekly dosing regimen for vadadustat. For more information, please visit our website at www.akebia.com .\nForward-Looking Statements\nStatements in this press release regarding Akebia’s strategy, plans, prospects, expectations, beliefs, intentions or goals are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, including but not limited to statements regarding the timing of clinical trials; the timing, availability and presentation of clinical trial data and results; the potential commercialization of vadadustat in Japan if approved by regulatory authorities; the potential indications and benefits of vadadustat; and the potential financial contributions from MTPC. The terms “anticipate,” “appear,” “believe,” “estimate,” “expect,” “intend,” “look forward to” “may,” “plan,” “predict,” “project,” “target,” “potential,” “will,” “would,” “could,” “should,” “continue,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Each forward-looking statement is subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in such statement, including the risk that existing preclinical and clinical data may not be predictive of the results of ongoing or later clinical trials; manufacturing risks; the actual funding required to develop Akebia's product candidates and operate the company, and the actual expenses associated therewith; the actual costs incurred in the clinical studies of vadadustat and the availability of financing to cover such costs; the risk that clinical studies need to be discontinued for any reason, including for safety, tolerability, enrollment, manufacturing or economic reasons; early termination of Akebia's Collaboration Agreement with MTPC; Akebia's ability to satisfy its obligations under the MTPC Collaboration Agreement; the timing and content of decisions made by the PMDA and other regulatory authorities; the timing of any additional studies initiated by Akebia or MTPC for vadadustat; the rate of enrollment in clinical studies of vadadustat; the actual time it takes to initiate and complete research and clinical studies; the success of competitors in developing product candid", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.akebia.com&esheet=51737672&newsitemid=20180104005462&lan=en-US&anchor=www.akebia.com&index=2&md5=945e7e00042121cd0b117654e91e90a2", "http://www.businesswire.com/news/home/20180104005462/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.akebia.com&esheet=51737672&newsitemid=20180104005462&lan=en-US&anchor=Akebia+Therapeutics&index=1&md5=ac563c5f1ddb8aff576d6cf91d001170"], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T17:13:22.011+02:00", "highlightTitle": ""}