{"organizations": [], "uuid": "071fcec64a2084959007c327a30dcee51ce84b95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-ukraine-corruption-worldbank/world-bank-joins-imf-in-criticism-of-ukraines-anti-corruption-draft-law-idUSKBN1F5236", "country": "US", "domain_rank": 408, "title": "World Bank joins IMF in criticism of Ukraine's anti-corruption draft law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:16:00.000+02:00", "replies_count": 0, "uuid": "071fcec64a2084959007c327a30dcee51ce84b95"}, "author": "", "url": "https://www.reuters.com/article/us-ukraine-corruption-worldbank/world-bank-joins-imf-in-criticism-of-ukraines-anti-corruption-draft-law-idUSKBN1F5236", "ord_in_thread": 0, "title": "World Bank joins IMF in criticism of Ukraine's anti-corruption draft law", "locations": [], "entities": {"persons": [{"name": "petro poroshenko", "sentiment": "none"}, {"name": "satu kahkonen", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "world bank", "sentiment": "negative"}, {"name": "venice commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "kiev", "sentiment": "none"}, {"name": "ukrainska pravda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 4:38 PM / in 16 minutes World Bank joins IMF in criticism of Ukraine's anti-corruption draft law Reuters Staff 3 Min Read \nKIEV (Reuters) - The World Bank has joined the International Monetary Fund in criticizing a Ukrainian draft law to create an anti-corruption court, the newspaper Ukrainska Pravda reported on Monday, citing a letter from the lender to the presidential administration. \nIn response to international pressure to speed up the process, President Petro Poroshenko submitted a new draft law to parliament in December, but the IMF and now the World Bank say the legislation is not in line with recommendations from the Venice Commission, a European rights and legal watchdog. \nUkraine’s Western backers have long called for the authorities to establish an independent court to handle corruption cases. Slow progress has delayed the disbursement of foreign loans. \nThe World Bank’s country director, Satu Kahkonen, has written to the presidential administration to express the bank’s concerns about parts of the bill, Ukrainska Pravda said, publishing what it said was the text of the letter in full. \n“We believe that the draft law requires the following revisions to bring it into alignment with the recommendations of the Venice Commission and satisfy the requirements of the World Bank’s estimated $800 million Policy-Based Guarantee to support key reforms in Ukraine,” she said, in a letter dated Jan. 15. \nAmong its recommendations, it says the court’s future jurisdiction needs to be better aligned with that of anti-corruption investigators and prosecutors. \nThe World Bank in Ukraine did not immediately respond to a request for comment about the Ukrainska Pravda report. \nThe letter cited echoes one sent by the IMF to the president’s office earlier in January which warned that the draft law did not guarantee the independence of the court. \nThe presidential administration did not immediately respond to a request for comment. \nOn Monday, in response to the IMF’s letter, it denied the law was not in line with Venice Commission recommendations and said the authorities had the political will to create an independent anti-corruption court. \nSince its 2013-14 pro-European uprising, Ukraine has received $8.4 billion from the IMF and over $5 billion from the World Bank among other backers, helping it to return to growth of over 2 percent in 2016. \nHowever the disbursement of funding was held up last year over perceived backtracking on reform commitments that raised doubts about the authorities’ will to eliminate corruption and modernize the economy. Reporting by Alessandra Prentice; Editing by Alison Williams", "external_links": [], "published": "2018-01-16T18:16:00.000+02:00", "crawled": "2018-01-16T18:56:23.053+02:00", "highlightTitle": ""}