{"organizations": [], "uuid": "86b0944ab12b7ac2b96f9db7dd028fa5b606b01d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-fuse-medical-inc-announces-engagement-of-montgomery-coscia-greilich-llp.html", "country": "US", "domain_rank": 767, "title": "Fuse Medical, Inc. Announces Engagement of Montgomery, Coscia, Greilich, LLP", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T01:34:00.000+02:00", "replies_count": 0, "uuid": "86b0944ab12b7ac2b96f9db7dd028fa5b606b01d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-fuse-medical-inc-announces-engagement-of-montgomery-coscia-greilich-llp.html", "ord_in_thread": 0, "title": "Fuse Medical, Inc. Announces Engagement of Montgomery, Coscia, Greilich, LLP", "locations": [], "entities": {"persons": [{"name": "greilich", "sentiment": "negative"}, {"name": "coscia", "sentiment": "negative"}, {"name": "bill mclaughlin", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}], "locations": [{"name": "montgomery", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "richardson", "sentiment": "none"}, {"name": "plano", "sentiment": "none"}], "organizations": [{"name": "fuse medical, inc", "sentiment": "neutral"}, {"name": "mcg", "sentiment": "none"}, {"name": "llp mcg", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "cpm medical consultants", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHARDSON, Texas--(BUSINESS WIRE)-- Fuse Medical, Inc., (OTC: FZMD), (“Fuse” or the “Company”), announced the appointment of Montgomery, Coscia, Greilich, LLP, (“MCG”), headquarter in Plano, Texas, as the Company’s independent registered public accounting firm for the fiscal year ending December 31, 2017.\nThe Company’s Board of Directors and management believe that MCG’s size and expertise more closely align with the strategic vision for the Company following the previously announced closing of the acquisition of CPM Medical Consultants, LLC on December 31, 2017.\nBill McLaughlin, Chief Financial Officer of Fuse, said, “We are delighted with the expertise MCG brings to the table, and we believe that MCG’s in-depth capabilities closely align with our increasing larger economic footprint and strategic growth plans.”\nAbout Montgomery, Coscia, Greilich, LLP\nMCG is a full-service professional accounting firm located in Plano, Texas. The firm offers traditional accounting services as well as transaction advisory, financial advisory, and strategy and management consulting. MCG provides a forward-looking audit strategy that focuses on risk and stakeholders’ needs and is designed to increase quality and efficiency in the financial statement reporting process. For more information, visit: https://www.mcggroup.com/ .\nAbout Fuse Medical, Inc.\nFuse provides a broad portfolio of orthopedic implants including internal and external fixation products; upper and lower extremity plating; total joint reconstruction; soft tissue fixation and augmentation for sports medicine procedures; full spinal implants for trauma, degenerative disc disease, and deformity indications; human allografts, substitute bone materials, and tendons; and regenerative tissues and fluids to augment orthopedic surgeries and wound care. For more information about Fuse, please visit: www.fusemedical.com .\nForward-Looking Statements\nCertain statements in this press release, including those related to an anticipated purchase of all of the outstanding membership units and plans for the consolidated company, constitute “forward-looking statements” within the meaning of the federal securities laws. Words such as “may,” “might,” “will,” “should,” “believe,” “expect,” “anticipate,” “estimate,” “continue,” “predict,” “forecast,” “project,” “plan,” “intend,” or similar expressions or statements regarding intent, belief, or current expectations, are forward-looking statements. While the Company believes these forward-looking statements are reasonable, undue reliance should not be placed on any such forward-looking statements, which are based only on information available to the Company as of the date of this release. These forward-looking statements are based upon current estimates and assumptions and are subject to various risks and uncertainties, including, without limitation, those set forth in the Company’s filings with the Securities and Exchange Commission; the failure of the Company to close the transaction; and integration issues with the consolidated company. Thus, actual results could be materially different. The Company expressly disclaims any obligation to update or alter statements whether as a result of new information, future events, or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006200/en/\nFuse Medical, Inc.\nDevon Peddie, 469-862-3030\nInvestor Relations Analyst\nFacsimile: 469-862-3035\ninfo@Fusemedical.com\nSource: Fuse Medical, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.mcggroup.com%2F&esheet=51742242&newsitemid=20180111006200&lan=en-US&anchor=https%3A%2F%2Fwww.mcggroup.com%2F&index=1&md5=9996e73fd0008dccc07357a549558a86", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fusemedical.com&esheet=51742242&newsitemid=20180111006200&lan=en-US&anchor=www.fusemedical.com&index=2&md5=147243a5ce9e0d3865de522944a9e586", "https://www.mcggroup.com/", "http://www.businesswire.com/news/home/20180111006200/en/"], "published": "2018-01-12T01:34:00.000+02:00", "crawled": "2018-01-12T01:59:48.000+02:00", "highlightTitle": ""}