{"organizations": [], "uuid": "335dc7f32dedf105af19902f9fbd62ecd28d81ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-rise-thai-shares-hit-record-high-idUSL4N1P71ZM", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Rise; Thai shares hit record high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T06:02:00.000+02:00", "replies_count": 0, "uuid": "335dc7f32dedf105af19902f9fbd62ecd28d81ae"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-rise-thai-shares-hit-record-high-idUSL4N1P71ZM", "ord_in_thread": 0, "title": "SE Asia Stocks-Rise; Thai shares hit record high", "locations": [], "entities": {"persons": [{"name": "sandhya sampath jan", "sentiment": "none"}, {"name": "jose l. vistan", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "se asia stocks-rise", "sentiment": "negative"}, {"name": "ab capital securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Regional stocks track equities in Asia, Wall Street * Vietnam extends gains, hits 10-yr high * Philippines on track for 6th weekly increase By Sandhya Sampath Jan 12 (Reuters) - Southeast Asian stock markets rose on Friday, tracking gains in Asian equities and Wall Street, as strong Chinese trade data, higher oil prices and indications of a strong U.S. corporate earnings season lifted sentiment. Asia shares ex-Japan rose 0.4 percent after two sessions of declines, while U.S. indexes closed at record highs overnight. China's exports denominated in yuan rose 10.8 percent year-on-year in 2017, government data showed. Global oil prices eased on Friday after hitting their highest levels in three years the previous day. \"Market has started the year on a very positive note, and we are looking at a bullish outlook globally, in terms of economic growth,\" said Jose L. Vistan, research head at Manila-based AB Capital Securities. Thai shares rose as much as 0.7 percent to hit a record high, with gains led by energy and financial stocks. PTT Exploration and Production PCL surged as much as 3.2 percent to a 30-month high, while Siam Commercial Bank PCL rose 1.3 percent. Philippines climbed as much as 0.6 percent, with financials and industrials accounting for three-fourths of the gains on the index. BDO Unibank Inc was up 1.3 percent, while International Container Terminal Services Inc added 0.9 percent. \"Given the strong growth globally, the Philippines stands out because we are projected to be the fastest growing in Southeast Asia, which is attracting a lot of attention from investors,\" said Vistan. The index is on track to post its sixth straight week of gains. Singapore's FTSE Straits Times Index snapped two days of declines, with financials and industrials up. United Overseas Bank Ltd gained 0.6 percent, while Jardine Strategic Holdings Ltd rose 1.1 percent. Vietnam extended a nearly fortnight-long rally to touch a 10-year peak, and is on track to add about 4 percent on week. Real estate stocks were among the top gainers, with Vingroup Joint Stock up 0.5 percent. Indonesian shares edged up as much as 0.4 percent, with energy and financial stocks leading the gainers. An index of the country's 45 most liquid stocks rose 0.2 percent. Malaysia inched up, snapping three sessions of losses, and is on track to post its seventh straight weekly gain. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change as of 0333 GMT Market Current Previous close Pct Move Singapore 3521.32 3512.68 0.25 Bangkok 1814.49 1802.8 0.65 Manila 8850.87 8813.25 0.43 Jakarta 6397.369 6386.339 0.17 Kuala Lumpur 1820.38 1816.88 0.19 Ho Chi Minh 1053.88 1048.17 0.54 Change on year Market Current End 2017 Pct Move Singapore 3521.32 3402.92 3.48 Bangkok 1814.49 1753.71 3.47 Manila 8850.87 8558.42 3.40 Jakarta 6397.369 6355.654 0.66 Kuala Lumpur 1820.38 1796.81 1.31 Ho Chi Minh 1053.88 984.24 7.08 (Reporting by Sandhya Sampath; Editing by Biju Dwarakanath)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-12T06:02:00.000+02:00", "crawled": "2018-01-12T06:41:21.009+02:00", "highlightTitle": ""}