{"organizations": [], "uuid": "ee2d47dda0697527fff4e05e704354698df5d9e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-ftd-companies-inc-announces-appointment-of-e-commerce-merchandising-and-digital-marketing-executivesa.html", "country": "US", "domain_rank": 767, "title": "FTD Companies, Inc. Announces Appointment of E-commerce, Merchandising and Digital Marketing Executives", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.514, "site_type": "news", "published": "2018-01-03T00:15:00.000+02:00", "replies_count": 0, "uuid": "ee2d47dda0697527fff4e05e704354698df5d9e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-ftd-companies-inc-announces-appointment-of-e-commerce-merchandising-and-digital-marketing-executivesa.html", "ord_in_thread": 0, "title": "FTD Companies, Inc. Announces Appointment of E-commerce, Merchandising and Digital Marketing Executives", "locations": [], "entities": {"persons": [{"name": "luke massery", "sentiment": "none"}, {"name": "brita", "sentiment": "none"}, {"name": "kum", "sentiment": "none"}, {"name": "rob van auken", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "simha kumar", "sentiment": "none"}, {"name": "brita turner", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "downers grove", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "digital marketing executives", "sentiment": "negative"}, {"name": "ftd companies, inc", "sentiment": "neutral"}, {"name": "ftd companies, inc.", "sentiment": "neutral"}, {"name": "general manager of gourmet foods", "sentiment": "none"}, {"name": "gourmet foods", "sentiment": "none"}, {"name": "ftd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DOWNERS GROVE, Ill., Jan. 02, 2018 (GLOBE NEWSWIRE) -- FTD Companies, Inc. (Nasdaq:FTD) (“FTD” or the “Company”), a premier floral and gifting company, announces two recent appointments and a promotion of e-commerce executives to run its key US consumer brands. These appointments mark further progress in FTD’s efforts to build a team to develop and lead the strategic transformation of the business.\nBrita Turner has joined FTD as Senior Vice President and General Manager of ProFlowers, effective Nov. 13, 2017. Rob Van Auken has also joined FTD as Senior Vice President and General Manager of FTD.com , effective Nov. 27, 2017. In addition, Luke Massery, Vice President and General Manager of Gourmet Foods, was promoted to Senior Vice President and General Manager of Gourmet Foods. These business leaders will report to Simha Kumar, FTD’s Executive Vice President and Chief Operating Officer.\n“We are very pleased to welcome Brita and Rob to the FTD team as we finalize our strategic plans for the critical floral businesses and position ourselves to execute our ambitious plans,” commented Kumar. “I would also like to congratulate Luke on his well-deserved promotion leading Shari’s Berries and our food business. These leaders bring extensive e-commerce, merchandising and digital marketing expertise, and their contributions will be invaluable to help drive FTD’s success over the next several years.”\nFrom 2015 to 2017, Brita Turner served as Head of Digital at Godiva Chocolatier where she used new technology, product and merchandising tactics to grow the North America Godiva.com business and redesigned Godiva.com to achieve a more simplified and customer-focused site experience. Before that, from 2012 to 2015, she served as Bed Bath & Beyond’s E-commerce Buyer for Soft Home and Fashion where she was responsible for launching and growing new and existing online departments and an online vendor direct to consumer program. She has also held positions at Amazon.com and IBM Global Business Services. She holds a Bachelor of Arts in Finance from Lehigh University and a Master of Business Administration from University of North Carolina with concentrations in Strategy Consulting and Luxury Goods Marketing.\nRob Van Auken has extensive experience in strategic business leadership across retail and e-commerce companies. Most recently, he served as Divisional Vice President and General Manager, Sears Commercial, from 2014 to 2017 where he managed the Kenmore business-to-business unit and was responsible for sales, marketing, customer success, field operations and vendor management. In this role, he defined the strategy, aligned resources, and improved the customer experience to drive multi-year financial improvement. Before that, he served as Amazon’s Divisional Merchandising Manager, Consumer Electronics, from 2011 to 2014 where he led buying and vendor management and inventory planning for their high-profile camera category. Van Auken has also held a variety of leadership positions at Best Buy. He holds a Bachelor of Business Administration, Finance from Iowa State University and a Master of Business Administration, Finance and Strategic Management from University of Iowa.\nLuke Massery joined FTD in May 2016 as Vice President and General Manager of Gourmet Foods. He has strong e-commerce and consumer industry experience having worked from 2011 to 2016 at Groupon, where he served as Vice President of Sales for the US Local business and Vice President, General Manager of the Groupon Goods Europe Business. Prior to Groupon he was a Consultant and Manager in the Consumer Packaged Goods practice area at Bain & Co. Massery holds a Bachelor of Science in Mechanical Engineering from MIT.\nFor more information about FTD Companies, please visit www.FTDCompanies.com .\nAbout FTD Companies, Inc.\nFTD Companies, Inc. is a premier floral and gifting company. Through our diversified family of brands, we provide floral, specialty foods, gifts and related products to consumers primarily in the United States and the United Kingdom. We also provide floral products and services to retail florists and other retail locations throughout these same geographies. FTD has been delivering flowers since 1910 and the highly-recognized FTD® and Interflora® brands are supported by the iconic Mercury Man logo®, which is displayed in nearly 35,000 floral shops in over 125 countries. In addition to FTD and Interflora, our diversified portfolio of brands includes the following trademarks: ProFlowers®, ProPlants®, Shari's Berries®, Personal Creations®, RedEnvelope®, Flying Flowers®, Flowers Direct™, Ink Cards™, Postagram™ and Gifts.com™. FTD Companies, Inc. is headquartered in Downers Grove, Ill. For more information, please visit www.ftdcompanies.com .\nCautionary Information Regarding Forward-Looking Statements\nThis release contains certain forward-looking statements within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, as amended, based on our current expectations, estimates and projections about our operations, industry, financial condition, performance, results of operations, and liquidity. Statements containing words such as “may,” “believe,” “anticipate,” “expect,” “intend,” “plan,” “project,” “projections,” “business outlook,” “estimate,” or similar expressions constitute forward-looking statements. These forward-looking statements include, but are not limited to, statements about the Company’s strategies and future financial performance; expectations about future business plans, prospective performance and opportunities, including potential acquisitions; revenues; segment metrics; operating expenses; market trends, including those in the markets in which the Company competes; liquidity; cash flows and uses of cash; dividends; capital expenditures; depreciation and amortization; tax payments; foreign currency exchange rates; hedging arrangements; the Company’s ability to repay indebtedness and invest in initiatives; the Company’s products and services; pricing; marketing plans; competition; settlement of legal matters; and the impact of accounting changes and other pronouncements. Potential factors that could affect these forward-looking statements include, among others, the factors disclosed in the Company’s most recent Annual Report on Form 10-K and the Company’s other filings with the Securities and Exchange Commission ( www.sec.gov ), including, without limitation, information under the captions “Management's Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors.” Readers are cautioned not to place undue reliance on these forward-looking statements, which reflect management's analysis only as of the date hereof. Any such forward-looking statements are not guarantees of future performance or results and involve risks and uncertainties that may cause actual performance and results to differ materially from those predicted. Re", "external_links": ["https://www.globenewswire.com/Tracker?data=ImQxFVyZD-ahZZJV8LePGdHe51sgLq4R-IjJr_fvQCakHAeHXVlAokh9mk2QFH9WsF8xwC4rKnIFWmeRnj27_ROh31vTre5IDY5aj4S3rao=", "https://www.globenewswire.com/Tracker?data=xVMh3IjHlw4AnGtxYAZp6zX92A9J0oDbLZX_6Ab-aw0g0NnMBKuVx_ZBbn1gBk7LZ_zJBUW84H79ZP7NLCfzsRuRyZ07vyjypEbiBklED78=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/bff3d164-8560-4240-92f7-f8080d197804"], "published": "2018-01-03T00:15:00.000+02:00", "crawled": "2018-01-03T02:23:15.015+02:00", "highlightTitle": ""}