{"organizations": [], "uuid": "7b80d66892cc3c93a75030aa02c04e256f18e320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-carrefour-q4-2017-revenue-up-2-point-3-percent-at-constant-exchange-rates.html", "country": "US", "domain_rank": 767, "title": "Carrefour: Q4 2017 Revenue up +2.3% at Constant Exchange Rates", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-17T19:45:00.000+02:00", "replies_count": 0, "uuid": "7b80d66892cc3c93a75030aa02c04e256f18e320"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-carrefour-q4-2017-revenue-up-2-point-3-percent-at-constant-exchange-rates.html", "ord_in_thread": 0, "title": "Carrefour: Q4 2017 Revenue up +2.3% at Constant Exchange Rates", "locations": [], "entities": {"persons": [], "locations": [{"name": "boulogne-billancourt", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "lfl", "sentiment": "negative"}, {"name": "carrefour", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 : A difficult year overall Slowing sales momentum in 2017: +1.6% LFL in the full year vs +3.0% in 2016 Recurring operating income expected at around €2.00bn in the full year (non-audited estimate), down about -15% at current exchange rates Free Cash Flow excluding exceptional items around €950m (non-audited estimate) vs. €1,039m in 2016 An improved performance in the fourth quarter following an atypical third quarter Like-for-like growth of 1.9% in Q4, marking a sharp improvement over the previous quarter (+0.5% in Q3) and in line with the first half (+2.1% in H1); Improved trends, notably in France (+ 1.5 % LFL in Q4 vs -0.9% in Q3), with: more favorable momentum in all formats successful Black Friday and year-end campaigns Growth still weak in Brazil , impacted by food deflation The Group’s transformation plan will be presented on January 23\nBOULOGNE-BILLANCOURT, France--(BUSINESS WIRE)-- Regulatory News:\nCarrefour (Paris:CA):\nFourth quarter 2017 Full-year 2017 Sales\ninc. VAT\n(€m)\nLFL* Total variation Sales inc.\nVAT (€m)\nLFL* Total variation At current\nexchange\nrates\nAt constant\nexchange\nrates\nAt current\nexchange\nrates\nAt constant\nexchange\nrates\nFrance 10,706 +1.5% -0.5% -0.5% 40,096 +0.8% -0.1% -0.1% Other countries 12,621 +2.1% +0.1% +4.7% 48,144 +2.2% +5.6% +5.1% Group 23,328 +1.9% -0.2% +2.3% 88,240 +1.6% +3.0% +2.7% *ex petrol and ex calendar and at constant exchange rates\nA difficult full-year 2017\n2017 Sales: Total growth of +2.7% at constant exchange rates\nSales inc. VAT (€m) LFL* Total variation At\ncurrent\nexchange\nrates\nAt\nconstant\nexchange\nrates\nGroup 88,240 +1.6% +3.0% +2.7% France 40,096 +0.8% -0.1% -0.1% Other countries 48,144 +2.2% +5.6% +5.1% Europe 23,566 +1.3% +5.0% +4.9% Latin America 18,021 +6.1% +10.9% +8.9% Asia 6,557 -3.7% -4.7% -3.3% *ex petrol and calendar effects of -0.2% and -0.5% respectively, at constant exchange rate\nCarrefour posted sales of €88,240m in full-year 2017, representing total growth of +3.0%. At constant exchange rates, sales were up +2.7%.\nThe Group’s like-for-like growth was +1.6% in 2017, to be compared with like-for-like growth of +3.0% in 2016. This evolution notably reflects a slowdown in food sales growth that was particularly marked in the second half. Food sales in Brazil grew at a far slower pace in 2017, impacted by food deflation since the month of June while food inflation had been high in 2016, in particular in the second half. Food sales in France and in Europe in 2017 showed broadly similar trends to 2016.\nNon-food sales improved on a like-for-like basis in 2017 vs 2016. Brazil benefited from a revision of its non-food commercial proposition. In France, apparel benefited from a revision of its product lines and its commercial policy.\nIn France , total sales are slightly up, by +0.8% like-for-like in 2017. In a highly competitive environment, Carrefour’s commercial momentum was similar to that of 2016.\nIn a toughening competitive environment in Europe , like-for-like growth in the full year stood at +1.3%, notably reflecting improved trends in Northern Europe.\nThe slowdown in like-for-like growth in Latin America (+6.1% in 2017 vs +13.5% in 2016) reflects food deflation in Brazil in the second half, to be compared with double-digit inflation in 2016, as well as high inflation in Argentina in a context that remains challenging.\nSales trends in Asia improved over the year, at -3.7% (vs -5.0% in 2016).\nOutlook for recurring Operating Income and Free Cash Flow (non-audited estimates)\nRecurring Operating Income for full-year 2017 should stand at about €2.00bn, a drop of -15% at current exchange rates.\nThis full-year evolution notably reflects:\nstrong commercial pressure, particularly in France, an increase in distribution costs in our main markets, an increase in depreciation after a period of significant investments, a more difficult situation in Argentina.\nThe full-year Recurring Operating Income also includes sources of losses that continue to weigh on profitability, notably the ex-Dia store network for about -€150m.\nFree cash flow in full-year 2017, excluding exceptional items, should stand around €950m vs. €1,039m in 2016.\nCapital expenditure in the full year should stand at €2,145mn ex Cargo.\nFOURTH QUARTER 2017 SALES:\nLIKE-FOR-LIKE GROWTH OF +1.9%\nSales inc. VAT (€m) LFL* Total variation At current\nexchange\nrates\nAt\nconstant\nexchange\nrates\nGroup 23,328 +1.9% -0.2% +2.3% France 10,706 +1.5% -0.5% -0.5% Other countries 12,621 +2.1% +0.1% +4.7% Europe 6,509 +0.4% +3.4% +3.3% Latin America 4,673 +5.9% -2.4% +8.4% Asia 1,439 -3.0% -5.4% -0.7% *ex petrol and calendar effects of -0.3% and -0.6% respectively, at constant exchange rates\nCarrefour’s fourth-quarter 2017 sales stood at €23,328m, up +1.9% like-for-like, an improvement over the previous quarter (+0.5%), principally linked to activity in France.\nIn a persistently competitive environment, France posted like-for-like growth of +1.5% vs -0.9% in the third quarter, reflecting more favorable momentum in all formats and successful Black Friday and year-end campaigns. Sales at hypermarkets, up +0.7% like-for-like, also benefited from the Carrefour Anniversary campaign, which took place in October this year instead of in September, as in 2016.\nEurope’s performance (+0.4% like-for-like and +3.4% in total at current exchange rates) was in line with that of Q3:\nIn Spain , like-for-like sales were down -0.6%. This evolution reflects a high comparable base and continued competitive pressure in this market. Total growth was +6.0%, notably taking into account the Eroski stores acquired and integrated in the first half; Like-for-like sales in Italy were down -1.1%. This evolution reflects strong comparables over the past two years, notably supported by the momentum of store remodelings and the roll-out of clusterization in supermarkets, as well as a toughening competitive environment; Like-for-like sales in Belgium were up +0.8%; Sales in Poland were up by +1.9% on a like-for-like basis despite a high comparable base in Q4 2016. The strong momentum continued in Romania , with sales up +7.8%.\nIn Latin America , like-for-like sales were up +5.9%:\nIn Brazil , like-for-like sales rose +1.4%, impacted by food deflation that continued in the fourth quarter (of around -5%) while Q4 2016 saw food inflation of +13%.\nIn this context, Atacadão’s like-for-like sales still posted 2.2% growth, with higher volumes, notably thanks to an excellent Black Friday campaign. Like-for-like sales at Carrefour Retail were broadly stable at -0.1%. Like-for-like sales in Argentina increased by +23.2%, a level close to the country’s inflation rate.\nIn Asia, sales were down -3.0% on a like-for-like basis. China posted a like-for-like sales drop of -5.4%, in line with trends observed over the past quarters, while favorable trends continued in Taiwan , where like-for-like sales rose for the twelth consecutive quarter, by +3.5%.\nAGENDA\nPresentation of the transformation plan: January 23, 2018 Full-year 2017 results: February 28, 2018 (conference call after market close) First-quarter 2018 sales: April 11, 2018\nVARIATION OF FULL-YEAR 2017 SALES INC. VAT\nThe Group’s sales in the full year stood at €88,240m. In the period, currencies had a favorable effect of +0.3%. The petrol effect was a favorable +0.2% and the calendar effect was an unfavo", "external_links": ["http://www.businesswire.com/news/home/20180117006038/en/"], "published": "2018-01-17T19:45:00.000+02:00", "crawled": "2018-01-17T21:24:39.000+02:00", "highlightTitle": ""}