{"organizations": [], "uuid": "770b553df06615e24b7a35fbc6b690a48895437d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221736930&w=1200&r=LYNXMPEE0C0HA", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur/soccer-sako-hands-palace-narrow-win-over-burnley-idUKKBN1F20QL", "country": "US", "domain_rank": 408, "title": "Soccer - Sako hands Palace narrow win over Burnley", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T19:27:00.000+02:00", "replies_count": 0, "uuid": "770b553df06615e24b7a35fbc6b690a48895437d"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur/soccer-sako-hands-palace-narrow-win-over-burnley-idUKKBN1F20QL", "ord_in_thread": 0, "title": "Soccer - Sako hands Palace narrow win over Burnley", "locations": [], "entities": {"persons": [{"name": "sako", "sentiment": "neutral"}, {"name": "ken ferris", "sentiment": "none"}, {"name": "bakary sako", "sentiment": "none"}, {"name": "matt westby", "sentiment": "none"}, {"name": "sibley  bakary sako", "sentiment": "none"}], "locations": [{"name": "selhurst park", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "burnley - selhurst park", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "palace", "sentiment": "neutral"}, {"name": "burnley", "sentiment": "neutral"}, {"name": "burnley reuters staff", "sentiment": "neutral"}, {"name": "read  crystal palace", "sentiment": "none"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 5:32 PM / Updated 25 minutes ago Sako hands lively Palace victory over Burnley Matt Westby 3 Min Read \nLONDON (Reuters) - Crystal Palace continued their rise up the Premier League table by beating Burnley 1-0 with a first-half goal from Bakary Sako at Selhurst Park on Saturday.   Crystal Palace vs Burnley - Selhurst Park, London,   Crystal Palace's Bakary Sako reacts after a missed chance Action Images via Reuters/John Sibley \nSako’s angled left-foot drive in the 21st minute was enough to take Palace to 12th on 25 points, five above the relegation zone after they made the worst start to a top-flight English league campaign with no points or goals after seven matches. \n“It was a massive three points,” said Palace manager Roy Hodgson. “We knew it would be very, very tough. In the first half we created chances to make life more comfortable for us in the second half.” \nBurnley have gone six league matches without a win but remain seventh in the standings on 34 points from 23 games. \n“Second half, we were at least decent and I thought we deserved to scratch a draw,” said Burnley manager Sean Dyche. “The margins were tight when we were winning games and the margins are tight now. Second half, we really took it on today.” \nPalace were the superior side throughout the first half and deservedly took the lead when Sako side-stepped Phil Bardsley in the left channel and drilled a powerful shot past keeper Nick Pope for his seventh goal of the season in all competitions. \nThe hosts almost doubled the advantage two minutes later after Wilfried Zaha pounced on a sloppy back-pass and hooked past Pope, but Burnley defender Ben Mee scampered superbly to beat James McArthur to the loose ball and clear.   Crystal Palace vs Burnley - Selhurst Park, London,   Crystal Palace's Bakary Sako reacts after a missed chance Action Images via Reuters/John Sibley WASTEFUL BENTEKE \nPalace’s unmarked Christian Benteke then headed over from a corner, and Burnley almost punished his profligacy when Sam Vokes headed wide and Ashley Barnes half-volleyed over in quick succession on a brief foray forward for the visitors. \nBut Palace were soon back on the front foot and spurned two more chances before the interval, Benteke flicking Patrick van Aanholt’s scuffed left-foot shot straight at Pope and Sako volleying narrowly wide from a Timothy Fosu-Mensah cross.   Crystal Palace vs Burnley - Selhurst Park, London,   Crystal Palace's Bakary Sako scores their first goal Action Images via Reuters/John Sibley \nBurnley started the second half far better and could have equalised through headers from Vokes and then Barnes, but both strikers steered their efforts wide. \nSako also wasted a fine headed chance and Zaha had a close-range shot blocked as both teams traded attacks and a second goal began to look increasingly inevitable. \nBenteke looked certain to score when he rose to meet Sako’s left-wing cross in the 69th but again he proved why he only has one goal to his name this season by floating his header wide. \nBurnley piled forward in the last five minutes and almost snatched an equaliser in the 87th when Vokes only just failed to connect with James Tarkowski’s low cross. \nBenteke hit the side-netting on a counter-attack as another chance went begging for the Belgium striker, buy Palace saw out added time to seal their second successive league win. Editing by Ken Ferris", "external_links": [], "published": "2018-01-13T19:27:00.000+02:00", "crawled": "2018-01-13T19:58:42.005+02:00", "highlightTitle": ""}