{"organizations": [], "uuid": "faeacc9fe8b5ea1ac99802691220fa56121b53b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/business/financial-services", "section_title": "", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-at-session-highs-on-deal-to-end-u-s-shutdown-idUSL4N1PH4TG", "country": "US", "domain_rank": 408, "title": "Us Stocks-Wall St at session highs on deal to end U.S. shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:35:00.000+02:00", "replies_count": 0, "uuid": "faeacc9fe8b5ea1ac99802691220fa56121b53b1"}, "author": "", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-at-session-highs-on-deal-to-end-u-s-shutdown-idUSL4N1PH4TG", "ord_in_thread": 0, "title": "Us Stocks-Wall St at session highs on deal to end U.S. shutdown", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "none"}, {"name": "sruthi shankar  jan", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "randy frederick", "sentiment": "none"}, {"name": "charles s", "sentiment": "none"}, {"name": "juno", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "aig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:05 PM / in 2 hours US STOCKS-Wall St at session highs on deal to end U.S. shutdown Reuters Staff \n* Biotechs Bioverativ, Juno jump after big deals \n* Validus gains after AIG agrees to buy reinsurer \n* Senate to vote at noon on extending government funding \n* Indexes up: Dow 0.26 pct, S&P 0.44 pct, Nasdaq 0.68 pct (Updates to early afternoon) \nBy Sruthi Shankar \nJan 22 (Reuters) - Wall Street’s main indexes were at session highs in afternoon trading on Monday after U.S. senators reached a deal to end the federal government shutdown. \n“We will vote today to reopen the government,” Minority Leader Chuck Schumer told the Senate, potentially ending the three-day shutdown prompted by an impasse over immigration and border security. \nSchumer said he had come to an arrangement with Senate Republican Leader Mitch McConnell on the funding bill to keep the government open until Feb. 8. \n“If we get a vote and the shutdown ends, which is what it looks like, the market starts reacting ahead of that,” said Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin, Texas. \n“We could probably see this in two-three weeks and it could be even more challenging at that time. It’s not just DACA expiration but also the debt ceiling issue.” \nAt 12:26 p.m. ET (1726 GMT), the Dow Jones Industrial Average was up 67.45 points, or 0.26 percent, at 26,139.17 and the S&P 500 was up 12.39 points, or 0.44 percent, at 2,822.69. \nThe Nasdaq Composite was up 49.96 points, or 0.68 percent, at 7,386.34. \nThe biotech index rose 2.8 percent, as deal activity exploded with French drugmaker Sanofi and U.S.-based Celgene splurging a combined total of more than $20 billion. \nShares in U.S. hemophilia specialist Bioverativ soared 63 percent after Sanofi agreed to buy the company for $11.6 billion. \nJuno Therapeutics rose about 27 percent after Celgene agreed to buy the biotech for about $9 billion in cash. \nIn another big deal, AIG said it would buy reinsurer Validus Holdings for $5.56 billion, sending the target’s shares surging 45 percent. \nIndustrial stocks were a drag on the indexes, following a near 1 percent drop in General Electric after BofA-Merrill Lynch downgraded its stock. GE fell below $16 for the first time since 2011, extending a losing streak from last week. \nNine of the 11 major S&P sectors were higher, led by a 1.4 percent gain in the energy index. \nHalliburton Co rose 4.9 percent after posting a much bigger-than-expected quarterly profit in the fourth quarter, benefiting from a shale-driven surge in U.S. oil production. \nShares of Netflix Inc, a major contributor to the recent stock rally, were up 2.5 percent ahead of its quarterly results after market closes. \nAdvancing issues outnumbered decliners on the NYSE by 1,662 to 1,177. On the Nasdaq, 1,524 issues rose and 1,351 fell. (Reporting by Sruthi Shankar in Bengaluru; Editing by Sriraj Kalluvila)", "external_links": [], "published": "2018-01-22T21:35:00.000+02:00", "crawled": "2018-01-22T21:54:29.041+02:00", "highlightTitle": ""}