{"organizations": [], "uuid": "0bd1bf4ab1b4a7c91dc0a85f5c9dd51ef6b7a0b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225979713&w=1200&r=LYNXMPEE0R06O", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/russia-election-navalny/russian-opposition-takes-to-streets-calls-for-election-boycott-idINKBN1FH07X", "country": "US", "domain_rank": 408, "title": "Russian opposition takes to streets, calls for election boycott", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T11:00:00.000+02:00", "replies_count": 0, "uuid": "0bd1bf4ab1b4a7c91dc0a85f5c9dd51ef6b7a0b0"}, "author": "", "url": "https://in.reuters.com/article/russia-election-navalny/russian-opposition-takes-to-streets-calls-for-election-boycott-idINKBN1FH07X", "ord_in_thread": 0, "title": "Russian opposition takes to streets, calls for election boycott", "locations": [], "entities": {"persons": [{"name": "denis pinchuk", "sentiment": "none"}, {"name": "alexei navalny", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "navalny", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "magadan", "sentiment": "none"}], "locations": [{"name": "yakutsk", "sentiment": "none"}, {"name": "omsk", "sentiment": "none"}, {"name": "novosibirsk", "sentiment": "none"}, {"name": "vladivostok", "sentiment": "none"}, {"name": "russian far east", "sentiment": "none"}, {"name": "kemerovo", "sentiment": "none"}, {"name": "kurgan", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russian police wrestled opposition leader Alexei Navalny into a patrol wagon on Sunday, moments after he appeared at a rally to urge voters to boycott what he said would be a rigged presidential election in March.\nNavalny has little chance of influencing the election, likely to be won comfortably by President Vladimir Putin, but his ability to use social media to mobilise crowds of mostly young protesters in major cities has irked the Kremlin.\nThe numbers who showed up at protests across Russia on Sunday - some shouting “Putin is a thief” - were lower than previous demonstrations Navalny had staged, according to estimates from Reuters reporters, indicating the momentum may have shifted away from him.\nVideo footage posted on social media showed Navalny appear on Moscow’s main thoroughfare, Tverskaya Street, a few hundred metres (yards) from the Kremlin, to join several hundred supporters taking part in the protest, which the authorities had said was illegal.\nHe had only walked a short distance when he was surrounded by helmet-clad police officers. They grabbed him and forced him to the ground on the pavement, and then dragged him feet first into the patrol wagon, the video footage showed.\nNavalny’s personal Twitter feed carried a post to his followers saying he had been detained. “That does not matter. Come to Tverskaya. You’re not coming out for me, but for your future,” the post said.\nHe was taken to a police precinct in central Moscow, Navalny’s Internet site reported. Police said in a statement he would be charged with violating laws on holding demonstrations. The maximum penalty Navalny faces for the offence is 30 days in jail.\nPROTEST NUMBERS Navalny emerged as a threat to the Kremlin’s tight grip on power on June 12 last year, when thousands of his followers defied police prohibitions to protest in cities across Russia. The scale of the protests, some of the biggest in six years, took the Kremlin by surprise.\nOn Sunday, several hundred people gathered in Moscow’s central Pushkin square, ignoring police appeals over a loud-hailer for them to disperse.\nHundreds of people also protested in St. Petersburg, Russia’s second-biggest city, in Yekaterinburg in the Ural mountains, and other major centres.\nBy 15:00 Moscow time (12:00 GMT), police had detained 180 protesters nationwide, according to OVD-Info, a non-governmental group that tracks the arrests.\nBut Navalny, who says he has faced a campaign of harassment from the authorities, has struggled to mobilise the same numbers in the two nationwide protests he has called since the breakthrough protest in June.\nRiot policemen stand guard during a rally, held by supporters of Russian opposition leader Alexei Navalny for a boycott of a March 18 presidential election, in St. Petersburg, Russia January 28, 2018. REUTERS/Anton Vaganov In Moscow on Sunday, the protesters who had accompanied Navalny until his detention were at times hard to distinguish from the flow of shoppers and sight-seers on Tverskaya Street.\nA Reuters reporter heard two American tourists asking if Putin “is coming to this parade?” A few metres (yards) from where Navalny was detained, a tour guide was telling a group of clients about the history of a pre-revolutionary mansion.\nDOMINANT LEADER Putin, 65, has been in power, either as president or prime minister, since 2000, longer than veteran Soviet leader Leonid Brezhnev and outstripped only by dictator Josef Stalin.\nSlideshow (7 Images) Many voters credit him with restoring stability after the turbulence following the collapse of the Soviet Union, and of restoring Russia’s influence abroad through his foreign policy.\nThe Kremlin says the presidential election will be fair. Officials say Navalny and his supporters have minimal support and are irresponsibly trying to foment social anger which could lead to turmoil.\nPutin’s opponents though say he is maintaining his grip on power by eroding democracy.\nIn the Urals city of Yekaterinburg, just under 900 miles (1,450 km) east of Moscow, around 1,000 protesters gathered in temperatures of nearly -10 Celsius (50 Fahrenheit) to back Navalny’s boycott call.\n“No election? No to elections,” a placard being held by one young man read. Other protesters waved Russian flags or red and white placards calling for a boycott.\n“We don’t yet have the right to vote,” Masha, 16, who declined to give her surname, told Reuters. “But we need to think about the future and we want to live in a country where there will be honest elections.”\nEarlier on Sunday, police forced their way into Navalny’s Moscow office using power tools, citing reports of a bomb threat, an online feed run by Navalny’s supporters showed.\nPolice shut down a TV studio at Navalny’s office during the same raid which had been broadcasting online news bulletins, but another studio in a different location continued to operate.\nThe fact Navalny appeared at Sunday’s rally was a coup of sorts. The previous time he had tried to attend one of his demonstrations, in June last year, police detained him at his apartment building on the morning of the protest.\nAdditional reporting by Katya Golubkova, Gabrielle Tetrault-Farber and Polina Ivanova in Moscow, Natalia Shurmina and Anastasia Teterevleva in Yekaterinburg, and Mikhail Antonov in St Petersburg; Writing by Andrew Osborn and Christian Lowe; Editing by Jane Merriman\n ", "external_links": [], "published": "2018-01-28T11:00:00.000+02:00", "crawled": "2018-01-28T11:22:40.013+02:00", "highlightTitle": ""}