{"organizations": [], "uuid": "9cdd856251b67ffa55d5479af3124c65cba2205b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-vbl-therapeutics-announces-the-appointments-of-susan-kelley-and-david-hastings-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "VBL Therapeutics Announces the Appointments of Susan Kelley and David Hastings to Its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-03T15:05:00.000+02:00", "replies_count": 0, "uuid": "9cdd856251b67ffa55d5479af3124c65cba2205b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-vbl-therapeutics-announces-the-appointments-of-susan-kelley-and-david-hastings-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "VBL Therapeutics Announces the Appointments of Susan Kelley and David Hastings to Its Board of Directors", "locations": [], "entities": {"persons": [{"name": "susan kelley", "sentiment": "negative"}, {"name": "david hastings", "sentiment": "negative"}, {"name": "susan l. kelley", "sentiment": "none"}, {"name": "kelley", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "dana-farber cancer institute", "sentiment": "none"}, {"name": "bayer healthcare pharmaceuticals", "sentiment": "none"}, {"name": "bristol-myers squibb", "sentiment": "none"}, {"name": "yale university school of medicine", "sentiment": "none"}, {"name": "duke university school of medicine", "sentiment": "none"}, {"name": "bayer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senior pharmaceutical executives with extensive experience in immuno-oncology, drug development, commercializing oncology medications and finance\nTEL AVIV, Israel, Jan. 03, 2018 (GLOBE NEWSWIRE) -- VBL Therapeutics (NASDAQ:VBLT), today announced the appointments of both David Hastings and Susan Kelley, M.D. to its Board of Directors.\nSusan L. Kelley, M.D. is an oncologist with extensive experience in drug development and commercialization. Susan Kelley received her M.D. from Duke University School of Medicine and completed oncology training at the Dana-Farber Cancer Institute in Boston. She was also a Fellow in Medical Oncology and Pharmacology at Yale University School of Medicine Dr. Kelley joined the pharmaceutical industry and worked with Bristol-Myers Squibb in Oncology and Immunology drug development from 1987 to 2001. From 2001 to 2008, Dr. Kelley worked with Bayer Healthcare Pharmaceuticals as Vice President, Global Clinical Development and Therapeutic Area Head – Oncology. She led the Bayer team responsible for the development and worldwide regulatory approval of Nexavar (sorafenib) in kidney cancer and liver cancer, and was also responsible for clinical development of the early pipeline drug candidates. From 2008 to 2011, she was Chief Medical Officer of the Multiple Myeloma Research Consortium, where her leadership responsibilities included the strategic design and management of clinical trials conducted by leading myeloma clinical research centers in North America. Dr. Kelley served as a member of the Board of Directors of Alchemia from 2013-2015, and Cerulean Pharma from 2014-2017. She is currently a Director at ArQule, Immune Design, and Daré Bioscience, all publicly-traded, US-based biotechnology companies.\nDavid Hastings has more than 18 years of finance, accounting and operations experience in the bio-pharmaceutical industry. He was the Executive Vice President and Chief Financial Officer at Incyte from October 2003 until 2014. Recently he was the Chief Financial Officer of Unilife Corporation. From February 2000 to September 2003 Mr. Hastings served as Vice President, Chief Financial Officer and Treasurer of ArQule Inc. Prior to his employment with ArQule, Mr. Hastings was Vice President and Corporate Controller at Genzyme Inc., and Director of Finance at Sepracor. David Hastings received his B.A. in Economics at the University of Vermont. He is a member of the Board Director of SCYNEXIS, Inc. and chairs its Audit Committee.\n“We expect Susan and David to be important additions to the VBL Therapeutics Board of Directors,” said Ben Shapiro, M.D., Chairman of VBL Therapeutics, “David brings a wealth of financial and business experience to our existing board and Susan’s experience with the FDA approval process will be invaluable to us as we prepare to bring VB-111 to the market in the coming months. We look forward to the guidance both David and Susan will provide us as we anticipate top line results from our Phase 3 GLOBE pivotal trial in recurrent glioblastoma in the first quarter.”\n“VBL’s pipeline of novel oncology biologics is positioned to make a large impact on the lives of patients and on their families. This is most clear in the case of glioblastoma, where VB-111 has potential to be a first-in-class treatment for what has been, to date, an essentially incurable form of cancer. I look forward to working with VBL to bring life-changing new treatments to patients as soon as possible,” stated Dr. Kelley.\nMr. Hastings commented, “VBL Therapeutics is building upon a successful 2017 by looking to start the new year very strong with several important upcoming milestones on the horizon. By joining the VBL team at such an exciting juncture I have the opportunity to assist with guiding the company’s bright future.”\nAbout VBL\nVascular Biogenics Ltd., operating as VBL Therapeutics, is a clinical stage biopharmaceutical company focused on the discovery, development and commercialization of first-in-class treatments for cancer. The Company’s lead oncology product candidate, VB-111, is a first-in-class, targeted anti-cancer gene-therapy biologic with broad potential to treat a wide range of solid tumors. In October 2017, VBL opened its new gene therapy manufacturing plant in Modiin, Israel. This plant will be the commercial facility for production of the Company’s lead product candidate. The Modiin facility is the first commercial-scale gene therapy manufacturing facility in Israel and currently one of the largest gene-therapy designated ones in the world (20,000 sq. ft.).\nForward Looking Statements\nThis press release contains forward-looking statements. All statements other than statements of historical fact are forward-looking statements, which are often indicated by terms such as “anticipate,” “believe,” “could,” “estimate,” “expect,” “goal,” “intend,” “look forward to”, “may,” “plan,” “potential,” “predict,” “project,” “should,” “will,” “would” and similar expressions. These forward-looking statements include, but are not limited to, statements regarding VB-111, including its clinical development, therapeutic potential and clinical results, including the expected timing of clinical results and the initiation of clinical trials. These forward-looking statements are not promises or guarantees and involve substantial risks and uncertainties. Among the factors that could cause actual results to differ materially from those described or projected herein include uncertainties associated generally with research and development, clinical trials and related regulatory reviews and approvals, and the risk that historical clinical trial results may not be predictive of future trial results. In particular, results from our pivotal Phase 3 clinical trial of VB-111 in rGBM may not support approval of VB-111 for marketing in the United States, notwithstanding the positive results seen in prior clinical experience. A further list and description of these risks, uncertainties and other risks can be found in the Company’s regulatory filings with the U.S. Commission, including in our annual report on Form 20-F for the year ended December 31, 2016. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. VBL Therapeutics undertakes no obligation to update or revise the information contained in this press release, whether as a result of new information, future events or circumstances or otherwise.\nINVESTOR CONTACT:\nMichael Rice\nLifeSci Advisors\nmrice@lifesciadvisors.com\n(646) 597-6979\nMEDIA CONTACT:\nMatt Middleman, M.D.\nLifeSci Public Relations\nmatt@lifescipublicrelations.com\n(646) 627-8384\nSource: VBL Therapeutics", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9bc3b19f-b748-4a4f-b77f-a9625602f9e4", "https://www.globenewswire.com/Tracker?data=g5X99kDP0Hu6l4WoW2csUHk2Sjvh3OUO_twFzwbD59Y8MM3gxhf0kLRRwKE2jUzlTvfI1-vA32LLtD2POz-uP67pL34G_nKJ0MzZyyw87Ug=", "https://www.globenewswire.com/Tracker?data=deTvrzITHzSNHMU4LczQNyibZoH6-IcOuDfEAIRQJZzX6bf084icT7q3KOtiJUHm0fNf-ygbadtT_ynEW_mKGtbT0cyNYzgeQXea6S_BSkCGaCY7FcgYwI_ws7122DF5"], "published": "2018-01-03T15:05:00.000+02:00", "crawled": "2018-01-03T17:09:20.040+02:00", "highlightTitle": ""}