{"organizations": [], "uuid": "0378793a265ef5f59176c9113a58f6300e3dc059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/20/102522564-103925085.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/unused-vacation-costs-workers-66-billion-in-lost-benefits.html", "country": "US", "domain_rank": 767, "title": "Unused vacation costs workers $66 billion in lost benefits", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-30T15:31:00.000+02:00", "replies_count": 0, "uuid": "0378793a265ef5f59176c9113a58f6300e3dc059"}, "author": "Jessica Dickler", "url": "https://www.cnbc.com/2018/01/30/unused-vacation-costs-workers-66-billion-in-lost-benefits.html", "ord_in_thread": 0, "title": "Unused vacation costs workers $66 billion in lost benefits", "locations": [], "entities": {"persons": [{"name": "david ramos", "sentiment": "none"}, {"name": "samantha brown", "sentiment": "none"}], "locations": [], "organizations": [{"name": "u.s. travel association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's only January, and workers are already on track to miss out on much of their vacation time this year.\nWhile most employees at least want to take full advantage of those hard-earned days off, less than half take the time to plan out their vacations each year, according to Project: Time Off , which is sponsored by the U.S. Travel Association. As a result, they end up burning valuable time.\nBy forfeiting more than 200 million vacation days that cannot be rolled over, American workers are giving up about $66.4 billion in lost benefits each year. For the average worker, that comes out to $604, the project said.\nshow chapters Does vacation make you more productive? 12:20 PM ET Thu, 24 Aug 2017 | 02:49 Even now, people are still scrambling to put together a winter trip, said Samantha Brown, Project: Time Off's travel expert and host of the PBS \"Places to Love\" series.\n\"By the time we realize we want to go on vacation, it's either too late or really expensive,\" she said.\nUncertainty about work or personal schedules, in addition to difficulty coordinating child care, were most often to blame, according to the group's latest data.\nBrown offers these tips to make the most of your 2018 vacation days:\nB lock your calendar, even if you are not sure of your plans just yet. Keeping the calendar clear creates the opportunity to take vacation.\nTalk to your manager about your plans as far in advance as possible. The longer the lead time, the better chance of having your time off approved and coordinating coverage in your absence.\nPlan for your bucket list — not just your to-do list. A long weekend has its place, but careful planning allows for longer breaks, making the most of your time away from work.\nAmerican workers use only 54 percent of their eligible vacation time on average, according to a separate report by jobs and recruitment website Glassdoor.\nLast year, only 23 percent of employees who get paid time off took all of the time they were entitled to — and nearly 10 percent took no paid time off at all, Glassdoor said. The job site polled more than 2,000 adults in March and April.\nMore from Personal Finance:\nFew adults report receiving bonuses or raises from the Republican tax law\nThe new tax law is a mixed bag for your company benefits\nHalf of all workers are considering a job change", "external_links": [], "published": "2018-01-30T15:31:00.000+02:00", "crawled": "2018-01-30T15:31:41.043+02:00", "highlightTitle": ""}