{"organizations": [], "uuid": "ace3f3ceb89126130bbcafe2a5e909801061bcf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227014301&w=1200&r=LYNXMPEE0U1D3", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-bitcoin-tezos/tezos-foundation-appoints-new-board-member-idUSKBN1FK2K1", "country": "US", "domain_rank": 408, "title": "Tezos Foundation appoints new board member", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:25:00.000+02:00", "replies_count": 0, "uuid": "ace3f3ceb89126130bbcafe2a5e909801061bcf7"}, "author": "", "url": "https://www.reuters.com/article/us-bitcoin-tezos/tezos-foundation-appoints-new-board-member-idUSKBN1FK2K1", "ord_in_thread": 0, "title": "Tezos Foundation appoints new board member", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:29 PM / in a minute Tezos Foundation appoints new board member Anna Irrera 3 Min Read \n(Reuters) - A Swiss foundation that controls the money raised for cryptocurrency project Tezos has appointed accounting executive Lars Haussmann to its board, it said in a statement on Wednesday. \nHaussmann, a Swiss national, replaces Guido Schmitz-Krummacher, who stepped down from the board of the Zug-based Tezos Foundation in December amid infighting between the project’s lead promoters. \nHaussmann, who is head of corporate management and company administration at Swiss accounting firm Haussmann Treuhand AG, was “unanimously” appointed by the other two board members, according to the statement. Haussmann is also a non-executive director of several Swiss companies, according to the statement. \nTezos raised $232 million in a “initial coin offering” in July, but the project was quickly derailed by disputes between co-founders Arthur and Kathleen Breitman, who control the code, and Johann Gevers, the president of Tezos Foundation, which controls the funds. \nIt is unclear whether Haussmann’s appointment was endorsed by the Breitmans. A spokesman for the Breitmans did not immediately respond to requests for comment. \nThe board will now focus on “setting up operational systems and organizational arrangements for the Foundation”, it said in the statement posted on its new website. \n“These steps will allow the Board to further the Foundation’s central mission, the development and promotion of the overall Tezos ecosystem,” the statement said. \nThe announcement comes days after Gevers said in a blog post that the foundation had regained access to limited banking services, allowing it to start paying creditors and make progress in recruiting. In the blog post Gevers pledged to “step back” from his role once the project is back on track. \nThe Tezos fundraiser known as an \"initial coin offering\" was structured as a donation, though some contributors believed it was an investment. ( www.reut.rs/2DNtXPQ ) \nContributors to ICOs receive new digital tokens in return for their contributions. Tezos contributors have yet to receive so-called “Tezzies”. \nProgress in developing the technology that would lead to the distribution of Tezzies, has been delayed because of a battle over control of between the Breitmans and Gevers. \nIn October, an attorney for the Breitmans sent a 46-page letter to Schmitz-Krummacher and another board member, demanding Gevers’ removal. Earlier this month Schmitz-Krummacher told Reuters that the letter created a “catastrophe” for the Tezos project. \nReuters detailed the battle between the Breitmans and Gevers last October. Since then, several class action lawsuits have been filed in the United States against the project’s organizers, alleging the Tezos fundraiser violated federal securities law and defrauded participants. Reporting by Anna Irrera; Editing by Alistair Bell", "external_links": [], "published": "2018-01-31T19:25:00.000+02:00", "crawled": "2018-01-31T20:31:02.359+02:00", "highlightTitle": ""}