{"organizations": [], "uuid": "348f64b9969600bb1d6c7a7eb6aa272de5cb7f7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221148627&w=1200&r=LYNXMPEE0A141", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/europe-migrants-italy-crossing/wider-image-migrants-risk-death-crossing-alps-to-reach-france-idINKBN1F01TN", "country": "US", "domain_rank": 408, "title": "Wider Image: Migrants risk death crossing Alps to reach France", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:11:00.000+02:00", "replies_count": 0, "uuid": "348f64b9969600bb1d6c7a7eb6aa272de5cb7f7a"}, "author": "", "url": "https://in.reuters.com/article/europe-migrants-italy-crossing/wider-image-migrants-risk-death-crossing-alps-to-reach-france-idINKBN1F01TN", "ord_in_thread": 0, "title": "Wider Image: Migrants risk death crossing Alps to reach France", "locations": [], "entities": {"persons": [{"name": "abdullhai", "sentiment": "none"}], "locations": [{"name": "alps", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "guinea", "sentiment": "none"}, {"name": "nevache", "sentiment": "none"}, {"name": "bardonecchia", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "france siegfried modola", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BARDONECCHIA, Italy (Reuters) - It took Abdullhai almost three years to get from his home in Guinea to a rocky, snow-covered Alpine mountain pass in the dead of winter, for what he hopes will be the final stage of his journey into France.\nMigrants walk through snow after crossing part of the Alps mountain range from Italy into France, near the town of Nevache in southeastern France, December 21, 2017. REUTERS/Siegfried Modola The terrain is steep and dangerous and he and a group of five other migrants face risks ranging from losing their footing on steep drops, being struck by falling rocks or succumbing to the -9C (15°F) temperatures in clothing ill-suited to the terrain.\nAbdullhai, 38, is one of hundreds of migrants who over the last year have attempted to cross from Italy into France through high mountain passes, in a bid to evade increased border security put in place at easier crossing points. His group crossed into France in December.\nIn Guinea, he left behind his wife and three children, including a two-year old son whom he has never seen.\n“Our life in Guinea is not good,” said Abdullhai, 38, who like his friends asked that his last name not be published in this story.\n“There is no work there and no future for my children. Here in Europe we can have a future. We can find work and live a life with some dignity. This is worth a try for me.”\nThe number of migrants making perilous journeys has fallen since over one million arrived in Europe from the Middle East and Africa in 2015. There were 171,635 arrivals by boat officially recorded in 2017, down from 363,504 in 2016.\nMigrants take rests in the snow after failing to cross from Italy to France due to heavy snow fall, in Bardonecchia, Italy, January 10, 2018. Picture taken January 10, 2018. REUTERS/Roberto Mingucci As the group huddled around a fire in a cave during a rest on their journey, others told stories of being jailed and tortured, or of being orphaned and looking at uncertain futures in their home country.\nThe crossings have become more perilous with heavy snowfall.\nOn Jan. 10, Reuters spoke with three migrants, a 24-year-old Senegalese man, a 31-year-old man from the Democratic Republic of Congo and a 37-year-old from Pakistan who were attempting to cross into France.\nSlideshow (6 Images) They managed to cross the border, but abandoned their trek, exhausted and despondent, and were returned to Italy.\nBut they are at least alive. The International Organisation for Migration estimates that 20,000 people have died in the Mediterranean itself while trying to reach Italy.\nNor does it compare to the hardships that some of those making the journey have already endured to get as far as they have.\n“I was imprisoned and tortured in Libya for many months. I was forced to work for free. Just look at my scars,” said Kamarra, 28, from Guinea, lifting his shirt and pulling down his trousers at the side to show marks on his body and hip.\n“After all that, crossing the Alps is not a big deal for me.”\nAdditional reporting by Eleanor Biles; Writing by Mark Hanrahan in London; Editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-11T16:11:00.000+02:00", "crawled": "2018-01-11T16:42:47.015+02:00", "highlightTitle": ""}