{"organizations": [], "uuid": "b3a8dadd8c05ad09043ccc2b01fab340537eb010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/pliladelhiaenergysolutions-bankruptcy/philadelphia-energy-solutions-to-file-for-bankruptcy-memo-idINKBN1FB098", "country": "US", "domain_rank": 408, "title": "Philadelphia Energy Solutions to file for bankruptcy - memo", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T05:06:00.000+02:00", "replies_count": 0, "uuid": "b3a8dadd8c05ad09043ccc2b01fab340537eb010"}, "author": "", "url": "https://in.reuters.com/article/pliladelhiaenergysolutions-bankruptcy/philadelphia-energy-solutions-to-file-for-bankruptcy-memo-idINKBN1FB098", "ord_in_thread": 0, "title": "Philadelphia Energy Solutions to file for bankruptcy - memo", "locations": [], "entities": {"persons": [{"name": "jessica dinapoli", "sentiment": "none"}], "locations": [{"name": "u.s. east coast", "sentiment": "none"}], "organizations": [{"name": "philadelphia energy solutions", "sentiment": "negative"}, {"name": "philadelphia energy solutions llc", "sentiment": "none"}, {"name": "girard point", "sentiment": "none"}, {"name": "jarrett renshaw", "sentiment": "none"}, {"name": "carlyle group lp", "sentiment": "none"}, {"name": "sunoco inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "energy transfer partners lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:07 AM / Updated 3 hours ago Philadelphia Energy Solutions to file for bankruptcy - memo Jessica DiNapoli , Jarrett Renshaw 5 Min Read \n(Reuters) - Philadelphia Energy Solutions LLC, the owner of the largest U.S. East Coast oil refining complex, announced to its employees on Sunday that it plans to file for Chapter 11 bankruptcy, according to an internal memo reviewed by Reuters. \nThe bankruptcy would come six years after private equity firm Carlyle Group LP ( CG.O ) and Energy Transfer Partners LP’s Sunoco Inc rescued Philadelphia Energy Solutions from financial distress, in a deal that was supported by tax breaks and grants that saved thousands of jobs. \nFollowing an agreement with its creditors, the company has secured access to $260 million in new financing, and said it expected the bankruptcy filing to have no immediate impact on its employees, according to the memo, which was confirmed by a spokeswoman for Philadelphia Energy Solutions. The spokeswoman declined to comment further. \nPhiladelphia Energy Solutions owns two refineries, Girard Point and Point Breeze. It can convert about 335,000 barrels of crude oil per day to products such as gasoline, jet fuel and diesel. It employs about 1,100 people. \nPart of the refiner’s financial troubles stem from a costly biofuels law called the Renewable Fuels Standard, which is administered by the Environmental Protection Agency and requires refiners to blend biofuels into the nation’s fuel supply every year, or buy credits from those who do. \nSince 2012, Philadelphia Energy Solutions has spent more than $800 million on credits to comply with the law, making it the refiner’s biggest expense after the purchase of crude, according to the memo. \nThe Philadelphia refinery’s struggles have emerged as a potential flashpoint in the debate between Big Oil and Big Corn over the future of the Renewable Fuels Standard. \nCritics have argued the company’s woes are an example of what is wrong with the program, while supporters say the company’s troubles are more closely related to its lack of access to cheaper crude oil supplies. \nThe $260 million in financing secured by the company involves $120 million in debtor-in-possession and exit financing, $75 million in additional capital from Sunoco Logistics, and a $65 million equity investment from the company’s shareholders, led by Carlyle along with the refiner’s management. \nEast Coast refiners have lower profit margins than other refineries across the country, largely because of a reliance on crude imports from West Africa and other markets. \nPhiladelphia Energy Solutions had strong profits in 2014 and 2015 because of investments in rail terminals that allowed the refiner to bring in discounted Bakken crude oil in mile-long trains from North Dakota. \nBut the boom turned to bust by the end of 2015 as oil prices plummeted and the discount for North Dakota crude disappeared. The fallout hit oil and gas explorers and producers hard, with scores of them, such as Linn Energy Inc and Breitburn Energy Partners LP, filing for bankruptcy in 2016. LOAN COMES DUE EARLY THIS YEAR \nBefore Carlyle took over the complex, Philadelphia Energy Solutions was a “zombie” refiner at risk of being shuttered following the financial crisis, when demand for oil evaporated. In bringing in Carlyle as a majority investor in 2012, Sunoco agreed to contribute to the refinery’s assets and be a non-controlling partner. \nThe refinery owners enjoyed a taxpayer-funded rescue package, which included the creation of a tax-friendly zone, $25 million in grants and environmental liability waivers. \nThe company took on a $550 million loan that comes due early in 2018 to finish capital projects and pay out dividends to Carlyle and Sunoco. \nCarlyle, which invested $175 million in 2012 in exchange for two-thirds of Philadelphia Energy Solutions, withdrew its plans to take the company public in 2016 at an expected valuation of $1.3 billion. In the same years, Carlyle also tried unsuccessfully to sell Philadelphia Energy Solutions. \nPhiladelphia Energy Solutions has also been grappling with its labor union, which threatened to strike last summer unless cuts to benefits were restored. \nReuters first reported in August that Philadelphia Energy Solutions had tapped investment bank PJT Partners Inc ( PJT.N ) for advice on dealing with its debt burden. \nPhiladelphia Energy Solutions will seek to restructure more than $100 million of its existing debt, and expects to complete the recapitalization process in the first quarter of 2018, according to the memo. Reporting by Jessica DiNapoli and Jarrett Renshaw in New York; Editing by Paul Simao and Peter Cooney", "external_links": [], "published": "2018-01-22T05:06:00.000+02:00", "crawled": "2018-01-22T05:25:05.015+02:00", "highlightTitle": ""}