{"organizations": [], "uuid": "4612afc2e7d60750432b25ebc0cfb23fa17a957c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-ustudio-adds-three-top-technology-executives-to-leadership-team.html", "country": "US", "domain_rank": 767, "title": "uStudio Adds Three Top Technology Executives to Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-12T17:00:00.000+02:00", "replies_count": 0, "uuid": "4612afc2e7d60750432b25ebc0cfb23fa17a957c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-ustudio-adds-three-top-technology-executives-to-leadership-team.html", "ord_in_thread": 0, "title": "uStudio Adds Three Top Technology Executives to Leadership Team", "locations": [], "entities": {"persons": [{"name": "jen grogono", "sentiment": "none"}, {"name": "bryan jones", "sentiment": "none"}, {"name": "michael nels", "sentiment": "none"}, {"name": "matt dussling", "sentiment": "none"}], "locations": [{"name": "leadership team austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas--(BUSINESS WIRE)-- uStudio, Inc., the industry's leading enterprise media platform , today announced the appointment of three top technology executives to its leadership team. Bryan Jones joins the company as chief operating officer, Matt Dussling as vice president of sales, and Michael Nels as vice president of engineering.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180112005111/en/\nFrom left to right: COO Bryan Jones, VP of Sales Matt Dussling, and VP of Engineering Michael Nels. (Photo: Business Wire)\n“Pervasive use of media in the enterprise is inevitable; it’s becoming an essential ingredient to business agility and managing customer experiences,” said uStudio CEO Jen Grogono. “We couldn’t be happier to have these talented executives join our team to address this growing opportunity. Their leadership will play an important role in helping customers displace first-generation video publishing players with modern hub-and-spoke media workflows that integrate audio, video, AR and VR into strategic business conversations.”\nSerial entrepreneur and digital media pioneer Bryan Jones has been appointed to the COO position. In this role, Bryan will work with product and sales to further expand uStudio’s application suite and its adoption by Fortune 500 enterprises. Bryan is a widely-regarded technology executive having founded or co-founded companies including Collider Media (now part of Videology) and b.well Connected Health. He also served as the SVP of Product & Solutions at Videology Group, the leading software provider for converged TV and video advertising.\nMatt Dussling joins uStudio as the vice president of sales, where he will accelerate the adoption of the uStudio platform across industries, as well as expand relationships with the company’s industry-leading enterprise accounts. An accomplished sales executive, Matt brings more than twenty years of enterprise software sales experience at technology companies including Spredfast, Lombardi Software (acquired by IBM) and Trilogy. Most recently, Matt served as a Vice President of Sales for Andreessen Horowitz-backed Capriza.\nMichael Nels joins uStudio as the vice president of engineering. He brings more than 19 years of software industry experience in R&D, Product, Engineering and Operations roles. Michael will work closely with CTO Josh Marshall to oversee the ongoing development of the company’s patented media platform and its suite of business applications. Most recently, Michael served as VP Engineering at on-demand delivery service Favor. Prior to Favor, Michael led the creation of IT management products and internal systems as VP Software Development at SolarWinds, a global leader in IT service management software.\nAbout uStudio\nuStudio, Inc. is a recognized innovator of enterprise communications. Its patented, cloud-based media platform helps the world’s leading companies reinvent the way they use media across their businesses, internally and externally. From live streaming to VOD, podcasting, media management, and core process and system integration, uStudio helps market leaders such as Universal Music, Kohl’s, Symantec, and Alcon Novartis transform their customer and employee experiences with media.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005111/en/\nuStudio, Inc.\nLisa Stuardi, 512-474-2151\nlstuardi@ustudio.com\nSource: uStudio, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fustudio.com%2Fvideo-platform%2F&esheet=51742290&newsitemid=20180112005111&lan=en-US&anchor=enterprise+media+platform&index=1&md5=f3b35abae3dc8d8c077f4c6d244af807", "http://www.businesswire.com/news/home/20180112005111/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.prweb.com%2Freleases%2F2017%2F12%2Fprweb14992071.htm&esheet=51742290&newsitemid=20180112005111&lan=en-US&anchor=recognized+innovator&index=2&md5=35f68c1880a06efa1dda4282bb6ade5e"], "published": "2018-01-12T17:00:00.000+02:00", "crawled": "2018-01-12T17:57:27.002+02:00", "highlightTitle": ""}