{"organizations": [], "uuid": "fd9ff9399a4ed4d586dc570816bf0e4559e13ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224744774&w=1200&r=LYNXMPEE0N0MK", "site_section": "https://www.reuters.com/finance/EarningsUS", "section_title": "Earnings News &amp; Latest Company Earnings Results | Reuters.com", "url": "https://www.reuters.com/article/us-novartis-results/novartis-poised-for-growth-as-ceo-hands-baton-to-u-s-newcomer-idUSKBN1FD0VM", "country": "US", "domain_rank": 408, "title": "Novartis poised for growth as CEO hands baton to U.S. newcomer", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:54:00.000+02:00", "replies_count": 0, "uuid": "fd9ff9399a4ed4d586dc570816bf0e4559e13ffe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-novartis-results/novartis-poised-for-growth-as-ceo-hands-baton-to-u-s-newcomer-idUSKBN1FD0VM", "ord_in_thread": 0, "title": "Novartis poised for growth as CEO hands baton to U.S. newcomer", "locations": [], "entities": {"persons": [{"name": "gilenya", "sentiment": "none"}, {"name": "narasimhan", "sentiment": "none"}, {"name": "vas narasimhan", "sentiment": "none"}, {"name": "joe jimenez", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "basel", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "novartis", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BASEL (Reuters) - Novartis ( NOVN.S ) expects to return to operating profit growth this year, with new Chief Executive Vas Narasimhan inheriting the Swiss drugmaker as revenue from its latest medicines accelerates and the impact of expiring patents fades.\nThe company said on Wednesday core operating profit would rise by a mid-to-high single-digit percentage this year, outpacing sales growing in the low-to-mid single digits.\nThat compares with a 1 percent decline in core operating profit last year on a 1 percent rise in sales.\nNarasimhan, who takes over as CEO from Joe Jimenez on Feb. 1, forecast robust growth from psoriasis treatment Cosentyx and heart failure medicine Entresto will overcome plunging revenue from patent-expired Gleevec, once Novartis’s top seller.\n“We look at the next five years and are optimistic about solid sales growth,” the 41-year-old doctor from Pittsburgh said.\nGilenya, a multiple sclerosis drug that was top seller at $3.2 billion last year, goes off patent in August 2019, but Narasimhan said new medicines coming through gave Novartis “the opportunity to overcome some of the generic impact we’ll see in the years to come”.\nNovartis stock, which has gained about 17 percent in the last 12 months, was up 2.7 percent at 1200 GMT.\nNarasimhan will earn 8.9 million Swiss francs ($9.3 million) in 2018, 26 percent less than Jimenez’s 11.3 million franc 2017 pay as “this is his first group CEO role”, Novartis said.\nDespite forecasting “sustainable growth”, Novartis still has some unfinished business left by Jimenez. Narasimhan must decide whether to spin off eye care unit Alcon, though action is unlikely before 2019 as the once-lagging unit returns to growth. In 2017, Alcon sales rose 4 percent to $6 billion.\nNarasimhan must also tackle a stuttering generics unit. Sandoz’s sales - down 1 percent to $10.1 billion in 2017 - are expected to slip again this year amid U.S. pricing pressures.\nThis has forced Sandoz to consider options for its U.S. generic pill business, while still developing complex biological copies, or biosimilars, of other companies’ branded drugs. It has already shuttered some U.S. locations and may divest dermatology assets.\n“What we’re doing in the U.S. is re-assessing the best path going forward, which I think you expect of us given the significant price decreases that we have had,” Narasimhan said.\nNonetheless, fourth-quarter results provide a positive backdrop. Core operating profit rose 7 percent to $3.2 billion, compared with the $3.17 billion average in a Reuters poll.\nSales rose to $12.9 billion, versus the poll average of $12.6 billion.\nPIPELINE LAUNCHES Cosentyx revenue jumped 84 percent in 2017 to $2.1 billion, while Entresto, which since its 2015 launch has lagged expectations, finally hit the company’s target with $507 million in sales.\n“Cosentyx, Entresto and a new wave of pipeline launches look set to be augmented by a stronger-than-expected recovery of Alcon,” said Jefferies analyst Jeffrey Holford.\nNovartis is counting on approvals for new drugs against macular degeneration, a cause of blindness, and migraine, in partnership with U.S. drugmaker Amgen ( AMGN.O ), as well as a pair of new multiple sclerosis drugs.\nIt is also seeking new indications for Kymriah, its $475,000-per-patient T-cell therapy now approved for children with deadly leukemia.\nNovartis proposed a dividend of 2.80 francs per share, up from 2.75 francs previously.\nIts results throw down the gauntlet to cross-town rival Roche ( ROG.S ), grappling with patent losses for its biggest medicines amid uncertainty that its pipeline can make up the difference.\nShares in Roche, which reports 2017 results on Feb. 1, fell 0.7 percent.\nJimenez, a former Stanford swimmer who joined Novartis a decade ago from ketchup maker Heinz, is returning to the United States for an unspecified role outside of Novartis.\nAlthough Narasimhan said Novartis would intensify its focus on digitization after Jimenez leaves, he is sticking to his predecessor’s takeover strategy - targeting so-called “bolt-on” deals up to around $5 billion - such as its $3.9 billion deal for French radiopharmaceuticals specialist Advanced Accelerator Applications (AAA) last year.\n“We like acquisitions like the one we just did with AAA, where we bring in a new platform technology, it supports one of our core areas like oncology,” Narasimhan said.\n($1 = 0.9541 Swiss francs)\nRelated Coverage Novartis says Entresto could become $5 billion a year blockbuster drug Reporting by John Miller; Editing by Sherry Jacob-Phillips and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T16:54:00.000+02:00", "crawled": "2018-01-24T21:32:03.053+02:00", "highlightTitle": ""}