{"organizations": [], "uuid": "c68d1ab1c070b7206c9a1194c412e378bc25b08b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-intuitiveasurgicalaannouncesapreliminary-fourth-quarteraand-full-year-2017aresults.html", "country": "US", "domain_rank": 767, "title": "Intuitive Surgical Announces Preliminary Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:05:00.000+02:00", "replies_count": 0, "uuid": "c68d1ab1c070b7206c9a1194c412e378bc25b08b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-intuitiveasurgicalaannouncesapreliminary-fourth-quarteraand-full-year-2017aresults.html", "ord_in_thread": 0, "title": "Intuitive Surgical Announces Preliminary Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "vinci surgical systems", "sentiment": "none"}, {"name": "jp morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Intuitive Surgical, Inc. (NASDAQ:ISRG), a global technology leader in robotic-assisted, minimally invasive surgery, today announced certain unaudited preliminary fourth quarter and full year 2017 financial results ahead of its participation at the 36th Annual JP Morgan Healthcare Conference on January 10-11, 2018, in San Francisco, California.\nQ4 and 2017 Highlights\nFourth quarter 2017 worldwide da Vinci procedures increased approximately 17% compared with the fourth quarter of 2016. Full year 2017 worldwide da Vinci procedures increased approximately 16% compared with 2016.\nPreliminary fourth quarter 2017 revenue of $892 million grew approximately 18% compared with $757 million for the fourth quarter of 2016. Preliminary 2017 revenue of $3.1 billion grew approximately 16% compared with $2.7 billion for 2016.\nThe Company shipped 216 da Vinci Surgical Systems compared with 163 in the fourth quarter of 2016. The Company shipped 684 da Vinci Surgical Systems in 2017, compared with 537 systems in 2016.\nIn December 2017, the Company filed form 510(k)s with the U.S. Food and Drug Administration for the da Vinci Single Port Surgical System for use in certain urology procedures and a 60mm version of the da Vinci Xi stapler.\nPreliminary Results\nThe Company expects revenue for the fourth quarter of 2017 of approximately $892 million, an increase of approximately 18% compared with $757 million for the fourth quarter of 2016. The Company expects 2017 revenue of approximately $3.1 billion, an increase of approximately 16% compared with $2.7 billion for 2016. These unaudited results are preliminary and prior to the completion of the Company’s annual independent audit and therefore are subject to adjustment.\nPreliminary fourth quarter 2017 instrument and accessory revenue increased approximately 18% to approximately $457 million compared with $386 million for the fourth quarter of 2016. Full year 2017 instrument and accessory revenue increased approximately 17% to approximately $1.6 billion. Fourth quarter and full year 2017 instrument and accessory revenue growth was driven primarily by da Vinci procedure growth.\nda Vinci procedures increased approximately 17% for the fourth quarter of 2017 compared with the fourth quarter of 2016. Approximately 877,000 surgical procedures were performed with the da Vinci Surgical System in 2017, an increase of approximately 16% compared with approximately 753,000 procedures performed in 2016. The growth in overall 2017 procedure volume was primarily driven by the growth in U.S. general surgery procedures and worldwide urologic procedures. The Company expects total da Vinci procedures to grow approximately 11% to 15% in 2018.\nPreliminary fourth quarter 2017 da Vinci Surgical Systems revenue increased approximately 20% to approximately $283 million from $236 million for the fourth quarter of 2016. Systems revenue for 2017 increased approximately 15% to approximately $910 million compared with $792 million in 2016. The Company shipped 216 da Vinci Surgical Systems in the fourth quarter of 2017, compared with 163 systems in the fourth quarter of 2016. The fourth quarter 2017 da Vinci Surgical Systems shipments included 40 shipped under operating lease arrangements, compared with 13 in the fourth quarter of 2016. The Company shipped 684 da Vinci Surgical Systems in 2017, compared with 537 systems in 2016.\nPreliminary fourth quarter 2017 service revenue of approximately $153 million increased approximately 13% compared with $135 million in the fourth quarter of 2016. Preliminary 2017 service revenue increased approximately 13% to approximately $582 million compared with $517 million in 2016.\nCommenting on the announcement, Dr. Gary Guthart, President and CEO of Intuitive Surgical, said, “We are pleased with the progress our team made in supporting our customers in 2017. In 2018, we will continue to invest in the new technologies and services that are important to surgeons, patients and hospitals, and core to our mission.”\nAdditional unaudited preliminary revenue and procedure information has been posted to the Investor Relations section of the Intuitive Surgical website at: http://phx.corporate-ir.net/phoenix.zhtml?c=122359&p=irol-IRHome .\nThe Company is scheduled to present at the 2018 JP Morgan Healthcare Conference on January 11, 2018, at 9:00 a.m. Pacific Time. The Company is scheduled to report its fourth quarter 2017 results during a conference call on January 25, 2018, at which point the Company will discuss the 2017 financial results in more detail. Dial-in and webcast access information for both of these events are also available in the Investor Relations section of the Intuitive Surgical website.\nAbout Intuitive Surgical, Inc.\nIntuitive Surgical, Inc. (NASDAQ:ISRG), headquartered in Sunnyvale, California, is a global technology leader in robotic-assisted, minimally invasive surgery. Intuitive Surgical develops, manufactures, and markets robotic technologies designed to improve clinical outcomes and help patients return more quickly to active and productive lives. The Company’s mission is to extend the benefits of minimally invasive surgery to the broadest possible base of patients. Intuitive Surgical - Taking surgery beyond the limits of the human hand™.\nAbout the da Vinci Surgical System\nThe da Vinci Surgical System is a surgical platform designed to enable complex surgery using a minimally invasive approach. The da Vinci Surgical System consists of an ergonomic surgeon console or consoles, a patient-side cart with three or four interactive arms, a high-performance vision system and proprietary EndoWrist instruments. Powered by state-of-the-art technology, the da Vinci Surgical System is designed to scale, filter, and seamlessly translate the surgeon’s hand movements into more precise movements of the EndoWrist instruments. The net result is an intuitive interface with improved surgical capabilities. By providing surgeons with superior visualization, enhanced dexterity, greater precision, and ergonomic comfort, the da Vinci Surgical System makes it possible for skilled surgeons to perform more minimally invasive procedures involving complex dissection or reconstruction. Surgeons, hospitals, and patients benefit from a large community of users and the Company’s robotic-assisted surgical ecosystem, beginning with the robotic platforms, and also including the broad instrument product line, imaging solutions, training programs and technology, clinical validation, field clinical support, field technical support, and program optimization. For more information about clinical evidence related to da Vinci Surgery, please visit https://www.intuitivesurgical.com/company/clinical-evidence/ .\nda Vinci ® and EndoWrist ® are trademarks of Intuitive Surgical, Inc.\nForward-Looking Statements\nThis press release contains forward-looking statements, including statements regarding the Company’s unaudited preliminary financial and operational results for the fourth quarter and full year 2017, expected procedure growth in 2018, and investment in new technologies and services 2018. These forward-looking statements are necessarily estimates reflecting the best judgment of management and involve a number of risks and uncertainti", "external_links": ["https://www.globenewswire.com/Tracker?data=XKgX2Z6W0WF79ERSrlPptDjlVQC_YLMbyDubjQkPXiINOdXZzte_QwUbWYvLggvtaHtdDKhRFN9Gkn8A4uTI-yYZwhi2-rjAKhKddqjRy_A3XkRHZvs7DdhfyPcVsGp3wkkzfE7iAWkT75dsGifBG7JFVakNWZrzQXrT422g7hEyVzjIWbIkCD_TW3lk0C6z", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0977860f-1a0a-4097-bc44-7621f3b422fa", "https://www.intuitivesurgical.com/company/clinical-evidence/", "http://phx.corporate-ir.net/phoenix.zhtml?c=122359&p=irol-IRHome", "https://www.globenewswire.com/Tracker?data=lhYUvUgbF09tz8DZwJcSVX3sd0rWNeu_xuhkGM_KeDrs37JAeE9hbmEtg58_yol_1RFVnGFqBXTn6ddWEqhlPjXLR-oQva3ElRv_yIuY9ZNsuAl7Xm94hXBJ1C4kailzqfAqw_rgeWdu_hAmnu35cEVbKzrsNW2GTCQl42MNpIvLjePgcUaXt-IBszo_GU53ov5MNAFXGLebKZov0AwKQQ=="], "published": "2018-01-10T17:05:00.000+02:00", "crawled": "2018-01-10T18:52:22.015+02:00", "highlightTitle": ""}