{"organizations": [], "uuid": "347ebfa05eb7f7d2aaecda6c2cf3364558b6c811", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-concordia-care-and-ihcfa-positioned-to-support-new-nj-law-requiring-electronic-filing-of-medical-bills-for-auto-claims-free.html", "country": "US", "domain_rank": 767, "title": "Concordia Care and iHCFA Positioned to Support New NJ Law Requiring Electronic Filing of Medical Bills for Auto Claims, Free Implementation for Payers and Providers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "347ebfa05eb7f7d2aaecda6c2cf3364558b6c811"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-concordia-care-and-ihcfa-positioned-to-support-new-nj-law-requiring-electronic-filing-of-medical-bills-for-auto-claims-free.html", "ord_in_thread": 0, "title": "Concordia Care and iHCFA Positioned to Support New NJ Law Requiring Electronic Filing of Medical Bills for Auto Claims, Free Implementation for Payers and Providers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI--(BUSINESS WIRE)-- As Concordia Care, Inc. (Concordia), a specialty risk-transfer company, has completed its acquisition of iHCFA, LLC , an industry leading clearinghouse specializing in the electronic processing of workers compensation and automobile bills, it is well positioned to support a recently passed NJ law signed this week. NJ State Bill S-2137 requires electronic submission of automobile insurance claims between health care providers and insurance companies or their third-party administrators (TPAs).\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180131005302/en/\nUnder this newly enacted legislation, it is mandatory that all automobile insurance carriers, TPAs, and medical management companies who receive auto-related medical bills from health care providers accept and process the bills electronically. Further, it requires all healthcare providers and hospitals that submit over twenty-five (25) auto-related medical bills per month to now provide electronic bills for payment on standardized forms compliant with guidelines.\nJoseph Berardo Jr., CEO, Concordia says, “The new legislation demonstrates the significance of electronic billing in streamlining processes and reducing costs. This continues to reinforce for us why iHCFA is an important acquisition at this time given its advanced tech-enabled capabilities in this space.” Concordia serves insurers, government entities, self-insured plan sponsors and other managed care organizations.\nDr. William J. DeGasperis, president, iHCFA, adds, “As a New Jersey-based company, iHCFA currently has contracts with majority of the major medical management companies in the State, covering most of the automobile policies impacted by this new legislation. This allows us to help clients to quickly comply by seamlessly connecting to all medical billing systems.”\nNJ healthcare providers will benefit from enhanced management of their revenue cycles, with e-billing leading not only to faster payment, but also increased efficiency of direct point-to-point communication between the insurance carrier and the provider billing system.\nBerardo adds, “Implementation of electronic filing of medical bills leads to an overall reduction in administrative costs and results in a more efficient process. Given the mandatory nature of this legislation, Concordia and iHCFA expect to waive any associated implementation fees for its payers and providers.”\nTo ensure compliance with the new law, contact Concordia to get on their implementation schedule. Contact: 973.795.1641 extension 2000; njebill@ihcfa.com .\nAbout Concordia Care, Inc.\nConcordia Care, Inc. (Concordia) is a specialty risk transfer, care-coordination company servicing insurers, government entities, self-insured plan sponsors and other managed care organizations. Through its Pathways 2 Recovery (P2R) care model, Concordia aims to improve patient-centered outcomes and reduce overall cost of quality care by applying best practices in a biopsychosocial-centric approach to manage complex challenges for the casualty, group health and auto markets. Concordia’s integrated business units include: Concordia Casualty, Concordia Behavioral Health, Concordia Group Health, and Concordia Ancillary. Concordia holds dual accreditations from the Accreditation Association for Ambulatory Healthcare Inc. (AAAHC) and the National Committee for Quality Assurance (NCQA). Visit www.concordiacare.com . Concordia is an MBF Healthcare Partners portfolio company.\nAbout iHCFA\niHCFA , a New Jersey-based clearinghouse, specializes in electronically processing workers’ compensation and automobile bills with all supporting documents. iHCFA is an industry leader with the ability to connect to any medical billing system and link to more than 1,000 insurance payers and third-party administrators in all 50 states. For more information on iHCFA, visit www.ihcfa.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005302/en/\nMedia :\nCPR Communications for Concordia\nBrittany Tedesco, 201-641-1911 x 14\nbtedesco@cpronline.com\nSource: Concordia Care, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.concordiacare.com%2F&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=Concordia+Care%2C+Inc.&index=1&md5=339f4440832a2d49776f1235aecc7d98", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.concordiacare.com%2F&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=Concordia+Care%2C+Inc.&index=3&md5=e640676966ddce09af9af400c4542b40", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ihcfa.com%2F&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=iHCFA&index=5&md5=932f204df6fef71b17d4944bdc3550c6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.concordiacare.com&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=www.concordiacare.com&index=4&md5=dd9772d2e440c3d0f8b2ae3837c58d8d", "http://www.businesswire.com/news/home/20180131005302/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ihcfa.com%2F&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=iHCFA%2C+LLC&index=2&md5=a4e9aa6989de34c4bef658a3bdd897af", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ihcfa.com&esheet=51751253&newsitemid=20180131005302&lan=en-US&anchor=www.ihcfa.com&index=6&md5=add76492e2516aeb02c9bae3e24f7cf3"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:46:39.025+02:00", "highlightTitle": ""}