{"organizations": [], "uuid": "c136ce457d3722ab402270cd761b92b3df786219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225927897&w=1200&r=LYNXMPEE0R02L", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/japan-cryptocurrency/hacked-tokyo-cryptocurrency-exchange-to-repay-owners-425-million-idINKBN1FH03H", "country": "US", "domain_rank": 408, "title": "Hacked Tokyo cryptocurrency exchange to repay owners $425 million", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T05:40:00.000+02:00", "replies_count": 0, "uuid": "c136ce457d3722ab402270cd761b92b3df786219"}, "author": "", "url": "https://in.reuters.com/article/japan-cryptocurrency/hacked-tokyo-cryptocurrency-exchange-to-repay-owners-425-million-idINKBN1FH03H", "ord_in_thread": 0, "title": "Hacked Tokyo cryptocurrency exchange to repay owners $425 million", "locations": [], "entities": {"persons": [{"name": "coincheck", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "coincheck inc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nem", "sentiment": "none"}, {"name": "financial services agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 3:42 AM / Updated 32 minutes ago Hacked Tokyo cryptocurrency exchange to repay owners $425 million Reuters Staff 3 Min Read \nTOKYO (Reuters) - Tokyo-based cryptocurrency exchange Coincheck Inc said on Sunday it would return about 46.3 billion yen ($425 million) of the virtual money it lost to hackers two days ago in one of the biggest-ever thefts of digital money. \nThat amounts to nearly 90 percent of the 58 billion yen worth of NEM coins the company lost in an attack that forced it to suspend on Friday withdrawals of all cryptocurrencies except bitcoin. \nCoincheck said in a statement it would repay the roughly 260,000 owners of NEM coins in Japanese yen, though it was still working on timing and method. \nThe theft underscores security and regulatory concerns about bitcoin and other virtual currencies even as a global boom in them shows little signs of fizzling. \nTwo sources with direct knowledge of the matter said Japan’s Financial Services Agency (FSA) sent a notice to the country’s roughly 30 firms that operate virtual currency exchanges to warn of further possible cyber-attacks, urging them to step up security. \nThe financial watchdog is also considering administrative punishment for Coincheck under the financial settlements law, one of the sources said. \nJapan started to require cryptocurrency exchange operators to register with the government only in April 2017. Pre-existing operators such as Coincheck have been allowed to continue offering services while awaiting approval. Coincheck’s application, submitted in September, is still pending. \nCoincheck told a late-Friday news conference that its NEM coins were stored in a “hot wallet” instead of the more secure “cold wallet”, outside the internet. Asked why, company President Koichiro Wada cited technical difficulties and a shortage of staff capable of dealing with them. \nIn 2014, Tokyo-based Mt. Gox, which once handled 80 percent of the world’s bitcoin trades, filed for bankruptcy after losing around half a billion dollars worth of bitcoins. More recently, South Korean cryptocurrency exchange Youbit last month shut down and filed for bankruptcy after being hacked twice last year. \nWorld leaders meeting in Davos last week issued fresh warnings about the dangers of cryptocurrencies, with U.S. Treasury Secretary Steven Mnuchin relating Washington’s concern about the money being used for illicit activity. \n($1 = 108.7000 yen)", "external_links": [], "published": "2018-01-28T05:40:00.000+02:00", "crawled": "2018-01-28T05:57:30.033+02:00", "highlightTitle": ""}