{"organizations": [], "uuid": "4d391fdba31b7b072f58245bc6bcef9756b21add", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-extenet-systems-appoints-greg-spraetz-to-lead-its-enterprise-network-solutions-business-unit.html", "country": "US", "domain_rank": 767, "title": "ExteNet Systems Appoints Greg Spraetz to Lead its Enterprise Network Solutions Business Unit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:54:00.000+02:00", "replies_count": 0, "uuid": "4d391fdba31b7b072f58245bc6bcef9756b21add"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-extenet-systems-appoints-greg-spraetz-to-lead-its-enterprise-network-solutions-business-unit.html", "ord_in_thread": 0, "title": "ExteNet Systems Appoints Greg Spraetz to Lead its Enterprise Network Solutions Business Unit", "locations": [], "entities": {"persons": [{"name": "greg spraetz", "sentiment": "negative"}, {"name": "ross manire", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "extenet systems", "sentiment": "negative"}, {"name": "enterprise network solutions business unit chicago", "sentiment": "negative"}, {"name": "enterprise network solutions business unit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 29, 2018 /PRNewswire/ -- ExteNet Systems , a leading provider of converged communications infrastructure enabling advanced cellular, wireless and broadband connectivity across urban and rural America, today announced the appointment of Greg Spraetz to lead its Enterprise Network Solutions Business Unit as a Senior Vice President and General Manager.\n\"We are witnessing a rising demand for converged communication infrastructure solutions across our enterprise business, which includes several strategic indoor verticals including commercial real estate, hospitality, sports and entertainment and healthcare,\" said Ross Manire, President and CEO for ExteNet Systems. \"The need for cellular connectivity to attract tenants, increase property value and enhance the experience for hotel guests and sports fans is well known today. However, a significant building and enterprise requirement is a managed fiber offering to enable the communication services throughout the building. We will leverage Greg's deep domain experience and expertise to deliver enhanced value to our enterprise customers to meet their distinct needs.\"\n\"Over the past 20 years, I have had the opportunity to delve deeply into the communication infrastructure industry from both a carrier and vendor perspective,\" said Mr. Spraetz. \"This has provided me with a comprehensive understanding of the complexities involved and the pain points for all parties involved. My goal will be to leverage my extensive experience to serve our customer base - including building owners, carriers, and enterprise clients - in the best possible manner while delivering the most innovative, timely, cost-effective and pragmatic in-building communication solution for them.\"\nPrior to joining ExteNet Systems in January 2018, Mr. Spraetz was the EVP of Sales and Marketing for Conterra Broadband, a regional fiber and microwave solutions provider serving wireless, government, enterprise, and wholesale customers. Previously, he served as the SVP of Wholesale and Carrier Services covering the North America and Asia Pacific regions for Level 3 Communications where he managed and grew the core data services revenue globally since October 2011. Prior experience includes several sales management roles with leading companies like Intermedia Communications and BellSouth Telecommunications.\nAbout ExteNet Systems, Inc.\nLisle, Ill.-based ExteNet Systems, Inc. designs, builds, owns and operates distributed networks (DNS) for use by wireless carriers, broadband providers, IoT companies, property owners and communities across the United States. ExteNet deploys scalable communications infrastructure to enhance wireless and broadband services across both outdoor and indoor environments using fiber-based distributed antenna systems (DAS), remote radio heads (RRH), small cells, Wi-Fi, Virtualized Evolved Packet Core (vEPC) and other technologies. ExteNet's outdoor distributed networks are deployed in a variety of urban, suburban and rural environments. Indoor distributed networks are deployed in various property verticals including sports and entertainment venues, hotels and convention centers, commercial office space, healthcare facilities and transit systems. For more information, please visit www.extenetsystems.com .\n\"ExteNet\" is a registered trademark of ExteNet Systems, Inc.\nMedia Contact:\nEddy Rivera\nEdelman\n312.240.2606\n189492@email4pr.com\nAnalyst Contact:\nManish Matta\nExteNet Systems\n630.505.3846\n189492@email4pr.com\nView original content: http://www.prnewswire.com/news-releases/extenet-systems-appoints-greg-spraetz-to-lead-its-enterprise-network-solutions-business-unit-300589419.html\nSOURCE ExteNet Systems Inc.", "external_links": ["http://www.extenetsystems.com/", "http://www.prnewswire.com/news-releases/extenet-systems-appoints-greg-spraetz-to-lead-its-enterprise-network-solutions-business-unit-300589419.html"], "published": "2018-01-29T15:54:00.000+02:00", "crawled": "2018-01-29T17:35:48.010+02:00", "highlightTitle": ""}