{"organizations": [], "uuid": "f40950ba22eaf8d205103a568309d2886d80e6c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/01/103433183-GettyImages-513191736.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/good-economy-might-not-bail-out-republicans-in-midterms-after-all.html", "country": "US", "domain_rank": 767, "title": "Good economy might not bail out Republicans in midterms after all", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-30T23:19:00.000+02:00", "replies_count": 0, "uuid": "f40950ba22eaf8d205103a568309d2886d80e6c7"}, "author": "John Harwood", "url": "https://www.cnbc.com/2018/01/30/good-economy-might-not-bail-out-republicans-in-midterms-after-all.html", "ord_in_thread": 0, "title": "Good economy might not bail out Republicans in midterms after all", "locations": [], "entities": {"persons": [{"name": "alan abramowitz", "sentiment": "none"}, {"name": "abramowitz", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "gallup", "sentiment": "none"}, {"name": "emory university", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Getty Images \nIn centering their midterm election strategy on a strong economy, Republicans face a challenge: history shows it doesn't work. \nEmory University political scientist Alan Abramowitz has examined every midterm election since World War II. Among factors influencing partisan changes in the House, the state of the economy ranked low. \n\"The correlation between economic indicators and seat-swings in midterm elections is very weak,\" Abramowitz says. The president's job approval rating, he adds, has been four times as powerful as economic growth in determining how his party fares. \nThat helps explain why, despite solid growth, surging markets and falling unemployment, more than twice as many Republicans (34) as Democrats (15) have chosen to leave the House rather than seat re-election. Just 38 percent of Americans approve of President Donald Trump 's handling of his job in the Gallup poll preceding Tuesday night's State of the Union , continuing his status as the least popular first-term chief executive in the history of survey research. \nRecent midterm elections demonstrate the point. Over the past half-century, the presidents who fared best in midterms during their second year were George H.W. Bush and George W. Bush. \nFor the elder Bush in 1990, the economy had fallen into recession. But following the collapse of the Berlin Wall, he boasted an 80 percent approval rating before his first State of the Union speech. His fellow Republicans went on to lose just eight seats, well below the average loss of 24. \nFor the younger Bush in 2002, unemployment continued to rise even after the economy had emerged from recession. But he rode a wave of post-9/11 popularity to 84 percent approval before his first State of the Union speech. That November he became the first second-year president since Franklin Roosevelt to gain House seats, as fellow Republicans added eight members to their majority. \nAs President Bill Clinton delivered his first State of the Union in January 1994, the economy was growing (5.4 percent in the previous quarter) and adding jobs (316,000 in the previous month) at rates his successors would come to envy. But a series of controversies dragged him down to a Trump-like 39 percent later that year. His fellow Democrats lost 52 seats and their House majority. \nBefore President Barack Barack Obama 's first midterm contest in 2010, the economy had curbed massive job losses and resumed growth as it emerged from the Great Recession he inherited. In the time between his inauguration and first State of the Union, the Dow Jones Industrial average rose 29 percent. \nBut fierce Republican opposition had driven down Obama's approval rating to 49 percent, and it remained below 50 percent most of the year. Fellow Democrats lost 63 seats – the biggest loss by the party in the White House since World War II. \nThere's little chance Republicans could lose that many seats in November even though Trump's approval stands a full 10 percentage points lower than Obama's at the same point. Residential patterns across the country, reinforced by congressional district lines drawn by GOP state legislators following their 2010 sweep, have left Democratic voters more tightly packed into fewer districts. \nAbramowitz, the Emory political scientist, has created an election forecasting model which takes account of factors he has found most predictive of midterm results. One is how many seats the president's party has to defend; another is where it stands in polling on the \"generic ballot\" – a measure of party popularity that fluctuates in tandem with shifting presidential approval. \nWith Democrats now leading the generic ballot by nearly eight percentage points in the Real Clear Politics average , Abramowitz's model envisions a gain of 30 seats for President Trump's partisan opponents. That's six more seats than Democrats need to regain the majority.", "external_links": [], "published": "2018-01-30T23:19:00.000+02:00", "crawled": "2018-01-30T23:21:37.013+02:00", "highlightTitle": ""}