{"organizations": [], "uuid": "e4fee0e914d2a843294aa28f079de68a2ea93b10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223284051&w=1200&r=LYNXMPEE0I0FB", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-bridge/lets-build-a-bridge-to-europe-after-we-brexit-johnson-suggests-idUKKBN1F80TK", "country": "US", "domain_rank": 408, "title": "France says no for now to Johnson's idea of giant Channel bridge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T13:51:00.000+02:00", "replies_count": 0, "uuid": "e4fee0e914d2a843294aa28f079de68a2ea93b10"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-bridge/lets-build-a-bridge-to-europe-after-we-brexit-johnson-suggests-idUKKBN1F80TK", "ord_in_thread": 0, "title": "France says no for now to Johnson's idea of giant Channel bridge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:49 AM / Updated 10 hours ago France says no for now to Johnson's idea of giant Channel bridge Guy Faulconbridge , Brian Love 4 Min Read \nLONDON/PARIS (Reuters) - France on Friday politely rejected Boris Johnson’s idea of building a giant bridge across the English Channel after Brexit, saying that, while far-fetched ideas were worth considering, there were plenty of major European projects to finish first. \nForeign Secretary Johnson, who led the campaign to leave the EU in the 2016 referendum, broached the idea of building a 22-mile Channel Bridge during a visit to Britain by French President Emmanuel Macron, the Daily Telegraph newspaper reported. \nBritain’s most prominent Brexiteer even explained some of his ideas on Channel crossings to Macron, who the newspaper reported gave a short but positive reply. \nFrance’s finance minister, though, gave the idea short shrift. \n“All ideas merit consideration, even the most far-fetched ones,” Bruno Le Maire said, noting that the Channel Tunnel already linked Europe’s second- and third-largest economies. \n“We have major European infrastructure projects that are complicated to finance,” Le Maire told Europe 1 radio. “Let’s finish things that already under way before thinking of new ones.” \nPrime Minister Theresa May’s appointment of Johnson, who in the run-up to Britain’s referendum on EU membership compared the goals of the European Union to those of Adolf Hitler and Napoleon, caused consternation in European capitals. \nIt took two centuries for Britain to countenance the construction of the Channel Tunnel, which French emperor Napoleon Bonaparte once suggested, though the land link has repeatedly been the focus of concerns about illegal immigration. \n“Our economic success depends on good infrastructure and good connections. Should the Channel Tunnel be just a first step?” Johnson tweeted. FILE PHOTO - French Finance Minister Bruno Le Maire leaves the Elysee Palace after the first weekly cabinet meeting of the year and a government seminar in Paris, France, January 3, 2018. REUTERS/Benoit Tessier BREXIT BRIDGE \nJohnson did not mention the idea of a bridge explicitly in public and it was unclear if any detailed discussions had taken place. \nThe Telegraph said Johnson believed a privately funded 22-mile bridge might now be an option, and would support increased tourism and trade after Brexit. \n“Technology is moving on all the time and there are much longer bridges elsewhere,” Johnson told his aides, according to the newspaper. \nIt was unclear how such a bridge might work in one of the world’s busiest shipping lanes, or whether its construction might interrupt trade. \n“It’s good to have vision, particularly with respect to infrastructure projects, but the Dover Strait is the world’s busiest shipping lane with many, many hundreds of vessel transits per day,” said Guy Platten, CEO of the UK Chamber of Shipping. \n“Building a 22-mile-long bridge across the Channel would therefore not be without its challenges, especially as the largest ships currently transiting the Strait have a height above the water line in excess of 60 metres.” \nAs foreign minister, Johnson has bewildered British and foreign diplomats alike with sometimes flippant remarks on issues ranging from Libyan tourism to British colonialism in Burma. \nWhile mayor of London, he backed a now-defunct plan for a 200 million pound pedestrian “Garden Bridge” over the Thames, which he hoped would create a new green space in the middle of the city. \nHe also argued vociferously for a new airport to be built on an island in the Thames Estuary as a solution to the capital’s air capacity problems, a plan rejected by the government. Writing by Guy Faulconbridge; Editing by Kevin Liffey", "external_links": [], "published": "2018-01-19T13:51:00.000+02:00", "crawled": "2018-01-19T16:12:47.000+02:00", "highlightTitle": ""}