{"organizations": [], "uuid": "004cd88a99e3414ad2acb8f3898fc6871c395f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/us-otc-sterling/the-70000-women-who-didnt-bring-sex-discrimination-claims-against-sterling-idUSKBN1F633D", "country": "US", "domain_rank": 408, "title": "The 70,000 women who didn’t bring sex discrimination claims against Sterling", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T07:42:00.000+02:00", "replies_count": 0, "uuid": "004cd88a99e3414ad2acb8f3898fc6871c395f0c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-otc-sterling/the-70000-women-who-didnt-bring-sex-discrimination-claims-against-sterling-idUSKBN1F633D", "ord_in_thread": 0, "title": "The 70,000 women who didn’t bring sex discrimination claims against Sterling", "locations": [], "entities": {"persons": [{"name": "sterling jeweler", "sentiment": "negative"}, {"name": "sterling", "sentiment": "none"}, {"name": "jed rakoff", "sentiment": "none"}, {"name": "rakoff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "american arbitration association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Almost 70,000 women were bounced from a sex discrimination case against Sterling Jewelers on Tuesday. An American Arbitration Association arbitrator had certified the women, current and former Sterling employees, as part of a class pursing private arbitration claims under Title VII of the Civil Right Act. But U.S. District Judge Jed Rakoff of Manhattan ruled the arbitrator did not have authority over women who hadn’t affirmatively joined the arbitration. Rakoff held the class can consist only of women who have specifically opted into the arbitration of their sex discrimination claims. According to Sterling, that shrinks the case against the jeweler to claims by only 254 women.\nOnly 254 female Sterling employees, out of a total of about 70,000, have affirmatively asserted sex discrimination against the company in classwide arbitration.\nClass action detractors are probably thinking right now that the Sterling case proves employees don’t lose a valuable right when employers bar them from arbitrating as a group. After all, tens of thousands of women at Sterling were deemed to have a right to classwide arbitration of their gender bias claims, yet only 254 explicitly said they wanted to use it – a seemingly minuscule participation rate, even by class litigation standards.\nAs you’ve probably guessed, the story turns out to be more complicated than that simple syllogism. The U.S. Supreme Court will soon decide the fate of employer prohibitions on employees’ class arbitration in a pair of cases the justices heard back in October. Depending on the Supreme Court’s decision, the Sterling case could be one of the last big, classwide employment arbitrations ever to be litigated. So it’s important to understand how Sterling’s women employees wielded their power to act in concert against their employer.\nIt was those employees, and their lawyers at Cohen Milstein Sellers & Toll , who first moved to arbitrate their claims in the 10-year-old case, which raised allegations under both Title VII and the Equal Pay Act. Sterling’s employment contract did not explicitly address classwide arbitration. The arbitrator eventually determined that she had the authority to interpret the agreement – and that its terms permitted employees to arbitrate as a class. She subsequently granted conditional certification to two classes, one to arbitrate Title VII claims and the other to pursue Equal Pay Act claims.\nJudge Rakoff and the 2nd U.S. Circuit Court of Appeals have struggled to agree on federal court authority over decisions by the Sterling arbitrator, which has made for a legally interesting dialogue between the trial and appellate courts. Judge Rakoff recapped the back-and-forth in Tuesday’s opinion, highlighting what he called “tension” between the 2nd Circuit’s 2011 holding that the Sterling arbitrator had the power to determine whether Sterling’s employment agreements permit classwide arbitration, and the 2nd Circuit’s ruling last year that its 2011 decision doesn’t necessarily mean the arbitrator can certify a class including employees who haven’t opted into the proceeding.\nSterling has maintained throughout the case that the women’s claims have no merit. But the allegations have undeniably affected the company. Last May, Sterling settled the Equal Employment Opportunity Commission’s gender bias suit in Buffalo federal court, agreeing to adopt new anti-discrimination policies and to train managers to avoid bias. Sterling, which is represented in the gender employment litigation by Seyfarth Shaw , did not pay any money as part of the EEOC settlement.\nThe company is also facing Equal Pay Act claims by nearly 10,000 women who opted into that classwide arbitration, which, as I mentioned, was certified separately from the Title VII class. Sterling is challenging the arbitrator’s class certification decision in the Equal Pay Act case, but the arbitration is meanwhile scheduled for trial in May. In addition, Sterling is defending a securities class action accusing the company of deceiving shareholders about the gravity of the sex bias allegations. That case followed the February 2017 disclosure of 1,300 pages of arbitration documents in which about 200 current and former female Sterling employees described a corporate culture of sexual harassment and discrimination. (Sterling has denied intentionally paying women less than men, refuted allegations of harassment and said testimony was “being publicized by claimants’ counsel to present a distorted, negative image of the company.”)\nCertainly, more than 254 current and former female Sterling employees were aware of the existence of the classwide sex discrimination arbitration. Nearly 10,000 of them went to the trouble of affirmatively filing claims in the parallel Equal Pay Act arbitration. So why didn’t more of those 70,000 Sterling women choose to pursue gender discrimination claims?\nAccording to plaintiffs’ lawyers at Cohen Milstein, the answer is that women didn’t opt in to the Title VII arbitration because the arbitrator said they didn’t have to. In its brief backing the arbitrator’s class certification decision, Cohen Milstein explained that the arbitrator ruled back in 2009 that women who had not already filed sex discrimination claims against Sterling could rely on similar claims by other members of the prospective arbitration class. Cohen Milstein said the arbitrator’s holding - which it said accords with contract law, the Sterling agreement, Rule 23 and Title VII - relieved prospective class members of an obligation to opt in to the sex discrimination arbitration. Absent class members could simply piggyback on already-filed claims, according to Cohen Milstein.\nBy contrast, the arbitrator decided she could not certify the Equal Pay Act arbitration to proceed as an opt-out class because such cases are typically litigated under federal law as opt-in class actions. Women who worked at Sterling were notified about the Equal Pay Act arbitration, and, as I mentioned, nearly 10,000 affirmatively chose to participate in it.\nBut Cohen Milstein said it’s “misleading” to talk about opt-ins in the Title VII case, considering that the arbitrator concluded plaintiffs did not need to opt-in to participate in the class case.\nJudge Rakoff looked at the question from a different angle, holding that prospective class members never agreed to submit to the arbitrator’s authority and cannot be bound by an erroneous interpretation of the contract they signed. He cited a dissent by Justice Samuel Alito in the Supreme Court’s 2013 decision in Oxford Health Plans v. Sutter .\nIt will eventually be up to the 2nd Circuit to decide if Judge Rakoff was right to exclude tens of thousands of women from the Title VII class, since Cohen Milstein said in an email statement Tuesday that it plans to appeal. By the time the 2nd Circuit has its third crack at the Sterling case, the Supreme Court may have blessed employment agreements that require employees to waive the right to arbitrate as a class.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["https://www.eeoc.gov/eeoc/newsroom/release/9-24-08.cfm", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T07:42:00.000+02:00", "crawled": "2018-01-18T12:39:34.015+02:00", "highlightTitle": ""}