{"organizations": [], "uuid": "dbd7bd308c6aec3476a8de7dfdeff66ebfefe565", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-refugees-immigration/u-s-experts-invent-formula-that-doubles-refugees-job-chances-idUSKBN1F72SE", "country": "US", "domain_rank": 408, "title": "U.S. experts invent formula that doubles refugees' job chances", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T03:04:00.000+02:00", "replies_count": 0, "uuid": "dbd7bd308c6aec3476a8de7dfdeff66ebfefe565"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-refugees-immigration/u-s-experts-invent-formula-that-doubles-refugees-job-chances-idUSKBN1F72SE", "ord_in_thread": 0, "title": "U.S. experts invent formula that doubles refugees' job chances", "locations": [], "entities": {"persons": [{"name": "kirk bansak", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "stanford university", "sentiment": "none"}, {"name": "ipl", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Refugees arriving in the United States could double their chances of finding work with a mathematical formula that decides the best place for them to settle, researchers said on Thursday.\nStanford University’s Immigration Policy Lab (IPL) developed an algorithm that uses historical data on refugee resettlement to send new arrivals to locations where they are likely to thrive, rather than simply those with space to receive them.\n“By putting in place a system that will enhance their employment prospects at virtually no cost, this should be empowering not only for refugees but also for the communities in which they are resettled,” said Kirk Bansak, an IPL researcher.\n“By trying to get refugees to get employment as early as possible, they are able to become contributing members of society more quickly,” he told the Thomson Reuters Foundation.\nThe world is grappling with an unprecedented displacement crisis, with more than 22 million people fleeing across borders to escape war and persecution, United Nations (U.N.) data shows.\nBut less than one percent are resettled, according to the U.N. refugee agency (UNHCR) which screens and interviews candidates, amid rising hostility towards immigrants and arguments over how to best help them integrate.\nThe United States is the world’s top resettlement country, taking in almost 85,000 new arrivals in 2016, UNHCR said.\nThe researchers entered data into the algorithm on the age, gender, language skills and country of origin of more than 30,000 adult refugees assigned to a resettlement agency in the United States over five years.\nThey then asked it to choose optimal locations for refugees who arrived at the end of 2016, using patterns from this data.\nNew arrivals who closely resembled those in the database were assigned to locations where earlier refugees had prospered, doubling their probability of finding work to 50 from 25 percent, said IPL, the main institution behind the study.\nPal Nesse, an adviser to the Norway Refugee Council, described the research as “exciting” as similar approaches have proven successful elsewhere.\n“In Norway, we see that municipalities that have been good at mapping refugees competencies, working with the business community or education institutions ... are very good at getting refugees into work,” he said.\n“The most important factor has been that ability to follow up individually and target training and employment opportunities.”\nReporting by Lee Mannion @leemannion. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T03:04:00.000+02:00", "crawled": "2018-01-19T12:25:10.000+02:00", "highlightTitle": ""}