{"organizations": [], "uuid": "5d325b00230cf2d19396a664efba69ed2c18155f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 75, "shares": 75, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219923968&w=1200&r=LYNXMPEE06007", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-japan-economy-abe/japan-pm-abe-says-he-wants-bojs-kuroda-to-keep-up-efforts-on-economy-idUSKBN1EW00B", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Japan's Abe urges central bank's Kuroda to keep up efforts on economy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T03:44:00.000+02:00", "replies_count": 0, "uuid": "5d325b00230cf2d19396a664efba69ed2c18155f"}, "author": "", "url": "https://www.reuters.com/article/us-japan-economy-abe/japan-pm-abe-says-he-wants-bojs-kuroda-to-keep-up-efforts-on-economy-idUSKBN1EW00B", "ord_in_thread": 0, "title": "UPDATE 1-Japan's Abe urges central bank's Kuroda to keep up efforts on economy", "locations": [], "entities": {"persons": [{"name": "abe", "sentiment": "negative"}, {"name": "kuroda", "sentiment": "negative"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "haruhiko kuroda", "sentiment": "none"}, {"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "nhk", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 12:35 AM / Updated 20 hours ago Japan's Abe urges central bank's Kuroda to keep up efforts on economy Leika Kihara 3 Min Read \nTOKYO (Reuters) - Japanese Prime Minister Shinzo Abe on Sunday called on central bank governor Haruhiko Kuroda to keep up efforts to reflate the economy, but added he was undecided on whether to reappoint Kuroda for another five-year term. \nKuroda was handpicked by Abe to take the helm of the central bank in 2013 to deploy a massive stimulus program - part of the premier’s “Abenomics” reflationary policies - that helped boost growth but failed to drive up inflation to the bank’s target of 2 percent. \nAbe also said the government would continue to work with the central bank to boost growth, so that he could declare an official end to deflation at the earliest date possible. \n“Governor Kuroda has met my expectations with job availability at a 43-year high,” Abe said on public broadcaster NHK. \n“I want him to keep up his efforts. But I haven’t made up my mind,” on who should succeed Kuroda when his term ends in April, he added. \nMany analysts see a good chance that Kuroda will be reappointed when the government selects successors to him and his two deputies in coming months, decisions that need parliament’s approval. \nAbe said Japan’s economy was showing signs of emerging from deflation, with a tightening job market pushing up wages. \n“We’ll deploy all available policies so that we can declare an end to deflation at the earliest date possible,” Abe said. \n“It might not necessarily be this year, but the government and the BOJ must fulfill their responsibilities,” he added, so as to ensure conditions to bring about an end to deflation. \nThe government looks at several factors, such as inflation data and the output gap, in determining whether the economy is sustainably out of deflation. \nSome policymakers are keen to declare an end to deflation, which would help Abe argue his policies succeeded in reflating the economy. But doing so could also give the BOJ justification to withdraw crisis-mode stimulus, some analysts say. \nJapan’s economy expanded for the seventh straight quarter in July-September, boosted by robust exports and capital expenditure. \nCore consumer inflation rose 0.9 percent in November from a year earlier, marking the 11th straight month of gains but still distant from the BOJ’s target of 2 percent. \nAbe has urged companies to raise wages by 3 percent or more this year on the view that wage hikes are critical to boost consumption and sustain Japan’s strengthening economic recovery. Reporting by Leika Kihara; Editing by Meredith Mazzilli and Clarence Fernandez", "external_links": [], "published": "2018-01-07T03:44:00.000+02:00", "crawled": "2018-01-07T04:09:36.004+02:00", "highlightTitle": ""}