{"organizations": [], "uuid": "b983ca4263348dc446af53c4fff8edd944fc2fb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224488069&w=1200&r=LYNXMPEE0M0PC", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-modi/globalistation-is-losing-its-luster-indias-modi-tells-davos-summit-idUSKBN1FC1AL", "country": "US", "domain_rank": 408, "title": "Indian PM Modi defends globalization at Davos summit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-23T19:16:00.000+02:00", "replies_count": 0, "uuid": "b983ca4263348dc446af53c4fff8edd944fc2fb7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-modi/globalistation-is-losing-its-luster-indias-modi-tells-davos-summit-idUSKBN1FC1AL", "ord_in_thread": 0, "title": "Indian PM Modi defends globalization at Davos summit", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "negative"}, {"name": "modi", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Indian Prime Minister Narendra Modi mounted a defense of globalization at the World Economic Forum on Tuesday, urging joint action on climate change and economic cooperation, in a speech some delegates took as a swipe at U.S. President Donald Trump’s America First agenda.\nModi, making the forum’s first speech by an Indian head of state in more than two decades, did not mention Trump by name but he criticized the rise of protectionism in remarks delivered three days before the U.S. President will address the summit.\n“Instead of globalization, the power of protectionism is putting its head up,” Modi said, speaking in Hindi and causing an initial flurry in the audience of business and political leaders as people reached for their translation headsets.\n“Their wish is not only to save themselves from globalization, but to change the natural flow of globalization.”\nModi is leading a big government and business delegation to the summit in the Swiss ski resort of Davos, aiming to showcase India as a fast-growing economic power and a potential driver of global growth.\nHis opening address was a moment of personal triumph for the nationalist leader once shunned by the West for failing to prevent communal rioting in his home state. The occasion also recognized India’s growth as an economic and geopolitical power.\nAnindya Bakrie, chief executive of media company PT Bakrie Global Ventura, part of Indonesia’s Bakrie conglomerate, said Modi’s remarks were a welcome contrast to U.S. isolationism.\n“For developing countries, when we hear the U.S. talking about isolationism it’s a bit concerning. So to have more and more leaders talk about the benefits of globalization is really good,” Bakrie said.\nArun Kumar, chairman and CEO of accounting firm KPMG in India, said: “He laid out where India stands in terms of his preference for a multi-polar and multicultural world.”\nUnder his America First agenda, Trump has threatened to withdraw from the North American free-trade agreement, disavowed the global climate change accord and criticized global institutions including the United Nations and NATO.\nModi’s speech echoed some of the points made by Chinese President Xi Jinping at last year’s Davos summit, but he failed to generate the same enthusiasm.\nIndia's Prime Minister Narendra Modi gestures as he speaks at the Opening Plenary during the World Economic Forum (WEF) annual meeting in Davos, Switzerland, January 23, 2018. REUTERS/Denis Balibouse A year ago, Xi, speaking days before Trump was inaugurated, staked out China’s position as the world’s economic powerhouse, promising a greater openness to globalization.\nHowever, Xi, who is not attending this year, is not seen to have delivered on the broad promises made at Davos over the past year, but his speech was seen as a key moment in China’s attempt to fill a void created by a more inward-looking United States.\nModi arrived in Davos on Monday for a one-day trip. His visit was marred by travel delays, as heavy snow in the ski resort town made it impossible for Modi to take a helicopter to Davos from Zurich and the roads were clogged with traffic.\nIn his speech, Modi laid out three big challenges facing the world: climate change, terrorism and growing protectionism.\nSlideshow (5 Images) “The result of this is that we are seeing new types of tariff and non-tariff-based barriers being imposed. Bilateral and multilateral trade negotiations appear to have come to a halt,” he said.\nHe said the world must come together to solve these issues and India could show it the way, referring frequently to ancient Indian thought and scriptures that call for harmony between humans and nature and refer to the world as family.\nModi said climate change was a major threat to the world, yet the world had failed to come together to tackle it. He said everyone wanted carbon emissions to be cut, but the rich world was not ready to help developing economies with new technology.\nIndia, one of the world’s fastest growing major economies and a growing contributor to pollution, has said it is keen to honor its commitment to clean up the environment despite Trump pulling out of the Paris accord on cutting carbon emissions.\nModi also highlighted reforms and policies his administration had undertaken to make India more open. He said his government had abolished some 1,400 archaic laws.\n“We are removing red tape and laying the red carpet,” Modi said.\nSome business leaders said India still had a lot of work to do to attract more investment, including taming bureaucracy, tackling corruption and cleaning up pollution.\n“He’s saying this is a different party in power and it’s trying different things. The question is will the country give him enough time to really change things,” said Vim Maru, group retail director at UK-based Lloyds Bank.\nAdditional reporting by Simon Robinson, Delhi bureau; Editing by Mark Potter and Mark Bendeich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:16:00.000+02:00", "crawled": "2018-01-23T17:43:11.006+02:00", "highlightTitle": ""}