{"organizations": [], "uuid": "6dd50f2f89208706fceec31c89404a79f280146f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-rangeland-energy-to-sell-rangeland-energy-ii-llc-to-andeavor.html", "country": "US", "domain_rank": 767, "title": "Rangeland Energy to Sell Rangeland Energy II, LLC to Andeavor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-03T16:10:00.000+02:00", "replies_count": 0, "uuid": "6dd50f2f89208706fceec31c89404a79f280146f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-rangeland-energy-to-sell-rangeland-energy-ii-llc-to-andeavor.html", "ord_in_thread": 0, "title": "Rangeland Energy to Sell Rangeland Energy II, LLC to Andeavor", "locations": [], "entities": {"persons": [{"name": "rangeland iii", "sentiment": "none"}], "locations": [{"name": "andeavor sugar land", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "delaware basin", "sentiment": "none"}, {"name": "andeavor", "sentiment": "none"}, {"name": "corpus christi", "sentiment": "none"}], "organizations": [{"name": "rangeland energy", "sentiment": "negative"}, {"name": "encap flatrock midstream", "sentiment": "none"}, {"name": "rio hub", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "rangeland energy ii", "sentiment": "none"}, {"name": "rio pipeline system", "sentiment": "none"}, {"name": "rangeland energy iii", "sentiment": "none"}, {"name": "tesoro refining & marketing company llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUGAR LAND, Texas--(BUSINESS WIRE)-- Rangeland Energy (“Rangeland”) today announced that the company and its financial sponsor EnCap Flatrock Midstream have entered into a definitive agreement to sell Rangeland Energy II, LLC (“Rangeland II”) to Tesoro Refining & Marketing Company LLC, a wholly owned subsidiary of Andeavor (NYSE: ANDV) for an undisclosed amount. Rangeland II owns and operates the RIO System , a multipart crude oil and frac sand logistics system originating in the heart of the Delaware Basin. The system provides access and optionality to multiple crude oil producers and end markets and consists of the RIO Pipeline System and the RIO Hub.\nThe all-cash transaction is expected to close early in the first quarter of 2018, subject to customary regulatory approvals. Substantially all of Rangeland II’s field employees will be invited to remain with the asset as employees of Andeavor. The Rangeland II management team will focus on the expansion of Rangeland Energy III, LLC (“Rangeland III”). Rangeland III is developing the STEPS logistics terminal in Corpus Christi and pursuing midstream opportunities in western Canada.\nSTEPS is an integrated hydrocarbon logistics system that will receive and store refined products, liquefied petroleum gas (“LPG”) and other hydrocarbons at a new terminal hub now under construction in Corpus Christi, Texas, and transport them to terminals primarily located in Mexico.\nRIO System Details\nThe RIO System is comprised of four core facilities, with additional facilities under development. The RIO Hub rail facility is located approximately 12 miles south of Carlsbad in Eddy County, New Mexico, and is the Delaware Basin’s premier frac sand rail-unloading, storage and truck-loading facility. The RIO Pipeline consists of 110 miles of 12-inch crude oil pipeline, bridging the Delaware and Midland basins with connectivity at the State Line Terminal in Loving County, Texas, and the Geneva and Zurich terminals in Midland, Texas. Today, the RIO System provides shippers optionality to access the Colorado City, Cushing, Corpus Christi and Houston markets through Midland. Planning for additional Midland connectivity is in progress to offer even greater optionality to shippers on the RIO System.\nFrom Rangeland\n“Rangeland II Chief Operating Officer Steve Broker and his team have done an outstanding job of creating value by developing a scalable system with connectivity to the Midland market center and beyond,” said Rangeland President and CEO Chris Keene. “We look forward to continuing to work with EnCap Flatrock Midstream as we leverage our successful terminaling experience to develop the STEPS Terminal in Corpus Christi and pursue exciting new business opportunities in Canada.”\nFrom EnCap Flatrock Midstream\n“This is our second successful realization with Rangeland,” said EnCap Flatrock Midstream Managing Partner and Founder Bill Waldrip. “Chris Keene and Steve Broker were early to recognize the midstream opportunities in the Delaware Basin and first to market in 2014 with what soon became RIO’s comprehensive logistics platform. Rangeland management was early to recognize similar opportunities in the Bakken when we first backed them a little more than eight years ago. When you combine extraordinary vision with a team that has the ability to execute as well as the Rangeland team does, you have a recipe for success for our institutional investors and the Rangeland team. It’s been a great relationship, and we look forward to working with Rangeland for many years to come.”\nAdvisers\nRBC Capital Markets served as the sole financial adviser to Rangeland Energy with Managing Director, Energy Mergers & Acquisitions, Ali Akbar, and Managing Director and Head of Midstream Group Drew Horn leading the RBC team. Jones Day served as legal adviser to Rangeland Energy with Partner Omar Samji in the lead role. Thompson & Knight LLP served as legal counsel to EnCap Flatrock Midstream with Partner Sarah E. McLean leading the firm’s legal team. McGuireWoods LLP provided legal counsel to Andeavor, led by Partners Anthony J. Carna and Craig Culbertson.\nAbout Rangeland Energy\nRangeland Energy is headquartered in Sugar Land, Texas, with regional offices in Loving, New Mexico; Midland, Texas; and Calgary, Alberta. Rangeland Energy was formed in 2009 to focus on developing, acquiring, owning and operating midstream infrastructure for crude oil, natural gas, natural gas liquids and other petroleum products. The company is primarily focused on emerging shale plays across North America with an emphasis on the Delaware Basin in West Texas, the Gulf Coast and Canada. The Rangeland team represents more than 300 years of combined midstream experience and is backed by equity commitments from EnCap Flatrock Midstream . Visit www.rangelandenergy.com for more information.\nAbout EnCap Flatrock Midstream\nEnCap Flatrock Midstream provides value-added growth capital to proven management teams focused on midstream infrastructure opportunities across North America. The firm was formed in 2008 by a partnership between EnCap Investments L.P. and Flatrock Energy Advisors. Based in San Antonio with offices in Oklahoma City and Houston, EnCap Flatrock is led by Managing Partners and Founders William D. Waldrip, Dennis F. Jaggi and William R. Lemmons, Jr., Managing Partners Gregory C. King and David J. Kurtz, and Partner Dennis McCanless. The firm manages investment commitments of nearly $6 billion from a broad group of prestigious institutional investors. EnCap Flatrock is currently making commitments to new management teams from EFM Fund III, a $3 billion fund. For more information please visit www.efmidstream.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005387/en/\nFor Rangeland Energy and EnCap Flatrock Midstream:\nTEN|10 Group\nCasey Nikoloric\nManaging Principal\n303.433.4397, x101 o\n303.507.0510 m\ncasey.nikoloric@ten10group.com\nSource: Rangeland Energy", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.efmidstream.com%2F&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=EnCap+Flatrock+Midstream&index=2&md5=40529990e05f9ee6b5c1fc1c9b3360af", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.andeavor.com%2F&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=Andeavor&index=3&md5=7e20b4718fb556873e188e38a07a3cdd", "http://www.businesswire.com/news/home/20180103005387/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rangelandenergy.com%2F&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=Rangeland+Energy&index=1&md5=b6c77f079b206596b1a34bc2bdd6b1d7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rangelandenergy.com%2Foperations%2Fsteps&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=STEPS&index=5&md5=f5ad75f3464463c679dd653811d51068", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.encapinvestments.com&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=EnCap+Investments+L.P.&index=8&md5=e172571e4ece1fd5ca3ae4455d4cc335", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rangelandenergy.com%2Foperations%2Frio-system&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=RIO+System&index=4&md5=aaac0c858cffd8f79c45443b9e32f28f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.efmidstream.com&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=www.efmidstream.com&index=9&md5=3fcfe055a9138849c23c24edd1177166", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.efmidstream.com&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=EnCap+Flatrock+Midstream&index=6&md5=3b6be277feaf358c19b48111590c8e54", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rangelandenergy.com&esheet=51737014&newsitemid=20180103005387&lan=en-US&anchor=www.rangelandenergy.com&index=7&md5=2da0a79064937dbdf9155090c1ed1a35"], "published": "2018-01-03T16:10:00.000+02:00", "crawled": "2018-01-03T18:42:26.000+02:00", "highlightTitle": ""}