{"organizations": [], "uuid": "44ff21aa7ea09ea8578ea954b91b0e1ea9eff9d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-dyntek-announces-results-for-the-second-quarter-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "DynTek Announces Results for the Second Quarter Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T20:00:00.000+02:00", "replies_count": 0, "uuid": "44ff21aa7ea09ea8578ea954b91b0e1ea9eff9d6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-dyntek-announces-results-for-the-second-quarter-fiscal-year-2018.html", "ord_in_thread": 0, "title": "DynTek Announces Results for the Second Quarter Fiscal Year 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "newport beach", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWPORT BEACH, Calif., Jan. 25, 2018 (GLOBE NEWSWIRE) -- DynTek, Inc. (OTC:DYNE) , a leading provider of professional technology services , today announced results for its fiscal year 2018 second quarter ended December 31, 2017.\nSecond Fiscal Quarter 2018 Ended December 31, 2017\nDynTek reported revenues of $37,918,000 for the second fiscal quarter ended December 31, 2017, an increase of $1,819,000 or 5.0%, from $36,099,000 in the prior year second quarter ended December 31, 2016. Gross profit was $6,501,000 for the second fiscal quarter ended December 31, 2017, an increase of $773,000 or 13.5%, from $5,728,000 in the prior year second quarter ended December 31, 2016. This quarter over prior year quarter revenue and gross profit increase is primarily due to large product orders in the Las Vegas region and a focus on higher margin services.\nTotal operating expenses were $5,567,000 in the second fiscal quarter ended December 31, 2017, an increase of $314,000 or 6.0%, as compared to $5,253,000 in the prior year second quarter ended December 31, 2016. This quarter over prior year quarter increase is primarily due to increased selling expenses in relation to increased revenues.\nDynTek reported EBITDA of $1,026,000 for the second fiscal quarter ended December 31, 2017, an increase of $461,000 or 81.6%, as compared to $565,000 in the prior year second quarter. Net income was $470,000 for the second fiscal quarter of 2018, or $0.20 per diluted share, an increase of $375,000, 391.2% and $0.16 per diluted share, over the net income of $96,000 and $0.04 per diluted share in the second fiscal quarter of 2017. The increases in EBITDA and net income as compared to prior year second quarter are primarily attributable to higher revenues and gross profit.\nYear-to-Date Period Ended December 31, 2017\nDynTek reported revenues of $85,911,000 for the six months ended December 31, 2017, an increase of $20,084,000 or 30.5%, from $65,827,000 in the prior six months ended December 31, 2016. Gross profit was $15,139,000 for the six months ended December 31, 2017, an increase of $4,133,000 or 37.6%, from $11,006,000 in the prior year six months ended December 31, 2016. These increases in year over year revenue and gross profit are primarily attributable to the quantity of large product orders in the North East and Las Vegas districts.\nTotal operating expenses were $13,893,000 in the six months ended December 31, 2017, an increase of $3,808,000 or 37.8%, as compared to $10,085,000 in the prior year six months ended December 31, 2016. This increase over prior year to date is due to higher stock compensation expense primarily related to the Company’s stock option buyback charge of $1,389,000 in the first fiscal quarter of 2018, and higher selling expenses in relation to increased revenue.\nDynTek reported EBITDA of $3,056,000 for the six months ended December 31, 2017, an increase of $1,947,000 or 175.5%, as compared to $1,109,000 in the prior year six months. Net income was $549,000 for the six months ended December 31, 2017, or $0.23 per diluted share, an increase of $367,000, 202.0% and $0.16 per diluted share, over the net income of $182,000 and $0.07 per diluted share in the prior six months ended December 31, 2016.\n“Our results are a clear indicator that our team is executing on our strategic plan with a focus on delivering higher-margin solutions,” said Ron Ben-Yishay, DynTek’s chief executive officer. “Cybersecurity products and services continue to be a key catalyst to our growth as our customers look for ways to prevent and detect security threats in their environments.”\nEBITDA\nThe Company defines EBITDA as net income from operations before interest, taxes, depreciation and amortization, and stock-based compensation. Other companies may calculate EBITDA differently. Although EBITDA is a widely used financial indicator of a company's ability to service debt, it is not a recognized measure for financial statement presentation under generally accepted accounting procedures (GAAP). EBITDA should not be considered in isolation or as superior or as an alternative to net income or to cash flows from operating activities as determined in accordance with GAAP. Nonetheless, the Company believes that EBITDA provides useful supplemental information for investors and others to measure operating performance, especially in situations where a company has significant non-cash operating expenses that are not indicative of core business operating results. EBITDA is widely used in the IT services industry to analyze comparable company performance, and management of the Company also uses EBITDA, in addition to GAAP information, as a measure of operating performance for assessing its business units.\nAbout DynTek\nDynTek is a leading provider of professional technology services to mid-market companies, such as state and local governments, educational institutions and commercial entities in the largest IT markets nationwide. From virtualization and cloud computing to unified communications and collaboration , DynTek provides professional technology solutions across the three core areas of our customers’ technical environment: Infrastructure/Data Center , Microsoft Platforms , End Point Computing . DynTek's multidisciplinary approach allows our clients to turn to a single source for their most critical technology requirements. For more information, visit http://www.dyntek.com .\nFollow Us Online:\nTwitter: @ DynTek\nDynTek on Facebook\nDynTek on LinkedIn\nForward Looking Statements\nThis press release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Investors are cautioned that forward-looking statements made in this press release, involve known and unknown risks and uncertainties that could cause actual results to materially differ from the forward-looking statements. Such risks and uncertainties include, among others, our success in reaching target markets for services and products in a highly competitive market; our ability to maintain existing customers and attract future customers; our ability to finance and sustain operations, including our ability to comply with the terms of the revolving line of credit and the Company’s other existing and future indebtedness; our ability to achieve profitability and positive cash flow from operations; our ability to maintain business relationships with IT product vendors; the size and timing of additional significant orders for our products and services and our ability to fulfill such orders; the continuing desire of state and local governments to outsource to private contractors and the availability of budgets to place orders for our products and services; our ability to retain skilled professional staff and certain key executives; the performance of our government and commercial technology services; and the continuation of general economic and business conditions that are conducive to outsourcing of IT services. We have no obligation to publicly revise any forward-looking statements to reflect anticipated or unanticipated events or circumstances occurring after the date of such statements.\nDYNTEK, INC. AND SUBSIDIARY CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (EBITDA presentation) (Unaudited, in thousands, except share and per share data) Quarter Ended December 31, Six Months Ended December 31, Quarter Ended December 31, Six Months Ended December 31, 2017 2017 2016 2016 REVENUES Product revenues $ 29,705 $ 70,541 $ 28,921 $ 50,235 Service revenues 8,214 15,371 7,178 15,592 TOTAL REVENUES 37,918 85,911 36,099 65,827 COST OF REVENUES Cost of products 24,553 57,839 24,058 41,719 Cost of services 6,864 12,933 6,312 13,102 TOTAL COST OF REVENUES 31,417 70,772 30,371 54,821 GROSS PROFIT 6,501 15,139 5,728 11,006 OPERATING EXPENSES Selling 4,439 9,638 4,219 8,122 General and administrative 1,095 4,190 989 1,872 Depreciation and amortization 33 65 45 91 TOTAL OPERATING EXPENSES 5,567 13,893 5,253 10,085 INCOME FROM OPERATIONS 934 1,246 475 921 EBITDA 1,026 3,056 565 1,109 OTHER INCOME (EXPENSE) Interest expense (150 ) (333 ) (317 ) (618 ) TOTAL OTHER EXPENSE (150 ) (333 ) (317 ) (618 ) INCOME BEFORE INCOME TAXES 784 913 158 303 Income tax provision (314 ) (365 ) (63 ) (121 ) NET INCOME $ 470 $ 549 $ 96 $ 182 NET INCOME PER SHARE: Basic $ 0.21 $ 0.24 $ 0.04 $ 0.08 Diluted $ 0.20 $ 0.23 $ 0.04 $ 0.07 WEIGHTED AVERAGE NUMBER OF SHARES: Basic 2,255,724 2,256,682 2,264,390 2,264,390 Diluted 2,320,249 2,340,162 2,432,789 2,442,124\nFor more information, contact:\nLinda Ford\nDynTek, Inc.\n949-271-6705\nlinda.ford@dyntek.com\nSource:DynTek Services, Inc.", "external_links": ["http://www.dyntek.com/business-technology-solutions/microsoft", "http://www.dyntek.com/it-solutions/systems-integration-consulting-services/advanced-infrastructure-services", "http://www.dyntek.com/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2c199a32-ab44-4069-9c7a-20c2556e3257", "http://www.facebook.com/dyntek", "http://www.dyntek.com/it-solutions/systems-integration-consulting-services/end-point-computing", "http://www.twitter.com/dyntek", "http://www.linkedin.com/company/dyntek", "http://www.dyntek.com/it-solutions/systems-integration-consulting-services/cloud"], "published": "2018-01-25T20:00:00.000+02:00", "crawled": "2018-01-25T20:34:43.002+02:00", "highlightTitle": ""}