{"organizations": [], "uuid": "3f383ecace88c6e1ab9f201cb7a047fcac418895", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/16/reuters-america-corrected-update-5-brent-oil-falls-by-1-but-demand-underpins-near-70barrel.html", "country": "US", "domain_rank": 767, "title": "CORRECTED-UPDATE 5-Brent oil falls by $1 but demand underpins near $70/barrel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:36:00.000+02:00", "replies_count": 0, "uuid": "3f383ecace88c6e1ab9f201cb7a047fcac418895"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/reuters-america-corrected-update-5-brent-oil-falls-by-1-but-demand-underpins-near-70barrel.html", "ord_in_thread": 0, "title": "CORRECTED-UPDATE 5-Brent oil falls by $1 but demand underpins near $70/barrel", "locations": [], "entities": {"persons": [{"name": "brent", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Fixes WTI price in paragraph five)\n* OPEC/Russia-led supply restraint has propped up crude\n* Goldman Sachs sees upside to its oil price forecast\n* Morgan Stanley, BoAML raise crude price forecasts\n* U.S. oil production has stalled due to icy weather\n* But U.S. output expected to break through 10 mln bpd soon\nLONDON, Jan 16 (Reuters) - Brent crude oil shed some of its recent gains by falling just over $1 a barrel on Tuesday but healthy demand underpinned prices near $70, a level not seen since 2014's market slump.\nPrices have been driven up by oil production curbs in OPEC nations and Russia, as well as strong demand thanks to healthy economic growth.\nBrent futures fell by $1.08, or 1.54 percent, to $69.18 per barrel by 1108 GMT. Traders said Brent was well supported overall at around $70.\nBrent hit $70.37 on Monday, a high from December 2014, when markets were at the beginning of a three-year decline.\nU.S. West Texas Intermediate (WTI) crude futures were at $63.87 a barrel, down 43 cents, or 0.67 percent. WTI hit a December 2014 peak of $64.89 in early trading.\n\"The market is hitting technical resistance. We need to see a confirmation of a true break past $70 a barrel,\" Olivier Jakob of Petromatrix consultancy said.\n\"There is lots of speculative length in WTI at the moment ... the force is from the U.S. market right now so we need the direction they give coming back from holiday.\"\nTrading was thin on Monday due to a holiday in the United States.\nOil has been pushed higher by an effort led by the Organization of the Petroleum Exporting Countries and Russia to withhold production since January last year. The cuts are set to last through 2018.\nReacting to the recent three-year high, Russian Energy Minister Alexander Novak said the oil market was not yet balanced and that the global deal to cut output should continue as the price rise could be due to cold weather.\nNovak maintained his $50-$60 a barrel forecast for 2018.\nThe restraint has coincided with healthy oil demand, pushing up crude by almost 15 percent since early December.\n\"This rally has been driven first by robust fundamentals, with strong demand growth and high OPEC compliance accelerating,\" U.S. bank Goldman Sachs said in a note.\n\"We see increasing upside risks to our $62 per barrel Brent and $57.5 per barrel WTI forecast for the coming months.\"\nOther U.S. banks, including Bank of America Merrill Lynch and Morgan Stanley, have upped their price forecasts.\nA factor holding back crude prices in 2017, the surge in U.S. production, has stalled at least temporarily due to icy winter weather.\nU.S. production <C-OUT-T-EIA> has fallen from 9.8 million barrels per day in December to 9.5 million bpd currently.\nHowever, most analysts still expect U.S. production to break through 10 million bpd soon.\n(Additional reporting by Henning Gloystein; Editing by Dale Hudson)", "external_links": [], "published": "2018-01-16T13:36:00.000+02:00", "crawled": "2018-01-17T00:40:06.001+02:00", "highlightTitle": ""}