{"organizations": [], "uuid": "91e0715690ae7d54f2efe59cd60fb12866ffe9eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-camposol-s-a-announces-that-merrill-lynch-pierce-fenner-smith-incorporated-has-launched-a-tender-offer-and-consent.html", "country": "US", "domain_rank": 767, "title": "Camposol S.A. Announces that Merrill Lynch, Pierce, Fenner & Smith Incorporated Has Launched a Tender Offer and Consent Solicitation for Any and All of Camposol S.A.'s outstanding 10.50% Senior Secured Notes due 2021", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.973, "site_type": "news", "published": "2018-01-31T06:07:00.000+02:00", "replies_count": 0, "uuid": "91e0715690ae7d54f2efe59cd60fb12866ffe9eb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-camposol-s-a-announces-that-merrill-lynch-pierce-fenner-smith-incorporated-has-launched-a-tender-offer-and-consent.html", "ord_in_thread": 0, "title": "Camposol S.A. Announces that Merrill Lynch, Pierce, Fenner & Smith Incorporated Has Launched a Tender Offer and Consent Solicitation for Any and All of Camposol S.A.'s outstanding 10.50% Senior Secured Notes due 2021", "locations": [], "entities": {"persons": [{"name": "pierce", "sentiment": "neutral"}, {"name": "merrill l", "sentiment": "neutral"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "camposol s.a.", "sentiment": "neutral"}, {"name": "merrill lynch", "sentiment": "neutral"}, {"name": "fenner & smith incorporated has launched", "sentiment": "neutral"}, {"name": "fenner & smith incorporated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 /PRNewswire/ -- Camposol S.A. (the \"Company\") announced today that Merrill Lynch, Pierce, Fenner & Smith Incorporated (the \"Offeror\" and the \"Solicitation Agent\") has commenced an offer to purchase for cash (the \"Tender Offer\") any and all of the Company's outstanding 10.50% Senior Secured Notes due 2021 (the \"Notes\") and a solicitation of consents (the \"Consents\") to amend the indenture relating to the Notes (the \"Consent Solicitation\"), upon the terms and subject to the conditions set forth in the Statement (as defined below).\nThe table below summarizes certain payment terms of the Tender Offer:\nD escription of Notes\nCUS IP/ ISIN Nos.\nOutstanding\nPrincipal Amount\nTender Offer\nConsideration (1)(2)\nEarly Tender\nPayment (1)\nTotal\nConsideration (1)(2)\n10.50% Senior Secured\nNotes due 2021\n134638A C9 /\nUS134638AC941\nP19189 AC6 /\nUSP19189AC692\nU.S.$147,490,000\nU.S.$1,057.19\nU.S.$30.00\nU.S.$1,087.19\n(1)\nPer U.S.$1,000 principal amount of Notes.\n(2)\nExcludes accrued interest, which will be paid in addition to the Tender Offer Consideration or the Total Consideration, as applicable.\nThe Tender Offer\nThe Tender Offer will expire at 11:59 p.m., New York City time, on February 27, 2018, unless extended or earlier terminated by the Offeror in its sole discretion (such date and time, including as extended or earlier terminated, the \"Expiration Date\"). The early tender deadline for the Tender Offer will be 5:00 p.m., New York City time, on February 12, 2018, or a later time if extended or earlier terminated by the Offeror in its sole discretion (such date and time, including as extended or earlier terminated, the \"Early Tender Date\"). Holders of the Notes must validly tender their Notes at or before the Early Tender Date in order to be eligible to receive the Early Tender Payment (as defined below) in addition to the Tender Offer Consideration (as defined below). Notes tendered may be withdrawn prior to 5:00 p.m., New York City time, on February 12, 2018, unless extended or earlier terminated by the Offeror in its sole discretion (such date and time, the \"Withdrawal Deadline\"), but not thereafter, except as required by applicable law.\nHolders of Notes who validly tender Notes in the Tender Offer and Consent Solicitation, and whose tender and delivery of Consents are accepted by the Offeror, will receive, in addition to accrued and unpaid interest, for each US$1,000 principal amount of Notes tendered, an amount in cash in U.S. dollars equal to:\nin the case of Notes tendered and related Consents delivered at or prior to the Early Tender Date, an amount equal to US$1,087.19 (the \"Total Consideration\"), consisting of (i) an amount equal to US$1,057.19 (the \"Tender Offer Consideration\"), plus (ii) an amount equal to US$30.00 (the \"Early Tender Payment\"); and in the case of Notes tendered and related Consents delivered after the Early Tender Date, but at or prior to the Expiration Date, the Tender Offer Consideration.\nThe terms and conditions of the Tender Offer and Consent Solicitation are set forth in an Offer to Purchase and Consent Solicitation Statement dated the date hereof (as it may be amended or supplemented from time to time, the \"Statement\"). The Offeror may amend, extend, terminate or withdraw the Tender Offer and Consent Solicitation.\nThe Offeror's obligation to accept for purchase and to pay for Notes validly tendered and not withdrawn pursuant to the Tender Offer is subject to the satisfaction or waiver of certain conditions, which are more fully described in the Statement.\nThe Consent Solicitation\nUnder the Consent Solicitation, the Solicitation Agent, on behalf of the Company, is soliciting Consents to certain Proposed Amendments (as defined below) to the indenture under which the Notes were issued. The Proposed Amendments would eliminate substantially all of the restrictive covenants, certain events of default and related provisions contained in the Indenture, as well as release the Subsidiary Guarantees and release all of the Collateral from the Liens securing the Notes (the \"Proposed Amendments\").\nHolders who desire to tender their Notes must deliver Consents to the Proposed Amendments and holders may not deliver Consents without tendering the related Notes.\nAdoption of the Proposed Amendments is conditioned, among other things, on the valid delivery to the tender agent appointed by the Company (named below) of the Consents of holders representing at least a majority in principal amount of the outstanding Notes on or prior to the Expiration Date held by persons other than the Company and its affiliates.\nSettlement\nSubject to the terms and conditions of the Tender Offer and Consent Solicitation being satisfied or waived and to the Offeror's right to amend, extend, terminate or withdraw the Tender Offer and Consent Solicitation, payment for all Notes validly tendered at or before the Early Tender Date and accepted for purchase by the Offeror will occur promptly following the Early Tender Date (the \"Early Settlement Date,\" which is expected to be the next business day immediately following after the Early Tender Date, but which may change without notice). Payment for all Notes validly tendered after the Early Tender Date and at or before the Expiration Date and accepted for purchase by the Offeror will occur promptly following the Expiration Date (the \"Final Settlement Date,\" which is expected to be next business day immediately following after the Expiration Date, but which may change without notice).\nHolders of Notes who validly tender and do not validly withdraw their Notes at or before the Early Tender Date and whose Notes are accepted for purchase by the Offeror will be eligible to receive the applicable Total Consideration set forth above, which includes the Early Tender Payment. Holders of Notes who validly tender their Notes after the Early Tender Date and at or before the Expiration Date and whose Notes are accepted for purchase by the Offeror will receive the applicable Tender Offer Consideration set forth above. In addition, Holders whose Notes are purchased in the Tender Offer will receive accrued and unpaid interest in respect of their purchased Notes from the last interest payment date to, but not including, (i) in the case of any Notes tendered at or before the Early Tender Date, the Early Settlement Date and (ii) in the case of any remaining Notes tendered after the Early Tender Date, the Final Settlement Date.\nThe Company has consented to the Offeror making the Tender Offer as described in the Statement. The Company is not making the Tender Offer. It is intended that the Notes purchased on the Early Settlement Date by the Offeror in the Tender Offer and Consent Solicitation will be exchanged by the Offeror with the Company for a decrease in the proceeds of the New Notes to be received by the Company from the initial purchaser in the new offering (the \"New Offering\") exempt from the registration requirements of the U.S. Securities Act of 1933, as amended (the \"Securities Act\") and the Peruvian Securities Market Law (Ley del Mercado de Valores).\nThe Offeror's obligation to accept for payment or purchase, and to pay (or cause to be paid), the Total Consideration or the Tender Offer Consideration, as applicable, for Notes validly tendered pursuant to the Tender Offer is in each case subject to, and conditioned upon, unless waived, among other things, the pricing of the New Offering on terms satisfactory to the Company and the purchase agreement for the New Offering not having been terminated prior to the Early Settlement Date. No assurance can be given that the pricing of the New Offering will occur, in which case the Offeror shall be entitled to terminate the Tender Offer and Consent Solicitation. Additional conditions to the Tender Offer and Consent Solicitation are described in the Statement. The Offeror may amend, extend, terminate or withdraw the Tender Offer and Consent Solicitation.\nThe Company has appointed Merrill Lynch, Pierce, Fenner & Smith Incorporated as the dealer manager for the Tender Offer and as the solicitation agent authorized to act on the Company's behalf for the Consent Solicitation. D.F. King & Co., Inc. has been appointed as the information and tender agent for the Tender Offer. Persons with questions regarding the Tender Offer and Consent Solicitation should contact Merrill Lynch, Pierce, Fenner & Smith Incorporated at (888) 292-0070 (toll-free) or (646) 855 8988 (collect). In addition, holders of Notes may contact their broker, dealer, commercial bank, trust company or other nominee for assistance concerning the Tender Offer and Consent Solicitation.\nThe Statement will be distributed to holders of Notes promptly. Holders who would like copies of the Statement may call the information and tender agent, D.F. King & Co., Inc., by calling toll-free at (800) 884-4725 (banks and brokers may call collect at (212) 269-5550) or by email at camposol@dfking.com .\nThis press release is for informational purposes only and is not a recommendation, an offer to purchase, or a solicitation of an offer to sell with respect to any securities. The Tender Offer and Consent Solicitation are being made solely pursuant to the Statement.\nThe Tender Offer and Consent Solicitation are not being made to, nor will tenders be accepted from or on behalf of, holders of Notes in any jurisdiction in which such offer or solicitation is not permitted by law or in which the person making such offer or solicitation is not qualified to do so or to any person to whom it is unlawful to make such offer or solicitation.\nThe notes offered pursuant to the New Offering have not been and will not be registered under the Securities Act, and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act.\nForward-Looking Statements\nThis release and the Statement contain statements which may constitute \" \". These are not based on historical facts, but instead represent only our belief regarding future events, many of which, by their nature, are inherently uncertain and outside our control. Words such as \"anticipate,\" \"believe,\" \"estimate,\" \"approximate,\" \"expect,\" \"may,\" \"intend,\" \"plan,\" \"predict,\" \"target,\" \"forecast,\" \"guideline,\" \"should,\" \"project\" and similar words and expressions are intended to identify . It is possible that our actual results may differ, possibly materially, from the anticipated results indicated in these . Forward-looking statements speak only as of the date they were made, and we undertake no obligation to update publicly or revise any after the date on which they are made in light of new information, future events and other factors.\nView original content: http://www.prnewswire.com/news-releases/camposol-sa-announces-that-merrill-lynch-pierce-fenner--smith-incorporated-has-launched-a-tender-offer-and-consent-solicitation-for-any-and-all-of-camposol-sas-outstanding-1050-senior-secured-notes-due-2021-300590830.html\nSOURCE Camposol S.A.", "external_links": ["http://www.prnewswire.com/news-releases/camposol-sa-announces-that-merrill-lynch-pierce-fenner--smith-incorporated-has-launched-a-tender-offer-and-consent-solicitation-for-any-and-all-of-camposol-sas-outstanding-1050-senior-secured-notes-due-2021-300590830.html"], "published": "2018-01-31T06:07:00.000+02:00", "crawled": "2018-01-31T07:35:03.011+02:00", "highlightTitle": ""}