{"organizations": [], "uuid": "451d1b94965fa9ec5bb9aefbb046a0f0a9b56703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/17/104114851-05_NUP_159972_0799.1910x1000.JPG", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/19/10-things-great-bosses-do-every-day.html", "country": "US", "domain_rank": 767, "title": "10 things great bosses do every day", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:52:00.000+02:00", "replies_count": 0, "uuid": "451d1b94965fa9ec5bb9aefbb046a0f0a9b56703"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/10-things-great-bosses-do-every-day.html", "ord_in_thread": 0, "title": "10 things great bosses do every day", "locations": [], "entities": {"persons": [{"name": "travis bradberry", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We've all heard the adage, \"People don't leave bad jobs; they leave bad bosses.\" It makes great fodder for after-work gripe sessions, but is there really any data to back the claim up? As it turns out, there's a ton.\nIn one study, 61 percent of those working for bad bosses said they were looking for another job, while just 27 percent of those working for good bosses were considering alternate employment. And here's one that's really startling: 65 percent of people with bad bosses said they've sometimes misrepresented the truth at work, compared to only 19 percent of those with good bosses. Just as great bosses bring out the best in us, bad bosses bring out the worst.\nMore from Travis Bradberry:\n7 things deeply intuitive people do differently\n6 things great leaders do differently\n6 toxic thoughts successful people quarantine\nGreat bosses change us for the better. They see more in us than we see in ourselves, and they help us learn to see it too. They dream big and show us all the great things we can accomplish.\n\"A good boss is a man who isn't worried about his own career but rather the careers of those who work for him.\" – H. S. M. Burns\nBeing a great boss obviously has a tangible value other than just being liked, but how do you know if you are one? And, if you're not, how do you get better?\nshow chapters What billionaire Mark Cuban learned about business from a terrible boss who fired him 9:45 AM ET Wed, 14 June 2017 | 01:02 When I ask audiences to describe the best and worst bosses they have ever worked for, they inevitably ignore innate characteristics (intelligence, extraversion, attractiveness, and so on) and instead focus on qualities that are completely under the boss's control, such as passion, insight, and honesty. This means that any of us can study the unique qualities of great bosses in order to learn and improve.\nA great boss shares information Have you ever worked for an information hoarder? Some bosses seem to think that every piece of information they share reduces their power and authority. In fact, just the opposite is true: great bosses know that sharing information empowers their employees, instead of diluting their own power.\nA great boss puts a lot of thought into hiring Bad bosses think nothing of hiring a jerk with great credentials because they're only interested in how that person will perform. Great bosses think of the entire team. They recognize that their current employees are going to have to work with the new hire every single day, and they look for someone who will complement the team holistically, rather than just fill in a certain skills gap.\nA great boss looks for and celebrates wins Great bosses don't have a \"Why should I praise you for doing your job?\" attitude. They look for reasons to praise their employees, both privately and publicly, and they take the time to celebrate milestones, instead of just driving everybody on to the next project or deadline. They understand that getting a paycheck doesn't cancel out that inherent need to feel valued and appreciated.\nA great boss respects your time Great bosses don't give you the impression that their time is more valuable than yours. They don't keep you waiting for scheduled meetings. They show up prepared and get to the point, instead of trying to impress you. And they don't goof off on your time. It's not that they're unwilling to have fun at work, but they don't do it at your expense, causing you extra stress or making it necessary for you to stay late to catch up.\nshow chapters Top Silicon Valley CEO coach: This is what separates the good bosses from the bad ones 10:56 AM ET Sun, 9 April 2017 | 00:58 A great boss is empathetic Bad bosses only see their employees from the perspective of how the employees reflect on them. If their employees are doing a great job, they look good; if their employees are performing poorly, they look bad. Great bosses, on the other hand, see their employees as more than just extensions of themselves. They're able to get inside their employees' skins and understand things from their perspective. That doesn't mean they're pushovers, or that they just say, \"Oh, sorry you're having a bad day; don't worry about that deadline.\" But it does mean that they recognize their employees are human and that they treat them as such.\nA great boss is accountable Bad bosses are quick to point the finger when something goes wrong. They'll throw their employees under the proverbial bus without a second thought. Great bosses understand that a large part of their job is being accountable for the team's performance. They know that this just goes along with accepting a managerial role. That doesn't mean that they don't offer the team feedback on what is going wrong, but it does mean that they take the blame publicly. Even privately, they see the team's failure as a failure of leadership on their part, and they act quickly to correct it.\nA great boss says thank you Bad bosses think the work their employees do is something the employees owe them. After all, they're getting paychecks, right? That's true — but great bosses look past work as a transactional relationship and realize that people are putting a huge part of themselves into the work they do. They say thank you, even if it is \"just part of the job.\"\nA great boss doesn't forget that people have lives outside of work Bad bosses tend to see people as one-dimensional: they show up and get the work done, and the boss doesn't have to worry about them again until the next day. Great bosses, on the other hand, never forget that work is just one facet of their employees' lives. They never forget that they have families, friends, hobbies, and other interests and obligations outside of work, and they don't infringe on their \"real\" lives — by asking someone to work late, for example — without a very good reason. And when they do have a good reason, they acknowledge that they're asking for a sacrifice and express their gratitude accordingly.\nshow chapters Marcus Lemonis: This is the communication tool business partners need to have 9:04 AM ET Tue, 14 March 2017 | 00:50 A great boss is a great communicator It seems like some bosses will do anything to avoid giving a straight answer. They don't want to say something they can be held accountable for later. Other bosses just don't want to be bothered with clear explanations and solid answers. Great bosses say what they mean and mean what they say — and they say it clearly, so that people don't have to read between the lines or try to guess their real meaning.\nA great boss creates leaders Have you ever noticed how sometimes all the promotions come from within one manager's team? That's no accident. Great bosses pull the very best out of their people. They inspire, coach, and lean into people's strengths, and when their employees are ready for new challenges, they gladly send them on their way.\nBringing it all together If you're currently a boss, is this how your employees would describe you? If not, you're leaving money, effort, and productivity lying on the table. You're also probably losing some good employees, if not to other jobs, then at least to disengagement and lack of interest.\nDr. Travis Bradberry is the award-winning co-author of the No. 1 best", "external_links": ["https://www.linkedin.com/pulse/six-things-great-leaders-do-differently-dr-travis-bradberry/?lipi=urn:li:page:d_flagship3_profile_view_base_post_details;L/KxotAySX+iDLC6Az+25w==", "https://www.linkedin.com/pulse/ten-things-great-bosses-do-every-day-dr-travis-bradberry/", "https://www.linkedin.com/pulse/six-toxic-thoughts-successful-people-quarantine-dr-travis-bradberry/?lipi=urn:li:page:d_flagship3_profile_view_base_post_details;L/KxotAySX+iDLC6Az+25w==", "https://www.linkedin.com/pulse/seven-things-deeply-intuitive-people-do-differently-bradberry/?lipi=urn:li:page:d_flagship3_profile_view_base_post_details;L/KxotAySX+iDLC6Az+25w==", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-19T17:52:00.000+02:00", "crawled": "2018-01-19T18:08:53.028+02:00", "highlightTitle": ""}