{"organizations": [], "uuid": "4898f9c8c46a4865bc0370f5a01645fe62dd0bf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/22/103961246-GettyImages-609066588.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/trump-lawyer-demands-a-retraction-over-michael-wolff-fire-and-fury-book.html", "country": "US", "domain_rank": 767, "title": "Trump lawyer demands a retraction over Michael Wolff Fire and Fury book", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.977, "site_type": "news", "published": "2018-01-04T17:29:00.000+02:00", "replies_count": 0, "uuid": "4898f9c8c46a4865bc0370f5a01645fe62dd0bf4"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/04/trump-lawyer-demands-a-retraction-over-michael-wolff-fire-and-fury-book.html", "ord_in_thread": 0, "title": "Trump lawyer demands a retraction over Michael Wolff Fire and Fury book", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "charles harder", "sentiment": "none"}, {"name": "henry holt", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A lawyer for President Donald Trump demanded on Thursday that the author and publisher of an explosive new book about the White House stop releasing material and retract and apologize for excerpts already published.\nIn a letter to journalist Michael Wolff and publisher Henry Holt & Co., lawyer Charles Harder accuses them of publishing \"false/baseless statements\" about the president. He makes claims including defamation and invasion of privacy related to the new book, \"Fire and Fury: Inside the Trump White House.\"\nThe book does is not set for release until Tuesday. Excerpts published Wednesday featured fiery Quote: s from former White House chief strategist Steve Bannon and potentially embarrassing depictions of life and work inside the White House.\n\"Mr. Trump hereby demands that you immediately cease and desist from any further publication, release or dissemination of the Book, the Article, or any excerpts or summaries of either of them, to any person or entity, and that you issue a full and complete retraction and apology to my client as to all statements made about him in the Book and Article that lack competent evidentiary support Wolff and Henry Holt and Company did not immediately respond to requests for comment,\" the letter reads.\nHarder also sent a cease and desist letter to Bannon over what he called \"disparaging\" comments about Trump and his family.\nIn comments revealed Wednesday, Bannon told Wolff that Donald Trump Jr.'s June 2016 meeting with a Russian lawyer was \"treasonous\" and \"unpatriotic.\" He also was Quote: d as saying there was \"zero\" chance that then-candidate Trump did not meet with the attendees.\nIn a remarkable statement Wednesday, Trump declared that his former key advisor had \"lost his mind.\"\nThe book also claims that Trump did not plan to win the 2016 presidential election, that a spokesman for his legal team quit when he thought the president might have obstructed justice and that Trump's top advisors have called him things like \"idiot\" and \"dumb as s--t.\"\nNBC News has not independently verified many of the explosive passages in the book.", "external_links": [], "published": "2018-01-04T17:29:00.000+02:00", "crawled": "2018-01-04T17:29:05.012+02:00", "highlightTitle": ""}