{"organizations": [], "uuid": "c7947638b4449efccc7136f51c592f19449fa083", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/houlihan-lokey-expands-with-quayle-munro/houlihan-lokey-expands-with-quayle-munro-buy-idUSL8N1PB348", "country": "US", "domain_rank": 408, "title": "Houlihan Lokey expands with Quayle Munro buy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:32:00.000+02:00", "replies_count": 0, "uuid": "c7947638b4449efccc7136f51c592f19449fa083"}, "author": "", "url": "https://www.reuters.com/article/houlihan-lokey-expands-with-quayle-munro/houlihan-lokey-expands-with-quayle-munro-buy-idUSL8N1PB348", "ord_in_thread": 0, "title": "Houlihan Lokey expands with Quayle Munro buy", "locations": [], "entities": {"persons": [{"name": "houlihan lokey", "sentiment": "negative"}, {"name": "quayle munro", "sentiment": "negative"}, {"name": "christopher", "sentiment": "negative"}, {"name": "tulleken", "sentiment": "none"}, {"name": "mcqueen", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "ifr", "sentiment": "none"}, {"name": "leonardo & co", "sentiment": "none"}, {"name": "new boathouse capital", "sentiment": "none"}, {"name": "spink", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:35 AM / in 4 minutes Houlihan Lokey expands with Quayle Munro buy Christopher Spink 3 Min Read \nLONDON, Jan 16 (IFR) - Houlihan Lokey has agreed to buy data and software advisory specialist Quayle Munro for an undisclosed sum, another large step in its plan to build out its corporate finance capability in Europe. \nThe move will add 40 advisers to Houlihan Lokey and accelerates the US-listed firm’s plans to beef up its services outside its home market, a stated intention when it floated on the New York Stock Exchange in August 2015. \nIn that year the firm carried out a couple of significant European acquisitions, buying consumer boutique McQueen and the German, Dutch and Spanish parts of Italian investment bank Leonardo & Co. That helped it increase headcount across Europe by 50% to 150. \nSince then it has made a number of hires but the purchase of Quayle Munro will speed up the process. The firm was founded in 1983 and has itself made a number of acquisitions, including media boutique van Tulleken and New Boathouse Capital in the late 2000s. \nNew Boathouse Capital was set up by Peter Norris, former chief executive of Barings’ investment bank when the division failed following trading losses by Nick Leeson. New Boathouse’s major client was Richard Branson’s Virgin Group. \nNorris subsequently became chairman of Virgin in 2009. He remains in that position and is a non-executive director of Quayle Munro. It is not clear if he will remain involved after its acquisition by Houlihan Lokey. \nAs well as data and analytics, Quayle Munro advises clients in financial services, financial technology and education. One of its largest deals last year was advising shareholders including private equity firm EQT on the €3bn sale of Bureau van Dijk to Moody’s. \nIt also advised Pollen Street and BC Partners on their successful £861m cash bid, via Marlin Bidco, for UK challenger bank Shawbrook. \nHoulihan Lokey said the deal will allow it to establish a data and analytics presence in Europe and expand its financial institutions practice in the region. The former will be headed by Andrew Adams, current chief executive of Quayle Munro. He will also be co-head of Houlihan’s UK corporate finance business. \n“The Quayle Munro team is an excellent fit with Houlihan Lokey, and the establishment of the new data & analytics group represents our recognition of the expertise and new capabilities our clients around the world will increasingly require as their businesses grow and evolve,” said Scott Adelson, global co-head of corporate finance. (Reporting by Christopher Spink)", "external_links": [], "published": "2018-01-16T13:32:00.000+02:00", "crawled": "2018-01-16T13:49:35.002+02:00", "highlightTitle": ""}