{"organizations": [], "uuid": "65b3ee6c272857b9526ead57e10835c16b6e7861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/sri-lanka-bond-cenbank/sri-lanka-c-bank-suspends-four-officers-over-alleged-bond-irregularities-idUSL4N1P72DD", "country": "US", "domain_rank": 408, "title": "CORRECTED-Sri Lanka c.bank suspends four officers over alleged bond irregularities", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:34:00.000+02:00", "replies_count": 0, "uuid": "65b3ee6c272857b9526ead57e10835c16b6e7861"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/sri-lanka-bond-cenbank/sri-lanka-c-bank-suspends-four-officers-over-alleged-bond-irregularities-idUSL4N1P72DD", "ord_in_thread": 0, "title": "CORRECTED-Sri Lanka c.bank suspends four officers over alleged bond irregularities", "locations": [], "entities": {"persons": [{"name": "maithripala sirisena", "sentiment": "none"}], "locations": [{"name": "sri lanka", "sentiment": "none"}, {"name": "colombo", "sentiment": "none"}], "organizations": [{"name": "central bank of sri lanka", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Removes extra word in 2nd paragraph and corrects 11th paragraph to say commission’s report was not presented to parliament on Wednesday)\nCOLOMBO, Jan 12 (Reuters) - Sri Lanka’s central bank said it has suspended four officers and taken disciplinary action against several others following alleged irregularities in a 2015 government bond auction.\nIn a statement Thursday night, the monetary authority also said it has initiated several legislative changes aimed at preventing irregularities arising in connection with future bond issues.\nLast week, President Maithripala Sirisena said a commission investigating the 2015 bond sales has recommended legal action against the finance minister and the central bank governor at the time.\nThe Central Bank of Sri Lanka statement said it has taken measures to improve the management and control of public debt and the government pension fund, and is studying the commission’s recommendations.\n“The central bank has already implemented some of the recommendations therein, while measures have already been initiated to implement most of the other recommendations,” it said.\n“The Monetary Board has consulted the Attorney General, as appropriate, in the actions it has taken.”\nIn the 2015 auction, more than half of the bonds were sold to Perpetual Treasuries Ltd, a subsidiary of a company owned by the son-in-law of then-central bank governor Arjuna Mahendran.\nSirisena said the presidential commission of inquiry concluded that Perpetual Treasuries made profits through illegal means, and it blamed the bank governor and other officials.\nMahendran, his son-in law and Perpetual Treasuries have denied any wrongdoing.\nIn its statement, the central bank also said that it will initiate measures to carry out forensic audits on the issuance of Treasury bonds during the 2008 to 2014 and the Treasury bond auctions held in March 2016, as recommended by the commission.\nSeveral legislators were injured in a fistfight on Wednesday that broke out as opposition parties and a faction of the ruling coalition demanded the report be presented in the parliament as promised earlier. The commission report was not debated on Wednesday, as it had not been presented to parliament.\nOpposition lawmakers have alleged the bond auction cost the state more than $1 billion because of rising borrowing costs. ($1 = 153.50 Sri Lankan rupees) (Reporting by Ranga Sirilal; Editing by Shihar Aneez and Richard Borsuk)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T16:34:00.000+02:00", "crawled": "2018-01-13T14:38:37.012+02:00", "highlightTitle": ""}