{"organizations": [], "uuid": "9df5641465fb5e23dba11fc53e4d1de7d38527e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-rise-led-by-financials-nz-up-idUSL4N1PO029", "country": "US", "domain_rank": 408, "title": "Australian shares rise, led by financials; NZ up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T02:59:00.000+02:00", "replies_count": 0, "uuid": "9df5641465fb5e23dba11fc53e4d1de7d38527e4"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-rise-led-by-financials-nz-up-idUSL4N1PO029", "ord_in_thread": 0, "title": "Australian shares rise, led by financials; NZ up", "locations": [], "entities": {"persons": [{"name": "michael mccarthy", "sentiment": "none"}], "locations": [{"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "westpac banking corp", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "aditya soni  jan", "sentiment": "none"}, {"name": "commonwealth bank of australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "cmc markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Aussie shares up 0.4 pct\n* Banks gain the most and oil prices support energy stocks\n* NZ shares up 0.2 percent as telecom and utilities firm\nBy Aditya Soni\nJan 29 (Reuters) - Australian shares firmed on Monday, led by financials, taking a cue from Wall Street which closed at record levels after strong earnings reports.\nBoosted by the latest round of earnings including Intel and AbbVie, the three main U.S. indexes climbed to record closing highs on Friday.\n“Clearly positive leads from U.S. markets are helping the Australian share market, so it is no surprise to see the bounce” said Michael McCarthy, chief market strategist at CMC Markets.\nThe S&P/ASX 200 index rose 0.4 percent or 25.00 points to 6,075.00 by 0044 GMT. The benchmark closed marginally lower on Thursday.\nAustralian banks rose, following their U.S. counterparts, with the financial index climbing 0.4 percent.\nCommonwealth Bank of Australia (CBA) rose 0.5 percent, while Westpac Banking Corp firmed 0.7 percent.\nCBA, Australia’s largest lender by market cap, named retail banking head Matt Comyn as chief executive on Monday. The bank said its Comyn’s appointment seeks to maintain the bank’s operational continuity while trying to improve its reputation amid challenging trading conditions.\nHealthcare was among the top performing sectors, with CSL Ltd and Australian shares of Resmed Inc hitting record highs.\nEnergy stocks also showed gains, underpinned by higher oil prices.\nOil prices settled higher on Friday after hitting three-year highs, with crude also posting a weekly gain as a weaker U.S. dollar underpinned prices.\nOil and gas company Woodside Petroleum Ltd rose 0.9 percent to a two-week high, on track for fourth session of consecutive gains.\n“Energy stocks are definitely rising on the back of the rally in oil prices, though the focus in the sector could also be reflecting the fact that we have had a takeover bid in the sector with Mitsui out of Japan bidding for AWE,” added McCarthy.\nJapan’s Mitsui & Co made a $481 million offer to buy Australia’s AWE Ltd, trumping bids from two other companies that are all vying for a stake in the promising onshore Waitsia gas field.\nShares of AWE Ltd surged 16.5 percent to a near two and a half year high after the bid.\nOn the other hand, real estate stocks were the biggest drags, with Westfield Corp falling 0.4 percent, while Scentre Group dipped 1.2 percent.\nMaterials stocks gained slightly despite a fall in commodities prices, with global miner Rio Tinto Ltd rising 0.2 percent.\nAcross the Tasman Sea, the benchmark New Zealand S&P/NZX 50 index rose 0.2 percent or 12.31 points to 8,323.73.\nSpark New Zealand Ltd rose 1.3 percent, accounting for most of the profits, while Meridian Energy climbed 1.1 percent.\nReporting by Aditya Soni in Bengaluru; Editing by Eric Meijer\n ", "external_links": [], "published": "2018-01-29T02:59:00.000+02:00", "crawled": "2018-01-29T03:27:39.009+02:00", "highlightTitle": ""}