{"organizations": [], "uuid": "adc5f5ac29a6243346b188f4712c12b86ac58765", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223114853&w=1200&r=LYNXMPEE0H1PD", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/us-usa-misconduct-metoo/growing-pains-for-metoo-as-ansari-tale-sparks-backlash-talk-idUKKBN1F72RA", "country": "US", "domain_rank": 408, "title": "Growing pains for #MeToo as Ansari tale sparks backlash talk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:01:00.000+02:00", "replies_count": 0, "uuid": "adc5f5ac29a6243346b188f4712c12b86ac58765"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-misconduct-metoo/growing-pains-for-metoo-as-ansari-tale-sparks-backlash-talk-idUKKBN1F72RA", "ord_in_thread": 0, "title": "Growing pains for #MeToo as Ansari tale sparks backlash talk", "locations": [], "entities": {"persons": [{"name": "ansari", "sentiment": "negative"}, {"name": "weinstein", "sentiment": "none"}, {"name": "aziz ansari", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 7:04 PM / Updated 6 hours ago Growing pains for #MeToo as Ansari tale sparks backlash talk Jill Serjeant 4 Min Read \nLOS ANGELES (Reuters) - Less than four months after the #MeToo movement inspired a national conversation about sexual misconduct and led to the downfall of dozens of powerful American men, a backlash seems to be underway. \nWomen are divided among themselves, men are beginning to speak out, and words like “revenge porn” and “witch hunt” are turning up in opinion pieces and on social media. \nInspired by multiple accusations, including rape, against film producer Harvey Weinstein in October 2017, millions of women took to social and mainstream media to share stories of sexual harassment or assault, using the #MeToo hashtag. Weinstein has denied having non-consensual sex with anyone. \nBut one unidentified woman’s account last weekend of a 2017 date with “Master of None” comedian Aziz Ansari that she said left her feeling violated, prompted fierce debate about whether sexual assault and bad sex were being conflated. \nAnsari said he believed their sexual activity was completely consensual. “When I heard that it was not the case for her, I was surprised and concerned. I took her words to heart and responded privately,” the actor said in a statement. \nJust 10 days after a Golden Globes ceremony where celebrities dressed in black en masse in support of harassment victims - and Ansari won the award for best actor in a TV musical or comedy series - New York Times writer Bari Weiss penned an opinion piece calling the Ansari article “arguably the worst thing that has happened to the #MeToo movement since it began.” \nAuthor Caitlyn Flanagan called the woman’s story “3,000 words of revenge porn” and the Washington Post’s Alyssa Rosenberg wrote that #MeToo could founder in acrimony without a “distinction between criminal acts and merely unattractive or immoral behavior.” ONE STEP FORWARD, TWO STEPS BACK? \nThose who have been fighting for equality for decades see such misgivings as internal struggles that are to be expected in the early stages of mass movements for change. \n“I don’t think it’s a backlash. I think it’s a moment of deep struggle. Women are finally being heard and men are finally listening. This is not going to be easy and people are going to get things wrong,” said Melissa Silverstein, founder of the Women and Hollywood blog. \nAuthor Jessica Valenti, founder of the blog Feministing.com, had less patience with critics. \n“When someone says they don’t want #MeToo to be ‘derailed’ or ‘muddied,’ all I hear is that they don’t want to do the hard thinking necessary for a nuanced cultural shift,” Valenti tweeted. \nThe divisions are not limited to Hollywood, which has been hardest hit by the misconduct scandal, nor to women. \nActress Catherine Deneuve made headlines last week in an open letter with 99 other French women that said #MeToo amounted to Puritanism and was fueled by a hatred of men. \nMen, who have mostly confined their remarks to generalized expressions of support for women, are beginning to speak out. \nAlec Baldwin described growing sentiment against director Woody Allen and his movies as “unfair and sad.” Allen on Thursday again denied an accusation that he molested his step daughter Dylan Farrow in 1992 and said she was using the sexual misconduct scandal to renew her allegation. \n“Wall Street” actor Michael Douglas last week took the unusual step of denying a misconduct allegation before it was published, saying he “felt the need to get ahead of this.” \nSilverstein said the differing points of view are necessary conversations in the long term goal for female equality and respect. \n“For anyone to think this is over, they are sorely mistaken. This is just the beginning. We need to buckle up and keep pushing forward,” she said. Reporting by Jill Serjeant; Editing by Marguerita Choy", "external_links": [], "published": "2018-01-18T21:01:00.000+02:00", "crawled": "2018-01-19T03:48:14.001+02:00", "highlightTitle": ""}