{"organizations": [], "uuid": "c22c51cfb9bc7538e0e902c194aff47c8468f192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-cyber-threat-alliance-elects-rapid7-ceo-corey-thomas-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Cyber Threat Alliance Elects Rapid7 CEO Corey Thomas to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:00:00.000+02:00", "replies_count": 0, "uuid": "c22c51cfb9bc7538e0e902c194aff47c8468f192"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-cyber-threat-alliance-elects-rapid7-ceo-corey-thomas-to-board-of-directors.html", "ord_in_thread": 0, "title": "Cyber Threat Alliance Elects Rapid7 CEO Corey Thomas to Board of Directors", "locations": [], "entities": {"persons": [{"name": "corey thomas", "sentiment": "negative"}, {"name": "thomas", "sentiment": "none"}, {"name": "michael daniel", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "fortinet", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "palo alto networks", "sentiment": "none"}], "organizations": [{"name": "cta", "sentiment": "negative"}, {"name": "symantec", "sentiment": "none"}, {"name": "rsa", "sentiment": "none"}, {"name": "sk infosec", "sentiment": "none"}, {"name": "cisco", "sentiment": "none"}, {"name": "sophos", "sentiment": "none"}, {"name": "mcafee", "sentiment": "none"}, {"name": "check point software technologies ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 10, 2018 (GLOBE NEWSWIRE) -- The Cyber Threat Alliance (CTA) today announced the election of Corey Thomas, president and Chief Executive Officer (CEO) of Rapid7 (NASDAQ:RPD), a leading provider of analytics solutions for security and IT operations, to the organization’s board of directors. Charter members Fortinet, McAfee, Palo Alto Networks, Symantec, Check Point Software Technologies Ltd. and Cisco, along with Affiliate members IntSights, Rapid7, RSA, Saint Security, SK Infosec, and Sophos, elected Thomas to join the board and support the CTA’s mission of promoting threat intelligence sharing among the cybersecurity community.\nThe CTA has experienced substantial growth since its incorporation in 2017, adding former cybersecurity advisor to President Obama, Michael Daniel, as its president and CEO, and expanding globally through the addition of three new affiliate members, SK Infosec, Sophos, and Saint Security. With 14 members onboard, the organization held its first election for seats on the Board of Directors that are reserved for affiliate member representatives. These positions are elected by CTA member peers, and join the charter members’ Directors on the board.\n“As the alliance grows in membership and experience, the quality of the intelligence being shared is steadily improving. A significant factor in our success is the leadership and commitment provided by our Board of Directors,” said Michael Daniel, President and CEO of the CTA. “The addition of Corey Thomas to the already stellar leaders on our Board of Directors will strengthen the organization as a whole. Rapid7’s participation on the Board, and their dedication to thoughtful information sharing, will enhance the useful and actionable insights shared with our members’ customer base, and, over the long-term, create a more secure world.”\nIn addition to being president and CEO of Rapid7, Thomas is also a member of the Rapid7 board of directors and the board of Blue Cross Blue Shield of Massachusetts, serving on its audit and health care quality and affordability committees. Thomas has more than 15 years of experience in leading companies to the next stage of growth and innovation. His previous positions include VP of marketing at Parallels, Inc., a virtualization technology company, group project manager of the Microsoft Server and Tools division, launching the worldwide availability of SQL Server 2005 and steering product planning for Microsoft’s data platform, and a consultant at Deloitte Consulting. Thomas received a B.E. in electrical engineering and computer science from Vanderbilt University and a MBA from Harvard Business School.\n“The CTA’s mission to share actionable intelligence among the security community and defend against cyber adversaries is extremely important in today’s cybersecurity landscape,” said Thomas. “Only through collaboration will we be able to truly understand our adversaries, and create increased security for all. I’m excited to take on a leadership role that will help drive us forward on our mission to create long-term, systemic disruption to malicious actors.”\nAbout Cyber Threat Alliance\nThe CTA, founded by Check Point Software Technologies Ltd., Cisco, Fortinet, McAfee, Palo Alto Networks and Symantec, is an independent, not-for-profit organization that also includes IntSights, Rapid7, Reversing Labs, RSA Security, Saint Security, SK Infosec, Sophos and Telefónica's ElevenPaths. The Cyber Threat Alliance is the industry's first formally organized group of cybersecurity practitioners that work together in good faith to share threat information and improve global defenses against advanced cyber adversaries. CTA's mission is to facilitate the sharing of actionable intelligence and situational awareness about sophisticated cyber threats to improve its members' cyber defenses, more effectively disrupt malicious cyber actors around the world, and raise the level of cybersecurity throughout the Internet and cyberspace. The alliance is continuing to grow on a global basis, enriching both the quantity and quality of the information that is being shared across the platform. The CTA is actively recruiting additional regional players to enhance information sharing to enable a more secure future for all.\nFor more information about the CTA, please visit: http://cyberthreatalliance.org/ .\nMedia Contact:\nMariah Gauthier\nHighwire PR for Cyber Threat Alliance\nCTA@highwirepr.com\nPhone: 951-314-0760\nSource:Cyber Threat Alliance", "external_links": ["https://www.globenewswire.com/Tracker?data=LNJgiSLmUKV31_WPsrvBHEVGtx23vZcD8PI_ehSnDo5HvUy4-7akeSHxlfk5uC-tq0aqsFYunRH02QWwMtclVn-lNQ-82M78GBObISiM3Z68NDalUo_CIcpcmegiLbiy", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f00fa6c0-2436-49b9-a326-787a49e9e269", "http://cyberthreatalliance.org/", "https://www.globenewswire.com/Tracker?data=gDZdstes3CqL5zkIFXqWi3RS-Swhb8gcN0M8N0M7OlfLLmX8DokVSle0HLMtbJfG81qNFBLDFApI7dOX9KY5GVIi1ZUA-7JA4h7OE-wipaQ="], "published": "2018-01-10T14:00:00.000+02:00", "crawled": "2018-01-10T16:31:30.019+02:00", "highlightTitle": ""}