{"organizations": [], "uuid": "92d0ad3c18cd95e6c7524d281f94a4595a9aa138", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-philippines-regulator-ico/philippine-sec-warns-investors-be-cautious-with-initial-coin-offerings-idUSKBN1EY0UD", "country": "US", "domain_rank": 408, "title": "Philippine SEC warns investors: Be cautious with initial coin offerings", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T11:09:00.000+02:00", "replies_count": 0, "uuid": "92d0ad3c18cd95e6c7524d281f94a4595a9aa138"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-regulator-ico/philippine-sec-warns-investors-be-cautious-with-initial-coin-offerings-idUSKBN1EY0UD", "ord_in_thread": 0, "title": "Philippine SEC warns investors: Be cautious with initial coin offerings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - The Philippines’ Securities and Exchange Commission on Tuesday warned investors to exercise caution when invited to participate in initial coin offerings (ICOs) involving cryptocurrencies.\nThe warning came after it discovered that “certain companies, individuals or groups of persons” have been enticing the public to participate in ICOs through social media and their websites and to buy the corresponding virtual currency.\nAn ICO is the first sale of a virtual currency to the public, usually for the purpose of raising capital for start-up companies or funding independent projects.\nThe SEC warning follows a similar move last month by the Philippine central bank, which has also flagged risks of investing in virtual currencies.\n“We do not endorse virtual currency as a currency because it is not a currency,” Melchor Plabasan, a central bank deputy director, said then.\nThe Philippine central bank is seeking to regulate virtual currency exchanges amid the increasing usage of cryptocurrencies, particularly in money remittances and payments.\nChina has banned ICOs in a move to stop illegal fundraising and pyramid schemes, while the U.S. Securities and Exchange Commission has warned that many promoters of ICOs and other cryptocurrency investments in the United States were not following securities laws.\nThe Philippine SEC said that from information it gathered, “some of these new virtual currencies, based on the facts and circumstances surrounding their issuance, follow the nature of a security”.\n“However, unlike ordinary securities, these virtual currencies are neither guaranteed by any Central Bank nor backed by any commodity,” it said.\nThe regulator said any sale of securities, including virtual currencies, must be duly registered, and the company or its agents making an offer must have the license to sell them.\nUnlicensed companies, groups or persons who invite or recruit people to join or invest in ICOs or offer investment contracts or securities to the public may be held criminally liable, it said.\nReporting by Enrico dela Cruz; Editing by Richard Borsuk\n ", "external_links": [], "published": "2018-01-09T11:09:00.000+02:00", "crawled": "2018-01-09T11:24:08.011+02:00", "highlightTitle": ""}