{"organizations": [], "uuid": "8667ef484175fcc61a4f354583e7a8a1cdefed8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sovos-brands-hires-butler-shine-stern-partners-bssp-and-current-marketing-to-spearhead-advertising-and-pr.html", "country": "US", "domain_rank": 767, "title": "Sovos Brands Hires Butler, Shine, Stern & Partners (BSSP) And Current Marketing To Spearhead Advertising And PR", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.098, "site_type": "news", "published": "2018-01-04T21:03:00.000+02:00", "replies_count": 0, "uuid": "8667ef484175fcc61a4f354583e7a8a1cdefed8e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sovos-brands-hires-butler-shine-stern-partners-bssp-and-current-marketing-to-spearhead-advertising-and-pr.html", "ord_in_thread": 0, "title": "Sovos Brands Hires Butler, Shine, Stern & Partners (BSSP) And Current Marketing To Spearhead Advertising And PR", "locations": [], "entities": {"persons": [{"name": "rao", "sentiment": "none"}, {"name": "hatch", "sentiment": "none"}, {"name": "priscilla tuan", "sentiment": "none"}, {"name": "michael angelo", "sentiment": "none"}, {"name": "sov", "sentiment": "none"}], "locations": [{"name": "berkeley", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "sovos brands hires butler", "sentiment": "negative"}, {"name": "sovos brands", "sentiment": "negative"}, {"name": "stern & partners", "sentiment": "negative"}, {"name": "butler, shine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERKELEY, Calif., Jan. 4, 2018 /PRNewswire/ -- Sovos Brands , a new food and beverage company with a mission to acquire and build one-of-a-kind brands, announces the appointment of Butler, Shine, Stern & Partners (BSSP) and Current Marketing to lead advertising and public relations respectively, across the consumer packaged goods company's growing portfolio of brands.\n\"Finding one-of-a-kind brands is core to the Sovos business model. This approach carries through to our ambition for marketing and communications,\" said Priscilla Tuan, Senior Vice President of Marketing, Sovos Brands. \"With BSSP and Current Marketing joining Hatch our brands are in the best hands. The collective wealth of experience, creativity and fresh take on our brands is remarkable. We're excited to collaborate across disciplines to drive big-idea-thinking, with breakthrough campaigns that tell our unique brand stories and showcase our delicious genuine Italian food, made with clean ingredients. We can't wait to unveil the work behind Michael Angelo's frozen entrees and Rao's pasta sauce , as we invest to grow Sovos Brands.\"\nHeadquartered in Berkeley, California, Sovos Brands focuses on growing high-quality food and beverage brands in on-trend categories, with strong potential for accelerated growth. The first executions of the company's new marketing push will see BSSP and Current Marketing unite on national campaigns for both Michael Angelo's and Rao's. BSSP will lead TV, digital and print efforts, with Current Marketing driving PR and influencer outreach.\n\"Everyone at BSSP is thrilled to be working on such great brands and with an inspired group of clients and agency partners. These brands and clients deserve work that will drive the business and get consumers talking,\" said Patrick Kiss, President, BSSP.\nThe two agencies join Hatch , the fellow San Francisco-based branding and creative agency, who will lead design work for Sovos Brands, beginning with a new packaging design for Michael Angelo's in January 2018. The three agencies remit encompasses Michael Angelo's Gourmet Foods, Rao's Specialty Foods and potential future brands in the Sovos Brands portfolio.\nSOVOS BRANDS\nSovos Brands is a new kind of food and beverage company with a mission to acquire and build one-of-a-kind brands. Its portfolio includes Michael Angelo's Gourmet Foods, a leading producer of premium, authentic frozen Italian entrées, and Rao's Specialty Foods, a producer of premium pasta sauces and other Italian specialty foods. Sovos Brands has the soul of a startup, the experience of an industry leader and the financial backing of Advent International, one of the world's largest private equity firms. The company has a one-of-a-kind approach to brands, business and people. In fact, the only thing that's old school about the business is the name, inspired by the old Latin term sovos, which means unique or one-of-a-kind. This vision leads the company's focus on people and brands, working to ensure that both can really thrive. Find out more about Sovos Brands at www.sovosbrands.com .\nBUTLER, SHINE, STERN & PARTNERS\nBSSP ( www.bssp.com ) is a full-service communications agency based in Sausalito, CA, providing marketing services to brands and companies including Mitsubishi Motors, Nature Made Vitamins, 2K Sports, Greyhound, Premier Protein, PowerBar, Blue Shield of California, FootJoy, Sovos Brands and others. Adweek named BSSP Small Agency of the Decade, and Outside Magazine has consistently recognized the agency as one of the Best Places to Work in America.\nCURRENT MARKETING\nLaunched in 2006, Current is owned by The Interpublic Group of Companies (IPG) with offices in New York, Chicago, Los Angeles and San Francisco. At Current, we believe in real lives over lifestyles. We create genuine connections between brands and people, which help change behavior and move brands forward. Our proprietary approach uncovers truths about people that reflect how they really live and behave. We translate those insights into public relations, digital and social media campaigns that people are drawn to, support and share because they represent them in genuine, authentic ways. Find out more about Current Marketing at www.talktocurrent.com .\nHATCH\nHatch ( https://thehatchagency.com ) crafts brands that move people to affection. They help clients grow by appealing to people on an emotional, unguarded and lasting level. Since opening its doors in 2007, Hatch has developed brand strategies, identities, packaging and marketing for brands including Benefit Cosmetics; Coca-Cola, Smartwater, Vitaminwater, Seagram's; Credo Beauty; Dang Foods; Dolby; Google; JAQK Cellars; Krave Jerky; New Belgium Brewery; Simple Mills; Smashmallow; Thrive Algae; Wingtip; Williams-Sonoma; and many others. All trademarks, product names, and brands are property of their respective owners.\nMedia Contact:\nSamantha Williams\nCurrent Marketing\n415.262.5931\nswillliams@talktocurrent.com\nView original content: http://www.prnewswire.com/news-releases/sovos-brands-hires-butler-shine-stern--partners-bssp-and-current-marketing-to-spearhead-advertising-and-pr-300577772.html\nSOURCE Sovos Brands", "external_links": ["http://www.prnewswire.com/news-releases/sovos-brands-hires-butler-shine-stern--partners-bssp-and-current-marketing-to-spearhead-advertising-and-pr-300577772.html", "http://www.talktocurrent.com/", "https://thehatchagency.com/", "https://www.raos.com/", "http://bssp.com/", "http://www.michaelangelos.com/", "https://bssp.com/#!/welcome", "http://www.sovosbrands.com/", "http://thehatchagency.com/", "http://talktocurrent.com/"], "published": "2018-01-04T21:03:00.000+02:00", "crawled": "2018-01-04T22:51:33.002+02:00", "highlightTitle": ""}