{"organizations": [], "uuid": "0e4cdc839c542e628681a516438978205d7a60c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224489324&w=1200&r=LYNXMPEE0M14K", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-twitter-moves-coo/twitter-coo-anthony-noto-resigns-to-join-online-lender-sofi-idUSKBN1FC1W7", "country": "US", "domain_rank": 408, "title": "Twitter COO Anthony Noto resigns to join online lender SoFi", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:17:00.000+02:00", "replies_count": 0, "uuid": "0e4cdc839c542e628681a516438978205d7a60c5"}, "author": "", "url": "https://www.reuters.com/article/us-twitter-moves-coo/twitter-coo-anthony-noto-resigns-to-join-online-lender-sofi-idUSKBN1FC1W7", "ord_in_thread": 0, "title": "Twitter COO Anthony Noto resigns to join online lender SoFi", "locations": [], "entities": {"persons": [{"name": "anthony noto", "sentiment": "negative"}, {"name": "anil d'silva", "sentiment": "none"}, {"name": "noto", "sentiment": "none"}, {"name": "arjun panchadar", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "twitter coo anthony noto", "sentiment": "negative"}, {"name": "sofi", "sentiment": "negative"}, {"name": "social finance inc", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "twitter inc", "sentiment": "none"}, {"name": "sofi reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:21 PM / in an hour Online lender SoFi nabs Twitter executive Noto as CEO Anna Irrera , Arjun Panchadar 5 Min Read \n(Reuters) - Wall Street banker turned Silicon Valley executive Anthony Noto has left Twitter Inc ( TWTR.N ) to become chief executive officer of online lender Social Finance Inc, the companies said on Tuesday. \nThe move sowed fresh doubts that the microblogging site will be able to pull off an ambitious turnaround plan and eventually make a profit, and renewed speculation about SoFi possibly pursuing an initial public offering. \nNoto started on Wall Street just before the dot-com bubble burst and eventually became a top tech banker at Goldman Sachs Group Inc ( GS.N ), handling the IPO of then-Silicon Valley darling Twitter. \nHe became Twitter’s chief financial officer months after the November 2013 IPO, and was promoted to chief operating officer in 2016 when his predecessor quit. \nBut Twitter’s perceived fortunes have turned during Noto’s time there, with analysts and investors raising questions about its plans for growth and eventual profitability. \nThough Twitter expects to turn a corner soon, it has yet to make a quarterly profit, losing $2.5 billion from the start of 2012 through the third quarter of 2017. The company has come under fire for issues including how it handles harassment on its platform as well as errors it disclosed in how it counted users. \nNoto had worked to add video and create a better advertising platform. And he was the Twitter executive most responsible for assuring Wall Street that better days were ahead, Wells Fargo analyst Peter Stabler said. \n“We view the departure as a key loss for Twitter,” Stabler wrote in a research note on Tuesday, echoing the view of several analysts. \n“In his absence, we believe the company will need to elevate the visibility of another key operating executive to address investors, as we believe Twitter continues to face significant challenges in its turnaround strategy.” \nTwitter did not announce a replacement, but said Noto’s responsibilities will be absorbed by other executives. Twitter CEO Jack Dorsey, who is also CEO of payments processor Square Inc ( SQ.N ), called Noto “an incredible advocate” for the company and thanked him for his work. \nTwitter shares fell 2.5 percent to $22.76 in afternoon trading. The stock is still well above an August low of $15.67, but below its IPO price of $26. \nTWITTER‘S LOSS, SOFI‘S GAIN \nNoto may be a welcome arrival at SoFi, where a sexual harassment scandal erupted in September that was followed by the departure of its prior CEO and a rethink of its business model. \nSoFi launched in 2011 as an online lender that primarily refinanced student loans for young, affluent borrowers. But it soon expanded into a range of financial services, from mortgage lending to hedge fund investing. \nIt had threatened to upend traditional lenders by applying for a U.S. banking license and appealing to young customers by hosting happy hours and match-making events. \nSoFi’s valuation soared along with its ambitions. The company was worth $4.3 billion as of its last round of funding in February 2017. \nBut in September, then-CEO Mike Cagney left the company following an investigation into claims that current and former employees were sexually harassed at work. Efforts to reach Cagney for comment at the time were unsuccessful, and a representative for Cagney did not comment on Tuesday. \nThat departure threw SoFi’s strategy into doubt, along with the timing of an IPO that many investors and analysts had been expecting. In October, it withdrew its application for a banking license. \nNoto on Tuesday signaled he would look to return SoFi to its prior aspirations. \n“SoFi has a significant opportunity to build on its leadership position in student and personal loans to revolutionize consumer finance and build a next-generation financial services company,” he said in a statement. \nThe company might revisit its banking application in light of Noto’s arrival, Joanne Bradford, SoFi’s chief marketing officer, told Reuters at an event on Tuesday. \nAt the event, SoFi said it has opened a waiting list for its no-fees deposit account service called SoFi Money partnered with headhunting firm Korn Ferry to offer career counseling services to its clients, and would launch a chat service for members on its mobile app. \nTom Hutton, an investor in SoFi who had served as interim CEO, said Noto’s experience made him the perfect fit. Hutton will become non-executive chairman on March 1, when Noto takes on his new role. Reporting by Arjun Panchadar and Muvija M in Bengaluru, additional reporting by David Ingram in San Francisco; writing by Lauren Tara LaCapra; Editing by Meredith Mazzilli", "external_links": [], "published": "2018-01-23T16:17:00.000+02:00", "crawled": "2018-01-23T16:26:04.016+02:00", "highlightTitle": ""}