{"organizations": [], "uuid": "ab25478274e2c4a857ff7e13c517d9466622711d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-904966564.jpg", "site_section": "http://news.google.com/news?hl=en&tok=Ueiah6PIMCzoHf7CCgJUvQ&ds=n&pq=technology&cp=2&gs_id=9&xhr=t&q=apple&newwindow=1&gl=us&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "apple - Google News", "url": "http://fortune.com/2018/01/18/trump-deserves-fair-share-of-credit-for-apple-moves/", "country": "US", "domain_rank": 1196, "title": "Trump Deserves 'Fair Share' of Credit for Apple Moves - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:32:00.000+02:00", "replies_count": 0, "uuid": "ab25478274e2c4a857ff7e13c517d9466622711d"}, "author": "", "url": "http://fortune.com/2018/01/18/trump-deserves-fair-share-of-credit-for-apple-moves/", "ord_in_thread": 0, "title": "Trump Deserves 'Fair Share' of Credit for Apple Moves - Fortune", "locations": [], "entities": {"persons": [{"name": "adam lashinsky", "sentiment": "negative"}, {"name": "elon musk", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Lashinsky 10:32 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nThere was a time when Silicon Valley proudly wore its libertarian streak as a badge of honor. Technology was more powerful than ideology or politics. If only the government would leave us alone, we’ll be just fine, thank you. A perfect example was Microsoft’s (msft) tardy realization of the need to have lobbyists. Faced with a massive antitrust case, which it ultimately won, Microsoft lawyered and lobbyist-ed up bigly. \nNowadays even those who continue to publicly rail against the government acknowledge its influence. Elon Musk is a poster child for disruptive independence—even as each of his businesses benefits from generous government subsidies, contracts, or other incentives. Google (googl) flinches every time a bureaucrat in Brussels hiccups. Facebook (fb) rightly has become pre-occupied with the views of governments worldwide. \nEven mighty Apple , famous for going its own way, is bowing down now, not so much to the realities of government regulation as the jawboning of a president who talks a lot about—but so far hasn’t done much to further—protectionist policies. Apple (aapl) said Wednesday it’ll pay a giant tax bill, hire oodles of Americans, and massively increase its planned investment in “advanced” manufacturing in the U.S. ( The Wall Street Journal has a good summary here .) \nThese are other worthy and in some cases inevitable actions. (The tax move is in response to the new tax law.) In some cases it’s impossible to separate Apple’s new claims from existing plans. Its new campus for customer-service operations is at once a modest echo of Amazon’s (amzn) HQ 2.0 plan and a welcome repatriation of a service that annoys domestic customers. Moreover, if the White House is the ultimate bully pulpit and Trump the loudest bully to occupy it, he deserves more than his fair share of credit for the results he’s getting. \nThe rhetoric of Apple’s move is certain to please the “America First” crowd. Never mind that the term is an odious nod to an isolationist and anti-immigrant movement from the last century. Americans who find comfort in such talk buy iPhones too. Apple has a fiduciary duty to solicit their business. \n*** \nJust last week I noted that Jim Hackett’s grandiose and impressive vision for Ford (f) might not survive an economic downturn. That might have been too generous. Tuesday Ford issued a worrisome earnings outlook ; its shares declined 7% Wednesday. This is either troubling news for Hackett or his last opportunity to blame bad news on his predecessor. These things usually happen more quickly than anyone predicts. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-18T17:32:00.000+02:00", "crawled": "2018-01-18T21:59:03.004+02:00", "highlightTitle": ""}