{"organizations": [], "uuid": "42145b785321132dce06d18ccd505bfc5f34edf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FZ324_wr_old_ZG_20171130112130.jpg", "site_section": "", "section_title": "", "url": "https://www.wsj.com/articles/an-entrepreneur-builds-a-business-selling-old-phones-1511752141", "country": "US", "domain_rank": 387, "title": "This entrepreneur is ringing up sales restoring vintage telephones - MarketWatch", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.205, "site_type": "news", "published": "2017-12-07T06:58:00.000+02:00", "replies_count": 0, "uuid": "42145b785321132dce06d18ccd505bfc5f34edf3"}, "author": "Bonnie Miller Rubin", "url": "https://www.wsj.com/articles/an-entrepreneur-builds-a-business-selling-old-phones-1511752141", "ord_in_thread": 0, "title": "This entrepreneur is ringing up sales restoring vintage telephones - MarketWatch", "locations": [], "entities": {"persons": [{"name": "marketwatch", "sentiment": "negative"}, {"name": "woodbury", "sentiment": "none"}, {"name": "bonnie miller rubin", "sentiment": "none"}, {"name": "don woodbury", "sentiment": "none"}], "locations": [{"name": "kingston", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "negative"}, {"name": "western electric", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Dec 7, 2017 4:58 a.m. ET Share \nCollectors and Hollywood buyers are snapping them up OldPhoneWorks.com This chrome-plated Western Electric 302 model from the 1930s sells for $449.95 at Old Phone Works. \nBy Bonnie Miller Rubin \nWhen Don Woodbury opened a cellphone store in 2001, he included a few old phones as part of the décor, reflecting the historic district where the business was located. \nSoon customers were asking to purchase the vintage models. “They’d just come up to me and say, ‘I want one of those.’ It didn’t take me long to realize that there was a good internet market for this stuff,” Woodbury says. \nSome 16 years later, Oldphoneworks.com , based in Kingston, Ontario, has grown to become one of the biggest sellers of antique phones, whether it’s the “candlestick” style familiar from old films and TV shows or the clunky desk models that were fixtures at grandma’s house. \nWoodbury’s base is a small but loyal group of collectors with a taste for nostalgia, along with a handful of people looking to buy old models in bulk, such as movie producers trying to conjure up the past and hotel moguls looking to add a touch of uniqueness to rooms. \n“It’s kind of amazing that we’ve been able to create a viable business from repurposing and redeploying obsolete technology that would otherwise end up in the trash,” says the 59-year-old Woodbury, who sold his 50-store cellphone chain in 2013. \nMany small companies have done very well by selling niche products that have long since been put out to pasture, whether it’s vinyl records, typewriters or anything else that captures people’s fancy. \nAlso read: Old technology that’s worth bringing back—and not for the nostalgia \nFor some entrepreneurs, vintage sales are a sideline. Dr. Jonathan Finder started Oldphones.com 16 years ago when he was a young physician, and the second income helped him pay off student loans. \nNow his job as a pediatric lung specialist keeps him from putting in the time to acquire new customers. And a downturn in landline sales has hurt business. \nBut he keeps at it, in no small part because he’s an unabashed fan of the craftsmanship and history of his merchandise. “How many electromechanical objects that are 50 to 70 years old do exactly what they did when they were first made?” Finder says. “The phones of the ’30s and ’40s outclass anything on the market today.” A new calling \nFor other entrepreneurs, like Woodbury, retro devices are their sole focus. The market for these phones would seem pretty small to build a business on. Two groups—the Antique Telephone Collectors Association and Telephone Collectors International—have only 1,125 members total. \nDon’t miss: This is the vintage technology some companies are using to store your data \nYet buyers have been eager enough not only to keep Woodbury’s operation afloat but allow it to thrive, even enough to support a four-person staff. Revenue, he says, can hit 50,000 Canadian dollars (roughly US$39,000) in a good month, and though he doesn’t track long-term growth, he says that sales have shown a consistent year-to-year increase since the beginning. \nWhen original equipment is unavailable, the company uses reproduction parts—such as cloth-covered cords—manufactured in its own workshop. Additionally, Oldphoneworks.com has the capability to repair and refurbish models that aren’t in its inventory, a service that accounts for about 10% of the company’s revenue. \nWoodbury’s customers are both “repeat buyers; people who are going through their collection and want to upgrade, so they’ll come to us to order the one part they need,” he says, and “a lot of one-offs, where someone Googles us because they need parts.” \nTypically, Woodbury gets his inventory from individuals or estates looking to liquidate their collections. His average telephone sale is $250, a healthy return on his average investment of $50, not counting the cost of labor for refurbishing. Prices usually range from $100 to as much as $8,000 for a rare model, such as the 1905 Strowger Candlestick, the first commercially available dial telephone. \n(A Kansas City undertaker, Almon Strowger, believed that the only local operator was steering business calls to his competitor, who also happened to be her husband. So he invented dial service, bypassing operator intervention.) OldPhoneWorks.com Hello! This Strowger Candlestick dial phone goes for $7,999. \n“A phone like that may sit there for five years, but eventually someone will buy it,” Woodbury says. “If people really want something, they’re willing to pay for it. You just have to be patient.” \nTo build consumer trust, he offers a one-year, repair-or-replace warranty—which gives him an edge over garage sales and flea markets, where the mantra is “Let the buyer beware.” He also says he can offer items in bulk, which is difficult for other dealers. A trunk line \nThe company doesn’t do much marketing. Mostly it involves making sure customers can find 20th-century technology using 21st-century methods. General manager Matt Jennings, 31, makes updating social media a top priority, trying to land the company at the top of Google rankings in their category. \nWhen he answered a help-wanted ad two years ago, he didn’t know a spit-cup receiver from an F1 handset. “I thought I’d be repairing cellphones. I certainly didn’t think this would be much of a market,” he says. “After my first day, I realized I was wrong.” \nBeth Howe, like many buyers, found her way to Oldphoneworks by googling. She isn’t a collector, but lusted after a Western Electric 500—the phone of her childhood—for her Topanga, Calif., home. \n“I have fond memories of avocado-green kitchen appliances,” Ms. Howe says. “Maybe it’s just reaching adulthood that has made me nostalgic for the late ’60s, early ’70s design sensibility.” \nAn online search brought her to the site, and she fell hard for a dark red Western Electric 302 instead. Last produced in 1954, the phone’s sleek lines and distinctive chime made the model a staple of Hollywood’s Golden Age. \n“I thought, what fun to have a phone, not from my own childhood era, but from that classic period,” says Ms. Howe, a visual-effects production supervisor, who worked on the recently released film “Blade Runner 2049.” \n“I was especially enamored of the matching textile cord…and the clickety, clickety, clack of the dialing mechanism and the ringer, which is as good as a time machine to transport me back,” she says. \nYou might like: How to value the stuff you inherited A starring role \nOther regular clients are the TV and movie industries, which account for 15% of the firm’s revenue. \n“It’s just been building on its own,” Woodbury says. Recently, he says, “we got calls from two different production companies on the same day asking us to rush phones that they need on the set.” \nJess Royal, set decorator for the Netflix NFLX, -0.39% series “Stranger Things,” calls the company her “go-to source.” \n“It’s super hard to find a whole bunch of phones in working condition, such as ones that all light up for a police station scene,” she says. “They’ve been great for us.” \nAlso read: 5 strange things about ‘Stranger Things’ season 2 \nWhen a certain style Woodbury has supplied appears on the screen, his staff will see an immediate blip in sales. \n“We won’t sell any red pay phones for ages, then, all of a sudden, we’ll sell four in a day,” he says. \nA big order came in recently from", "external_links": [], "published": "2017-12-07T06:58:00.000+02:00", "crawled": "2018-01-01T10:18:32.004+02:00", "highlightTitle": ""}