{"organizations": [], "uuid": "8d3dbdb858b909168107ecfc9440b7423da08f26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220336410&w=1200&r=LYNXMPEE071AG", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-britain-eu-tax/britain-pledges-to-ease-business-fears-over-brexit-import-tax-idINKBN1EX22P", "country": "US", "domain_rank": 408, "title": "Britain pledges to ease business fears over Brexit import tax", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:53:00.000+02:00", "replies_count": 0, "uuid": "8d3dbdb858b909168107ecfc9440b7423da08f26"}, "author": "", "url": "https://in.reuters.com/article/us-britain-eu-tax/britain-pledges-to-ease-business-fears-over-brexit-import-tax-idINKBN1EX22P", "ord_in_thread": 0, "title": "Britain pledges to ease business fears over Brexit import tax", "locations": [], "entities": {"persons": [{"name": "mel stride", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The British government pledged on Monday to ease the potential harm to more than 100,000 companies that may have to pay sales tax upfront on goods imported from the European Union for the first time after Brexit.\nThe Canary Wharf financial district is seen at dusk in London, Britain, November 17, 2017. REUTERS/Toby Melville The changes included in a new taxation bill, one of many Brexit laws passing through parliament, have alarmed company bosses, who said the move would create cashflow problems and increase the cost of doing business.\n“It is an issue, (for) which the government and the Treasury has sympathy,” Mel Stride, a junior Treasury minister, said during a debate in parliament. “It is something that we will be closely looking at.”\nBusiness groups have warned that consumers are likely to suffer higher prices and companies may have to take out costly bank or insurance backed guarantees if they are forced to pay the tax upfront.\nAny British company that imports goods ready for sale from the EU can currently register with the government to bring them in without paying so-called Value-Added Tax (VAT) upfront. They register the tax and it is only added to the price of the product whenever it is sold to the final customer.\nUnless the government negotiates a deal where Britain can remain part of the EU-VAT area, companies may have to pay the tax when importing goods.\nNicky Morgan, chair of the Treasury committee, said during the debate her committee is planning to investigate the issue.\nFor some businesses “finding upfront cash in order to pay for that would be a real problem,” she said.\nThe Treasury said in a statement it recognized the cashflow benefits for companies under existing arrangements.\n“The government will take this into account when considering potential changes following EU exit and will look at options to mitigate any cash flow impacts,” the statement said.\nReporting by Andrew MacAskill; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-08T20:53:00.000+02:00", "crawled": "2018-01-08T21:27:10.011+02:00", "highlightTitle": ""}