{"organizations": [], "uuid": "2a66cafec73714c2d9204d5ec260b397c2f9b0f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-cia-officer/ex-cia-officer-arrested-for-retaining-classified-information-idUKKBN1F52SG", "country": "US", "domain_rank": 408, "title": "Ex-CIA officer arrested for retaining classified information", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:14:00.000+02:00", "replies_count": 0, "uuid": "2a66cafec73714c2d9204d5ec260b397c2f9b0f5"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-cia-officer/ex-cia-officer-arrested-for-retaining-classified-information-idUKKBN1F52SG", "ord_in_thread": 0, "title": "Ex-CIA officer arrested for retaining classified information", "locations": [], "entities": {"persons": [{"name": "jerry chun shing lee", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "none"}, {"name": "u.s. justice department", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "john f. kennedy international airport", "sentiment": "none"}, {"name": "central intelligence agency", "sentiment": "none"}, {"name": "u.s. attorney’s office for the eastern district of virginia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 10:01 PM / Updated 19 minutes ago Ex-CIA officer arrested for retaining classified information Sarah N. Lynch 3 Min Read \nWASHINGTON (Reuters) - A former Central Intelligence Agency officer was arrested at a U.S. airport on Monday night in connection with charges that he illegally retained highly classified information, the U.S. Justice Department said Tuesday. \nJerry Chun Shing Lee, a U.S. citizen who now lives in Hong Kong, used to maintain a top secret clearance and began working for the CIA in 1994. \nThe Justice Department said FBI agents searched his hotel rooms in 2012, during trips to Virginia and Hawaii. They discovered he had two small books containing handwritten information on details such as the true names and numbers of spy recruits and covert CIA employees. \nHe was arrested at John F. Kennedy International Airport in New York. \nThe case is being prosecuted by the U.S. Attorney’s Office for the Eastern District of Virginia. But Lee made his first court appearance on Tuesday before a federal magistrate judge in Brooklyn. The judge ordered Lee held without bail. \nA federal public defender who represented Lee at the hearing declined to comment. \nAn affidavit filed by an FBI agent showed that Lee, 53, served in the U.S. Army from 1982 through 1986 and worked for the CIA from 1994 through 2007. \nThe FBI agent wrote that Lee and his family left Hong Kong in August 2012 to travel to northern Virginia. Along the way, they stayed in hotels where the FBI found the books. \nThe books were discovered inside Lee’s luggage, sealed in a small clear plastic travel pack. \nThe handwritten information inside varied in terms of classification, but the agent said at least one page contained top secret information, “the disclosure of which could cause exceptionally grave damage to the national security of the United States”. \nThe agent also said that classified cables Lee wrote while he was a case officer describing his interactions with CIA assets were reflected in the two books. \nLee was interviewed by the FBI five separate times in 2013 and never disclosed he had the books. He also met former CIA colleagues around that time without returning the materials to the government, the Justice Department said. \nHong Kong media said Lee worked at Christie’s auction house in the Asian financial hub. A spokeswoman for the firm confirmed on Thursday it had suspended a Hong Kong employee pending a criminal investigation. \n“The allegations significantly pre-date his employment with the company,” she said, adding that the role he had for the last 20 months focused on physical security for facilities and staff. \nThe role was not linked to data security or IT functions at the company, she said, declining to provide further information. Reporting by Sarah N. Lynch in Washington; additional reporting by Farah Master in Hong Kong and Nate Raymond in Boston; Editing by Susan Thomas and Clarence Fernandez", "external_links": [], "published": "2018-01-18T09:14:00.000+02:00", "crawled": "2018-01-18T09:35:55.002+02:00", "highlightTitle": ""}