{"organizations": [], "uuid": "03e4e9240898d8cde66bb51ebbe8b3d87cfb4a9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-ocular-therapeutixtm-announces-closing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Ocular TherapeutixTM Announces Closing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:01:00.000+02:00", "replies_count": 0, "uuid": "03e4e9240898d8cde66bb51ebbe8b3d87cfb4a9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-ocular-therapeutixtm-announces-closing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Ocular TherapeutixTM Announces Closing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "common stock bedford", "sentiment": "none"}], "organizations": [{"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "piper jaffray & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEDFORD, Mass.--(BUSINESS WIRE)-- Ocular Therapeutix™, Inc. (NASDAQ: OCUL) today announced the closing of its underwritten public offering of 7,475,000 shares of its common stock at a public offering price of $5.00 per share. The shares of common stock issued and sold in the offering at the closing include 975,000 shares issued upon the exercise in full by the underwriter of its option to purchase additional shares at the public offering price, less underwriting discounts and commissions. The offering was made pursuant to a shelf registration statement that was previously filed with and declared effective by the Securities and Exchange Commission (SEC). All of the shares in the offering were sold by Ocular.\nThe aggregate net proceeds before expenses to Ocular from the offering are approximately $35.1 million, after deducting underwriting discounts and commissions.\nPiper Jaffray & Co. acted as sole manager and underwriter for the offering.\nOcular intends to use the net proceeds from the offering, together with its existing cash and cash equivalents, to fund the planned resubmission of its new drug application (NDA) for DEXTENZA, to fund the clinical development of OTX-TP, OTX-TIC and OTX-TKI, to fund additional preclinical and regulatory activities for its other product candidates, including through its collaboration with Regeneron, and for working capital and other general corporate purposes and pursuit of its other research and development efforts.\nThe prospectus supplement and the accompanying prospectus for the offering and the other documents the Company has filed with the SEC, which are incorporated by reference in the prospectus supplement and the accompanying prospectus for the offering, provide more complete information about the Company and the offering. An electronic copy of the prospectus supplement and the accompanying prospectus for the offering are available on the website of the SEC at www.sec.gov . Copies of the final prospectus supplement and the accompanying prospectus relating to this offering may be obtained by contacting Piper Jaffray & Co., Attention: Prospectus Department, 800 Nicollet Mall, J12S03, Minneapolis, MN 55402, by telephone: (800) 747-3924, or by email: prospectus@pjc.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities, in any state or jurisdiction in which such offer, solicitation or sale would be unlawful, prior to registration or qualification under the securities laws of any such state or jurisdiction. Offers will be made only by means of a prospectus supplement and the accompanying prospectus, forming a part of the registration statement.\nAbout Ocular Therapeutix, Inc.\nOcular Therapeutix, Inc. is a biopharmaceutical company focused on the development, manufacturing and commercialization of innovative therapies for diseases and conditions of the eye using its proprietary hydrogel-based formulation technology. Ocular Therapeutix’s lead product candidate, DEXTENZA™ (dexamethasone insert) 0.4 mg for intracanalicular use, has completed Phase 3 clinical development for the treatment of ocular pain and inflammation following ophthalmic surgery. OTX-TP (travoprost insert) is in Phase 3 clinical development for the reduction of intraocular pressure in patients with glaucoma and ocular hypertension. The Company’s earlier stage assets include OTX-TIC, a sustained release travoprost intracameral injection for the reduction in intraocular pressure in patients with glaucoma and ocular hypertension, as well as sustained release intravitreal injections for the treatment of retinal diseases. These injections include the development of OTX-TKI, a tyrosine kinase inhibitor (TKI), and, in collaboration with Regeneron, an extended release protein-based anti-vascular endothelial growth factor (VEGF) trap. Ocular Therapeutix's first product, ReSure® Sealant, is FDA-approved to seal corneal incisions following cataract surgery.\nForward Looking Statements\nAny statements in this press release about future expectations, plans and prospects for the Company, including the development and regulatory status of the Company’s product candidates, such as the Company’s anticipated use of proceeds of the offering, regulatory submissions for and the timing and conduct of, or implications of results from, clinical trials of DEXTENZA™ for the treatment of post-surgical ocular inflammation and pain, including with respect to manufacturing deficiencies identified by the Food and Drug Administration (FDA), the Company’s expectations regarding resubmitting its NDA to the FDA and the prospects for approvability of DEXTENZA for these indications, DEXTENZA for the treatment of allergic conjunctivitis, DEXTENZA for the treatment of dry eye disease and OTX-TP for the treatment of glaucoma and ocular hypertension, the ongoing development of the Company’s sustained release hydrogel depot technology, the potential utility of any of the Company’s product candidates, potential commercialization of the Company’s product candidates, the potential benefits and future operation of the collaboration with Regeneron Pharmaceuticals, including any potential future payments thereunder, the sufficiency of the Company’s cash resources and other statements containing the words \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend\", \"goal,\" \"may\", \"might,\" \"plan,\" \"predict,\" \"project,\" \"target,\" \"potential,\" \"will,\" \"would,\" \"could,\" \"should,\" \"continue,\" and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors. Such forward-looking statements involve substantial risks and uncertainties that could cause the Company’s clinical development programs, future results, performance or achievements to differ significantly from those expressed or implied by the forward-looking statements. Such risks and uncertainties include, among others, those related to the timing and costs involved in commercializing ReSure® Sealant or any product candidate that receives regulatory approval, the initiation and conduct of clinical trials, availability of data from clinical trials and expectations for regulatory submissions and approvals, the Company’s scientific approach and general development progress, the availability or commercial potential of the Company’s product candidates, the sufficiency of cash resources, the outcome of the Company’s ongoing legal proceedings and need for additional financing or other actions and other factors discussed in the “Risk Factors” section contained in the Company’s quarterly and annual reports on file with the Securities and Exchange Commission. In addition, the forward-looking statements included in this press release represent the Company’s views as of the date of this release. The Company anticipates that subsequent events and developments will cause the Company’s views to change. However, while the Company may elect to update these forward-looking statements at some point in the future, the Company specifically disclaims any obligation to do so. These forward-looking statements should not be relied upon as representing the Company’s views as of any date subsequent to the date of this release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006093/en/\nInvestors\nOcular Therapeutix\nDonald Notman\nChief Financial Officer\ndnotman@ocutx.com\nor\nWestwicke Partners\nChris Brinzey\nManaging Director\nchris.brinzey@westwicke.com\nor\nMedia\nOcular Therapeutix\nScott Corning\nVice President of Marketing & Commercial Operations\nscorning@ocutx.com\nSource: Ocular Therapeutix", "external_links": ["http://www.businesswire.com/news/home/20180129006093/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750480&newsitemid=20180129006093&lan=en-US&anchor=www.sec.gov&index=1&md5=a74eb215e0b8f10cbfa4c55aab0b7c60"], "published": "2018-01-30T00:01:00.000+02:00", "crawled": "2018-01-30T04:13:18.000+02:00", "highlightTitle": ""}