{"organizations": [], "uuid": "314fb873c23d2914ddce8e9db8cd63819b61cf5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224661950&w=1200&r=LYNXMPEE0N04J", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-olympics-2018-comfortwomen/japan-pm-abe-to-attend-pyeongchang-olympics-government-source-idUKKBN1FD02Q", "country": "US", "domain_rank": 408, "title": "Japan PM Abe says to attend Pyeongchang Olympics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:16:00.000+02:00", "replies_count": 0, "uuid": "314fb873c23d2914ddce8e9db8cd63819b61cf5a"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-comfortwomen/japan-pm-abe-to-attend-pyeongchang-olympics-government-source-idUKKBN1FD02Q", "ord_in_thread": 0, "title": "Japan PM Abe says to attend Pyeongchang Olympics", "locations": [], "entities": {"persons": [{"name": "abe", "sentiment": "negative"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "linda sieg", "sentiment": "none"}, {"name": "moon", "sentiment": "none"}, {"name": "chang-ran kim", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 44 AM / Updated 7 hours ago Japan PM Abe says to attend Pyeongchang Olympics Chang-Ran Kim , Linda Sieg 3 Min Read \nTOKYO (Reuters) - Japanese Prime Minister Shinzo Abe said on Wednesday he would attend the Pyeongchang Olympics in South Korea next month, after reports he would not attend due to a dispute over “comfort women” forced to work in Japan’s wartime military brothels. \nJapan and South Korea share a bitter history that includes Japan’s 1910-45 colonisation of the peninsula and the “comfort women” issue is especially touchy. \nAbe said he wanted to meet Moon during the visit to convey Japan’s stance that it cannot accept Seoul’s call for more steps to help the “comfort women”, as they are euphemistically known. \nUnder a 2015 deal, reached by Abe and Moon’s predecessor, Japan apologised to former “comfort women” and provided a 1 billion yen (6.4 million pounds) fund to help them. \nBut South Korea said this month the agreement failed to meet victims’ needs, calling for more steps. \n“I want to hold a summit meeting to firmly convey Japan’s stance on the agreement over the ‘comfort women’ issue,” Abe told reporters at the prime minister’s official residence. \nUnder the deal the two countries agreed that the issue would be “irreversibly resolved” if both fulfilled their obligations. Volunteers walk beside the Olympic rings at the Alpensia resort for the upcoming 2018 Pyeongchang Winter Olympic Games in Pyeongchang, South Korea, January 23, 2018. REUTERS/Fabrizio Bensch \nJapan, for its part, wants South Korea to remove statues commemorating Korean comfort women near its embassy in Seoul and the Japanese consulate in Busan city. Seoul says the memorials were erected by civic groups and therefore out of its reach. \n“The two governments of Japan and South Korea have discussed Prime Minister Abe’s visiting South Korea for the Pyeongchang Winter Olympics and welcome Japan’s decision to officially announce the visit,” South Korean President Moon Jae-in’s Blue House said in a statement ahead of Abe’s remarks to reporters. Japan's Prime Minister Shinzo Abe makes a speech at an opening of a new session of parliament in Tokyo, Japan January 22, 2018. REUTERS/Kim Kyung-Hoon \nAbe risks upsetting some in his conservative base with a decision to attend the Games given Seoul’s demands. \nMembers of a ruling Liberal Democratic Party (LDP) panel agreed on Wednesday to oppose the visit and said they planned to convey that stance to the premier later. \nAbe said he would also discuss the North Korean threat with Moon during his visit. \n“I also want to drive home the need for strong collaboration between Japan, South Korea and the United States to counter the North Korean threat, and to maintain what has been raised to the maximum level of pressure (against Pyongyang),” he said. \nTokyo has worried that intra-Korean talks on the North’s participation in the Games could drive a wedge between South Korea, on the one hand, and the United States and Japan, which both want to keep maximum pressure on Pyongyang, on the other. Additional reporting by Nobuhiro Kubo in TOKYO; Editing by Michael Perry", "external_links": [], "published": "2018-01-24T04:16:00.000+02:00", "crawled": "2018-01-24T04:48:54.005+02:00", "highlightTitle": ""}