{"organizations": [], "uuid": "76c0ec32134a23066ef0c82ab8c17d203a7ec6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/canada-stocks/canada-stocks-tsx-slips-as-gold-financial-shares-weigh-pot-stocks-bounce-idUSL1N1P31J6", "country": "US", "domain_rank": 408, "title": "CANADA STOCKS-TSX slips as gold, financial shares weigh; pot stocks bounce", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:33:00.000+02:00", "replies_count": 0, "uuid": "76c0ec32134a23066ef0c82ab8c17d203a7ec6d8"}, "author": "", "url": "https://www.reuters.com/article/canada-stocks/canada-stocks-tsx-slips-as-gold-financial-shares-weigh-pot-stocks-bounce-idUSL1N1P31J6", "ord_in_thread": 0, "title": "CANADA STOCKS-TSX slips as gold, financial shares weigh; pot stocks bounce", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "toronto stock exchange", "sentiment": "none"}, {"name": "eldorado gold corp", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nutrien ltd", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p/tsx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 9:34 PM / Updated 8 minutes ago CANADA STOCKS-TSX slips as gold, financial shares weigh; pot stocks bounce Reuters Staff \n(Adds details throughout and updates prices to close) \n* TSX closes down 31.79 points, or 0.19 percent, at 16,317.65 \n* Materials group falls 0.7 percent \n* Seven of the TSX’s 10 main groups end lower \nTORONTO, Jan 8 (Reuters) - Canada’s main stock index retreated on Monday as shares of some materials and financial services companies weighed, offset by gains for marijuana producers. \n* The Toronto Stock Exchange’s S&P/TSX composite index closed down 31.79 points, or 0.19 percent, at 16,317.65. \n* The index, which has rallied as much as 10 percent since August, posted a record high last week at 16,421.42. \n* The materials group, which includes precious and base metals miners and fertilizer companies, fell 0.7 percent as gold mining stocks lost ground. \n* Eldorado Gold Corp declined 6.3 percent to C$1.65, while the price of gold held below last week’s 3-1/2-month high and the U.S. dollar climbed. \n* Nutrien Ltd, the fertilizer company formed last week by a merger of Potash Corp of Saskatchewan and Agrium, was down 3.3 percent at C$66.85. \n* The financials group, which accounts for more than one third of the index’s weight, slipped 0.3 percent, with Manulife Financial Corp declining 0.6 percent to C$26.50 \n* WestJet Airlines Inc fell 2.0 percent to C$25.50 after one of its planes was involved in an on-ground collision at a Toronto airport late on Friday. Larger rival Air Canada was off 3.2 percent at C$23.88. \n* U.S. crude oil futures settled 0.5 percent higher at $61.73 a barrel, near their highest since May 2015. But the energy group slipped for the third straight session, down 0.1 percent. \n* Just three of the index’s 10 main groups ended in positive territory. Sharp gains for cannabis stocks helped the healthcare sector rise to its highest since January 2016. \n* Canopy Growth Corp rose 17.2 percent to C$39.86 and Aphria Inc was up 14.8 percent at $21.02. \n* Cannabis producers had dipped last week, capping a recent rally, after the U.S. Department of Justice rescinded a policy that had eased enforcement of U.S. federal marijuana laws in states that had legalized the drug. Canada is working toward legalizing recreational use later this year. \n* Valeant Pharmaceuticals International Inc was down 3.2 percent at C$28.67. \n* Canadian companies remain optimistic about future sales despite some moderation from highs, and signs of capacity pressures and labor shortages have picked up, the Bank of Canada said, reinforcing expectations for an interest rate hike. (Reporting by Alastair Sharp and Fergal Smith; Editing by Lisa Von Ahn and Tom Brown)", "external_links": [], "published": "2018-01-08T23:33:00.000+02:00", "crawled": "2018-01-08T23:50:48.001+02:00", "highlightTitle": ""}