{"organizations": [], "uuid": "53485239b8197c2e27216e3017215289f580123d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-raytheon-reports-strong-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Raytheon Reports Strong Fourth Quarter and Full-Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:55:00.000+02:00", "replies_count": 0, "uuid": "53485239b8197c2e27216e3017215289f580123d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-raytheon-reports-strong-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Raytheon Reports Strong Fourth Quarter and Full-Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "raytheon", "sentiment": "negative"}, {"name": "raytheon company", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 25, 2018 /PRNewswire/ -- Raytheon Company (NYSE: RTN) today announced net sales for the fourth quarter 2017 of $6.8 billion, up 8.0 percent compared to $6.3 billion in the fourth quarter 2016. Fourth quarter 2017 EPS from continuing operations was $1.35 compared to $1.87 in the fourth quarter 2016. Fourth quarter and full-year 2017 included an unfavorable $0.59 provisional tax-related impact due to the enactment of the Tax Cuts and Jobs Act of 2017.\nIn addition, the company made a $1.0 billion pretax discretionary pension plan contribution in the fourth quarter 2017, which had an unfavorable tax-related EPS impact of $0.09 and was not included in the company's prior guidance. The company made a $500 million pretax discretionary pension plan contribution in the fourth quarter 2016, which had an unfavorable tax-related EPS impact of $0.04.\nNet sales in 2017 were $25.3 billion, up 5.1 percent compared to $24.1 billion in 2016. Full-year 2017 EPS from continuing operations was $6.94 compared to $7.55 for the full-year 2016.\n\"Raytheon delivered record sales and strong cash flow in 2017 reflecting the continued hard work and dedication of the Raytheon team,\" said Thomas A. Kennedy, Raytheon Chairman and CEO. \"Bookings strength across our broad portfolio of proven technology solutions positions the company well for the future.\"\nThe company generated strong operating cash flow for both the fourth quarter and full-year. Operating cash flow from continuing operations for the fourth quarter 2017 and full-year 2017 was $1.6 billion and $2.7 billion, respectively, after making the $1.0 billion pretax discretionary cash contribution to the company's pension plans. Operating cash flow from continuing operations for the fourth quarter 2016 and full-year 2016 was $1.1 billion and $2.9 billion, respectively, after making the $500 million pretax discretionary pension contribution. Operating cash flow in the fourth quarter and full-year 2017, excluding the $1.0 billion pretax discretionary pension contribution, was better than the company's prior guidance primarily due to favorable collections.\nIn the fourth quarter 2017, the company repurchased 0.5 million shares of common stock for $100 million. For the full-year 2017, the company repurchased 4.9 million shares of common stock for $800 million. Also, as previously announced in November 2017, the company's Board of Directors authorized the repurchase of up to an additional $2.0 billion of the company's outstanding common stock.\nThe company had bookings of $8.5 billion in the fourth quarter 2017, resulting in a book-to-bill ratio of 1.26. Fourth quarter 2016 bookings were $7.6 billion. Full-year 2017 bookings were $27.7 billion, resulting in a book-to-bill ratio of 1.09. Full-year 2016 bookings were $27.8 billion.\nSummary Financial Results\n4th Quarter\n%\nTwelve Months\n%\n($ in millions, except per share data)\n2017\n2016\nChange\n2017\n2016\nChange\nBookings\n$\n8,541\n$\n7,582\n12.6%\n$\n27,718\n$\n27,809\n-0.3%\nNet Sales\n$\n6,783\n$\n6,279\n8.0%\n$\n25,348\n$\n24,124\n5.1%\nIncome from Continuing Operations before Taxes\n$\n834\n$\n825\n1.1%\n$\n3,113\n$\n3,085 3\n0.9%\nFederal and Foreign Income Taxes\n$\n447 1\n$\n272 2\n64.3%\n$\n1,114 1\n$\n873 2\n27.6%\nIncome from Continuing Operations attributable to\nRaytheon Company\n$\n393 1\n$\n555 2\n-29.2%\n$\n2,022 1\n$\n2,243 2,3\n-9.9%\nEPS from Continuing Operations\n$\n1.35 1\n$\n1.87 2\n-27.8%\n$\n6.94 1\n$\n7.55 2,3\n-8.1%\nOperating Cash Flow from Continuing Operations\n$\n1,624\n$\n1,141\n$\n2,747\n$\n2,852\nWorkdays in Fiscal Reporting Calendar\n58\n57\n248\n249\n1 Fourth quarter and twelve months 2017 Federal and Foreign Income Taxes and Income from Continuing Operations attributable to Raytheon Company included: 1) a provisional tax-related expense of approximately $171 million due to the enactment of the Tax Cuts and Jobs Act of 2017, which had an EPS impact of $0.59, and 2) a $25 million unfavorable tax-related impact due to the $1.0 billion discretionary pension plan contribution, which had an EPS impact of $0.09.\n2 Fourth quarter and twelve months 2016 Federal and Foreign Income Taxes and Income from Continuing Operations attributable to Raytheon Company included a $13 million unfavorable tax-related impact due to the $0.5 billion discretionary pension plan contribution, which had an EPS impact of $0.04.\n3 Twelve months 2016 Income from Continuing Operations before Taxes and Income from Continuing Operations attributable to Raytheon Company included the tax-free gain of $158 million for the second quarter 2016 TRS transaction, which had a favorable EPS impact of $0.53.\nBacklog at the end of 2017 was $38.2 billion, an increase of approximately $1.5 billion or 4 percent compared to the end of 2016.\nBacklog\nPeriod Ending\n($ in millions)\n2017\n2016\nBacklog\n$\n38,210\n$\n36,709\nOutlook\nThe company has provided its financial outlook for 2018. Charts containing additional information on the company's 2018 outlook are available on the company's website.\nEffective January 1, 2018, the company adopted the new retirement benefit standard, which moves certain components of FAS pension and postretirement benefit expense from operating to non-operating income. The adoption of this standard increases operating income due to the removal of all components of FAS expense other than service cost, and decreases non-operating income by the same amount with no impact to net income. The standard does not impact our CAS expense, which is recorded in the results of each segment. As a result, our FAS/CAS Adjustment will be split into: FAS/CAS Operating Adjustment; and Other Pension Expense within non-operating. The 2017 Actuals - New Standard and the 2018 columns in the Financial Outlook table below reflect the adoption of the standard.\n2018 Financial Outlook\n2017 Actual\n2018\nAs Reported\nNew Standard 1\nOutlook 1\nNet Sales ($B)\n25.3\n25.3\n26.4 - 26.9\nDeferred Revenue Adjustment ($M) 2\n(35)\n(35)\n(10)\nAmortization of Acquired Intangibles ($M) 2\n(125)\n(125)\n(118)\nFAS/CAS Adjustment ($M)\n390\nn/a\nn/a\nFAS/CAS Operating Adjustment ($M)\nn/a\n1,303\n1,416\nOther Pension Expense, non-operating ($M)\nn/a\n(913)\n(958)\nInterest Expense, net ($M)\n(184)\n(184)\n(180) - (185)\nDiluted Shares (M)\n291\n291\n287 - 289\nEffective Tax Rate 3\n35.8%\n35.8%\n~19.0%\nEPS from Continuing Operations 3\n$6.94\n$6.94\n$9.55 - $9.75\nOperating Cash Flow from Continuing Operations ($B)\n2.7\n2.7\n3.6 - 4.0\nn/a = Not Applicable\n1 Effective January 1, 2018, the company adopted the new retirement benefit standard, Accounting Standards Update 2017-07. The 2017 Actuals - New Standard and the 2018 Outlook above reflect this change.\n2 Deferred Revenue Adjustment and Amortization of Acquired Intangibles represent the unfavorable impact of the acquisition accounting adjustments to record acquired deferred revenue at fair value and the amortization of acquired intangible assets for all business segments.\n3 2017 and 2018 effective tax rate reflect the enactment of the Tax Cuts and Jobs Act of 2017. 2017 was impacted unfavorably by a provisional amount of approximately $171 million, which had an impact to the 2017 rate of 5.5 percent and an EPS impact of $0.59.\nSegment Results\nThe company's reportable segments are: Integrated Defense Systems (IDS); Intelligence, Information and Services (IIS); Missile Systems (MS); Space and Airborne Systems (SAS); and Forcepoint™.\nIntegrated Defense Systems\n4th Quarter\nTwelve Months\n($ in millions)\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet Sales\n$\n1,553\n$\n1,460\n6%\n$\n5,804\n$\n5,529\n5%\nOperating Income 1\n$\n247\n$\n238\n4%\n$\n935\n$\n971\nNM\nOperating Margin 1\n15.9%\n16.3%\n16.1%\n17.6%\n1 Twelve months 2016 operating income and operating margin include the $158 million tax-free gain from the second\nquarter 2016 ThalesRaytheonSystems (TRS) transaction.\nNM = Not Meaningful\nIntegrated Defense Systems (IDS) had fourth quarter 2017 net sales of $1,553 million, up 6 percent compared to $1,460 million in the fourth quarter 2016. IDS had full-year 2017 net sales of $5,804 million compared to $5,529 million in 2016. The increase in net sales for both the quarter and the full-year was primarily driven by higher net sales on an international early warning radar program.\nIDS recorded $247 million of operating income in the fourth quarter 2017 compared to $238 million in the fourth quarter 2016. The increase in operating income for the quarter was primarily driven by higher volume and a favorable change in program mix. IDS recorded $935 million of operating income in 2017 compared to $971 million in 2016. The change in operating income for the full-year was primarily driven by a favorable change in program mix, higher net program efficiencies and higher volume, which was more than offset by the $158 million tax-free gain from the ThalesRaytheonSystems (TRS) transaction in the second quarter 2016.\nDuring the quarter, IDS booked $304 million on an Early Warning Surveillance Radar System (EWSRS) support program for an international customer; $280 million to provide Consolidated Contractor Logistics Support (CCLS) for the Missile Defense Agency (MDA); $264 million to provide advanced Patriot Air and Missile Defense system capabilities for international customers; and $81 million on the Army Navy/Transportable Radar Surveillance-Model 2 (AN/TPY-2) radar sustainment program for the MDA.\nShortly after the quarter close, as previously announced, IDS received a direct commercial contract worth more than $1.5 billion to provide Patriot Air and Missile Defense system capability to a member of the 14-nation Patriot partnership.\nIntelligence, Information and Services\n4th Quarter\nTwelve Months\n($ in millions)\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet Sales\n$\n1,572\n$\n1,516\n4%\n$\n6,177\n$\n6,169\n-\nOperating Income\n$\n117\n$\n120\n-3%\n$\n455\n$\n467\n-3%\nOperating Margin\n7.4%\n7.9%\n7.4%\n7.6%\nIntelligence, Information and Services (IIS) had fourth quarter 2017 net sales of $1,572 million, up 4 percent compared to $1,516 million in the fourth quarter 2016. The increase in net sales for the quarter was primarily driven by higher net sales on a U.S. Air Force program and classified programs. IIS had full-year 2017 net sales of $6,177 million compared to $6,169 million in 2016.\nIIS recorded $117 million of operating income in the fourth quarter 2017 compared to $120 million in the fourth quarter 2016. IIS recorded $455 million of operating income in 2017 compared to $467 million in 2016.\nDuring the quarter, IIS booked $244 million on domestic and foreign training programs in support of Warfighter FOCUS activities; $233 million to upgrade the Phalanx ® Closed-In Weapon System (CIWS) for the Royal Canadian Navy; $98 million on the Development, Operations and Maintenance (DOMino) Cyber program for the Department of Homeland Security (DHS); $97 million on the Standard Terminal Automation Replacement System (STARS) program for the Federal Aviation Administration (FAA); and $77 million to support the Naval Communication Station, Harold E. Holt facility for Australia. IIS also booked $410 million on a number of classified contracts.\nMissile Systems\n4th Quarter\nTwelve Months\n($ in millions)\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet Sales\n$\n2,185\n$\n1,897\n15%\n$\n7,787\n$\n7,096\n10%\nOperating Income\n$\n278\n$\n261\n7%\n$\n1,010\n$\n921\n10%\nOperating Margin\n12.7%\n13.8%\n13.0%\n13.0%\nMissile Systems (MS) had fourth quarter 2017 net sales of $2,185 million, up 15 percent compared to $1,897 million in the fourth quarter 2016. The increase in net sales for the quarter was primarily driven by higher net sales on the Advanced Medium-Range Air-to-Air Missiles (AMRAAM ® ), Standard Missile-3 (SM-3 ® ) and Paveway™ programs. MS had full-year 2017 net sales of $7,787 million compared to $7,096 million in 2016. The increase in net sales for the full-year was primarily driven by higher net sales on the Paveway, SM-3 and Standard Missile-2 (SM-2) programs.\nMS recorded $278 million of operating income in the fourth quarter 2017 compared to $261 million in the fourth quarter 2016. MS recorded $1,010 million of operating income in 2017 compared to $921 million in 2016. The increase in operating income for both the quarter and the full-year was primarily due to higher volume in 2017.\nDuring the quarter, MS booked $1,132 million for Paveway; $696 million for AMRAAM; $423 million for the Joint Standoff Weapon (JSOW ® ); $269 million for Tomahawk; $109 million for Phalanx CIWS; $107 million for SM-3; $80 million for the Mobile Range program; and $77 million for Horizontal Technology Integration (HTI) forward-looking infrared kits. MS also booked $310 million on a number of classified contracts.\nSpace and Airborne Systems\n4th Quarter\nTwelve Months\n($ in millions)\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet Sales\n$\n1,670\n$\n1,600\n4%\n$\n6,430\n$\n6,182\n4%\nOperating Income\n$\n242\n$\n221\n10%\n$\n862\n$\n808\n7%\nOperating Margin\n14.5%\n13.8%\n13.4%\n13.1%\nSpace and Airborne Systems (SAS) had fourth quarter 2017 net sales of $1,670 million, up 4 percent compared to $1,600 million in the fourth quarter 2016. The increase in net sales for the quarter was primarily due to higher net sales on airborne radar programs. SAS had full-year 2017 net sales of $6,430 million compared to $6,182 million in 2016. The increase in net sales for the full-year was primarily due to higher net sales on an electronic warfare systems program and a domestic classified program.\nSAS recorded $242 million of operating income in the fourth quarter 2017 compared to $221 million in the fourth quarter 2016. SAS recorded $862 million of operating income in 2017 compared to $808 million in 2016. The change in operating income for the quarter and full-year was primarily driven by higher volume in 2017 and a favorable change in program mix.\nDuring the quarter, SAS booked $411 million on a number of classified contracts.\nForcepoint\n4th Quarter\nTwelve Months\n($ in millions)\n2017\n2016\n% Change\n2017\n2016\n% Change\nNet Sales\n$\n156\n$\n143\n9%\n$\n608\n$\n586\n4%\nOperating Income\n$\n(8)\n$\n21\nNM\n$\n33\n$\n90\nNM\nOperating Margin\n(5.1)%\n14.7%\n5.4%\n15.4%\nNM = Not Meaningful\nForcepoint had fourth quarter 2017 net sales of $156 million compared to $143 million in the fourth quarter 2016. Forcepoint had full-year 2017 net sales of $608 million compared to $586 million in 2016.\nForcepoint recorded a loss of $8 million in the fourth quarter 2017 compared to operating income of $21 million in the fourth quarter 2016. Forcepoint recorded $33 million of operating income in 2017 compared to $90 million in 2016. The decrease in operating income for both the quarter and the full-year was primarily driven by higher selling and marketing costs.\nAbout Raytheon\nRaytheon Company, with 2017 sales of $25 billion and 64,000 employees, is a technology and innovation leader specializing in defense, civil government and cybersecurity solutions. With a history of innovation spanning 96 years, Raytheon provides state-of-the-art electronics, mission systems integration, C5I™ products and services, sensing, effects, and mission support for customers in more than 80 countries. Raytheon is headquartered in Waltham, Massachusetts. Follow us on Twitter .\nConference Call on the Fourth Quarter and Full-Year 2017 Financial Results\nRaytheon's financial results conference call will be held on Thursday, January 25, 2018 at 9 a.m. ET. Participants will include Thomas A. Kennedy, Chairman and CEO; Anthony F. O'Brien, vice president and CFO; and other company executives.\nThe dial-in number for the conference call will be (877) 280-4958 in the U.S. or (857) 244-7315 outside of the U.S. The conference call will also be audiocast on the Internet at www.raytheon.com/ir . Individuals may listen to the call and download charts that will be used during the call. These charts will be available for printing prior to the call.\nInterested parties are encouraged to check the website ahead of time to ensure their computers are configured for the audio stream. Instructions for obtaining the free required downloadable software are posted on the site.\nDisclosure Regarding Forward-looking Statements\nThis release and the attachments contain forward-looking statements, including information regarding the company's financial outlook, future plans, objectives, business prospects and anticipated financial performance. These forward-looking statements are not statements of historical facts and represent only the company's current expectations regarding such matters. These statements inherently involve a wide range of known and unknown risks and uncertainties. The company's actual actions and results could differ materially from what is expressed or implied by these statements. Specific factors that could cause such a difference include, but are not limited to: the company's dependence on the U.S. government for a significant portion of its business and the risks associated with U.S. government sales, including changes or shifts in defense spending due to budgetary constraints, spending cuts resulting from sequestration, a government shutdown, or otherwise, uncertain funding of programs, potential termination of contracts and performance under undefinitized contract awards; difficulties in contract performance; the resolution of program terminations; the ability to procure new contracts; the risks of conducting business in foreign countries; the unpredictability of timing of international bookings; the ability to comply with extensive governmental regulation, including export and import requirements such as the International Traffic in Arms Regulations and the Export Administration Regulations, anti-bribery and anti-corruption requirements including the Foreign Corrupt Practices Act, industrial cooperation agreement obligations, and procurement and other regulations; the ability to obtain timely U.S. government approvals for international contracts; changes in government procurement practices; the impact of competition; the ability to develop products and technologies, and the impact of associated investments and costs; the ability to recruit and retain qualified personnel; the impact of potential security and cyber threats, and other disruptions; the risk that actual pension returns, discount rates or other actuarial assumptions, including the long-term return on asset assumption, are significantly different than the company's current assumptions; the risk of cost overruns, particularly for the company's fixed-price contracts; dependence on component availability, subcontractor and partner performance and key suppliers; risks of a negative government audit; risks associated with acquisitions, investments, dispositions, joint ventures and other business arrangements; the ability to grow in the government and commercial cybersecurity markets; risks of an impairment of goodwill or other intangible assets; the impact of financial markets and global economic conditions; the use of accounting estimates in the company's financial statements, including with respect to the provisional impact of the Tax Cuts and Jobs Act of 2017; the outcome of contingencies and litigation matters, including government investigations; the risk of environmental liabilities; and other factors as may be detailed from time to time in the company's public announcements and Securities and Exchange Commission filings. The company undertakes no obligation to make any revisions to the forward-looking statements contained in this release and the attachments or to update them to reflect events or circumstances occurring after the date of this release, including any acquisitions, dispositions or other business arrangements that may be announced or closed after such date.\nAttachment A\nRaytheon Company\nPreliminary Statement of Operations Information\nFourth Quarter 2017\n(In millions, except per share amounts)\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nNet sales\n$\n6,783\n$\n6,279\n$\n25,348\n$\n24,124\nOperating expenses\nCost of sales\n5,171\n4,688\n19,076\n17,965\nGeneral and administrative expenses\n742\n711\n2,954\n2,864\nTotal operating expenses\n5,913\n5,399\n22,030\n20,829\nOperating income\n870\n880\n3,318\n3,295\nNon-operating (income) expense, net\nInterest expense\n48\n58\n205\n232\nInterest income\n(7)\n(4)\n(21)\n(16)\nOther (income) expense, net\n(5)\n1\n21\n(6)\nTotal non-operating (income) expense, net\n36\n55\n205\n210\nIncome from continuing operations before taxes\n834\n825\n3,113\n3,085\nFederal and foreign income taxes\n447\n272\n1,114\n873\nIncome from continuing operations\n387\n553\n1,999\n2,212\nIncome (loss) from discontinued operations, net of tax\n—\n—\n2\n1\nNet income\n387\n553\n2,001\n2,213\nLess: Net income (loss) attributable to noncontrolling interests\nin subsidiaries\n(6)\n(2)\n(23)\n(31)\nNet income attributable to Raytheon Company\n$\n393\n$\n555\n$\n2,024\n$\n2,244\nBasic earnings per share attributable to Raytheon Company\ncommon stockholders:\nIncome from continuing operations\n$\n1.35\n$\n1.88\n$\n6.95\n$\n7.55\nIncome (loss) from discontinued operations, net of tax\n—\n—\n0.01\n—\nNet income\n1.35\n1.88\n6.96\n7.56\nDiluted earnings per share attributable to Raytheon Company\ncommon stockholders:\nIncome from continuing operations\n$\n1.35\n$\n1.87\n$\n6.94\n$\n7.55\nIncome (loss) from discontinued operations, net of tax\n—\n—\n0.01\n—\nNet income\n1.35\n1.88\n6.95\n7.55\nAmounts attributable to Raytheon Company common\nstockholders:\nIncome from continuing operations\n$\n393\n$\n555\n$\n2,022\n$\n2,243\nIncome (loss) from discontinued operations, net of tax\n—\n—\n2\n1\nNet income\n$\n393\n$\n555\n$\n2,024\n$\n2,244\nAverage shares outstanding\nBasic\n289.6\n294.2\n291.1\n296.5\nDiluted\n290.0\n294.5\n291.4\n296.8\nAttachment A - Pro Forma\nRaytheon Company\nPreliminary Statement of Operations Information\nFull-Year 2016, and Quarters within and Full-Year 2017\n(In millions)\nEffective January 1, 2018, we adopted Accounting Standards Update (ASU) 2017-07, Compensation-Retirement Benefits (Topic 715). The tables below provide additional information with respect to the line items within our statement of operations information impacted by the new standard.\nAs reported\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nNet sales\n$\n6,783\n$\n6,284\n$\n6,281\n$\n6,000\n$\n25,348\n$\n24,124\nOperating expenses\nCost of sales\n5,171\n4,690\n4,685\n4,530\n19,076\n17,965\nGeneral and administrative expenses\n742\n736\n747\n729\n2,954\n2,864\nTotal operating expenses\n5,913\n5,426\n5,432\n5,259\n22,030\n20,829\nOperating income\n870\n858\n849\n741\n3,318\n3,295\nNon-operating (income) expense, net\nInterest expense\n48\n48\n51\n58\n205\n232\nInterest income\n(7)\n(4)\n(5)\n(5)\n(21)\n(16)\nOther (income) expense, net\n(5)\n(2)\n35\n(7)\n21\n(6)\nTotal non-operating (income) expense, net\n36\n42\n81\n46\n205\n210\nIncome from continuing operations before taxes\n$\n834\n$\n816\n$\n768\n$\n695\n$\n3,113\n$\n3,085\nAdjustments for ASU 2017-07\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nNet sales\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\nOperating expenses\nCost of sales\n(186)\n(222)\n(164)\n(164)\n(736)\n(458)\nGeneral and administrative expenses\n(44)\n(48)\n(42)\n(43)\n(177)\n(143)\nTotal operating expenses\n(230)\n(270)\n(206)\n(207)\n(913)\n(601)\nOperating income\n230\n270\n206\n207\n913\n601\nNon-operating (income) expense, net\nOther pension expense\n230\n270\n206\n207\n913\n601\nInterest expense\n—\n—\n—\n—\n—\n—\nInterest income\n—\n—\n—\n—\n—\n—\nOther (income) expense, net\n—\n—\n—\n—\n—\n—\nTotal non-operating (income) expense, net\n230\n270\n206\n207\n913\n601\nIncome from continuing operations before taxes\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\nPro Forma\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nNet sales\n$\n6,783\n$\n6,284\n$\n6,281\n$\n6,000\n$\n25,348\n$\n24,124\nOperating expenses\nCost of sales\n4,985\n4,468\n4,521\n4,366\n18,340\n17,507\nGeneral and administrative expenses\n698\n688\n705\n686\n2,777\n2,721\nTotal operating expenses\n5,683\n5,156\n5,226\n5,052\n21,117\n20,228\nOperating income\n1,100\n1,128\n1,055\n948\n4,231\n3,896\nNon-operating (income) expense, net\nOther pension expense\n230\n270\n206\n207\n913\n601\nInterest expense\n48\n48\n51\n58\n205\n232\nInterest income\n(7)\n(4)\n(5)\n(5)\n(21)\n(16)\nOther (income) expense, net\n(5)\n(2)\n35\n(7)\n21\n(6)\nTotal non-operating (income) expense, net\n266\n312\n287\n253\n1,118\n811\nIncome from continuing operations before taxes\n$\n834\n$\n816\n$\n768\n$\n695\n$\n3,113\n$\n3,085\nAttachment B\nRaytheon Company\nPreliminary Segment Information\nFourth Quarter 2017\n(In millions, except percentages)\nOperating Income\nNet Sales\nOperating Income\nAs a Percent of Net Sales\nThree Months Ended\nThree Months Ended\nThree Months Ended\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nIntegrated Defense Systems\n$\n1,553\n$\n1,460\n$\n247\n$\n238\n15.9%\n16.3%\nIntelligence, Information and Services\n1,572\n1,516\n117\n120\n7.4%\n7.9%\nMissile Systems\n2,185\n1,897\n278\n261\n12.7%\n13.8%\nSpace and Airborne Systems\n1,670\n1,600\n242\n221\n14.5%\n13.8%\nForcepoint\n156\n143\n(8)\n21\n(5.1)%\n14.7%\nEliminations\n(346)\n(324)\n(35)\n(33)\nTotal business segment\n6,790\n6,292\n841\n828\n12.4%\n13.2%\nAcquisition Accounting Adjustments\n(7)\n(13)\n(37)\n(43)\nFAS/CAS Adjustment\n—\n—\n95\n117\nCorporate\n—\n—\n(29)\n(22)\nTotal\n$\n6,783\n$\n6,279\n$\n870\n$\n880\n12.8%\n14.0%\nOperating Income\nNet Sales\nOperating Income\nAs a Percent of Net Sales\nTwelve Months Ended\nTwelve Months Ended\nTwelve Months Ended\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nIntegrated Defense Systems\n$\n5,804\n$\n5,529\n$\n935\n$\n971\n16.1%\n17.6%\nIntelligence, Information and Services\n6,177\n6,169\n455\n467\n7.4%\n7.6%\nMissile Systems\n7,787\n7,096\n1,010\n921\n13.0%\n13.0%\nSpace and Airborne Systems\n6,430\n6,182\n862\n808\n13.4%\n13.1%\nForcepoint\n608\n586\n33\n90\n5.4%\n15.4%\nEliminations\n(1,423)\n(1,361)\n(148)\n(142)\nTotal business segment\n25,383\n24,201\n3,147\n3,115\n12.4%\n12.9%\nAcquisition Accounting Adjustments\n(35)\n(77)\n(160)\n(198)\nFAS/CAS Adjustment\n—\n—\n390\n435\nCorporate\n—\n—\n(59)\n(57)\nTotal\n$\n25,348\n$\n24,124\n$\n3,318\n$\n3,295\n13.1%\n13.7%\nAttachment B - Pro Forma\nRaytheon Company\nPreliminary Segment Information\nFull-Year 2016, and Quarters within and Full-Year 2017\n(In millions, except percentages)\nEffective January 1, 2018, we adopted Accounting Standards Update (ASU) 2017-07, Compensation-Retirement Benefits (Topic 715). The tables below provide additional information with respect to the line items within our segment information impacted by the new standard.\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nTotal net sales\n$\n6,783\n$\n6,284\n$\n6,281\n$\n6,000\n$\n25,348\n$\n24,124\nAs reported\nOperating Income\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nTotal business segment\n$\n841\n$\n819\n$\n779\n$\n708\n$\n3,147\n$\n3,115\nAcquisition Accounting Adjustments\n(37)\n(39)\n(42)\n(42)\n(160)\n(198)\nFAS/CAS Adjustment\n95\n78\n109\n108\n390\n435\nCorporate\n(29)\n—\n3\n(33)\n(59)\n(57)\nTotal\n$\n870\n$\n858\n$\n849\n$\n741\n$\n3,318\n$\n3,295\nTotal operating income as a percentage of\nnet sales\n12.8%\n13.7%\n13.5%\n12.4%\n13.1%\n13.7%\nAdjustments for ASU 2017-07\nOperating Income\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nTotal business segment\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\nAcquisition Accounting Adjustments\n—\n—\n—\n—\n—\n—\nFAS/CAS Adjustment\n230\n270\n206\n207\n913\n601\nCorporate\n—\n—\n—\n—\n—\n—\nTotal\n$\n230\n$\n270\n$\n206\n$\n207\n$\n913\n$\n601\nPro Forma\nOperating Income\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n1-Oct-17\n2-Jul-17\n2-Apr-17\n31-Dec-17\n31-Dec-16\nTotal business segment\n$\n841\n$\n819\n$\n779\n$\n708\n$\n3,147\n$\n3,115\nAcquisition Accounting Adjustments\n(37)\n(39)\n(42)\n(42)\n(160)\n(198)\nFAS/CAS Operating Adjustment\n325\n348\n315\n315\n1,303\n1,036\nCorporate\n(29)\n—\n3\n(33)\n(59)\n(57)\nTotal\n$\n1,100\n$\n1,128\n$\n1,055\n$\n948\n$\n4,231\n$\n3,896\nTotal operating income as a percentage of\nnet sales\n16.2%\n18.0%\n16.8%\n15.8%\n16.7%\n16.1%\nAttachment C\nRaytheon Company\nOther Preliminary Information\nFourth Quarter 2017\n(In millions)\nBacklog\n31-Dec-17\n31-Dec-16\nIntegrated Defense Systems\n$\n9,186\n$\n10,159\nIntelligence, Information and Services\n6,503\n5,662\nMissile Systems\n13,426\n11,568\nSpace and Airborne Systems\n8,611\n8,834\nForcepoint\n484\n486\nTotal backlog\n$\n38,210\n$\n36,709\nThree Months Ended\nTwelve Months Ended\nBookings\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nTotal bookings\n$\n8,541\n$\n7,582\n$\n27,718\n$\n27,809\nThree Months Ended\nTwelve Months Ended\nGeneral and Administrative Expenses\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nAdministrative and selling expenses\n$\n566\n$\n515\n$\n2,220\n$\n2,109\nResearch and development expenses\n176\n196\n734\n755\nTotal general and administrative expenses\n$\n742\n$\n711\n$\n2,954\n$\n2,864\nCash, Cash Equivalents and Restricted Cash\n31-Dec-17\n31-Dec-16\nCash and cash equivalents\n$\n3,103\n$\n3,303\nRestricted cash\n12\n—\nTotal cash, cash equivalents and restricted cash shown in Attachment E\n$\n3,115\n$\n3,303\nAttachment D\nRaytheon Company\nPreliminary Balance Sheet Information\nFourth Quarter 2017\n(In millions)\n31-Dec-17\n31-Dec-16\nAssets\nCurrent assets\nCash and cash equivalents\n$\n3,103\n$\n3,303\nShort-term investments\n297\n100\nReceivables, net\n1,324\n1,163\nContract assets\n5,247\n5,041\nInventories\n594\n608\nPrepaid expenses and other current assets\n761\n670\nTotal current assets\n11,326\n10,885\nProperty, plant and equipment, net\n2,439\n2,166\nGoodwill\n14,871\n14,788\nOther assets, net\n2,224\n2,399\nTotal assets\n$\n30,860\n$\n30,238\nLiabilities, Redeemable Noncontrolling Interest and Equity\nCurrent liabilities\nCommercial paper\n$\n300\n$\n—\nContract liabilities\n2,927\n2,646\nAccounts payable\n1,519\n1,520\nAccrued employee compensation\n1,342\n1,234\nOther current liabilities\n1,260\n1,139\nTotal current liabilities\n7,348\n6,539\nAccrued retiree benefits and other long-term liabilities\n8,287\n7,758\nLong-term debt\n4,750\n5,335\nRedeemable noncontrolling interest\n512\n449\nEquity\nRaytheon Company stockholders' equity\nCommon stock\n3\n3\nAdditional paid-in capital\n—\n—\nAccumulated other comprehensive loss\n(7,935)\n(7,411)\nRetained earnings\n17,895\n17,565\nTotal Raytheon Company stockholders' equity\n9,963\n10,157\nNoncontrolling interests in subsidiaries\n—\n—\nTotal equity\n9,963\n10,157\nTotal liabilities, redeemable noncontrolling interest and equity\n$\n30,860\n$\n30,238\nAttachment E\nRaytheon Company\nPreliminary Cash Flow Information\nFourth Quarter 2017\n(In millions)\nTwelve Months Ended\n31-Dec-17\n31-Dec-16\nCash flows from operating activities\nNet income\n$\n2,001\n$\n2,213\n(Income) loss from discontinued operations, net of tax\n(2)\n(1)\nIncome from continuing operations\n1,999\n2,212\nAdjustments to reconcile to net cash provided by (used in) operating activities from continuing\noperations, net of the effect of acquisitions and divestitures\nDepreciation and amortization\n550\n515\nStock-based compensation\n173\n151\nGain on sale of equity method investment\n—\n(158)\nLoss on repayment of long-term debt\n39\n—\nDeferred income taxes\n252\n133\nChanges in assets and liabilities\nReceivables, net\n(157)\n18\nContract assets and contract liabilities\n88\n(645)\nInventories\n14\n(10)\nPrepaid expenses and other current assets\n204\n205\nIncome taxes receivable/payable\n(193)\n(185)\nAccounts payable\n(94)\n152\nAccrued employee compensation\n111\n77\nOther current liabilities\n106\n(41)\nAccrued retiree benefits\n(250)\n419\nOther, net\n(95)\n9\nNet cash provided by (used in) operating activities from continuing operations\n2,747\n2,852\nNet cash provided by (used in) operating activities from discontinued operations\n(2)\n—\nNet cash provided by (used in) operating activities\n2,745\n2,852\nCash flows from investing activities\nAdditions to property, plant and equipment\n(543)\n(561)\nProceeds from sales of property, plant and equipment\n46\n34\nAdditions to capitalized internal use software\n(68)\n(64)\nPurchases of short-term investments\n(696)\n(472)\nMaturities of short-term investments\n517\n1,184\nPayments for purchases of acquired companies, net of cash received\n(93)\n(57)\nOther\n20\n(11)\nNet cash provided by (used in) investing activities\n(817)\n53\nCash flows from financing activities\nDividends paid\n(910)\n(850)\nNet borrowings (payments) on commercial paper\n300\n—\nRepayments of long-term debt\n(591)\n—\nLoss on repayment of long-term debt\n(38)\n—\nRepurchases of common stock under share repurchase programs\n(800)\n(900)\nRepurchases of common stock to satisfy tax withholding obligations\n(85)\n(96)\nAcquisition of noncontrolling interest in RCCS LLC\n—\n(90)\nContribution from noncontrolling interests in Forcepoint\n8\n11\nOther\n—\n(5)\nNet cash provided by (used in) financing activities\n(2,116)\n(1,930)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n(188)\n975\nCash, cash equivalents and restricted cash at beginning of the year\n3,303\n2,328\nCash, cash equivalents and restricted cash at end of period\n$\n3,115\n$\n3,303\nAttachment F\nRaytheon Company\nSupplemental EPS Information\nFourth Quarter 2017\n(In millions, except per share amounts)\nThree Months Ended\nTwelve Months Ended\n31-Dec-17\n31-Dec-16\n31-Dec-17\n31-Dec-16\nPer share impact of the enactment of the Tax Cuts and Jobs Act of\n2017 (A)\n$\n0.59\n$\n—\n$\n0.59\n$\n—\nPer share impact of discretionary pension contributions (B)\n0.09\n0.04\n0.09\n0.04\nPer share impact of early debt retirement (C)\n—\n—\n0.09\n—\nPer share impact of TRS transaction (D)\n—\n—\n—\n0.53\n(A)\nTax impact of the enactment of the Tax Cuts and Jobs Act of 2017\n$\n171\n$\n—\n$\n171\n$\n—\nDiluted shares\n290.0\n—\n291.4\n—\nPer share impact\n$\n0.59\n$\n—\n$\n0.59\n$\n—\n(B)\nTax impact of discretionary pension contribution\n$\n25\n$\n13\n$\n25\n$\n13\nDiluted shares\n290.0\n294.5\n291.4\n296.8\nPer share impact\n$\n0.09\n$\n0.04\n$\n0.09\n$\n0.04\n(C)\nEarly debt retirement\n$\n—\n$\n—\n$\n39\n$\n—\nTax effect (at 35% statutory rate)\n—\n—\n(14)\n—\nAfter-tax impact\n—\n—\n25\n—\nDiluted shares\n—\n—\n291.4\n—\nPer share impact\n$\n—\n$\n—\n$\n0.09\n$\n—\n(D)\nTRS transaction\n$\n—\n$\n—\n$\n—\n$\n158\nDiluted shares\n—\n—\n—\n296.8\nPer share impact\n$\n—\n$\n—\n$\n—\n$\n0.53\nRaytheon Company\nGlobal Headquarters\nWaltham, Mass.\nInvestor Relations Contact\nTodd Ernst\n781.522.5141\nMedia Contact\nCorinne Kovalsky\n781.522.5899\nView original content: http://www.prnewswire.com/news-releases/raytheon-reports-strong-fourth-quarter-and-full-year-2017-results-300587930.html\nSOURCE Raytheon Company", "external_links": ["https://c212.net/c/link/?t=0&l=en&o=2040252-1&h=274140557&u=http%3A%2F%2Fwww.raytheon.com%2Fir&a=www.raytheon.com%2Fir", "https://c212.net/c/link/?t=0&l=en&o=2040252-1&h=3549174055&u=http%3A%2F%2Fwww.raytheon.com%2F&a=Raytheon", "https://c212.net/c/link/?t=0&l=en&o=2040252-1&h=3529315535&u=https%3A%2F%2Ftwitter.com%2Fraytheon&a=Twitter", "http://www.prnewswire.com/news-releases/raytheon-reports-strong-fourth-quarter-and-full-year-2017-results-300587930.html"], "published": "2018-01-25T14:55:00.000+02:00", "crawled": "2018-01-25T14:23:58.018+02:00", "highlightTitle": ""}