{"organizations": [], "uuid": "8d4c4a2d02a2b83fe67bae5ca7b473a662ba4073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/14/globe-newswire-telix-pharmaceuticals-establishes-japanese-subsidiary-appoints-key-executives.html", "country": "US", "domain_rank": 767, "title": "Telix Pharmaceuticals Establishes Japanese Subsidiary, Appoints Key Executives", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-15T05:12:00.000+02:00", "replies_count": 0, "uuid": "8d4c4a2d02a2b83fe67bae5ca7b473a662ba4073"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/14/globe-newswire-telix-pharmaceuticals-establishes-japanese-subsidiary-appoints-key-executives.html", "ord_in_thread": 0, "title": "Telix Pharmaceuticals Establishes Japanese Subsidiary, Appoints Key Executives", "locations": [], "entities": {"persons": [{"name": "telix pharmaceuticals limite", "sentiment": "negative"}, {"name": "shintaro nishimura", "sentiment": "none"}, {"name": "christian behrenbruch", "sentiment": "none"}, {"name": "takeshi oka", "sentiment": "none"}], "locations": [{"name": "kyoto japan", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "telix japan", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "telix pharmaceuticals establishes japanese subsidiary", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "telix pharmaceuticals (japan) ltd", "sentiment": "none"}, {"name": "telix", "sentiment": "none"}, {"name": "telix pharmaceuticals limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE, Australia and KYOTO Japan, Jan. 15, 2018 (GLOBE NEWSWIRE) -- Telix Pharmaceuticals Limited (ASX.TLX) (“Telix”, the “Company”), an Australian biopharmaceutical company focused on the development of diagnostic and therapeutic products based on targeted radiopharmaceuticals or “molecularly-targeted radiation” (MTR), has today announced the establishment Telix Pharmaceuticals (Japan) Ltd (“Telix Japan”) and appointment of the first two members of the Japanese leadership team.\nTelix Japan is wholly-owned operating subsidiary of Telix Pharmaceuticals Limited. The purpose of the subsidiary is to support the Company’s Japanese clinical and radiopharmaceutical manufacturing activities and to establish a commercial footprint in the Japan, an important market for Telix’s products. To lead the Telix Japan activities, Dr. Shintaro Nishimura and Dr. Takeshi Oka have been appointed as President and Chief Operating Officer, and Chief Medical Officer (Japan), respectively.\nTelix Co-Founder and CEO Dr. Christian Behrenbruch stated, “Japan is one of the most important prospective markets for Telix’s products and our activities in Japan covers a range of manufacturing and collaboration activities with leading Japanese clinical sites and biopharmaceutical companies. The Japanese radiopharmaceutical landscape is evolving rapidly, and we are pleased to have been able to hire two extremely high-caliber executives to lead our development and commercial activity.”\nDr. Nishimura stated, “Telix has an exciting commercial opportunity for its products in Japan and Dr. Oka and I are pleased to be leading the Company’s activities in the Japanese market. There is considerable interest in Telix’s oncology pipeline from our top nuclear medicine clinics and we hope to use this interest to obtain the additional data required to meet the marketing authorization requirements of the Pharmaceuticals and Medical Devices Agency (PMDA) 1 to make Telix’s technology available to Japanese cancer patients.”\nAbout Telix Pharmaceuticals Limited\nTelix is an Australian biopharmaceutical company focused on the development of diagnostic and therapeutic products based on targeted radiopharmaceuticals or molecularly-targeted radiation (MTR). The Company is developing an advanced portfolio of oncology products that address significant unmet medical need in renal, prostate and brain (glioblastoma) cancer. Telix is listed on the Australian Securities Exchange (ASX:TLX).\nFor more information visit www.telixpharma.com .\nBiography: Shintaro Nishimura, PhD\nDr. Nishimura is a seasoned pharmaceutical executive and has previously held leadership roles at Fujisawa Pharmaceuticals, Astellas Pharma, Eli Lilly and ImaginAb, as well as notable academic appointments in the field of nuclear medicine and molecular imaging at Kyoto Prefecture University of Medicine, the University of Tsukuba and Tokohu University. Dr. Nishimura received his doctorate in organic chemistry from Keio University and was a post-doctoral researcher at the University of Michigan Medical School.\nBiography: Dr. Takashi Oka, MD\nDr. Oka is a pharmacist, radiologist and nuclear medicine physician by training and a highly experienced drug developer. He originally trained in pharmacology at Tokyo University and then completed his MD at Yokohama City University (YCU) Medical School, with subsequent academic appointments in radiology at YCU and Tsukuba University. Prior to joining Telix, Dr. Oka’s commercial roles included senior medical leadership positions at Yokohama Bay Bioimaging, Sanofi and Mylan.", "external_links": ["https://www.globenewswire.com/Tracker?data=KKf91OshcWCLoF0Oj41Xv7DbF8t56MvetFueTdTlWhJnlLcP4m03jwl6Z2n_yQef4I3Mq0HAV9Oy7pxUOavU4PVLUurkiFWMKArUmmbS5hE="], "published": "2018-01-15T05:12:00.000+02:00", "crawled": "2018-01-15T06:03:21.005+02:00", "highlightTitle": ""}