{"organizations": [], "uuid": "ca3151ddcf451e55befc623364737afb40530ad3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/nigeria-cenbank-politics/nigerian-political-standoff-threatens-central-bank-independence-idUSL8N1PI4V8", "country": "US", "domain_rank": 408, "title": "Nigerian political standoff threatens central bank independence", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:52:00.000+02:00", "replies_count": 0, "uuid": "ca3151ddcf451e55befc623364737afb40530ad3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/nigeria-cenbank-politics/nigerian-political-standoff-threatens-central-bank-independence-idUSL8N1PI4V8", "ord_in_thread": 0, "title": "Nigerian political standoff threatens central bank independence", "locations": [], "entities": {"persons": [{"name": "buhari", "sentiment": "none"}, {"name": "michael famoroti", "sentiment": "none"}], "locations": [{"name": "lagos", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mpc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "vetiva capital", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAGOS, Jan 23 (Reuters) - A standoff between Nigeria’s presidency and parliament over confirmation of new members of the central bank’s interest rate committee is threatening the bank’s independence and damaging fragile investor confidence in Africa’s biggest economy.\nThe central bank had been due to announce its interest rate decision on Jan. 23, a day after a Monetary Policy Committee (MPC) meeting. But the meeting was not held due to a lack of new members whose confirmation is pending before lawmakers.\nThe bank said on Monday it had been unable to form a quorum and would maintain its benchmark rate at 14 percent.\nOn Tuesday, the stock market fell to a one-week low, amid fears that monetary policy was being held hostage by the spat between President Buhari’s office and the Senate over government appointments.\n“The development is a blow to the idea of central bank independence in the country and could erode confidence,” said Michael Famoroti, chief economist at Vetiva Capital.\nAt least six members of the MPC are needed to approve an interest rate decision, but at the moment there are only four.\nAt the heart of the matter is a stalemate between the presidency and Senate over the latter’s powers to confirm or deny executive nominees to government posts.\nThe Senate is refusing to approve presidential nominees, including those for the MPC, because it believes Buhari has sidestepped their authority in appointing his choice of head of the financial crimes watchdog in an “acting” capacity, after he was twice blocked by the Senate.\n“Once investors believe that governance has broken down in the country it could lead to an erosion of confidence. If there’s an emergency, what policy adjustments will the central bank make and how quickly?” said Bismark Rewane, managing director at Lagos-based Financial Derivatives.\nDIRE SITUATION The central bank and the presidency both declined to comment.\nNigeria emerged from recession last year but growth is still fragile and inflation - which has been slowing - needs to fall faster for the central bank to be able to alter its hawkish stance on interest rates, analysts say.\nInvestors shunned Nigerian assets over the past three years and have only started to return after the naira was floated for them last year. Some are still on the sidelines waiting for stability.\nThe bank has kept rates at 14 percent for over a year to attract foreign investors into bonds to support the naira . But Abuja wants to see rates come down to lower government costs at a time when inflation is in double digits and the 2019 presidential election looms.\n“The key thing to watch for is how long the impasse continues,” Vetiva’s Famoroti said.\n“It would signify a severe political disruption in monetary policy - an unwelcome one in a pre-election year - and could cause investor jitters that put pressure on the currency and the economy.”\nIn October, Central Bank Governor Godwin Emefiele said he expected inflation to fall at a faster pace and reach the high single-digits by the middle of 2018. (Reporting by Chijioke Ohuocha; Editing by Ed Cropley and William Maclean)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:52:00.000+02:00", "crawled": "2018-01-24T15:49:41.001+02:00", "highlightTitle": ""}