{"organizations": [], "uuid": "6a81ead6e9e4d13ec0718d5480a8a593e7459c68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-output-power/update-2-as-gas-crisis-hit-china-coal-miners-utilities-ramped-up-output-idUSL3N1PD2XJ", "country": "US", "domain_rank": 408, "title": "UPDATE 3-As gas crisis hit, China coal miners, utilities ramped up output", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T17:07:00.000+02:00", "replies_count": 0, "uuid": "6a81ead6e9e4d13ec0718d5480a8a593e7459c68"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-output-power/update-2-as-gas-crisis-hit-china-coal-miners-utilities-ramped-up-output-idUSL3N1PD2XJ", "ord_in_thread": 0, "title": "UPDATE 3-As gas crisis hit, China coal miners, utilities ramped up output", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "muyu xu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "national bureau of statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Coal accounted for 77.5 pct of total power output in Dec * Coal output highest since Dec 2015 * Thermal power highest on government records back to Feb 2015 * Data undermines long-term aim to wean nation of coal power (Adding graphics) By Josephine Mason and Muyu Xu BEIJING, Jan 18 (Reuters) - China's coal miners and thermal power plants ramped up output to their highest in years in December, data showed on Thursday, in a rush to feed unexpectedly strong demand from millions of homes as natural gas shortages triggered a winter heating crisis. The jump came as millions of homes across northern China used more electricity and gas to heat their homes after being forced to switch from coal. It also reflects a ramp-up in coal-fired power use due to the gas shortages caused by the ambitious plan, undermining the government's long-term plan to boost clean energy use and wean the nation off its most-used fuel. The production of thermal electricity, generated almost entirely by coal-fired capacity, rose to 441.7 billion kilowatt-hours (kWh), the highest in the National Bureau of Statistics' records going back to February 2015. \"This year, Beijing's pullback on coal-to-gas conversion has benefited coal consumption,\" said Cheng Gong, analyst at China National Coal Association. Electricity demand in December is typically higher as people crank up the heat in their homes because of colder temperatures. However, the above-normal demand last month caused thermal power output to rise 17 percent from November and 3.6 percent from December 2016. Full-year output rose 4.6 percent. Last month, the world's top coal miners churned out their highest tonnage since December 2015. The data highlights the challenge for Beijing as it seeks to curb coal use, reduce excess mining capacity and boost wind and solar power. In early December, Beijing scaled back its conversion of households to natural gas heating from coal across northern China after provinces almost ran out of gas. It also eased restrictions on coal-power projects. Thermal power accounted for 77.5 percent of total output in December, up from 72 percent in November, well away from the government's target for coal-fired power to account for 55 percent of installed capacity by 2020. The most-active coal futures on the Zhengzhou Commodity Exchange rose to a record 650 yuan ($100.99) a tonne on Thursday over concerns of tight supplies in the peak heating period. Coal futures surged over 70 percent in 2017. The country generated a total of 569.9 billion kWh of power in December, the highest since August, up 6 percent from a year earlier and 10 percent higher than November, the data showed. Full-year power generation reached 6.28 trillion kWh, up 5.7 percent compared with 2016. Below is a breakdown of the power sources measured in kWh: December Pct change 2017 Pct change yr-on-yr yr-on-yr Power 569.9 bln 6.0 6.28 trln 5.7 Thermal 441.7 bln 3.6 4.61 trln 4.6 Hydro 73.6 bln 14.0 1.08 trln 3.4 Nuclear 22.2 bln 3.8 248.1 bln 16.3 Wind 27.1 bln 25.7 269.5 bln 21.4 Solar 5.3 bln 46.8 64.8 bln 38.0 (Reporting by Josephine Mason and Muyu Xu; Editing by Christian Schmollinger)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T17:07:00.000+02:00", "crawled": "2018-01-19T12:31:32.002+02:00", "highlightTitle": ""}