{"organizations": [], "uuid": "ae71441fdd555fd2907109ae6a73954ee8a0b71a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/15/102088286-452327124.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/shire-cuts-2020-revenue-target-prepares-for-spin-off-of-adhd-drugs.html", "country": "US", "domain_rank": 767, "title": "Shire cuts 2020 revenue target, prepares for spin-off of ADHD drugs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.161, "site_type": "news", "published": "2018-01-08T22:42:00.000+02:00", "replies_count": 0, "uuid": "ae71441fdd555fd2907109ae6a73954ee8a0b71a"}, "author": "Simon Dawson", "url": "https://www.cnbc.com/2018/01/08/shire-cuts-2020-revenue-target-prepares-for-spin-off-of-adhd-drugs.html", "ord_in_thread": 0, "title": "Shire cuts 2020 revenue target, prepares for spin-off of ADHD drugs", "locations": [], "entities": {"persons": [{"name": "shire", "sentiment": "negative"}, {"name": "flemming ornskov", "sentiment": "none"}, {"name": "simon dawson", "sentiment": "none"}, {"name": "baxalta", "sentiment": "none"}], "locations": [], "organizations": [{"name": "shire", "sentiment": "negative"}, {"name": "modern medicine shire", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "getty images  shire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shire ditched its revenue target of $20 billion by 2020 on Monday due to increased generic competition and new drugs from rivals, saying it would split its rare disease and hyperactivity medicines businesses to boost performance.\nThe London-listed pharmaceutical group said total revenue would now reach $17-18 billion by 2020, dropping the goal set two years ago when it acquired hemophilia specialist Baxalta.\nChief Executive Flemming Ornskov, said that revenue had tripled to $15 billion in five years and that $20 billion was a \"stretch target\". The consensus among industry analysts for annual revenue by 2020 stood at around $17 billion, he said.\n\"There's been a change in the rate that genericisation takes place across the industry (and) we're facing some additional competition (in) hematology,\" he said after the update, which triggered a fall of as much 6 percent in Shire shares.\nShire stock closed down 5.4 percent at 36.65 pounds.\nAnalysts at HSBC said in November that Shire should reconsider its 2020 guidance after Roche reported positive clinical data from its hemophilia agent Hemlibra, a potential blockbuster which threatens some of Shire's products.\nShire had already been dealt a blow in June when U.S. regulators approved a generic competitor to Lialda, its drug to treat ulcerative colitis.\nOrnskov, however, said the setbacks had to be weighed against \"significantly accelerated growth\" in its immunology franchise. \"The prospects for Shire mid-to long term have not changed,\" he added.\nSeparating Shire into two units, one focusing on small molecule pills that treat conditions like attention deficit hyperactivity disorder (ADHD) and the other on complex biologics for rare diseases, would improve performance in both, he said.\nShire has been a leader in neuroscience since it acquired Adderall-owner Richwood Pharmaceutical 20 years ago, and it had decided after a review that the unit warranted additional focus and investment.\nThe company said in August it was considering spinning off its hyperactivity drugs into a standalone group that analysts said could be worth as much as $8.5 billion.\nShire said it will continue to evaluate the merits of an independent listing for each of the two divisions, and would update the market in the second half of 2018.", "external_links": [], "published": "2018-01-08T22:42:00.000+02:00", "crawled": "2018-01-08T22:42:42.000+02:00", "highlightTitle": ""}