{"organizations": [], "uuid": "21ecce4fcba96894dcf628ca191077fa11c21d7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-slides-on-u-s-mnuchin-remarks-booming-europe-idUSL8N1PJ1H6", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Dollar slides on U.S. Mnuchin remarks, booming Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:03:00.000+02:00", "replies_count": 0, "uuid": "21ecce4fcba96894dcf628ca191077fa11c21d7d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-slides-on-u-s-mnuchin-remarks-booming-europe-idUSL8N1PJ1H6", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar slides on U.S. Mnuchin remarks, booming Europe", "locations": [], "entities": {"persons": [{"name": "abhinav ramnarayan", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Abhinav Ramnarayan\nLONDON, Jan 24 (Reuters) - The U.S. dollar hit fresh lows on Wednesday after U.S. Treasury Secretary Steven Mnuchin said he welcomed its weakness and figures showed that the euro zone economy started the year at its strongest pace in over a decade.\nFear of protectionism from the world’s largest economy had already pushed the greenback lower, but this move was given another push by Mnuchin’s remarks at the annual Davos summit of business and political leaders.\nMeanwhile euro zone businesses had a much better start to 2018 than anyone polled by Reuters expected, ramping up activity at the fastest rate since the middle of 2006, a survey showed on Wednesday.\nThe euro hit a three-year high of $1.2345, the dollar fell below 110.00 yen for the first time since September and hit new three-year lows on a trade-weighted basis, while sterling was at its highest level against the greenback since the Brexit referendum vote in June 2016.\nU.S. President Donald Trump is due to speak Friday at the World Economic Forum in Davos, Switzerland, and investors are concerned he will use the speech to signal a more protectionist policy stance.\n“It looks as if U.S. politics are indeed affecting the currency market, especially as they start to affect trade policy,” said Marshall Gittler, chief strategist at ACLS Global, pointing to recently-introduced import tariffs as an example.\nTrump slapped steep tariffs on imported washing machines and solar panels on Monday, giving a boost to Whirlpool Corp and dealing a setback to the renewable energy industry in the first of several potential trade restrictions.\nFresh signs of growth elsewhere in the developed world provided compelling alternatives for investors worried about the greenback.\nJapan’s exports to China and Asia hit record levels as shipments rose for a 13th straight month in December and manufacturing growth hit a four-year high in January, pointing to an economy that powered through the fourth quarter and into 2018.\nMeanwhile the euro surged to a fresh three-year high of $1.2345 ahead of Thursday’s European Central Bank meeting, which is in focus following recent commentary that the central bank could change its policy guidance early this year.\nThis after the euro zone’s economy outpaced that of the U.S. in 2017 and shows further signs of strength in the New Year.\nIn a strong sign of the positive sentiment towards the region, Spain generated over 40 billion euros of demand in a sale of 10-year government bonds in what is likely one of the largest order books in Europe ever.\nMost low-rated “peripheral” euro zone government bond yields are now trading at their lowest level against benchmark German peers in years; another sign of confidence in the region.\nMost emerging market currencies climbed on Wednesday, with the yuan and South Africa’s rand both touching a more than two-year high as the dollar extended in its weakest run since 2010-11.\nSTOCKS DIVIDED MSCI’s world equity index, which tracks shares in 47 countries, hit new highs in a continuation of a long running theme but on Wednesday it was a bit more of a mixed picture.\nWall Street scaled new heights overnight on the back of U.S. President Donald Trump’s tax cuts, which will see J.P. Morgan implement a $20 billion investment plan.\nBut MSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS eased 0.2 percent, having jumped 1.2 percent on Tuesday to an all-time peak.\nEuropean shares were also mixed, with a decline in utility stocks and tumbling tech stocks on fresh Apple worries weighing although a strong update from Novartis NOVN.S provided support.\nThe British pound also powered above $1.41, its highest since the vote to leave the European Union in June 2016, aided by the weak dollar and optimism around Britain’s chances of securing a favourable Brexit deal.\nThe dollar’s decline has been a boon to commodities priced in the currency, with gold edging up to $1,341.81 an ounce .\nOil prices were consolidating after jumping more than 1 percent on Tuesday when Brent crude hitting $70 a barrel for the first time in a week.\nBrent futures was off 22 cents at $69.75, still not far off the three-year high of $70.37 reached on Jan. 15, while U.S. crude was marginally higher 4 cents to $64.52 a barrel.\nFor Reuters Live Markets blog on European and UK stock markets open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar (Additional reporting by Wayne Cole in SYDNEY and Marc Jones in LONDON; Editing by Toby Chopra)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T18:03:00.000+02:00", "crawled": "2018-01-25T13:13:17.006+02:00", "highlightTitle": ""}