{"organizations": [], "uuid": "171566970784553886fba4af9f2dd3e24568de54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-powerschool-peopleadmin/vista-equity-explores-options-for-powerschool-peopleadmin-sources-idUSKBN1F9029", "country": "US", "domain_rank": 408, "title": "Vista Equity explores options for PowerSchool, PeopleAdmin: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T03:12:00.000+02:00", "replies_count": 0, "uuid": "171566970784553886fba4af9f2dd3e24568de54"}, "author": "", "url": "https://www.reuters.com/article/us-powerschool-peopleadmin/vista-equity-explores-options-for-powerschool-peopleadmin-sources-idUSKBN1F9029", "ord_in_thread": 0, "title": "Vista Equity explores options for PowerSchool, PeopleAdmin: sources", "locations": [], "entities": {"persons": [{"name": "liana b. baker", "sentiment": "none"}, {"name": "andrew berlin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "vista equity", "sentiment": "negative"}, {"name": "ubs group ag", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "powerschool", "sentiment": "none"}, {"name": "vista equity partners management llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Private equity firm Vista Equity Partners Management LLC is exploring options for two software companies it owns, PowerSchool and PeopleAdmin, that could involve combining them in a deal worth between $2 billion to $3 billion, according to people familiar with the matter.\nAny deal would come as schools use more digital tools to enhance learning and reduce operational costs. Private equity firms have been taking advantage of the high valuations in the educational technology sector to cash out on their holdings.\nVista is working with investment bank UBS Group AG to evaluate its options for the two companies, the sources said this week, asking not to be named because the matter is confidential.\nVista is exploring a full range of options for the companies which could involve selling a minority or majority stake, a recapitalization, merging the two companies, an initial public offering or using the companies as a vehicle to buy another target, according to the sources.\nVista would like to keep a significant stake in the companies in whatever transaction it chooses, and no deal is imminent, the sources added.\nUBS and Vista declined to comment. PowerSchool and PeopleAdmin did not respond to requests for comment.\nPowerSchool, based in Folsom, California, provides education technology to schools and is projected to generate $280 million in revenue this year, according to one of the sources familiar with the companies. PeopleAdmin’s revenue was not known.\nVista bought PowerSchool for $350 million in 2015 from Pearson Plc and has spent more than $1 billion on subsequent acquisitions that it combined with the company including SunGard’s public sector and education business which closed last year. It struck an agreement with Microsoft Corp earlier this week to combine their products in K-12 schools.\nPeopleAdmin, a talent management software firm based in Austin, Texas, was acquired by Vista in 2014 for an undisclosed sum.\nVista has previously combined educational assets only to sell them on to another company. In 2014, it sold Relias Learning, a combination of two companies, to Europe’s largest media group, Bertelsmann SE & Co. It completed a $1.55 billion deal to buy Advisory Board’s education business last year.\nDeal activity has been strong in the education sector. Reuters has reported that Baring Private Equity Asia is in talks to buy testing firm Prometric for about $1 billion, while Blackstone Group LP bought Ascend Learning LLC from Providence Equity last year for more than $2 billion.\nReporting by Liana B. Baker and Andrew Berlin in New York; editing by Diane Craft\n ", "external_links": [], "published": "2018-01-20T03:12:00.000+02:00", "crawled": "2018-01-20T03:37:57.013+02:00", "highlightTitle": ""}