{"organizations": [], "uuid": "bd80e22d82075bde018b13ee22ad3d064556643c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-intermediate-duration-preferred-income-fund-declares-its-monthly-common-share-distribution-of-0-point-1525-per.html", "country": "US", "domain_rank": 767, "title": "First Trust Intermediate Duration Preferred & Income Fund Declares its Monthly Common Share Distribution of $0.1525 Per Share for February", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:55:00.000+02:00", "replies_count": 0, "uuid": "bd80e22d82075bde018b13ee22ad3d064556643c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-intermediate-duration-preferred-income-fund-declares-its-monthly-common-share-distribution-of-0-point-1525-per.html", "ord_in_thread": 0, "title": "First Trust Intermediate Duration Preferred & Income Fund Declares its Monthly Common Share Distribution of $0.1525 Per Share for February", "locations": [], "entities": {"persons": [], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust Intermediate Duration Preferred & Income Fund (the \"Fund\") (NYSE: FPF) has declared the Fund’s regularly scheduled monthly common share distribution in the amount of $0.1525 per share payable on February 15, 2018, to shareholders of record as of February 2, 2018. The ex-dividend date is expected to be February 1, 2018. The monthly distribution information for the Fund appears below.\nFirst Trust Intermediate Duration Preferred & Income Fund (FPF):\nDistribution per share: $0.1525 Distribution Rate based on the January 19, 2018 NAV of $24.95: 7.33% Distribution Rate based on the January 19, 2018 closing market price of $23.75: 7.71% The majority, and possibly all, of this distribution will be paid out of net investment income earned by the Fund. A portion of this distribution may come from net short-term realized capital gains or return of capital. The final determination of the source and tax status of all 2018 distributions will be made after the end of 2018 and will be provided on Form 1099-DIV.\nThe Fund is a non-diversified, closed-end management investment company that seeks to provide a high level of current income. The Fund has a secondary objective of capital appreciation. The Fund will seek to achieve its investment objectives by investing in preferred and other income-producing securities. Under normal market conditions, the Fund will invest at least 80% of its Managed Assets in a portfolio of preferred and other income-producing securities issued by U.S. and non-U.S. companies, including traditional preferred securities, hybrid preferred securities that have investment and economic characteristics of both preferred securities and debt securities, floating rate and fixed-to-floating rate preferred securities, debt securities, convertible securities and contingent convertible securities.\nFirst Trust Advisors L.P., the Fund's investment advisor, along with its affiliate, First Trust Portfolios L.P., are privately-held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 31, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts.\nStonebridge Advisors LLC (\"Stonebridge\"), the Fund's investment sub-advisor, is a registered investment advisor specializing in preferred and hybrid securities. Stonebridge was formed in December 2004 by First Trust Portfolios L.P. and Stonebridge Asset Management, LLC. The company had assets under management or supervision of approximately $8.8 billion as of December 31, 2017. These assets come from separate managed accounts, unified managed accounts, unit investment trusts, an open-end mutual fund, actively managed exchange-traded funds, and the Fund.\nPast performance is no assurance of future results. Investment return and market value of an investment in the Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factors: The Fund is subject to risks, including the fact that it is a non-diversified closed-end management investment company.\nPreferred/hybrid and debt securities in which the Fund invests are subject to various risks, including credit risk, interest rate risk, and call risk. Credit risk is the risk that an issuer of a security will be unable or unwilling to make dividend, interest and/or principal payments when due and that the value of a security may decline as a result. Credit risk may be heightened for the Fund because it invests in below investment grade securities, which involve greater risks than investment grade securities, including the possibility of dividend or interest deferral, default or bankruptcy. Interest rate risk is the risk that the value of fixed-rate securities in the Fund will decline because of rising market interest rates. Call risk is the risk that performance could be adversely impacted if an issuer calls higher-yielding debt instruments held by the Fund.\nBecause the Fund is concentrated in the financials sector, it will be more susceptible to adverse economic or regulatory occurrences affecting this sector, such as changes in interest rates, loan concentration and competition.\nInvestment in non-U.S. securities is subject to the risk of currency fluctuations and to economic and political risks associated with such foreign countries.\nUse of leverage can result in additional risk and cost, and can magnify the effect of any losses.\nThe risks of investing in the Fund are spelled out in the shareholder reports and other regulatory filings.\nThe information presented is not intended to constitute an investment recommendation for, or advice to, any specific person. By providing this information, First Trust is not undertaking to give advice in any fiduciary capacity ERISA and the Internal Revenue Code. First Trust has no knowledge of and has not been provided any information regarding any investor. Financial advisors must determine whether particular investments are appropriate for their clients. First Trust believes the financial advisor is a fiduciary, is capable of evaluating investment risks independently and is responsible for exercising independent judgment with respect to its retirement plan clients.\nThe Fund’s daily closing New York Stock Exchange price and net asset value per share as well as other information can be found at www.ftportfolios.com or by calling 1-800-988-5891.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006602/en/\nFirst Trust Intermediate Duration Preferred & Income Fund\nPress Inquiries:\nJane Doyle, 630-765-8775\nor\nAnalyst Inquiries:\nJeff Margolin, 630-915-6784\nor\nBroker Inquiries:\nJeff Margolin, 630-915-6784\nSource: First Trust Intermediate Duration Preferred & Income Fund", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51747161&newsitemid=20180122006602&lan=en-US&anchor=www.ftportfolios.com&index=1&md5=0f7e9d25784d3d075f522cfc68c1c6bb", "http://www.businesswire.com/news/home/20180122006602/en/"], "published": "2018-01-23T00:55:00.000+02:00", "crawled": "2018-01-23T02:16:07.016+02:00", "highlightTitle": ""}