{"organizations": [], "uuid": "399d3c6fcd4f0eced12ef04c85be66230259ccce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/banks-fintech/goldman-sachs-wells-fargo-and-others-invest-38-million-in-research-tech-startup-idUSL1N1PC27V", "country": "US", "domain_rank": 408, "title": "Goldman Sachs, Wells Fargo and others invest $38 million in research tech startup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "399d3c6fcd4f0eced12ef04c85be66230259ccce"}, "author": "", "url": "https://www.reuters.com/article/banks-fintech/goldman-sachs-wells-fargo-and-others-invest-38-million-in-research-tech-startup-idUSL1N1PC27V", "ord_in_thread": 0, "title": "Goldman Sachs, Wells Fargo and others invest $38 million in research tech startup", "locations": [], "entities": {"persons": [{"name": "anna irrera", "sentiment": "none"}], "locations": [{"name": "visible alpha", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "negative"}, {"name": "bank of america corp", "sentiment": "none"}, {"name": "macquarie group ltd", "sentiment": "none"}, {"name": "banco santander sa", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "wells fargo & co", "sentiment": "none"}, {"name": "royal bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "exane bnp paribas", "sentiment": "none"}, {"name": "goldman sachs group inc", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:00 PM / in 16 minutes Goldman Sachs, Wells Fargo and others invest $38 million in research tech startup Anna Irrera 3 Min Read \nNEW YORK, Jan 18 (Reuters) - Goldman Sachs Group Inc has led a $38 million investment round by large banks in Visible Alpha, a young New York-based company that helps investment managers better value the equity research services they receive from brokers. \nWells Fargo & Co, Banco Santander SA, Exane BNP Paribas, Macquarie Group Ltd and Royal Bank of Canada participated in the strategic investment round, the company said on Thursday. \nVisible Alpha’s existing investors including Bank of America Corp, Citigroup Inc and Morgan Stanley also joined. \nThe startup said it will use the injection of cash to expand globally and ensure that its offering keeps up with client demand. \nLaunched in early 2017, Visible Alpha uses technology to help fund managers keep track of the amount and value of equity research and corporate access that they receive from their brokers. It also offers tool that aggregate data from analysts to make it easier to use and more valuable for investors. \nIt is among a growing group of financial technology companies that are hoping to take advantage of regulatory changes in Europe and pressure on asset management fees that are driving changes in the equity research business model. \nNew rules in the European Union’s revised Markets in Financial Instruments Directive (Mifid II), an overhaul of the region’s trading rulebook that came into force this month, require asset managers to pay for research out of their own pocket. This has increased demand for tools that can help them gauge the quality of research. Large brokers have traditionally “bundled” research fees together with what they charge to execute trades. \nOver the past few years asset managers have also been under pressure to cut fees due to lackluster returns, driving them to be more aware about how they spend their research dollars. \nThese trends have “increased the amount of pressure to have analysts demonstrate” the value they are providing, said in an interview Scott Rosen, the CEO of Visible Alpha. \nThe company says it works with around 450 research providers and has more than 100 buy-side firms as clients which manage a combined $16 trillion in assets. It mainly operates in the United States and plans to expand further into Europe, Asia and Latin America, Rosen said. (Reporting by Anna Irrera; Editing by Lisa Shumaker)", "external_links": [], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T14:17:38.000+02:00", "highlightTitle": ""}