{"organizations": [], "uuid": "c88ad290e8201d26ee07951cff261a9f2ee99ada", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-692694196.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/apple-homepod-price-delayed/", "country": "US", "domain_rank": 1196, "title": "Apple HomePod: Why the Smart Speaker Was Delayed | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.981, "site_type": "news", "published": "2018-01-17T13:07:00.000+02:00", "replies_count": 0, "uuid": "c88ad290e8201d26ee07951cff261a9f2ee99ada"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/17/apple-homepod-price-delayed/", "ord_in_thread": 0, "title": "Apple HomePod: Why the Smart Speaker Was Delayed | Fortune", "locations": [], "entities": {"persons": [{"name": "don reisinger", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "amazon echo", "sentiment": "none"}, {"name": "inventec", "sentiment": "none"}, {"name": "google home", "sentiment": "none"}, {"name": "taipei times", "sentiment": "none"}, {"name": "homepod", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger 11:07 AM EST \nAs Apple’s HomePod smart speaker nears its release, a new report sheds some light on why it was delayed last year. \nApple was forced to delay the HomePod in December after discovering that the device’s software required some tweaks to how it interacted with the hardware, the Taipei Times is reporting , citing an “industry source” who claims to have knowledge of the decision. Apple has since worked out those problems and is now moving forward with its release plans, according to the news outlet’s sources. \nOther Taipei Times sources told the outlet that one of two HomePod assemblers, Inventec, has already shipped 1 million units as the smart speaker prepares for launch. Apple’s orders suggest the company’s supplier partners could ship up to 12 million units by the end of the year, according to the report, which was earlier discovered by Apple-tracking site 9to5Mac. \nApple unveiled the HomePod last year as a competitor with Amazon Echo, Google Home, and other smart home speakers. However, Apple’s focused much of its sales pitch on sound quality, rather than the abilities its virtual personal assistant Siri could deliver through the device. \nGet Data Sheet , Fortune’s technology newsletter \nAt $349, the HomePod will quickly become one of the most expensive smart speakers on the market. But Apple executives have argued that the combination of smart home control and high-end speakers more than justifies the price. \nApple was supposed to release the HomePod in December but ultimately announced in November that it needed to delay the speaker for an unspecified amount of time . The company has been silent on the HomePod ever since. \nNow that units are shipping from manufacturing facilities, however, it appears Apple is getting closer to a launch. Earlier this month, analysts at GBH Insights predicted HomePod would hit store shelves within the next four to six weeks. \nApple did not immediately respond to a Fortune request for comment on the report. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T13:07:00.000+02:00", "crawled": "2018-01-17T21:20:18.046+02:00", "highlightTitle": ""}