{"organizations": [], "uuid": "521544880793aeb4fb840516a38f54b298698120", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-shrug-off-u-s-government-shutdown-dollar-dips-idUSL8N1PH2O8", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks shrug off U.S. government shutdown, dollar dips", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-22T21:30:00.000+02:00", "replies_count": 0, "uuid": "521544880793aeb4fb840516a38f54b298698120"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-shrug-off-u-s-government-shutdown-dollar-dips-idUSL8N1PH2O8", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks shrug off U.S. government shutdown, dollar dips", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Investors appear unruffled by U.S. government shutdown\n* World shares up slightly\n* U.S. Treasury yields near 3-1/2-year high\n* Dollar slips vs euro; oil rises\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes\nLONDON, Jan 22 (Reuters) - World stocks and U.S. bond markets on Monday shrugged off a government shutdown in Washington, although the dollar pulled back and wallowed near three-year lows as the euro resumed its strong start to the year.\nU.S. Treasury yields, which have tended to fall during previous government shutdowns, rose as investors saw limited economic fallout from the political standoff and focused instead on a global economy motoring ahead and U.S. inflation pressures.\nAfter a mixed start, European shares turned positive in mid-morning trade as markets focused on a flurry of mergers and acquisitions and upcoming corporate earnings reports. Progress towards an end to political deadlock in Germany helped the mood.\nThe pan-European STOXX 600 index was up 0.1 percent. Germany’s DAX was flat, France’s CAC-40 up 0.1 percent and the UK’s FTSE was unchanged.\nThe MSCI world equity index, which tracks shares in 47 countries, rose slightly.\nU.S. stock futures were down marginally after Wall Street set record highs on Friday, but investors were taking the view that the dispute between President Donald Trump and Democrats could be resolved without a prolonged shutdown.\n“We’re not worried as we have been here before. Perhaps this is more fractious and may take longer to resolve, but it shouldn’t have a massive economic impact,” said Patrick O‘Donnell, investment manager at Aberdeen Asset Management.\nA plan put forward by a group of senators to extend government funding to Feb. 8 and work on resolving an immigration dispute has also helped ease concerns about a more serious deadlock.\nA vote in the Senate will be held at 12 p.m. (1700 GMT) on Monday.\nIn a sign that the market was undeterred by the dispute in Washington, the benchmark U.S. 10-year Treasury yield on Monday reached close to its highest level in more than three years, an extension of the sell-off in U.S. bonds since September.\nDOLLAR NEAR THREE-YEAR LOW The dollar remained stuck near three-year lows, continuing its weak start to the year.\nThe single currency gained 0.2 percent and was trading at $1.22435, although volatility in the euro-dollar exchange rate was more muted than would have been expected, given flare-ups during previous U.S. government shutdowns.\n“Unless the U.S. government shutdown ends very quickly, which may boost the dollar, markets are focusing on the two other cross-currents this week, namely the BOJ and the ECB, with the latter likely to surprise euro bulls,” said Alvin Tan, a currency strategist at Societe Generale in London.\nIn European bond markets, Spain’s borrowing costs dropped to a six-week low and the gap over its German peers fell to its tightest in almost three years after Fitch Ratings gave Spain its first “A” rating since the euro zone debt crisis.\nGreece’s short-dated yields also fell after S&P Global Ratings upgraded the country’s credit ratings for the first time in two years.\nMost other euro zone bond yields were little changed. Analysts said investors were probably moving to the sidelines before the European Central Bank’s first meeting of 2018 this Thursday.\nOil prices climbed higher after comments from Saudi Arabia that cooperation between oil producers who have cut production to boost prices would continue beyond 2018.\nAfter rising earlier, oil futures were flat. Brent crude futures stood at $68.58 a barrel by 1230 GMT, not far from the $70.37 level hit on Jan. 15. That was oil’s highest level since December 2014.\nFor Reuters Live Markets blog on European and UK stock markets, open a news window on Reuters Eikon by pressing F9 and typing “Live Markets” in the search bar.\nAdditional reporting by Dhara Ranasinghe and Saikat Chatterjee, editing by Larry King\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T21:30:00.000+02:00", "crawled": "2018-01-22T19:22:07.052+02:00", "highlightTitle": ""}