{"organizations": [], "uuid": "77f3e1497e3a6b333b2f99fe0882faf98635f9fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-vietnam-slides-indonesia-marks-new-closing-high-idUSL3N1PC3AV", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Vietnam slides; Indonesia marks new closing high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:22:00.000+02:00", "replies_count": 0, "uuid": "77f3e1497e3a6b333b2f99fe0882faf98635f9fc"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-vietnam-slides-indonesia-marks-new-closing-high-idUSL3N1PC3AV", "ord_in_thread": 0, "title": "SE Asia Stocks-Vietnam slides; Indonesia marks new closing high", "locations": [], "entities": {"persons": [{"name": "manny cruz", "sentiment": "none"}, {"name": "devika syamnath", "sentiment": "none"}, {"name": "nyugen", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "asiasec equities inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "viet capital se", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:22 AM / in an hour SE Asia Stocks-Vietnam slides; Indonesia marks new closing high Reuters Staff 4 Min Read * Vietnam slips on profit-booking as oil slides * Banks pull down Singapore, Philippine indexes By Devika Syamnath Jan 17 (Reuters) - Vietnamese stocks posted their biggest loss in well over a year on Wednesday and Indonesia marked a new closing high for a second session while others in the region were largely muted. Earlier in the day, Asian equities retreated from record highs as the region's resource shares were pummelled by falling oil and commodity prices. \"The minor decline in Wall Street has spurred some selling pressure in regional markets,\" said Manny Cruz, an analyst at Asiasec Equities Inc. The Vietnam index ended 2.7 percent lower, its biggest fall since November 2016, as investors locked in gains following weak oil prices. Oil and gas shares have been leading the market recently, but after Brent fell overnight, investors decided to take profits before any other risks arose, said Nyugen The Minh, a research manager at Viet Capital Securities. A high level of margin trading in blue-chips also triggered strong selling, Minh added. Energy and utilities led the fall, with PetroVietnam Gas down 3.5 percent while Vietnam National Petroleum slumped 5.3 percent. Vietnam's biggest corruption trial for years drew to a close as former PetroVietnam executives on trial used their final statement in court to apologise to the ruling Communist Party, media said. Singapore closed 0.2 percent lower, dragged by top lenders United Overseas Bank and DBS Group, down 0.5 percent and 1.1 percent, respectively. The Philippine index snapped a three-session gaining streak as financials and real estate fell. Metropolitan Bank and Trust was the biggest loser, falling nearly 8 percent. Among the gainers, Indonesia rose 0.2 percent to 6,444.51, buoyed by utility and material stocks. Perusahaan Gas Negara soared 25.5 percent to notch a six-month high while cement maker Semen Indonesia added 7.3 percent to close at levels not seen since August 2016. Thai shares closed 0.4 percent higher on gains in real estate and energy stocks. Oil and gas firm PTT PCL ended 0.4 percent firmer while Land and Houses PCL gained 7.2 percent. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change on day Market Current Previous Pct Move close Singapore 3541.91 3550.21 -0.23 Bangkok 1828.88 1821.83 0.39 Manila 8848.99 8865.13 -0.18 Jakarta 6444.51 6429.69 0.23 Kuala Lumpur 1828.63 1826.03 0.14 Ho Chi Minh 1034.69 1062.96 -2.66 Change on year Market Current End 2017 Pct Move Singapore 3541.91 3402.92 4.08 Bangkok 1826.8 1753.71 4.17 Manila 8848.99 8558.42 3.40 Jakarta 6444.51 6355.65 1.40 Kuala Lumpur 1828.63 1796.81 1.77 Ho Chi Minh 1034.69 984.24 5.13 (Reporting by Devika Syamnath in Bengaluru; Additional reporting by Mai Nguyen in Hanoi; Editing by Sunil Nair)", "external_links": [], "published": "2018-01-17T12:22:00.000+02:00", "crawled": "2018-01-17T12:40:53.009+02:00", "highlightTitle": ""}