{"organizations": [], "uuid": "d97f553b0777ce2426c8db6f8ad259ed6854b4bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-highlights/highlights-of-sundays-nfl-games-idUSKBN1EP0M8", "country": "US", "domain_rank": 408, "title": "Highlights of Sunday's NFL games", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T23:44:00.000+02:00", "replies_count": 0, "uuid": "d97f553b0777ce2426c8db6f8ad259ed6854b4bc"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-highlights/highlights-of-sundays-nfl-games-idUSKBN1EP0M8", "ord_in_thread": 0, "title": "Highlights of Sunday's NFL games", "locations": [], "entities": {"persons": [{"name": "frank gore", "sentiment": "none"}, {"name": "jacoby brissett", "sentiment": "none"}, {"name": "stafford", "sentiment": "none"}, {"name": "golden tate", "sentiment": "none"}, {"name": "matthew stafford", "sentiment": "none"}, {"name": "marvin jones jr.", "sentiment": "none"}], "locations": [{"name": "lucas oil stadium", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "nfl", "sentiment": "negative"}, {"name": "packers", "sentiment": "none"}, {"name": "green bay packers", "sentiment": "none"}, {"name": "national football league", "sentiment": "none"}, {"name": "houston texans", "sentiment": "none"}, {"name": "ford field", "sentiment": "none"}, {"name": "colts", "sentiment": "none"}, {"name": "detroit lions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "December 31, 2017 / 9:47 PM / Updated 7 hours ago Highlights of Sunday's NFL games Reuters Staff \n(The Sports Xchange) - Highlights of Sunday’s National Football League games: \nPatriots 26, Jets 6 \nThe New England Patriots locked up the No. 1 seed in the AFC and home-field advantage in the playoffs with a 26-6 victory over the New York Jets on Sunday afternoon in arctic conditions at Gillette Stadium in Massachusetts. \nThe AFC East champion Patriots wrapped up their regular season at 13-3 to secure the conference’s top spot for a second consecutive season and the seventh time overall. \nDion Lewis totaled 133 yards (93 rushing, 40 receiving) and scored two touchdowns while Tom Brady completed 18-of-37 passes for 190 yards and two touchdowns for the Patriots. \nThe 40-year-old Brady came out of the game in favor of backup Brian Hoyer with 5:59 left in the fourth quarter. \nNew York (5-11) finished last in the AFC East for the second straight season and the third time in four years. \nVikings 23, Bears 10 \nMinnesota had a few flaws in their offense and special teams during a 23-10 win over the Chicago Bears, but the Vikings will have an extra week to work on them before opening the playoffs at home. \nThe Vikings (13-3) clinched a first-round bye with the win over Chicago and may have spelled the end for Bears head coach John Fox, who is widely expected to be dismissed after his team finished 5-11. \nMinnesota’s last bye in the first round came in the 2010 playoffs. \nSteelers 28, Browns 24 \nThe Pittsburgh Steelers beat Cleveland 28-24 to make the Browns the second 0-16 team in NFL history. The 2008 Detroit Lions also went 0-16. \nThe playoff-bound Steelers started Landry Jones at quarterback in place of Ben Roethlisberger and Jones completed 23-of-27 passes for 239 yards and a touchdown in guiding the Steelers to their 13th win of the season. \nColts 22, Texans 13 \nIndianapolis running back Frank Gore rushed for 100 yards on 24 carries to help lead the Colts to a 22-13 victory over the Houston Texans at Lucas Oil Stadium. \nThe Colts limited the Texans to 209 total yards and got a safety. Each AFC South team finished with a 4-12 record. \nJacoby Brissett completed 15-of-24 passes for 114 yards and one touchdown for Indianapolis. \nLions 35, Packers 11 \nMatthew Stafford threw three touchdown passes and also caught a two-point conversion as the Detroit Lions closed out their season with a 35-11 romp over the depleted Green Bay Packers at Ford Field. \nKenny Golladay had a 54-yard touchdown catch for the Lions (9-7) in what may have been head coach Jim Caldwell’s final game with the franchise. There has been heavy speculation that Caldwell will not be retained for a fifth season. \nCowboys 6, Eagles 0 \nQuarterback Dak Prescott threw a 12-yard touchdown pass to Brice Butler early in the fourth quarter and the Dallas Cowboys held on for a 6-0 victory over the Philadelphia Eagles at frigid Lincoln Financial Field. \nDespite having already been eliminated from playoff contention, the Cowboys still finished with a winning record at 9-7. \nAfter last week’s ineffective performance in a 19-10 win over the Oakland Raiders, coach Doug Pederson opted to bring back starter Nick Foles against the Cowboys. \nFoles didn’t perform well once again, going 4 of 11 for 39 yards, one interception and a miniscule 9.3 quarterback rating. \nGiants 18, Redskins 10 \nThe New York Giants scored two touchdowns in just over two minutes as they topped the Washington Redskins 18-10 at MetLife Stadium. \nNew York quarterback Eli Manning made his 216th appearance, which ties Hall-of-Fame defensive end Michael Strahan’s franchise record for the most games played in a Giants uniform. Editing by Rory Carroll/Andrew Both", "external_links": [], "published": "2017-12-31T23:44:00.000+02:00", "crawled": "2018-01-01T00:42:19.000+02:00", "highlightTitle": ""}