{"organizations": [], "uuid": "edec2aaa877b6731f814d3a59b95f88f9b0a06bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-novacap-tmt-enters-into-definitive-agreement-to-acquire-horizon-telcom.html", "country": "US", "domain_rank": 767, "title": "Novacap TMT Enters into Definitive Agreement to Acquire Horizon Telcom", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.246, "site_type": "news", "published": "2018-01-25T18:00:00.000+02:00", "replies_count": 0, "uuid": "edec2aaa877b6731f814d3a59b95f88f9b0a06bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-novacap-tmt-enters-into-definitive-agreement-to-acquire-horizon-telcom.html", "ord_in_thread": 0, "title": "Novacap TMT Enters into Definitive Agreement to Acquire Horizon Telcom", "locations": [], "entities": {"persons": [{"name": "ted mocarski", "sentiment": "none"}], "locations": [{"name": "chillicothe", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "novacap tmt", "sentiment": "negative"}, {"name": "novacap", "sentiment": "none"}, {"name": "horizon telcom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHILLICOTHE, OH, Jan. 25, 2018 /PRNewswire/ - Novacap TMT (\"Novacap\"), one of Canada's leading private equity firms, announced today that it has entered into a definitive agreement to acquire Horizon Telcom (\"Horizon\"), a premier provider of fiber-optic bandwidth infrastructure services operating primarily in Ohio. Under the terms of the agreement, Novacap will acquire the company from its current owners, which is comprised of over 280 shareholders. At the closing of the transaction, Novacap will continue to work with the existing management team and invest to grow the business throughout the region, while it continues to provide the highest quality of service to its customers.\n\"We are excited about the outstanding performance Horizon has delivered for its stakeholders resulting from the company's strategic vision to become Ohio's premier provider of fiber-based services, and we are looking forward to participate in the next phase of the company's growth,\" said Ted Mocarski, a Senior Partner at Novacap. Horizon began as a local telephone company over 120 years ago. Throughout its long history, Horizon transitioned itself into a leading regional provider of fiber-optic based services through significant investments in its state-of-the-art network and facilities.\nUpon completion of the acquisition and the finalization of new fiber builds, Horizon will operate 550,000 strand miles of fiber and 4,500 route miles of fiber in six states. With additional capital, Horizon intends to enhance its presence in the Columbus, Ohio market and extend its existing network closer to customer premises.\n\"Horizon has constructed a first-rate fiber-optic network and developed an outstanding reputation with customers,\" said Ted Mocarski. \"The acquisition of Horizon will represent the stepping-stone for Novacap's vision of creating a multi-state fiber-optic provider in the Midwest. Horizon will continue to strive to offer comprehensive solutions to regional enterprises and telecommunications carriers, while also maintaining focus on providing the highest levels of customer service to the company's local business communities.\"\n\"This transaction is a very positive development for Horizon,\" said Bill McKell, President and CEO of Horizon. \"Together with Novacap, we will have access to sufficient capital to increase our scale, extend our network and enhance our capabilities to the benefit of our customers, our employees and the local communities we serve. Our management team looks forward to working with Novacap and leveraging its deep experience of investing in regional fiber-optic providers such as Oxford Networks, FirstLight Fiber and Fibrenoire.\"\nAntares Capital is acting as Lead Arranger and Administrative Agent in support of the transaction.\nCharlesmead Advisors, LLC served as financial advisor to Horizon in the transaction.\nThe transaction is expected to close in the second quarter of 2018, following the satisfaction of customary regulatory approvals. Financial terms of the transaction were not disclosed.\nAbout Novacap\nFounded in 1981, Novacap is a leading Canadian private equity firm with $2.3 billion of assets under management. Novacap's unique investment approach, based on deep operational expertise and an active partnership with entrepreneurs, has helped accelerate growth and create long-term value for its numerous investee companies. With an experienced management team and substantial financial resources, Novacap is well positioned to continue building world-class companies. For more information, please visit www.novacap.ca .\nAbout Horizon Telcom\nWith corporate offices in Chillicothe, Ohio, and a regional office in Columbus, Ohio, Horizon Telcom is a leading provider of advanced broadband services throughout much of Ohio and into surrounding states. Utilizing its extensive network of fiber optic cable, Horizon delivers advanced high-speed data services, Internet, voice, digital video, security and monitoring services. Horizon's entrepreneurial heritage and long-standing commitment to remarkable customer care ensures a partnering relationship with its customers using cutting-edge broadband technology and proven telecommunication systems. For more information about Horizon, visit www.horizontel.com .\nForward-Looking Statements\nStatements included herein may constitute \"forward-looking statements\", which relate to future events, the future performance, or financial condition of Horizon following the acquisition of Horizon by Novacap. These statements are not guarantees of future performance, condition, or results and involve a number of risks and uncertainties. Actual results and condition may differ materially from those in the forward-looking statements as a result of a number of factors.\nSOURCE Novacap Management Inc.", "external_links": ["http://www.novacap.ca/", "http://www.horizontel.com/"], "published": "2018-01-25T18:00:00.000+02:00", "crawled": "2018-01-25T20:51:18.021+02:00", "highlightTitle": ""}