{"organizations": [], "uuid": "7a3fc2b7144f28b6e18ba2fb52f171cb6271514e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221228214&w=1200&r=LYNXMPEE0A1PH", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-nigeria-security/nigeria-holds-mass-burial-for-73-people-killed-in-communal-violence-idUSKBN1F02GR", "country": "US", "domain_rank": 408, "title": "Nigeria holds mass burial for 73 people killed in communal violence", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T02:04:00.000+02:00", "replies_count": 0, "uuid": "7a3fc2b7144f28b6e18ba2fb52f171cb6271514e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nigeria-security/nigeria-holds-mass-burial-for-73-people-killed-in-communal-violence-idUSKBN1F02GR", "ord_in_thread": 0, "title": "Nigeria holds mass burial for 73 people killed in communal violence", "locations": [], "entities": {"persons": [{"name": "fulani", "sentiment": "none"}, {"name": "muhammadu buhari", "sentiment": "none"}], "locations": [{"name": "makurdi", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "makurdi", "sentiment": "none"}, {"name": "benue", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MAKURDI, Nigeria (Reuters) - Seventy-three people killed since the start of the year in communal violence between semi-nomadic herdsmen and farmers were buried in Nigeria on Thursday highlighting a bloody conflict over fertile land that is taking on political significance.\nThe mass burial took place in Makurdi, in the central state of Benue, where thousands of mourners took to the streets to watch the funeral procession. The killings occurred in remote parts of Benue, the state worst hit by clashes that have killed at least 83 people since Dec. 31.\nThousands of herdsmen mainly from the Fulani ethnic group have moved southwards in the last few years to flee spreading desertification in the north, putting pressure on dwindling fertile land amid rapid population growth.\nThe spike in violence has become increasingly political ahead of elections in February 2019 with critics of President Muhammadu Buhari, who is Fulani, accusing him of failing to get tough with the herdsmen.\nFeelings ran high on the streets of Makurdi where thousands of people, many clad in black, waved wreaths as coffins on lorries passed by carrying the dead who were mainly from rural communities of Benue.\nSome mourners held banners featuring pictures of victims and the words: “President act now: your people are killing us”.\n“Something that is disturbing that I have heard about is linking those developments to the fact that a Fulani man is president and so, he is brooking such kind of evil acts,” said the president’s spokesman, Femi Adesina, this week, adding that such violence predated Buhari’s administration.\nThe herdsmen are mostly Muslim and the settled farmers are often Christian.\nDespite the recent outbreaks of violence, Nigerians, split roughly equally between Christians and Muslims from around 250 different ethnic groups, mostly live peacefully together.\nPeople react as a truck carries the coffins of people killed by the Fulani herdsmen, in Makurdi, Nigeria January 11, 2018. REUTERS/Afolabi Sotunde Clashes in the last few months have occurred in parts of the northwest and southeast, but the middle belt - where differing religious, ancestral and cultural differences frequently ignite conflict - has been worst hit in the latest flashpoints.\nPeter Zion,31, a member of a state government task force set up to defend farms, was recuperating in hospital after being shot and cut across his face and torso by herdsmen wielding guns and cutlasses on Jan. 2 in the state’s Guma district.\n“They killed some of my colleagues and the neighbors that were there all died,” said the father-of-two whose face had been cut and whose hands and legs were heavily bandaged. He described attackers going door-to-door shooting people.\nSlideshow (11 Images) The executive secretary of the Benue emergency agency, Emmanuel Shior, on Thursday said around 80,000 people who had fled herdsmen attacks were living in four camps located across the state.\nHerdsmen traditionally roam freely across West Africa, entering and leaving Nigeria through porous borders with Benin, Niger and Cameroon. They have also accused Nigerian farmers of violent attacks in the last few years.\nImproving security was a key promise in Buhari’s successful 2015 presidential election campaign. The 75-year-old has not yet said whether he will seek re-election next year.\n“Security of life and property continues to be top of our agenda, in line with our election pledge and promises,” said Buhari in a tweet on Thursday, which linked to a list of ways in which the government has responded to the killings.\nHe bolstered the police presence in Benue on Monday and ordered the head of police to relocate to the state.\nThe violence is likely to further stretch security forces already contending with Boko Haram’s Islamist insurgency in the northeast and the threat of attacks on oil facilities in the southern Niger Delta of the type that in 2016 helped to push Africa’s largest economy into recession.\nAdditional reoporting by Anamesere Igboeroteonwu in Onitsha and Felix Onuah in Abuja; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T02:04:00.000+02:00", "crawled": "2018-01-12T04:51:48.006+02:00", "highlightTitle": ""}