{"organizations": [], "uuid": "38d8669b4ed7e53bd229e8522e34ee561f4df8e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-mapr-names-john-schroeder-chairman-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "MapR Names John Schroeder Chairman and Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:00:00.000+02:00", "replies_count": 0, "uuid": "38d8669b4ed7e53bd229e8522e34ee561f4df8e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-mapr-names-john-schroeder-chairman-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "MapR Names John Schroeder Chairman and Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "john schroeder", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "matt mills", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "gene frantz", "sentiment": "none"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "google capital", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Announces 66% annual subscription billings growth with existing customers driving over 150% dollar-based net expansion\nSANTA CLARA, Calif.--(BUSINESS WIRE)-- MapR® Technologies, Inc. , a pioneer in delivering one platform for all data, across every cloud, today announced that company Founder and Executive Chairman John Schroeder will return as Chairman of the Board of Directors and Chief Executive Officer, effective immediately. Matt Mills who previously served as Chief Executive Officer will be leaving the company.\n“MapR continues to represent an extraordinary opportunity with strong growth in a very exciting market. We thank Matt for his hard work and MapR’s operational expansion under his leadership,” said Gene Frantz, Partner CapitalG (formerly Google Capital). “John’s depth in the enterprise big data market, his strategic vision and experience as CEO makes him the optimal leader to continue the strong growth of the company, position the company for the public market, and accelerate technology leadership.”\nResults for the period ended October 31, 2017 showed annual year-over-year subscription billings growth of 66 percent. During the quarter, MapR continued to grow its customer base across industries and maintained a greater than 95 percent customer retention rate. MapR’s dollar-based net expansion rate exceeded 150 percent for the previous twelve months. The MapR Converged Data Platform is proving to be the data platform of choice for global enterprises who are executing against their digital transformation strategy.\n“These are exciting times for MapR. Our original vision and data technology we have put in place is now at the center of cloud, machine learning, and edge processing,” said John Schroeder, CEO, MapR. “Customers from leading organizations continue to transform their businesses with our revolutionary technology in multiple industries, such as financial services, telco, retail, networking and healthcare. We view our continued customer growth as validating our approach and innovation of a single data platform that enables a true global data fabric to harness value from all types of data.”\nContinuing Customer Expansion and New Customer Wins\nMapR continues to attract new customers and expand existing customers around the globe including Anadarko, Denver Health, Netshoes, Societe Generale Group, and US government agencies such as the Department of Defense and the Drug Enforcement Agency. One of the largest financial institutions in Japan, with over 550 branches and offices in Japan and in thirty-six other countries and regions, adopted the MapR Converged Data Platform to enable greater speed and efficiency in its asset liability management system.\n“Our customers and our external security auditors require that we retain an authoritative record of all data being ingested into and processed by our ALLOY™ Platform for Healthcare,” said Lance Pilkington, vice president of compliance, Liaison Technologies. “We built and maintain the ALLOY Platform to meet the highest standards of data compliance on behalf of users. In today’s era of Big Data, traditional approaches to addressing data lineage requirements simply cannot meet our customers’ compliance needs. Liaison Technologies leverages MapR Event Streams (MapR-ES) extensively as the foundation of our compliance-ready lineage solution, as it allows us to keep an immutable log of all transactions.”\nIndustry Leading Technology Innovations for the MapR Converged Data Platform\nMapR announced the MapR Data Science Refinery , a new solution that provides data scientists an easy way to access and analyze all data in-place, to collaborate, build and deploy machine learning models on the MapR Converged Data Platform. Released the MapR Orbit Cloud Suite , a comprehensive set of cloud computing capabilities enabling organizations to build data fabrics for the [first time that manage data across one or more clouds, hybrid clouds, or to the edge with the MapR Data Platform. Released a comprehensive Data Governance Quick Start Solution (QSS), aimed at removing any guesswork required to achieve a fully secure and governed cluster running the MapR Converged Data Platform. Launched Managed Services for the MapR Converged Data Platform, enabling customers to focus on building a wide range of applications from analytics to machine learning and artificial intelligence (AI), while MapR manages the daily operations of the customer’s big data infrastructure from on-premises, across clouds and to the edge. MapR delivered extensive updates to MapR-DB that enable rich applications, in-place and continuous machine learning/AI and SQL capabilities, and global real-time data integration and micro-services support.\n\"Xactly’s SPM Suite, predictive analytics and big data intelligence are the foundation for the sales programs of more than 1,200 customers. Billions of transactions flow through our systems each quarter and we have handled more than $20 billion in incentive compensation payments in the last two years alone,” said Ron Rasmussen, CTO, Xactly Corporation. “If our systems aren’t running at maximum performance, the course of business slows and people don’t get paid. MapR understands that our database architecture is critical to our success and that of our customers. Their system provides the flexibility and integrated analytics required for Xactly to continue to build and scale SPM solutions that are unmatched in performance, scalability and uptime.\"\nProduct Accolades and Industry Recognition\nReceived numerous editorial and readership awards for: MapR: Datanami’s Readers’ Choice Awards Top 5 Vendors to Watch and Best Big Data Product or Technology: Internet of Things (IoT); and Database Trends and Applications (DBTA) Big Data 50 MapR-XD: TMC’s Data Center Excellence Awards MapR-ES: DBTA’s Readers’ Choice Award for Best Streaming Data Solution\nThriving Partner Ecosystem\nThe MapR Converged Data Platform became available in the Oracle Cloud Marketplace. C3 IoT and MapR announced a strategic partnership to collaborate on new technology developments and go-to-market initiatives that enable rapid deployment of mission-critical, secure intelligent applications based on artificial intelligence and Internet of Things (IoT). Ab Initio and MapR are enabling joint customers to leverage the economies of scale-out architectures of commodity server clusters for high-performance mission-critical applications with strict data lineage and governance requirements, that are especially important in industries such as financial services. DataScience.com and MapR partnered to build a collaborative workflow environment where data science experiments can run directly on the MapR Converged Data Platform without requiring a separate compute cluster to access data. MapR expanded its data governance partnerships with Cask, Collibra and Waterline, and unveiled a DataOps-driven approach to governance in the age of big data where joint customers can now leverage platform-level capabilities for compliance-ready data lineage and the management of metadata at scale.\nAbout MapR Technologies\nMapR Technologies , a pioneer i", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mapr.com&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=www.mapr.com&index=9&md5=ddb66bac18ab4970514bcd43e186c203", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mapr.com%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=MapR+Technologies&index=8&md5=81a71eb55d0a024f281fbe60a9b1e512", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fc3iot.com%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=C3+IoT&index=5&md5=40bb1307be577895ae264e116f1fd8ed", "http://www.businesswire.com/news/home/20180112005138/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmapr.com%2Fproducts%2Forbit-cloud%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=MapR+Orbit+Cloud+Suite&index=3&md5=8a7fbe83a328830f71f2cc46a4b6af6d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.abinitio.com%2Fen%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=Ab+Initio&index=6&md5=4adf5dcde35f866198e0767899d4317d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmapr.com%2Fsolutions%2Fquickstart%2Fdata-governance%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=Data+Governance+Quick+Start+Solution&index=4&md5=e6c8f270f446115d961f656090586b29", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.datascience.com%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=DataScience.com&index=7&md5=e088b3366c39b72bf70293a88eb0b0f5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmapr.com%2Fproducts%2Fdata-science-refinery%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=MapR+Data+Science+Refinery&index=2&md5=48c004ee457c126653ed54b8615224b2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mapr.com%2F&esheet=51742316&newsitemid=20180112005138&lan=en-US&anchor=MapR%C2%AE+Technologies%2C+Inc.&index=1&md5=63e4a44d136f53e9fb1f262a756bbcdb"], "published": "2018-01-12T16:00:00.000+02:00", "crawled": "2018-01-12T17:52:46.010+02:00", "highlightTitle": ""}