{"organizations": [], "uuid": "fb853089013f002b8d536957e35817c12fca4563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 122, "shares": 122, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219983887&w=1200&r=LYNXMPEE06069", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-iraq-refugees/iraq-returning-displaced-civilians-from-camps-to-unsafe-areas-idUSKBN1EW072", "country": "US", "domain_rank": 408, "title": "Iraq returning displaced civilians from camps to unsafe areas", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T09:43:00.000+02:00", "replies_count": 0, "uuid": "fb853089013f002b8d536957e35817c12fca4563"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-iraq-refugees/iraq-returning-displaced-civilians-from-camps-to-unsafe-areas-idUSKBN1EW072", "ord_in_thread": 0, "title": "Iraq returning displaced civilians from camps to unsafe areas", "locations": [], "entities": {"persons": [{"name": "ahmed aboulenein", "sentiment": "none"}, {"name": "haider al-abadi", "sentiment": "none"}], "locations": [{"name": "iraq", "sentiment": "none"}, {"name": "anbar province", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMRIYAT AL-FALLUJA, Iraq (Reuters) - Iraqi security forces are forcibly returning civilians from refugee camps to unsafe areas in the predominantly Sunni Anbar province, exposing them to death from booby-traps or acts of vigilantism, refugees and aid workers say.\nManaging more than two million Iraqis displaced by the war against Islamic State is one of Prime Minister Haider al-Abadi’s most daunting tasks. But critics say he is more interested in winning elections in May than alleviating the suffering of displaced Iraqis and returning them safely home.\nAuthorities are sending back people against their will, refugees and aid workers say, to ensure that the election takes place on time. People must be in their area of origin to vote and if they do not get home, this could delay the election.\nAbadi is riding a wave of popularity after defeating Islamic State in Iraq and is anxious the election should not be held up.\nHis strategy is not without its hazards. Abadi risks alienating Sunni voters if displaced Sunnis are seen to be suffering from being sent home to dangerous areas.\nAbadi is seeking a second term in which he plans to fight corruption and maintain national unity in the face of Kurdish separatism. He will need all the votes he can muster to face down a challenge from candidates linked to Iranian-backed Shi‘ite militias.\nMILITARY TRUCKS Interviews with aid workers and dozens of displaced people at camps in the town of Amriyat al-Falluja, located in the Sunni heartland of Anbar province, 40 km (25 miles) from Baghdad, as well as with several families who were returned to other areas in the province, reveal that many were forced to go home and several suffered death or injury.\nAid workers said military trucks arrive at camps unannounced and commanders read out lists of people, who have one hour to pack their belongings and go.\nThe aid workers, who all spoke on condition of anonymity, estimated that between 2,400 and 5,000 people were forcibly returned between Nov. 21 and Jan. 2.\n“These returns are not safe,” said one aid worker. “Even those who don’t openly resist really have no other choice. They cannot really say no to a bunch of people with guns.”\n‘THEY GAVE HIM A TENT’\nAn Iraqi military spokesman said the claim that the military forced displaced civilians to return against their will was an exaggeration.\n“Our primary concern is the safety of our citizens, our job is to protect people,” Iraqi Joint Operations Command Spokesman Brigadier General Yahya Rasool told Reuters.\nHowever, “citizens have to go home” now that Islamic State had been defeated, he said.\nSome aid workers said local military commanders told them the orders came from Abadi’s office. The prime minister’s spokesman did not respond to requests for comment.\nOn Nov. 25, security forces arrived at a camp in Amriyat al-Falluja and told Saleh Ahmed, 37, and his family to return to their home town of Betaya, his father, Mahdi Ahmed, said.\nThey refused because contacts at home told them the area was filled with booby-traps left by retreating Islamic State fighters and their houses had been destroyed.\nA local commander assured them the area was safe, saying it was “better to go live in a tent in your home town than live in a tent in the camp”.\nSaleh reluctantly took his wife and some of his children and got on the truck. Mahdi Ahmed, 72, remained at the camp with his sick wife, another son, and some of Saleh’s children as their names were not on the list.\nA general view of the Amriyat al Fallujah camp in Anbar Province, Iraq January 3, 2018. REUTERS/Khalid al-Mousily “They gave him a tent. He went back to our destroyed house and tried to pitch it in our yard,” Mahdi Ahmed told Reuters at the camp in Amriyat al-Falluja.\nAn explosive went off. Saleh’s wife was killed instantly and his daughter sustained full body burns. Saleh lost one eye and was seriously injured in the other, according to one of his sons, who witnessed the incident.\nCANNOT AFFORD TO RETURN The Ahmeds’ case is not unique. Abdallah, 17, told Reuters his family was forced to return to the town of Jweibeh on Nov. 26\nA week later masked men arrived at the family home at 2 a.m. demanding to speak to the father. When he refused to open the door, they burst in and started shooting. Abdallah’s father suffered leg injuries and his mother lost a finger.\nThe family do not know what the men wanted.\n“It’s not that we don’t want to return but it has to be safe,” said Abdallah, who is now the family breadwinner, working at a shop in the city of Falluja.\nSlideshow (8 Images) For many it is not economically viable to leave the camps, where they can set up barber shops or fruit stands at makeshift markets, making about $50 a month.\nThat sum would not be possible back home where jobs, basic services, and schools are nonexistent.\n“I can’t afford to return,” said camp resident Alaa Hussein.\nOne man whose father suffers from kidney failure said leaving means losing access to the camp’s dialysis machine. His village, 450 km (280 miles) from the camp, does not have one.\n“I will return once there are adequate health services there, but why should I go before then?” said Jassem Ali, 37.\nFive camp residents told Reuters separately they were forced to leave but had to turn back because checkpoints manned by Iranian-backed Shi‘ite militias were demanding bribes of up to $400 to let people through, a sum none could afford.\nThey spoke on condition of anonymity for fear of reprisal. Reuters was unable to independently verify the claim.\nLIFE RUINED A U.S. diplomat in Baghdad said she had heard reports of forced returns, which the embassy had brought to the attention of the Iraqi government.\nShe said the government had stressed its commitment to safe and voluntary returns but also said that “there is a real desire to get people home as quickly as possible”.\nThe United Nations says more than half of displaced Iraqis have already returned. More than 3.2 million people were back home at the end of December, with 2.6 million still displaced, according to the International Organization for Migration.\nFor Mahdi Ahmed, the government has achieved the reverse of what it intended.\n“They are doing this because of the election, but if I go back and see my house destroyed, my money gone, and my life ruined, why would I vote for them?” he asked.\nIraq's internally displaced persons: tmsnrt.rs/2m6OGU2\nReporting by Ahmed Aboulenein; editing by Giles Elgood\n ", "external_links": [], "published": "2018-01-07T09:43:00.000+02:00", "crawled": "2018-01-07T09:53:39.002+02:00", "highlightTitle": ""}