{"organizations": [], "uuid": "4243952c41d7885478b4515a951e3060af673f12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224215181&w=1200&r=LYNXMPEE0L1PJ", "site_section": "https://www.reuters.com/finance", "section_title": "Business News &amp; Financial News | Reuters", "url": "https://www.reuters.com/article/us-kpmg-fraud/u-s-says-kpmg-employees-misappropriated-secrets-from-oversight-board-idUSKBN1FB2DN", "country": "US", "domain_rank": 408, "title": "U.S. says KPMG employees misappropriated secrets from oversight board", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:18:00.000+02:00", "replies_count": 0, "uuid": "4243952c41d7885478b4515a951e3060af673f12"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kpmg-fraud/u-s-says-kpmg-employees-misappropriated-secrets-from-oversight-board-idUSKBN1FB2DN", "ord_in_thread": 0, "title": "U.S. says KPMG employees misappropriated secrets from oversight board", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kpmg", "sentiment": "negative"}, {"name": "public company accounting oversight board", "sentiment": "none"}, {"name": "kpmg llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:18 PM / in 2 hours U.S. says audit watchdog staff helped KPMG pass audit inspections Pete Schroeder 3 Min Read \nWASHINGTON (Reuters) - The U.S. government on Monday announced criminal and civil charges against three former staffers of an audit watchdog for allegedly providing confidential information to help accounting firm KPMG pass regulatory inspections. \nThree ex-KPMG executives also were charged for encouraging disclosure of the data on Public Company Accounting Oversight Board (PCAOB) audit inspections, the U.S. Securities and Exchange Commission and Justice Department said in separate filings. \nThe incidents allegedly occurred between 2015 and 2017, the government said. \n“These accountants engaged in shocking misconduct – literally stealing the exam – in an effort to interfere with the PCAOB’s ability to detect audit deficiencies at KPMG,” said Steven Peikin, co-director of the SEC’s enforcement division. \nThe government charged that the PCAOB and KPMG employees conspired to share information about which audits the watchdog would be reviewing, giving KPMG an opportunity to shore up those particular products before facing scrutiny. \nThe PCAOB is a private non-profit corporation that monitors the audits of public companies. The government alleged that KPMG was eager to boost its performance under PCAOB inspections, noting the company received roughly twice as many comments on its audits in 2014 than its competitors. \nThe company recruited and hired PCAOB staff, and the SEC said some of those hires took confidential information about planned inspections with them to their new jobs, or obtained information from former colleagues still at PCAOB who were seeking their own jobs with KPMG. \nIn a statement on Monday, SEC Chairman Jay Clayton called the charges “disturbing.” But he said he did not believe the improper actions compromised the integrity of the KPMG audits embroiled in the scandal. \nLast year, KPMG said it had fired six people over the PCAOB leaks, which the company had identified and brought to the government’s attention. The company hired outside legal counsel to investigate the matter and took “remedial actions” to prevent a recurrence, KPMG spokesman Manuel Goncalves said on Monday in an email. \nPeikin said the enforcement action was unrelated to a December shake-up of the PCAOB in which the SEC named a new head for the watchdog and four new board members. Reporting by Pete Schroeder; Editing by Richard Chang and Paul Simao", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T01:18:00.000+02:00", "crawled": "2018-01-22T19:22:41.042+02:00", "highlightTitle": ""}