{"organizations": [], "uuid": "d22089c9639bebc55c3f7989ce275cfe2a354adf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/13/the-associated-press-models-accuse-photographers-weber-testino-of-sex-misconduct.html", "country": "US", "domain_rank": 767, "title": "Models accuse photographers Weber, Testino of sex misconduct", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T01:41:00.000+02:00", "replies_count": 0, "uuid": "d22089c9639bebc55c3f7989ce275cfe2a354adf"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/13/the-associated-press-models-accuse-photographers-weber-testino-of-sex-misconduct.html", "ord_in_thread": 0, "title": "Models accuse photographers Weber, Testino of sex misconduct", "locations": [], "entities": {"persons": [{"name": "satur", "sentiment": "negative"}, {"name": "weber", "sentiment": "negative"}, {"name": "testino", "sentiment": "negative"}, {"name": "calvin klein", "sentiment": "none"}, {"name": "robyn sinclair", "sentiment": "none"}, {"name": "bruce weber", "sentiment": "none"}, {"name": "mario testino", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "vogue", "sentiment": "none"}], "organizations": [{"name": "the new york times", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "abercrombie & fitch", "sentiment": "none"}, {"name": "times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — In a sweeping new sexual misconduct investigation, The New York Times reported Saturday that several male models have accused famed photographers Bruce Weber and Mario Testino of unwanted advances and coercion.\nFifteen current and former models told the Times that Weber's demands often occurred during photo shoots and other private sessions. Thirteen assistants and models accused Testino, the Times reported.\n\"I remember him putting his fingers in my mouth, and him grabbing my privates,\" model Robyn Sinclair said of Weber. \"We never had sex or anything, but a lot of things happened. A lot of touching. A lot of molestation.\"\nModels were asked to \"breathe\" and to touch themselves and Weber, moving their hands wherever they felt \"energy,\" the newspaper said. Weber often would guide the models' hands with his own, the newspaper reported.\nWeber's racy advertisements for Calvin Klein, Abercrombie & Fitch and other companies helped turn him into a star in commercial and fine art photography.\nTestino, adored by celebrities, glossy magazines including Vogue and younger members of the British royal family, was accused of groping and making sexual come-ons, the newspaper said.\nAllegations against both date back many years, with accusers in some cases recounting details with remarkable consistency, the Times said.\nRepresentatives for both photographers said they were dismayed and surprised by the allegations.\n\"I'm completely shocked and saddened by the outrageous claims being made against me, which I absolutely deny,\" Weber said in a statement from his lawyer.\nThe law firm Lavely & Singer, representing Testino, challenged the character and credibility of people who complained of harassment.\nTestino's attorney, Andrew Brettler, said in an email to The Associated Press late Saturday, \"We are not providing any further comment at this time.\"\nModel Ryan Locke worked with Testino on Gucci ad campaigns and called him a \"sexual predator.\" He told the Times that when he told other models he was going to meet Testino for a possible casting \"everyone started making these jokes — they said he was notorious, and 'tighten your belt.'\"\nOn the last day of a shoot, as they were taking photographs on a bed, Testino told everybody in the room to leave and locked the door, Locke recalled.\n\"Then he crawls on the bed, climbs on top of me and says, 'I'm the girl, you're the boy,'\" Locke said. \"I went at him, like, you better get away. I threw the towel on him, put my clothes on and walked out.\"\nFormer assistants said Testino had a pattern of hiring young, heterosexual men and subjecting them to increasingly aggressive advances.\n\"Sexual harassment was a constant reality,\" said Roman Barrett, an assistant to Testino in the late 1990s who said the photographer rubbed up against his leg with an erection and masturbated in front of him.\nSeveral industries have been rocked by sexual-abuse allegations since women started coming forward to complain about Hollywood producer Harvey Weinstein, who has apologized for causing colleagues \"a lot of pain\" but has denied \"any allegations of non-consensual sex.\"\nRevelations of abuse often have faded away in the fashion industry. Recently, photographer Terry Richardson continued to work after being accused in a documentary of sexual assault of female models and denying their claims — until the Weinstein scandal broke.\nConde Nast, which publishes Vogue and other top magazines, said it would stop working with Weber and Testino, at least for now.\nInformation from: The New York Times, http://www.nytimes.com", "external_links": [], "published": "2018-01-14T01:41:00.000+02:00", "crawled": "2018-01-14T20:06:13.005+02:00", "highlightTitle": ""}