{"organizations": [], "uuid": "591bd22579f0f5122344140281f6089a9634494e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220920297&w=1200&r=LYNXMPEE091ES", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-alabama-plant/toyota-mazda-confirm-1-6-billion-plant-for-alabama-idUSKBN1EZ2NE", "country": "US", "domain_rank": 408, "title": "Toyota, Mazda confirm $1.6 billion plant for Alabama", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T22:02:00.000+02:00", "replies_count": 0, "uuid": "591bd22579f0f5122344140281f6089a9634494e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-alabama-plant/toyota-mazda-confirm-1-6-billion-plant-for-alabama-idUSKBN1EZ2NE", "ord_in_thread": 0, "title": "Toyota, Mazda confirm $1.6 billion plant for Alabama", "locations": [], "entities": {"persons": [{"name": "masamichi kogai", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david shepardson", "sentiment": "none"}, {"name": "akio toyoda", "sentiment": "none"}, {"name": "tommy battle", "sentiment": "none"}, {"name": "kay ivey", "sentiment": "none"}], "locations": [{"name": "alabama", "sentiment": "none"}, {"name": "huntsville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "negative"}, {"name": "mazda", "sentiment": "negative"}, {"name": "mazda motor corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "toyota motor corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTGOMERY, Ala. (Reuters) - Toyota Motor Corp ( 7203.T ) and Mazda Motor Corp ( 7261.T ) announced Wednesday they will build a $1.6 billion joint assembly plant in Alabama that will employ up to 4,000 workers, a boost for President Donald Trump who wants automakers to expand U.S. production. \nToyota President Akio Toyoda and Mazda President and Chief Executive Officer Masamichi Kogai joined Alabama Governor Kay Ivey in Montgomery at an event to announce the decision. \n“Welcome to sweet home Alabama,” Ivey said to both executives, after saying that the anticipated 4,000 workers would earn an average of $50,000. \nThe plant will produce 300,000 vehicles a year and should open on a 2,500-acre site in 2021 about 14 miles from Toyota’s engine plant in Huntsville. \nToyota plans to build Corolla cars at the plant, while Mazda will build crossover SUVs. \n“Together, I am confident we will create yet another ‘Built in America’ success story,” Toyota’s Toyoda said. \nAlabama will provide tax incentives, the total of which was not immediately known. A person briefed on the matter said it was expected to be close to $1 billion over several years. \nThe announcement also as U.S. auto industry sales are declining, so it could exacerbate overcapacity and add pressure to cut prices. U.S. new vehicle sales fell 2 percent in 2017, after hitting an all-time record high in 2016, and are expected to fall further in 2018. \nHuntsville Mayor Tommy Battle said the plant will “provide jobs for decades to come for Huntsville and Alabama. It vaults Alabama to the top as an industry leader in producing the next generation of cars that will power our nation.” \nAmong U.S. states, Alabama is already the fifth largest producer of cars and light trucks. The state has more than 150 major auto suppliers and 57,000 automotive manufacturing jobs. \nTwo decades ago, Alabama spent an estimated $250 million to woo Daimler AG’s Mercedes-Benz to put an auto plant in Tuscaloosa, sparking the birth of auto production in the state. \nIn September, Daimler ( DAIGn.DE ) said it would invest $1 billion to expand its Alabama Mercedes-Benz plant to start building electric sport-utility vehicles there from about 2020. \nAlabama is also home to assembly plants operated by Honda Motor Co ( 7267.T ) and Hyundai Motor Co ( 005380.KS ). A Kia Motors Corp ( 000270.KS ) assembly plant operates near the Alabama border in Georgia. \nMazda and Toyota said they still need approvals and authorization by antitrust agencies for the new joint venture. They announced a capital alliance in August and plans to jointly develop technology for electric vehicles. \nTrump tweeted in March he wanted “new plants to be built here for cars sold here.” Many automakers have announced expansions of facilities or new jobs but no other new U.S. auto plants have been announced. \nA year ago, President-elect Trump criticized Toyota and threatened hefty tariffs against the Japanese automaker if it built its Corolla sedan for the U.S. market in Mexico. \nToyota and Mazda announced plans for a new plant in August. Toyota said it would shift production of Corollas from Canada to the new venture rather than in Guanajuato, and would build Tacoma pickups in Mexico instead. \nIn October, Toyota said it would scale back investment in a planned plant in Mexico by 30 percent to $700 million and cut planned annual capacity in half to 100,000 vehicles as it shuffles its production plans to meet market demands. \nOver the last 30 years Toyota and other automakers from Germany and other parts of Asia have built a second auto industry in the United States. Its size and employment rivals operations of the Detroit Three automakers, but with newer plants and fewer unionized workers. \nU.S. states covet auto assembly plants because they typically pay above-average wages and spin off jobs at suppliers and service companies. Southern states have been home to the majority of new auto production by German and Asian automakers. These states generally have good transportation infrastructure, business-friendly regulators and anti-union politicians. \nReporting by David Shepardson; additional reporting by Bernie Woodall; Editing by David Gregorio\n ", "external_links": [], "published": "2018-01-10T22:02:00.000+02:00", "crawled": "2018-01-10T22:15:02.034+02:00", "highlightTitle": ""}