{"organizations": [], "uuid": "0f98d4611a184a0e2164c4185ea2472b30d5607d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-viewray-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "ViewRay Announces Preliminary Fourth Quarter and Fiscal Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "0f98d4611a184a0e2164c4185ea2472b30d5607d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-viewray-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results.html", "ord_in_thread": 0, "title": "ViewRay Announces Preliminary Fourth Quarter and Fiscal Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "chris a. raanes", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "mridian linac systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 8, 2018 /PRNewswire/ -- ViewRay, Inc. (Nasdaq: VRAY) today announced preliminary results for the fourth quarter and full fiscal year ended December 31, 2017. The preliminary results reported have not been audited and are subject to change.\nFourth Quarter & Full Year 2017 Preliminary Highlights:\nRecognized revenue on 4 MRIdian Linac Systems in Q4 2017. This resulted in total 2017 revenue of approximately $34 million primarily from 6 MRIdian Linac Systems. Received new orders for MRIdian Linac systems in Q4 2017 totaling approximately $34 million, compared to orders totaling $24.3 million in Q4 2016. Received new orders for MRIdian Linac systems in 2017 totaling over $110 million, compared to orders totaling $77.0 million in 2016. Total backlog grew to over $200 million, as of December 31, 2017, up from $133.2 million as of December 31, 2016. Total cash and cash equivalents of approximately $57 million at December 31, 2017.\n\"In the fourth quarter we saw continued momentum in new orders for the MRIdian Linac,\" said Chris A. Raanes, president and chief executive officer of ViewRay. \"We completed the shipment or installation of 5 MRIdian Linac systems in the fourth quarter, but expect to recognize revenue of approximately $7 million on one of them in a subsequent period.\"\nAbout ViewRay\nViewRay®, Inc. (Nasdaq: VRAY), designs, manufactures and markets the MRIdian® radiation therapy system. MRIdian is built upon a proprietary high-definition MR imaging system designed from the ground up to address the unique challenges and clinical workflow for advanced radiation oncology. Unlike MR systems used in diagnostic radiology, MRIdian's high-definition MR was purposely built to deliver high-precision radiation without unnecessary beam distortion, and consequently, help to mitigate skin toxicity and other safety concerns that may otherwise arise when high magnetic fields interact with radiation beams. ViewRay and MRIdian are registered trademarks of ViewRay, Inc.\nForward Looking Statements:\nThis press release contains forward-looking statements. Statements in this press release that are not purely historical are forward-looking statements. Such forward-looking statements include, among other things, the rate of new orders, upgrades and installations. Actual results could differ from those projected in any forward-looking statements due to numerous factors. Such factors include, among others, the timing, results and other uncertainties associated with the satisfaction of revenue criteria, clinical trials, the ability to raise the additional funding needed to continue to pursue ViewRay's business and product development plans, the inherent uncertainties associated with developing new products or technologies, the ability to commercialize MRIdian Linac System, competition in the industry in which ViewRay operates and overall market conditions. For a further description of the risks and uncertainties that could cause actual results to differ from those expressed in these forward-looking statements, as well as risks relating to ViewRay's business in general, see ViewRay's current and future reports filed with the Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and its Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. These forward-looking statements are made as of the date of this press release, and ViewRay assumes no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those projected in the forward-looking statements, except as required by law.\nView original content: http://www.prnewswire.com/news-releases/viewray-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results-300578830.html\nSOURCE ViewRay, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/viewray-announces-preliminary-fourth-quarter-and-fiscal-year-2017-results-300578830.html"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T19:38:50.003+02:00", "highlightTitle": ""}