{"organizations": [], "uuid": "9f6a8bb178092331c077eddd4e6ad358fd81e69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/update-1-cricket-philander-treble-leaves-india-reeling-in-pursuit-of-208-idINL8N1P33UZ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Cricket-Philander treble leaves India reeling in pursuit of 208", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:43:00.000+02:00", "replies_count": 0, "uuid": "9f6a8bb178092331c077eddd4e6ad358fd81e69e"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/update-1-cricket-philander-treble-leaves-india-reeling-in-pursuit-of-208-idINL8N1P33UZ", "ord_in_thread": 0, "title": "UPDATE 1-Cricket-Philander treble leaves India reeling in pursuit of 208", "locations": [], "entities": {"persons": [{"name": "nick said  cape town", "sentiment": "none"}, {"name": "virat kohli", "sentiment": "none"}, {"name": "kohli", "sentiment": "none"}, {"name": "bhuvneshwar kumar", "sentiment": "none"}, {"name": "philander", "sentiment": "none"}, {"name": "ravichandran ashwin", "sentiment": "none"}, {"name": "vernon philander", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:45 PM / in 2 hours UPDATE 1-Cricket-Philander treble leaves India reeling in pursuit of 208 Reuters Staff \n* India need 126 with three second innings wickets remaining for victory \n* Philander dismissed India captain Kohli for fighting 28 \n* South Africa were bowled out for 130 in the morning session (Adds details to tea) \nBy Nick Said \nCAPE TOWN, Jan 8 (Reuters) - Seamer Vernon Philander claimed three wickets, including the prize scalp of India captain Virat Kohli, to swing the first test firmly in South Africa’s favour at tea on day four on Monday. \nIndia were reeling at 82 for seven in pursuit of a modest 208 for victory and with the wicket still offering prodigious bounce and lateral movement to the bowlers, they have found survival, let alone scoring, a significant challenge. \nRavichandran Ashwin (one) and Bhuvneshwar Kumar (nought) will be tasked with trying to edge India closer to victory after the interval with four full sessions remaining. \nThe touring side had earlier skittled out South Africa for 130 in their second innings, taking the final eight wickets for 65 after day three had been completely washed out. \nBut the South Africans found the same life in the wicket and despite missing experienced seamer Dale Steyn, who has been ruled out for the remainder of the series with a heel injury, picked up wickets at regular intervals. \nOpeners Murali Vijay (13) and Shikhar Dhawan (16) took the score to 30 before the latter sparred a rising deliver from Morne Morkel to gully. \nPhilander picked up his first wicket six balls later when Vijay edged to AB de Villiers at third slip and he completed a diving catch. \nCheteshwar Pujara (four) became Morkel’s second victim with the score on 39, before Kohli (28) took the attack to the South Africans. \nHe was undone playing across a straight delivery from Philander and with his wicket possibly went India’s hopes. \nRohit Sharma (10) was bowled off the inside edge by Philander before the tourists’ first-innings hero Hardik Pandya edged Kagiso Rabada to De Villiers in the slips. \nRabada claimed the wicket of Wriddhiman Saha (eight) with the last ball before tea. \nThe South Africans had found batting equally challenging in the morning session as India’s seamers ripped through them. \nMohammed Shami (3-28) and debutant Jasprit Bumrah (3-39) were the pick, but there were wickets too for Bhuvneshwar Kumar (2-33). \nOnly an attacking 35 from De Villiers stemmed the tide to a degree before he was the last man out, caught on the boundary with a limping Steyn at the non-strikers end. \nSouth Africa host India in three tests this month, with matches in Pretoria and Johannesburg to come. (Reporting by Nick Said, editing by Ed Osmond)", "external_links": [], "published": "2018-01-08T15:43:00.000+02:00", "crawled": "2018-01-08T17:35:34.004+02:00", "highlightTitle": ""}