{"organizations": [], "uuid": "2e4c61dd23ff2363390182919ddf4d505146a891", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222871310&w=1200&r=LYNXMPEE0H003", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-germany-politics/top-spd-politician-no-plan-b-if-party-rejects-talks-with-merkel-idUKKBN1F7007", "country": "US", "domain_rank": 408, "title": "Top SPD politician - No 'Plan B' if party rejects talks with Merkel", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:07:00.000+02:00", "replies_count": 0, "uuid": "2e4c61dd23ff2363390182919ddf4d505146a891"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/top-spd-politician-no-plan-b-if-party-rejects-talks-with-merkel-idUKKBN1F7007", "ord_in_thread": 0, "title": "Top SPD politician - No 'Plan B' if party rejects talks with Merkel", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "andrea nahles", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "nahles", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "negative"}, {"name": "funke mediengruppe", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "merkel reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:04 AM / Updated 5 hours ago Top SPD politician - No 'Plan B' if party rejects talks with Merkel Reuters Staff 4 Min Read \nBERLIN (Reuters) - The parliamentary leader of Germany’s Social Democrats (SPD) said she was optimistic that delegates to a party congress on Sunday would endorse formal talks with Chancellor Angela Merkel’s conservatives about a new coalition government. \n“I have no ‘Plan B,'” Andrea Nahles said in Thursday editions of newspapers published by the Funke Mediengruppe chain, when asked what would happen if the vote failed. \nNahles estimated that a third of delegates to Sunday’s meeting were still undecided, but said she was convinced a majority of delegates would vote to begin coalition talks. \nMerkel is counting on the SPD to secure a fourth term in office and end the uncertainty that has eroded her public standing after 12 years as the undisputed leader of Europe. \nNahles said she and other SPD negotiators had hammered out a good blueprint in exploratory talks with conservatives, including plans to boost pensions to 48 percent by 2025, phase out a solidarity tax imposed to help poorer eastern states, and avert an upper limit on migration. \n“We are seeking approval for coalition talks, and we can do that with good reason,” Nahles told the newspaper group. “I‘m convinced that we reached a good result in exploratory talks to very specifically improve the lives of citizens.” \nThe SPD’s youth and left wings oppose coalition talks, arguing that another tie-up with conservatives would further weaken the party, which had suffered its worst post-war election result in September. \nNahles, the former labour minister, conceded that her party had not won all its demands in the negotiations, including a call for a universal citizen’s insurance, but said many other important party projects were now within reach. \n“We stand before a difficult fork in the road: Do we want to turn this (agreement) into new policies for the people of our country, or do we want new elections?” she asked. \nSPD leader Martin Schulz and Michael Groschek, the party leader in the western state of North Rhine-Westphalia (NRW), which accounts for about a quarter of the delegates to Sunday’s vote, on Wednesday both forecast a favourable outcome. \nSchulz, seeking to assuage critics’ concerns, told reporters that some areas such as healthcare and rental caps, could be added during formal coalition talks, and highlighted the fact that negotiators had agreed to review the deal after two years. Related Coverage Bavarian ally dodges question of whether Merkel would lead in new vote \nThe SPD had planned to reinvent itself in opposition after its poor election results, but was persuaded to enter talks with conservatives when Merkel failed to form a coalition with two smaller parties in November. \nThe latest INSA poll showed the SPD slipping to 18.5 percent, its worst result in that particular survey. That was even below the 20.5 percent it achieved in September’s election, which was its poorest performance since Germany became a federal republic in 1949. \nRefusal by SPD delegates to hold further talks could lead to new elections or a minority Merkel-led government for the first time in Germany’s post-war era. Reporting by Andrea Shalal; Editing by Richard Chang", "external_links": [], "published": "2018-01-18T02:07:00.000+02:00", "crawled": "2018-01-18T02:24:58.005+02:00", "highlightTitle": ""}