{"organizations": [], "uuid": "36c8dc47f5f2066ef31484ac23526d57f6a4b7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219837500&w=1200&r=LYNXMPEE050C5", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-israel-palestinians-religion/palestinians-attack-car-of-greek-patriarch-in-protest-against-land-deals-idUSKBN1EV0H2", "country": "US", "domain_rank": 408, "title": "Palestinians attack car of Greek Patriarch in protest against land deals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T16:45:00.000+02:00", "replies_count": 0, "uuid": "36c8dc47f5f2066ef31484ac23526d57f6a4b7db"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-religion/palestinians-attack-car-of-greek-patriarch-in-protest-against-land-deals-idUSKBN1EV0H2", "ord_in_thread": 0, "title": "Palestinians attack car of Greek Patriarch in protest against land deals", "locations": [], "entities": {"persons": [{"name": "theophilos iii", "sentiment": "none"}], "locations": [{"name": "west bank", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "bethlehem", "sentiment": "none"}, {"name": "bethlehem", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 2:46 PM / Updated 2 hours ago Palestinians attack car of Greek Patriarch in protest against land deals Reuters Staff 2 Min Read \nBETHLEHEM, West Bank (Reuters) - Palestinian Christians on Saturday pummeled the car of the Greek Orthodox Patriarch of Jerusalem during a visit to the occupied West Bank in protest against the church’s decision to sell land to Jewish groups. \nThe Greek Orthodox church is one of the biggest private landowners in the Holy Land and in recent years has stirred controversy both among Israelis and Palestinians by trying to sell prime assets to private investors. \nHundreds of Palestinians blocked Patriarch Theophilos III’s convoy as he drove to a church in Bethlehem to attend an Orthodox Christmas mass. \nProtestors threw stones and water bottles and pounded his car with their fists, chanting “traitor, traitor,” before Palestinian security forces pushed them away. Three cars in the convoy, but not the Patriarch’s vehicle, had their windows smashed. Palestinian security forces push away demonstrators from the convoy of Greek Orthodox Patriarch of Jerusalem Theophilos III, during a protest against his visit, in the West Bank city of Bethlehem January 6, 2018. REUTERS/Mussa Qawasma \nDemonstrator Elyeef Sayegh said: “What happened today is a message to the Palestinian Authority and to Jordan that we will not allow this traitor to stay in the Church.” \nIsraeli media have reported that the controversial deals include properties in East and West Jerusalem, as well as in the port cities of Caesarea and Jaffa. They identified some Jewish and Israeli investors as potential buyers. Slideshow (3 Images) \nChurch officials have said they need to sell land in order to pay back debt that has accumulated over the years. Until now the church has been leasing out the land to residents on long-term contracts. \nSome Israeli lawmakers are trying to block the deals that they fear could lead to large increases in real estate prices. Palestinians oppose the sale of land to Jewish and Israeli groups and consider it an act of treason. \nThe demonstrators were Christians from Bethlehem, Nazareth and other cities inside Israel. Reporting by Ali Sawafta and Nidal Almughrabi; Editing by Stephen Powell", "external_links": [], "published": "2018-01-06T16:45:00.000+02:00", "crawled": "2018-01-06T16:58:36.040+02:00", "highlightTitle": ""}