{"organizations": [], "uuid": "91e77efbba8fd39fba6a427a11147fc91dc45e7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-901262368.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/bomb-cyclone-grayson-power-outages/", "country": "US", "domain_rank": 1196, "title": "'Bomb Cyclone' Puts Freeze on East Coast Power Supply | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.241, "site_type": "news", "published": "2018-01-05T23:30:00.000+02:00", "replies_count": 0, "uuid": "91e77efbba8fd39fba6a427a11147fc91dc45e7d"}, "author": "Reuters", "url": "http://fortune.com/2018/01/04/bomb-cyclone-grayson-power-outages/", "ord_in_thread": 0, "title": "'Bomb Cyclone' Puts Freeze on East Coast Power Supply | Fortune", "locations": [], "entities": {"persons": [{"name": "angela weiss", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s. atlantic coast", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "pilgrim station", "sentiment": "none"}, {"name": "southeast", "sentiment": "none"}], "organizations": [{"name": "entergy corp", "sentiment": "none"}, {"name": "iso new england", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ngela weiss", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 'Bomb Cyclone' Has Put a Freeze on the Power Supply in Parts of the East Coast A man rides a bicycle in Brooklyn, New York on Jan. 4, 2018. Angela Weiss—NGELA WEISS AFP/Getty Images By Reuters 9:30 PM EST \nA severe winter storm froze pipes and disrupted services at refineries on the U.S. Atlantic coast on Thursday, sending fuel prices higher as heavy snowfall and high winds caused electricity outages for almost 80,000 homes and businesses. \nThe only nuclear plant in Massachusetts was shut just after 2 p.m. because of the failure of a line that connects the reactor to the power grid. Entergy Corp, which operates the Pilgrim Station, said it had not identified the cause of the line problem. ISO New England, which operates the region’s power grid, attributed the shutdown to blizzard conditions. The company did not say when the station would restart. \nUtilities in the Southeast have restored service to some customers who were hit by the storm overnight. \nHeavy snow pounded the East Coast from Maine as far south as North Carolina on Thursday, taking out power lines, icing roadways and closing schools. \nThe storm was powered by a rapid plunge in barometric pressure that some weather forecasters referred to as bombogenesis or a “bomb cyclone,” which brought high winds and swift, heavy snowfall. \nThe region has also been in the grip of a prolonged cold spell. \nPrices for heating oil and natural gas in the U.S. Northeast hit their highest levels in years on the back of near-record heating demand. Benchmark U.S. heating oil futures are near their highest in almost three years. \nThe U.S. average home residential heating oil prices rose 5.4% to $3.078 a gallon in the week through Jan. 1 from a week earlier, according to data from the U.S. Energy Information Administration. On the East Coast, prices rose 5.4% to $3.085 a gallon. \nU.S. average residential heating oil prices for the 2017-18 period are well above the 2016-17 levels, the data showed. \nFor more on bomb cyclones, watch Fortune’s video: \nU.S. natural gas demand was expected to remain near record highs this week. Natural gas is the major fuel for residential and commercial heating in the U.S. Northeast and is also widely used by power plants. \nOn Thursday, natural gas futures fell 12.8 cents, or 4.3%, to settle at $2.880 per million British thermal units. That was the biggest one-day decline for the contract in three weeks as less cold weather was predicted. However, regional prices soared under pressure from the cold snap. \nU.S. spot natural gas and power prices on Thursday rose to their highest in years in several regions. \nNext-day power prices in New England and PJM, which covers much of the U.S. mid-Atlantic and Midwest region, rose to their highest since January 2014 due to a spike in local natural gas prices. \nNew England’s cash prices soared last week, and remained near four-year highs at $36.32 per mm Btu. ISO-New England, that region’s power grid operator, said on Thursday that its power operators were relying more heavily on generators that burn heating oil due to heavy natural gas demand from homes and businesses. \n“We expect to have sufficient capacity and fuel available and expect to be able to weather the storm without running up against significant emissions limits, but concerns remain the same regarding fuel availability and emissions limits throughout this protracted cold spell and the rest of the winter,” the company said in a statement. \nISO New England spokeswoman Marcia Blomberg said there were “no immediate reliability issues to the local area” due to the shutdown of Pilgrim. \nThe lights did not go out in New England after the 688 megawatt Pilgrim plant shut because New England, like all U.S. power grids, keeps some generating plants in reserve in case an operating unit unexpectedly shuts. On Thursday, the grid had a reserve of over 2,100 MW. One megawatt is enough to power about 1,000 U.S. homes. \nBlomberg added that the loss of Pilgrim “does further challenge the region on fuel availability because we need to rely on other generating resources to meet consumer demand and meet overall grid reliability.” \nIn New York, very few generator outages were reported and there were no problems with a lack of fuel, Wes Yeomans, vice president of Operations at the New York Independent System Operator, said on a call on Thursday. \nThere are concerns that a significant disruption could lead to a heating oil shortage as distillate inventories, including heating oil, in the New England and Mid-Atlantic regions are at their lowest levels for this time of year since 2015. \nThis has spurred tankers carrying diesel and heating oil to set out from Europe bound for the United States to address supply worries, reversing a traditional trade route. \nIcebreakers have been used in ports of Boston, New York and Philadelphia to keep shipping lanes clear, though delays are expected, and the Coast Guard said late on Wednesday that those ships would remain at shore until the storm had passed. \nReliance on heating oil is highest in the Northeast, with about 21% of households using oil for space heating. \nMost northern U.S. refiners are not reporting problems. Phillips 66 shut a crude and coking unit at its Wood River, Illinois, refinery after a frozen line and short-lived fire, a source said on Wednesday. It did not have a timeline for restarting the units at the Illinois plant, the source said. \nPhiladelphia Energy Solutions postponed planned work at its 335,000 refinery complex in Philadelphia until after the storm. \nCrude carrier Ridgebury Pioneer, carrying 1.9 million barrels of heavy crude into the Philadelphia area, has been delayed by the storm, according to Reuters Eikon shipping data and two sources familiar with the delivery. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-05T23:30:00.000+02:00", "crawled": "2018-01-05T04:50:46.006+02:00", "highlightTitle": ""}