{"organizations": [], "uuid": "fc690c207e30712aa13a578322d3f56dc17e2b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-trimble-acquires-stabiplan-to-expand-its-european-mep-engineering-solutions.html", "country": "US", "domain_rank": 767, "title": "Trimble Acquires Stabiplan to Expand its European MEP Engineering Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T14:30:00.000+02:00", "replies_count": 0, "uuid": "fc690c207e30712aa13a578322d3f56dc17e2b15"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-trimble-acquires-stabiplan-to-expand-its-european-mep-engineering-solutions.html", "ord_in_thread": 0, "title": "Trimble Acquires Stabiplan to Expand its European MEP Engineering Solutions", "locations": [], "entities": {"persons": [{"name": "trimble", "sentiment": "none"}, {"name": "stabiplan", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bodegraven", "sentiment": "none"}, {"name": "stabicad", "sentiment": "none"}], "organizations": [{"name": "stabiplan b.v.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 4, 2018 /PRNewswire/ -- Trimble (NASDAQ: TRMB) announced today it has acquired Stabiplan B.V. based in Bodegraven, Netherlands, a 3D Computer Aided Design and Engineering (CAD/CAE) software and Building Information Modeling (BIM) content provider for the Mechanical, Electrical and Plumbing (MEP) industries in Europe. The Stabiplan acquisition broadens Trimble's existing construction solutions for MEP contractors and engineers that enable automated estimating, project management, modeling, detailing, layout and construction. Financial terms were not disclosed.\nStabiplan's solutions include Stabicad software and the MEPcontent BIM content library. Stabicad is a 3D CAD/CAE software solution for Revit and AutoCAD, which integrates design, drawing and engineering calculation/analysis, supporting workflows from engineering to construction. MEPcontent.com is an open online BIM library for MEP contractors and engineers in Europe. With MEPcontent, MEP engineers and contractors can deliver technically accurate models and drawings while including manufacturer-specific content, to ensure that a model contains uniform and accurate information for fabrication and documentation.\nThe construction industry is evolving quickly with new technologies and improved methods to transform every phase of construction projects. MEP contractors and engineers are now able to eliminate waste and rework with fully-constructible and actionable models. With intelligent data to fuel fabrication, prefabrication and lean construction, contractors are improving productivity and profitability across the project. Trimble's building solutions extend the design data created in the office to field-level systems for precise delivery of construction elements.\n\"Stabiplan's strength lies in its ability to offer localized construction software applications and provide users with intuitive work processes for optimal efficiency and productivity in the office,\" said Lawrence Smith, general manager of Trimble's MEP Division. \"The Stabiplan portfolio complements our existing products for the European MEP market, including Trimble Plancal nova and Trimble Amtech ProDesign, to provide European contractors with a robust set of design tools from a single source.\"\n\"Stabiplan provides a core competency in CAD/CAE and BIM design software and content for MEP contractors and engineers to augment Trimble's current portfolio of solutions for the European MEP contractor,\" said Gijs Willem Sloof, CEO of Stabiplan. \"The acquisition allows us to further develop our best-in-class solutions with Trimble's resources and offer our solutions on a more global scale. Together with Trimble, we will continue to develop enhanced BIM solutions to enable better collaboration between our customers and their clients.\"\nThe Stabiplan business will be reported as part of the Buildings and Infrastructure Segment.\nAbout Stabiplan\nSince its founding in 1990, Stabiplan has grown to become a leader in the development and sales of design software for MEP engineering in Europe. Stabiplan's multi-platform product Stabicad is adapted to the local needs and preferences of its users. Stabicad allows engineers to design, visualize, control and optimize building services. The online BIM library for MEP contractors and engineers www.mepcontent.com offers up-to-date 2D and 3D BIM content and productivity enhancing apps for the MEP community. Stabiplan has offices in Belgium, Germany, France, the Netherlands and Romania.\n visit: www.stabiplan.com .\nAbout Trimble Buildings\nTrimble Buildings provides the widest breadth of technology solutions for managing real estate portfolios, optimizing building construction projects and streamlining workplace operations. Trimble solutions are tailored for each phase of the building lifecycle—from the initial survey to design, construction and operation—and enable stakeholders such as architects, engineers, contractors, building managers and property owners to gain agility and insight. With the industry's only construction-ready BIM and full range of tools and content to streamline team collaboration, Trimble solutions make data from complex projects more meaningful and actionable to improve productivity and achieve operational excellence.\n visit: buildings.trimble.com .\nAbout Trimble\nTrimble is transforming the way the world works by delivering products and services that connect the physical and digital worlds. Core technologies in positioning, modeling, connectivity and data analytics enable customers to improve productivity, quality, safety and sustainability. From purpose built products to enterprise lifecycle solutions, Trimble software, hardware and services are transforming a broad range of industries such as agriculture, construction, geospatial and transportation and logistics. about Trimble (NASDAQ:TRMB), visit: www.trimble.com .\nThis press release contains regarding the business operations and prospects of Trimble, including statements regarding the impact of the Stabiplan acquisition to broaden Trimble's MEP engineering solutions in Europe, expand its channel for field and layout solutions, and utilize potential synergies. These subject to change, and actual results may materially differ due to certain risks and uncertainties. Factors that could cause or contribute to changes in such include, but are not limited to (i) realizing the anticipated benefits of the acquisition, (ii) Trimble's ability to combine Stabiplan's solutions with Trimble's MEP solutions to deliver enhanced product offerings for adoption by the MEP community, and (iii) the risks and uncertainties associated with unexpected expenditures or assumed liabilities that may be incurred as a result of the acquisition. More information about potential factors which could affect Trimble's business and financial results is set forth in reports filed with the SEC, including Trimble's quarterly reports on Form 10-Q and its annual report on Form 10-K. All based on information available to Trimble as of the date hereof, and Trimble assumes no obligation to update such statements.\nGTRMB\nView original content: http://www.prnewswire.com/news-releases/trimble-acquires-stabiplan-to-expand-its-european-mep-engineering-solutions-300577212.html\nSOURCE Trimble", "external_links": ["http://buildings.trimble.com/industry-solutions", "https://www.stabiplan.com/", "http://www.trimble.com/", "http://www.prnewswire.com/news-releases/trimble-acquires-stabiplan-to-expand-its-european-mep-engineering-solutions-300577212.html", "http://www.mepcontent.com/"], "published": "2018-01-04T14:30:00.000+02:00", "crawled": "2018-01-04T13:58:44.002+02:00", "highlightTitle": ""}