{"organizations": [], "uuid": "faabfbda4e0dd97325b3f97ce3d6b9abdaa3758d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219648395&w=1200&r=LYNXMPEE0411C", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-global-lng/spot-prices-rise-as-cold-weather-strikes-india-buys-idUSKBN1EU1PM", "country": "US", "domain_rank": 408, "title": "Spot prices rise as cold weather strikes, India buys", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-06T01:14:00.000+02:00", "replies_count": 0, "uuid": "faabfbda4e0dd97325b3f97ce3d6b9abdaa3758d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-lng/spot-prices-rise-as-cold-weather-strikes-india-buys-idUSKBN1EU1PM", "ord_in_thread": 0, "title": "Spot prices rise as cold weather strikes, India buys", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "reuters eikon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Asian spot LNG prices rose to highs not seen since November 2014 on strong demand as a cold snap stimulated consumption in China and India launched fresh purchase tenders.\nSpot prices for February delivery steadied at $11.30 per million British thermal units (mmBtu), 10 cents above Jan. 2 levels.\nHeavy snowfall across parts of China curbed deliveries of LNG both by truck and by tanker into some import terminals, with temperatures also forecast to fall well below average in Tokyo, Seoul, Beijing and Shanghai from next week, according to data on the Reuters Eikon terminal.\nAs a result, demand for spot cargoes from Japan, South Korea and China was expected to remain firm, traders said.\nJapanese utilities have been actively buying cargoes in recent weeks as cold weather sweeping the country has fueled demand to replenish depleted stocks.\nChina, which surpassed South Korea as the world’s second-biggest LNG importer, continues to attract spot cargoes after rapid consumption growth in 2017, when imports rose by more than 48 percent.\nIndian demand was particularly strong. Petronet and Gail both closed tenders this week to pick up supplies, though the outcome of the award could not be confirmed.\nBharat Petroleum also launched a tender seeking a cargo for the second half of February.\nOn the supply side, Indonesia’s Bontang plant was expected to award a tender to sell about 11 cargoes between February and December.\nOutput from two Australian projects, Wheatstone and Gorgon, improved markedly after conclusion of maintenance-related outages.\nU.S. spot prices also hit record highs after snowstorms lashed the East Coast. Algonquin Citigate within-day prices hit $82.75 per mmBtu, Henry Hub was at $4.65 per mmBtu and Transco Z6 New York prices hit $140.25 per mmBtu.\nThe price of month-ahead gas on the Henry Hub, the country’s most liquid hub, were less influenced by the temporary blast of cold weather, trading at $2.795 per mmBtu.\nStill, importers were looking to bring spot shipments into the under-used Everett terminal in Boston and Canaport terminal in Canada, which can be used to serve customers in the United States.\nPipeline limitations prevent those local markets from drawing in enough supply during times of peak demand, prompting a surge in prices for spot LNG sellers.\nA cargo from Trinidad and Tobago aboard the Provalys tanker is currently unloading at Everett.\nEditing by David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-06T01:14:00.000+02:00", "crawled": "2018-01-05T22:24:22.002+02:00", "highlightTitle": ""}