{"organizations": [], "uuid": "106b3992d2308e342c7e400c49daf3be667e5f46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-basic-appoints-robert-hayes-as-new-president-ceo.html", "country": "US", "domain_rank": 767, "title": "BASIC Appoints Robert Hayes as New President & CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:53:00.000+02:00", "replies_count": 0, "uuid": "106b3992d2308e342c7e400c49daf3be667e5f46"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-basic-appoints-robert-hayes-as-new-president-ceo.html", "ord_in_thread": 0, "title": "BASIC Appoints Robert Hayes as New President & CEO", "locations": [], "entities": {"persons": [{"name": "robert hayes", "sentiment": "negative"}, {"name": "rob", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "hayes", "sentiment": "none"}], "locations": [{"name": "portage", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "roseville", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "benefit administrative services international co", "sentiment": "negative"}, {"name": "custom benefit administrators, inc.", "sentiment": "none"}, {"name": "national association of professional benefit administrators", "sentiment": "none"}, {"name": "cba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTAGE, Mich., Jan. 8, 2018 /PRNewswire/ -- BASIC (Benefit Administrative Services International Corporation) today announced Robert Hayes will serve as the new President and Chief Executive Officer, effective January 1, 2018. Hayes most recently served as Executive Vice President and Partner at BASIC, primarily responsible for the western division (BASIC pacific). Robert brings more than 15 years of senior executive experience to BASIC, one of the country's leading privately held third-party employee benefits administrators.\nPreviously, Rob served as Founder and CEO of Custom Benefit Administrators, Inc. a leading regional administration firm based in Roseville, CA. CBA merged with BASIC on January 1, 2015, at which time, Rob became a partner and Board Member. Rob's career also includes serving as President of NAPBA (the National Association of Professional Benefit Administrators). He brings the ideal combination of leadership, vision and practical experience needed to lead BASIC in 2018 and beyond.\n\"Since Rob became a partner three years ago, this has been part of our plan; one person at the head of the company to drive growth and administrative excellence. Rob brings a new perspective with energy and determination,\" said Fritz Teutsch, the outgoing CEO and Co-Founder of BASIC, who announced his departure in October as part of a planned transition. Teutsch will continue to serve on the company's Board of Directors along with BASIC's other Co-Founder, Mike Stoddard.\n\"This transition sharpens our focus on growing our core HR Services and accelerates our commitment to develop state of the art technology that meets the needs of our clients for years to come, while ensuring that our broker partners and clients continue to receive the exceptional service and personal support they expect from BASIC,\" said Hayes. \"Rob's experience, spirit and guidance line up perfectly with what the company needs to continue our substantial growth and drive toward excellence in all facets of our business,\" said Fritz Teutsch.\n\"BASIC has grown at over 20% per year over the past 5 years and has aspirations to continue this success through operational excellence, robust organic growth and strategic acquisitions. With 7 administrative offices nationwide, over 180 employees and serving more than 15,000 employers, we are poised to grow even more briskly in the coming years,\" said Hayes\nAbout BASIC\nBASIC, one of the first third-party administrators of FSA (flexible spending accounts) in the nation is a technology driven HR Compliance Company focused on delivering administrative and technology solutions to assist Human Resource Departments nationwide. Current services include COBRA, FSA, HSA, HRA, Commuter, HR Compliance, BenAdmin, HRIS, HCM & Payroll. BASIC's expertise allows employers to control costs, manage risks and improve staff focus and effectiveness. BASIC's suite of solutions offered independently or as a platform of services, paired with their experienced staff, ensures consistency and flexibility. For more information, visit www.basiconline.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/basic-appoints-robert-hayes-as-new-president--ceo-300579072.html\nSOURCE BASIC", "external_links": ["http://www.prnewswire.com/news-releases/basic-appoints-robert-hayes-as-new-president--ceo-300579072.html", "http://www.basiconline.com/"], "published": "2018-01-08T18:53:00.000+02:00", "crawled": "2018-01-08T21:19:11.027+02:00", "highlightTitle": ""}