{"organizations": [], "uuid": "b7e7b20a6df950f36a87349d6c7dbb262152111b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/29/brainstorm-health-daily-01-29-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: E-Cigarettes and Public Health, Sanofi Buys Ablynx, Alex Azar and Drug Prices | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.985, "site_type": "news", "published": "2018-01-29T02:00:00.000+02:00", "replies_count": 0, "uuid": "b7e7b20a6df950f36a87349d6c7dbb262152111b"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/29/brainstorm-health-daily-01-29-18/", "ord_in_thread": 0, "title": "Brainstorm Health: E-Cigarettes and Public Health, Sanofi Buys Ablynx, Alex Azar and Drug Prices | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 \nHappy Monday, Dailies. \nBottom lines are seldom straight—particularly in the health arena. Even the glitteriest of gold-standard clinical trials, for instance, are often undone by a leaden follow-up study that has the nerve to arrive at a different result. Likewise, reports by even the most azure of blue ribbon panels often offer conclusions with more wiggle room than a pair of clown shoes. \nTake, for example, the recently published report entitled “ Public Health Consequences of E-Cigarettes ,” by the National Academies of Sciences, Engineering, and Medicine—which the Academies helpfully point out is a “ congressionally mandated ” study. (One gets the feeling they didn’t want to release it, but had to.) \nThis so-called “ Consensus Study Report ” appears to have no real consensus at all—or if it does, well, then the bottom line is as squiggly as they come. \nThat said, since I am in the service business, I will do my best to offer a summary. Herewith: \nVaping is addictive…or not…depending on who’s doing it: “Among youth” (that’s anybody who would never be caught dead using the word “youth”), “there is substantial evidence that e-cigarette use increases the risk of transitioning to smoking conventional cigarettes.” For adults, vaping can wean people away from their cigarette addiction, it seems. That’s a good thing. \nE-cigs are dangerous…or not…depending on the circumstance: The Academies’ uberstudy, which carefully reviewed more than 800 other peer-reviewed studies, found “conclusive evidence” that “most e-cigarettes…contain and emit numerous potentially toxic substances” (besides nicotine, that is), but found only “substantial evidence” that this exposure to poisons is sorta maybe “significantly lower” than it is in tobacco-filled smokes. Sums up David Eaton, chair of the committee authoring the report, in an accompanying press release : “E-cigarettes cannot be simply categorized as either beneficial or harmful.” Gotcha. \nIn addition, “There is conclusive evidence that e-cigarettes can explode and cause burns and projectile injuries.” (Nice!) “There is conclusive evidence that intentional or accidental exposure to e-liquids”—the chemicals in the vaping cartridge that, when heated, release the aerosolized inhalant of nicotine and perhaps one of 7,700 flavors —“can result in adverse health effects such as seizures, anoxic brain injury, vomiting, and lactic acidosis.” (And in case you’re wondering, drinking that stuff is not only dumb as dirt, but likely fatal too.) \nHOWEVER…said the report summary: “Under the assumption that e-cigarette use increases the rate at which adults quit conventional smoking, modeling projects that use of e-cigarettes will generate a net public health benefit…” \nUm, “…at least in the short run.” \nAnd in the long run? More squiggle, I’m afraid: “The net public health benefit is substantially less, and under some scenarios…harmful.” \nThe full report can be downloaded for free if you register (or available in paperback for an economical $105). But you can save time and/or money and speed-read all 47 conclusions in a matter of minutes. (At least I think there are 47. The conclusions are so strangely numbered, it’s hard to tell.) \nAs for me, I found a much clearer takeaway from a guy named “Steve” (@Stevie__c) on Twitter. His conclusion? \n“Vaping is weird. You leave the pub and walk past a group of tough looking football fans and they all smell like strawberry muffins.” \nWell done, Steve. Well done. Clifton Leaf, Editor in Chief, FORTUNE @CliftonLeaf DIGITAL HEALTH \nOmada launches randomized trial of digital diabetes care. There’s certainly no shortage of digital health startups aspiring to the loftiest of goals. But cold, hard, clinically proven data about these companies’ claims and ambitions is much harder to come by. Omada Health is rare in that regard—the firm, with its digital diabetes management system, is setting out to perform a large randomized clinical trial (the “gold standard” of studies) with the help of the University of Nebraska Medical Center to further gauge the efficacy of its program, which aims to keep those at risk for diabetes from developing the disease (earlier studies of the tech had proved promising enough to earn federal health program reimbursements). “Our goal at Omada has been to continually set new standards for what the industry should expect when it comes to the effectiveness of digital healthcare interventions,” said Omada co-founder and CEO Sean Duffy in a statement. “The PREDICTS trial is the next step in that evolution—it will track a range of healthcare and other outcomes, while establishing the highest level of clinical evidence for the effectiveness of a digitally-delivered intensive behavioral counseling program.” INDICATIONS \nSanofi scoops up Ablynx from beneath Novo’s nose. Call it the battle of the insulin makers—French drug giant (and diabetes specialist) Sanofi has beat rival Novo Nordisk in a quest to acquire Belgian biotech Ablynx. The $4.8 billion deal represents Sanofi’s second major deal of the year following its buyout of Bioverativ (and underscores the company’s need to branch out its product pipeline in the face of intense competition in the diabetes arena). ( Reuters ) THE BIG PICTURE \nWill Alex Azar fight high drug prices? President Donald Trump issued a bold task to his newly confirmed Health and Human Services (HHS) Secretary Alex Azar on Monday: Combat high drug prices and the opioid addiction epidemic. “He’s going to get those prescription drug prices way down,” said Trump during Azar’s swearing-in ceremony, adding that he expected Azar to be “very tough” on price gouging and opioid hawking pharmaceuticals. Azar mentioned some of these same goals during his confirmation hearings, wherein he faced sharp questions about his history as a top executive at drug giant Eli Lilly. REQUIRED READING ", "external_links": [], "published": "2018-01-29T02:00:00.000+02:00", "crawled": "2018-01-30T05:08:35.001+02:00", "highlightTitle": ""}