{"organizations": [], "uuid": "54f4cde4a4095356fbe9ce84bdb5440b62c428ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968270-GettyImages-160816921.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/25/farm-states-where-trump-base-is-strong-could-feel-pain-without-nafta.html", "country": "US", "domain_rank": 767, "title": "Farm states where Trump base is strong could feel pain without NAFTA", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.513, "site_type": "news", "published": "2018-01-26T05:52:00.000+02:00", "replies_count": 0, "uuid": "54f4cde4a4095356fbe9ce84bdb5440b62c428ce"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/25/farm-states-where-trump-base-is-strong-could-feel-pain-without-nafta.html", "ord_in_thread": 0, "title": "Farm states where Trump base is strong could feel pain without NAFTA", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "florida city", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "nafta trump", "sentiment": "negative"}, {"name": "getty images workers", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "cnb", "sentiment": "none"}, {"name": "dimare farms", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Speaking with CNBC, President Donald Trump once again blasted NAFTA and raised the possibility he might \"terminate\" the 24-year-old trade deal.\nTrump said during the interview from the World Economic Forum in Davos, Switzerland that \"NAFTA's a horrible deal, we're renegotiating it. I may terminate NAFTA, I may not — we'll see what happens.\"\nThe full interview with Trump is scheduled to be broadcast Friday at 6 a.m. ET on CNBC's \" Squawk Box .\"\nExiting the North American Free Trade Agreement, though, could close key markets for agricultural products, from meats and poultry to dairy and produce. There's also a chance leaving the pact with Mexico and Canada may end up costing American consumers more for their food, including Mexican-grown avocados used to make guacamole.\nMoreover, there could be retaliatory tariffs without NAFTA of 30 percent or higher that might impact industries within the U.S. that import goods for further processing, including meat processors, livestock, and fruit and vegetable processors.\nIt also could have consequences for Trump's support base in farm states, where there's a huge dependence on agricultural exports.\nshow chapters Trump is at Davos, and it’s all everyone’s talking about 12 Hours Ago | 01:54 \"The major agricultural states in the U.S. that actually sell to Canada and Mexico are places that voted for Trump in big numbers,\" said Inu Manak, a visiting fellow at the Cato Institute, the libertarian think tank. \"In that sense, I think it's also important for him not to touch it too much and not kind of disrupt these very important constituents who benefit so much from NAFTA.\"\nArkansas, Kansas, Iowa, Nebraska, Missouri, Texas and South Dakota are among the states where 27 percent or more of all agricultural exports go to Mexico, according to data released by the group Farmers for Free Trade , a bipartisan group.\nBut not everyone in agriculture thinks Trump should back off.\nTony DiMare, who has worked in Florida's agriculture industry for 35 years, said he agrees with the president that the current trade deal between the U.S., Mexico and Canada is flawed. In fact, he blames it for hurting his family's fresh tomato business.\nHe insisted that something must be done, alleging that Mexico isn't practicing fair trade under NAFTA. He said the trade pact allows Mexico to \"dump\" seasonal tomatoes and other fresh produce into the U.S. market.\nThe Trump administration, the third-generation tomato grower said, should continue to insist on changes to the trade pact that would allow U.S. seasonal growers to compete more effectively.\nAccording to DiMare, Mexico has turned vast areas that were once open farm acreage into a greenhouse environment so that growers can produce tomatoes and other crops on a year-round basis and compete with seasonal growers in Florida, Georgia and other states. Beyond that, it's tough to compete with Mexico's cheap labor costs, he conceded.\nIndeed, some southeast agricultural groups representing specialty fruit and vegetable producers are fed up with NAFTA and want it changed so they can pursue anti-subsidy and anti-dumping cases or seek temporary import quotas. At the same time, some of the dairy-producing bordering states with Canada, including Wisconsin and New York, want fixes for what they consider protectionist dairy trade policies up north.\nStill, larger agriculture groups such as the American Farm Bureau Federation and National Cattlemen's Association generally are largely supportive of NAFTA. The beef industry has thrived on NAFTA and wants to continue to have duty-free access to Canadian and Mexican markets.\nOn the third day of the sixth round of NAFTA re-negotiations in Montreal, agricultural groups and others are closely monitoring the situation and worrying that Trump might make good on threats to ditch the pact.\nReuters reported Thursday that the talks have led to \"few signs of progress.\"\nMexico and Canada together represent nearly one-third of total U.S. agricultural exports. Corn, wheat, soybeans, fresh fruits and vegetables as well as livestock and dairy are major U.S. exports to those countries. In response to NAFTA's uncertainty, Mexico has strengthened its trade ties with major producers in Latin America and looked for new suppliers of corn, wheat and soybeans, among other commodities.\nMexico was the top export market for U.S. corn last year, so American corn farmers, who are a large part of the economy in Midwestern states, could be big losers if NAFTA gets killed.\n\"NAFTA is a good damn deal for Texas,\" said C. Parr Rosson, professor and head of the department of agricultural economics at Texas A&M University. \"Not only agriculture, but a lot of industries in Texas are pushing hard to get this thing fixed.\"\nAgriculture Secretary Sonny Perdue, a longtime agriculture businessman, has been pushing Trump to fix NAFTA and not toss it out of the window.\nEarlier this month, Perdue said U.S. negotiators had already \"put a number of proposals on the table to modernize NAFTA, and critically for agriculture, to address key sectors left out of the original agreement — dairy and poultry tariffs in Canada.\"\nFor one, the Trump administration has accused Canada of essentially shutting out U.S. dairy producers in so-called ultrafiltered milk, which is used to make cheese, yogurt and ice cream. Last April, Trump called the Canadian action \"a disgrace\" and also tweeted about it: \"Canada has made business for our dairy farmers in Wisconsin and other border states very difficult.\"\nU.S. agricultural exports in fiscal 2017 totaled $140.5 billion, up nearly $11 billion from the prior year. Canada was the number two ag export customer last year after China, and Mexico was the third-largest, according to the U.S. Department of Agriculture.", "external_links": [], "published": "2018-01-26T05:52:00.000+02:00", "crawled": "2018-01-26T05:52:10.004+02:00", "highlightTitle": ""}