{"organizations": [], "uuid": "4451d588189fe6e5e2c3d76146a7eba9ce30ead3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-masimo-announces-fda-clearance-of-next-generation-sedlinea-brain-function-monitoring.html", "country": "US", "domain_rank": 767, "title": "Masimo Announces FDA Clearance of Next Generation SedLine® Brain Function Monitoring", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.484, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "4451d588189fe6e5e2c3d76146a7eba9ce30ead3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-masimo-announces-fda-clearance-of-next-generation-sedlinea-brain-function-monitoring.html", "ord_in_thread": 0, "title": "Masimo Announces FDA Clearance of Next Generation SedLine® Brain Function Monitoring", "locations": [], "entities": {"persons": [{"name": "patrick purdon", "sentiment": "none"}, {"name": "emery brown", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "masimo", "sentiment": "negative"}, {"name": "fda", "sentiment": "negative"}, {"name": "dsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Masimo (NASDAQ: MASI) announced today FDA clearance of Next Generation SedLine ® brain function monitoring. SedLine helps clinicians monitor the state of the brain under anesthesia with bilateral acquisition and processing of four leads of electroencephalogram (EEG) signals. Next Generation SedLine features an enhanced signal processing engine, driving a variety of performance improvements and helping give clinicians a more complete picture of the brain.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180129005445/en/\nMasimo Root® with Next Generation SedLine® Brain Function Monitoring (Photo: Business Wire)\nNext Generation SedLine provides an enhanced Patient State Index (PSi) – a processed EEG parameter related to the effect of anesthetic agents – based on its enhanced signal processing engine.\nIn addition, Next Generation SedLine displays an enhanced, Multitaper Density Spectral Array (DSA), developed by Dr. Emery Brown, MD, PhD, and Dr. Patrick Purdon, PhD, Director and Associate Director, respectively, of the Neuroscience Statistics Research Lab at Massachusetts General Hospital. The DSA represents activity in both sides of the brain. When displaying a Multitaper DSA, EEG data are transformed into the frequency domain, and may provide a better display of EEG features.\nJoe Kiani, Founder and CEO of Masimo, said, “Masimo is committed to innovation in the brain function monitoring space. With the improved performance offered by its enhanced signal processing capabilities, we expect Next Generation SedLine to impact brain function monitoring just as SET ® impacted pulse oximetry.”\nWhen used with the RD SedLine™ EEG sensor, Next Generation SedLine can be used simultaneously with O3 ® regional oximetry on the Root ® patient monitoring and connectivity platform for even more insight into a patient’s brain. O3 may help clinicians monitor cerebral oxygenation in situations in which pulse oximetry alone may not be fully indicative of the oxygen in the brain.\n@MasimoInnovates | #Masimo\nAbout Masimo\nMasimo (NASDAQ: MASI) is a global leader in innovative noninvasive monitoring technologies. Our mission is to improve patient outcomes and reduce the cost of care. In 1995, the company debuted Masimo SET ® Measure-through Motion and Low Perfusion™ pulse oximetry, which has been shown in multiple studies to significantly reduce false alarms and accurately monitor for true alarms. Masimo SET ® has also been shown to help clinicians reduce severe retinopathy of prematurity in neonates, 1 improve CCHD screening in newborns, 2 and, when used for continuous monitoring with Masimo Patient SafetyNet™* in post-surgical wards, reduce rapid response activations and costs. 3,4,5 Masimo SET ® is estimated to be used on more than 100 million patients in leading hospitals and other healthcare settings around the world, 6 and is the primary pulse oximetry at 17 of the top 20 hospitals listed in the 2017-18 U.S. News and World Report Best Hospitals Honor Roll. 7 In 2005, Masimo introduced rainbow ® Pulse CO-Oximetry technology, allowing noninvasive and continuous monitoring of blood constituents that previously could only be measured invasively, including total hemoglobin (SpHb ® ), oxygen content (SpOC™), carboxyhemoglobin (SpCO ® ), methemoglobin (SpMet ® ), Pleth Variability Index (PVi ® ), and more recently, Oxygen Reserve Index ™ (ORi™), in addition to SpO 2 , pulse rate, and perfusion index (Pi). In 2014, Masimo introduced Root ® , an intuitive patient monitoring and connectivity platform with the Masimo Open Connect™ (MOC-9™) interface, enabling other companies to augment Root with new features and measurement capabilities. Masimo is also taking an active leadership role in mHealth with products such as the Radius-7™ wearable patient monitor, iSpO 2 ® pulse oximeter for smartphones, and the MightySat™ fingertip pulse oximeter. Additional information about Masimo and its products may be found at www.masimo.com . Published clinical studies on Masimo products can be found at http://www.masimo.com/cpub/clinical-evidence.htm .\nORi has not received FDA 510(k) clearance and is not available for sale in the United States.\n*The use of the trademark Patient SafetyNet is under license from University HealthSystem Consortium.\nReferences\n1. Castillo A et al. Prevention of Retinopathy of Prematurity in Preterm Infants through Changes in Clinical Practice and SpO 2 Technology. Acta Paediatr. 2011 Feb;100(2):188-92.\n2. de-Wahl Granelli A et al. Impact of pulse oximetry screening on the detection of duct dependent congenital heart disease: a Swedish prospective screening study in 39,821 newborns. BMJ. 2009;Jan 8;338.\n3. Taenzer AH et al. Impact of Pulse Oximetry Surveillance on Rescue Events and Intensive Care Unit Transfers: A Before-And-After Concurrence Study. Anesthesiology. 2010; 112(2):282-287.\n4. Taenzer AH et al. Postoperative Monitoring – The Dartmouth Experience. Anesthesia Patient Safety Foundation Newsletter. Spring-Summer 2012.\n5. McGrath SP et al. Surveillance Monitoring Management for General Care Units: Strategy, Design, and Implementation. The Joint Commission Journal on Quality and Patient Safety. 2016 Jul;42(7):293-302.\n6. Estimate: Masimo data on file.\n7. http://health.usnews.com/health-care/best-hospitals/articles/best-hospitals-honor-roll-and-overview .\nForward-Looking Statements\nThis press release includes forward-looking statements as defined in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, in connection with the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among others, statements regarding the potential effectiveness of Masimo Next Generation SedLine ® and O3 ® . These forward-looking statements are based on current expectations about future events affecting us and are subject to risks and uncertainties, all of which are difficult to predict and many of which are beyond our control and could cause our actual results to differ materially and adversely from those expressed in our forward-looking statements as a result of various risk factors, including, but not limited to: risks related to our assumptions regarding the repeatability of clinical results; risks related to our belief that Masimo's unique noninvasive measurement technologies, including Masimo Next Generation SedLine and O3, contribute to positive clinical outcomes and patient safety; risks related to our belief that Masimo noninvasive medical breakthroughs provide cost-effective solutions and unique advantages; as well as other factors discussed in the \"Risk Factors\" section of our most recent reports filed with the Securities and Exchange Commission (\"SEC\"), which may be obtained for free at the SEC's website at www.sec.gov . Although we believe that the expectations reflected in our forward-looking statements are reasonable, we do not know whether our expectations will prove correct. All forward-looking statements included in this press release are expressly qualified in their entirety by the foregoing cautionary statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of today's date. We do not undertake any obligation to update, amend or clarify these statements or the \"Risk Factors\" contained in our most recent reports filed with the SEC, whether as a result of new information, future events or otherwise, except as may be required under the applicable securities laws.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005445/en/\nMasimo\nEvan Lamb, 949-396-3376\nelamb@masimo.com\nSource: Masimo", "external_links": ["http://www.masimo.com/cpub/clinical-evidence.htm", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=www.masimo.com&index=3&md5=62506328617220cc2eb2baca24e02799", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=www.sec.gov&index=6&md5=777e60b0fbea0dc40ccb3401aea0a31c", "http://health.usnews.com/health-care/best-hospitals/articles/best-hospitals-honor-roll-and-overview", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftrk.cp20.com%2FTracking%2Ft.c%3F90nmq-y44q7-lent0i5%26_v%3D2&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=%40MasimoInnovates&index=2&md5=890a8f30d11d8cfe35a603cfd7c4fa39", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=Masimo&index=1&md5=f08f75de9cb056f6df413f606705c820", "http://www.businesswire.com/news/home/20180129005445/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fhealth.usnews.com%2Fhealth-care%2Fbest-hospitals%2Farticles%2Fbest-hospitals-honor-roll-and-overview&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=http%3A%2F%2Fhealth.usnews.com%2Fhealth-care%2Fbest-hospitals%2Farticles%2Fbest-hospitals-honor-roll-and-overview&index=5&md5=da8626330b136c1948b58b540a257067", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masimo.com%2Fcpub%2Fclinical-evidence.htm&esheet=51749968&newsitemid=20180129005445&lan=en-US&anchor=http%3A%2F%2Fwww.masimo.com%2Fcpub%2Fclinical-evidence.htm&index=4&md5=a33052f1df1ed38013fa899425ec9919"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:38:22.050+02:00", "highlightTitle": ""}