{"organizations": [], "uuid": "165f9c0cf99127a91422d47663be29a81ea937f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/interserve-report-ft/update-1-interserve-shares-fall-14-percent-after-ft-reports-that-uk-is-monitoring-firm-idUSL8N1PC1G1", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Interserve shares fall 14 percent after FT reports that UK is monitoring firm", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:19:00.000+02:00", "replies_count": 0, "uuid": "165f9c0cf99127a91422d47663be29a81ea937f7"}, "author": "", "url": "https://www.reuters.com/article/interserve-report-ft/update-1-interserve-shares-fall-14-percent-after-ft-reports-that-uk-is-monitoring-firm-idUSL8N1PC1G1", "ord_in_thread": 0, "title": "UPDATE 1-Interserve shares fall 14 percent after FT reports that UK is monitoring firm", "locations": [], "entities": {"persons": [{"name": "interserve", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "am / updated 11", "sentiment": "negative"}, {"name": "ft", "sentiment": "negative"}, {"name": "interserve", "sentiment": "none"}, {"name": "financial times", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:21 AM / in 26 minutes UPDATE 4-After Carillion, Interserve shares hit by report that Britain is \"worried\" about firm Reuters Staff \n* Interserve shares fall as much as 15 percent \n* Ministers “very worried” about Interserve - FT \n* No supplier comparable to failed Carillion - govt \n* Interserve says govt updated on progress with lenders (Adds detail, PM May, closing price) \nBy Alistair Smout \nLONDON, Jan 17 (Reuters) - Shares in British contractor Interserve dropped on Wednesday after a report the government was monitoring the company, exacerbating worries about the sector two days after the collapse of competitor Carillion. \nCarillion entered liquidation on Monday and many of Britain’s outsourcers such as Capita, Mitie and Interserve have struggled after taking on work at low prices for long-running fixed-rate contracts following the financial crisis. \nThe Financial Times reported that ministers were “very worried” about Interserve, a major player in the outsourcing industry, managing facilities including washrooms and waste management at most of Britain’s busiest rail stations and some government departments. \nThe government said it monitored the health of all its suppliers but it did not believe that any of them were comparable to Carillion. \nInterserve shares, which have seen short interest rise in recent months, fell as much as 15 percent but recouped most of the losses after the government’s statement, closing just 0.4 percent lower. \n“Ministers are very worried about Interserve,” said one official, according to the FT report, which added that civil servants were monitoring the firm after a profit warning last September. \nA spokeswoman for Britain’s Cabinet Office played down the report. \n“We monitor the financial health of all of our strategic suppliers, including Interserve. We are in regular discussions with all these companies regarding their financial position,” she said. \n“We do not believe that any of our strategic suppliers are in a comparable position to Carillion.” \nThe report on Interserve comes as opposition politicians question whether the government scrutinised Carillion closely enough before its collapse. \nLabour politicians have questioned whether the government did their due diligence as they awarded Carillion contracts even after the company issued a series of profit warnings last year. \nPrime Minister Theresa May defended the decision to carry on using Carillion after the profit warnings in parliament on Wednesday. \n“If the government pulled out of contracts ... whenever a profit warning was issued, that would be the best way to ensure that companies failed and jobs were lost,” she said. HIGH-RISK BUY \nInterserve, which employs around 80,000 people worldwide, said that it was updating the government on the company’s progress with its turnaround plan following its own profit warnings. \n“We continue to have constructive discussions with lenders over longer-term funding,” a spokesman for the company said. \n“We are keeping the Cabinet Office closely appraised of our progress as would be expected.” \nInterserve warned of lower annual earnings in September, sending shares crashing by more than 50 percent. Another profit warning followed in October. \nThose profit warnings have sparked a surge in “short” trades on the stock as investors bet on price falls. Significant short positions have risen from 0.7 percent in August to 8.6 percent currently, according to data from the FCA, making it the 15th most-shorted stock in the country. \nHowever, a week ago Interserve said that 2018 operating profit would be ahead of forecasts, sending shares to their highest since the September profit warning. The spokesman for Interserve said that last week’s update remained the position. \nInterserve said net debt at the end of 2017 will be around 513 million pounds ($707 million). \nCarillion said in November it had expected full-year average net borrowing in 2017 to be between 875 million pounds and 925 million pounds, but its total debt and pensions liabilities have been estimated as at least 2.2 billion pounds. \n“We believe Interserve is very different from Carillion,” analysts at Liberum said in a note, adding that investors could support an equity raise. \n“There is clearly too much debt ... But there are businesses to sell and we believe that shareholders would support a raise,” it added, saying Interserve was a “High-risk Buy”. $1 = 0.7251 pounds Reporting by Alistair Smout; Additional reporting by Alasdair Pal; editing by Keith Weir/Andrew Heavens/David; Evans", "external_links": [], "published": "2018-01-17T10:19:00.000+02:00", "crawled": "2018-01-17T10:41:09.005+02:00", "highlightTitle": ""}