{"organizations": [], "uuid": "1c90e7c53b15d289db720c1e975e304d1504a65e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-million-dollar-deal--singlepoint-signs-loi-to-acquire-100-percent-of-bitcoin-payment-platform-bitcoin-beyond.html", "country": "US", "domain_rank": 767, "title": "Million Dollar Deal - SinglePoint Signs LOI to Acquire 100% of Bitcoin Payment Platform Bitcoin Beyond", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.818, "site_type": "news", "published": "2018-01-23T15:30:00.000+02:00", "replies_count": 0, "uuid": "1c90e7c53b15d289db720c1e975e304d1504a65e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-million-dollar-deal--singlepoint-signs-loi-to-acquire-100-percent-of-bitcoin-payment-platform-bitcoin-beyond.html", "ord_in_thread": 0, "title": "Million Dollar Deal - SinglePoint Signs LOI to Acquire 100% of Bitcoin Payment Platform Bitcoin Beyond", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 23, 2018 (GLOBE NEWSWIRE) -- via OTC PR WIRE--SinglePoint, Inc. (SING) today announces a letter of intent (“LOI”) to acquire 100% of Bitcoin Beyond, a premier platform that enables retail merchants to accept bitcoin payments using their existing web-enabled point-of-sale device. This acquisition, priced at $1 million all stock, is expected to provide SinglePoint with a full end-to-end purchasing experience that provides merchants and bitcoin users unprecedented capabilities.\nBitcoin Beyond was created to address growing demand for fast and reliable electronic payment processing for the cannabis industry. As the industry exists today, many merchants face extensive physical cash management issues that require expensive and risky on-site safes, armed guards, armored cars, and physical cash transfers. Bitcoin Beyond stands to overcome these challenges, functioning as a general-purpose point-of-sale system that processes dollar-denominated payments using bitcoin. It can be operated from any web-enabled terminal available at checkout, from a cell phone to a tablet, to a full PC.\n“We are thrilled with this opportunity. Acquiring Bitcoin Beyond put us ahead of what we believe merchants have access to now. This platform has by far the easiest user interface we have seen in the market, and we are confident merchants will be quick to adopt this solution as it stands as the sole alternative to traditional options offered to the cannabis industry,” states SinglePoint President Wil Ralston.\nThe Bitcoin Beyond System was designed using 14 years of expertise in creating payment processing and online wallet solutions. It is built on a widely used technology stack, with security best practices and private merchant data is stored encrypted at rest. Because of this industry-leading technology, Bitcoin Beyond can be easily used and integrated with existing frameworks to add a simple means of payment with bitcoin, as well as other cryptocurrencies, such as Weed Coin, in the future. SinglePoint has an early investment in Weed Coin which has currently increased 8x in value.\nBitcoin Beyond furthers SinglePoints’ Bitcoin payments solution which the company recently signed Kevin Harrington to evangelize and consult on. Last week the company started production of the commercial spot and is now in editing and post-production. SinglePoint has engaged a media specialist to start the process of getting the commercial aired on major national news networks to drive consumer sign ups and awareness for the service.\nSinglePoint has plans to acquire additional companies in the space and again broaden its footprint in the quickly emerging blockchain space. The company is currently in negotiations to acquire another blockchain centric company in an effort to deploy its technology to major established markets.\nAbout SinglePoint, Inc.\nSinglePoint, Inc. (SING) has grown from a full-service mobile technology provider to a publicly traded holding company. Through diversification into horizontal markets, SinglePoint is building its portfolio by acquiring an interest in undervalued subsidiaries, thereby providing a rich, diversified holding base. Through its subsidiary company SingleSeed , the company is providing products and services to the cannabis industry.\nConnect on social media at:\nhttps://www.facebook.com/SinglePointMobile\nhttps://twitter.com/_SinglePoint_\nhttps://www.linkedin.com/company/singlepoint\nFor more information visit: www.SinglePoint.com\nForward-Looking Statements\nCertain statements in this news release may contain forward-looking information within the meaning of Rule 175 under the Securities Act of 1933 and Rule 3b-6 under the Securities Exchange Act of 1934, and are subject to the safe harbor created by those rules. All statements, other than statements of fact, included in this release, including, without limitation, statements regarding potential future plans and objectives of the Company, are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements.\nTechnical complications, which may arise, could prevent the prompt implementation of any strategically significant plan(s) outlined above. The Company undertakes no duty to revise or update any forward-looking statements to reflect events or circumstances after the date of this release.\nContact:\nSinglePoint, Inc.\nwww.SinglePoint.com\nGreg Lambrecht\n602.481.1544\nCorporate Communications Contact:\nNetworkNewsWire (NNW)\nNew York, New York\nwww.NetworkNewsWire.com\n212.418.1217 Office\nEditor@NetworkNewsWire.com\nSource:SinglePoint, Inc.", "external_links": ["https://www.linkedin.com/company/singlepoint", "https://www.globenewswire.com/Tracker?data=4w0MIhoOuWiQvbz8hPxejHmPHwtknh8AFyfI0D9AnqozS9CghJe1e0Yj7C5FhbSHpJjIzAhGowWvBrXy9AhNK4nykENIKNggD3Y_uuSNNYc=", "https://www.globenewswire.com/Tracker?data=DqQkRcu99bHhapWPcrwDAa08wgGb9R44Ez_KFWvY-vzLoW32G_kyRhEX9OvTxpYowJVCX0AC08wD0uMuQs3YsLPNC-rbLTAfkHBfoGQ4RBaoI83U-IZEwVPgkSXnfL-hbRCrfkIVZGUQM5QeYMqktA==", "https://www.globenewswire.com/Tracker?data=DqQkRcu99bHhapWPcrwDAe5ruLFAgTwMP8-HVIjnzY3A0px-hlw6AG6yEV493l2b25E0Ii0P-gwxEWbKcuZsJ8vcAUVlnoAGn7b8mO-7yBt-xGaNb-SZT362o5l3yfYP", "https://www.facebook.com/SinglePointMobile", "https://www.globenewswire.com/Tracker?data=0G3cS87Jn2DmONv04RF5aMxw9N-Be_I9ZyL6q7P-o-bK2LVYIlexyOCyXkVDnGAUpsmO3dHQgtyDE6EvgXI1_-ZcCKAaGwTpon7FzM9HPOPA5wmupqEJm-vMXFAGDyGD", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ea494691-50f9-442e-90bc-3c84ca25ccce", "https://twitter.com/_SinglePoint_", "https://www.globenewswire.com/Tracker?data=uF0ELQDfj0HlwJ4mTKDsSV-eWUDHT4qfeUuFdV7Twv-pfySHj8zNLO4atArMtMEK4oU7WUa3UiIdi4k1vEsULA==", "https://www.globenewswire.com/Tracker?data=FK19ti16gICWfP-kv51otEvh3KCNvddKjrdcNouMk40vyt62-7UoOilDlxKL6dnPvu_CRS3od8dWGpyxRArd9PnaiIwcZ9aLMGkt0b6ZwCc=", "https://www.globenewswire.com/Tracker?data=FK19ti16gICWfP-kv51otFfBbOM06xZj4OPt5O9tkCmzW4MCoBDyDgj8oVVURUxhEGUlhPJqCc7PTyqSNa2SO5xQQ_j4Ndpbrg_VMDADMpk=", "https://www.globenewswire.com/Tracker?data=DqQkRcu99bHhapWPcrwDASNoudlL4GNGfx9m-GxRRagvQRufmyXR069-HQENyI7cRVZ3T3KAYdjnMf1VW_TBPnyiMnXtPJY1Cs7OboirZ1PLKE_cfnM99v9khynOrCHYIGtP59qm2UzyrOG7S_Pdmw=="], "published": "2018-01-23T15:30:00.000+02:00", "crawled": "2018-01-23T18:41:50.001+02:00", "highlightTitle": ""}