{"organizations": [], "uuid": "541829d654fd816a1640e0fbd8bd442f8473f07a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/europe-leveragedloans/lpc-european-leveraged-loan-market-starts-year-with-a-bang-idUSL8N1PE35P", "country": "US", "domain_rank": 408, "title": "LPC-European leveraged loan market starts year with a bang", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.653, "site_type": "news", "published": "2018-01-19T20:25:00.000+02:00", "replies_count": 0, "uuid": "541829d654fd816a1640e0fbd8bd442f8473f07a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-leveragedloans/lpc-european-leveraged-loan-market-starts-year-with-a-bang-idUSL8N1PE35P", "ord_in_thread": 0, "title": "LPC-European leveraged loan market starts year with a bang", "locations": [], "entities": {"persons": [{"name": "claire ruc", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Some €10bn of loans in syndication\n* Jumbo-sized financings are becoming more common\nBy Claire Ruckin\nLONDON, Jan 19 (Reuters) - Europe’s leveraged loan market has started with a bang with over €10bn of loans in syndication, prompting one of the busiest Januarys since the financial crisis in terms of new issue volume.\nThe market picked up where it left off at the end of last year, having digested a significant number of deals in the last quarter. Around 25 leveraged loans closed in December.\n“It seems unusual that the market has started off so early as it usually talks a good game but never quite delivers. This year however, it did,” a syndicate head said.\nJust five jumbo deals account for a majority of the volume this month, with the euro and sterling portions of these deals totalling €8.2bn-equivalent.\nJumbo loans, typically in excess of €1bn, were few and far between in Europe’s leveraged loan market post-financial crisis, but an increase in the depth of liquidity over the past year means jumbo loans are becoming more common.\nSome of the jumbos in syndication include French technology consultancy Altran’s €2.125bn-equivalent term loan backing its acquisition of US digital design and engineering services firm Aricent; a US$1bn euro and sterling-denominated carved out of a US$4bn term loan backing Britain’s Cineworld Group’s acquisition of US peer Regal Entertainment Group; and a €3.1bn-equivalent loan for UK petrol station operator EG Group.\n“Jumbos are more normal than in the past as the market seems to be maturing and keeping bigger deals in Europe than it has traditionally,“ a syndicate head said. ”European borrowers started going to the US market because they had no choice as they needed liquidity that Europe couldn’t provide. Now the amount that can be done in the European loan market has grown exponentially in the past year or so to around €2bn and its pushing the boundaries of what people thought was possible.”\nA number of sub-€1bn loans are also in syndication in Europe that collectively tally up to around €2.5bn-equivalent.\nThese include €650m of loans backing Dutch telecom infrastructure operator Delta’s combination with Dutch peer Caiway; €554m-equivalent for higher education provider Global University Systems; €405m backing alternative investment manager Citic Capital’s buyout of French packaging company Axilone; and €375m backing Ardian’s buyout of Spanish bakeries Berlys and Bellsola.\nDespite high volumes, all deals are expected to get through the market, given the high amounts of cash at play from existing CLOs, warehousing CLOs and managed accounts.\n“In terms of volume, because of deal sizes, it is one of the busiest Januarys since the financial crisis but it is not the busiest in terms of capacity as this can all get through the market. Cash positions are relatively high and the technicals are still there. It shows the strength and depth of the European loan market,” a second syndicate head said.\nDIFFERENT PRICING Even with the vast amount of liquidity at play, the market is pricing in risk to an extent and the deals are expected to price at different levels, although documentation is likely to remain weak after a significant erosion of investor protections in 2017.\nShort-term visibility looks good, as bankers prepare to launch in early February syndication of €5.65bn-equivalent of debt financing to back US private equity firm KKR’s €6.83bn acquisition of Unilever’s margarine and spreads business.\nThe debt financing is expected to include a €3.9bn-equivalent term loan - which will be mainly denominated in euros and will include some US dollars and Polish zlotys. Credit Suisse, Deutsche Bank and KKR Capital Markets are expected to lead the debt financing, alongside a number of other banks that could include BNP Paribas, ING, Lloyds, RBC and UniCredit.\nStill to come also is £2.35bn of new loans backing multinational sports betting and gaming group GVC Holdings’ up to £3.9bn acquisition of UK betting group Ladbrokes Coral.\nAlthough the pipeline post-February isn’t clear, there are a number of M&A situations in auction phase, which if sold to private equity will be welcomed by Europe’s leveraged loan market.\nJP Morgan and Morgan Stanley are providing a staple financing to potential buyers of French drug maker Sanofi’s European generic drug business Zentiva of around €1.2bn, or around 7.0 times its approximate €155m Ebitda.\nBanks are also preparing debt packages of up to US$825m to back a potential sale of the European rental assets of American hospitality company Wyndham Worldwide.\nAnd a final bid deadline of March 23 for the chemicals division of Akzo Nobel, the maker of Dulux paint, could provide the market with up to €6bn of debt financing in the second quarter.\nVolume looks set to remain positive for 2018, with growth expected overall. An increase in public-to-private situations and an influx of Double B credits in the loan space should also help facilitate this, people familiar with the situation said.\n“The pot of Double B money has grown in Europe. The average rating of deals is split between Double Bs and Single Bs now, whereas before the market was dominated by Single B issuance,” an investor said.\nThe amount borrowers can raise in Europe is also expected to grow in 2018, which should facilitate a busier market.\n“Europe will be able to raise €6bn-€7bn if tapping both the loan and bond markets on a financing,” a second investor said. (Editing by Christopher Mangham)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:25:00.000+02:00", "crawled": "2018-01-20T17:49:31.035+02:00", "highlightTitle": ""}