{"organizations": [], "uuid": "52d9cb6903547dc3bd6a844193efcc26ed9b6693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224224674&w=1200&r=LYNXMPEE0L1R9", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pakistan-primeminister/pakistani-pm-says-committed-to-seizing-islamist-charities-idINKBN1FB2FE", "country": "US", "domain_rank": 408, "title": "Pakistani PM says 'committed' to seizing Islamist charities", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:54:00.000+02:00", "replies_count": 0, "uuid": "52d9cb6903547dc3bd6a844193efcc26ed9b6693"}, "author": "", "url": "https://in.reuters.com/article/pakistan-primeminister/pakistani-pm-says-committed-to-seizing-islamist-charities-idINKBN1FB2FE", "ord_in_thread": 0, "title": "Pakistani PM says 'committed' to seizing Islamist charities", "locations": [], "entities": {"persons": [{"name": "shahid khaqan abbasi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "drazen jorgic", "sentiment": "none"}, {"name": "abbasi", "sentiment": "none"}, {"name": "kay johnson", "sentiment": "none"}, {"name": "hafiz saeed", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "jamaat-ud-dawa", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "falah-e-insaniat foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLAMABAD (Reuters) - Pakistani Prime Minister Shahid Khaqan Abbasi on Monday said his government will push ahead with plans to seize control of charities run by an Islamist designated a terrorist by Washington, and warned the United States not to weaken Pakistan.\nAbbasi brushed off U.S. President Donald Trump’s recent tweet accusing Pakistan of “lies and deception” in its commitment to fighting terrorism, as he raised the prospect of charging the United States to use Pakistan’s airspace to resupply NATO troops in Afghanistan.\nUnder pressure from the United States and international institutions to crack down on terrorist financing, Pakistan last month drew up secret plans for a “takeover” of charities linked to Islamist leader Hafiz Saeed, who Washington blames for the 2008 attacks in Mumbai that killed 166 people.\nThe United States has labelled the charities Jamaat-ud-Dawa (JuD) and the Falah-e-Insaniat Foundation (FIF) as “terrorist fronts” for Lashkar-e-Taiba (LET), or “Army of the Pure”, a group Saeed founded in 1987 and which Washington and India accuse of carrying out the Mumbai attacks.\nSaeed has repeatedly denied involvement in the Mumbai attacks and says the charitable organisations he founded and controls have no ties with militants.\nBut both he and the organisations have been sanctioned by the United Nations and his freedom in Pakistan, where he holds public rallies, has been a thorn in Islamabad’s relations with India and the United States.\n“Yes, the government will take over the charities which are sanctioned and not allowed to operate,” Abbasi, 59, told Reuters in an interview at the prime minister’s chamber in Pakistan’s Parliament in capital Islamabad.\nAnswering specific questions about the proposed takeover of JuD and FIF, Abbasi said the civilian government had the backing of the powerful military, which effectively controls Pakistan’s security and foreign policy.\n“Everybody is on board, everybody is on the same page, everybody is committed to implementation of U.N. sanctions,” he said.\nHe declined to set a deadline.\nJuD and FIF did not respond to Reuters requests for comment. The organisations have previously said they would take legal action if the government tried to take them over. Saeed could not be reached for comment.\nSELECTIVE ACTION There are concerns in Pakistan that the country may face financial sanctions over accusations of selective action against Islamist militant groups and financing.\nPakistan is a base for myriad Islamist movements, and critics accuse Islamabad of only targeting militants who attack the state while leaving unscathed those who target neighbouring Afghanistan and arch-foe India. Pakistan denies those allegations.\nAbbasi said Pakistan had made progress in curbing terrorist financing after meetings with the Financial Action Task Force (FATF), an international body that warned Islamabad could be put on a watchlist for not doing enough to stop the practice.\nPakistani Prime Minister Shahid Khaqan Abbasi listens during an interview with Reuters in Islamabad, Pakistan January 22, 2018. REUTERS/Caren Firouz “We’ve had several meetings on that, and from what I’ve seen a large part of those actions have been taken,” Abbasi said.\nA U.N. Security Council team is due to visit Pakistan this month to review progress against U.N.-designated “terrorist” groups, which includes LeT and others such as the Afghan Taliban-allied Haqqani network.\nFormer petroleum minister Abbasi said any sanctions against Pakistan would be counter-productive to the country’s own battle against Islamist militants, which he called “the largest war on terror in the world”.\n“Any constraints put on Pakistan, actually only serve to degrade our capability to fight the war against terror,” he said.\nTRUMP MEETING\nPakistani Prime Minister Shahid Khaqan Abbasi reacts during an interview with Reuters in Islamabad, Pakistan January 22, 2018. REUTERS/Caren Firouz Relations between the United States and its uneasy ally have frayed since Jan. 1, when Trump lashed out against what he called Pakistan’s “lies and deceit” over its alleged support of Afghan Taliban militants battling U.S. troops in Afghanistan. Washington has since suspended aid totalling about $2 billion.\nAbbasi said Trump’s tweet was “unacceptable” in its tone and that Pakistan should not be “scapegoated” for U.S. failures in Afghanistan.\n“That is something ... we cannot accept because nobody’s suffered more than Pakistan,” Abbasi said, adding that tens of thousands of Pakistani have died from militancy that has inflicted damage worth $120 billion to the economy.\nU.S. officials last year warned of tougher measures against Pakistan, including potentially withdrawing its “non-Nato ally” status or even designating it a state sponsor of terrorism.\nAbbasi said much of the suspended aid was from the Coalition Support Fund (CSF), a U.S. Defence Department programme to reimburse allies for the costs of supporting counter-terrorist and counter-insurgency operations.\nHe said the U.S. needed to respect Pakistan’s contribution to the fight against Islamist militancy and raised the prospect of charging Washington for air transport flights that have been resupplying U.S.-led troops and Afghan forces in landlocked Afghanistan.\n“If somebody wants to start quantifying expenses and aid, I think let’s put this on the table also. Let’s discuss that,” Abbasi said, though he added that such talk was “hypothetical”.\nAbbasi dismissed media reports that Islamabad has ended intelligence sharing with the U.S. military as false.\nAnd he also spoke fondly about a brief discussion he had with Trump in September at a reception at the U.N General Assembly in New York.\n“I found him to be fairly warm,” he said. “Somebody that you would like to engage with and talk to.”\nAdditional reporting by Asif Shahzad; Writing by Drazen Jorgic; Editing by Kay Johnson and Alex Richardson\n ", "external_links": [], "published": "2018-01-22T19:54:00.000+02:00", "crawled": "2018-01-22T20:21:26.036+02:00", "highlightTitle": ""}