{"organizations": [], "uuid": "f6fc644ddc02fb37ea6745bbe99010b55a042ae2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-enterprise-prodt-results/enterprise-products-eyes-expansion-of-midland-to-sealy-crude-pipeline-idUSKBN1FK2KO", "country": "US", "domain_rank": 408, "title": "Enterprise Products eyes expansion of Midland-to-Sealy crude pipeline", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:20:00.000+02:00", "replies_count": 0, "uuid": "f6fc644ddc02fb37ea6745bbe99010b55a042ae2"}, "author": "", "url": "https://www.reuters.com/article/us-enterprise-prodt-results/enterprise-products-eyes-expansion-of-midland-to-sealy-crude-pipeline-idUSKBN1FK2KO", "ord_in_thread": 0, "title": "Enterprise Products eyes expansion of Midland-to-Sealy crude pipeline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON (Reuters) - Enterprise Products Partners LP ( EPD.N ) said on Wednesday it could expand capacity on its Midland-to-Sealy crude oil pipeline by more than 20 percent to help transport even more oil from the Permian Basin of West Texas and New Mexico, the largest U.S. oilfield.\nThe expansion comes as Exxon Mobil Corp ( XOM.N ) and others map out aggressive growth for Permian operations, fueling a rising need for transport to refining and export facilities near the U.S. Gulf Coast.\nCrude flows on the line averaged 330,000 bpd after the pipeline came online in November. Flows are expected to hit 450,000 bpd as soon as April once the line is fully operational, Enterprise executives said on an earnings conference call on Wednesday.\nPreparations are under way to potentially further boost capacity on the line by installing pumps and drag reducing agents, chemicals added to pipelines to improve the flow of liquids, according to Enterprise’s Graham Bacon.\n“Right now we’ve got the capacity to go in the 540,000 bpd to 550,000 bpd range. There’s a few other studies that we can do to tweak it that we might be able to get slightly higher than that, but we haven’t completed those yet. Those are under way,” he said.\nEnterprise said separately it signed a 50/50 joint venture with Navigator Holdings Ltd ( NVGS.N ) to build a new 1 million-ton-per-year ethylene export facility on the U.S. Gulf Coast. The facility is expected to open by 2020.\nEnterprise is also developing a high-capacity ethylene salt dome storage facility at its complex in Mont Belvieu. The facility will be able to store 600 million pounds.\nEnterprise is also building an ethylene pipeline from Mont Belvieu to Bayport, Texas, which is scheduled to begin service in 2020.\nShares of Enterprise fell about 1 percent to $50.05 in midday trading.\nReporting by Bryan Sims in Houston; Editing by Ernest Scheyder and Frances Kerry\n ", "external_links": [], "published": "2018-01-31T19:20:00.000+02:00", "crawled": "2018-01-31T19:42:23.002+02:00", "highlightTitle": ""}