{"organizations": [], "uuid": "56f28777a5870c14abc5643afcdca84d0e016e8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC570_38Rgj_TOP_20180122112613.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/high-prices-wont-deter-biotech-deals-1516638872", "country": "US", "domain_rank": 387, "title": "High Prices Won’t Deter Biotech Deals", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:34:00.000+02:00", "replies_count": 0, "uuid": "56f28777a5870c14abc5643afcdca84d0e016e8d"}, "author": "Charley Grant", "url": "https://www.wsj.com/articles/high-prices-wont-deter-biotech-deals-1516638872", "ord_in_thread": 0, "title": "High Prices Won’t Deter Biotech Deals", "locations": [], "entities": {"persons": [{"name": "bioverativ", "sentiment": "none"}, {"name": "juno", "sentiment": "none"}], "locations": [], "organizations": [{"name": "celgene", "sentiment": "none"}, {"name": "celgene celg", "sentiment": "none"}, {"name": "biogen", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "sanofi sny", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "sanofi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS The pharmaceuticals industry has entered another deal frenzy. Eye-popping price tags reflect financial pressure favoring consolidation rather than a bout of madness.\nCelgene CELG -0.13% announced it plans to acquire cancer specialist Juno Therapeutics JUNO 26.71% for $9 billion, at a roughly 90% premium to Juno’s stock price before The Wall Street Journal reported a deal was close last week. Not to be outdone , Sanofi SNY -3.36% said Monday it would acquire hemophilia specialist Bioverativ for more than $11.5 billion, or $105 a share. Bioverativ, which spun off from Biogen just last January, traded at $47.50 a share after the spin and closed last week at $64.11.\nThose big price tags were a reason both Celgene and Sanofi shares traded lower in the wake of the announcement. Sanofi is paying more than eight times this year’s projected revenue for Bioverativ, according to FactSet. Celgene said the acquisition of Juno doesn’t change the company’s closely watched sales and profit guidance for 2020. Increasing competition in both cancer and hemophilia, coupled with those high price tags, means there is a real risk that both acquisitions will fail to generate good returns.\nBut the nature of the drug business means these risks are necessary ones for buyers to take. It isn’t uncommon for large biotech and pharma companies to derive the majority of their sales and profits from one drug. Industry realities, like expiring intellectual property and the fast pace of scientific innovation, mean that companies regularly have large revenue holes to fill. Meanwhile, very few experimental drugs under development have true commercial potential, which creates scarcity. The financial firepower is there as big pharma balance sheets are strong enough to support regular deals at high prices.\nThese dynamics create opportunities and risks for investors. Acquisitions of clinical-stage assets perceived to have scarcity value are bound to continue , which should support biotech valuations across the sector. Large drug companies may struggle to justify past deals on their financial merits, but it won’t slow future acquisitions.\nAn index of small and midsize biotech stocks rocketed more than 3% higher early Monday. It is still a seller’s market.\nWrite to Charley Grant at charles.grant@wsj.com", "external_links": [], "published": "2018-01-22T18:34:00.000+02:00", "crawled": "2018-01-22T21:19:11.003+02:00", "highlightTitle": ""}