{"organizations": [], "uuid": "d0a3405fa3701707c59b27d8842671a3af6bea8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-crisis-syria-israel/syrian-army-says-israel-fired-at-syria-with-jets-missiles-idINKBN1EY0LL", "country": "US", "domain_rank": 408, "title": "Syrian army says Israel fired at Syria with jets, missiles", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:09:00.000+02:00", "replies_count": 0, "uuid": "d0a3405fa3701707c59b27d8842671a3af6bea8f"}, "author": "", "url": "https://in.reuters.com/article/mideast-crisis-syria-israel/syrian-army-says-israel-fired-at-syria-with-jets-missiles-idINKBN1EY0LL", "ord_in_thread": 0, "title": "Syrian army says Israel fired at Syria with jets, missiles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:11 AM / Updated 2 hours ago Syria says Israel hits its territory with jets, missiles Reuters Staff 3 Min Read \nBEIRUT (Reuters) - Israeli jets and ground-to-ground missiles struck Syria early on Tuesday, Syria’s army said, as Israeli Prime Minister Benjamin Netanyahu reiterated he would do what was needed to stop Hezbollah gaining “game-changing” Iranian weapons. \nThe Syrian army said in a statement carried by state television that Israeli jets fired missiles at the al-Qutaifa area near Damascus from inside Lebanese airspace at 2:40 a.m. (0040 GMT) and Syrian air defences hit one of the planes. \nIsrael then fired rockets from the Israeli-occupied Golan Heights, but the Syrian defences brought them down, the army said, adding that Israeli jets fired a final barrage of four rockets from inside Israel, one of which was intercepted by Syrian air defences while the others caused material damage. \nIsrael has pledged to prevent Syrian territory being used for Iran to set up bases or transfer high-quality weaponry to Lebanon’s Hezbollah group, which has been helping Damascus beat back a six-year-old rebellion. \nThe Israeli military declined to comment. Although the Israeli air force chief last August disclosed that his corps had struck in Syria around 100 times, Israel’s policy is generally not to confirm or deny such operations. \nIsraeli Prime Minister Benjamin Netanyahu said in answer to a reporter’s question about the strikes that Israel’s policy was to stop Hezbollah moving “game-changing weapons” out of Syria. \n“We back it up as necessary with action,” he said, without explicitly confirming Israel carried out Tuesday’s strikes. \nIn its statement, the Syrian army repeated previous warnings of serious repercussions for the strikes and repeated its past accusation that Israel was using attacks to support militant groups in Syria. \nA European diplomat speaking earlier this week said there was an understanding between the United States and Russia that Hezbollah and other foreign fighters would be removed from the area in Syria close to the Israeli border. \n“I don’t think that has happened very much up till now and that is a source of concern,” the diplomat said. Reporting By Angus McDowall; Additional reporting by Dan Williams in Jerusalem and Dominic Evans in Istanbul; Editing by Paul Tait and Robin Pomeroy", "external_links": [], "published": "2018-01-09T09:09:00.000+02:00", "crawled": "2018-01-09T09:47:35.278+02:00", "highlightTitle": ""}