{"organizations": [], "uuid": "7602a45aaba926233de50f0bc9bfb546abf8d1f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/23/103965422-GettyImages-170294330.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/strapped-families-hope-trumps-speech-will-tackle-student-loans.html", "country": "US", "domain_rank": 767, "title": "Strapped families hope Trump's speech will tackle student loans", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-30T18:34:00.000+02:00", "replies_count": 0, "uuid": "7602a45aaba926233de50f0bc9bfb546abf8d1f2"}, "author": "Jessica Dickler", "url": "https://www.cnbc.com/2018/01/30/strapped-families-hope-trumps-speech-will-tackle-student-loans.html", "ord_in_thread": 0, "title": "Strapped families hope Trump's speech will tackle student loans", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "stafford", "sentiment": "none"}], "organizations": [{"name": "college board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump is widely expected to hit on the economy, immigration and infrastructure in his first State of the Union speech on Tuesday. One issue that seems to be on the back burner is the ever-increasing cost of college.\nA college degree is now the second-largest expense an individual is likely to make in a lifetime — right after purchasing a home.\nTuition has historically risen about 3 percent to 5 percent a year, according to the College Board . During the recession, declining public funds caused tuition to spike. At private four-year schools, average tuition and fees rose 54 percent in the last decade. Tuition plus fees at four-year public schools, which were harder hit, jumped 71 percent over the same time period.\nFamilies with students in four-year private colleges spent almost $47,000 in 2017-18, up 3.5 percent from the year earlier. At in-state, four-year public colleges, it was more than $20,000, according to the College Board .\nAs a result, families are relying on loans and aid more than ever before to make a degree more affordable . Ninety-eight percent of college applicants and their parents said financial aid would be necessary to pay for college, according to The Princeton Review's 2017 College Hopes & Worries survey .\n\"These worries are understandable and they can be exasperated if the current administration moves to cut back on the student loan forgiveness program and any other federal support including Pell grants and subsidized loans for low-income students,\" said Robert Franek, The Princeton Review's editor-in-chief.\nIn the past, Trump has called for shortening the federal student loan forgiveness period (while increasing the monthly payments) and eliminating the Public Service Loan Forgiveness Program completely for borrowers who take out loans after July 1, 2018.\nThe president has also advocated for reeling in subsidized Stafford loans and promoted alternatives to college altogether, including career and technical training and, of course, apprenticeships.\n\"I applaud the idea of giving students more options but not at the sake of taking dollars away from students who want to go to school,\" Franek said.\nCurrently, about two-thirds of all full-time students receive some kind of support . Aid such as the income-based federal Pell grants covered 35 percent of college costs in 2016-17, up from the previous school year, according to a recent report by education lender Sallie Mae. Borrowing covered 27 percent of college costs, also higher than the year before.\nThe educational system is due for an overhaul, particularly when it comes to pricing, said Miranda Marquit, the senior policy writer at Student Loan Hero, a website for managing debt.\n\"But simply, getting up there and saying 'hey we need to promote these programs' is not going to change the system — especially if there is no substantive policy approach.\"\nThe top 10 colleges for financial aid\nTricks to pick a college that won't break the bank\nHey grads, it's time to start repaying that college debt", "external_links": [], "published": "2018-01-30T18:34:00.000+02:00", "crawled": "2018-01-30T18:34:01.011+02:00", "highlightTitle": ""}