{"organizations": [], "uuid": "f9eb5bed6c617f6ca5e4d2bb547d5551460c0b92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/bundesbank-reserves-yuan/update-1-bundesbank-looking-to-place-some-reserves-into-chinese-yuan-idUSL8N1PA2WV", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Bundesbank looking to place some reserves into Chinese yuan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T14:38:00.000+02:00", "replies_count": 0, "uuid": "f9eb5bed6c617f6ca5e4d2bb547d5551460c0b92"}, "author": "", "url": "https://www.reuters.com/article/bundesbank-reserves-yuan/update-1-bundesbank-looking-to-place-some-reserves-into-chinese-yuan-idUSL8N1PA2WV", "ord_in_thread": 0, "title": "UPDATE 1-Bundesbank looking to place some reserves into Chinese yuan", "locations": [], "entities": {"persons": [{"name": "wuermeling", "sentiment": "none"}, {"name": "joachim wuermeling", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bundesbank", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:41 PM / Updated an hour ago UPDATE 1-Bundesbank looking to place some reserves into Chinese yuan Reuters Staff 3 Min Read \n(Adds detail) \nFRANKFURT, Jan 15 (Reuters) - Germany’s central bank is looking to place some of its currency reserves into yuan given the Chinese currency’s increased global role, although further preparatory work would be required to make a transaction, the Bundesbank said on Monday. \n“The decision to accept the yuan is part of a long-term strategy of diversification and reflects the increased role of the Chinese currency in the global financial system,” Bundesbank board member Joachim Wuermeling said in a statement. \n“We are looking to invest in other currencies as well,” Wuermeling added. \nThe yuan leapt to its strongest level in more than two years against the dollar on Monday, buoyed by the Bundesbank’s decision. \nThe Bundesbank agreed to invest in yuan, also known as renminbi, last summer, when the European Central Bank converted 500 million euros worth of its U.S. dollar reserves into the Chinese currency. \nWhile some Asian central banks have indicated their desire to include the yuan in their reserves, the Bundesbank would be among the first major central banks outside the region to make such a move. \nBut a transaction is seen as logical as Germany’s export focused economy has extensive trade ties with China. \nThe role of the yuan has increased steadily since the International Monetary Fund included the currency in its Special Drawing Right basket from late 2016. \nThe SDR basket, the Fund’s own international reserve asset, also includes the dollar, the euro, the Japanese yen and the British pound. \nSince the Chinese currency entered the SDR basket, a quarterly IMF report on the composition of the foreign exchange reserves held by global central banks has shown a small but steady increase in allocation towards the yuan. \nIn the latest report for the period to the end of September 2017, global central banks allocated the equivalent of $107 billion towards the Chinese currency in their reserves, a 19 percent increase from a year earlier. (Reporting by Frank Siebelt; Writing by Balazs Koranyi; Editing by Francesco Canepa and Toby Chopra)", "external_links": [], "published": "2018-01-15T14:38:00.000+02:00", "crawled": "2018-01-15T15:29:43.000+02:00", "highlightTitle": ""}