{"organizations": [], "uuid": "45bf54ed4e354b2179853380615b6a75533428c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226316853&w=1200&r=LYNXMPEE0S125", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-colombia-rebels/colombias-eln-rebels-responsible-for-bomb-attacks-on-police-defence-minister-idUKKBN1FI1RE", "country": "US", "domain_rank": 408, "title": "Colombia's ELN rebels responsible for bomb attacks on police - defence minister", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:17:00.000+02:00", "replies_count": 0, "uuid": "45bf54ed4e354b2179853380615b6a75533428c2"}, "author": "", "url": "https://uk.reuters.com/article/uk-colombia-rebels/colombias-eln-rebels-responsible-for-bomb-attacks-on-police-defence-minister-idUKKBN1FI1RE", "ord_in_thread": 0, "title": "Colombia's ELN rebels responsible for bomb attacks on police - defence minister", "locations": [], "entities": {"persons": [{"name": "luis carlos villegas", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "soledad", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "barranquilla", "sentiment": "none"}], "organizations": [{"name": "eln", "sentiment": "negative"}, {"name": "caracol radio", "sentiment": "none"}, {"name": "national liberation army", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 18 PM / Updated 27 minutes ago Colombia's ELN rebels responsible for bomb attacks on police - defence minister   \nBOGOTA (Reuters) - Colombia’s ELN rebels are responsible for three bomb attacks against police stations that killed seven and wounded dozens more over the weekend, the nation’s defence minister said on Monday, as the government weighs the future of peace talks with the group. \nFive police officers were killed and more than 40 wounded in a bombing in the port city of Barranquilla on Saturday morning. \nTwo more officers died, and one was wounded just before midnight on Saturday in the rural Bolivar province, and the third attack took place about four hours later in the city of Soledad, injuring five police and one civilian. \n“The authorship of these terrible actions is on the head of the National Liberation Army,” Defense Minister Luis Carlos Villegas told local Caracol Radio, adding that the violence raised the question of whether the group wants peace. A police officer collects evidence near the site of a bomb attack at a police station in Barranquilla, Colombia January 28, 2018. REUTERS/Benjamin Beleno \nThe ELN and the government have been in formal peace talks for nearly a year, and the two sides agreed to their first-ever ceasefire in October. However, the guerrillas launched a new offensive when the ceasefire expired this month, killing security force members, bombing major oil pipelines and kidnapping an oil contractor. \nIn a statement on its main website on Monday, the ELN said it would support a new ceasefire but that attacks would continue in the absence of one. \nPresident Juan Manuel Santos, who said the government would not rest until the perpetrators of the bombings were found, will speak about the future of the talks later on Monday, Villegas said. Santos had recalled the government’s negotiator at the Quito talks after the renewed offensive this month. \nA man arrested after the first bombing in Barranquilla had been detained in 2015 in connection with an ELN cell, Villegas said, and the group was also responsible for a police station bombing in Ecuador on Saturday. No one was killed in that attack. \nThe urban front of the ELN put out a statement over the weekend claiming responsibility for the Barranquilla bombing, but others inside the organization said on Sunday they could not verify its authenticity. Reporting by Julia Symmes Cobb; Editing by Lisa Von Ahn", "external_links": [], "published": "2018-01-29T16:17:00.000+02:00", "crawled": "2018-01-29T16:55:28.020+02:00", "highlightTitle": ""}