{"organizations": [], "uuid": "e7e1dff2b906680499dba502aca6e0e86a067ba2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/us", "section_title": "US Stock Market News - Dow Jones, Nasdaq, S&amp;P 500 | Reuters.com", "url": "https://www.reuters.com/article/cme-group-trades-agriculture/rpt-update-1-cme-group-expands-private-trades-in-grain-markets-raising-worries-idUSL1N1P01SZ", "country": "US", "domain_rank": 408, "title": "RPT-UPDATE 1-CME Group expands private trades in grain markets, raising worries", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.035, "site_type": "news", "published": "2018-01-08T20:00:00.000+02:00", "replies_count": 0, "uuid": "e7e1dff2b906680499dba502aca6e0e86a067ba2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/cme-group-trades-agriculture/rpt-update-1-cme-group-expands-private-trades-in-grain-markets-raising-worries-idUSL1N1P01SZ", "ord_in_thread": 0, "title": "RPT-UPDATE 1-CME Group expands private trades in grain markets, raising worries", "locations": [], "entities": {"persons": [{"name": "tom polansek", "sentiment": "negative"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "black sea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cargill", "sentiment": "negative"}, {"name": "cme group inc", "sentiment": "negative"}, {"name": "cme group", "sentiment": "none"}, {"name": "chicago mercantile exchange", "sentiment": "none"}, {"name": "chicago board of trade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Cargill comment)\nBy Tom Polansek\nCHICAGO, Jan 5 (Reuters) - Exchange-operator CME Group Inc will allow a type of privately negotiated transaction in all its agricultural markets for the first time on Monday, splitting traders who predict the move will either improve or hurt transparency.\nThe company, which owns the Chicago Board of Trade (CBOT) and Chicago Mercantile Exchange, will expand the use of transactions called block trades in its grain and livestock futures and options, such as corn. It already permits the trades in other markets ranging from Black Sea wheat to Eurodollars.\nBlock trades are large, privately negotiated deals struck away from the broader market by phone or otherwise and cleared by the exchange. They must exceed exchange-set size limits and be reported publicly after completion.\nThe transactions help traders execute large-lot orders at a “fair and reasonable” single price and avoid disrupting prices in markets with lower liquidity, such as deferred-contract months, according to CME Group.\nThe company has lost liquidity in deferred futures spreads as the rise of computerized algorithmic trading has driven activity to front-month contracts, said Gary Sandlund, president of brokerage Futures International.\n“The exchange is doing a very good thing here in attempting to try to bring that back into the exchange and create a bit more transparency on some of these back-end spreads,” he said.\nBlock trading is the latest evolution of the agricultural markets, which trace their origins to grain merchants who formed the CBOT in 1848. The closure of open-outcry futures pits, in which traders shouted out orders to buy and sell, marked the end of an era in 2015, after most transactions went online.\nCME Group talked with agricultural traders to gauge support for block trades, the company said in a letter to the U.S. Commodity Futures Trading Commission. The transactions should account for a small percentage of overall trading and not reduce liquidity, it said.\nCargill Inc, a major U.S. grain trader, told Reuters it will evaluate block trades for its business.\n“We are encouraged that the exchange continues to look for ways the commercial trade can manage price risk exposures further out the curve,” spokeswoman Antonella Bellman said.\nHowever, the National Grain and Feed Association, a trade group, told CME Group and the CFTC in letters that the change threatens transparency by removing business from the public marketplace.\n“It is our opinion that when large trades in deferred months are negotiated between parties ‘off exchange’ that price discovery is very likely compromised,” the association said.\nReporting by Tom Polansek; Editing by Leslie Adler\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T20:00:00.000+02:00", "crawled": "2018-01-08T14:05:58.016+02:00", "highlightTitle": ""}