{"organizations": [], "uuid": "a4fef1e9ff2c81622a6858d68123e6f9497331e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222214301&w=1200&r=LYNXMPEE0E1CB", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-trade-nafta-autos/game-of-chicken-gm-bets-on-mexican-made-pickup-trucks-idUKKBN1F42GX", "country": "US", "domain_rank": 408, "title": "Game of chicken - GM bets on Mexican-made pickup trucks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T21:02:00.000+02:00", "replies_count": 0, "uuid": "a4fef1e9ff2c81622a6858d68123e6f9497331e3"}, "author": "", "url": "https://uk.reuters.com/article/uk-trade-nafta-autos/game-of-chicken-gm-bets-on-mexican-made-pickup-trucks-idUKKBN1F42GX", "ord_in_thread": 0, "title": "Game of chicken - GM bets on Mexican-made pickup trucks", "locations": [], "entities": {"persons": [{"name": "anthony espo", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "silao", "sentiment": "none"}, {"name": "silao", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "guanajuato", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "chevrolet silverado", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 55 PM / Updated 22 minutes ago Game of chicken - GM bets on Mexican-made pickup trucks Anthony Esposito , Joseph White 6 Min Read \nSILAO, Mexico/DETROIT (Reuters) - General Motors Co’s ( GM.N ) assembly plant in Silao, a city in Mexico’s automotive heartland, cranked out more than 400,000 highly profitable, large pickup trucks last year, and is critical to the launch of a new generation of Chevrolet Silverado trucks later this year. FILE PHOTO - A view of the plant of General Motors in Silao, in Guanajuato state, Mexico, November 9, 2017. REUTERS/Edgard Garrido \nNow, GM’s Silao factory, and the profit it generates, are at risk. \nIf U.S. President Donald Trump follows up on threats to dump the North American Free Trade Agreement, pickup trucks built at Silao and shipped to the United States could be hit with a 25 percent tariff, known in the auto industry as the “chicken tax.” \nThe truck tariff’s origins go back to a 1960s trade spat between the United States and Germany over exports of U.S.-grown chickens. It protected profit for Detroit’s automakers long after its origins faded from memory. Now, the chicken tax could ruffle the feathers of GM’s pickup-truck profitability. It could also potentially jeopardise thousands of jobs on both sides of the border and billions of dollars in investment for automakers. \nGM in recent weeks inaugurated a new production line for a 10-speed transmission in the central Mexican city of Silao, and late last year began hiring 600 new staff there, sources said, effectively doubling down on one of the most lucrative offshore production categories for U.S. auto companies. \nPeople familiar with GM’s plans told Reuters the company will shift production of a small number of heavy-duty versions of the next-generation Silverado and Sierra to a plant in Flint, Michigan. \nGM Chief Executive Mary Barra did not directly answer when asked on Saturday if the company is considering pulling pickup truck production out of Mexico. “We’re going to continue to work constructively to get a modernized NAFTA agreement,” she said. \nLast week, Fiat Chrysler Automobiles NV ( FCAU.N ) ( FCHA.MI ) said it will move production of heavy-duty Ram pickups out of Mexico to Michigan by 2020. \nAt an event on Saturday to promote the 2019 Silverado, GM executives said Mexico is an important part of the automaker’s manufacturing “footprint” in North America. \n“The truck we build in Mexico, the engines come from the U.S.,” GM North America chief Alan Batey told reporters. “Everything is interlinked.” A FAILED NAFTA IS A LOSE-LOSE \nNAFTA has helped transform Guanajuato state, where Silao is located, since the trade pact was signed in 1994 with some $18 billion in investments in the auto sector. Silao’s industrial park bustles with workers at the dozens of sparkling new offices of automakers, suppliers and service providers from an array of countries, including Japan, Germany, the United States and Mexico. \nNearly 200,000 direct and indirect jobs depend on the automotive sector in Guanajuato. An estimated 46 percent of Mexico’s pickup trucks are produced in the region. \nGM’s Silao manufacturing complex is part of a web of factories owned by GM and its suppliers that stretches across Canada, the United States and Mexico. It is one of three main assembly plants for the next generation of GM’s large pickups and sport utility vehicles, including plants in Fort Wayne, Indiana, and Flint, Michigan. Slideshow (10 Images) \nEngines for trucks made in Silao come from GM factories in Flint; Spring Hill, Tennessee; and Tonawanda, New York. U.S. factories supply fuel systems and other components. In total, GM said it has more than 5,000 employees in U.S. plants with jobs tied to production in Silao. \nIn North America, GM’s operations are primarily in the United States. It has four manufacturing plants in Mexico, and 40 in the United States. \nThe automaker’s plans to build the next generation of Silverado pickups and related components in Mexico are too far along to reverse course in the near term without losing money, experts and company officials said. \nGM’s global purchasing chief, Steve Kiefer, told Reuters that suppliers for the pickup truck programme have also made investments based on production that crosses the U.S-Mexico border. \n“The installed capacity is such that it would be prohibitive to make huge changes to this,” Kiefer said. \nU.S., Canadian and Mexican officials are scheduled to meet in Montreal from Jan. 23 to 28 for the sixth and penultimate round of talks to update NAFTA. \n“Surely the (NAFTA) negotiations will be positive. We don’t believe this will lead to a destructive situation because it would be a lose-lose,” said Alfredo Arzola, head of Guanajuato’s automotive cluster. \nDuring the first 10 months of 2017 GM, Fiat Chrysler, Nissan Motor Co Ltd ( 7201.T ) and Toyota Motor Corp ( 7203.T ) exported nearly 700,000 pickup trucks from Mexico, mostly to the United States, according to data from the Mexican Auto Industry Association (AMIA). \nGM executives emphasized that 80 percent of the pickups it sells in the United States are U.S.-made. FLEXIBLE \nIn the event of a NAFTA collapse carmakers could eventually switch out production of pickup trucks to the United States and bring compact car and sport utility vehicle production to Mexico, experts and industry officials said. \n“GM has certain flexibility ... to go back and only produce SUVs like the Suburban,” said a Mexican official. \nUnder that scenario Mexican exports of SUVs to the United States would avoid the steep chicken tax and would be subject to a tariff of only 2.5 percent, barring an agreement to a different levy. \nFiat Chrysler said it will use the Mexican plant that now builds pickups to assemble a commercial vehicle aimed at global markets, taking advantage of Mexican free trade deals. Reporting by Anthony Esposito in Silao and Joe White in Detroit; Additional reporting by Dave Graham in Mexico City; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-15T21:02:00.000+02:00", "crawled": "2018-01-15T21:32:38.047+02:00", "highlightTitle": ""}