{"organizations": [], "uuid": "9d5d4ecc9d88d10185d5191884e35f20f50c9963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-3-clock-running-out-to-avert-u-s-government-shutdown-as-trump-blames-democrats.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Clock running out to avert U.S. government shutdown as Trump blames Democrats", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:17:00.000+02:00", "replies_count": 0, "uuid": "9d5d4ecc9d88d10185d5191884e35f20f50c9963"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-3-clock-running-out-to-avert-u-s-government-shutdown-as-trump-blames-democrats.html", "ord_in_thread": 0, "title": "UPDATE 3-Clock running out to avert U.S. government shutdown as Trump blames Democrats", "locations": [], "entities": {"persons": [{"name": "mulvaney", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "marc short", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "octob", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats@ (Adds market reaction in paragraph 4, Mulvaney, Short comments Republican senator's statement paragraph 11, White House briefing paragraph 13)\nWASHINGTON, Jan 19 (Reuters) - President Donald Trump postponed plans to leave Washington on Friday while the U.S. Congress faced a midnight deadline to come up with funding legislation to avoid federal agency shutdowns.\nAlthough the House of Representatives voted 230-197 on Thursday night for a bill to extend expiring funding through Feb. 16, the measure appeared to be on the verge of collapse in the Senate.\nWhite House budget director Mick Mulvaney said that on Thursday he was ratcheting up the likelihood of a shutdown from 30 percent to a 50-50 possibility.\n\"The vote this afternoon looks challenging for us to keep the government open,\" Trump's legislative liaison, Marc Short, told Fox News. He expected negotiations to continue up until midnight.\nShort and Mulvaney planned to brief the media Friday morning on plans for any possible shutdown.\nThe Senate was to reconvene later Friday morning. Congress has been struggling since October to resolve the issue and the current bill is endangered because of the deep rift between Republicans and Democrats on immigration issues that have found their way into the funding fight.\nMarkets were keenly focused Friday morning on the budget woes. The U.S. dollar moving to a near three-year low while Wall Street largely played down any fears of the looming possible shutdown and opened higher.\nThe government currently is being funded by a third temporary measure since the new fiscal year began in October.\nTrump, who was scheduled to leave for his Florida resort in the afternoon, will remain in Washington until Congress passes legislation to avert a shutdown, White House officials said.\n\"The trip is on ice. If there is a shutdown he won't go,\" one official said on condition of anonymity.\nIn a morning tweet, Trump accused Democrats of holding up the measure over immigration.\n\"Democrats are needed if it is to pass in the Senate - but they want illegal immigration and weak borders. Shutdown coming?\" he said.\nRepublicans control the Senate but with Senator John McCain undergoing cancer treatment at home in Arizona, they will need at least 10 Democrats to reach the 60 votes required to pass a spending bill. In addition to strong Democratic opposition, at least three Republican senators have said they will not back the continuing resolution in its current form.\nRepublican Senator Mike Rounds, who had earlier said he could not back the bill in current form, on Friday said in a statement that while the measure was \"not ideal,\" he would support it after being assured that other legislation to adequately fund the U.S. military would be raised soon.\nDemocratic Senator Joe Manchin of West Virginia has indicated he was leaning in favor of the stopgap measure. Manchin is one of 10 Democrats up for re-election this year in states Trump won in the 2016 presidential election.\nWhen the government shuts down, which has only happened three times in a meaningful way since 1995, hundreds of thousands of \"non-essential\" federal workers may be put on furlough, while \"essential\" employees, dealing with public safety and national security, would keep working.\nSHORT-TERM FUNDING\nNearly four months into the 2018 fiscal year, the two parties still have not agreed on top-line spending for defense and non-defense programs, rendering impossible the passage of a long-term government funding bill. Instead, Congress has been struggling to pass its fourth short-term appropriations measure.\nAmid the deadlock, more senators were raising the possibility of merely approving enough new federal funds for a few days. The idea is to put pressure on negotiators to then cut deals on immigration, defense spending and non-defense funding by next week.\nThe immigration fight is over Democrats' demand that 700,000 young undocumented immigrants be protected from deportation.\nGiven temporary legal status under a program started by former President Barack Obama, these \"Dreamers,\" as they are called, were brought into the United States, largely from Mexico and Central America, as children. Many have been educated in the United States and know no other country.\nIn September, Trump announced he was ending the program and giving Congress until March 5 to come up with a legislative replacement.\nSince then, however, the president has engaged in a series of spats with Congress. Trump and conservatives in Congress have used the Dreamer fight to try and win tough new immigration controls, including the president's promised border wall.\nLate on Thursday, Democratic Senator Dick Durbin, who is leading the fight for the Dreamers, told reporters there had been some signs earlier in the day that talks with Republicans were taking a positive turn and a deal could be within reach.\nBut in a late-night speech on the Senate floor, Republican Majority Leader Mitch McConnell accused Democrats of aiming to \"hold the entire country hostage\" by demanding immediate resolution of a \"non-imminent problem\" related to immigration.\nMcConnell continued to push for passage of the bill approved by the House so that a government shutdown could be avoided. (Reporting by Richard Cowan and Amanda Becker; Additional reporting by Roberta Rampton, Steve Holland; Editing by Chizu Nomiyama and Bill Trott)", "external_links": [], "published": "2018-01-19T17:17:00.000+02:00", "crawled": "2018-01-20T00:25:26.000+02:00", "highlightTitle": ""}