{"organizations": [], "uuid": "c03e4d2cdc2e5ed0ac5f605b9352a62425bdec54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222193039&w=1200&r=LYNXMPEE0E17O", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-italy-election-league/northern-league-leader-says-italian-society-threatened-by-islam-idUKKBN1F428J", "country": "US", "domain_rank": 408, "title": "Northern League leader says Italian society threatened by Islam", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:08:00.000+02:00", "replies_count": 0, "uuid": "c03e4d2cdc2e5ed0ac5f605b9352a62425bdec54"}, "author": "", "url": "https://uk.reuters.com/article/uk-italy-election-league/northern-league-leader-says-italian-society-threatened-by-islam-idUKKBN1F428J", "ord_in_thread": 0, "title": "Northern League leader says Italian society threatened by Islam", "locations": [], "entities": {"persons": [{"name": "matteo salvini", "sentiment": "none"}, {"name": "silvio berlusconi", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "northern league", "sentiment": "negative"}, {"name": "min read  rome", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "islam crispian balmer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 5:10 PM / Updated 2 hours ago Northern League leader says Italian society threatened by Islam Crispian Balmer 3 Min Read \nROME (Reuters) - Italian culture and society risk being eradicated by Islam, Northern League leader Matteo Salvini, an ally of former prime minister Silvio Berlusconi, said on Monday as he vowed to halt a migrant “invasion”. FILE PHOTO: Northern League party leader Matteo Salvini looks on during an interview with Reuters in Rome, Italy November 30, 2016. REUTERS/Tony Gentile/File Photo \nHis comments came after a prominent League politician faced widespread criticism for saying Italy’s “white race” could be wiped out unless stronger measures were taken to stop mainly African migrants from entering the country. \nItaly holds national elections on March 4 and immigration has become a major campaign issue, with centre-right opposition parties accusing the centre-left government of doing too little to stop the influx of newcomers. \n“We have to decide if our ethnicity, if our white race, if our society continues to exist or if our society will be rubbed out,” Attilio Fontana, the League candidate to become the next head of the wealthy Lombardy region, told Radio Padania. \nFacing a barrage of condemnation for his comments, Fontana later said it had been a “lapse”. But he received swift support from party leader, Salvini, whose popularity has risen strongly in recent years thanks to his anti-migrant stance. \n“We are under attack. Our culture, society, traditions and way of life are at risk,” he said in a statement. \n“The colour of one’s skin has nothing to do with it, but the risk is very real. Centuries of history risk disappearing if Islamisation, which up until now has been underestimated, gains the upper hand,” Salvini added. \nSalvini has pushed the League -- a regional power that at times has called for secession -- to the far-right of European politics, allying himself with the anti-Islam Freedom Party in the Netherlands and looking to tap into popular concern over mass migration. \nMore than 600,000 migrants have come to Italy from across the Mediterranean Sea over the past four years, fleeing war and poverty back home. \nHowever, Muslims only represent a small minority in Roman Catholic Italy, with the Pew Research Centre saying they will make up 4.9 percent of the population by 2020 against 3.7 percent in 2010. \nAll Italy’s mainstream parties have called for tougher restrictions on migration and the government is working closely with Libyan authorities to try to thwart people smuggling. Last year migrant arrivals to Italy by sea fell by a third. \nThe head of the ruling Democratic Party, former prime minister Matteo Renzi, accused the League on Monday of scaremongering. “We look to the future, not to fear,” he said. \nThe anti-establishment 5-Star Movement said Fontana’s comments showed the centre-right bloc was extremist. \nOpinion polls predict the centre-right will win the most seats at the national vote, but will fall short of an absolute majority. Polls also suggest that Fontana will be elected as Lombardy president in a ballot also set for March 4. Reporting by Crispian Balmer Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-15T19:08:00.000+02:00", "crawled": "2018-01-15T20:10:16.002+02:00", "highlightTitle": ""}