{"organizations": [], "uuid": "0d083052c597d9c42c9c2d2c2ae3413b37a16402", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/taxavoidance-ireland/irish-pm-accuses-eu-states-of-hypocrisy-over-corporate-tax-idUSL8N1PC2HI", "country": "US", "domain_rank": 408, "title": "Irish PM accuses EU states of hypocrisy over corporate tax", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T21:06:00.000+02:00", "replies_count": 0, "uuid": "0d083052c597d9c42c9c2d2c2ae3413b37a16402"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/taxavoidance-ireland/irish-pm-accuses-eu-states-of-hypocrisy-over-corporate-tax-idUSL8N1PC2HI", "ord_in_thread": 0, "title": "Irish PM accuses EU states of hypocrisy over corporate tax", "locations": [], "entities": {"persons": [{"name": "leo varadkar", "sentiment": "negative"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "varadkar", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "apple inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STRASBOURG, Jan 17 (Reuters) - Irish Prime Minister Leo Varadkar accused fellow EU states of hypocrisy over corporate tax on Wednesday and appeared to point a finger at France in particular as he rejected claims in the European Parliament that Ireland was a tax haven.\nIn a speech in the Strasbourg chamber where he underlined Dublin’s commitment to the European Union, Varadkar also hit back at what he called unfair accusations that Ireland was damaging its neighbours’ economies by helping multinationals like Apple Inc. channel global profits through its low-rate tax system.\nNot only were countries like Hungary and Bulgaria charging companies lower rates than Ireland, he said, but France -- whose President Emmanuel Macron has been a particular critic of tax avoidance by U.S. tech giants -- offered so many loopholes for some corporations that its effective rate could also be lower.\n“There’s a bit of hypocrisy about that when you look at the amount of money that we actually collect in terms of corporate taxes versus other countries that collect so much less but yet on paper have a higher tax rate and I think that needs to be challenged,” he told the parliament, which has long featured among some of the most vocal critics of corporate tax avoidance.\nThe EU ordered Ireland in 2016 to recover up to a record 13 billion euros ($16 billion) in back taxes from Apple and launched legal action in October over its failure to do so. .\nVaradkar defended his government’s appeal to EU courts but said it would respect whatever decision the judges made and would start collecting the tax in the second quarter.\nOECD data showed that France was one case where effective taxation of corporations could be lower than the 12.5-percent rate charges in Ireland, he said, adding that Dublin was also in the process of closing loopholes which have allowed some firms to pay considerably less than that headline figure.\nVaradkar defended the right of smaller and peripheral states like Ireland to use taxation as part of competition to attract investment. But he added: “Corporations should pay their fair share of tax. We cannot tolerate a situation where large companies can avoid paying any taxes anywhere.”\nAnd underlining that it was not just U.S. multinationals like Apple in Ireland that may benefit but also local firms in big European manufacturing nations, he said: “That’s as true for American tech companies as it is for European car manufacturers or for international aerospace and defence companies.”\nIreland was not in a “race to the bottom” on corporate tax, he said, arguing that in any case it was not one it could win.\nEurope risked putting itself at a disadvantage to rivals such as the United States, Japan or post-Brexit Britain by working alone to close tax loopholes, Varadkar said. The European Union should, he said, seek global rules through the OECD.\n“If the United States, the most successful economy in the world, can have tax competition among member states why can’t we have the same,” Varadkar said.\nIreland has found an ally in Hungary on the issue, both expressing strong opposition earlier this month to any effort to harmonise corporate and other tax rules across the European Union. ($1 = 0.8166 euros) (Reporting by Samantha Koester and Philip Blenkinsop in Brussels; Editing by Alastair Macdonald and Matthew Mpoke Bigg)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T21:06:00.000+02:00", "crawled": "2018-01-18T16:00:04.000+02:00", "highlightTitle": ""}