{"organizations": [], "uuid": "733f6062c793780ff7cb7a6da2b13a1a55eda00f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219350020&w=1200&r=LYNXMPEE0310E", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-britain-farming/farm-spending-to-focus-on-environment-after-brexit-uk-minister-idUSKBN1ET1RN", "country": "US", "domain_rank": 408, "title": "Farm spending to focus on environment after Brexit: UK minister", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:37:00.000+02:00", "replies_count": 0, "uuid": "733f6062c793780ff7cb7a6da2b13a1a55eda00f"}, "author": "", "url": "https://www.reuters.com/article/us-britain-farming/farm-spending-to-focus-on-environment-after-brexit-uk-minister-idUSKBN1ET1RN", "ord_in_thread": 0, "title": "Farm spending to focus on environment after Brexit: UK minister", "locations": [], "entities": {"persons": [{"name": "nigel hunt", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "oxford", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OXFORD, England (Reuters) - Britain will only pay public funds to farmers who provide public benefits such as wildlife habitats or improved soil quality under a post-Brexit shake-up in agricultural policies announced on Thursday.\nEnvironment Secretary Michael Gove, who spoke at two farming conferences in Oxford, also said the government would “look at ways to support farmers who may choose to leave the industry.”\nBritish farming is set for a radical overhaul after the country leaves the European Union in March 2019, when, for the first time in decades, the country will have a chance to create its own agricultural policy.\nFarmers in Britain will have to compete for government funds with departments such as health and education once Brussels hands over the purse strings for farming budgets to London.\nUnder the European Union’s Common Agricultural Policy (CAP), British farmers receive about 3 billion pounds ($4 billion) a year in public funds.\nGove, who criticized the CAP’s “fundamentally flawed design”, estimated that around 80 percent of the funding was based on the size of farmers’ productive agricultural land.\n“I think that money is poorly spent. Ultimately public money should go towards people who are thinking hard and working hard in order to ensure our environment is enhanced,” he said.\n“If we are going to have 3 billion pounds spent then that money should be an investment in the future rather than an incentive to carry on just as people have been doing.”\nThe new policy announced by Gove will apply only in England, after a transition period. Policies may differ in Scotland and Wales where devolved administrations control farm spending.\nWARNING ON WORKFORCE Gove said the current system of area-based funding, known as the basic payment scheme (BPS), would continue over a transition period in England after Britain leaves the EU to give farmers enough time to change their business model if necessary.\n“After the transition, we will replace BPS with a system of public money for public goods,” he said.\nGove said BPS payments may continue until the end of 2024 although they would be reduced in England “either through a straight cap at the maximum level or through a sliding scale of reductions, to the largest payments first.”\nOn average, British farmers get about 15,000 pounds a year from direct payments and an EU rural development fund. For some, direct payments account for 70 percent of their income. But a significant chunk goes to wealthy individuals who are large landowners.\nGove also warned farms and food companies that rely heavily on migrant labor while saying the government would pursue a “flexible migration policy overall.”\n“Industries which come to rely on importing cheap labor run the risk of failing to invest in the innovation required to become genuinely more productive,” he said.\n“Labour-intensive production inevitably lags behind capital intensive production.”\nSince the June 2016 British vote to leave the EU, some farmers have reported difficulties in recruiting enough workers.\nGove said the British government would provide more details of its future agricultural policy in a document to be published in the spring.\n($1 = 0.7384 pounds)\nReporting by Nigel Hunt; Editing by Adrian Croft\n ", "external_links": [], "published": "2018-01-04T17:37:00.000+02:00", "crawled": "2018-01-04T19:26:22.009+02:00", "highlightTitle": ""}