{"organizations": [], "uuid": "28a2cc6286c2fa55d78f8ba486971e28febe150e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222338512&w=1200&r=LYNXMPEE0F0CO", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-media/philippines-duterte-had-nothing-to-do-with-news-sites-licence-spokesman-idUKKBN1F50HT", "country": "US", "domain_rank": 408, "title": "Philippines' Duterte had 'nothing to do' with news site's licence - spokesman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:18:00.000+02:00", "replies_count": 0, "uuid": "28a2cc6286c2fa55d78f8ba486971e28febe150e"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-media/philippines-duterte-had-nothing-to-do-with-news-sites-licence-spokesman-idUKKBN1F50HT", "ord_in_thread": 0, "title": "Philippines' Duterte had 'nothing to do' with news site's licence - spokesman", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "negative"}, {"name": "karen lema", "sentiment": "none"}, {"name": "martin petty", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}, {"name": "harry roque", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "philippine", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "none"}, {"name": "securities exchange commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  manila", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 21 AM / Updated 13 minutes ago Philippines' Duterte had 'nothing to do' with news site's licence - spokesman Martin Petty , Karen Lema 4 Min Read \nMANILA (Reuters) - The office of Philippine leader Rodrigo Duterte sought to distance itself on Tuesday from a regulator’s decision to revoke the licence of a prominent news site, rebuffing allegations the administration had initiated a crackdown on the media. Illustration of the Rappler website January 16, 2018. REUTERS/Thomas White/Illustration \nPresidential spokesman Harry Roque said Duterte had not influenced the corporate regulator’s decision against digital news outlet Rappler, and that Duterte had called him to ask why critics were pointing the finger at him. \nRappler, whose reporting has infuriated the volatile leader, was found by the Securities Exchange Commission (SEC) to have violated restrictions on foreign ownership of domestic media. The decision is not final and Rappler, which has been allowed to continue operating as normal, said it would challenge it. \n“He did not like the fact that Rappler was saying this is a result of the president’s dislike for Rappler, of course not, he had nothing to do with this decision,” Roque told a regular news briefing dominated by questions about Rappler. \n“He was not even aware there was this decision coming up.” \nForeign press organisations and human rights groups have rallied behind Rappler, joining a chorus of domestic outrage among the media and political opposition at what they saw as move to muzzle those scrutinizing Duterte. \nAmnesty International called it “an alarming attempt to silence independent journalism”, describing Rappler as “fearless in holding those in power to account”. \nHuman Rights Watch said the foreign ownership allegations “masked a vendetta” against Rappler and the decision “suggests a sinister use of state regulatory processes to stifle critical media voices”. \nDuring last year’s annual address to the nation, Duterte singled out Rappler for being fully owned by Americans, which Rappler refutes. \nThe two U.S.-based organisations that have invested in Rappler are Omidyar Network, created by eBay founder and entrepreneur Pierre Omidyar, and North Base Media, which advocates independent media. \nRappler said its filings to the SEC in 2015 made it clear that just like several other media outlets, foreigners had invested in some of its Philippine Depositary Receipts (PDR), but did not own any shares, or have a say in operations. Journalists work at the office of Rappler in Pasig, Metro Manila, Philippines January 15, 2018. REUTERS/Dondi Tawatao FOREIGN POWER \nRoque said earlier on Tuesday that by selling PDR to those entities, Rappler had given foreigners “the power to negatively control the company” without them holding any of its shares. \n“Rappler in effect becomes a dummy of the foreign investor,” he told news channel ANC. \nRappler is the latest entity to have challenged Duterte and found itself subjected to legal scrutiny initiated by his political allies, usually after his repeated public outbursts against those questioning his policies. \nHis government has denied that his supporters are doing his bidding and the president himself has previously voiced disagreement with some action taken against his opponents. \nRoque denied that it was Solicitor General Jose Calida, a close associate of Duterte, who had initiated the case against Rappler and said the regulator was already looking into its ownership before Calida took it up. \nSEC Commission Secretary Armand Pan, however, said the case started with Calida’s complaint. \nRappler’s investigative reporting has included allegations that Duterte’s government has “weaponised” social media, using it to discredit and generate online hate against critics and journalists. His office rejects that. \nRoque said Duterte had no desire to crack down on media, though he did feel that Rappler was hypocritical. \n“According to him, Rappler has been very active criticizing individuals for violating the constitution and the laws of the land and it turns out it is by itself violating the constitution,” Roque said. \nRappler chief executive Maria Ressa disputed Roque’s remarks and said a “war of attrition” was now underway. \n“What’s publicly stated is not what’s going on behind the scenes,” she told CNN Philippines. Additional reporting by Neil Jerome Morales; Editing by Raju Gopalakrishnan", "external_links": [], "published": "2018-01-16T08:18:00.000+02:00", "crawled": "2018-01-16T08:39:14.012+02:00", "highlightTitle": ""}