{"organizations": [], "uuid": "1d5b86f4db28f0182e411f0ef4d1e404984481be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/02/104816517-GettyImages-597611314.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/iqos-meeting-big-moment-for-philip-morris-international-and-altria.html", "country": "US", "domain_rank": 767, "title": "iQOS meeting big moment for Philip Morris International and Altria", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-24T16:50:00.000+02:00", "replies_count": 0, "uuid": "1d5b86f4db28f0182e411f0ef4d1e404984481be"}, "author": "Angelica LaVito", "url": "https://www.cnbc.com/2018/01/24/iqos-meeting-big-moment-for-philip-morris-international-and-altria.html", "ord_in_thread": 0, "title": "iQOS meeting big moment for Philip Morris International and Altria", "locations": [], "entities": {"persons": [{"name": "akio kon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "altria philip morris international", "sentiment": "negative"}, {"name": "philip morris international", "sentiment": "negative"}, {"name": "philip morris international inc.", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "altria", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "pmi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Philip Morris International started making its case on Wednesday for its heat-not-burn tobacco product to be marketed as less risky than cigarettes.\nThe tobacco company presented its evidence and answered questions from an independent advisory committee. The panel will make a recommendation on whether the Food and Drug Administration should approve PMI's application to advertise its iQOS system as less risky than smoking conventional cigarettes. The FDA is not required to follow the suggestion. \nCommittee members wanted to know how the product would affect kids and teens, even though iQOS is meant for adult smokers. Altria, which would receive sole distribution rights in the U.S., said it recognizes the balance it will need to find. \n\"The challenge is maximizing the reach and support so (adult smokers) can switch completely,\" said Sarah Knakmuhs, vice president of heated tobacco for Altria's Philip Morris USA. \"On the other hand, we want to limit reach to unintended audiences, such as non-smokers and youth.\" \nAkio Kon | Bloomberg | Getty Images The Philip Morris International Inc. iQOS electronic cigarette, including packs of Marlboro HeatStick. Online, the company plans to use a third party to verify shoppers' age. One idea it has for commercialization is opening iQOS stores, where it would identify whether customers are old enough to shop and are smokers. \nIf PMI's modified-risk tobacco product application is approved, iQOS would be the first heat-not-burn product allowed to advertise itself as being less risky than smoking conventional cigarettes.\nPMI, which sells Marlboro outside the U.S., thinks iQOS will appeal to adult smokers who want to quit but want an alternative that's closer to the real thing than e-cigarettes. The pen-like device holds \"HeatSticks\" that are made with tobacco and would carry the Marlboro brand name. Altria sells Marlboro in the U.S.\nThe company has already launched iQOS in more than 30 markets, including Japan, where it has become wildly popular. Analysts see an enormous opportunity for iQOS in the U.S.\nThe Centers for Disease Control and Prevention estimates 36.5 million adults currently smoke cigarettes. Among all U.S. adult smokers, nearly 70 percent say they want to quit, according to the CDC.\nUnder FDA Commissioner Scott Gottlieb, the FDA has adopted the idea that nicotine products exist on a continuum of risk, with smoke particles in combustible cigarettes being the most harmful. PMI will try to convince the committee that iQOS falls on the other side of the spectrum while noting the product is not risk-free.\nThe Campaign for Tobacco-Free Kids urged the FDA on Monday to address how youths will perceive the risk of iQOS and the potential for youths to start using tobacco with it. The group was responding to the FDA's review of iQOS published Monday ahead of the hearing.\nThe FDA's review of iQOS identified lower levels of toxic chemicals than in cigarettes. It could not say that using the device led to a decreased risk of illnesses associated with smoking because doing so would require a longer study.\nEven if the advisory committee suggests the FDA approve PMI's modified risk tobacco product application, the FDA is not guaranteed to follow the recommendation. The timing of the agency's ultimate decision is unclear. Some have suggested May, which would mark one year since the FDA said it would review the application. \nPMI has another application under FDA review that would simply allow iQOS to be sold in the U.S., without the lower-risk claims. The Tobacco Control Act calls for the FDA to respond to premarket tobacco applications within 180 days. It began reviewing PMI's in August, so a decision could come in February.", "external_links": ["https://www.reuters.com/article/us-health-tobacco-pmi-device/fdas-tobacco-stance-faces-test-with-philip-morris-iqos-device-idUSKBN1FB234"], "published": "2018-01-24T16:50:00.000+02:00", "crawled": "2018-01-24T15:56:16.002+02:00", "highlightTitle": ""}