{"organizations": [], "uuid": "f98911b43081728aefd80ff5ebc007191f4704c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/bezeq-elliott/update-1-bezeq-telecom-board-changes-expected-after-shareholder-revolt-idUSL8N1PP3YK", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Bezeq Telecom board changes expected after shareholder revolt", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:47:00.000+02:00", "replies_count": 0, "uuid": "f98911b43081728aefd80ff5ebc007191f4704c7"}, "author": "", "url": "https://www.reuters.com/article/bezeq-elliott/update-1-bezeq-telecom-board-changes-expected-after-shareholder-revolt-idUSL8N1PP3YK", "ord_in_thread": 0, "title": "UPDATE 1-Bezeq Telecom board changes expected after shareholder revolt", "locations": [], "entities": {"persons": [{"name": "granot", "sentiment": "none"}, {"name": "steven scheer", "sentiment": "none"}, {"name": "elovitch", "sentiment": "none"}, {"name": "shaul elovitch", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}], "locations": [], "organizations": [{"name": "telecom", "sentiment": "negative"}, {"name": "bezeq", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "israel securities authority", "sentiment": "none"}, {"name": "eurocom group", "sentiment": "none"}, {"name": "bezeq israel telecom", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "eurocom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 1:48 PM / Updated 8 minutes ago UPDATE 1-Bezeq Telecom board changes expected after shareholder revolt Reuters Staff \n(Adds details, comments) \nBy Steven Scheer \nTEL AVIV, Jan 30 (Reuters) - The acting chairman of Bezeq Israel Telecom said on Tuesday he expected changes in the composition of Bezeq’s board in the wake of a call by activist investor Elliott. \nThe Israel Securities Authority is investigating Bezeq, focusing on allegations that former chairman Shaul Elovitch had meddled in the merger in 2015 between Bezeq and its satellite TV unit YES for personal financial gain. Elovitch has denied any wrongdoing. \nElovitch owns the Eurocom Group that controls Bezeq. \nElliott this month called for the immediate resignation of all Bezeq directors implicated in the investigation by the securities regulator and those affiliated with Eurocom. \nIn a letter to Granot on Jan. 16, Elliott said it had a 4.8 percent stake in Bezeq and called for a restructuring of the holding group that controls Bezeq. It said the makeup of the board “is no longer fit for purpose”. \nInterim chairman David Granot said he shared the view that proper corporate governance was of prime importance to Bezeq, and said he intended to take Elliott’s concerns into serious consideration when a slate of board candidates is proposed at its next meeting, due in April or May. \n“I expect that this slate will contain changes in the composition of our board,” Granot said in a letter of reply to the Elliott team released by Bezeq via the Tel Aviv Stock Exchange on Tuesday. \nSince Elliott’s call, other shareholders have come out in support, including advisory firm Entropy on behalf of Israeli institutional investors. \nGranot, who has been acting chairman for six months, said Bezeq welcomed an active interest being taken by its shareholders. He said he did not allow the participation of directors in discussions where they had potential conflicts of interest. \nMembers of the board are elected annually by a majority vote of Bezeq shareholders, Granot said. Bezeq will publish its 2017 financial results in the second half of March with its shareholders meeting 35 days later. \n“Let me assure you that I have heard loud and clear the issues and concerns you raised regarding this matter, both in your letter and at our meeting last week,” Granot wrote in the reply to Paul Best, portfolio manager and head of European private equity at Elliott Advisors, an affiliate of New York-based Elliott Management Corp. (Reporting by Steven Scheer; Editing by Alexander Smith and Alison Williams)", "external_links": [], "published": "2018-01-30T15:47:00.000+02:00", "crawled": "2018-01-30T15:59:50.008+02:00", "highlightTitle": ""}