{"organizations": [], "uuid": "51b82c5eac40f8d7e743c2d8c870903a01754431", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219651171&w=1200&r=LYNXMPEE04126", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/usa-pakistan-asif/pakistani-minister-decries-u-s-as-friend-who-always-betrays-idINKBN1EU1QY", "country": "US", "domain_rank": 408, "title": "Pakistani minister decries U.S. as 'friend who always betrays'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:28:00.000+02:00", "replies_count": 0, "uuid": "51b82c5eac40f8d7e743c2d8c870903a01754431"}, "author": "", "url": "https://in.reuters.com/article/usa-pakistan-asif/pakistani-minister-decries-u-s-as-friend-who-always-betrays-idINKBN1EU1QY", "ord_in_thread": 0, "title": "Pakistani minister decries U.S. as 'friend who always betrays'", "locations": [], "entities": {"persons": [{"name": "haqqani", "sentiment": "none"}, {"name": "mubasher bukhari", "sentiment": "none"}, {"name": "jorgic", "sentiment": "none"}, {"name": "khawaja asif", "sentiment": "none"}, {"name": "imran khan", "sentiment": "none"}, {"name": "reuters/jason lee  opposition", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLAMABAD/LAHORE (Reuters) - Foreign Minister Khawaja Asif said the United States was behaving towards Pakistan as “a friend who always betrays” after Washington suspended aid and President Donald Trump accused Islamabad of lies and deceit over many years.\nPakistani Foreign Minister Khawaja Asif speaks during a joint news conference after the 1st China-Afghanistan-Pakistan Foreign Ministers' Dialogue in Beijing, China, December 26, 2017. REUTERS/Jason Lee Opposition leader Imran Khan, a former cricket star tipped as the next prime minister, said it was time for Pakistan to “delink” from the United states and run down U.S. diplomatic and intelligence presence in what is a sensitive strategic area.\nWashington accuses Pakistan of playing a “double game” by assisting Afghan Taliban and Haqqani network militants causing chaos in Afghanistan. Islamabad denies this and accuses the United States of disrespecting its vast sacrifices - casualties have numbered in the tens of thousands - in fighting terrorism.\nAnti-American sentiment and tense U.S.-Pakistan ties are some way off their recent nadir in 2011, when Osama bin Laden was killed in a secret U.S. raid inside Pakistan, but the harsh rhetoric is likely to make it harder to mend future ties.\n“The U.S. behaviour is neither that of an ally nor of a friend,” Asif told local Capital TV late on Thursday. “It is a friend who always betrays.”\nSmall groups of students chanting “Death to America” and “Death to Trump” burnt American flags and torched photos of Trump after Friday prayers in capital Islamabad and the eastern city of Lahore. The organised protests ended swiftly.\nWorsening ties may push Pakistan further into the arms of long-time ally China, which backed Islamabad after the fallout from Trump’s tweet. Beijing’s diplomatic and financial support has also strengthened Pakistan’s hand, analysts say.\nOn Friday, Pakistan’s foreign office criticised what it called “shifting goalposts” after the U.S. confirmed it would suspend all security total at least $900 million, until Pakistan stopped assisting militants.\nOther official government statements in response to Trump’s tweet have been measured but Foreign Minister Asif and several other prominent politicians have lashed out repeatedly.\nOpposition leader Khan said Trump’s tweet and other U.S. comments were part of “deliberate attempts to humiliate and insult the Pakistani nation” and called for retaliation.\n“It is time for Pakistan to delink from the US,” Khan said in a statement, which called for an immediate removal of “excessive US diplomatic, non-diplomatic and intelligence personnel from Pakistan”.\nKhan also called for a suspension of land and air transport routes through Pakistan that the U.S. uses to resupply NATO troops in Afghanistan, a move Pakistani officials privately say is unlikely unless relations drastically deteriorate.\nU.S. aid suspension was announced days after Trump tweeted that United States had foolishly given Pakistan $33 billion in aid over 15 years and were rewarded with “nothing but lies & deceit, thinking of our leaders as fools”.\nThe aid suspension was largely expected by Islamabad but Pakistani officials were taken aback by Trump’s withering tweet and the tone of U.S. announcements.\n“The FBI, his political opponents, African-American football players are used to Trump criticising them like this on Twitter -- we are not used to it,” said one Pakistani government minister.\n“We were seriously shocked.”\nPoliticians such as Asif and Khan have been delivering anti-American statements partly to placate domestic audiences, analysts say, with one eye on general elections due in mid-2018.\n“This is the election period and for the first time in Pakistan’s history, anti-Americanism will become an issue in an election campaign,” said Pakistani writer and analyst Zahid Hussain.\n“READY TO EAT GRASS”\nThere is a long history of anti-Americanism in Pakistan and after the Osama bin Laden raid, which many Pakistanis saw as violation of the country’s sovereignty, relations neared breaking point in 2011.\nThat year, NATO forces bombed a Pakistani army checkpoint, killing 24 soldiers, and CIA contractor Raymond Davis shot dead two Pakistanis in Lahore.\nIn the north-western city of Peshawar, many Pakistanis cited the aid suspensions as another reason for Pakistan to sever ties with Washington.\n“We are ready to eat grass, but only if our leaders become honest and make bold decisions against the Americans,” said Jalal Noor Khan, 48, a food merchant.\nThe flag burnings in Lahore and Islamabad were organised by student organisations with links to hardline religious groups. About 60 students were protesting in Islamabad and another 100 in Lahore.\n“The U.S. flag and Trump’s photos are under our feet. It’s a message to them that they will face the same if they did anything wrong against Pakistan,” said Rana Zeeshan, one of the student organisers of the Lahore protest.\n“We will erase the U.S. from the world’s map.”\nAdditional reporting by Jibran Ahmad in PESHAWAR and Gul Yousafzai in QUETTA; Writing by Drazen Jorgic; editing by Ralph Boulton\n ", "external_links": [], "published": "2018-01-05T19:28:00.000+02:00", "crawled": "2018-01-05T19:49:25.006+02:00", "highlightTitle": ""}