{"organizations": [], "uuid": "e1bc3b7f48932382a335d536f691a53e723eb691", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226942623&w=1200&r=LYNXMPEE0U0VW", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-lebanon-politics/lebanons-berri-says-government-work-might-stumble-over-tension-idUSKBN1FK1SI", "country": "US", "domain_rank": 408, "title": "Lebanon's Berri says government work might stumble over tension", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:52:00.000+02:00", "replies_count": 0, "uuid": "e1bc3b7f48932382a335d536f691a53e723eb691"}, "author": "", "url": "https://www.reuters.com/article/us-lebanon-politics/lebanons-berri-says-government-work-might-stumble-over-tension-idUSKBN1FK1SI", "ord_in_thread": 0, "title": "Lebanon's Berri says government work might stumble over tension", "locations": [], "entities": {"persons": [{"name": "berri", "sentiment": "negative"}, {"name": "nabih berri", "sentiment": "none"}, {"name": "michel aoun", "sentiment": "none"}, {"name": "gebran bassil", "sentiment": "none"}, {"name": "tom perry", "sentiment": "none"}, {"name": "aoun", "sentiment": "none"}, {"name": "peter graff", "sentiment": "none"}, {"name": "bassil", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  beirut", "sentiment": "none"}, {"name": "dahlia nehme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT (Reuters) - Lebanese Parliament Speaker Nabih Berri said on Wednesday the work of Prime Minister Saad al-Hariri’s government work could be obstructed by political tension, al-Manar TV reported, as a row involving President Michel Aoun showed no signs of abating. \nAoun’s son-in-law, Foreign Minister Gebran Bassil, was caught on camera calling Berri “a thug” earlier this week, causing protests in Beirut and gunfire near offices of Aoun’s Free Patriotic Movement (FPM) east of the capital on Monday. \n“The government will continue but it might stumble because of the current political tension,” al-Manar, controlled by the powerful Shi‘ite group Hezbollah, cited Berri as saying. \nThe row has worsened a standoff between Berri, a Shi‘ite, and Aoun, a Maronite Christian, that threatens to ignite sectarian tensions in the run-up to a parliamentary election in May. \nThe FPM said on Tuesday that Bassil had already expressed regret for the comments and that it regarded the issue as over. But Berri, in comments to MPs on Wednesday, pressed his demand for an apology “to the Lebanese” for “the insults that happened”. \nBerri and Aoun, both in their 80s, were enemies in the 1975-90 civil war. \nBerri and Aoun’s parties are two of the most powerful groups in the coalition government that was formed in 2016. Lebanon has suffered long periods of paralysis in government as a result of political tensions in recent years. \n“The constitutional institutions not the street are the right venues to resolve political disputes,” Aoun said on his official Twitter feed on Wednesday. \nPolitical tensions between Berri and Aoun have been rising since December when Aoun signed a decree promoting dozens of army officers without the signature of Shi‘ite Finance Minister Ali Hassan Khalil, one of Berri’s closest aides. \nThe row has shattered a rare moment of national unity that saved Lebanon from strife during the crisis over Hariri’s shock resignation in November, which he later rescinded. \nThe tensions have also shaken Aoun’s ties with the Iran-backed Shi‘ite group Hezbollah, whose links to Berri and Amal run much deeper than its political alliance with the FPM, which was founded by Aoun and is now led by Bassil. \nReporting by Dahlia Nehme; Editing by Tom Perry and Richard Balmforth\n ", "external_links": [], "published": "2018-01-31T14:52:00.000+02:00", "crawled": "2018-01-31T15:08:28.002+02:00", "highlightTitle": ""}