{"organizations": [], "uuid": "55f6d43275fbd533edaaf5b42d607a2e1af4715b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-pete-childs-joins-netdocuments-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Pete Childs Joins NetDocuments as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.125, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "55f6d43275fbd533edaaf5b42d607a2e1af4715b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-pete-childs-joins-netdocuments-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Pete Childs Joins NetDocuments as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "pete childs", "sentiment": "negative"}, {"name": "childs", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "clearlake capital group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NetDocuments names software industry veteran, Pete Childs, as Chief Financial Officer\nSALT LAKE CITY & SANTA MONICA, Calif.--(BUSINESS WIRE)-- NetDocuments, the leading secure cloud-based document, email, and collaboration management platform for law firms and corporate legal and compliance departments, backed by Clearlake Capital Group, L.P. (together with its affiliates, “Clearlake”), today announced that Pete Childs has joined the company as the Chief Financial Officer.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116005373/en/\nChilds brings over 25 years of experience driving transformational change across rapid-growth software companies and has led strategic initiatives, global acquisitions, and two successful IPOs. “I’m honored to join the NetDocuments team at such an exciting time for the company,” Childs commented. “We have very strong momentum in the market as the legal and compliance industry continues its adoption of secure cloud technologies. I look forward to joining the team and helping to accelerate our rapid growth and continue to scale the NetDocuments platform.”\nPrior to NetDocuments, Childs was the Chief Financial Officer for both Workfront, a leading cloud-based enterprise work management software, as well as Cvent, a public company delivering a cloud-based enterprise event management platform. “Pete’s experience across high-growth cloud companies and strategic transactions is a perfect fit to the NetDocuments management team as we scale and prepare for our next phase of global growth,” Matt Duncan, CEO at NetDocuments stated. “Pete will play an instrumental role as we continue on our mission and promise of delivering the most innovative, secure, and trusted cloud platform.”\nAbout NetDocuments\nNetDocuments is the leader in secure cloud-based document management, email management and collaboration software solutions. Founded in 1999 with over 2,000 enterprise customers worldwide, NetDocuments is the trusted cloud-based content management and workflow platform for lawyers and knowledge workers, complete with built-in security, compliance, information governance, disaster recovery, matter centricity, enterprise search, mobility, records management, and collaboration. More information is available at www.netdocuments.com\nAbout Clearlake\nClearlake Capital Group, L.P. is a leading private investment firm founded in 2006. With a sector-focused approach, the firm seeks to partner with world-class management teams by providing patient, long-term capital to dynamic businesses that can benefit from Clearlake’s operational improvement approach, O.P.S.® The firm’s core target sectors are software and technology-enabled services; industrials and energy; and consumer. Clearlake has managed approximately $6 billion of institutional capital since inception and its senior investment principals have led or co-led over 100 investments. More information is available at www.clearlake.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005373/en/\nMedia:\nFor NetDocuments:\nMarriott Murdock, 801-722-6625\npress@netdocuments.com\nor\nFor Clearlake:\nOwen Blicksilver Public Relations, Inc.\nKristin Celauro, 732-433-5200\nkristin@blicksilverpr.com\nor\nJennifer Hurson, 845-507-0571\njennifer@blicksilverpr.com\nSource: NetDocuments and Clearlake Capital Group, L.P.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clearlake.com&esheet=51743146&newsitemid=20180116005373&lan=en-US&anchor=www.clearlake.com&index=2&md5=57786fd224411d972080115f23ac274b", "http://www.businesswire.com/news/home/20180116005373/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.netdocuments.com&esheet=51743146&newsitemid=20180116005373&lan=en-US&anchor=www.netdocuments.com&index=1&md5=1ab185247592d750c4e58aa0e19628dc"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T16:41:43.018+02:00", "highlightTitle": ""}