{"organizations": [], "uuid": "e8c69cf70759851c970acdf43cb055f6f39769fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/668808544.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/bitcoin-mining-tesla-electricity/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Mining Uses More Energy than Tesla and Electric Cars | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.176, "site_type": "news", "published": "2018-01-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "e8c69cf70759851c970acdf43cb055f6f39769fe"}, "author": "Jen Wieczner", "url": "http://fortune.com/2018/01/11/bitcoin-mining-tesla-electricity/", "ord_in_thread": 0, "title": "Bitcoin Mining Uses More Energy than Tesla and Electric Cars | Fortune", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "jen wieczner", "sentiment": "negative"}, {"name": "bitcoin", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}], "organizations": [{"name": "electric cars", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jen Wieczner January 11, 2018 \nAs Bitcoin’s price has soared , so too has the energy consumption to produce it—to the point that Bitcoin mining now guzzles more electricity than all the electric cars in the world. \nIn 2018, Bitcoin’s power demand is set to more than triple, consuming as much energy in a year as the entire nation of Argentina, according to a new report by Morgan Stanley (ms) . \nThe bank’s analysts forecast that Bitcoin mining could use up more than 125 terawatt hours of electricity this year, a level electric vehicles globally won’t reach until 2025. Last year, Bitcoin consumed 36 terawatt hours of energy—as much as the country of Qatar, Morgan Stanley estimated in a research note published Wednesday. \nBy comparison, all the Tesla (tsla) cars on the road (about 280,000 at the end of 2017, according to company statistics) likely used less than 1.3 terawatt hours of electricity combined for the year, a Fortune analysis found. The analysis assumed each car drove 15,000 miles—roughly the national average—at a rate of 30 kilowatt hours of electricity per 100 miles, based on the median mileage rate for Tesla Model 3 and Model S vehicles, according to figures reported to the U.S. Environmental Protection Agency . \nThat means it cost 29 times as much energy to produce Bitcoins last year as it did to power all the Tesla cars driving today. \n“That’s freaking insane,” wrote one person, going by the username Frank99, who posted a similar calculation on Tesla’s online discussion forum . \nGlobal energy consumption for all electric cars was about 6 terawatt hours in 2016. \nThe reason Bitcoin mining consumes so much electricity is that producing each new Bitcoin requires solving a complex mathematical puzzle, through a cryptographic process performed by high-powered computers. The mining computations serve to verify Bitcoin transactions on a digital ledger known as the blockchain , ensuring security; they also have the downside of being extremely energy intensive. (Most other cryptocurrencies are believed to require much less energy to mine.) \nMorgan Stanley estimates that it costs $3,000 to $7,000 to produce one Bitcoin, including both energy and hardware expenses. The price of a single Bitcoin was about $13,500 Thursday afternoon, down from a high of nearly $20,000 last month. \n“That said, mining is very profitable at today’s bitcoin price, and if cryptocurrencies continue to appreciate we expect global mining power consumption to increase,” the Morgan Stanley analysts wrote in their research note. \nStill, the analysts did not find any correlation between the Bitcoin price and electricity costs—suggesting that cryptocurrency investors who buy Bitcoin are not factoring in how much it actually takes to produce it. This also means that while cryptocurrency prices are unusually volatile and sensitive to even minor news events , Bitcoin’s price is unlikely to be vulnerable to energy price fluctuations. \n“We do not see cryptocurrency values being driven by electricity costs in the near term,” the Morgan Stanley analysts continued. “2017 shows that cryptocurrency pricing appears not to be fully based on fundamentals.” \nThe bankers, however, did offer an idea for how energy companies could use cryptocurrency to juice their own stock prices: “Perhaps global utilities should start accepting Bitcoins for payments,” the analysts concluded. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T02:00:00.000+02:00", "crawled": "2018-01-12T02:20:25.011+02:00", "highlightTitle": ""}