{"organizations": [], "uuid": "b683b37823755cf770682f66d168fd8e5a2be69c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225083463&w=1200&r=LYNXMPEE0O0FV", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-chung/melbourne-run-pushes-chung-towards-cult-status-back-home-idUKKBN1FE0XQ", "country": "US", "domain_rank": 408, "title": "Tennis-Melbourne run pushes Chung towards cult status back home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:59:00.000+02:00", "replies_count": 0, "uuid": "b683b37823755cf770682f66d168fd8e5a2be69c"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-chung/melbourne-run-pushes-chung-towards-cult-status-back-home-idUKKBN1FE0XQ", "ord_in_thread": 0, "title": "Tennis-Melbourne run pushes Chung towards cult status back home", "locations": [], "entities": {"persons": [{"name": "chung", "sentiment": "negative"}, {"name": "federer", "sentiment": "none"}, {"name": "lee hyung-taik", "sentiment": "none"}, {"name": "haejin choi", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "yuna park", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "atp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 9:07 AM / Updated 31 minutes ago Melbourne run pushes Chung towards cult status back home Yuna Park , Haejin Choi 4 Min Read \nSEOUL (Reuters) - From being practically unknown in South Korea a week ago, Chung Hyeon has quickly gained superstar status in his homeland with a fairytale run to the Australian Open semi-finals that has raised the profile of tennis to new levels in the east Asian country. \nLee Hyung-taik was the last of the two Koreans to reach the fourth round of a grand slam when he made the last 16 at the U.S. Open way back in 2007. \nWorld number 58 Chung, who won the ATP’s “NextGen” event for the world’s top young players last year, has already gone two steps further and will take on defending champion Roger Federer in Friday’s semi-final. \nHaving defeated Novak Djokovic in earlier rounds, 19-times grand slam champion Federer will be another opponent the bespectacled 21-year-old has grown up hero-worshipping. \n“The thing is that Chung has grown up watching how outstanding players like Federer and Djokovic play, it is an honour for him to compete against Federer,” Chung’s mother Kim Young-mi told South Korean channel JTBC in a televised interview. \nBack home, the Korea Tennis Association is making arrangements for about 1,000 people to watch the match at Seoul High School and cheer for Chung, who was introduced to tennis by his parents to help him with his eyesight. \n“We haven’t held an event like this before, we wanted to commemorate Chung’s remarkable performance at the Australian Open,” an official from the KTA said. \nNicknamed “professor” for his scholarly look, Chung has also endeared fans with his humour on the court, working the crowd with a hand-flapping celebration like many a show-boating NBA player. \nAfter defeating six-time Melbourne Park winner Djokovic in the round of 16, he wrote in Korean on his social media: “You know this is not the end? Mr. Chung will keep moving on!” \nAfter his 6-4 7-6(5) 6-3 defeat of Tennys Sandgren in the semi-final on Wednesday, he walked toward the camera and picked up a pen to scribble “Chung on fire!” in Korean on the lens. \nWith his success Down Under, Chung is already driving sales of tennis products in South Korea. \nThe country’s leading online auction and shopping mall website Gmarket has seen a boom in tennis products including tennis shoes, tennis bag, tennis racket, and tennis ball. \nEarlier in the week, sales of every tennis-related product rose 24 percent from a week earlier with tennis shoes seeing the largest increase of 129 percent. \n“It is very rare to see an increase in tennis related products, as it is winter, meaning it is not the tennis season,” Oh Hye-jin, public relations specialist at Gmarket said. \n“In our official website, tennis products were placed in the top 10 searched shopping items. Since it is hard to see a boom in tennis products these days, I would say Chung Hyeon played a huge role in the sales increase.” \nFor some, Chung’s incredible run has also been a welcome break from political issues like a corruption scandal and the conflict among South Koreans about North Korea’s participation in next month’s Winter Olympics at Pyeongchang. \n“I was sick of reading news about on-going politics issues, but now I feel so happy to hear such good news about Chung which is giving us hope,” one Korean posted on a news story on the internet. \n“I wish he does his best at the next game against Federer.” Writing by Sudipto Ganguly in Mumbai; editing by Nick Mulvenney", "external_links": [], "published": "2018-01-25T10:59:00.000+02:00", "crawled": "2018-01-25T11:30:25.003+02:00", "highlightTitle": ""}