{"organizations": [], "uuid": "71adacb9ec63c23b963b1d79c03ecf8981742805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219273775&w=1200&r=LYNXMPEE030H2", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/iran-rallies-army/iran-army-ready-to-help-quell-unrest-if-needed-commander-idINKBN1ET0WB", "country": "US", "domain_rank": 408, "title": "Iran army ready to help quell unrest if needed: commander", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:19:00.000+02:00", "replies_count": 0, "uuid": "71adacb9ec63c23b963b1d79c03ecf8981742805"}, "author": "", "url": "https://in.reuters.com/article/iran-rallies-army/iran-army-ready-to-help-quell-unrest-if-needed-commander-idINKBN1ET0WB", "ord_in_thread": 0, "title": "Iran army ready to help quell unrest if needed: commander", "locations": [], "entities": {"persons": [{"name": "abdolrahim mousavi", "sentiment": "none"}, {"name": "michael georgy", "sentiment": "none"}, {"name": "gareth jones", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - Iran’s army chief declared on Thursday that police had already quelled anti-government unrest that has killed 21 people but that his troops were ready to intervene if needed, as Tehran staged more pro-government rallies.\nThe protests, which seem spontaneous and without a unifying leader, erupted a week ago in Iran’s second city of Mashhad over economic hardships - mostly high youth unemployment, costly living standards and alleged corruption.\n“Although this blind sedition was so small that a portion of the police force was able to nip it in the bud ... you can rest assured that your comrades in the Islamic Republic’s army would be ready to confront the dupes of the Great Satan (United States),” Major General Abdolrahim Mousavi was Quote: d in official media as saying.\nAs the unrest spread across the country, mainly in smaller towns, protesters said they were tired of official anti-Western rhetoric and that it was time for Supreme Leader Ayatollah Ali Khamenei and the government of President Hassan Rouhani to quit.\nThe protesters have included members of the working class and some from the educated middle class that formed the backbone of a pro-reform revolt almost a decade ago.\nAfter six days of demonstrations, the elite Islamic Revolutionary Guards Corps (IRGC) said on Wednesday that it had deployed forces to put down unrest in three provinces that have been hotbeds of protest.\nThat was the clearest sign yet that authorities were taking the protests seriously.\nThe Revolutionary Guards, the sword and shield of Iran’s Shi‘ite theocracy, were instrumental in suppressing an uprising over alleged election fraud in 2009 in which dozens were killed.\nSECURITY COMMANDERS PLAY DOWN EXTENT OF UNREST State television broadcast live pictures of further pro-government rallies on Thursday, including Ghaemshahr in northern Iran and Mashhad in the northeast, as well as Shahin Shahr in central Iran. Marchers were carrying posters saying, “No to riots,” “Iran is not Syria” and “Death to seditionists”, as well as portraits of Khamenei.\nThe student news agency ISNA Quote: d Interior Minister Abdolreza Rahmani Fazli as saying on Thursday that “at most 42,000 people attended the protests, which is not much”.\nOn Wednesday, the Revolutionary Guards commander, Major General Mohammad Ali Jafari, said the number of “troublemakers” did not exceed 15,000 nationwide.\nIran’s vastness as well as restrictions on independent media make it hard to determine the breadth and depth of the unrest.\nILNA, the semi-official labour news agency, said restrictions on Instagram, one of the social media tools used to mobilise protesters, were lifted on Thursday. But access to a more widely used messaging app, Telegram, remained blocked.\nAn opponent of Iranian President Hassan Rouhani chants slogans during a protest outside the European Union Council in Brussels, Belgium January 3, 2018. REUTERS/Francois Lenoir Videos posted on social media showed protesters in Ahvaz, capital of oil-rich Khuzestan province, setting a bank on fire, on Wednesday evening. The video, like others on social media, could not be authenticated by Reuters.\nIn other social media footage, hundreds of protesters hit the streets of Malayer in Hamadan province after nightfall, chanting: “People are begging, the supreme leader is acting like God!” Another video showed protesters in the northern town of Nowshahr shouting, “Death to the dictator”.\nState media said three Iranian security agents were killed on Wednesday near the Iraqi border in a clash that led to the dismantling of a team of “counter-revolutionaries” who had planned to cause explosions and provoke unrest.\nThe intelligence ministry said several “terrorists” were killed in the clash and one was arrested. Kurdish rebels are known to be active in the area.\nSlideshow (4 Images) INCREASINGLY BOLD DISSENT Few believe the protests pose an existential threat to the clerical elite, backed by pervasive security services, that has dominated Iran since the 1979 Islamic Revolution that overthrew a U.S.-backed monarchy.\nBut protesters have become increasingly bold, calling for the downfall of Khamenei, who has blamed the most sustained challenge to his 29 years in power for nearly a decade on “seditionists” and foreign agents.\n“I don’t want to harm my country but when I see those who run this country are so corrupt, I feel like I am being suffocated. They just talk. They accuse ‘the enemies’ of everything,” said protester Reza, 43, a father of three in the central city of Isfahan.\n“I am not an enemy. I am an Iranian. I love my country. Stop stealing my money, my children’s money,” he told Reuters by telephone.\nIranian Nobel Peace laureate Shirin Ebadi urged people to engage in civil disobedience and press on with their grievances.\nThe Saudi-owned pan-Arab daily Asharq Al-Awsat Quote: d Ebadi, Iran’s most famous human rights lawyer, as saying Iranians should stay on the street and that the constitution gave them the right to hold demonstrations.\nEbadi, who lives in London, was awarded the Nobel Peace Prize in 2003 and is one of a number of exiled critics of Iran’s leadership. She called on Iranians to stop paying water, gas and electricity bills and taxes in support of protesters.\nShe also urged Iranians to withdraw their money from state banks to exert economic pressure on the government to force it to stop resorting to violence and meet their demands.\n“If the government has not listened to you for 38 years, your role has come to ignore what the government says to you now,” Asharq Al-Awsat Quote: d Ebadi as saying in an interview.\nAdditional reporting by Bozorgmehr Sharafedin in London; editing by Mark Heinrich\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-04T11:19:00.000+02:00", "crawled": "2018-01-04T12:04:08.010+02:00", "highlightTitle": ""}