{"organizations": [], "uuid": "d50fef5eb86a67590ef5f938d2ed12c0cf9154fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-fleet-complete-acquires-ecofleet-advancing-its-expansion-in-europe.html", "country": "US", "domain_rank": 767, "title": "Fleet Complete acquires Ecofleet, advancing its expansion in Europe", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T08:08:00.000+02:00", "replies_count": 0, "uuid": "d50fef5eb86a67590ef5f938d2ed12c0cf9154fd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-fleet-complete-acquires-ecofleet-advancing-its-expansion-in-europe.html", "ord_in_thread": 0, "title": "Fleet Complete acquires Ecofleet, advancing its expansion in Europe", "locations": [], "entities": {"persons": [], "locations": [{"name": "scandinavia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "luxemburg", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "latvia", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "estonia", "sentiment": "none"}], "organizations": [{"name": "ecofleet", "sentiment": "negative"}, {"name": "europe company", "sentiment": "negative"}, {"name": "fleet complete", "sentiment": "none"}, {"name": "fleet complete europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company enters new markets in Scandinavia and Baltic states through acquisition of Ecofleet, reaching global subscriber base of over 400,000\nTORONTO, Jan. 31, 2018 /PRNewswire/ - Fleet Complete , the fastest-growing provider of IoT solutions in the connected commercial vehicle space, announced today its acquisition of Ecofleet, the leading fleet telematics player in the Nordic and Baltic regions. Terms of the transaction were not disclosed. This is Fleet Complete's second acquisition in Europe since ITmobile in 2016 (now operating as Fleet Complete Europe), establishing a presence in the Netherlands, Belgium, Luxemburg, Austria and, recently, Germany.\nEcofleet is the current top telematics provider in the north European market, offering cost-effective, high-benefit mobile asset management solutions in Denmark, Finland, Sweden, Norway, Estonia, Latvia, and Lithuania. The company has over 80,000 subscribers across small-to-medium businesses and large enterprise fleets, growing Fleet Complete's subscriber base to over 110,000 in Europe and over 400,000 globally.\nEcofleet's founders and leadership team will continue driving business in the region, aligning local market expertise with Fleet Complete's global objectives. Autolog by Ecofleet – a GPS-powered automatic mileage logging solution for business tax claims – will continue to be offered as a standalone brand due to its leading market position in handling country-specific rules and legislation. Future plans include offering Autolog to other European regions as well as North America.\n\"Ecofleet has a tremendous team of professionals, amazing product and innovative technology, which we look forward to incorporating into our global offering,\" comments Tony Lourakis, CEO of Fleet Complete. \"Leveraging Ecofleet's immense success and combining it with Fleet Complete's expansive IoT infrastructure and mobile carrier partnerships, we will be able to establish a powerful global IoT platform that will help more fleet-owning businesses around the world thrive.\"\nThe acquisition is consistent with Fleet Complete's global expansion strategy and gives it a leading position in the north European markets that are poised for a substantial telematics growth in the next 5 years. The company is laser-focused on penetrating the European long-haul sector, riding on the heels of its current success in North America with the mandated Electronic Logging Devices that helped bring in a record ~30,000 gross subscriber adds in the month of December 2017 alone.\nFleet Complete is also intent on developing strong relationships with commercial vehicle original equipment manufacturers (OEMs) in Western Europe. These strategic partnerships will power cutting-edge IoT solutions to help businesses reduce their fleet downtime and total cost of ownership while increasing the efficiency of freight and passenger mobility. The solutions will cover fleets in the widest range of vocations, duty-cycles, and vehicle types. Fleet Complete will also harness Ecofleet's unique ridesharing capabilities to accelerate the adoption of connected vehicle technologies in Europe and other markets.\n\"The combination of Fleet Complete and Ecofleet brings together exceptional product and technological capabilities,\" says Stig Lyngsie, COO of Ecofleet. \"We are perfectly aligned on our corporate values and internal cultures and, together, we will achieve greater success on the international stage. Both of our companies are customer-centric and continuously invest in innovation. We are excited to be part of the Fleet Complete team and look forward to excelling together.\"\nAbout Fleet Complete®\nFleet Complete® is a leading global IoT provider of mission-critical fleet, asset and mobile workforce management solutions. Servicing over 400,000 subscribers and over 30,000 businesses worldwide, the company maintains key distribution partnerships with AT&T in the U.S., TELUS in Canada, Telstra in Australia, and T-Mobile in Europe. It remains one of the fastest-growing companies in North America, having won numerous awards for innovation and growth. For more information, please visit fleetcomplete.com\nAbout Ecofleet\nEcofleet is an international software company that specializes in GPS-based fleet and team management solutions. Our focus is on optimizing car fleets and workflows to help our customers reduce costs and increase revenue. Ecofleet is one of the leading telematics providers in Scandinavia, the Baltic countries and Eastern Europe with presence in over 20 countries, servicing 80.000+ vehicles. For more information, please visit www.ecofleet.com\nSOURCE Fleet Complete", "external_links": ["https://autolog.us/", "https://www.ecofleet.com/", "https://www.fleetcomplete.com/en/products/eld-vehicle-log-book-app/", "https://www.fleetcomplete.com/en/", "http://www.fleetcomplete.com/", "https://ecofleet.com/"], "published": "2018-01-31T08:08:00.000+02:00", "crawled": "2018-01-31T11:10:09.000+02:00", "highlightTitle": ""}