{"organizations": [], "uuid": "9a5dcc4a96f03747385789a597475294c32da080", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-saudi-aramco-oil-chemicals/saudi-aramco-signs-crude-to-chemicals-technology-agreement-idUSKBN1F727B", "country": "US", "domain_rank": 408, "title": "Saudi Aramco signs crude-to-chemicals technology agreement", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:58:00.000+02:00", "replies_count": 0, "uuid": "9a5dcc4a96f03747385789a597475294c32da080"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-saudi-aramco-oil-chemicals/saudi-aramco-signs-crude-to-chemicals-technology-agreement-idUSKBN1F727B", "ord_in_thread": 0, "title": "Saudi Aramco signs crude-to-chemicals technology agreement", "locations": [], "entities": {"persons": [{"name": "nasser", "sentiment": "none"}, {"name": "amin nasser", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "dhahran", "sentiment": "none"}, {"name": "dhahran", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "saudi aramco", "sentiment": "negative"}, {"name": "saudi basic industries corp", "sentiment": "none"}, {"name": "aramco", "sentiment": "none"}, {"name": "chevron lummus", "sentiment": "none"}, {"name": "cb&i", "sentiment": "none"}, {"name": "sabic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DHAHRAN, Saudi Arabia (Reuters) - Saudi Aramco [IPO-ARMO.SE] signed a deal on Thursday with two U.S. firms for pilot use of a technology to convert crude oil to chemicals, helping the state company to expand its petrochemical business.\nAramco wants to develop its downstream business as the government prepares to sell up to 5 percent of the world’s largest oil firm in an initial public offering (IPO) this year.\nThe $40 million agreement with CB&I and Chevron Lummus covers “technology that will directly convert crude oil into chemicals”, Aramco chief executive Amin Nasser said at the company’s headquarters in Dhahran.\nUnder the deal, 70 to 80 percent of crude intake will be converted into chemicals, with an eye to beginning commercialization in two years, Nasser said.\nAramco has been integrating its refining with petrochemicals to serve the company’s plans to expand its market share, as well as its efforts to expand its refined products portfolio.\nIt wants to use oil as a major petrochemicals feedstock.\nIn November, it signed with Saudi Basic Industries Corp (SABIC) a preliminary deal to build a chemicals complex to convert 45 percent of crude oil to chemicals directly.\n“The use of oil in the petrochemicals sector is likely to become a key source of oil demand growth in the 2020s - in fact, growing by more than 50 percent over the coming two decades,” Nasser said.\nHe said using oil as a feedstock would “secure a large and reliable home for our future oil production”.\n“GROUND-BREAKING STEP”\nAramco chief technology officer Ahmad al-Khowaiter said the process unveiled on Thursday - called thermal crude-to-chemicals technology - would cut capital costs by 30 percent compared to conventional refining.\n“Several layers of catalyst ... allow different aspects to be treated – sulphur to be removed, heavies to be cracked, to convert that whole crude in one operation... into a suitable feedstock for steam cracking,” he told Reuters in an interview.\nHe called it a “groundbreaking step” that had not been attempted before and would give Aramco a competitive advantage.\nAramco pumps about 10 million barrels per day (bpd) of crude oil and plans to raise its refining capacity to 8 million to 10 million bpd from around 5 million bpd now.\nIts IPO is the centerpiece of an ambitious plan to diversify Saudi Arabia’s economy beyond oil. Aramco hopes diversification will boost its valuation and attract investors.\nThe company aims to unveil another process in chemical production in 2018 or 2019 that would eliminate the steam cracker altogether.\n“This is an approach where we take crude and we crack it directly in one unit and produce olefins and aromatic streams,” said Khowaiter.\nAramco is also pursuing technology to improve automobile emissions, including a more efficient internal combustion engine and a method of temporarily storing carbon exhausts onboard vehicles for later use.\nWriting by Rania El Gamal; Editing by Edmund Blair and Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T23:58:00.000+02:00", "crawled": "2018-01-19T00:43:54.006+02:00", "highlightTitle": ""}