{"organizations": [], "uuid": "0c3138895aae9c6df11dacea58e426dc26498be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104932964-GettyImages-609845726.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/ces-2018-nvidia-partners-with-uber-volkswagen-and-baidu-on-driverless-cars.html", "country": "US", "domain_rank": 767, "title": "CES 2018: Nvidia partners with Uber and Baidu on driverless cars", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.854, "site_type": "news", "published": "2018-01-08T09:58:00.000+02:00", "replies_count": 0, "uuid": "0c3138895aae9c6df11dacea58e426dc26498be1"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/08/ces-2018-nvidia-partners-with-uber-volkswagen-and-baidu-on-driverless-cars.html", "ord_in_thread": 0, "title": "CES 2018: Nvidia partners with Uber and Baidu on driverless cars", "locations": [], "entities": {"persons": [{"name": "jeff swensen", "sentiment": "none"}], "locations": [{"name": "baidu", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "smallman street", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "consumer electronics show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nvidia has partnered with Uber, Volkswagen and China's Baidu in driverless cars, as the chipmaker looks to expand its presence in the autonomous driving space.\nRide-hailing service Uber will use Nvidia's chips for its artificial intelligence (AI) computing system in its fleet of self-driving cars, the companies said at the Consumer Electronics Show (CES) in Las Vegas on Sunday.\nNvidia makes graphics computing chips which are key components of the autonomous cars setup.\nIts stock was up s percent in morning trading.\nUber began working with self-driving technology in 2015 and has since launched trials in Pittsburgh, PA , and Phoenix, Arizona. The company says its driverless cars have completed more than 50,000 passenger trips and have logged over 2 million autonomous miles.\nNvidia's graphics computing technology was used in the first test fleet of Volvo XC90 SUVs that Uber was using. Uber is also using the technology in its current fleet of self-driving cars and freight trucks.\nAt CES, Nvidia also announced a partnership with Volkswagen. The German carmaker will use the Nvidia Drive IX platform to help develop its next set of cars.\nNvidia Drive IX allows automakers to put features in the car such as facial recognition to unlock the vehicle, gesture controls, and a voice assistant similar to Amazon's Alexa for example.\nVolkswagen said it will use the software to create an \"intelligent co-pilot\" to assist a driver. This will be in Volkswagen's concept I.D. Buzz vehicle, a retro-styled microbus .\nOn Sunday, Nvidia also announced plans to create a production-ready AI autonomous vehicle system designed for China, in collaboration with Chinese internet giant Baidu and German car parts maker ZF.\nIt's based on the Nvidia Drive Xavier platform, a chip and software system that allows fully autonomous driving. Xavier was teased last year. But the Baidu announcement is the first real commercial application.\nThe driverless car system created by the three companies will use Xavier from Nvidia, sensors and cameras from ZF, and Baidu's autonomous software system called Apollo Pilot .", "external_links": [], "published": "2018-01-08T09:58:00.000+02:00", "crawled": "2018-01-08T09:58:19.009+02:00", "highlightTitle": ""}