{"organizations": [], "uuid": "2a2620efc4869a1aa040fce2e8c0e0d867afb177", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/small-businesses-react-to-donald-trumps-first-state-of-the-union.html", "country": "US", "domain_rank": 767, "title": "Small businesses react to Donald Trump's first State of the Union", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-31T21:22:00.000+02:00", "replies_count": 0, "uuid": "2a2620efc4869a1aa040fce2e8c0e0d867afb177"}, "author": "Kate Rogers", "url": "https://www.cnbc.com/2018/01/31/small-businesses-react-to-donald-trumps-first-state-of-the-union.html", "ord_in_thread": 0, "title": "Small businesses react to Donald Trump's first State of the Union", "locations": [], "entities": {"persons": [{"name": "mcnamee", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "national federation of independent businesses", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On the heels of a year that saw record optimism on both Main Street and Wall Street, President Donald Trump delivered his first State of the Union address Tuesday.\nSmall business owners and advocates were listening closely as Trump touted first-year successes, including overhauling the U.S. tax code and enacting a deregulatory agenda, both of which helped to boost confidence at American small businesses.\nTax reform, including a drop in both the corporate rate and a pass-through deduction, has been well-received by advocacy groups, which were largely supportive of the President's address.\nThe conservative National Federation of Independent Businesses reported that its monthly read on sentiment in the business community had its best yearly average ever in 2017, in part due to the Tax Cuts and Jobs Act and deregulation.\n\"Following the enactment of the Tax Cuts and Jobs Act, President Trump reiterated his commitment to growing the economy by reducing costly regulatory burdens that have been plaguing small business. 2017 displayed a historic level of optimism among small business owners, and that is a direct reflection of the positive small business policies enacted over the last year,\" Juanita Duggan, president and CEO of the NFIB, said in a statement.\nThat sentiment is echoed by entrepreneurs like Sean Falk, a franchisee of two Great American Cookie locations and one Pretzelmaker across Kentucky and Tennessee. Not only will the tax break help his employees and his business, he's anticipating that his customers will have more cash on hand and is hopeful that will boost his bottom line.\n\"I saw the effects of the tax changes in my employees' checks for 2018 and I can only imagine the sort of effect that will have on my customers as well,\" Falk said. \"Trump has given us more confidence to raise wages and invest more in capital.\"\nInvesting in infrastructure Beyond taking a victory lap on tax reform, the President also revealed plans to invest $1.5 trillion in infrastructure projects, opening up opportunities for private sector job growth with work on roads and bridges, and shortening the time frame for getting projects approved and off the ground.\nFor Tana Greene, CEO of technology and staffing firm Greene Group, the announcement was welcome news. The Cornelius, North Carolina-based company derives half of its business from staffing truck drivers.\n\"I think it is 100 percent needed to cut down the time frame to two years to get a road approved — it is ridiculous what it takes now,\" Greene said. \"Our drivers get paid by the mile and they are sitting in traffic and blowing out tires. It is easier to be an Uber driver today than it is a truck driver.\"\nThe nonpartisan National Small Business Association is hopeful an overhaul will also include many opportunities for small businesses, taking the opportunity to highlight difficulties they currently face in doing work with the federal government.\n\"Doing business with the federal government is an extremely convoluted process for small businesses, and any kind of broad spending initiative that seeks innovative approaches must make small-business involvement a pillar, and remove barriers to their participation,\" said Todd McCracken, NSBA president and CEO, in a statement.\nMore work to be done Despite positive feedback, advocates point out there is still much work to be done in Washington to continue to foster growth at America's small businesses. The nonpartisan Small Business & Entrepreneurship Council spoke out in support of increasing bipartisanship to further a pro-business agenda including further deregulation, reigning in healthcare costs and more.\n\"Building on his policy successes by advancing the next layer of small business priorities will fuel the dynamism and energy that our economy needs to extend opportunity and the promise of the American dream to everyone,\" said Karen Kerrigan, SBE Council President in a statement.\n\"That agenda includes additional work to lower regulatory barriers, improve capital access, encourage investment, lower health care costs on small businesses, and create more opportunities for entrepreneurs and business owners to expand their firms.\"\nDon't miss: Thanks in part to Trump's tax reform, franchise industry is set for another year of major growth\nshow chapters Where the jobs are: Trump's first year impact 8:38 AM ET Fri, 5 Jan 2018 | 01:49 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-31T21:22:00.000+02:00", "crawled": "2018-01-31T21:21:52.028+02:00", "highlightTitle": ""}