{"organizations": [], "uuid": "5d46022df3c6c38feca81c954f39a61044624253", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940939-GettyImages-890477606.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/north-korean-nuke-test-site-showing-significant-tunneling-activity.html", "country": "US", "domain_rank": 767, "title": "North Korean nuke test site showing 'significant tunneling' activity", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-11T19:47:00.000+02:00", "replies_count": 0, "uuid": "5d46022df3c6c38feca81c954f39a61044624253"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/11/north-korean-nuke-test-site-showing-significant-tunneling-activity.html", "ord_in_thread": 0, "title": "North Korean nuke test site showing 'significant tunneling' activity", "locations": [], "entities": {"persons": [{"name": "north", "sentiment": "none"}, {"name": "johns", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "west portal", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Significant tunneling\" excavation is underway at North Korea's Punggye-ri nuclear test site and shows the regime's continued efforts to maintain the site for potential future nuclear testing, a think tank specializing in tracking North Korean activities reported Thursday.\nIt follows reports in October that the test site is unstable and experienced tunnel collapses that have killed several hundred North Korean laborers.\nThe report on the 38 North website was based on an analysis of new commercial satellite images released of Punggye-ri, where the North Koreans have conducted the last six underground nuclear tests. It said throughout December 2017, there were \"mining carts and personnel\" as well as what appeared to be a \"spoil pile\" that had been greatly expanded at the test facility's west portal.\nThe test site's north portal, used in the last five nuclear tests, \"remains dormant,\" but there's new activity at the west portal, according to the 38 North, a think tank at Johns Hopkins School of Advanced International Studies. Yet, it said there appears to be draining going on at the entrance to this portal.\nThe last nuclear test at Punggye-ri was conducted in September. Pyongyang claimed that blast was a miniaturized hydrogen weapon designed for an intercontinental ballistic missile.\nDigitalGlobe | 38 North | Getty Images On December 28, 2017, large numbers of personnel are observed at the Southern Support Area, located south of the Command Center Area. In October, Japan's Asahi TV reported that as many as 200 North Korean workers may have been killed in a tunnel collapse at the nuclear test site. Also, at least four defectors from North Korea have shown signs of radiation exposure , Reuters reported last month.\nIn Thursday's report, 38 North said about 100 to 200 people were observed in satellite images taken Dec. 28 in a \"Southern Support Area,\" which it said rarely has such activity. And it said \"the purpose of their activities is unknown.\"\nThe new analysis of the Punggye-ri satellite imagery was done by Frank Pabian, Joseph Bermudez Jr. and Jack Liu, the 38 North website said. They concluded that the recent activity is a sign that the regime will maintain the facility.\nThe recent activity at the Punggye-ri nuclear test site comes on the heels of North and South Korean negotiators meeting Tuesday at the Demilitarized Zone. It was the first high-level talks between the two countries since late 2015.\nThe negotiations resulted in Pyongyang agreeing to send a delegation of athletes to the upcoming Winter Olympic Games in PyeongChang, South Korea. The two sides also agreed to reinstate a military hotline and to hold future talks, although no deal was reached on denuclearization.\nAlso, South Korea's Yonhap news agency reported Thursday that the Chinese President Xi Jinping had a 30-minute phone conversation with South Korean President Moon Jae-in and they jointly agreed \"to continue working together to peacefully resolve the North Korean nuclear issue.\"", "external_links": [], "published": "2018-01-11T19:47:00.000+02:00", "crawled": "2018-01-11T19:50:43.022+02:00", "highlightTitle": ""}