{"organizations": [], "uuid": "429a4766270a30064e15da3b0159bac1e6d8ae09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225573801&w=1200&r=LYNXMPEE0P17B", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-trade-wto/u-s-gives-davos-trade-meeting-no-clues-on-ending-wto-crisis-idUSKBN1FF2KZ", "country": "US", "domain_rank": 408, "title": "U.S. gives Davos trade meeting no clues on ending WTO crisis", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T03:28:00.000+02:00", "replies_count": 0, "uuid": "429a4766270a30064e15da3b0159bac1e6d8ae09"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-trade-wto/u-s-gives-davos-trade-meeting-no-clues-on-ending-wto-crisis-idUSKBN1FF2KZ", "ord_in_thread": 0, "title": "U.S. gives Davos trade meeting no clues on ending WTO crisis", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "robert lighthizer", "sentiment": "negative"}, {"name": "marie-gabrielle ineichen-fleisch", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lighthizer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "wto", "sentiment": "negative"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - U.S. Trade Representative Robert Lighthizer gave no clue at a meeting with 28 other envoys on Friday about what price the United States might set for dropping a veto that is threatening to cripple the World Trade Organization (WTO).\nWith U.S. President Donald Trump demanding a “fair deal” in international trade and frictions with China increasing, Washington is blocking the appointment of judges to the WTO’s Appellate Body, hobbling what is effectively the supreme court of global trade.\nThe court needs a minimum of three members to function. It normally has seven judges but it is now down to four and will shrink to three in September and faces a huge backlog of complex trade disputes.\nMany trade ministers and ambassadors attending a closed-door meeting on Friday in the Swiss resort of Davos expressed “particular concern” about the situation, Swiss State Secretary Marie-Gabrielle Ineichen-Fleisch said in her published concluding remarks.\n“Virtually everyone mentioned it (the U.S. veto). The only one who didn’t mention it was Lighthizer,” said one attendee, speaking on condition of anonymity.\nThe traditional Davos “mini-ministerial” is often the occasion for ambitious initiatives. But this year’s conclave, just a month after the WTO’s failed two-yearly conference in Buenos Aires, produced no new ideas.\nThe WTO is in trouble because negotiations are stuck, the existing trade rules are getting outdated, and trade friction between the United States and China is threatening to turn into a damaging clash of the Titans.\nFILE PHOTO: U.S. Trade Representative Robert Lighthizer speaks at a news conference in Washington, United States, Aug. 16, 2017. REUTERS/Aaron P. Bernstein/File Photo At the Buenos Aires meeting, the U.S. refusal to continue talks on global trade reforms forced the WTO to accept a splintering of negotiations into smaller coalitions, which Lighthizer welcomed.\nAt the Davos session he spoke in favor of reform possibilities that could be undertaken by a subset of the WTO’s 164 members, the official who attended the meeting said.\n“He was very encouraging,” the official added.\nWTO Director-General Roberto Azevedo told the Davos meeting that the Buenos Aires outcome had been disappointing, and the WTO membership needed to act if they wanted to have global trade negotiations, not just pledge their support.\n“We need to find ways to avoid repeating unsuccessful approaches and reaching the same unsatisfactory result,” he said, according to a transcript published by the WTO.\nBut he welcomed the smaller group efforts, which are focusing on e-commerce, investment facilitation, micro-, small- and medium-sized enterprises, and women’s economic empowerment.\nThose present at the Davos meeting included European Trade Commissioner Cecilia Malmstrom. But India’s Minister of Commerce Suresh Prabhu, who was also in Davos for the annual World Economic Forum, did not attend the trade talks, leaving India represented by its WTO ambassador.\nIndia plans to hold its own mini-ministerial of WTO members in March.\nReporting by Tom Miles; Editing by Gareth Jones\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T03:28:00.000+02:00", "crawled": "2018-01-27T00:06:24.001+02:00", "highlightTitle": ""}