{"organizations": [], "uuid": "b624d2858ab0a8c801b7ac815b9d07589a13c8df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976805-GettyImages-905976212.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/cryptocurrencies-join-the-global-financial-market-sell-off-as-bitcoin-drops-7-percent.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrencies join the global financial market sell-off as bitcoin drops 7%", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.201, "site_type": "news", "published": "2018-01-30T18:49:00.000+02:00", "replies_count": 0, "uuid": "b624d2858ab0a8c801b7ac815b9d07589a13c8df"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/30/cryptocurrencies-join-the-global-financial-market-sell-off-as-bitcoin-drops-7-percent.html", "ord_in_thread": 0, "title": "Cryptocurrencies join the global financial market sell-off as bitcoin drops 7%", "locations": [], "entities": {"persons": [{"name": "benjamin roberts", "sentiment": "none"}, {"name": "coinmarketcap", "sentiment": "none"}, {"name": "jack guez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "citizen hex", "sentiment": "none"}, {"name": "coindesk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin drops 12%, falls below $10,000 amid broad cryptocurrency sell-off Bitcoin plunges 12 percent to $9,817, according to CoinDesk. Ethereum, ripple, stellar and other cryptocurrencies also sell off. Benjamin Roberts, co-founder and CEO of Citizen Hex, an ethereum-focused start-up, attributes the declines to uncertainty around bitcoin's ability to improve transaction efficiency and the future development of ethereum. 2 Hours Ago | 00:46 \nDigital currency bitcoin fell Tuesday as the 20 largest digital currencies by market capitalization all declined, according to CoinMarketCap. \nBitcoin traded 12 percent lower near $9,817 as of 1:19 p.m. ET, according to CoinDesk's bitcoin price index, which tracks prices from digital currency exchanges Bitstamp, Coinbase, itBit and Bitfinex. \nBitfinex was subpoenaed by the U.S. Commodity Futures Trading Commission last week, Bloomberg reported, citing a source, midday Tuesday. Tether, which claims to link its coins to major government-backed currencies, was also subpoenaed, the report said. The companies and the commission did not immediately respond to a CNBC request for comment. \nTotal market cap of cryptocurrencies, excluding bitcoin, over the last seven days \nSource: CoinMarketCap \nEthereum , the second-largest digital currency by market cap, traded about 9 percent lower, near $1,073, according to CoinMarketCap. The third-largest cryptocurrency, ripple , fell about nearly 10 percent to $1.19, the website showed. \nStellar, down from sixth place to eighth place by market cap, was among the greatest decliners, trading 17 percent lower to around 49 cents, according to CoinMarketCap. \nThere was no significant driver behind the widespread drop late Tuesday morning. South Korea's Financial Service Commission did confirm to CNBC that new measures, such as bans on anonymous trading accounts, had been implemented. The U.S. Securities and Exchange Commission also announced Tuesday it obtained a court order to freeze the assets of an initial coin offering claiming to have raised $600 million. \nU.S. Treasury Secretary Steven Mnuchin said Tuesday in an address to the Senate Banking, Housing and Urban Affairs Committee that the Treasury wants to make sure cryptocurrencies are not used by money launderers. \"I also want to make sure that consumers understand the issues around cryptocurrencies,\" Mnuchin said. \nBenjamin Roberts, co-founder and CEO of Citizen Hex, an ethereum-focused start-up backed by three Canadian venture funds, attributed the sell-off to uncertainty around bitcoin's ability to improve transaction efficiency and the future development of ethereum. While both are based on blockchain technology, ethereum allows developers to build applications on top of it. \nRoberts expects ethereum will become the dominant cryptocurrency this year. \"We'll continue to see volatility measured in dollars until [ethereum] has significantly topped the bitcoin platform in terms of market cap,\" he said. \nAs of early Tuesday afternoon, Bitcoin had a market cap of about $170 billion and is down about 28 percent this month, while ethereum is up about 42 percent. It has a market cap of about $104 billion, according to CoinMarketCap. WATCH: Bitcoin could be the biggest bubble in history – here's how show chapters ", "external_links": [], "published": "2018-01-30T18:49:00.000+02:00", "crawled": "2018-01-30T18:49:25.003+02:00", "highlightTitle": ""}