{"organizations": [], "uuid": "05e286bfe5e78e244211d0f879207f67fbbb63c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976557-365_FTG_Exterior.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/with-stores-going-dark-whole-foods-looks-to-fill-retails-gaps.html", "country": "US", "domain_rank": 767, "title": "With stores going dark, Whole Foods looks to fill retail's gaps", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.03, "site_type": "news", "published": "2018-01-31T19:10:00.000+02:00", "replies_count": 0, "uuid": "05e286bfe5e78e244211d0f879207f67fbbb63c9"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/31/with-stores-going-dark-whole-foods-looks-to-fill-retails-gaps.html", "ord_in_thread": 0, "title": "With stores going dark, Whole Foods looks to fill retail's gaps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new grocery store is coming to town, and the timing of it couldn't be better for real estate owners.\nWhile other supermarket chains shutter stores, scale back on expansion plans or choose not to renew leases, Whole Foods is planting more stores across the U.S. The grocer has long been a favored tenant in the retail real estate world — being a traffic driver to shopping centers and always paying rent on time — and an acquisition by Amazon only made the Whole Foods name more popular.\nNow, Whole Foods is looking to go after a lower-income household in creating stores that primarily carry less-expensive goods.\nThe Austin, Texas-based chain on Wednesday brought its first 365-branded store to the East Coast, in New York. The Brooklyn location, on the ground floor of a residential building, marks the seventh in the country. Sixteen stores are in the pipeline, according to its website .\nWhole Foods' expansion plans are welcomed by an industry of real estate owners looking to fill vacated spaces along strip centers and even within malls. The retailer is known for being selective in choosing where to plant its stores (it has far fewer locations than Kroger or Albertsons ), but it sees a bigger opportunity to tap the pockets of cost-conscious customers. This is just one of the reasons Whole Foods is looking to grow.\nUnlike a traditional Whole Foods store, the 365 locations are smaller in size — 30,000 square feet, compared with 43,000 square feet on average — and target customers with a more curated selection of items from local vendors. The Brooklyn location, for example, will host a local juice bar and burger joint, among other restaurant options.\nSource: Whole Foods The first Whole Foods Market 365 location on the East Coast and the seventh in the country opens Wednesday, January 31 in Fort Greene, Brooklyn. There is a much bigger emphasis (hence the name) on Whole Foods' private-label line, known as 365, in these stores, but there are also other national brands on display throughout. The key theme, a Whole Foods spokesman explained to CNBC, is value, and keeping prices low.\nFrom a landlord's perspective, the 365 concept is especially attractive in that it should draw repeat customers. Some would say it's similar to Trader Joe's, which has been wildly successful in amassing a loyal base of customers who shop there for exclusivity.\nAnd the 365 stores could carry the same clout as Trader Joe's — where retailers and restaurants near one of those locations benefit from a spillover effect, as shoppers stick around the shopping center to make other purchases.\n\"The Whole Foods-branded supermarkets have always been in demand by landlords in shopping centers,\" Ken Gold, CEO of Ohio-based real estate developer Skilken Gold , told CNBC. \"It's very similar to when Apple opens up a store within the mall. ... It allows the landlord to attract higher-end tenants and also allows them to maintain higher rents.\"\n\"The dominant grocery chain in any market is always an excellent asset to own,\" Gold added. \"You want to deal with the strong players who are OK with change, they are relevant, and they have the best credit on Wall Street.\"\nAdditionally, the smaller blueprint for 365 allows Whole Foods to be more nimble and strategic in where it moves. The mold will give the company more opportunities to slide into a glut of vacant retail spaces without so many capital-intensive renovations or property build-outs.\nOne home for 365 could be inside Kohl's . The department store, which is already one of Amazon's allies, plans to allocate space in its stores for grocery or convenience tenants as it scales back some of its inventory, thereby freeing up floor space. CNBC couldn't immediately determine whether Whole Foods is one of Kohl's partners.\n\"Whole Foods is the belle of the ball,\" Peter Ripka, the co-founder of New York-based Ripco Real Estate , told CNBC. \"And Amazon only ... made that statement even more true because they have a lot of gravitas these days.\"", "external_links": [], "published": "2018-01-31T19:10:00.000+02:00", "crawled": "2018-01-31T19:10:14.015+02:00", "highlightTitle": ""}