{"organizations": [], "uuid": "4360b195d8dc8a6c69058911887f136f41e4a3d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224462048&w=1200&r=LYNXMPEE0M0WV", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-russia-venturefunds/russian-tech-investors-set-up-shop-in-silicon-valley-idINKBN1FC1KS", "country": "US", "domain_rank": 408, "title": "Russian tech investors set up shop in Silicon Valley", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:24:00.000+02:00", "replies_count": 0, "uuid": "4360b195d8dc8a6c69058911887f136f41e4a3d8"}, "author": "", "url": "https://in.reuters.com/article/us-russia-venturefunds/russian-tech-investors-set-up-shop-in-silicon-valley-idINKBN1FC1KS", "ord_in_thread": 0, "title": "Russian tech investors set up shop in Silicon Valley", "locations": [], "entities": {"persons": [{"name": "masha", "sentiment": "none"}, {"name": "masha drokova", "sentiment": "none"}, {"name": "serguei beloussov", "sentiment": "none"}, {"name": "drokova", "sentiment": "none"}], "locations": [{"name": "silicon va", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "day one ventures", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "runa capital", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (Reuters) - Masha Drokova, a 28-year-old Russian political activist turned venture capitalist, on Tuesday joined a small family of Russian nationals who have set up shop as Silicon Valley venture investors.\nDrokova’s new firm, Day One Ventures, will make investments of $100,000 to $1 million from a fund that initially totals nearly $50 million, a person familiar with the matter said. Drokova hopes her experience as an angel investor and a prior career in public relations will give her edge.\n“Masha knows a lot of people,” said Serguei Beloussov, a senior investing partner at venture firm Runa Capital and who worked with Drokova until 2014. “She is good in that she gets access to very good startups.”\nDrokova’s new fund comes as relations between the United States and Russia remain fraught and foreign investments of all types into U.S. technology companies receive more scrutiny.\nShe is following the lead of several other Russian investors who say that being based in the United States - and raising money from wealthy individuals rather than institutions - helps them get better access to startups and curtails concerns about the source of their money, even if some of it still comes from Russia.\nClose to 20 percent of Runa Capital’s $135 million fund comes from wealthy Russian individuals, said Beloussov, who is Russian-born but now a Singapore citizen. Silicon Valley firm GVA Capital, managed by Russian native Pavel Cherkashin, has raised money from individuals in Russia, Ukraine, Kazakhstan and Georgia.\nRussian-born Masha Drokova, 28, poses in this handout photo provided January 22, 2018. Courtesy of Day One Ventures/Handout via REUTERS “There is a growing number of funds like us - Russian-speaking fund managers in the U.S. but sourcing checks from Russia and the former Soviet Union,” said Cherkashin. “That trend is growing.”\nCherkashin estimates startup investments from U.S.-based fund managers who raise capital from Russia has more than tripled over the last three years. This would include a 2016 investment in Uber by FortRoss Ventures, which has an office in Silicon Valley and whose funds come mostly from Russian investors, including state-owned Sberbank.\nDrokova said her fund comes from individual entrepreneurs in the United States and Europe.\nDrokova spent five years as a leader of a Kremlin-backed youth political movement in Russia called Nashi before moving to the United States at age 23. She now describes her political views as “liberal” and says she is no longer involved in Russian politics.\nDrokova said her nationality and political work have not yet posed any challenges in her new career. But other Russians who have venture firms in Silicon Valley say they still run into obstacles, including extra scrutiny when they try to open U.S. bank accounts.\nSergey Gribov of Flint Capital, a venture firm whose partners are Russian-born but does not raise money in Russia, said he discloses all the details of his funding sources to head off suspicions.\n“From time to time it comes up,” he said. “I would say it helps to be transparent.”\nReporting by Heather Somerville; Editing by Jonathan Weber and Leslie Adler\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-23T22:24:00.000+02:00", "crawled": "2018-01-23T22:38:53.019+02:00", "highlightTitle": ""}