{"organizations": [], "uuid": "9388c84988e40608beb7a581c7c5d3b12392e480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-posts-near-1-week-high-ahead-of-potential-rate-hike-idUSL1N1PA108", "country": "US", "domain_rank": 408, "title": "CANADA FX DEBT-C$ posts near 1 week high ahead of potential rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.221, "site_type": "news", "published": "2018-01-16T05:41:00.000+02:00", "replies_count": 0, "uuid": "9388c84988e40608beb7a581c7c5d3b12392e480"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-posts-near-1-week-high-ahead-of-potential-rate-hike-idUSL1N1PA108", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ posts near 1 week high ahead of potential rate hike", "locations": [], "entities": {"persons": [{"name": "scott lampard", "sentiment": "none"}, {"name": "fergal smith", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds dealer Quote: s and background details; updates prices) * Canadian dollar at C$1.2425, or 80.48 U.S. cents * Loonie touches its strongest since Tuesday at C$1.2403 * Bond prices lower across much of the yield curve By Fergal Smith TORONTO, Jan 15 (Reuters) - The Canadian dollar strengthened to a nearly one-week high against its U.S. counterpart on Monday as the greenback broadly fell and investors braced for a potential interest rate increase by the Bank of Canada this week. At 4 p.m. EST (2100 GMT), the Canadian dollar was trading at C$1.2425 to the greenback, or 80.48 U.S. cents, up 0.3 percent. The currency touched its strongest since Tuesday at C$1.2403. The central bank will kick off 2018 by raising interest rates, buoyed by robust job growth, even as uncertainty around the fate of the North American Free Trade Agreement lingers, a Reuters poll found. \"It is not so much the actual move this week that is going to cause the market reaction, it is the narrative around it and what does that mean for the future path of rates,\" said Scott Lampard, head of global markets at HSBC Bank Canada. Money markets expect a rate increase on Wednesday and at least two more by the end of the year. But the central bank may raise rates at a slower pace than that due to worries about the impact of higher interest rates on heavily indebted consumers, Lampard said. Canadian household debt as a share of income reached a record high of 171.1 percent in the third quarter. The U.S. dollar fell against a basket of major currencies as expectations that the European Central Bank will tighten monetary policy helped boost the euro. Speculators have raised bullish bets on the Canadian dollar for the first time in three weeks, data from the U.S. Commodity Futures Trading Commission and Reuters calculations showed on Friday. Lending to Canadian small businesses perked up in November after declining for the past six months, data showed. Resales of Canadian homes rose 4.5 percent in December from November, the fifth straight monthly rise, likely because activity was pulled forward to avoid mortgage rule changes that hit in January, the Canadian Real Estate Association said. The price of oil, one of Canada's major exports, hovered near a three-year high on signs that production cuts by OPEC and Russia are tightening supplies. U.S. West Texas Intermediate crude futures gained 51 cents to $64.81 a barrel. Canadian government bond prices were lower across much of the yield curve, with the two-year down 3 Canadian cents to yield 1.775 percent and the 10-year falling 10 Canadian cents to yield 2.188 percent. (Reporting by Fergal Smith; Editing by Nick Zieminski)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T05:41:00.000+02:00", "crawled": "2018-01-16T13:16:41.027+02:00", "highlightTitle": ""}