{"organizations": [], "uuid": "a2c65a7983d5927b11611d04cdcb8cbe95a68f2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-pacific-coast-oil-trust-announces-february-cash-distribution.html", "country": "US", "domain_rank": 767, "title": "Pacific Coast Oil Trust Announces February Cash Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:15:00.000+02:00", "replies_count": 0, "uuid": "a2c65a7983d5927b11611d04cdcb8cbe95a68f2d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-pacific-coast-oil-trust-announces-february-cash-distribution.html", "ord_in_thread": 0, "title": "Pacific Coast Oil Trust Announces February Cash Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "pacific", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "orcutt hill", "sentiment": "none"}], "organizations": [{"name": "pacific coast oil trust", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "pcec", "sentiment": "none"}, {"name": "pacific coast energy company lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- PACIFIC COAST OIL TRUST (NYSE:ROYT) (the “Trust”), a royalty trust formed by Pacific Coast Energy Company LP (“PCEC”), announced today a cash distribution to the holders of its units of beneficial interest of $0.01635 per unit, payable on February 20, 2018 to unitholders of record on February 5, 2018. The Trust’s distribution calculation relates to net profits and overriding royalties generated during December 2017 as provided in the conveyance of net profits and overriding royalty interest.\nThe current month’s calculation for the Developed Properties resulted in $1.3 million of revenues less direct operating expenses and development costs. The current month’s revenues were $4.2 million, lease operating expenses including property taxes were $2.2 million and capital expenditures were $0.7 million. For the year ended December 31, 2017, PCEC’s capital expenditures were approximately $1 million greater than budget primarily due to (i) over-budget expenditures in connection with the replacement of the oil export pipeline at Orcutt Hill and DOGGR-mandated injector casing upgrades and (ii) unbudgeted well abandonments at Orcutt Diatomite which were required to allow POD 2 to resume cyclic steaming and expenditures to increase water injection capacity at West Pico. Average realized prices for the Developed Properties were $60.55 per Boe in December, as compared to $58.96 per Boe in November. Net profits for the month of December for the Developed Properties were $1.0 million.\nThe current month’s calculation included $62,000 for the 7.5% overriding royalty on the Remaining Properties from Orcutt Diatomite and Orcutt Field. Average realized prices for the Remaining Properties were $57.87 per Boe in December, as compared to $56.32 per Boe in November. The cumulative net profits deficit for the Remaining Properties, including the 7.5% overriding royalty payments, decreased $66,000 and totals $1.6 million for December.\nThe net cash flow available for distribution to the holders of units of beneficial interest is approximately $0.6 million. The proceeds expected to be received by the Trust in February of $1.1 million consist of $1.0 million in income from the Developed Properties and approximately $62,000 in income from the 7.5% overriding royalty on the Remaining Properties. The proceeds to be received by the Trust will be partially offset by $89,000 for the monthly operating and services fee payable to PCEC and $365,000 in Trust general and administrative expenses (primarily audit and tax related fees) resulting in the net cash flow available for distribution of approximately $0.6 million.\nSales Volumes and Prices\nThe following table displays PCEC’s underlying sales volumes and average prices for the month of December 2017:\nUnderlying Properties Sales Volumes Average Price (Boe) (per Boe) Developed Properties (a) 69,414 $ 60.55 Remaining Properties (b) 15,380 $ 57.87 (a) Crude oil sales represented 99% of sales volumes (b) Crude oil sales represented 100% of sales volumes West Pico Natural Gas Export Line Update\nDue to a temporary shutdown downstream of the natural gas export pipeline from West Pico, West Pico has had to temporarily shut in select wells to limit the amount of associated gas produced from oil production. West Pico net production attributable to the Developed Properties prior to the shutdown was approximately 320 Boe/d (approximately 260 Boe/d net to the Trust). During the shutdown months, which began in December 2017 and are expected to last through early 2018, production is down by approximately 40%. Following the return to service of the natural gas export line, West Pico is expected to return production to levels similar to those prior to the shutdown months.\nOverview of Trust Structure\nPacific Coast Oil Trust is a Delaware statutory trust formed by PCEC to own interests in certain oil and gas properties in the Santa Maria Basin and the Los Angeles Basin in California (the “Underlying Properties”). The Underlying Properties and the Trust’s net profits and royalty interests are described in the Trust’s filings with the Securities and Exchange Commission (the “SEC”). As described in the Trust’s filings with the SEC, the amount of any periodic distributions is expected to fluctuate, depending on the proceeds received by the Trust as a result of actual production volumes, oil and gas prices, development expenses, and the amount and timing of the Trust’s administrative expenses, among other factors. For additional information on the Trust, please visit www.pacificcoastoiltrust.com .\nCautionary Statement Regarding Forward-Looking Information\nThis press release contains statements that are \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. All statements contained in this press release, other than statements of historical facts, are \"forward-looking statements\" for purposes of these provisions. These forward-looking statements include the amount and date of any anticipated distribution to unitholders, the expected length of the shutdown of select wells in West Pico, and the expected production levels of those wells following their return to service. The anticipated distribution is based, in part, on the amount of cash received or expected to be received by the Trust from PCEC with respect to the relevant period. Any differences in actual cash receipts by the Trust could affect this distributable amount. The amount of such cash received or expected to be received by the Trust (and its ability to pay distributions) has been and will be significantly and negatively affected by prevailing low commodity prices, which have declined significantly, could decline further and could remain low for an extended period of time. Other important factors that could cause actual results to differ materially include expenses of the Trust and reserves for anticipated future expenses. Statements made in this press release are qualified by the cautionary statements made in this press release. Neither PCEC nor the Trustee intends, and neither assumes any obligation, to update any of the statements included in this press release. An investment in units issued by Pacific Coast Oil Trust is subject to the risks described in the Trust's Annual Report on Form 10-K for the year ended December 31, 2016 filed with the SEC on March 10, 2017, and if applicable, the Trust’s subsequent Quarterly Reports on Form 10-Q. The Trust's Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q are available over the Internet at the SEC's website at http://www.sec.gov .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005481/en/\nPacific Coast Oil Trust\nThe Bank of New York Mellon Trust Company, N.A., as Trustee\nSarah Newell, 1-512-236-6555\nSource: Pacific Coast Oil Trust", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51749604&newsitemid=20180126005481&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=a595e73b96c101aa019772994f8e361a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pacificcoastoiltrust.com&esheet=51749604&newsitemid=20180126005481&lan=en-US&anchor=www.pacificcoastoiltrust.com&index=1&md5=22c6567606d2bdae1ed3382c60d09077", "http://www.businesswire.com/news/home/20180126005481/en/"], "published": "2018-01-27T00:15:00.000+02:00", "crawled": "2018-01-27T02:20:24.012+02:00", "highlightTitle": ""}