{"organizations": [], "uuid": "8da2419121ee93686710dbd44b2640d736975487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sierra-bancorp-announces-agreement-to-acquire-lompoc-branch-from-community-bank-of-santa-maria.html", "country": "US", "domain_rank": 767, "title": "Sierra Bancorp Announces Agreement to Acquire Lompoc Branch from Community Bank of Santa Maria", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.216, "site_type": "news", "published": "2018-01-23T16:01:00.000+02:00", "replies_count": 0, "uuid": "8da2419121ee93686710dbd44b2640d736975487"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-sierra-bancorp-announces-agreement-to-acquire-lompoc-branch-from-community-bank-of-santa-maria.html", "ord_in_thread": 0, "title": "Sierra Bancorp Announces Agreement to Acquire Lompoc Branch from Community Bank of Santa Maria", "locations": [], "entities": {"persons": [{"name": "sie", "sentiment": "negative"}, {"name": "kevin mcphaill", "sentiment": "none"}], "locations": [{"name": "maria porterville", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "lompoc", "sentiment": "none"}, {"name": "sierra grant program", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "bank of the sierra", "sentiment": "negative"}, {"name": "sierra bancorp announces agreement to acquire lompoc branch", "sentiment": "negative"}, {"name": "community bank of santa", "sentiment": "negative"}, {"name": "community bank of santa maria", "sentiment": "none"}, {"name": "community bancorp of santa maria", "sentiment": "none"}, {"name": "rra bancorp", "sentiment": "none"}, {"name": "sierra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTERVILLE, Calif., Jan. 23, 2018 /PRNewswire/ -- Bank of the Sierra, the banking subsidiary of Sierra Bancorp (NASDAQ:BSRR), announced that it has entered into an agreement with Community Bank of Santa Maria, the banking subsidiary of Community Bancorp of Santa Maria (OTCQX:CYSM), to acquire an estimated $35 million in deposits and certain assets of a branch of Community Bank of Santa Maria located in Lompoc, California. Bank of the Sierra's purchase is scheduled for completion Spring 2018, pending regulatory approval.\nBank of the Sierra President and CEO, Kevin McPhaill, is enthusiastic about the acquisition. \"We are excited to expand our footprint in Santa Barbara County and provide outstanding financial services to the residents and businesses of the Lompoc area. Our team is working diligently to ensure the transition is as smooth as possible. Being a good community partner is much more than occupying a building in a city. We strive to support every community we serve, through volunteerism, reinvestment, and charitable giving through our Sierra Grant Program, and we look forward to serving the community of Lompoc.\"\nJanet Silveria, President and CEO of Community Bank of Santa Maria commented that the transaction is a strategic move for both organizations. \"Community Bank of Santa Maria has experienced tremendous growth in loans and deposits in our primary market of Santa Maria. This move provides us the opportunity to focus all our bank resources on that niche market and improves the overall financial strength of the organization.\"\nAbout Sierra Bancorp & Bank of the Sierra\nSierra Bancorp is the holding company for Bank of the Sierra ( www.bankofthesierra.com ), which is in its 41 st year of operations and is the largest independent bank headquartered in the South San Joaquin Valley. Bank of the Sierra is a community-centric regional bank, which offers a full range of retail and commercial banking services with full-service branches located within the counties of Tulare, Kern, Kings, Fresno, Los Angeles, Ventura, San Luis Obispo, and Santa Barbara. The bank also maintains an online branch, and provides specialized lending services through an agricultural credit center, a real estate industries center, and an SBA center. In 2018, Bank of the Sierra received a Bauer Financial 5-star rating, an honor only awarded to the strongest financial institutions in the country.\nAbout Community Bank of Santa Maria\nCommunity Bancorp of Santa Maria is the one-bank holding company of Community Bank of Santa Maria. Community Bank of Santa Maria opened for business on March 1, 2001, and currently operates three branches; two in Santa Maria, and their division, Lompoc Community Bank, in Lompoc. Community Bancorp of Santa Maria stock is traded on the OTCQX under the symbol CYSM.\nForward-Looking Statements\nThe statements contained in this release that are not historical facts are forward-looking statements based on management's current expectations and beliefs concerning future developments and their potential effects on the Company. Readers are cautioned not to unduly rely on forward looking statements. Actual results may differ from those projected. These forward-looking statements involve risks and uncertainties including but not limited to the health of the national and local economies, the Company's ability to attract and retain skilled employees, customers' service expectations, the Company's ability to successfully deploy new technology, the success of branch expansion, changes in interest rates, loan portfolio performance, the Company's ability to secure buyers for foreclosed properties, and other factors detailed in the Company's SEC filings, including the \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections of the Company's most recent Form 10-K and Form 10-Q.\nView original content with multimedia: http://www.prnewswire.com/news-releases/sierra-bancorp-announces-agreement-to-acquire-lompoc-branch-from-community-bank-of-santa-maria-300586313.html\nSOURCE Sierra Bancorp", "external_links": ["http://www.prnewswire.com/news-releases/sierra-bancorp-announces-agreement-to-acquire-lompoc-branch-from-community-bank-of-santa-maria-300586313.html", "http://www.bankofthesierra.com/"], "published": "2018-01-23T16:01:00.000+02:00", "crawled": "2018-01-23T18:23:58.000+02:00", "highlightTitle": ""}