{"organizations": [], "uuid": "4141dbb1d4c27d8f4bb28ad5d3c78a5fe69a8ea2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-hospitality-ventures-management-group-hvmg-appoints-sam-woodworth-to-newly-created-director-of-acquisitions-and-business.html", "country": "US", "domain_rank": 767, "title": "Hospitality Ventures Management Group (HVMG) Appoints Sam Woodworth to Newly Created Director of Acquisitions and Business Development Position", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T16:54:00.000+02:00", "replies_count": 0, "uuid": "4141dbb1d4c27d8f4bb28ad5d3c78a5fe69a8ea2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-hospitality-ventures-management-group-hvmg-appoints-sam-woodworth-to-newly-created-director-of-acquisitions-and-business.html", "ord_in_thread": 0, "title": "Hospitality Ventures Management Group (HVMG) Appoints Sam Woodworth to Newly Created Director of Acquisitions and Business Development Position", "locations": [], "entities": {"persons": [{"name": "sam woodworth", "sentiment": "neutral"}, {"name": "woodworth", "sentiment": "none"}, {"name": "mary beth cutshall", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hospitality ventures management group", "sentiment": "neutral"}, {"name": "hvmg", "sentiment": "none"}, {"name": "cornell university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA--(BUSINESS WIRE)-- Hospitality Ventures Management Group (HVMG), an Atlanta-based, private hotel investment, ownership and management company, has appointed Sam Woodworth as director of acquisitions and business development. In the newly created role, Woodworth will contribute to growing HVMG’s hotel portfolio through third-party management, acquisitions and new development deals.\n“We are excited to welcome Sam back to HVMG having previously worked together during his internship while pursuing his Master’s Degree at Cornell University. Sam’s passion for and knowledge of the hospitality industry is noteworthy, and his exposure to the transactional, franchise and management sides of the business gives him a valuable advantage in understanding the industry and owners’ needs and objectives for their properties,” said Mary Beth Cutshall, senior vice president and chief business development office, HVMG. “We continue to have an aggressive appetite for both third-party management opportunities and ownership of branded and independent hotels. I am confident Sam will be instrumental in helping HVMG achieve its business growth goals.”\nPrior to joining HVMG, Woodworth was manager of acquisitions and development for N.Y.-based Trump Hotels, where he helped expand the company’s luxury portfolio with the launch of two new hotel brands during 2016 and 2017. Prior to receiving his master’s degree, he served as a select-service investment analyst with JLL, a global commercial real estate services provider, and an associate with Ashford Advisors, an international financial services firm. Woodworth received his Master of Management in Hospitality with a minor in Real Estate from Cornell University’s School of Hotel Management and his Bachelor of Science in Management with a concentration in Finance from the Georgia Institute of Technology.\nAbout HVMG\nHospitality Ventures Management Group is a privately owned, fully-integrated hotel investment and management group that specializes in turning around and repositioning underperforming hotels as well as maximizing the performance of stabilized hotels. It currently operates 29 hotels in 16 states totaling 5,305 guest rooms. HVMG operates independent and boutique hotels and resorts, as well as full-service, select-service and extended-stay hotels under the Hilton, Marriott, Hyatt, Starwood and IHG brands. Visit www.hvmg.com for more information.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005257/en/\nDaly Gray, Inc.\nChris Daly, 703-435-6293\nchris@dalygray.com\nSource: Hospitality Ventures Management Group (HVMG)", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hvmg.com&esheet=51742799&newsitemid=20180116005257&lan=en-US&anchor=www.hvmg.com&index=1&md5=936a7d4a3a004c89a2c395512eb2b0e7", "http://www.businesswire.com/news/home/20180116005257/en/"], "published": "2018-01-16T16:54:00.000+02:00", "crawled": "2018-01-16T19:37:37.001+02:00", "highlightTitle": ""}