{"organizations": [], "uuid": "4cb4168bdb131208cfa0891ca5dbcc9492d89332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226354695&w=1200&r=LYNXMPEE0S18O", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-britain-trade/dogged-by-brexit-britain-stumbles-in-race-to-woo-china-idUKKBN1FI230", "country": "US", "domain_rank": 408, "title": "Dogged by Brexit, Britain stumbles in race to woo China", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:29:00.000+02:00", "replies_count": 0, "uuid": "4cb4168bdb131208cfa0891ca5dbcc9492d89332"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-britain-trade/dogged-by-brexit-britain-stumbles-in-race-to-woo-china-idUKKBN1FI230", "ord_in_thread": 0, "title": "Dogged by Brexit, Britain stumbles in race to woo China", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}, {"name": "matthew rous", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "china-britain business council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 4:29 PM / Updated 4 hours ago Dogged by Brexit, Britain stumbles in race to woo China William James , Andrew MacAskill 5 Min Read \nLONDON (Reuters) - Swamped by Brexit and weakened at home, Prime Minister Theresa May is starting to fall behind in the race to win Chinese investment and secure privileged access to China’s booming market for professional services. \nMay travels to China on Tuesday with a delegation of executives for meetings with Chinese leaders that will define where relations with the world’s second-largest economy sit on her lengthy ‘To Do’ list. \n“This is Britain’s moment,” said Matthew Rous, Chief Executive of the China-Britain Business Council. \nBritain is trying to reinvent itself as a global trading nation after deciding to leave the European Union in 2016, but Brexit has unnerved Beijing and May is perceived to be less keen on courting China than her predecessor, David Cameron. \nThe result is that the “Golden Era” of relations with China, which promised billions of pounds of investment into Britain and access to China’s demand for banking expertise already looks tarnished less than three years after the term was minted in London by President Xi Jinping. \n“There is a feeling that Brexit means that the government has taken its eye off the ball,” said one business leader who accompanied Chancellor Philip Hammond on a trip to the country last month. \n“It has not gone unnoticed in China. When I was out there recently there were lots of questions about this,” said the business leader, who spoke on condition of anonymity. \nBoth May and senior Chinese officials have restated their commitment to a golden relationship but a row over May’s decision to delay approval for a Chinese-funded nuclear plant in late 2016 chilled relations, while rivals like France and Germany have forged ahead. \n“We were already way behind. If you’re only half-heartedly, or not at all, taking them seriously you’re not going to get very far,” said Jim O‘Neill, a former Goldman Sachs chief economist who was drafted into Cameron’s government to help build ties with China. \nHe cited data showing that in 2016, China became Germany’s largest trade partner. \nBritish imports from, and exports to, China were worth nearly 60 billion pounds ($84.5 billion) in 2016, with a trade deficit of over 25 billion pounds, official data shows. \nThe target for Britain is to expand that partnership by tapping the growing demand for banking, legal other professional services as the China shifts to a more advanced economy. HORSE-TRADING \nFrench President Emmanuel Macron visited Beijing this month with an attention-grabbing gift - a horse - and a mission to reset trade relations, seeking a role for the EU in China’s trillion-dollar push to build a modern Silk Road. \nDealmakers leading the so-called ‘Belt and Road’ initiative are turning to the financial sector, targeting Europe’s banks, insurers and asset managers to tap funds and expertise. \n“British businesses have long-standing, extensive experience of the countries along the Belt and Road and know their legal systems inside out,” Rous said. \n“Meanwhile, China’s domestic markets are gradually opening up, presenting new opportunities in fintech, asset management, insurance and so on. So there is a great deal to play for.” \nThe challenge over the coming days will be threefold: reheat the diplomatic ties, convince Beijing to keep opening up its markets to British business, and dispel doubts that Brexit has made the country a less stable and attractive partner. \nMay is under political pressure at home over the EU divorce, balancing pro- and anti-Brexit factions, battling a parliament intent on rewriting her Brexit plan, and weakened in talks with Brussels over the terms of the exit. \nBut, Chinese officials have expressed unease about what Brexit could mean for Chinese firms. \nIn February 2017, China’s ambassador to London said Chinese companies operating in Britain, especially in the financial sector or whose European headquarters are in Britain, need to take “precautions” due to uncertainty over Brexit. \nSome Beijing-based diplomats say Macron’s visit, the first by European leader this year, was a sign that China is scoping out new allies in Europe. \n“China knows it’s going to need friends who are not going to be leaving the EU,” said one diplomat, speaking on condition of anonymity. Reporting by William James and Andrew MacAskill, additional reporting by Ben Blanchard in Beijing; Editing by Guy Faulconbridge", "external_links": [], "published": "2018-01-29T18:29:00.000+02:00", "crawled": "2018-01-29T19:11:34.003+02:00", "highlightTitle": ""}