{"organizations": [], "uuid": "56ef287da7347e3e34c4eca1eda5e78a1462f245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/mlk-day-broadsheet/", "country": "US", "domain_rank": 1196, "title": "Martin Luther King, Condoleezza Rice, Simone Biles: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.565, "site_type": "news", "published": "2018-01-16T09:50:00.000+02:00", "replies_count": 0, "uuid": "56ef287da7347e3e34c4eca1eda5e78a1462f245"}, "author": "Valentina Zarya", "url": "http://fortune.com/2018/01/16/mlk-day-broadsheet/", "ord_in_thread": 0, "title": "Martin Luther King, Condoleezza Rice, Simone Biles: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "valentina zarya", "sentiment": "negative"}, {"name": "simone biles", "sentiment": "negative"}, {"name": "martin luther king", "sentiment": "negative"}, {"name": "condoleezza rice", "sentiment": "negative"}, {"name": "michael dyson", "sentiment": "none"}, {"name": "bernard lee", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "gwendolyn zoharah simmons", "sentiment": "none"}, {"name": "dyson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cvs", "sentiment": "none"}, {"name": "sncc", "sentiment": "none"}, {"name": "student non-violent coordinating committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Valentina Zarya 7:50 AM EST \nGood morning, Broadsheet readers! Condoleezza Rice shares her thoughts on #MeToo, CVS makes a major announcement, and we reflect on MLK’s feminist legacy. Have a great Tuesday. EVERYONE'S TALKING \n• MLK’s feminist legacy. Yesterday, we celebrated Martin Luther King Jr. Day—a day that commemorates the American icon’s nonviolent activism on behalf of the civil rights movement. Dr. King’s legacy in combatting racial inequality is undisputed; he received the Nobel Peace Prize for his work in 1964. However, his relationship to women’s rights is more complicated. \nIn his biography of Dr. King, I May Not Get There with You , Michael Dyson digs into the leader’s views on women’s role in society. Dyson quotes activist Bernard Lee as saying: “Martin … was absolutely a male chauvinist. He believed that the wife should stay home and take care of the babies while he’d be out there in the streets.” \nGwendolyn Zoharah Simmons, a volunteer for the Student Non-Violent Coordinating Committee (SNCC; one of the most important organizations of the civil rights movement) during the King era, wrote in a 2008 article in the Journal of Feminist Studies in Religion: \n“King’s inability to see movement women as his peers and even mentors prevented him from forging strong connections with radical black women who could have been his greatest allies in the struggle he was about to launch against economic oppression.” \nNevertheless, some feminist scholars argue that Dr. King’s essential beliefs laid the groundwork for second-wave feminism. Many of his teachings—particularly about civil disobedience—were adapted by 20th-century feminists and provided a model for organizing. In Teaching for Diversity and Social Justice , Lee Ann Bell points out that early women’s liberation groups were spawned within the SNCC as female leaders applied the analyses of racial inequality to themselves. \nKing also took an active interest in women’s health care. He served on the sponsoring committee of a Planned Parenthood study on contraception and wrote of his hopes that “the federal and state governments will begin to appropriate large sums to educate people to the need for such [contraceptive] devices.” \nHe was far from the only man of his era to believe a woman’s place was in the home, and as Simmons notes, his views might very well have evolved, “had he not been shot down in the prime of his life when his political and social thought was undergoing profound transformations.” \nFinally, it’s worth noting that MLK is not the only King we honored yesterday. His wife, Coretta Scott King, was also a vitally important member of the civil rights movement—both before and after her husband’s death. \nBernice King, daughter of the two leaders, reminded us of as much in a tweet she sent Monday : \n“As you honor my father today, please remember and honor my mother, as well. She was the architect of the King Legacy and founder of @TheKingCenter , which she founded two months after Daddy died. Without #CorettaScottKing , there would be no #MLKDay.” ALSO IN THE HEADLINES \n• Condi says ‘careful.’ Former Secretary of State Condoleezza Rice worries that the #MeToo movement could “infantilize women” and potentially encourage men to ostracize them. In a CNN interview over the weekend , Rice said that though she broadly believes that the movement to “expose [sexual harassment] is a good thing, “people need to “be a little bit careful” about their response, ensuring that we don’t “turn women into snowflakes.” Fortune \n• CVS gets a makeunder. CVS announced yesterday that it will eliminate the use of imagery that has been “materially altered” (i.e. airbrushed) on all beauty products, including cosmetics, skincare, and hair care products. As Fortune ‘s Phil Wahba notes, the move is likely aimed at winning over more female customers at a time of heightened competition in the beauty industry. Fortune \n• The Marvelous Ms. Mazie. Hawaii Sen. Mazie Hirono (D) announced last week that anybody being vetted for federal judgeships will now be asked about sexual harassment and assault. As a member of the Senate Judiciary Committee, she will ask every nominee the following two questions: “Since you became a legal adult, have you ever made unwanted requests for sexual favors or committed any verbal or physical harassment or assault of a sexual nature?” and “Have you ever faced discipline or entered into a settlement related to this kind of conduct?” Slate \n• She’s running . A number of high-profile or unexpected (or both!) women have recently announced their candidacy for political office: Chelsea Manning , the transgender former Army private who was convicted of passing sensitive government documents to WikiLeaks, is running for Senate in Maryland. Lupe Valdez , a gay Latina Democrat, is running for governor of Texas. Prior to serving three terms as Dallas sheriff, Valdez was a captain in the U.S. army reserve, a prison guard, and a senior agent in the Department of Homeland Security. Rep. Martha McSally (R-Ariz.) is running for Senate. She is considered a party favorite and a “top-tier recruit in the race to replace retiring Sen. Jeff Flake.” IN CASE YOU MISSED IT \n• #HerToo. In a poignant Instagram post yesterday, Olympic gymnast Simone Biles revealed that she too is “one of the many survivors that was sexually abused by Larry Nassar.” Nassar is a former Michigan State University and USA Gymnastics doctor who has been accused by 140 women of sexual abuse. He is due for sentencing today . Instagram \n• Saudi’s new soccer fans . Women in Saudi Arabia watched live soccer for the first time on Friday. The loosening of the kingdom’s strict social rules for women follows the June announcement that women would be allowed to drive starting this year. Wall Street Journal \n• Slowly but surely. China’s Beihang University has fired a well-known professor over multiple allegations of sexual misconduct, a significant step for the country’s #MeToo movement. The university announced that an investigation found Professor Chen Xiaowu “did sexually harass female students” and that he would lose his post as vice president of the university’s graduate school. Washington Post \n• Unlucky number 17. From 2009 to 2012, the percentage of venture-funded companies with female founders increased by nearly 8%. However, there seems to have been little progress since 2012: the percentage of VC-backed companies with at least one female founder has plateaued at approximately 17%. ", "external_links": [], "published": "2018-01-16T09:50:00.000+02:00", "crawled": "2018-01-16T15:33:07.003+02:00", "highlightTitle": ""}