{"organizations": [], "uuid": "ab0e90cda5b97ec9cfc9eed1566854d1b927162d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-first-trust-us-equity-opportunities-etf-fpx-exceeds-1-billion-in-net-assets.html", "country": "US", "domain_rank": 767, "title": "First Trust US Equity Opportunities ETF (FPX) Exceeds $1 Billion in Net Assets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:17:00.000+02:00", "replies_count": 0, "uuid": "ab0e90cda5b97ec9cfc9eed1566854d1b927162d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-first-trust-us-equity-opportunities-etf-fpx-exceeds-1-billion-in-net-assets.html", "ord_in_thread": 0, "title": "First Trust US Equity Opportunities ETF (FPX) Exceeds $1 Billion in Net Assets", "locations": [], "entities": {"persons": [], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "first trust us equity", "sentiment": "negative"}, {"name": "first trust advisors l.p.", "sentiment": "negative"}, {"name": "ipox schuster", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "first trust us equity opportunities etf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust Advisors L.P. (“First Trust”), a leading exchange-traded fund (“ETF”) provider and asset manager, announced that net assets for the First Trust US Equity Opportunities ETF (NYSE Arca: FPX) (formerly First Trust US IPO Index Fund) now exceed $1 billion. FPX is an ETF with an investment objective to seek investment results that correspond generally to the price and yield (before the fund’s fees and expenses) of the IPOX ® -100 U.S. Index (the “index”). The index measures the performance of the top U.S. companies ranked quarterly by market cap in the IPOX ® Global Composite Index (the “composite index”). The index includes the 100 largest IPOs in the composite index. The index tilts toward mid- and large-cap stocks and has historically captured approximately 85% of total market capitalization created through U.S. IPO activity, according to IPOX Schuster, LLC.\n“Over the years, FPX has benefitted from its exposure to the innovation and growth of many recently issued stocks, long before they were added to traditional index funds. We believe this unique strategy’s focus on recent IPOs and spin-offs is an important key to its success,” said Ryan Issakainen, CFA, Senior Vice President, ETF Strategist at First Trust.\nSince its inception on April 12, 2006, FPX has achieved an average annual total return of 11.96% based on net asset value (NAV) as of December 29, 2017, outperforming the overall U.S. equity market as measured by the S&P 500 Index and the Russell 3000 ® Index with a total return of 8.71% and 8.69%, respectively, over the same period. In addition, the fund has received an Overall Morningstar Rating TM of four stars, as of December 31, 2017, among 1,216 funds in the Large Growth category. The fund was rated 3 stars/1,216 funds (3 years), 4 stars/1,109 funds (5 years) and 5 stars/787 funds (10 years). 1\n“Exposure to the IPOX 100 U.S. Index provides investors with a diversified, one stop solution to access the performance of the largest and typically best performing U.S. IPOs and spin-offs, an economically significant group of companies which often serve as a proxy for economic growth and innovation,” said Dr. Josef Schuster, CEO of IPOX Schuster LLC, the developer and sponsor of the index. “We are confident that the unique investment approach we have pioneered will continue to benefit investors seeking equity exposure outside the traditional benchmarks,” said Schuster.\nPerformance (%) as of 12/29/17\n3 Months 1 Year 3 Years 5 Years 10 Years Since Fund\nInception 2 FPX Performance* NAV 6.96 26.96 11.45 18.05 11.45 11.96 Market Price 7.05 26.91 11.49 17.96 11.42 11.97 Index Performance** IPOX ® -100 U.S. Index 7.11 27.61 12.05 18.72 12.11 12.63 S&P 500 Index 6.64 21.83 11.41 15.79 8.50 8.71 Russell 3000 ® Index 6.34 21.13 11.12 15.58 8.60 8.69 Performance data Quote: d represents past performance. Past performance is not a guarantee of future results and current performance may be higher or lower than performance Quote: d. Investment returns and principal value will fluctuate and shares when sold or redeemed, may be worth more or less than their original cost. You can obtain performance information which is current through the most recent month-end by visiting www.ftportfolios.com .\n* NAV returns are based on the fund’s net asset value which represents the fund’s net assets (assets less liabilities) divided by the fund’s outstanding shares. Market Price returns are based on the midpoint of the bid/ask spread on the stock exchange on which shares of the fund are listed for trading as of the time that the fund’s NAV is calculated. Returns are average annualized total returns, except those for periods of less than one year, which are cumulative. The fund’s performance reflects fee waivers and expense reimbursements, absent which performance would have been lower.\n** Performance information for the IPOX®-100 U.S. Index is for illustrative purposes only and does not represent actual fund performance. Indexes do not charge management fees or brokerage expenses, and no such fees or expenses were deducted from the performance shown. Indexes are unmanaged and an investor cannot invest directly in an index.\nS&P 500 Index - The Index is an unmanaged index of 500 stocks used to measure large-cap U.S. stock market performance.\nRussell 3000® Index - The Index is comprised of the 3000 largest and most liquid stocks based and traded in the U.S.\nFPX expense ratio: 0.60% (gross); 0.60% (net). Expenses are capped contractually at 0.60% per year, at least until April 30, 2018.\nFor more information about First Trust, please contact Ryan Issakainen at (630) 765-8689 or RIssakainen@FTAdvisors.com .\nAbout First Trust\nFirst Trust Advisors L.P., along with its affiliate First Trust Portfolios L.P., are privately held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 29, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts. First Trust is based in Wheaton, Illinois. For more information, visit http://www.ftportfolios.com .\nYou should consider the fund’s investment objectives, risks, and charges and expenses carefully before investing. Contact First Trust Portfolios L.P. at 1-800-621-1675 to obtain a prospectus or summary prospectus which contains this and other information about the fund. The prospectus or summary prospectus should be read carefully before investing.\nETF Characteristics\nThe fund lists and principally trades its shares on the NYSE Arca, Inc. There can be no assurance that an active trading market for such shares will develop or be maintained.\nThe fund’s return may not match the return of the IPOX®-100 U.S. Index. Securities held by the fund will generally not be bought or sold in response to market fluctuations.\nInvestors buying or selling fund shares on the secondary market may incur customary brokerage commissions. Market prices may differ to some degree from the net asset value of the shares. Investors who sell fund shares may receive less than the share’s net asset value. Shares may be sold throughout the day on the exchange through any brokerage account. However, unlike mutual funds, shares may only be redeemed directly from the fund by authorized participants, in very large creation/redemption units. If the fund's authorized participants are unable to proceed with creation/redemption orders and no other authorized participant is able to step forward to create or redeem, fund shares may trade at a discount to the fund's net asset value and possibly face delisting.\nRisk Considerations\nThe fund’s shares will change in value, and you could lose money by investing in the fund. One of the principal risks of investing in the fund is market risk. Market risk is the risk that a particular stock owned by the fund, fund shares or stocks in general ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51742216&newsitemid=20180111006142&lan=en-US&anchor=First+Trust+Advisors+L.P.&index=1&md5=c7197a11d409ac0f747fada4c84d7e16", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ipoxschuster.com&esheet=51742216&newsitemid=20180111006142&lan=en-US&anchor=www.ipoxschuster.com&index=4&md5=8c3558a2a1b69a05b6c8de89a360a97c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51742216&newsitemid=20180111006142&lan=en-US&anchor=www.ftportfolios.com&index=2&md5=59aafc47ebbc07b0021bd0e389c15d79", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51742216&newsitemid=20180111006142&lan=en-US&anchor=http%3A%2F%2Fwww.ftportfolios.com&index=3&md5=4ab18a60a51255f2b79b4838f2de50a5", "http://www.businesswire.com/news/home/20180111006142/en/"], "published": "2018-01-12T00:17:00.000+02:00", "crawled": "2018-01-12T02:09:38.009+02:00", "highlightTitle": ""}