{"organizations": [], "uuid": "20588219ef4d49a57f6962e3841e77b5e706fa5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-bonds/treasuries-yields-highest-since-2014-on-bullish-economic-outlook-idUSL2N1PO1F7", "country": "US", "domain_rank": 408, "title": "TREASURIES-Yields highest since 2014 on bullish economic outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-30T03:37:00.000+02:00", "replies_count": 0, "uuid": "20588219ef4d49a57f6962e3841e77b5e706fa5b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-bonds/treasuries-yields-highest-since-2014-on-bullish-economic-outlook-idUSL2N1PO1F7", "ord_in_thread": 0, "title": "TREASURIES-Yields highest since 2014 on bullish economic outlook", "locations": [], "entities": {"persons": [{"name": "karen brettell", "sentiment": "none"}, {"name": "tom di galoma", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "seaport global holdings", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: s, updates prices) * 10-year yields break above long-term trendline * Central banks expected to reduce accomodation * Fed meeting, U.S. refunding, data in focus By Karen Brettell NEW YORK, Jan 29 (Reuters) - U.S. Treasury yields surged to more than three-year highs on Monday after comments from a European Central Bank official added to expectations that central banks globally will reduce stimulus as the economic outlook improves. A break of technical support levels added to bearish sentiment with benchmark 10-year yields rising above the trendline that has marked a more than 30-year bull run dating back to the 1980s. “Key levels were taken out, the trend is broken,” said Tom di Galoma, a managing director at Seaport Global Holdings in New York. “It’s probably a realization that the global economy is moving ahead and has quite a bit of steam.” Ten-year note yields reached a peak of 2.727 percent, the highest since April 2014. The notes were last down 11/32 in price to yield 2.701 percent. Central banks are removing support for bond markets as the economic outlook brightens. \"Overall the theme is we’ve had an uptick in growth around the globe,\" said Michael Cloherty, head of U.S. rates strategy at RBC Capital Markets in New York. Dutch central bank president Klaas Knot, who is also a member of the ECB governing council, said on Sunday that \"there is no reason whatsoever” for the ECB to continue its asset purchase program. Some economists expect the Federal Reserve to raise its economic assessment when it concludes its two-day meeting on Wednesday. That could increase the probability that the U.S. central bank raises interest rates four times this year. Interest rates futures are currently pricing in three or less rate hikes this year, according to the CME Group’s FedWatch Tool. The United States will need to increase issuance this year to make up for declining bond purchases by the Fed. On Wednesday the Treasury Department is expected to announce the first increases in the size of its debt auctions since the financial crisis. Initially supply increases are expected to be made in Treasury bills and shorter-dated notes. Over time, however, rising debt needs will also require increases in longer-dated debt. \"It’s a staggeringly huge financing need,\" said Cloherty. \"When you have to borrow over $1 trillion a year every year as far as the eye can see, you can’t just rely on bills\" and short-dated notes, he said. Traders are also focused on a busy week of data this week, which will culminate in Friday’s jobs report for January. (Editing by Andrew Hay and Chizu Nomiyama) )\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T03:37:00.000+02:00", "crawled": "2018-01-30T18:41:21.017+02:00", "highlightTitle": ""}