{"organizations": [], "uuid": "c6f22a092f9aaeb421781e8e6bdc72f03589789b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-patrick-industries-inc-announces-new-50-million-stock-buyback-program.html", "country": "US", "domain_rank": 767, "title": "Patrick Industries, Inc. Announces New $50 Million Stock Buyback Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T16:46:00.000+02:00", "replies_count": 0, "uuid": "c6f22a092f9aaeb421781e8e6bdc72f03589789b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-patrick-industries-inc-announces-new-50-million-stock-buyback-program.html", "ord_in_thread": 0, "title": "Patrick Industries, Inc. Announces New $50 Million Stock Buyback Program", "locations": [], "entities": {"persons": [{"name": "patrick", "sentiment": "none"}, {"name": "todd m. cleveland", "sentiment": "none"}], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}], "organizations": [{"name": "patrick industries, inc.", "sentiment": "neutral"}, {"name": "patrick industries, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Jan. 30, 2018 /PRNewswire/ -- Patrick Industries, Inc. (NASDAQ: PATK) (\"Patrick\" or the \"Company\") announced today that its Board of Directors has approved a new stock repurchase program that authorizes the repurchase of up to $50 million of the Company's common stock over the next 24 months (the \"2018 Repurchase Plan\"). Share repurchases will be made from time to time through open market transactions at prevailing market prices, or in privately negotiated transactions or otherwise.\n\"We continue to evaluate share repurchases in alignment with our focused capital allocation strategy and this authorization reflects the confidence that our Board of Directors and management team have in Patrick's outlook and our commitment to driving shareholder value,\" said Todd M. Cleveland, Chief Executive Officer.\nThe timing and amount of purchases under the program are discretionary and will be determined by management and the Board of Directors based upon market and business conditions, stock price and other factors. The repurchase of any shares under the new stock repurchase program will be subject to restrictions under insider trading laws and the Company's self-imposed blackout periods, as well as the timing of the release of the Company's financial results for the year ended December 31, 2017 and for subsequent fiscal periods. All or part of the repurchases may be implemented under a Rule 10b5-1 trading plan, which would allow repurchases under pre-set terms at times when the Company might otherwise be prevented from doing so under insider trading laws or because of self-imposed blackout periods.\nThe Company's previous stock repurchase program, which was originally announced in January 2016 (the \"2016 Repurchase Plan\") and authorized repurchases of up to $50 million over a 24-month period, expired in January 2018. The Company repurchased in the aggregate 75,153 shares under the 2016 Repurchase Plan at an average price of $31.25 per share for a total cost of approximately $2.35 million.\nAbout Patrick Industries\nPatrick Industries, Inc. is a major manufacturer of component products and distributor of building products serving the recreational vehicle, manufactured housing, marine, kitchen cabinet, office and household furniture, fixtures and commercial furnishings, and other industrial markets and operates coast-to-coast through locations in 20 states and in China. Patrick's major manufactured products include decorative vinyl and paper laminated panels, countertops, fabricated aluminum products, wrapped profile mouldings, slide-out trim and fascia, cabinet doors and components, hardwood furniture, fiberglass bath fixtures and tile systems, thermoformed shower surrounds, specialty bath and closet building products, fiberglass and plastic helm systems and component products, wiring and wire harnesses, electrical systems components including instrument and dash panels, softwoods lumber, interior passage doors, RV painting, slotwall panels and components, aluminum fuel tanks, and CNC molds and composite parts and other products. The Company also distributes drywall and drywall finishing products, electronics and audio systems components, wiring, electrical and plumbing products, cement siding, raw and processed lumber, FRP products, interior passage doors, roofing products, laminate and ceramic flooring, shower doors, furniture, fireplaces and surrounds, interior and exterior lighting products, and other miscellaneous products.\nForward-Looking Statements\nThis press release contains certain statements related to future results, our intentions, beliefs and expectations or predictions for the future, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. Any projections of financial performance or statements concerning expectations as to future developments should not be construed in any manner as a guarantee that such results or developments will, in fact, occur. There can be no assurance that any forward-looking statement will be realized or that actual results will not be significantly different from that set forth in such forward-looking statement. The Company does not undertake to publicly update or revise any forward-looking statements except as required by law. Factors that may affect the Company's operations and prospects are contained in the section entitled \"Risk Factors\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2016, and in the Company's Form 10-Qs for subsequent quarterly periods, which are filed with the Securities and Exchange Commission (\"SEC\") and are available on the SEC's website at www.sec.gov .\nView original content with multimedia: http://www.prnewswire.com/news-releases/patrick-industries-inc-announces-new-50-million-stock-buyback-program-300590223.html\nSOURCE Patrick Industries, Inc.", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/patrick-industries-inc-announces-new-50-million-stock-buyback-program-300590223.html"], "published": "2018-01-30T16:46:00.000+02:00", "crawled": "2018-01-30T18:30:12.002+02:00", "highlightTitle": ""}