{"organizations": [], "uuid": "0ed369e7257faee5feae7222bc6f7ac686301a16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226602444&w=1200&r=LYNXMPEE0T0V0", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-politics-karroubi/iranian-opposition-cleric-accuses-khamenei-of-abuse-of-power-idUSKBN1FJ1R8", "country": "US", "domain_rank": 408, "title": "Iranian opposition cleric accuses Khamenei of abuse of power", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:09:00.000+02:00", "replies_count": 0, "uuid": "0ed369e7257faee5feae7222bc6f7ac686301a16"}, "author": "", "url": "https://www.reuters.com/article/us-iran-politics-karroubi/iranian-opposition-cleric-accuses-khamenei-of-abuse-of-power-idUSKBN1FJ1R8", "ord_in_thread": 0, "title": "Iranian opposition cleric accuses Khamenei of abuse of power", "locations": [], "entities": {"persons": [{"name": "khamenei", "sentiment": "negative"}, {"name": "bozorgmehr sharafedin", "sentiment": "none"}, {"name": "mehdi karroubi", "sentiment": "none"}, {"name": "karroubi", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}], "organizations": [{"name": "saham news", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Instead of blaming others Supreme Leader Ayatollah Ali Khamenei should take responsibility for Iran’s economic and political shortcomings, an opposition leader under house arrest said in a letter published on Tuesday.\nIn rare public criticism of Khamenei, Mehdi Karroubi accused Iran’s hardline top authority of abusing power and urged him to change the way he runs the Islamic Republic before it is too late.\n“You have been Iran’s top leader for three decades, but still speak like an opposition,” Karroubi said in an open letter to Khamenei published on Saham News, the official website of his reformist political party.\nBy “opposition”, Karroubi meant that Khamenei, head of a Shi‘ite theocracy, should not be wielding ultimate power while criticizing the government of elected President Hassan Rouhani, a pragmatist who wants to liberalize an economy dominated by the elite Revolutionary Guards and other state conglomerates.\n“During the last three decades, you have eliminated the main revolutionary forces to implement your own policies, and now you should face the results of that,” Karroubi added.\nKarroubi, 80, a Shi‘ite cleric like Khamenei, and fellow reformist Mirhossein Mousavi ran for election in 2009 and became figureheads for Iranians who staged mass protests after hardline conservative President Mahmoud Ahmadinejad was returned to power in a vote they believed was rigged. Authorities denied this.\nKarroubi, Mousavi and the latter’s wife Zahra Rahnavard have been under house arrest since 2011 without trial, by the direct order of Khamenei.\nThe Supreme Leader is commander-in-chief of Iran’s armed forces and appoints the heads of the judiciary. Key cabinet ministers are selected with his approval and he has the ultimate say on Iran’s foreign policy and nuclear program.\nBy comparison, the president wields little power.\nKarroubi also criticized Khamenei for letting the Revolutionary Guards take a commanding role in the economy as this “has tarnished the reputation of this revolutionary body and drowned it in massive corruption”.\nKARROUBI CITES UNACCOUNTABLE ELITE He said that under Khamenei’s leadership, bodies formed at the beginning of the 1979 Revolution to wipe out poverty had turned into conglomerates that own half of Iran’s wealth without a supervisory organization to question their actions.\nMore than 10 million Iranians, among 80 million, now live in absolute poverty, Karroubi said quoting official figures.\n“Under such conditions, it is natural that the lower classes, who were the grassroot supporters of the Islamic Revolution, will turn into a gunpowder barrel,” Karroubi said.\nKhamenei has often accused Rouhani’s government of responsibility for the lack of headway toward reducing high unemployment, inflation and inequality. He has also blamed members of parliament, former presidents and Western powers.\nRouhani, however, was easily re-elected in 2017, suggesting many Iranians still see him as their best hope for improving the economy and easing religious restrictions on society.\nKarroubi further said December’s nationwide street protests against “corruption and discrimination” were an alarm bell for the authorities to reform the economic and political system.\nGoaded by soaring food prices, the protests - the biggest in Iran since the post-election unrest of 2009 - took on a rare political dimension, with a growing number of people calling on Khamenei himself to step down.\nClashes between protesters and police resulted in 25 deaths, according to official figures.\nKarroubi also said that by vetting candidates in elections, Khamenei had reduced parliament to “an obedient assembly” under his thumb and the influence of Revolutionary Guards lobbies.\nThe Assembly of Experts, a council of elected clerics charged with electing, supervising and even disqualifying the Supreme Leader, has turned into a “ceremonial council that only praises the Leader”, Karroubi added.\nKaroubi, an ex-speaker of parliament, has been accused by hardline authorities of being a “seditionist” and “traitor”.\nIn a public letter to Rouhani in 2016, he asked “the despotic regime” to grant him a public trial so he could hear the indictment against him and defend himself.\nReporting by Bozorgmehr Sharafedin; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-30T15:09:00.000+02:00", "crawled": "2018-01-30T15:22:34.003+02:00", "highlightTitle": ""}