{"organizations": [], "uuid": "4c7e91b04dd86c1a12df1b471ab2995fa9cb87ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 22, "shares": 22, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226736881&w=1200&r=LYNXMPEE0T05Q", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-china-britain-may/may-promises-frank-discussions-with-china-amid-dash-for-trade-idUKKBN1FJ0D4", "country": "US", "domain_rank": 408, "title": "May starts China visit with warning over steel, intellectual rights", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:38:00.000+02:00", "replies_count": 0, "uuid": "4c7e91b04dd86c1a12df1b471ab2995fa9cb87ff"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-britain-may/may-promises-frank-discussions-with-china-amid-dash-for-trade-idUKKBN1FJ0D4", "ord_in_thread": 0, "title": "May starts China visit with warning over steel, intellectual rights", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "li keqiang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:47 AM / Updated 34 minutes ago May starts China visit with warning over steel, intellectual rights William James 3 Min Read \nLONDON (Reuters) - British Prime Minister Theresa May was starting a crucial trade visit to China on Wednesday as she admitted the two countries will not always see eye-to-eye in sensitive areas like steel over-capacity and intellectual property rights. \nMay will use meetings with President Xi Jinping and Premier Li Keqiang to try to regain momentum in the international race to secure British participation in China’s services sector boom as she seeks a new role for Britain outside the European Union. \nTravelling with her husband Philip and a delegation of 50 business leaders, May has to reheat diplomatic ties that have suffered from a perceived coldness since she took power shortly after Britain’s Brexit vote in July 2016. (nL8N1PO4HV) \nSpeaking ahead of her trip, she admitted the two countries have had their differences, notably over Chinese steel over-production which has been widely blamed for harming the British steel industry. \n“The UK and China will not always see eye-to-eye,” she said. “We will continue to look at what more can be done to tackle global overcapacity in sectors such as steel, and to ensure that, as our companies innovate and develop new products, they are confident that their intellectual property and rights will be fully protected.” \nMay has echoed calls by U.S. President Donald Trump for China to press neighbouring North Korea into reining in its nuclear and missile development. (nS8N1GZ053) \nBritain has also previously expressed concern about human rights abuses and the health of democratic development in former British colony Hong Kong. \nBritain’s last governor in Hong Kong before it was handed back to the Chinese, Chris Patten, wrote to May on Monday urging her to raise concerns over the “increasing threats to the basic freedoms, human rights and autonomy” in the territory. \nIn the past, sensitive diplomatic issues have spilled over into trade talks, with May’s predecessor David Cameron prompting a freeze in relations in 2012 by meeting the Dalai Lama in London. \nWith Brexit about to plunge Britain into its most significant economic upheaval since World War Two, relations with China are set to become increasingly important as May’s government looks to develop markets outside the EU. \nBut Chinese officials have expressed unease about what Brexit could mean for Chinese firms who have invested in Britain. \nOne deal due to be announced during the visit is a 550 million-pound accord on exchange deals, partnerships and commercial contracts in the education sector. \nMay is also under pressure to deliver a positive story in China from those closer to home. Her position as leader has been weakened by ministers openly lobbying for different types of exit and hardline eurosceptics unhappy at her Brexit strategy. \nTrade secretary Liam Fox will head a diverse delegation ranging from executives of large multinationals like HSBC HSBA.L and AstraZeneca AZN.L to smaller firms like Northern Irish seafood wholesaler Rooney Fish. Reporting by William James; Additional reporting by Venus Wu in Hong Kong and Stephen Addison; Editing by Andrew McAskill", "external_links": [], "published": "2018-01-31T00:38:00.000+02:00", "crawled": "2018-01-31T00:58:55.015+02:00", "highlightTitle": ""}