{"organizations": [], "uuid": "141252d150560c3cf64910330a461e701b1cb417", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 42, "shares": 42, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/29/103900160-452533454r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/rising-interest-rates-cause-a-2-point-6-percent-pullback-in-weekly-mortgage-applications.html", "country": "US", "domain_rank": 767, "title": "Rising interest rates cause a 2.6% pullback in weekly mortgage applications", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "141252d150560c3cf64910330a461e701b1cb417"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/31/rising-interest-rates-cause-a-2-point-6-percent-pullback-in-weekly-mortgage-applications.html", "ord_in_thread": 0, "title": "Rising interest rates cause a 2.6% pullback in weekly mortgage applications", "locations": [], "entities": {"persons": [{"name": "mike kane", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "mortgage bankers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mortgage rates moved higher for the second straight week, and the lending community is just beginning to feel the effects.\nTotal mortgage application volume fell 2.6 percent last week, according to the Mortgage Bankers Association's seasonally adjusted report. Volume remains 6.6 percent higher than the same week one year ago.\nApplications to refinance a home loan, which are most sensitive to even the smallest moves in interest rates, fell 3 percent for the week and stand just 3 percent higher than a year ago. As rates continue to move higher, refinances will make sense for fewer borrowers.\nThe average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances of $453,100 or less increased to 4.41 percent, its highest level since March, up from 4.36 percent, with points increasing to 0.56 from 0.54, including the origination fee, for 80 percent loan-to-value ratio loans.\n\"Rates moved higher last week driven by concerns over a weaker U.S. dollar, signs of more robust growth and rising rates abroad, and moderately strong fourth-quarter domestic growth,\" said MBA economist Joel Kan.\nWhile the interest rate on the popular 30-year fixed rose to its highest level since March, other rates, such as the 15-year fixed and the FHA rate, were at their highest levels since 2011 and 2013, respectively.\nThe jump in the FHA rate caused a 7 percent drop in government purchase loans and a 13 percent decrease in applications for government refinance loans. FHA loans, which are insured by the government and allow low down payments, are often used by lower-income borrowers who have less room in their budgets.\nMortgage applications to purchase a home, which are less rate-sensitive week to week, fell 3 percent last week but are 10 percent higher than a year ago.\nHomebuyers may be rushing into the market now, hoping to close a deal before mortgage rates move even higher. Rates this week did just that, rising to the highest level in four years.\nA bond market sell-off is causing yields to rise sharply. Mortgage rates loosely follow the yield on the 10-year Treasury. There will surely be more volatility in the bond market this week, as the Federal Reserve will make a policy announcement Wednesday afternoon and the monthly employment report will be released Friday.", "external_links": [], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T14:00:53.022+02:00", "highlightTitle": ""}