{"organizations": [], "uuid": "09ce8622e09b5782c78e1ebcbae16fcd31215574", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/10/503631250.jpg", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/19/netflix-earnings-preview-analysts/", "country": "US", "domain_rank": 1196, "title": "Netflix Earnings Preview: What Analysts Are Saying - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T02:32:00.000+02:00", "replies_count": 0, "uuid": "09ce8622e09b5782c78e1ebcbae16fcd31215574"}, "author": "", "url": "http://fortune.com/2018/01/19/netflix-earnings-preview-analysts/", "ord_in_thread": 0, "title": "Netflix Earnings Preview: What Analysts Are Saying - Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Huddleston Jr., FORTUNE Saturday, January 20, 2018 Credit: Photo by Ethan Miller — Getty Images Netflix CEO Reed Hastings. comments \nNetflix reports its fourth-quarter earnings on Monday afternoon, and Wall Street will be paying close attention to any blip in the streaming entertainment giant’s growth. \nFor instance, Netflix’s latest price increase —the cost of standard plans jumped $1 per month, to $10.99—went into effect during the fourth quarter. If the price hikes slowed Netflix’s subscriber growth in the final months of 2017, then history shows the company’s share price will likely suffer . For what it’s worth, though, Netflix’s stock rose after the company announced its price hike in October because many investors bet on higher revenues. \nLater in October, Netflix reported its third-quarter earnings , showing nearly $3 billion in revenue for that period and 5.3 million net subscriber additions. The company’s stock has remained on a tear to start 2018 and it currently sits near an all-time high, above $220 per share. \nThe consensus from Wall Street analysts is that Netflix will report fourth-quarter revenue of about $3.28 billion on Monday, while Netflix’s own guidance last October predicted an additional 6.3 million global streaming subscribers over that same period. Here’s what some of the analysts following Netflix are expecting from the streaming service’s quarterly update on Monday. Justin Patterson , Raymond James \nRaymond James analysts sent a mixed message about Netflix’s upcoming earnings. On one hand, “Netflix has rarely increased prices without experiencing some impact on the business,” they wrote, while also raising concerns about Walt Disney’s planned acquisition of 21st Century Fox assets could create more competition in the streaming market. \nHowever, Patterson and other analysts at Raymond James also said they would maintain their “outperform” recommendation for Netflix shares (raising their target price for Netflix shares from $220 to $260) while projecting fourth-quarter revenue of $3.3 billion that would beat Wall Street expectations by 1%. Raymond James expects Netflix’s success in international markets and its overall depth of content—from an $8 billion annual programming budget and global hits like the series Stranger Things and The Crown —to keep attracting new subscribers. The analysts predict that Netflix will beat its own estimate of 1.25 million new domestic subscribers in the most recent quarter, with Raymond James expecting roughly 1.32 million net adds in the U.S. \nGet Data Sheet , Fortune’s technology newsletter. Mark Mahaney, RBC Capital Markets \nMeanwhile, RBC is expecting “no significant reaction to [the] pending price increase” in Netflix’s upcoming quarterly report. Mahaney and the analysts at RBC cite their own survey results showing that 56% of U.S. respondents watched Netflix during the fourth quarter, up from 53% in September, with the “lead widening vs. YouTube and Amazon .” RBC predicts that Netflix added 6.3 million new streaming subscribers in the fourth quarter, which is in line with Wall Street’s forecast. “We believe that Netflix has achieved a level of sustainable scale, growth, and profitability that isn’t currently reflected in its stock price,” the RBC report says. David Miller, Loop Capital Markets \nMiller praised Netflix’s performance so far in 2018 (the stock is already up more than 13% this year), and he believes the company’s shares still have room for growth as Netflix “remains one of the only true large-cap growth stories in media.” He expects Netflix to have finished 2017 with 23.3% subscriber growth overall, including 6.4 million new streaming subscribers in the fourth quarter between the U.S. and international markets (which does not count losses among DVD-only members, whose subscriptions have been steadily declining). Jeff Reeves, InvestorPlace.com \nReeves expects Netflix to beat its earnings guidance “in a big way,” he told Fortune . “They put up record numbers in October, guidance was strong for the current report, and there’s a lot of momentum there for shares,” he said. However, Reeves threw in some caution for the coming months, adding that he’s “seriously concerned” about how Netflix fares after March as expectations continue to grow while the company faces obstacles like its negative operating cash flow and growing competition from companies like Walt Disney. Tim Nollen, Macquarie Capital \nMacquarie upgraded Netflix shares from “neutral” to “outperform” earlier this month as the firm undergoes a “broad realignment of views on media, where we prefer companies with subscription over ad-driven content, and scaled distribution with an international presence.” The analysts’ report credits Netflix for changing how people watch TV while also expanding further into the movie market. “Consumers’ increasing lack of tolerance for advertising drives them to subscription OTT services, and Netflix is miles ahead of peers,” the report says, using industry lingo for streaming. Macquarie also adds that Disney’s planned streaming push is still far off, which gives Netflix an advantage with its already strong (and growing) subscription base. Barton Crockett, B. Riley FBR \nB. Riley’s Crockett is a bit more cautious with Netflix than most other analysts, as the group’s latest report maintains a “neutral” rating on Netflix stock. The analysts wrote on Friday that they believe Netflix can beat its guidance and Wall Street forecasts for fourth-quarter subscription growth with the addition 6.32 million global streaming subscribers in its most recent quarter. However, the B. Riley analysts’ caution is based on concern that Netflix faces a “notable execution risk in the need to continually develop more impactful content to keep boosting subscriber growth.” In other words, Netflix relies on continued impressive subscriber growth to boost revenue amid increasing costs for programming, which means that the streaming service faces the daunting task of constantly rolling out more and more popular TV series and films to satiate its growing subscriber base’s appetite for new, compelling video content. Related Articles", "external_links": [], "published": "2018-01-20T02:32:00.000+02:00", "crawled": "2018-01-20T05:02:16.038+02:00", "highlightTitle": ""}