{"organizations": [], "uuid": "8ed59c0608e6967bf90a34d3e1c45c3ae20d3ee0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-robyn-tomlin-and-lauren-gustus-named-regional-editors-at-mcclatchy.html", "country": "US", "domain_rank": 767, "title": "Robyn Tomlin and Lauren Gustus Named Regional Editors at McClatchy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-13T00:30:00.000+02:00", "replies_count": 0, "uuid": "8ed59c0608e6967bf90a34d3e1c45c3ae20d3ee0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-robyn-tomlin-and-lauren-gustus-named-regional-editors-at-mcclatchy.html", "ord_in_thread": 0, "title": "Robyn Tomlin and Lauren Gustus Named Regional Editors at McClatchy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif., Jan. 12, 2018 /PRNewswire/ -- McClatchy (NYSE American: MNI) today announced a new regional structure for news and named Robyn Tomlin and Lauren Gustus as Regional Editors. Tomlin, currently Managing Editor at The Dallas Morning News, will be based in Raleigh, North Carolina, and will be responsible for the seven McClatchy newsrooms in the Carolinas. Gustus, currently Executive Editor of McClatchy's Star-Telegram in Fort Worth, Texas, will be based in Sacramento and will be responsible for McClatchy's five California newsrooms plus The Idaho Statesman in Boise. They will begin in their new roles in February.\n\"We couldn't be more excited about the two passionate journalists who will lead our efforts to innovate faster, collaborate more effectively and serve our readers better,\" said Tim Grieve, McClatchy's Vice President of News.\nMcClatchy launched a program of Newsroom Reinvention in 2017 to accelerate its digital growth and ensure that each of its newsrooms can deliver what readers need in a fast-changing news environment. Newsroom Reinvention has led to record digital readership for McClatchy and high-impact journalism that holds leaders and institutions accountable, including a recent Kansas City Star series on secrecy in the Kansas government and a Fresno Bee project on the high teen birth rate in California's San Joaquin Valley.\n\"The new structure will sharpen our local focus and increase the pace and cadence of our digital transformation,\" said Craig Forman, President and CEO of McClatchy.\nUnder the new structure, each McClatchy newsroom will have a local editor, committed to producing journalism that matters to the local community. And there will also be a regional editor responsible for ensuring that the newsrooms work together effectively and are pushing forward to the company's digital future. McClatchy expects the regional structure to roll out nationwide over the course of the next year.\nIn North Carolina, Tomlin will oversee The News & Observer in Raleigh, The Charlotte Observer and The Herald Sun in Durham. In South Carolina, she will be responsible for The Island Packet in Hilton Head, The Beaufort Gazette, The Sun News in Myrtle Beach, The State in Columbia and The Herald in Rock Hill.\nThe move will be a homecoming for Tomlin, who graduated from the University of North Carolina. She has been managing editor at The Dallas Morning News for two years after serving as vice president and chief digital officer at Pew Research Center and as founding editor of Digital First Media's Project Thunderdome in New York City.\nShe was director of editorial innovation for the New York Times Regional Media Group and served as editor at the StarNews in Wilmington, North Carolina, the Ocala (Florida) Star-Banner and the TimesDaily in Florence, Alabama.\nGustus will be responsible for McClatchy's founding news organization, The Sacramento Bee, as well as its other California newsrooms -- The Fresno Bee, The Modesto Bee, The Merced Sun-Star and The Tribune in San Luis Obispo. She will also oversee The Idaho Statesman in Boise.\nGustus joined McClatchy in 2017 as Vice President/Executive Editor of the Star-Telegram in Fort Worth, where her talent for innovation and public service journalism has helped reporters dramatically increase their readership and their impact. She was previously Executive Editor of the (Fort Collins) Coloradoan, and worked at the Los Angeles Daily News and the Salt Lake Tribune before joining the Reno Gazette-Journal, where she rose from Sports Editor to Deputy Editor.\nMcClatchy announced several other new appointments:\nJoe Kieta, currently the Editor of The Modesto Bee, will become the Editor of The Fresno Bee, succeeding Jim Boren, who announced his retirement last year. Kieta has nearly 17 years' experience as a top editor and has led two other McClatchy newsrooms -- the Merced Sun-Star, which he joined in 2001, and the Ledger-Enquirer in Columbus, Ga., from 2010-2012.\nPrior to Merced, Kieta served in various editing and reporting roles at the Times Leader in Wlikes-Barre, Pa., The Tribune in San Luis Obispo, Calif., and The Daily Telegram in Adrian, Mich.\nColleen McCain Nelson, Editorial Page Editor at The Kansas City Star, will take on a broader role as McClatchy Opinion Editor, with a focus on elevating McClatchy's opinion work nationwide, to increase impact and community engagement. She will take on this new role while continuing to lead Kansas City's editorial board.\nJohn Drescher, who has championed accountability journalism as Executive Editor of The (Raleigh) News & Observer since 2007, will become Opinion and Solutions Editor in Raleigh, a role that will capitalize on his deep knowledge of North Carolina, and on his staunch commitment to holding government and institutions accountable.\nMcClatchy also announced that Joyce Terhaar has decided to leave The Sacramento Bee after 30 years in the newsroom, the last seven as Executive Editor. In a note to the newsroom at The Bee, Terhaar said she found her work at The Bee \"tremendously satisfying, largely because of the talented journalists here who are committed to work that has impact, who do the difficult reporting to hold the powerful accountable, and who write stories that matter to this community.\"\n\"Joyce has been a strong advocate for journalism, for McClatchy and for The Bee, and we'll miss her intelligence, her insights and her passion for the job,\" Grieve said.\nAbout McClatchy\nMcClatchy operates 30 media companies in 14 states, providing each of its communities with high-quality news and advertising services in a wide array of digital and print formats. McClatchy is a publisher of iconic brands such as the Miami Herald, The Kansas City Star, The Sacramento Bee, The Charlotte Observer, The (Raleigh) News & Observer, and the (Fort Worth) Star-Telegram. McClatchy is headquartered in Sacramento, Calif., and listed on the New York Stock Exchange American under the symbol MNI.\nView original content with multimedia: http://www.prnewswire.com/news-releases/robyn-tomlin-and-lauren-gustus-named-regional-editors-at-mcclatchy-300582199.html\nSOURCE McClatchy", "external_links": ["https://twitter.com/robyntomlin", "http://www.prnewswire.com/news-releases/robyn-tomlin-and-lauren-gustus-named-regional-editors-at-mcclatchy-300582199.html", "https://twitter.com/laurengustus"], "published": "2018-01-13T00:30:00.000+02:00", "crawled": "2018-01-13T03:03:59.064+02:00", "highlightTitle": ""}