{"organizations": [], "uuid": "91d484d62ea4b80cf53dc3ccce2684d5ce313b06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-rignet-announces-acquisition-of-intelie-a-provider-of-real-time-streaming-analytics-and-operational-intelligence.html", "country": "US", "domain_rank": 767, "title": "RigNet Announces Acquisition of Intelie, a Provider of Real-Time Streaming Analytics and Operational Intelligence", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.096, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "91d484d62ea4b80cf53dc3ccce2684d5ce313b06"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-rignet-announces-acquisition-of-intelie-a-provider-of-real-time-streaming-analytics-and-operational-intelligence.html", "ord_in_thread": 0, "title": "RigNet Announces Acquisition of Intelie, a Provider of Real-Time Streaming Analytics and Operational Intelligence", "locations": [], "entities": {"persons": [{"name": "intelie", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "são paulo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "rio de janeiro", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "rignet announces acquisition of intelie", "sentiment": "negative"}, {"name": "real-time streaming analytics", "sentiment": "negative"}, {"name": "intelie soluções em informática sa", "sentiment": "none"}, {"name": "intelie pipes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 17, 2018 (GLOBE NEWSWIRE) -- RigNet, Inc. (NASDAQ:RNET) today announced that it has agreed to acquire Intelie Soluções em Informática SA, a real-time, predictive analytics company that is an award-winning, early pioneer in deep machine learning and planning optimization. With a presence in Houston, Rio de Janeiro, São Paulo, and London, Intelie optimizes critical operations through technological solutions specialized in stream data analytics with high data volumes and high data throughput. The transaction is anticipated to close in Q1 2018, subject to customary closing conditions.\nCombining an operational understanding with a machine learning approach, Intelie facilitates innovation via Intelie Pipes, a distributed query language with a complex event processor to aggregate and normalize real-time data from a myriad of data sources. This technology enables the Intelie LIVE platform to solve data integration, data quality, data governance and monitoring problems. Intelie LIVE is an operational intelligence platform that empowers clients to make timely, data-driven decisions in mission-critical real-time operations, including drilling, and longer-term, data-intensive projects, such as well planning.\nIntelie’s highly differentiated real-time machine learning platform and services have currently been tailored to support energy and maritime companies, who are increasingly looking to continuously optimize their business processes. The acquisition will leverage Intelie’s unique capabilities and market position to distinguish and enhance RigNet’s bundled communications services. Additionally, Intelie’s team of data scientists and software developers will accelerate RigNet’s strategy to move up the network stack, furthering the development of effective applications powered by data.\n“Deep learning and artificial intelligence are rapidly developing initiatives across all industries and particularly within upstream oil & gas in areas of well development, equipment and production management and in maritime in vessel optimization and CO2 emissions monitoring. With reliable prediction models based on live data, Intelie depends on highly reliable communications services to ensure constant and synchronized data delivery, which makes Intelie’s solutions a natural fit with the highly reliable managed communications services RigNet delivers to our customers. Additionally, the Intelie LIVE platform capabilities apply to many industry verticals and we will expand Intelie’s presence in those verticals selectively through distribution partners, much as we are with our unique cybersecurity capabilities brought to us through our acquisition of Cyphre. I welcome our new team members from Intelie and look forward to delivering these and all of our highly differentiated services to our customers around the world as their technology partner,” said Steve Pickett, CEO & President, RigNet.\n“The digital transformation underway in the oil & gas industry exponentially leverages data generation in many different businesses operations. Intelie has been helping companies retrieve the most value from these data sources, delivering technologies and services which enable advanced analytics development and monitoring operations on a real-time basis. Intelie solutions are taking clients to a new level, allowing timelier data-driven reactions on predicted operational behavior. RigNet, a worldwide company with a strong market position in the O&G industry, an outstanding management team, and a strategy to broaden its offering beyond O&G, fulfills Intelie’s needs to boost its growth. We are very excited about this opportunity to be a part of RigNet,” said Lelio Souza, CEO, Intelie.\nAbout RigNet\nRigNet (NASDAQ:RNET) is a leading global specialized provider of customized systems and solutions serving customers with complex data networking and operational requirements. RigNet provides solutions ranging from fully-managed voice and data networks to more advanced applications that include video conferencing, crew welfare, asset monitoring and real-time data services. RigNet is based in Houston, Texas and has operations around the globe.\nFor more information on RigNet, please visit www.rig.net . RigNet is a registered trademark of RigNet, Inc.\nMedia / Investor Relations Contact:\nJerri Dean\nExecutive Administrative Assistant\nRigNet, Inc.\nTel: +1 (281) 674-0129\nForward- Looking Statements\nThis press release includes “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The opinions, forecasts, projections, expected timetable for completing the proposed transaction, benefits and synergies of the proposed transaction, future opportunities for the combined company and products, future financial performance and any other statements regarding RigNet’s future expectations, beliefs, plans, objectives, financial conditions, assumptions or future events or performance that are not statements of historical fact, are forward-looking statements within the meaning of the federal securities laws. RigNet can give no assurance that such expectations will prove to have been correct. These statements are subject to, among other things, satisfaction of the closing conditions to the acquisition, the risk that the contemplated acquisition does not occur, negative effects from the pendency of the acquisition, the ability to successfully integrate the acquired business and to realize expected synergies, the timing to consummate the proposed transaction and other risk factors that are discussed in RigNet’s most recent 10-K as well as RigNet’s other filings with the SEC available at the SEC’s Internet site ( http://www.sec.gov ). Actual results may differ materially from those expected, estimated or projected. Forward-looking statements speak only as of the day they are made, and we undertake no obligation to publicly update or revise any of them in light of new information, future events or otherwise.\nSource:RigNet, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=fd22rbUZ9dyqoi7sxNg5dXuJbCmO1ajbDFS7BnvtIyOpCHwsH5mpHwzhvbPR7slvNAAjVa1BCmLCQwumi4hUkb7SpFLvN7p8_Y7VwkyD33kqcCWYao3OhPBUhD0kztI32Pzyjva6fcAiSRy6K6FLB8AjqiVPh-dz7o_3g9Q6VXXaKYpgK50sLCJSb7dlgtIyDq85Ijqz1liUKWLSIldyEjxV0m0nvna_ff4RcXI-Z_FUwwm-NOqKWQqqTyklbwrtHhMeWdqvehF2RSqu4BDKgSHp6paKN1XEu9p1V1HJ5ZTQLOid214oCULqSSbDf6tnqjzvo1bw0jw1_k1DUptRs8pKwJ57oL-H6a-6td8ux3E4kaonSu8XEub9BHhsJd-0YLXafyUrVzTJpZg21tex8fUf2vWkq_oEnA0g5tgIdEveKMUZej6-K-5HosX-c_sRC3A5HNNN3V4mrnz8u7ad78DDu_heWAOmeLc3H5P", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5a76b332-1828-4fff-b146-6d868055780f"], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:36:02.000+02:00", "highlightTitle": ""}