{"organizations": [], "uuid": "039411ecdb9f88125c99c81b9eb09417f82ebba5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 69, "shares": 69, "comments": 1}, "stumbledupon": {"shares": 5}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/kraken-down-ripple-bitcoin-price.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/bitcoin-price-ripple-kraken-down/", "country": "US", "domain_rank": 1196, "title": "Kraken Down: Draws Mt. Gox Worries as Ripple, Bitcoin Trading Pauses | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-01-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "039411ecdb9f88125c99c81b9eb09417f82ebba5"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/12/bitcoin-price-ripple-kraken-down/", "ord_in_thread": 0, "title": "Kraken Down: Draws Mt. Gox Worries as Ripple, Bitcoin Trading Pauses | Fortune", "locations": [], "entities": {"persons": [{"name": "jesse powell", "sentiment": "negative"}, {"name": "kraken", "sentiment": "none"}, {"name": "lucinda shen", "sentiment": "none"}, {"name": "zakaria maghfour", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "moneygram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "kraken Bitcoin Exchange Kraken Goes Down for 40 Hours, Drawing Mt. Gox Comparisons Jesse Powell, chief executive officer of Kraken. The exchange has been down roughly 40 hours, fanning fears for Bitcoin, Ethereum, and Ripple investors. Bloomberg via Getty Images By Lucinda Shen January 12, 2018 \nWhat was meant to be two to three hours of late-night down time for cryptocurrency exchange Kraken has stretched into a day and a half—fanning worries during an already high-strung day for Bitcoin and Ripple owners. \nAs one of the world’s biggest markets for cryptocurrency has remained a weight on Bitcoin prices, one of the world’s largest exchanges for the asset, Kraken, is drawing ire for an unexpectedly lengthy system maintenance that’s stopped some investors from making gains or stymying losses resulting from the recent price move. This is costing a lot of money to i think all of us \n— Zakaria Maghfour (@zmaghfour) January 11, 2018 \nNotably, some Kraken account holders missed the Ripple rally that came after a partnership between MoneyGram and Ripple was announced Thursday. @Ripple announces @MoneyGram partnership. All my ripple is on #kraken 'cuz was the 1st exchange I used and the 1st alt I bought… Kraken is down due to server maintenance today… It's either a sign to HODL or sign to close my account on that shitty exchange once and for all \n— Manny Pulate (@Manny_Pulate) January 11, 2018 \nKraken initiated the upgrade at 12 a.m. Thursday after scheduling the maintenance about seven hours earlier. As first, the company said its website would be down for two hours, “possibly longer”—though that estimate grew longer with time. As of print, that time has grown close to 40 hours. \n“We are still working to track down an elusive bug which is holding up launch,” Kraken, which had a daily volume of $762 million just before it went down, wrote in its most recent update, though it emphasized: “All funds remain secure.” \nThat comes during an already rocky week for those in the crypto space. A justice minister in one of the biggest crypto market makers, South Korea , reiterated a proposal to ban cryptocurrency exchanges . Bitcoin prices rose roughly 4% to $13,792 in trading Friday, still below its 2018 high of $17,000. Ripple is also up 1.7% at $2, down from its high this year of nearly $4. Ethereum meanwhile posted a substantial gain of 10%, below its high of 9%. \nIn more extreme cases, Kraken’s lengthy down time has drawn comparisons to Mt. Gox—a now defunct Bitcoin exchange from which hackers stole 850,000 bitcoin in 2014, an amount now worth about $11.5 billion . It comes even though Kraken has said that funds are safe. Top 10 crypto exchange, Kraken, has now been down for 24 hours. Hodlers getting very nervous! There must be billions on the exchange, is this Mt. Gox 2.0? \n— Rob Stokes (@robstokes) January 12, 2018 \nMt. Gox too pressed pause for an extended period of time Feb. 7, 2014. But at the time, the company did not disclose that it had been hacked. Instead, Mt. Gox explained on Feb. 10 that it had gone down due to a flaw in the Bitcoin protocol. It wasn’t until Feb. 24 that customers got a better idea of just how badly things had gone wrong for Mt. Gox, with the company deleting all its Twitter pages. The company eventually revealed the extent of the hack. It took three days of downtime for MtGox to admit that bitcoins were missing. @krakenfx is on day 2. I'm hoping the same thing isn't happening at Kraken, but not confident. \n— Michael Blake (@mblake) January 12, 2018 I am an attorney and have been appointed as class counsel in several high profile class actions. If exchange is not up prior to bitcoin's final fall I will be suing. Kraken is trying to keep people from closing their short positions on the fall. \n— Andrew (@Copeap0) January 11, 2018 If the Kraken Exchange isn't working perfectly when I wake up tomorrow morning, I am calling the FBI to request that they get involved in this situation. Your recent status update is unprofessional and shocking. PS – I am 25+ year lawyer. #kraken @krakensupport @krakenfx \n— Clay Crawford (@Crawfordtx) January 12, 2018 \nKraken said it would offer a “substantial amount of free trading” following the resolution. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T02:00:00.000+02:00", "crawled": "2018-01-13T04:32:34.008+02:00", "highlightTitle": ""}