{"organizations": [], "uuid": "e0ff6896caa61bcc68a24ac951d7439360884ae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-afghanistan-refugees-return/fighting-forces-most-returning-afghans-to-flee-anew-report-idUSKBN1FD2LW", "country": "US", "domain_rank": 408, "title": "Fighting forces most returning Afghans to flee anew: report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:10:00.000+02:00", "replies_count": 0, "uuid": "e0ff6896caa61bcc68a24ac951d7439360884ae5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-afghanistan-refugees-return/fighting-forces-most-returning-afghans-to-flee-anew-report-idUSKBN1FD2LW", "ord_in_thread": 0, "title": "Fighting forces most returning Afghans to flee anew: report", "locations": [], "entities": {"persons": [{"name": "jan egeland", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "refugee council", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "nrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Almost three in four Afghans who return home after seeking sanctuary abroad are forced to flee again due to fresh fighting, an aid agency said on Wednesday as it urged an end to deportations to the war-torn country.\nViolence escalated in Afghanistan in 2017, with 360,000 people forced from their homes and more than 2,600 civilians killed, according to the United Nations.\nThe Taliban have made steady inroads since NATO ended its main combat operation in 2014 and are now estimated to control or contest at least 40 percent of the country.\nYet hundreds of thousands of Afghans who fled overseas in recent decades are returning to the country - mainly from neighboring Iran and Pakistan, where more than 6 million took shelter after the 1979 Soviet invasion, the U.N. says.\nMost find war and poverty when they get there, said the Norwegian Refugee Council (NRC) aid agency.\n“They were immediately engulfed in the conflict and pushed to flee again,” NRC secretary general Jan Egeland told the Thomson Reuters Foundation by phone.\nThree-quarters of those who go back find it impossible to settle in their old home because of the conflict, according to an NRC survey of more than 2,500 families.\nSome 72 percent said they were simply displaced again.\nMany end up living with relatives or in makeshift camps, with limited jobs, and are often forced to skip meals and send children to work instead of school, the report said.\nViolence has also made it increasingly difficult for aid groups to help those in need, Egeland said.\nOn Wednesday, at least five people were killed and 24 wounded as gunmen stormed an office of the Save the Children aid agency in the eastern city of Jalalabad in an attack claimed by Islamic State.\n“It’s wicked(ly) unsafe to be in Afghanistan ... it is more unsafe then ever,” Egeland said. “This is not the time to return anyone”.\nMore than half a million Afghans spontaneously returned or were deported back to the country in 2017, mainly from Iran and Pakistan, according to the U.N.\nLast year, Human Rights Watch accused the U.N. of allowing Pakistan to forcibly evict Afghan refugees in violation of international law.\nPakistan denies systematic harassment of the refugees by authorities. It claims the country has demonstrated generosity in hosting the Afghans despite its economic limitations.\nReporting by Umberto Bacchi @UmbertoBacchi, Editing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T02:10:00.000+02:00", "crawled": "2018-01-25T12:55:15.008+02:00", "highlightTitle": ""}