{"organizations": [], "uuid": "401a2405205b320b2e4796e6ee6032e874b12fa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/thailand-tourism/update-1-thailand-plans-for-even-more-tourists-as-numbers-top-35-million-idUSL3N1PB1XU", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Thailand plans for even more tourists as numbers top 35 million", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:05:00.000+02:00", "replies_count": 0, "uuid": "401a2405205b320b2e4796e6ee6032e874b12fa3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/thailand-tourism/update-1-thailand-plans-for-even-more-tourists-as-numbers-top-35-million-idUSL3N1PB1XU", "ord_in_thread": 0, "title": "UPDATE 1-Thailand plans for even more tourists as numbers top 35 million", "locations": [], "entities": {"persons": [{"name": "pongpanu svetarundra", "sentiment": "none"}, {"name": "orathai sriring", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}], "organizations": [{"name": "suphanida thakral", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* 2017 tourist arrivals 35.38 mln, up 8.8 pct\n* Chinese tourists at 9.8 mln in 2017\n* Ministry sees 2018 arrivals at 37.55 mln, up 6.1 pct (Adds detail of data, companies)\nBy Suphanida Thakral and Orathai Sriring\nBANGKOK, Jan 16 (Reuters) - Thailand on Tuesday forecast a rise of 6 percent in tourist numbers this year, after a jump of 9 percent to 35 million in 2017, with little sign the strong baht is slowing growth that has lifted shares in hotels, malls and the airport operator.\nTourist receipts account for about 12 percent of Southeast Asia’s second-largest economy, making it one of the most important drivers of growth as Thailand has lagged regional peers since the army took power in 2014.\nInternational tourist arrivals rose 8.8 percent in 2017 to a record 35.38 million, equivalent to more than half the Thai population, said government tourism and sports official Pongpanu Svetarundra.\nThe biggest factor was growth of 12 percent in the numbers of Chinese visitors, who are ever more evident at beaches, shopping malls and temples.\nTourist revenue had also risen nearly 12 percent to more than 1.8 trillion baht ($56 billion), the ministry said.\n“The trend is moving to the higher-end market, for both Chinese and European tourists. The spending per tourist is increasing,” Pongpanu told a news conference.\nIn 2018, Thailand expects 37.55 million visitors to spend 2.1 trillion baht.\nAlthough the baht is near a 3-1/2-year high against the dollar and up more than 12 percent since the start of 2017, inflation is less than one percent.\nThe currency strength was having little impact, said Ittirit Kinglek, the president of the Tourism Council of Thailand, adding, “The overall trend looks positive.”\nAmong the biggest beneficiaries of the tourism boom is majority state-owned airports operator Airports of Thailand , which recently said it planned to upgrade its 2018 earnings outlook.\nShares of AOT have risen 78 percent since the start of 2017, with its market capitalisation reaching 1 trillion baht ($31 billion), making it the largest airport operator in the world by market capitalization.\nIt trades at a valuation of 49 times earnings, compared to a price-to-earnings ratio of 22 times for the second largest airport operator, Spain’s Aena SME SA.\nFaced with stiff competition and higher fuel prices, however, Thai airlines have fallen short of a rise of 16 percent in the benchmark index.\nHotels and shopping malls are among other winners.\nCentral Plaza Hotel Pcl, whose shares have risen 40 percent since the start of 2017, forecasts 2018 revenue growth of 7 percent to 8 percent.\nMall operator Central Pattana Pcl aims for profit growth of 20 percent this year. Its shares have risen 53 percent since the start of 2017.\nThailand’s tour and leisure index rose 30 percent since 2017 and was trading at 37 times earnings.\nThere is still plenty of room for growth, said Douglas Martell, chief executive of ONYX Hospitality Group, the hotel arm of Italthai Group, which also owns a construction company, Italian-Thai Development Pcl.\n“There is also potential for the industry to transition towards higher room pricing,” he told Reuters. ($1=31.91 baht)\nAdditional reporting by Chayut Setboonsarng; Editing by Matthew Tostevin and Clarence Fernandez\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T19:05:00.000+02:00", "crawled": "2018-01-17T20:17:23.005+02:00", "highlightTitle": ""}