{"organizations": [], "uuid": "ec5e349c80f85a816e607608145d55eff4ac5a83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 42}, "facebook": {"likes": 159, "shares": 159, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-ubm-m-a-informa/britains-informa-seals-5-2-billion-deal-for-events-organizer-ubm-idUSKBN1F61CG", "country": "US", "domain_rank": 408, "title": "Britain's Informa seals $5.2 billion deal for events organizer UBM", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.297, "site_type": "news", "published": "2018-01-17T19:46:00.000+02:00", "replies_count": 0, "uuid": "ec5e349c80f85a816e607608145d55eff4ac5a83"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ubm-m-a-informa/britains-informa-seals-5-2-billion-deal-for-events-organizer-ubm-idUSKBN1F61CG", "ord_in_thread": 0, "title": "Britain's Informa seals $5.2 billion deal for events organizer UBM", "locations": [], "entities": {"persons": [{"name": "stephen a. carter", "sentiment": "none"}, {"name": "informa", "sentiment": "none"}, {"name": "agrishow", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ubm", "sentiment": "none"}, {"name": "informa", "sentiment": "none"}, {"name": "lloyds list", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s Informa ( INF.L ) struck a deal to buy conference organizer UBM ( UBM.L ) for 3.8 billion pounds ($5.2 billion) in cash and stock on Wednesday, forming a world-leading business events and exhibitions group worth 8 billion pounds.\nThe deal, which comes almost a decade after UBM tried to buy Informa, will give it greater scale and specialization in events, the fastest growing part of its business, Informa said.\nInforma owns the Lloyds List shipping newspaper and runs around 200 exhibitions a year, including Arab Health and Agrishow, while UBM counts Black Hat computer security events and Game Developers Conference among its 300-strong portfolio.\nInforma’s Chief Executive Stephen A. Carter said in an interview that such opportunities “don’t come along very often”.\nShareholders will receive 1.083 Informa shares for each UBM share and 163 pence in cash, valuing UBM at 964 pence a share, a 30 percent premium to the Jan. 15, closing price, Informa said.\nThe deal terms were outlined after the groups confirmed talks on Tuesday. Informa has until Feb. 13 to make a firm offer.\nShares in UBM were trading up 10 percent at 866.5 pence, while Informa was down 10 percent at 674 pence at 1100 GMT. At that price, its offer is worth 893 pence per UBM share.\nAnalysts at Citi said the proposed deal would increase Informa’s organic growth rate and margins, assuming even modest synergies, as its exposure to events increases from around 35 percent of group revenue to almost 60 percent.\n“One of the reasons that we have been less positive on Informa versus UBM is due to the business mix, with concerns over areas such as academic publishing and knowledge and networking.”\nInvestec said it was a good deal for UBM, but it looked like Informa was paying a very full price, excluding synergies, and there were execution risks for its mid-term growth and margins.\nUBM, which once had interests in newspapers and television, has focused in recent years on events, buying Advanstar Communications in 2014 and selling PR Newswire in 2016.\nInforma, which also has academic publishing and business intelligence operations, has also built its events business in recent years. Global exhibitions revenue has grown from 160 million pounds in 2013 to more than 550 million pounds in 2017.\nCarter, who will be chief executive of the new group, said the fit was better than in 2008 when UBM tried to buy Informa.\n“We are now the bigger business by size, but the complementarity if anything has gone up,” he said. ($1 = 0.7264 pounds)\nAdditional reporting by Arathy S Nair in Bengaluru; editing by Jason Neely/Keith Weir/\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T19:46:00.000+02:00", "crawled": "2018-01-18T01:05:33.011+02:00", "highlightTitle": ""}