{"organizations": [], "uuid": "328e9b326eba773f909f02ed701f9bd4812d6dae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/12/104893407-GettyImages-885948316.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/ethereum-blasts-to-an-all-time-high-and-nears-1000.html", "country": "US", "domain_rank": 767, "title": "Ethereum blasts to an all-time high and nears $1,000", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T13:32:00.000+02:00", "replies_count": 0, "uuid": "328e9b326eba773f909f02ed701f9bd4812d6dae"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/04/ethereum-blasts-to-an-all-time-high-and-nears-1000.html", "ord_in_thread": 0, "title": "Ethereum blasts to an all-time high and nears $1,000", "locations": [], "entities": {"persons": [{"name": "jaap arriens", "sentiment": "none"}, {"name": "vitalik buterin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fintech effect ethereum", "sentiment": "negative"}, {"name": "ethereum foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Fintech Effect Ethereum blasts to new high, cracks $1,000 for the first time Ethereum is currently the third-largest cryptocurrency by market value, after being dethroned by another altcoin, Ripple's XRP, last week. The Ethereum Foundation is launching two new subsidy programs to boost research into the scalability and development of the distributed ledger. 3 Hours Ago | 00:28 \nAlternative cryptocurrency ethereum broke a fresh record high Thursday . \nThe digital currency broke the $1,000 mark for the first time, edging up to an all-time high of $1,045.08 at about 10:05 a.m. ET, according to data from industry website CoinDesk. \nIt is currently the third-largest cryptocurrency by market value, after being dethroned by another altcoin , Ripple's XRP , last week. Its market capitalization shot above $100 billion for the first time Thursday, according to Coinmarketcap data. \nEthereum creator Vitalik Buterin said in a blog post Tuesday that the non-profit foundation that oversees the blockchain network was launching two new subsidy programs to support research into the scalability and development of the distributed ledger. \nDistributed ledgers store vast amounts of transactions on a decentralized network of computers. \n\"The Ethereum Foundation has started issuing grants to help it scale,\" Charles Hayter, CEO of Crypto Compare, told CNBC in an email. \"This network effect will galvanize the community and help ethereum to throw off its growing pains.\" \nEthereum's renewed record high comes as bitcoin's dominance in the market dipped to its lowest level in history . According to CoinMarketCap data, the world's biggest virtual currency takes up a third of the entire market. \n\"All the alternative cryptocurrencies are having a healthy run into the new year as traders reallocate and jump from hot theme to theme,\" Hayter said. \nThe blockchain network that underpins it, ethereum, has been working with a number of high-profile financial institutions including UBS, Barclays and Credit Suisse. WATCH: Six ways to protect your bitcoin and ethereum investments from hackers show chapters", "external_links": [], "published": "2018-01-04T13:32:00.000+02:00", "crawled": "2018-01-04T13:38:38.074+02:00", "highlightTitle": ""}