{"organizations": [], "uuid": "40d758ae8e9004246c816e8acba5de45738f57d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/nigeria-unilever/unilever-and-consumer-rivals-raise-bets-on-nigeria-idUSL8N1PI6XT", "country": "US", "domain_rank": 408, "title": "Unilever and consumer rivals raise bets on Nigeria", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:29:00.000+02:00", "replies_count": 0, "uuid": "40d758ae8e9004246c816e8acba5de45738f57d7"}, "author": "", "url": "https://www.reuters.com/article/nigeria-unilever/unilever-and-consumer-rivals-raise-bets-on-nigeria-idUSL8N1PI6XT", "ord_in_thread": 0, "title": "Unilever and consumer rivals raise bets on Nigeria", "locations": [], "entities": {"persons": [{"name": "alexis akwagyiram", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "ogun", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}, {"name": "lagos", "sentiment": "none"}], "organizations": [{"name": "nigeria reuters", "sentiment": "negative"}, {"name": "unilever", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 30 PM / in 12 minutes Unilever and consumer rivals raise bets on Nigeria Reuters Staff \n* Unilever and rivals tailor tactics to local market \n* Switch to local production to counter import curbs \n* Offer smaller pack sizes in region plagued by poverty \n* Nigerian, regional markets have huge growth potential \nBy Alexis Akwagyiram \nLAGOS, Jan 24 (Reuters) - With Africa’s most populous country out of recession, and the wider region on the path to growth, the world’s consumer goods companies are looking to cash in. \nLast month, Unilever opened a $12 million Blue Band margarine factory in Nigeria’s southwestern state of Ogun so that it does not have to import margarine from Ghana, as it has in recent years. It is also in talks with suppliers to switch to a locally-sourced flavouring agent for its toothpaste. \nThese are examples of how the Anglo-Dutch group, like its global rivals, has been forced to adapt its business to cope with a central bank decision to restrict access to foreign currency for the import of certain products since 2015 to boost the economy. \nAnother way Unilever is tailoring its operations to the local market is by offering smaller pack sizes of a range of products, from tea to stock cubes, to appeal to more customers in a country and region plagued by poverty and inequality. \nShops in Nigeria’s commercial capital Lagos sell packets containing just two Unilever-produced tea bags or two stock cubes, for example. “These are all packs that we use to gain penetration and to develop the market,” said Yaw Nsarkoh, managing director of Unilever Nigeria. \nBut again, the firm is not alone in such tactics; the same shops stock Nestle cereals ranging in size from 50 grams to 250 grams and 1 kilogram. \nBritain’s PZ Cussons meanwhile has rolled out a range of small pack sizes over the last three years for products from soap and detergent to milk and vegetable oil. “They have been popular and the biggest contributor in sales to each brand,” said Christos Giannopoulos, CEO of the company’s Nigerian business. \nHow best to navigate the African consumer market is on the agenda to be discussed by corporate leaders at the World Economic Forum in the Swiss resort of Davos this week. \nThe potential prize is alluring. It helps explains why these companies, plus the likes of Procter & Gamble, Diageo and Danone, have long operated in Nigeria and are willing to go to some lengths to build brands and market share. \nThe market is huge: Nigeria has about 190 million people, and that is expected to rise to 300 million by 2030 and 400 million by 2050, according to U.N. data, which would make it the world’s third most populous country after China and India. \nCompanies are positioning themselves in the expectation that low household spending will rise as the economy grows and people come out of poverty and become consumers of packaged goods. \n“If you look at the per capita consumption levels and the penetration levels of consumer categories in Nigeria generally, they are below many comparable markets,” said Nsarkoh, pointing to India as an example. EMERGING FROM DOWNTURN \nBut Nigeria and Sub-Saharan Africa has not been the mecca some envisioned. A continent-wide downturn since 2014, tied to low commodity prices, has dampened hopes for companies. \nNet earnings of 28 consumer companies in nine African countries have grown just 2 percent per year in local currency in the five years to 2016, and even less in dollar terms, according to Exotix, an emerging markets-focused financial services firm. \nBut Nigeria, Africa’s top oil producer, last year emerged from its first recession in 25 years which was largely caused by low crude prices. The World Bank sees the country’s economy growing from 1 percent in 2017 to 2.5 percent this year. \nSub-Saharan Africa’s economy is meanwhile projected to pick up this year, with the World Bank predicting growth of 3.2 percent in 2018 and 3.5 percent in 2019, up from 2.4 percent in 2017, due to firmer commodity prices. \nIn Nigeria, doing business has been particularly tough since 2015, when the foreign exchange curbs and the devaluation of the naira currency meant the cost of importing certain goods, which the government wanted to be grown locally, increased markedly. \nHowever Unilever Nigeria’s financial results suggest that some of the tactics adopted to counter this may be paying off. \nIts operating profit almost tripled to 9.2 billion naira ($30.1 million) in the first nine months of 2017, the latest figures available, after growing 25 percent in 2016. Before that, profits were flat in 2015 and fell 40 percent in 2014. Fola Abimbola, an analyst at Nigerian bank FCMB, credited the latest profit rise to price increases, taken to offset the impact of currency devaluation, as well as the use of smaller pack sizes. \n“All of these companies have been selling smaller packs because, during the recession, people have less money to spend. People opt for smaller packs,” said Abimbola. \nThe use of smaller packaging is not new in emerging markets, but industry experts say that in Sub-Saharan Africa, it has not yet been widely adopted beyond the beer industry, and expect it to catch on further in coming years. MAIZE, MILLET, PALM OIL \nUnilever’s Nsarkoh said 90 percent of its Nigerian goods were now manufactured locally, up from 80 percent about three years ago, to make its business more resilient. As well as margarine, locally-made products include soap, tea and toothpaste. \nIn a sprawling manufacturing plant in the bustling Ikeja district of Lagos, for example, Unilever workers clad in white lab coats oversee production lines capable of producing hundreds of tubes of Close-Up toothpaste a minute. \nAmong rivals, Swiss group Nestle said that 41,600 local farmers suppled maize, soybean, sorghum and millet to its Nigerian factories. It said 82 percent of its inputs were sourced locally and that it aimed to extend to 100 percent where possible. It cited Golden Morn cereal, made from maize farmed in the northwestern state of Kaduna, as a product in which the goal had been achieved. \nPZ Cussons meanwhile has a stake in a 26,000-hectare palm oil plantation in the state of Cross River. Half of its vegetable oil is made using local palm oil, said Giannopoulos. Additional reporting by Martinne Geller; Editing by Pravin Char", "external_links": [], "published": "2018-01-24T16:29:00.000+02:00", "crawled": "2018-01-24T16:44:08.002+02:00", "highlightTitle": ""}