{"organizations": [], "uuid": "6561e611b0e7779ad3a79a6b9839acfef9cfdbd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-healthcare-religion/u-s-health-agency-to-issue-religious-objection-regulations-idUSKBN1F820T", "country": "US", "domain_rank": 408, "title": "U.S. health agency to issue religious objection regulations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:26:00.000+02:00", "replies_count": 0, "uuid": "6561e611b0e7779ad3a79a6b9839acfef9cfdbd5"}, "author": "", "url": "https://www.reuters.com/article/us-usa-healthcare-religion/u-s-health-agency-to-issue-religious-objection-regulations-idUSKBN1F820T", "ord_in_thread": 0, "title": "U.S. health agency to issue religious objection regulations", "locations": [], "entities": {"persons": [{"name": "chris reese", "sentiment": "none"}, {"name": "caroline humer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "obama administration", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 4:26 PM / in an hour U.S. health agency revokes Obama-era Planned Parenthood protection Yasmeen Abutaleb , Caroline Humer 3 Min Read \nWASHINGTON/NEW YORK (Reuters) - U.S. health officials said on Friday they were revoking legal guidance issued by the Obama administration that had sought to discourage states from trying to defund organizations that provide abortion services, such as Planned Parenthood. \nThe U.S. Department of Health and Human Services (HHS) officials also said the department was issuing a new regulation aimed at protecting healthcare workers’ civil rights based on religious and conscience objections. \nThe regulation protects the rights of healthcare workers from providing abortion, euthanasia, and sterilization, the officials said during a media call with reporters. \nOn Thursday, HHS said it was creating a new division that would focus on conscience and religious objections, a move it said was necessary after years of the federal government forcing healthcare workers to provide such services. \nHHS will issue a letter on Friday to state Medicaid offices rescinding 2016 guidance that the Obama administration gave after states including Indiana had tried to defund abortion providers such as Planned Parenthood. \nThe guidance “restricted states’ ability to take certain actions against family-planning providers that offer abortion services,” HHS said in a statement. \nThe Medicaid program, jointly funded by states and the federal government, provides healthcare services to the poor and disabled. Federal law prohibits Medicaid or any other federal funding for abortion services. \nThe move is the Trump administration’s latest effort to roll back policies developed under former President Barack Obama. \n“You are watching a struggle over abortion politics,” said Robin Wilson, a professor at University of Illinois College of Law. “In a sense you’re allowing state Medicaid regulators, through regulation, to reopen a whole can of worms around women’s health.” \nWilson said the impact could be immediate in states which, before the Obama-era guidance, had been working to effectively defund or limit funding to providers such as Planned Parenthood, which provide abortions but bill them separately so that they are not paid for by Medicaid. \nDawn Laguens, executive vice president for the Planned Parenthood Action Fund, said the move encourages states to block access to care at Planned Parenthood. \n“The law is clear: it is illegal to bar women from seeking care at Planned Parenthood. Longstanding protections within Medicaid safeguard every person’s right to access care at their qualified provider of choice,” Laguens said in a statement. NEW RULE \nThe rule will enforce statutes that guarantee these civil rights. Roger Severino, director of the Office of Civil Rights at HHS, said the office had received 34 complaints since Trump took office last January. \nExperts on Thursday said the move to protect workers on religious grounds raised the possibility it could provide legal cover for otherwise unlawful discrimination, and encourage a broader range of religious objections. Reporting by Caroline Humer in New York and Yasmeen Abutaleb in Washington; Editing by Paul Simao and Richard Chang", "external_links": [], "published": "2018-01-19T18:26:00.000+02:00", "crawled": "2018-01-19T18:38:26.014+02:00", "highlightTitle": ""}