{"organizations": [], "uuid": "33680ff83b8f23caee59a6f55348835b7600d272", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-biolife4d-names-dr-ravi-birla-as-its-chief-science-officer.html", "country": "US", "domain_rank": 767, "title": "BIOLIFE4D Names Dr. Ravi Birla as its Chief Science Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:01:00.000+02:00", "replies_count": 0, "uuid": "33680ff83b8f23caee59a6f55348835b7600d272"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-biolife4d-names-dr-ravi-birla-as-its-chief-science-officer.html", "ord_in_thread": 0, "title": "BIOLIFE4D Names Dr. Ravi Birla as its Chief Science Officer", "locations": [], "entities": {"persons": [{"name": "ravi birla", "sentiment": "negative"}, {"name": "birla", "sentiment": "none"}, {"name": "ravi", "sentiment": "none"}], "locations": [{"name": "birla", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "department of stem cell engineering", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "texas heart institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 02, 2018 (GLOBE NEWSWIRE) -- BIOLIFE4D , a biotech pioneer leveraging advances in tissue engineering to 3D print human organs viable for transplant, today announced it has named Dr. Ravi Birla as its Chief Science Officer. Birla previously served as the Associate Director of the Department of Stem Cell Engineering at the Texas Heart Institute in Houston.\nBirla is a highly regarded expert in the field of cardiac tissue and organ fabrication, cardiac tissue engineering, and regenerative medicine. With specific interests in whole heart bioengineering, fabrication of 3D heart muscle, bioartificial ventricles, valves and blood vessels, Birla is an ideal leader for BIOLIFE4D’s scientific team as the Company continues to develop its innovative technology for 3D printing a human heart viable for transplant.\n“As we continue through the development stage for our technology, it’s critical to ensure we have the brightest minds and best talent in the industry to support our mission and steer the direction of the Company forward. We are excited to have Ravi join our team, as his expertise aligns perfectly with what we are working to achieve,” said Steven Morris, CEO of BIOLIFE4D. “With his experience in heart bioengineering and fabrication of heart components Ravi will be an invaluable resource to both our scientific and medical teams. We have worked to build an incomparable team of experts, and the addition of Ravi further strengthens that.”\nBirla has a Ph.D. in biomedical engineering from the University of Michigan, Ann Arbor, and was also recruited to serve as Director of the Artificial Heart Laboratory with the Division of Cardiac Surgery at the renowned University of Michigan Medical School. He has served as a professor at both Tulane University and the University of Houston, and during both appointments, was the Principal Investigator of its NIH funded Artificial Heart Laboratory. Birla most recently served as the Associate Director of the Department of Stem Cell Engineering at the Texas Heart Institute, where he led day-to-day operations and scientific direction for large scale research initiatives.\n“I’m thrilled to be joining BIOLIFE4D at this incredibly exciting time for the company. My career has been dedicated to finding and developing innovative solutions for cardiac bioengineering, and I’m excited to be joining an organization that shares my vision,” said Birla. “I look forward to getting started with all of my colleagues, and to bring my expertise and experience to the forefront as we continue to develop our 3D bioprinting process. We have an incredible team of scientists and medical professionals at BIOLIFE4D, working diligently all toward the same important cause – to give people the gift of time – and it’s very rewarding to be a part of it. I remain committed to achieving the scientific goals of BIOLIFE4D and work diligently with the entire team to bioengineer human hearts suitable for patient transplantation.”\nBirla joins an impressive team of medical and scientific professionals at BIOLIFE4D, including: Adam Feinberg , Ph.D. (Scientific Advisory Team Leader); Dr. Jeffrey Morgan , M.D. (Chief Medical Officer); Ibrahim Ozbolat , Ph.D.; Sean Palecek , Ph.D.; Shayn Peirce-Cottler , Ph.D.; Ramille Shah , Ph.D.; Raimond Winslow , Ph.D.; and Janet Zoldan , Ph.D.\nBIOLIFE4D has filed a $50 million initial public offering with the Securities and Exchange Commission (SEC) under Regulation A+ equity crowdfunding rules, allowing everyday investors to help the company bring its groundbreaking cardiac tissue regeneration and organ replacement process to market. The “Reg A+” rules, outlined under the 2012 Jumpstart Our Business Startups (JOBS) Act, allow companies to raise up to $50 million in equity from non-accredited investors and others.\nTo learn more about BIOLIFE4D and to express interest in investing visit https://biolife4d.com/invest/ .\nAbout BIOLIFE4D\nBIOLIFE4D is a pioneering biotech company laser focused on leveraging advances in life sciences and tissue engineering to 3D bioprint a viable human heart suitable for transplant – lifesaving technology that gives patients the gift of time. With BIOLIFE4D, a patient-specific, fully functioning heart will be created through 3D bioprinting using the patient’s own cells – eliminating the well-known challenges of organ rejection and long donor waiting lists that plague existing organ transplant methods. Financed through equity crowdfunding, BIOLIFE4D is driving a movement to transform the treatment of heart disease, the leading cause of death among both men and women globally. Learn more and invest at biolife4d.com . Connect with us on social media on Twitter (@BIOLIFE4D), Facebook , LinkedIn , and Instagram .\nAlthough you are currently able to express your interest in investing, BIOLIFE4D Corporation is not yet accepting investments. No money or other consideration is being solicited by the company at this time, and if sent in response, will not be accepted. No offer to buy the securities can be accepted and no part of the purchase price can be received until the offering statement is qualified, and any such offer may be withdrawn or revoked, without obligation or commitment of any kind, at any time before notice of its acceptance given after the qualification date. If you indicate interest, your indication of interest involves no obligation or commitment of any kind.\nMedia Contact\nMatthew Bretzius\nFischTank Marketing and PR\nbiolife4d@fischtankpr.com\nSource:BIOLIFE4D Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=RZMcY9mBU3gDiixY0baPTOhdpkCe1DPRtZGGUQ9X6jkKL0XMhB-1G0J-xdN0wPbuZbSQYqwDqoUBTHyQHtFCieLRBKF8NRckxn0rIsj4kFksdYj4JWYLArsWJWnP_H5c", "https://www.globenewswire.com/Tracker?data=XBHu1FLCUOG6ekwT5y1ucDDV4YzCWb8gRy8naXVZuoUvkd6XEgJk-jLCJyBhqj_0IwGC7VGl101YNEUFRayZTcrHBEYougtSmeoLgfyP9ac=", "https://www.globenewswire.com/Tracker?data=A4vHbUTBrB6Xfa0OosR7oJA_3eBUFaJsf_N5xnjDr-FHDvqTCwFKH2aQ2IlhSlsC6I_N6Fe6TdWJuSt5AX_S7RxXrjlUOAMUdFbbDNnjHNSrjfS89UiUCpWWXYllFYef", "https://www.globenewswire.com/Tracker?data=LuZXTD0keIqBqTJATSSKXghuRqFFeoT3pw5y7aoMbV1NV_bI4OvhSg4DDept_O0XPZIW1O1_WG5XwI_pyrTUwxUVJMbeS8H8Yb7ONNpgRNo=", "https://www.globenewswire.com/Tracker?data=LgLffy_2p8NddcDcWQ97owk0Job676fsY5479PaWMlKUAuVT0ufgk1MOuNkukp6Zfh2F_quubBGHz7R2TTsJaPMnOOT3v7s3aw_VQNJ5LZs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2b39bd4f-2658-4c0b-8c4a-8df80c72950f", "https://www.globenewswire.com/Tracker?data=2edd5YQ0BNIqAbFddR7Om_a1cjowRHHcliYREhgzwjaoPGRPiiBo_L9HM_JpKNtNMwOE-s5VqeGvgZAcka3BJv4naM1PHnFxYSt0LwevpYIWFGk_j03Wp9D31K2ft6r8", "https://www.globenewswire.com/Tracker?data=jca5rm51hYuYcRjSk9dOtTGhecdHc0GIlhh28ZH-zREdgHU_7k6g00VfhUMQhFLk3YOCLJ39oDmb7chfzYiKE3qJnH7vRuEV1r_3hknPymfFqLY3bKI8Jrfc9F2vJPv1", "https://www.globenewswire.com/Tracker?data=jca5rm51hYuYcRjSk9dOtawVu1wfQNG7LKw0zZZpAd__IQXIzfAUewFLHxhL-N-NsuZsUpa4VAE7mqoGRatlVQ==", "https://www.globenewswire.com/Tracker?data=TXuSuNztT8MVh5coXI3WcA5KK7j-nr9fPJ-1F18_tXNGodz7CVKxvWwsr5QjKkHaUOVDAyx2PM2m2-5vAh-k2Q==", "https://www.globenewswire.com/Tracker?data=EmvBt9WTdHVIro3prnw0yQzPNlMRyIXvNJ1EloxUSiZN8fDgZf5u7LNmn0-FyEkFQW6bLRZxPQhQbYUuWS-c76vc1Hxj-HfCTDd69F_6g38=", "https://www.globenewswire.com/Tracker?data=x3Uand8dllcffUJraEY_mSxKSAeiqf16heJPGHlX8zTLs7bktRZh7EYVsQkuwVwB28FvjtmwRuzTl4fK6TwlQe5VGWAJiIqcPNhHVzIvYwg=", "https://www.globenewswire.com/Tracker?data=lSM4h6X02BrZUK-n1qJYB9w4e0sWySX7V9xT71S6PJ-Jp8OP-hd1BqmDqky4HRmyLrzsgfMFmdakj66_U6JsqZyg-mLGWus6uRFmEuJHAEk=", "https://www.globenewswire.com/Tracker?data=HBYMe5EOdIja6Be8WLslwd-IuOC-chqMq-KZKEXqHsfKYE8TaqnWQnsRHG0Un0c4zXUznfU71id6AnsFlTUyxQ==", "https://www.globenewswire.com/Tracker?data=sW2OJSjVuCl-_NumFgRAvVezAmqb4uBdx3H8ylA-mjb2ZMqlObaFqRpdV_lKwl0b977I9mCthKhstN1x09m__BbE5_bTd3muEwQ0poZcHWQ=", "https://biolife4d.com/invest/", "https://www.globenewswire.com/Tracker?data=Ud8tpSeRFVBbFRJbOTBy5JC9OWjLYn0gxCnGlNSN8Wkrys1IXOBCJrLZzonTfM7FqT5jnxpUiwOzDto0uCrrWWBTOOb4_KL2PV4xBTOTV7E=", "https://www.globenewswire.com/Tracker?data=X7i-QdIp6lLuIiA4olYlzXOOqMqTsPF17s2SrTbteAznshfab0XIkKQxk1jpBa4winCGs5fU_IPLMwOvoy2F9-aF10xWB4IW7_9uTXitpl0="], "published": "2018-01-02T16:01:00.000+02:00", "crawled": "2018-01-02T16:29:55.000+02:00", "highlightTitle": ""}