{"organizations": [], "uuid": "2ba6609a2fe87484479ddc6742cb60a8c62d3fa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-envestnet-completes-acquisition-of-foliodynamix.html", "country": "US", "domain_rank": 767, "title": "Envestnet Completes Acquisition of FolioDynamix", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.948, "site_type": "news", "published": "2018-01-03T00:05:00.000+02:00", "replies_count": 0, "uuid": "2ba6609a2fe87484479ddc6742cb60a8c62d3fa7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-envestnet-completes-acquisition-of-foliodynamix.html", "ord_in_thread": 0, "title": "Envestnet Completes Acquisition of FolioDynamix", "locations": [], "entities": {"persons": [{"name": "joseph mrak", "sentiment": "none"}, {"name": "jud bergman", "sentiment": "none"}, {"name": "envestnet", "sentiment": "none"}], "locations": [], "organizations": [{"name": "actua corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Envestnet (NYSE:ENV), a leading provider of intelligent systems for wealth management and financial wellness, today announced that it has completed the acquisition of FolioDynamix from Actua Corp. The acquisition was first announced on September 25, 2017.\n“We are pleased to welcome FolioDynamix and their clients and partners to Envestnet,” said Jud Bergman, Envestnet Chairman and CEO. “This is the next important step in developing a financial wellness network that enables advisors and enterprises to improve their productivity and deliver better outcomes for their clients.”\n“By joining forces with Envestnet, our customers will have access to the trading tools and commission and brokerage support that they are accustomed to, as well as Envestnet’s robust and integrated wealth management solutions,” said Joseph Mrak, Chairman and CEO of FolioDynamix. “We are excited to see where this collaboration takes us and the wealth management industry as a whole.”\nFolioDynamix provides financial institutions and registered investment advisors with an end-to-end technology solution which includes a suite of advisory tools that assist advisors in creating model portfolios and delivering overlay management services. The acquisition will add complementary trading tools as well as commission and brokerage business support to Envestnet’s existing suite of offerings.\nIn connection with the Acquisition, Envestnet paid $195 million in cash for all the outstanding shares of FolioDynamix, subject to certain closing and post-closing adjustments. Envestnet funded the Acquisition price with borrowings under its revolving credit facility.\nAbout Envestnet\nEnvestnet, Inc. (NYSE:ENV) is a leading provider of intelligent systems for wealth management and financial wellness. Envestnet’s unified technology enhances advisor productivity and strengthens the wealth management process. Envestnet empowers enterprises and advisors to more fully understand their clients and deliver better outcomes.\nEnvestnet enables financial advisors to better manage client outcomes and strengthen their practices. Institutional-quality research and advanced portfolio solutions are provided through Envestnet | PMC, our Portfolio Management Consultants group. Envestnet | Yodlee is a leading data aggregation and data analytics platform powering dynamic, cloud-based innovation for digital financial services. Envestnet | Tamarac provides leading rebalancing, reporting, and practice management software for advisors. Envestnet | Retirement Solutions provides an integrated platform that combines leading practice management technology, research, data aggregation and fiduciary managed account solutions.\nMore than 59,000 advisors and 2,900 companies including: 16 of the 20 largest U.S. banks, 39 of the 50 largest wealth management and brokerage firms, over 500 of the largest Registered Investment Advisers, and hundreds of Internet services companies, leverage Envestnet technology and services. Envestnet solutions enhance knowledge of the client, accelerate client on-boarding, improve client digital experiences, and help drive better outcomes for enterprises, advisors, and their clients.\nFor more information on Envestnet, please visit www.envestnet.com and follow @ENVintel.\nCautionary Statement Regarding Forward-Looking Statements\nThe forward-looking statements made in this press release concerning, among other things, Envestnet, Inc.’s (the “Company”) acquisition of FolioDynamix (the “FolioDynamix Acquisition”) and the expected benefits of the acquisition and expected financial performance and outlook, its strategic operational plans and growth strategy are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties and the Company’s actual results could differ materially from the results expressed or implied by such forward-looking statements. Furthermore, reported results should not be considered as an indication of future performance. The potential risks, uncertainties and other factors that could cause actual results to differ from those expressed by the forward-looking statements in this press release include, but are not limited to, the possibility that any of the anticipated benefits of the FolioDynamix Acquisition will not be realized to the extent or when expected; the risk that integration of FolioDynamix’s operations with those of the Company will be materially delayed or will be more costly or difficult than expected; the challenges of integrating and retaining key employees; the effect of the FolioDynamix Acquisition on FolioDynamix’s and the Company’s business relationships, operating results and business generally; potential exposure to state and local non-income tax obligations, the Company’s ability to remediate material weaknesses in internal controls over financial reporting and associated costs, difficulty in sustaining rapid revenue growth, which may place significant demands on the Company’s administrative, operational and financial resources, fluctuations in the Company’s revenue, the concentration of nearly all of the Company’s revenues from the delivery of investment solutions and services to clients in the financial advisory industry, the impact of market and economic conditions on revenues, the Company’s reliance on a limited number of clients for a material portion of its revenue, the renegotiation of fee percentages or termination of the Company’s services by its clients, the Company’s ability to identify potential acquisition candidates, complete acquisitions and successfully integrate acquired companies, potential dilution from issuing equity securities or a weaker balance sheet from using cash or incurring debt to finance acquisitions, the impact of market conditions on the Company’s ability to issue additional debt and equity to fund acquisitions, compliance failures, regulatory or third-party actions against the Company, the failure to protect the Company’s intellectual property rights, the Company’s inability to successfully execute the conversion of its clients’ assets from their technology platform to the Company’s technology platform in a timely and accurate manner, general economic conditions, political and regulatory conditions, the impact of fluctuations in interest rates on the Company’s business, ability to expand the Company’s relationships with existing customers, grow the number of customers and derive revenue from new offerings such as the Company’s data analytic solutions and market research services and premium FinApps, the results of the Company’s investments in research and development, the Company’s data center and other infrastructure, the Company’s ability to realize operating efficiencies, the advantages of the Company’s solutions as compared to those of others, the Company’s ability to retain and hire necessary employees and appropriately staff its operations, in particular its India operations and ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.envestnet.com&esheet=51736469&newsitemid=20180102005689&lan=en-US&anchor=www.envestnet.com&index=1&md5=d19df9754d2b9a58d3e7bbfea344259a", "http://ir.envestnet.com/", "http://www.businesswire.com/news/home/20180102005689/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.envestnet.com%2F&esheet=51736469&newsitemid=20180102005689&lan=en-US&anchor=http%3A%2F%2Fir.envestnet.com%2F&index=3&md5=c0cab6e92c0629ad4b09e0d54eba4587", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51736469&newsitemid=20180102005689&lan=en-US&anchor=www.sec.gov&index=2&md5=0cd2244042c69f511308e30c05aba48f"], "published": "2018-01-03T00:05:00.000+02:00", "crawled": "2018-01-03T02:07:07.006+02:00", "highlightTitle": ""}