{"organizations": [], "uuid": "4cb18dd6f989796b7584d107ea9f247386eaf616", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-cargill-reports-fiscal-2018-second-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Cargill reports fiscal 2018 second-quarter results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "4cb18dd6f989796b7584d107ea9f247386eaf616"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-cargill-reports-fiscal-2018-second-quarter-results.html", "ord_in_thread": 0, "title": "Cargill reports fiscal 2018 second-quarter results", "locations": [], "entities": {"persons": [{"name": "david maclennan", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cargill", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 3, 2018 /PRNewswire/ -- Cargill today reported financial results for the fiscal 2018 second quarter and first half ended Nov. 30, 2017. Key results include:\nAdjusted operating earnings totaled $948 million, an 8 percent decrease against last year's strong comparative of $1.03 billion. For the first half, adjusted operating earnings stood at $1.84 billion, down 1 percent from last year. Net earnings for the quarter on a U.S. GAAP basis were $924 million, down 6 percent from $986 million a year ago. First-half net earnings increased 3 percent to $1.9 billion. Second-quarter revenues rose 8 percent to $29.2 billion, bringing the year-to-date figure to $56.5 billion.\n\"Even as conditions vary across our global markets, we continue to realize greater benefits from operating as an integrated company with a unique combination of talent, assets, insights and solutions,\" said David MacLennan, Cargill's chairman and chief executive officer.\nHe noted that during the quarter, the company announced more than $1 billion in agreed acquisitions, joint ventures and new investments in facilities. \"Thanks to the results of our recent strong performance, we are reinvesting in ways that enable our teams to achieve more for our customers and lead for growth.\"\nSegment results\nAdjusted operating earnings in Animal Nutrition & Protein narrowly exceeded last year's strong second quarter. Animal nutrition earnings rose across the global business, with improvement led by premix and feed additives. Protein results in North America decreased slightly against a strong comparative period. As cattle costs moved up, retail demand for beef remained brisk, as did exports of U.S. beef. Pre-season marketing by the U.S. turkey business drove whole-bird sales in advance of the Thanksgiving holiday. The segment's global poultry business trailed the year-ago quarter, as good performance in parts of Southeast Asia was offset by softer earnings elsewhere. In total, Animal Nutrition & Protein was the largest contributor to adjusted operating earnings in the second period.\nCargill completed several acquisitions in December that expand its focus on animal micro-nutrition. It purchased Cedar Rapids, Iowa-based Diamond V, a developer and manufacturer of natural feed additives, known as microbials, which improve animal health and performance by optimizing digestive function and immune strength. The acquisition complements Cargill's recently formed partnership with Austria's Delacon, a leading maker of natural, plant-based feed additives. Both investments support the market shift toward sustainable, natural feed ingredients that improve animal health and embrace changing consumer values.\nThe company also acquired Brazilian cattle feed producer Integral Animal Nutrition. It specializes in free-choice minerals that help grazing cattle meet their nutritional needs. Cargill bought full ownership of its premix joint venture in South Africa, which increases the company's presence in a region where protein demand is growing.\nIn poultry, Cargill is forming a joint venture with U.K.-based Faccenda Foods. Once completed, the venture will serve the country's food retailers and foodservice companies with fresh chicken, turkey and duck. With regard to organic growth, Cargill is investing $146 million in its cooked meats facility in Nashville, Tennessee. Acquired last year, the new outlay will double the plant's pizza toppings capacity and fund the construction of a pepperoni production facility. The two projects will come on line in mid-2018 and mid-2019, respectively.\nEarnings in Food Ingredients & Applications were up broadly, with a majority of the segment's food ingredient businesses posting good gains for the quarter. Cocoa and chocolate products, malts for brewers, distillers and food manufacturers, as well as sweeteners and starches for food and other applications led results in most regions. The segment's Asia-based businesses also contributed strongly to the quarter. Salt results decreased from the prior year, due in part to lower sales volume for deicing products after two mild North American winters. In addition to deicing and other industrial applications, the business serves food manufacturers with a wide range of salt ingredients and sodium reduction products.\nOrigination & Processing was down moderately from last year's second quarter, as another year of very large U.S. corn and soybean crops added to the buildup in global stocks. Although global demand continues to grow, today's abundant supplies have weighed on markets, diminishing volatility and trading opportunities. Even so, trading performance in North America was ahead of last year as was oilseed processing in Asia.\nThe segment is focused on deploying technologies that will better connect its global operations, enhance trading analytics and risk management, and increase supply chain sustainability – capabilities that bring additional value to customers. Supporting this effort are selective investments in new facilities. The company began constructing a $90 million biodiesel facility in Wichita, Kansas, marking its third such facility in the U.S. The new plant, which is set to open in early 2019, will allow Cargill to better serve biofuel producers in the Midwest and Southwest, and create an additional consumption flow for U.S. soybean production.\nResults in Industrial & Financial Services pulled ahead of the prior year, buoyed by increased returns from asset management investments as well as improved profits in ocean transportation. Trade and structured finance was up slightly against a strong comparative period; it provides financial solutions that facilitate trade and mitigate trade-related risks for companies doing business in emerging and developed markets. In late December, Cargill completed the sale of its U.S. metals business to Japanese steel trader and distributor Metal One. Cargill remains active in energy and ferrous markets through its biofuels, financial risk management, metals and shipping businesses.\nNew solutions for positive impact\nNumerous projects demonstrate how Cargill is advancing traceability and sustainability in supply chains. During the quarter, a pilot in the turkey business used blockchain technology to track Honeysuckle White® birds from the farm to Thanksgiving tables, providing consumers in select markets with information about the farms where individual animals were raised. In Canada, Cargill is launching a pilot to trace and verify a fully certified beef supply chain that meets the criteria for the Canadian Roundtable for Sustainable Beef. Through the program, customers will receive fully audited beef, while farmers and ranchers will earn a financial credit for participating. And Cargill's cocoa business released its latest Cocoa Promise Report , celebrating five years of the Cargill Cocoa Promise that is helping ensure a vibrant cocoa sector for generations to come.\nCargill also is developing products that satisfy consumers' changing preferences for healthier, simpler foods. The first product in the new SimPure™ line blends tapioca and potato starches to give food makers the same taste, texture, appearance and stability of modified starch with simplified, ", "external_links": ["http://www.cargill.com/150/", "http://www.cargill.com/news/index.jsp", "http://www.cargill.com/", "https://www.cargill.com/sustainability/cocoa/download-the-cargill-cocoa-promise-report", "http://www.cargill.com/company/financial/index.jsp", "http://www.prnewswire.com/news-releases/cargill-reports-fiscal-2018-second-quarter-results-300576723.html"], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T16:31:11.011+02:00", "highlightTitle": ""}