{"organizations": [], "uuid": "e56a8ecc4dedd808b41f9b16a76d3b080df0b050", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-hna-group-investment/hnas-commodity-and-logistics-unit-wont-chase-u-s-ma-deals-in-2018-executive-idUSKBN1F515G", "country": "US", "domain_rank": 408, "title": "HNA's commodity and logistics unit won't chase U.S. M&A deals in 2018: executive", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:56:00.000+02:00", "replies_count": 0, "uuid": "e56a8ecc4dedd808b41f9b16a76d3b080df0b050"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hna-group-investment/hnas-commodity-and-logistics-unit-wont-chase-u-s-ma-deals-in-2018-executive-idUSKBN1F515G", "ord_in_thread": 0, "title": "HNA's commodity and logistics unit won't chase U.S. M&A deals in 2018: executive", "locations": [], "entities": {"persons": [{"name": "ding lei", "sentiment": "none"}, {"name": "ding", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "road", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "hong kong-based", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "hna", "sentiment": "neutral"}, {"name": "hna group", "sentiment": "neutral"}, {"name": "hna innovation finance", "sentiment": "none"}, {"name": "cfius", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "committee on foreign investment", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - HNA Group’s commodity trading and logistics unit, which last month bought a big stake in Glencore’s ( GLEN.L ) oil storage business, will not chase U.S. deals in 2018 partly due to Washington’s increased scrutiny of Chinese investments, a senior executive of the unit said.\nDing Lei, chief innovation officer of Hong Kong-based HNA Innovation Finance, HNA Group’s subsidiary specializing in commodities, logistics and investment services, told Reuters in an interview on Tuesday that the unit would instead focus on deals that fit with China’s strategic Belt and Road initiative.\n“(CFIUS) was part of the reason (why we are not looking at U.S. deals),” Ding said. “Secondly, the Chinese market and the Belt and Road markets are huge. We will perform pretty well if we can do business in those markets.”\nThe multi-agency Committee on Foreign Investment in the United States (CFIUS), which scrutinizes deals for potential national security threats, has toughened its stance on the sale of U.S. companies to Chinese buyers, blocking deals in sensitive industries and putting others through a prolonged review.\n“Our unit was established less than a year ago. Why would we want to crack such a tough nut now?,” he said, referring to the U.S. market with its tougher dealmaking environment.\nHNA Innovation Finance, whose portfolio firms include Singaporean logistics provider CWT Ltd, would focus on deals in countries in Southeast Asia, Africa as well as Central and Eastern Europe, in line with China’s Belt and Road policies, Ding said.\nAdam Tan, CEO of the Chinese airlines-to-property conglomerate, had said in September HNA Group would keep investing in the United States, one of its key overseas markets.\nSince then, more Chinese deals have been struck down by the United States, while the fate of HNA Group’s purchase of hedge fund investment firm SkyBridge Capital in a consortium, announced in January last year, remains unclear as it has not received U.S. regulatory approval.\nDing, however, said HNA Innovation Finance is not ruling out going for U.S. opportunities in the future.\nIt is currently seeking CFIUS approval for three assets located in America, as part of its $775 million purchase of a 51 percent stake in Glencore’s oil storage and logistics businesses.\nIndebted HNA Group, which has announced over $50 billion in overseas deals since 2015, is also facing mounting pressure on its finances after Beijing told major Chinese banks last June to review their credit exposure to HNA and a handful of other non-state companies.\nAgainst a backdrop of concerns about the group’s rising financing costs, the innovation finance unit, which has secured private-funds licenses in mainland China and Hong Kong, plans to set up several investment funds domestically and overseas to diversify from banking loans and help ease liquidity pressure.\n“HNA could smoothly get refinancing from banks in the past. But last year, we did have to go through more procedures,” Ding said, adding the proposed funds would be used to help finance the unit’s future deals. He declined to elaborate further about the funding plans.\nReporting by Julie Zhu and Kane Wu; Editing by Muralikumar Anantharaman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T18:56:00.000+02:00", "crawled": "2018-01-16T13:10:29.010+02:00", "highlightTitle": ""}