{"organizations": [], "uuid": "17cc845b7e29e430713e79bf99a8b5e25f219cef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/23/103964991-RTSP1JN.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/donald-trump-could-spice-up-the-state-of-the-union-address-commentary.html", "country": "US", "domain_rank": 767, "title": "Donald Trump could spice up the State of the Union address-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-30T23:00:00.000+02:00", "replies_count": 0, "uuid": "17cc845b7e29e430713e79bf99a8b5e25f219cef"}, "author": "Joshua Spivak", "url": "https://www.cnbc.com/2018/01/30/donald-trump-could-spice-up-the-state-of-the-union-address-commentary.html", "ord_in_thread": 0, "title": "Donald Trump could spice up the State of the Union address-commentary", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "joshua spivak", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "hugh l. carey", "sentiment": "none"}], "locations": [], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "institute for government reform published updated moments ago jonathan ernst | reuters donald trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Ernst | Reuters Donald Trump \nIf there's one presidential event made for Donald Trump, it is the State of the Union address. Although originally intended as a straightforward annual report from the executive to the presumably more powerful Congress, the event has been transformed into another chance for the president to grab the spotlight. \nWhile the opposition party is given the opportunity to respond, the event is transparently political, with the benefit of having all the networks devote their prime time schedule to its coverage. \nThere's no real requirement for a formal State of the Union, and in fact for almost half of America's existence, there was no such public address. The Constitution simply says that the president \"shall from time to time give to the Congress Information of the State of the Union…\" though, as with much else in the executive section, it leaves the requirement open to interpretation. \nUnder this original constitutional framework, the goal may have been the reverse of how the modern State of the Union works. Congress was the one setting out a legislative agenda and the president was to report on how he would enact and \"execute\" these plans. As the presidency has grown in power, however, Congress has abdicated this policy setting goal to the executive branch, resulting in a State of the Union completely focused on the president's agenda. \"Trump with his penchant for stirring up bitter fights with both Democrats and Republicans, may actually be able to turn the State of the Union into a must-watch affair.\" \nGeorge Washington decided to give an annual in-person report. John Adams followed suit. But the shy Thomas Jefferson decided to end the tradition, which he felt was too monarchical. His State of the Union was a straightforward letter to Congress. Jefferson's precedent was then followed by every president for over a century. Woodrow Wilson, a fan of both publicity and a powerful presidency, decided to one-up his predecessor and rival Theodore Roosevelt and address Congress directly. \nEvery president since has not only followed Wilson's idea, but they have repeatedly tried to top it. Calvin Coolidge put in on the radio in 1923, Harry Truman's was televised in 1947, and Lyndon Johnson turned it into a primetime event in 1965. Once Johnson went prime time, the Republicans managed to get a minority party response starting in 1966. That itself has become a coveted, though less watched, speaking opportunity. Ronald Reagan started inviting prominent guests as mid-speech talking points in 1982. \nTrump is reportedly taking an innovative step himself, by using the event as a direct fundraising tool. Trump's campaign allegedly sent out a text to prospective donors stating that they will list the names of all donors who contribute during the live-stream broadcast. \nWhat no president has managed to do in recent years is make the actual address interesting. The notable State of the Union moments in recent years were unscripted and unwanted, such as when Joe Wilson, an obscure Republican congressman, yelled \"you lie\" at President Barack Obama, or when Supreme Court Justice Samuel Alito was caught on camera mouthing an objection to Obama comments on the court's Citizens United decision. \nThe speech has become pomp and circumstance tied in with a laundry list of proposals that the president hopes to push for the year ahead. Trump with his penchant for stirring up bitter fights with both Democrats and Republicans, may actually be able to turn the State of the Union into a must-watch affair. \nHe may be more willing to attack on specific members of Congress or conversely try to make a bi-partisan gesture on, say, infrastructure spending. He could use it as a moment to make a shocking announcement, such as pulling out of NAFTA, or as an opportunity to defend himself against the FBI Russia investigation and special counsel Robert Mueller. \nAccording to one correspondent who attended a pre-SOTU anchor lunch at the White House, the president is hoping to \" bring our country back from a tremendous divisiveness.\" A \"Kumbaya\" moment would be another surprising outcome. \nAny of these scenarios could make the State of the Union a more riveting affair. \nBut we may be better off if the address is not so exciting. A president listing his policy plans for the year is actually as worthwhile an address as the nation can hope for. Most voters may immediately, and justifiably, forget the event. But if we wanted to hold the highest elected officer in the land to his promises, this is at least an occasion that the president sets out an actual agenda in front of the very people who could enact it, and the voters who put him in office. \nCommentary by Joshua Spivak, a senior fellow at the Hugh L. Carey Institute for Government Reform at Wagner College in New York. He blogs at The Recall Elections Blog . Follow him on Twitter @recallelections . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-30T23:00:00.000+02:00", "crawled": "2018-01-30T23:01:18.021+02:00", "highlightTitle": ""}