{"organizations": [], "uuid": "aec281e1fa95fa80930fcd2219da1ac81bfe4274", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-silicon-motion-announces-preliminary-fourth-quarter-2017-revenue-and-earnings-conference-call-details.html", "country": "US", "domain_rank": 767, "title": "Silicon Motion Announces Preliminary Fourth Quarter 2017 Revenue and Earnings Conference Call Details", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:00:00.000+02:00", "replies_count": 0, "uuid": "aec281e1fa95fa80930fcd2219da1ac81bfe4274"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-silicon-motion-announces-preliminary-fourth-quarter-2017-revenue-and-earnings-conference-call-details.html", "ord_in_thread": 0, "title": "Silicon Motion Announces Preliminary Fourth Quarter 2017 Revenue and Earnings Conference Call Details", "locations": [], "entities": {"persons": [{"name": "riyadh lai", "sentiment": "none"}, {"name": "wallace kou", "sentiment": "none"}, {"name": "jason tsai", "sentiment": "none"}], "locations": [{"name": "taipei", "sentiment": "none"}, {"name": "milpitas", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "silicon motion technology cor", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TAIPEI, Taiwan and MILPITAS, Calif., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Silicon Motion Technology Corporation (NasdaqGS: SIMO) (“Silicon Motion” or the “Company”), a global leader in designing and marketing NAND flash controllers for solid state storage devices, announces that based on its preliminary fourth quarter financial results, revenue is expected to be at the upper end of the original guidance range of $130 million to $136 million that the company issued on October 27, 2017. Gross margin (non-GAAP) is expected to be near the midpoint of the company's original guidance range of 45.5% to 47.5%.\nThe Company will release its fourth quarter 2017 financial results after the market closes on February 6, 2018 and will host a conference call on February 7, at 8 am Eastern Time.\n(Speakers)\nWallace Kou, President & CEO\nRiyadh Lai, CFO\nJason Tsai, Senior Director of Investor Relations & Strategy\nCONFERENCE CALL ACCESS NUMBERS:\nUSA (Toll Free): 1 866 519 4004 USA (Toll): 1 845 675 0437 Taiwan (Toll Free): 0080 112 6920 Participant Passcode: 5679806 REPLAY NUMBERS (for 7 days):\nUSA (Toll Free): 1 855 452 5696 USA (Toll): 1 646 254 3697 Participant Passcode: 5679806 This call will be webcasted on the Company’s website at www.siliconmotion.com . The webcast will also be distributed through the Thomson Reuters StreetEvents Network to both institutional and individual investors.\nA BOUT SILICON MOTION :\nWe are the global leader in supplying NAND flash controllers for solid state storage devices and the merchant leader in supplying SSD controllers. We have the broadest portfolio of controller technologies and solutions and ship over 750 million NAND controllers annually and have shipped over five billion NAND controllers in the last ten years, more than any other company in the world. Our controllers are widely used in embedded storage products such as SSDs and eMMCs which are found in smartphones, PCs and industrial and commercial applications. We also supply specialized high-performance hyperscale datacenter and industrial SSD solutions. Our customers include most of the NAND flash vendors, storage device module makers and leading OEMs. For further information on Silicon Motion, visit us at www.siliconmotion.com .\nFORWARD-LOOKING STATEMENTS:\nThis press release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. In some cases, you can identify forward-looking statements by terminology such as \"may,\" \"will,\" \"should,\" \"expect,\" \"intend,\" \"plan,\" \"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" \"continue,\" or the negative of these terms or other comparable terminology. Although such statements are based on our own information and information from other sources we believe to be reliable, you should not place undue reliance on them. These statements involve risks and uncertainties, and actual market trends or our actual results of operations, financial condition or business prospects may differ materially from those expressed or implied in these forward looking statements for a variety of reasons. Potential risks and uncertainties include, but are not limited to the unpredictable volume and timing of customer orders, which are not fixed by contract but vary on a purchase order basis; the loss of one or more key customers or the significant reduction, postponement, rescheduling or cancellation of orders from these customers; general economic conditions or conditions in the semiconductor or consumer electronics markets; decreases in the overall average selling prices of our products; the payment or non-payment of cash dividends in the future at the discretion of our board of directors; changes in the relative sales mix of our products; our ability to successfully integrate Shannon Systems; changes in our cost of finished goods; the availability, pricing, and timeliness of delivery of other components and raw materials used in our customers' products; our customers' sales outlook, purchasing patterns, and inventory adjustments based on consumer demands and general economic conditions its customers and consumers; our ability to successfully develop, introduce, and sell new or enhanced products in a timely manner; and the timing of new product announcements or introductions by us or by our competitors. For additional discussion of these risks and uncertainties and other factors, please see the documents we file from time to time with the Securities and Exchange Commission, including our Annual Report on Form 20-F filed on April 28, 2017, as amended on May 2, 2017. We assume no obligation to update any forward-looking statements, which apply only as of the date of this press release.\nInvestor Contacts:\nJason Tsai\nSenior Director of IR and Strategy\nE-mail: ir@siliconmotion.com\nSelina Hsieh\nInvestor Relations\nE-mail: ir@siliconmotion.com\nSource:Silicon Motion Technology Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=2EaflZKyzPGB47daWneZlbU08C1KT2L2u4zvf_iwDtriJsFOuSi7sVMldgVdKZsdEyxC7lajJm1AR4Ec2AT3erdwkFEhOvzyw8IafCNJntQ=", "https://www.globenewswire.com/Tracker?data=FP7WDPya-eNBhvP84k6BuD50YWspu7tbJDoRNe5vlsjPW9SU0yYsgQuJRJtW7kU_BHn37pmDWiW7fW07L0QJzPB0OxMs32Fli8SL8THl0rg=", "https://www.globenewswire.com/Tracker?data=FP7WDPya-eNBhvP84k6BuD50YWspu7tbJDoRNe5vlsigjuQwEJmxv4pSTqQo38iL0t363F-w7ihpAapRo8RrIDPTGDZpzyenx0X5_8SklWk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3708a32b-b567-40f0-b98d-4e7331588316", "https://www.globenewswire.com/Tracker?data=2EaflZKyzPGB47daWneZlanwnulCYqF-8Rp7bZykqPJL2EmLm_yJGgYcPcVlFcSb8Av36T5nbtQ04QeQlThCVz3ejV8u3bjQX5BikgeKa5o="], "published": "2018-01-05T16:00:00.000+02:00", "crawled": "2018-01-05T18:01:29.017+02:00", "highlightTitle": ""}