{"organizations": [], "uuid": "88b426ee031fd32a28713443aff1bb97e8a574f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 37, "shares": 37, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220001442&w=1200&r=LYNXMPEE060A6", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-malaysia-politics/malaysias-opposition-alliance-names-92-year-old-mahathir-as-pm-candidate-idUKKBN1EW0AJ", "country": "US", "domain_rank": 408, "title": "Malaysia's opposition alliance names 92-year old Mahathir as PM candidate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T11:52:00.000+02:00", "replies_count": 0, "uuid": "88b426ee031fd32a28713443aff1bb97e8a574f3"}, "author": "", "url": "https://uk.reuters.com/article/uk-malaysia-politics/malaysias-opposition-alliance-names-92-year-old-mahathir-as-pm-candidate-idUKKBN1EW0AJ", "ord_in_thread": 0, "title": "Malaysia's opposition alliance names 92-year old Mahathir as PM candidate", "locations": [], "entities": {"persons": [{"name": "mahathir", "sentiment": "negative"}, {"name": "wan aziza", "sentiment": "none"}, {"name": "mahathir mohamad", "sentiment": "none"}, {"name": "najib razak", "sentiment": "none"}, {"name": "anwar", "sentiment": "none"}, {"name": "anwar ibrahim", "sentiment": "none"}], "locations": [{"name": "malaysia", "sentiment": "none"}, {"name": "putrajaya", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 9:57 AM / Updated 39 minutes ago Malaysia's opposition alliance names 92-year old Mahathir as PM candidate Reuters Staff 3 Min Read \nKUALA LUMPUR (Reuters) - Malaysia’s opposition coalition on Sunday named 92-year old former premier Mahathir Mohamad as its prime ministerial candidate for a general election that must be called by August. FILE PHOTO: Former Malaysian prime minister Mahathir Mohamad speaks during an interview with Reuters in Putrajaya, Malaysia, March 30, 2017. REUTERS/Lai Seng Sin/File Photo \nWith the country’s most popular opposition leader Anwar Ibrahim in jail, Mahathir is seen as the biggest threat for Prime Minister Najib Razak, who is engulfed in a corruption scandal. \nMahathir, who earned a reputation during his 22-year tenure as prime minister of being a no-nonsense authoritarian with little time for dissenters promoting liberal values, stands to become the world’s oldest leader if the opposition wins. \nA victory could also potentially pave the way for former Mahathir foe Anwar to become the prime minister. \nMahathir and Anwar’s wife Wan Azizah Wan Ismail will be the Pakatan Harapan coalition’s candidates for the premier and deputy prime ministerial posts respectively, secretary general Saifuddin Abdullah said at the alliance’s convention. \nIf the opposition wins, the component parties have agreed to immediately commence the legal processes to obtain a royal pardon for Anwar, Saifuddin said. \n“...So that Anwar could immediately play a role in the federal government and subsequently be proposed as a candidate for the eighth prime minister,” he said. \nThe Mahathir-Anwar coalition and their endorsement of each other is a turnaround from their bitter feud that has shaped Malaysia’s political landscape for nearly two decades. \nAnwar was once a protege of Mahathir, and the rising star of Malaysian politics, but they had a falling-out in the late 1990s. Soon afterwards, Anwar was jailed on charges of sodomy and graft, after being sacked as the deputy prime minister. He denied the charges, dismissing them as politically motivated. \nAnwar later led an opposition alliance to stunning electoral gains in 2013. Najib’s Barisan Nasional coalition lost the popular vote in that election, but managed to stay in power after winning a majority of the seats in parliament. \nBut Anwar was convicted and jailed again in 2013 for sodomizing a former aide, a charge he and his supporters describe as an attempt to end his career. \nThe sodomy conviction disqualifies Anwar from political office and from contesting the next election. A royal pardon, however, would let him contest. \nOpposition to Prime Minister Najib has brought Anwar and Mahathir back together, with their parties now working in the opposition coalition. \nNajib has been embroiled in a corruption scandal involving state fund 1Malaysia Development Berhad (1MDB). In civil lawsuits, the U.S. Justice Department has alleged that about $4.5 billion was misappropriated from 1MDB. \nThe fund has denied any wrongdoing and Najib, who founded 1MDB, has denied all allegations of corruption against him and was cleared of wrongdoing by Malaysia’s attorney-general. Reporting by Liz Lee, writing by A. Ananthalakshmi; Editing by Himani Sarkar", "external_links": [], "published": "2018-01-07T11:52:00.000+02:00", "crawled": "2018-01-07T12:24:39.056+02:00", "highlightTitle": ""}