{"organizations": [], "uuid": "294fc6ebc3e6785a2af826d9ab4c5d39b7db9e37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-easteurope-markets-bonds-ecb/no-boom-to-doom-for-central-europes-bonds-when-ecb-stimulus-ends-idUSKBN1FC1MD", "country": "US", "domain_rank": 408, "title": "No boom to doom for central Europe's bonds when ECB stimulus ends", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:53:00.000+02:00", "replies_count": 0, "uuid": "294fc6ebc3e6785a2af826d9ab4c5d39b7db9e37"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-easteurope-markets-bonds-ecb/no-boom-to-doom-for-central-europes-bonds-when-ecb-stimulus-ends-idUSKBN1FC1MD", "ord_in_thread": 0, "title": "No boom to doom for central Europe's bonds when ECB stimulus ends", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Seven years of unprecedented European Central Bank stimulus have helped feed a 40 billion-euro boom in foreign buying of central European debt, raising the question - what happens when it all dries up this year?\nSigns are that the countries concerned will have no problem surviving the end of euro zone largesse, which pilled over to them indirectly.\nBefore the ECB’s money taps opened in 2011, foreigners held 150 billion zloty ($44 billion/36 billion euros) of Polish domestic government debt and 167.5 billion Czech crowns ($8.07 billion/6.60 billion euros) of Czech local debt, or 12 percent of Prague’s overall total, central bank and debt office figures show.\nFast forward and more than 3.5 trillion euros ($4.3 trillion) of ECB stimulus later and the numbers have spiraled.\nForeign holdings of Polish bonds are up over a third at 200 billion zloty while it topped 725 billion crowns in the Czech Republic last year, over half its domestic debt.\n“Though the ECB wasn’t buying Polish, Czech, Hungarian government bonds, just by the virtue of the fact rates are so low in core Europe, it has allowed those eastern European economies to perform well,” said Goldman Sachs Asset Management’s managing director of global fixed income, Jeremy Cave.\nWhile the clear link between ECB stimulus and foreign buying of CEE bonds suggests outflows are likely when the ECB pulls the plug -- possibly this year -- there are also various other factors that have brought in money.\nFor instance, at least half the money that piled into Czech bonds last year was down to foreign investors’ betting on what would happen once Prague remove the currency peg that had been suppressing the crown, says HSBC emerging market strategist Murat Toprak.\nIn Romania, a near 40 percent rise in foreign holdings since 2014 is as likely to be down to a sovereign credit rating upgrade that got its debt promoted into the big bond indices as to the ECB’s actions.\nAnd while Hungary’s bond markets saw big inflows when the ECB first flooded markets with cheap money in 2011, it has since seen levels fall right back down again as Budapest has adopted unconventional monetary policy tools of its own.\n“It is very difficult to find an correlation between ECB (quantitative easing) and what we have seen in terms of inflows,” HSBC’s Toprak said. “While it seemed intuitive, it wasn’t backed up by the data.”\nRATE EXPECTATIONS There is no official data showing the origin of the money that has poured into central European bond markets over the last seven years.\nIn 2016 Bank of America Merrill Lynch (BAML) calculated euro zone investors held about 407 billion euros worth of emerging currency-denominated debt, a quarter of which was invested in Polish, Hungarian and Czech debt.\nBut that was little changed from 2013’s figure. In fact, most moves happened, BAML said, during the U.S. Fed’s bond-buying from 2009 onwards and when the ECB started an earlier program of showering banks with unlimited, ultra-cheap funding.\nAnd if the ECB does halt QE later this year, investors know it will coincide with a turn in central Europe’s own interest rates. The move is in fact already underway, as regional growth and inflation tick up in line with the euro zone recovery.\nThe Czech central bank raised rates twice last year and is expected to do as many as three this year. Romania has just delivered its first rate rise in a decade, while Poland could move later this year, followed finally by Hungary in 2019. [nL8N1OY2N0] [nL8N1OZ3KB]\nThat should add to the additional interest buyers get on CEE bonds compared with places like Germany as well as boosting real yields - bond interest minus a country’s inflation rate - which are already over 200 basis points higher in Poland than in Germany.\nAt the same time, while higher rates can erode existing investors’ bond returns, the effect can be mitigated for foreign funds if the country’s currency rises more than their own.\nA major part of the last year's stellar returns from central European debt came from the 12-18 percent jumps by regional currencies PLN= HUF= CZK= against the dollar. The zloty and crown also rose around 5.5 percent versus the euro.\nPotential for more gains this year, albeit to a lesser extent, means many big-name money managers aren’t as negative on CEE debt as they might have been with the ECB move looming. The currencies have mostly kept pace with the euro’s recent surge.\n“Poland, because we like the currency, we are not underweight the bonds, but the Czechs have been hiking so we like being underweight,” said JP Morgan Asset Management portfolio manager Diana Amoa.\n($1 = 0.8173 euros)\n($1 = 3.4094 zlotys)\n(1 euro = 4.1714 zlotys)\n(1 euro = 25.3962 Czech crowns)\n($1 = 20.7570 Czech crowns)\n<\nForeign bond holdings in CEE since ECB started stimulus in 2011 (static) reut.rs/2D8CPvK\nForeign bond holdings in CEE since start of ECB stimulus in 2011 reut.rs/2D97f15\nCentral Europe's bond yield premiums reut.rs/2DpDysz\n'Real' yields in central Europe and Germany reut.rs/2E2nvSH", "external_links": ["http://reut.rs/2DpDysz", "http://reut.rs/2D8CPvK", "http://reut.rs/2E2nvSH", "http://reut.rs/2D97f15"], "published": "2018-01-23T20:53:00.000+02:00", "crawled": "2018-01-24T15:20:15.012+02:00", "highlightTitle": ""}