{"organizations": [], "uuid": "5b08d7d88c74e8bb0dd5d54e1170dcae9b5bf607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222641644&w=1200&r=LYNXMPEE0G0B9", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-sandridge-icahn/sandridge-to-meet-with-investor-icahn-to-quell-rising-tensions-idUKKBN1F60IX", "country": "US", "domain_rank": 408, "title": "SandRidge to meet with investor Icahn to quell rising tensions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T08:20:00.000+02:00", "replies_count": 0, "uuid": "5b08d7d88c74e8bb0dd5d54e1170dcae9b5bf607"}, "author": "", "url": "https://uk.reuters.com/article/uk-sandridge-icahn/sandridge-to-meet-with-investor-icahn-to-quell-rising-tensions-idUKKBN1F60IX", "ord_in_thread": 0, "title": "SandRidge to meet with investor Icahn to quell rising tensions", "locations": [], "entities": {"persons": [{"name": "icahn", "sentiment": "negative"}, {"name": "sandridge", "sentiment": "negative"}, {"name": "ernest scheyder", "sentiment": "none"}, {"name": "carl icahn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "oklahoma city-based", "sentiment": "none"}], "organizations": [{"name": "sandridge energy inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bonanza creek energy inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:21 AM / Updated 32 minutes ago SandRidge to meet with investor Icahn to quell rising tensions Ernest Scheyder 3 Min Read \nHOUSTON (Reuters) - SandRidge Energy Inc ( SD.N ) is expected to meet with activist investor Carl Icahn on Wednesday over his demands for a board shake-up and other governance changes, part of a bid by the U.S. shale oil producer to quell tensions with its largest shareholder and most outspoken critic. \nIcahn said in December he was considering a proxy contest to remove some or all of SandRidge’s directors. A week ago, he called on the Oklahoma City-based company to replace two directors with one designated by him and the second by other large shareholders. \nThe call for board seats came after SandRidge terminated a $746 million deal to acquire rival Bonanza Creek Energy Inc ( BCEI.N ) that Icahn and other investors said was too expensive and would burden the company with too much debt. \n“I‘m not necessarily against the idea of them buying some assets at a good price, but I was adamantly against diluting the shareholders, especially in order to overpay for Bonanza,” Icahn said in an interview. \nThe billionaire investor will likely continue his harsh criticism of SandRidge Chief Executive James Bennett, who he blasted earlier this month for overseeing “a period of massive value destruction” at the company, including a bankruptcy filing. \n“I don’t mind a CEO making a lot of money if the shareholders have also prospered. But this is certainly not the case here,” Icahn said in the interview. \nSandRidge declined to provide details of its executives’ goals for Wednesday’s meeting, but spokesman David Kimmel said in a statement that its board and management “value constructive shareholder dialogue.” \nThe company has not set a date for its 2018 shareholder meeting nor a deadline for shareholders to submit resolutions for the proxy. The 2017 meeting was held in June. \nIcahn, who owns 13.5 percent of the oil company, also has called on directors to remove a so-called poison pill barring individual shareholders from accumulating more than 10 percent of shares. \nSandRidge will meet with other top shareholders in additional to Icahn. Guggenheim Partners Investment Management and Fir Tree Partners, both of which opposed the Bonanza Creek deal, did not respond to requests for comment. \nSandRidge executives have been selling their shares. John Suter, chief operating officer; Philip Warman, SandRidge’s top lawyer; and CEO Bennett sold in aggregate more than 400,000 shares since the beginning of the year, according to regulatory filings. Reporting by Ernest Scheyder; Editing by David Gregorio", "external_links": [], "published": "2018-01-17T08:20:00.000+02:00", "crawled": "2018-01-17T09:03:11.007+02:00", "highlightTitle": ""}