{"organizations": [], "uuid": "792ac62588ea5960255297c068c743a2d951afd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/canada-banks-capital/update-1-canada-to-introduce-new-stricter-bank-capital-rules-idUSL1N1P41JR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Canada to introduce new stricter bank capital rules", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:28:00.000+02:00", "replies_count": 0, "uuid": "792ac62588ea5960255297c068c743a2d951afd4"}, "author": "", "url": "https://www.reuters.com/article/canada-banks-capital/update-1-canada-to-introduce-new-stricter-bank-capital-rules-idUSL1N1P41JR", "ord_in_thread": 0, "title": "UPDATE 1-Canada to introduce new stricter bank capital rules", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "basel", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:30 PM / Updated 8 minutes ago UPDATE 2-Canada to introduce new stricter bank capital rules Reuters Staff \n* New rules set capital floor at 75 percent \n* Global directive set at 72.5 percent \n* Transition to new rules to finish in Q4, 2018 (Adds comment from Scotiabank CEO, investor, shares) \nBy Matt Scuffham and Fergal Smith \nTORONTO, Jan 9 (Reuters) - Canada’s banking regulator said on Tuesday it would introduce new capital rules stricter than those proposed by global regulators to ensure banks can withstand financial shocks. \nThe Office of the Superintendent of Financial Institutions (OSFI) said the changes were designed as an interim step before new global rules are phased in over a five-year period from 2022. \nThe regulator said it would replace the current capital output floor used by Canada’s banks with the more risk-sensitive Basel 2 floor, calibrated at 75 percent. That compares with a floor of 72.5 percent based on a standardized approach that global regulators agreed on in December. \n“We are strong advocates of the value of international standards in Canada but we have also never shied away from deviating from those standards where it makes sense in our domestic market,” OSFI Assistant Superintendent Carolyn Rogers said at the 2018 Canadian Bank CEO conference in Toronto. \nCanada’s new interim rules will be brought in ahead of the global directive. Rogers said a transition to the new rules will begin next quarter and finish in the fourth quarter of 2018. \n“As usual, Canada is going for a faster timeline,” said Steve Belisle, senior portfolio manager at Manulife Asset Management. \nGlobal regulators agreed on a limit on how much banks could use their own models to calculate how much risk is on their books. A 72.5 percent floor means that banks can only vary from a standard model by no more than 27.5 percent. \n“From what I know today, the changes are going to be very acceptable, gradual and implemented over time,” Scotiabank CEO Brian Porter told the conference. \nCanada’s move reflects a view in North America that European banks rely too much on their own internal models to decide how much capital they should hold against their loans. U.S. banks, for example, are more constrained by a leverage ratio, which measures equity capital to total assets. \nCanada’s biggest five banks -- Royal Bank of Canada, Toronto-Dominion Bank, Bank of Nova Scotia, Bank of Montreal and Canadian Imperial Bank of Commerce -- will each be affected by the move. \nShares in Canadian banks showed a mixed performance on Tuesday. RBC and Scotiabank shares closed up 0.5 percent, with Bank of Montreal up 0.8 percent. TD Bank shares were down 0.3 percent CIBC down 0.1 percent. (Reporting by Matt Scuffham and Fergal Smith; Editing by Sandra Maler)", "external_links": [], "published": "2018-01-09T22:28:00.000+02:00", "crawled": "2018-01-09T22:45:18.026+02:00", "highlightTitle": ""}