{"organizations": [], "uuid": "e8e3c8c6bf4a0b6d2fb4dc3b28e382e309c7b68f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226509852&w=1200&r=LYNXMPEE0T09K", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/us-swatch-results/swatch-very-positive-about-2018-after-2017-profit-up-28-percent-idUSKBN1FJ0LD", "country": "US", "domain_rank": 408, "title": "Swatch signals better times for watch industry", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-30T14:29:00.000+02:00", "replies_count": 0, "uuid": "e8e3c8c6bf4a0b6d2fb4dc3b28e382e309c7b68f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-swatch-results/swatch-very-positive-about-2018-after-2017-profit-up-28-percent-idUSKBN1FJ0LD", "ord_in_thread": 0, "title": "Swatch signals better times for watch industry", "locations": [], "entities": {"persons": [{"name": "swatch", "sentiment": "none"}, {"name": "patrik schwendimann", "sentiment": "none"}], "locations": [{"name": "zurich", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters) - swatch group", "sentiment": "neutral"}, {"name": "zuercher kantonalbank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Swatch Group has signaled brighter prospects for the Swiss watch industry, saying the company started the year with accelerating demand for its watches and high-end jewelry.\nThe world’s largest watchmaker, which owns the Omega brand as well as selling the plastic watches that made its name, said on Tuesday it expected “very positive” growth this year after posting a 28 percent rise in 2017 profit.\nThat was the first increase in Swatch’s annual profit since 2013 and gave further evidence of improvement in a watch industry that has been in the doldrums for years.\nSales fell after a crackdown on corruption in China, the world’s biggest market for Swiss watches, and following a drop in tourist spending following deadly attacks in key destinations such as Paris.\nBut Swatch said it now anticipated “further very positive growth in local currencies in 2018,” not only from its own distribution channels such as retail and e-commerce, but also from third-party channels.\n“The recovery is definitely underway,” said Patrik Schwendimann, an analyst at Zuercher Kantonalbank, who expects Swiss watch industry exports to rise by 3.3 percent this year, adding this forecast could be too cautious.\n“Swatch is always positive at the beginning of the year, but now it (the company’s optimism) makes sense,” he said.\nAnnual net profit after minorities at the group, whose broad portfolio spans luxury Breguet watches and Harry Winston jewelry, rose 28 percent to 733 million Swiss francs ($781 million), matching forecasts in a Reuters poll.\nSales rose 5.8 percent at constant exchange rates and 5.4 percent in Swiss francs, helped by a strong acceleration in the second half of the year. December was the second-highest sales month in company history, it said.\nSwatch proposed raising the dividend on its main class of shares to 7.50 francs from 6.75 francs a year earlier. The stock, which gained more than 25 percent last year, was 3.4 percent higher in early trading.\nThe results followed peer Richemont, which earlier this month reported a 7 percent increase in sales during the last three months of 2017, helped by demand in Asia.\nRelated Coverage Swatch's Hayek targets high-single-digit growth for 2018 Also on Tuesday the Swiss customs office reported a 2.7 percent increase in watch exports during 2017, with faster growth in the fourth quarter.\nSwatch said had it had seen “marked” growth in China, its biggest market. Europe also saw growth last year, while it accelerated in North America during 2017, the company said.\nAlthough it was probably going to be a good year for the watch industry, pressures from connected “smart” watches as well as overcapacity remained challenges, said Kepler Cheuvreux analyst Jon Cox.\nAdditional reporting by Silke Koltrowitz; Editing by Michael Shields and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T14:29:00.000+02:00", "crawled": "2018-01-30T16:37:42.014+02:00", "highlightTitle": ""}