{"organizations": [], "uuid": "6b33053bb797066e2de8e1e9bdbb78c043ef1231", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940938-GettyImages-893343180.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/11/cryptocurrencies-stage-big-comeback-after-trading-ban-fears-wane-bitcoin-surges-8-percent-from-low.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrencies stage big comeback after trading ban fears wane; bitcoin surges 8% from low", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:39:00.000+02:00", "replies_count": 0, "uuid": "6b33053bb797066e2de8e1e9bdbb78c043ef1231"}, "author": "Tae Kim", "url": "https://www.cnbc.com/2018/01/11/cryptocurrencies-stage-big-comeback-after-trading-ban-fears-wane-bitcoin-surges-8-percent-from-low.html", "ord_in_thread": 0, "title": "Cryptocurrencies stage big comeback after trading ban fears wane; bitcoin surges 8% from low", "locations": [], "entities": {"persons": [{"name": "park sang-ki", "sentiment": "none"}, {"name": "park", "sentiment": "none"}], "locations": [{"name": "seoul", "sentiment": "none"}, {"name": "south korea-a screen", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Seung-il Ryu | NurPhoto | Getty Images Seoul, South Korea-A Screen shows the prices of bitcoin at a virtual currency exchange store in Seoul, South Korea. South Korean is studying ways to regulate speculative trading in crypto currencies as the latest surge in prices stokes a craze over bitcoins. \nThe world may not be ending for digital currencies after all. \nSouth Korea's Justice Minister Park Sang-ki said on Thursday that a bill is being prepared to ban all cryptocurrency trading on the country's exchanges, which drove digital currency prices sharply lower.The price of bitcoin tumbled more than 12 percent from its day's high following Park's remarks, according to Coinbase data. The cryptocurrency then rallied more than 7 percent off its low after Reuters reported South Korea's presidential office said the ban plan \"had not yet been finalized\" and is just one of the things being considered. \nAfter the 7 percent comeback, bitcoin was down 5 percent Thursday, according to Coinbase. \nThe news agency added a ban bill \"could take months or even years\" to pass the country's legislative body. show chapters 2:34 PM ET Wed, 10 Jan 2018 | 00:59 \nIndustry experts said fears over the South Korean ban proposal are overblown. \nCedric Jeanson, founder and CEO of BitSpread, one of the largest digital currency market makers in the world, downplayed the developments in the Asian country. \n\"It is understandable why the authorities are acting in Korea, which is different to other digital currency markets in several respects. Prices of digital currencies there are much higher than the rest of the world because of local circumstances,\" he said. \"Developments like this should be seen in the broader context of the continued evolution and development of digital currencies globally.\" \nJeanson explained the authorities in Korea are making sure the country's digital currency exchanges have the \"proper AML/KYC customer identification, and suitable cyber-security, tax reporting procedures and accounting.\" \n\"It is also natural to align the requirements of digital currency exchanges with the requirements of online financial platforms by regulators, as the trading nature of the activity is similar,\" he added. \nSouth Korea is one of the major cryptocurrency trading markets. It accounts for between 6 and 12 percent of bitcoin trading, according to industry website CryptoCompare. \n\"In both China and South Korea, what they are doing, they are bringing operations, exchanges and mines, into regulatory compliance. They are not shutting everything down,\" Malachi Salcido, CEO of bitcoin mining company Salcido Enterprises said on CNBC's \" Power Lunch \" Thursday. \"They are shutting people down [people] that are skirting the system ... tax evading. The things they should be doing. The industry is growing up.\" \nDigital currency fund manager Brian Kelly predicts South Korea's moves will just be another bump in the road for the relentless rise of cryptocurrencies. \n\"The ultimate outcome in Korea is still unclear, but if they move to regulate similar to Japan then it would be very positive for crypto,\" Kelly wrote in an email. \"The change in the market over the last few months is that the incremental buyer is US investors and Korea has become less of a driver.\" \nRipple's cryptocurrency XRP also surged off its low as much as 15 percent after it announced it is teaming up with U.S. money transfer giant MoneyGram. XRP is up 3 percent Thursday, according to CoinMarketCap. \n— CNBC's Jeff Cox and Arjun Kharpal contributed to this report. WATCH: Here's why every industry should be looking at blockchain show chapters ", "external_links": ["https://www.reuters.com/article/uk-southkorea-bitcoin/south-korea-plans-to-ban-cryptocurrency-trading-rattles-market-idUSKBN1F002A"], "published": "2018-01-11T19:39:00.000+02:00", "crawled": "2018-01-11T19:37:12.004+02:00", "highlightTitle": ""}