{"organizations": [], "uuid": "0f6279d3dda7e40306ad86c16948ccc310879bec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-russia/fusion-gps-founder-testified-trump-associate-went-to-fbi-over-russia-concerns-idUKKBN1EZ06Z", "country": "US", "domain_rank": 408, "title": "Fusion GPS founder testified Trump associate went to FBI over Russia concerns", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T04:34:00.000+02:00", "replies_count": 0, "uuid": "0f6279d3dda7e40306ad86c16948ccc310879bec"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-russia/fusion-gps-founder-testified-trump-associate-went-to-fbi-over-russia-concerns-idUKKBN1EZ06Z", "ord_in_thread": 0, "title": "Fusion GPS founder testified Trump associate went to FBI over Russia concerns", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "christopher steele", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "glenn simpson", "sentiment": "none"}, {"name": "steele", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fusion gps", "sentiment": "negative"}, {"name": "fbi", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 36 AM / Updated 22 minutes ago Fusion GPS founder testified Trump associate went to FBI over Russia concerns Sarah N. Lynch 6   An associate of Donald Trump expressed concerns to the FBI about contacts between Russia and Trump’s presidential election campaign team, helping to trigger the probe into possible collusion, according to closed-door testimony made public on Tuesday by a senior Democrat. \nGlenn Simpson, who leads the Washington research firm Fusion GPS, said in his August testimony that the Federal Bureau of Investigation received intelligence from a “voluntary source” in Trump’s orbit in 2016, before a former British spy gave the FBI his own “dossier” of allegations about collusion. \nFusion GPS hired the former spy, Christopher Steele, to investigate Trump’s business dealings with Russia. \nSome Republicans critical of Special Counsel Robert Mueller’s probe into possible collusion between the Trump campaign and Russian officials have claimed the initial FBI probe was triggered by Steele’s dossier. \nThey have raised questions about whether the FBI may have relied on the Steele document to improperly obtain surveillance warrants to spy on Trump’s campaign associates. \nSimpson’s testimony before the Senate Judiciary Committee in August contradicted those claims. \n“They had other intelligence about this matter from an internal Trump campaign source and ... they believed Chris’ information might be credible,” Simpson testified. “I think it was a voluntary source, someone who was concerned about the same concerns we had.” \nSimpson later said he was not sure if the FBI informant was from the Trump election campaign or the Trump Organization, the president’s real estate firm, which is now run by his two older sons. \nDianne Feinstein, the ranking Democrat on the Senate committee, released the testimony without Republican approval, in an apparent bid to neutralise Republican criticism of the Russia investigation. \nSteele’s dossier contains a number of inflammatory and salacious allegations about Trump and his alleged connections to Russia. Trump has slammed the dossier as “bogus” and denies his campaign colluded with Russia. \nTRUMP‘S PERSONAL LAWYER FILES LAWSUITS \nOn Tuesday, Trump’s personal lawyer Michael Cohen filed two defamation lawsuits, one in New York state court against the popular website BuzzFeed News, which published the Fusion GPS dossier last year, and the second in federal court against Fusion GPS itself, ABC News reported. \nBoth lawsuits say the dossier compiled by Fusion GPS and contained “false and defamatory” allegations about Cohen that resulted in “harm to his personal and professional reputation, current business interests, and the impairment of business opportunities,” according to ABC News. \nCohen is mentioned in the dossier as having suspicious ties to Russian figures. Those allegations have not been verified. \nBuzzFeed responded with a Twitter post that said the dossier continues to be the subject of investigations by Congress and intelligence agencies, was shown to two U.S. presidents and described in detail by news outlets worldwide. \n“Its interest to the public is obvious. This is not the first time Trump’s lawyer has attacked the free press, and we look forward to defending our First Amendment rights in court,” BuzzFeed said. \nThe lawsuits were not immediately available on online court websites. \nTrump and some Republicans have attacked both Simpson’s firm and Steele in recent months and also questioned the impartiality of the FBI and the Justice Department in an apparent effort to discredit Mueller’s probe. \nMueller’s team has produced two indictments and two guilty pleas by former Trump campaign aides. \nRepublicans on the Senate Judiciary Committee, led by Charles Grassley, had declined to release Simpson’s testimony, saying he had refused to testify at a public hearing and failed to answer questions or turn over records. \nGrassley’s office slammed Feinstein for releasing the testimony, saying it came as the panel was still trying to interview other witnesses, including Trump’s son-in-law, Jared Kushner. \n“Her action undermines the integrity of the committee’s oversight work and jeopardizes its ability to secure candid voluntary testimony,” said Grassley spokesman Taylor Foy. \nDemocrats accused Republicans of withholding Simpson’s testimony in order to spread false information about his firm’s role and undermine the Russia probe. \n“The innuendo and misinformation circulating about the transcript are part of a deeply troubling effort to undermine the investigation into potential collusion and obstruction of justice,” Feinstein said in a statement. “The only way to set the record straight is to make the transcript public.” \nAlso on Tuesday, a group of House of Representatives Democrats wrote to Republican House Speaker Paul Ryan asking his party to “fully investigate” possible Russian interference in U.S. elections. \n“We ask you to change course and begin demonstrating true leadership on this national security issue,” said the letter, released a year after U.S. intelligence agencies reported their findings that Russia had sought to intervene in the 2016 election on Trump’s behalf. \nRyan aides did not immediately respond to a request for comment. Ryan has previously expressed support for Mueller’s investigation and a separate House probe. \nRussia denies meddling in the U.S. presidential election. Reporting by Sarah N. Lynch; Additional reporring by Doina Chiacu, Patricia Zengerle, Mark Hosenball, John Walcott, Jonathan Landay and Eric Beech; Editing by Frances Kerry and Leslie Adler", "external_links": [], "published": "2018-01-10T04:34:00.000+02:00", "crawled": "2018-01-10T04:47:31.019+02:00", "highlightTitle": ""}