{"organizations": [], "uuid": "7c5ca3e3e7d26d8f0805e723b3dae6d26fafdd2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-sierra-income-corporation-decrease-in-public-offering-price.html", "country": "US", "domain_rank": 767, "title": "Sierra Income Corporation Decrease in Public Offering Price", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T02:15:00.000+02:00", "replies_count": 0, "uuid": "7c5ca3e3e7d26d8f0805e723b3dae6d26fafdd2b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-sierra-income-corporation-decrease-in-public-offering-price.html", "ord_in_thread": 0, "title": "Sierra Income Corporation Decrease in Public Offering Price", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "sierra income cor", "sentiment": "negative"}, {"name": "sierra income corporation decrease in public offering price", "sentiment": "negative"}, {"name": "nav", "sentiment": "none"}, {"name": "sierra income corporation sie", "sentiment": "none"}, {"name": "sic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- A committee of the board of directors (the “Board”) of Sierra Income Corporation (“SIC”) has approved a decrease in its public offering price from $8.35 per share to $8.15 per share.\nThe decrease in SIC’s public offering price is effective as of SIC’s January 26, 2018 closing and first applied to subscriptions received from January 5, 2018 through January 25, 2018. The change in offering price reflects the updated NAV per share.\nIf SIC continues to experience underlying portfolio fluctuations, the Board may further increase or decrease the per share offering price of its shares of common stock for its future weekly closings, pursuant to SIC’s pricing policy included in its prospectus which requires a price update if NAV per share fluctuates more than 2.5% from net offering price per share. SIC has not yet determined that a further adjustment to the newly-established offering price of $8.15 per share will be necessary. In the event SIC determines to adjust its public offering price, a separate announcement will be issued.\nAbout Sierra Income Corporation\nSierra is a non-traded business development company that invests primarily in first lien senior secured debt, second lien secured debt and, to a lesser extent, subordinated debt of middle market companies in a broad range of industries with annual revenue between $50 million and $1 billion. Sierra’s investment objective is to generate current income, and to a lesser extent, long-term capital appreciation. Sierra is externally managed by SIC Advisors LLC, which is an investment adviser registered under the Investment Advisers Act of 1940, as amended. For additional information, please visit Sierra Income Corporation at www.sierraincomecorp.com .\nAbout SIC Advisors LLC\nSIC Advisors LLC is an affiliate of Medley Management Inc. (NYSE: MDLY, “Medley”). Medley is an alternative asset management firm offering yield solutions to retail and institutional investors. Medley’s national direct origination franchise, with over 85 people, is a premier provider of capital to the middle market in the U.S. As of September 30, 2017, Medley has over $5 billion of assets under management in two business development companies, Medley Capital Corporation (NYSE:MCC) and Sierra Income Corporation, a credit interval fund, Sierra Total Return Fund (NASDAQ:SRNTX) and several private investment vehicles. Over the past 15 years, Medley has provided capital to over 400 companies across 35 industries in North America 1 .\nFor additional information, please visit Medley Management Inc. at www.mdly.com .\nMedley LLC, the operating company of Medley Management Inc., has outstanding bonds which trade on the NYSE under the symbol (NYSE: MDLX) and (NYSE:MDLQ). Medley Capital Corporation (NYSE: MCC) has outstanding bonds which trade on the NYSE under the symbols (NYSE: MCV) and (NYSE: MCX).\nForward-Looking Statements\nThis press release contains within the meaning of the federal securities laws and regulations. These are identified by their use of terms and phrases such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"predict,\" \"project,\" \"should,\" \"will\" and other similar terms and phrases, including references to assumptions and forecasts of future results. Forward-looking statements are not guarantees of future performance and involve known and unknown risks, uncertainties and other factors that may cause the actual results to differ materially from those anticipated at the time the are made. Although Sierra believes the expectations reflected in such are based upon reasonable assumptions, it can give no assurance that the expectations will be attained or that any deviation will not be material. Sierra undertakes no obligation to update any forward-looking statement contained herein to conform the statement to actual results or changes in Sierra’s expectations.\nThis is not an offer or a solicitation of an offer to buy any securities of Sierra Income Corporation. Such an offer can be made only by means of a prospectus. A copy of the prospectus can be obtained by visiting www.sierraincomecorp.com . This is a speculative security and as such, involves a high degree of risk.\n1 Medley Management Inc. is the parent company of Medley LLC and several registered investment advisors (collectively, ”Medley”). Assets under management refers to assets of our funds, which represents the sum of the net asset value of such funds, the drawn and undrawn debt (at the fund level, including amounts subject to restrictions) and uncalled committed capital (including commitments to funds that have yet to commence their investment periods). Assets under management are as of September 30, 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125006402/en/\nInvestor Relations Contact:\nMedley Management Inc.\nSam Anderson, 212-759-0777\nHead of Capital Markets & Risk\nor\nMedia Contact:\nTeneo Holdings LLC\nErin Clark, 646-214-8355\nSource: Sierra Income Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sierraincomecorp.com&esheet=51749245&newsitemid=20180125006402&lan=en-US&anchor=www.sierraincomecorp.com&index=3&md5=a9da4ce8c3156a717349fe3db7a77a44", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sierraincomecorp.com&esheet=51749245&newsitemid=20180125006402&lan=en-US&anchor=www.sierraincomecorp.com&index=1&md5=b0e69f91a057dcb0eba8358a516e2dea", "http://www.businesswire.com/news/home/20180125006402/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mdly.com&esheet=51749245&newsitemid=20180125006402&lan=en-US&anchor=www.mdly.com&index=2&md5=28f92304fcfcf383b32720e3626224ed"], "published": "2018-01-26T02:15:00.000+02:00", "crawled": "2018-01-26T03:37:18.000+02:00", "highlightTitle": ""}