{"organizations": [], "uuid": "20559a02988f0f51473d5d4bf168d64350069b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218947752&w=1200&r=LYNXMPEE0203D", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-ashes-australia/smith-fine-starc-set-to-return-for-fifth-ashes-test-idUKKBN1ES05H", "country": "US", "domain_rank": 408, "title": "Smith 'fine', Starc set to return for fifth Ashes test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T05:13:00.000+02:00", "replies_count": 0, "uuid": "20559a02988f0f51473d5d4bf168d64350069b31"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-ashes-australia/smith-fine-starc-set-to-return-for-fifth-ashes-test-idUKKBN1ES05H", "ord_in_thread": 0, "title": "Smith 'fine', Starc set to return for fifth Ashes test", "locations": [], "entities": {"persons": [{"name": "smith", "sentiment": "negative"}, {"name": "starc", "sentiment": "negative"}, {"name": "mitchell starc", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "mcg", "sentiment": "none"}, {"name": "scg", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 3:15 AM / Updated 7 hours ago Starc returns for fifth Ashes test, Smith 'fine' Nick Mulvenney 3 Min Read \nSYDNEY (Reuters) - Australia captain Steve Smith brushed off concerns about his fitness on the eve of the fifth and final Ashes test against England on Wednesday before Mitchell Starc’s return to spearhead the pace attack was confirmed as the only change to his team. Cricket - Australia v England - Ashes test match - WACA Ground, Perth, Australia, December 17, 2017 - Australia's Mitchell Starc celebrates after bowling England's James Vince during the fourth day of the third Ashes cricket test match. REUTERS/David Gray \nLeft-arm quick Starc, the leading wicket-taker in the series after claiming 19 in the first three tests as Australia wrested back the Ashes, missed the drawn fourth test in Melbourne with a bruised heel but confirmed his fitness in the nets. \n“Starcy’s pulled up pretty well this morning and said he’s ready to go,” Smith told reporters at the Sydney Cricket Ground (SCG). \n“The break that he’s had from bowling has helped his heel heal, it’s coming on nicely, he’s confident. You’ve got to take the player’s words sometimes, and hopefully he gets through fine ...” \nThe Australia skipper, who has accumulated a series-leading 604 runs at an average of 151, left no one in any doubt that he would be leading his side out on Thursday despite missing training on Tuesday because of a bad back. \n“It’s a little bit stiff but nothing I haven’t dealt with before,” Smith said. Cricket - Ashes test match - Australia v England - MCG, Melbourne, Australia, December 30, 2017. Australia's captain Steve Smith reacts after reaching his century during the fifth day of the fourth Ashes cricket test match. REUTERS/David Gray \n”I’ll have a good hit and a good catch today and I’ll be fine tomorrow. \n“I love batting out here at the SCG, it’s my home ground and I’ve made a few good scores. So hopefully I can continue the run.” \nThe side was confirmed after Australia’s training session with Starc returning in place of Jackson Bird, who laboured as a stand-in on an Melbourne Cricket Ground pitch rated as “poor” by the governing International Cricket Council. \nLeft-arm tweaker Ashton Agar was also brought into the squad to offer Australia the option of going with two spinners if it looked like the SCG was going to offer a lot of turn. \nSmith, though, said the state of the pitch made it unlikely that one of the quicks would make way for Agar to play alongside off spinner Nathan Lyon as the hosts look to wrap up the series 4-0. \n“The wicket’s got a fair bit of grass and looks to be a pretty good wicket,” he added. “I’d say we’d probably opt for just the one spinner.” \nTeam: Steve Smith (captain), David Warner, Cameron Bancroft, Usman Khawaja, Shaun Marsh, Mitchell Marsh, Tim Paine (wicketkeeper), Mitchell Starc, Pat Cummins, Nathan Lyon, Josh Hazlewood. Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-03T05:13:00.000+02:00", "crawled": "2018-01-03T05:34:34.003+02:00", "highlightTitle": ""}