{"organizations": [], "uuid": "2b9123b1bb1fab4832af4f3e516864c576917732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224681342&w=1200&r=LYNXMPEE0N05W", "site_section": "http://feeds.feedburner.com/reuters/businessNews/", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-toys-r-us-restructuring/toys-r-us-says-to-shut-about-180-u-s-stores-idUSKBN1FD09L", "country": "US", "domain_rank": 408, "title": "Toys R Us says to shut about 180 U.S. stores", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:40:00.000+02:00", "replies_count": 0, "uuid": "2b9123b1bb1fab4832af4f3e516864c576917732"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-toys-r-us-restructuring/toys-r-us-says-to-shut-about-180-u-s-stores-idUSKBN1FD09L", "ord_in_thread": 0, "title": "Toys R Us says to shut about 180 U.S. stores", "locations": [], "entities": {"persons": [{"name": "melanie teed-murch", "sentiment": "none"}, {"name": "gopakumar warrier", "sentiment": "none"}, {"name": "ismail shakil", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "toys “r” us inc", "sentiment": "neutral"}, {"name": "ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Toys “R” Us Inc said it would shut about a fifth of its U.S. stores in the coming months, as the toy-store chain tries to emerge from one of the largest ever bankruptcies by a specialty retailer.\nThe closure of about 180 U.S. stores will begin in early February and continue until mid-April, Chief Executive David Brandon said in a letter on the company's website. bit.ly/2n5O1mR\nBrandon, who joined as CEO in 2015 after spearheading a turnaround at Domino’s Pizza Inc ( DPZ.N ), acknowledged gaps in customer experience during the vital holiday season but pledged to focus on improving shopping experience, both at its stores and online.\nThe Wayne, New Jersey-based company, contesting growing competition from regional independent toy retailers and online giant Amazon.com ( AMZN.O ), will also roll out deep discounts and revamp its loyalty program to lure more shoppers.\nThe company filed for bankruptcy protection just ahead of the 2017 holiday season in the United States and Canada to restructure $5 billion of long-term debt, casting doubts over the future of its 64,000 employees and nearly 1,600 stores.\nThe bankruptcy is also causing headaches for two of Toys “R” Us’s biggest suppliers, toy makers Mattel ( MAT.O ) and Hasbro ( HAS.O ).\nToys “R” Us was Mattel’s second-largest customer in 2016, representing 11 percent of its total sales.\nFILE PHOTO: Consumers leave a Toys R Us store with full shopping carts after shopping on the day dubbed \"Black Friday\" in Framingham, Massachusetts, U.S., November 25, 2011. REUTERS/Adam Hunger/File Photo D.A. Davidson analyst Linda Bolton Weiser said she expected the store closures to hit barbie-maker Mattel’s 2018 estimated sales growth by 1.5-2 percent, assuming shipments that would have gone to Toys “R” Us are not picked up by other retailers.\nFor Hasbro, the impact would be slightly less, with Weiser estimating a 1-1.5 percent hit to its 2018 estimated sales. The maker of Monopoly board game gets about 9 percent of its revenue from the toy retailer.\nWall Street analysts have forecast a 1 percent drop in 2018 sales for Mattel, but a 3 percent rise for Hasbro.\nToys “R” Us, which also operates the infant- and toddler-focused Babies “R” Us chain, has set aside more than $400 million out of its $3.1 billion in bankruptcy loans for sprucing up stores over the next three years with more experiences and better-paid staff.\nThe company said it plans to remodel a number of locations by converting them into co-branded Toys R Us and Babies R Us stores, while also investing in websites.\nAll 83 Toys \"R\" Us stores in Canada will remain open, said president of the Canadian unit, Melanie Teed-Murch, in a letter to customers. bit.ly/2n7ztCp\nAs Toys “R” Us aims to exit bankruptcy in 2018, its efforts to reinvent its stores will shape how other retailers look to experiential shopping to tackle e-commerce.\nAdditional reporting by Siddharth Cavale and Subrat Patnaik in Bengaluru; Editing by Gopakumar Warrier and Anil D'Silva\n ", "external_links": [], "published": "2018-01-24T10:40:00.000+02:00", "crawled": "2018-01-24T05:55:36.018+02:00", "highlightTitle": ""}