{"organizations": [], "uuid": "8b6fc9b0bd6448b8dbb05123176366d13fa2445c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-tigerwit-acquires-uk-based-fca-regulated-retail-broker-mercor-index-ltd.html", "country": "US", "domain_rank": 767, "title": "TigerWit Acquires UK Based FCA Regulated Retail Broker Mercor Index Ltd", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.095, "site_type": "news", "published": "2018-01-11T14:17:00.000+02:00", "replies_count": 0, "uuid": "8b6fc9b0bd6448b8dbb05123176366d13fa2445c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-tigerwit-acquires-uk-based-fca-regulated-retail-broker-mercor-index-ltd.html", "ord_in_thread": 0, "title": "TigerWit Acquires UK Based FCA Regulated Retail Broker Mercor Index Ltd", "locations": [], "entities": {"persons": [{"name": "summer xu", "sentiment": "none"}, {"name": "simon denham", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "bahamas", "sentiment": "none"}], "organizations": [{"name": "index ltd nassau", "sentiment": "negative"}, {"name": "fca", "sentiment": "none"}, {"name": "tigerwit group", "sentiment": "none"}, {"name": "mercor index", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASSAU, The Bahamas, Jan. TigerWit is pleased to announce that it has acquired Mercor Index, the UK based and FCA regulated broker set up by industry veteran Simon Denham. The purchase of Mercor Index marks TigerWit's first acquisition of another complementary business and means a highly significant entry into the UK market with the acquisition of a fully authorised and regulated FCA entity. Mercor Index is the exclusive provider of the TimeToTrade platform in the UK.\n\"We are very excited about formally entering the UK market with the acquisition of Mercor Index and look forward to working with the team to grow their existing business and establish TigerWit as a leader in retail broking not only in the UK, but globally. The team's wealth of experience in the online trading industry will assist us in expanding our operations and services, as well as most importantly, providing our clients with the option of trading under a FCA regulated provider,\" said Summer Xu, Founder of TigerWit Group.\nThe TimeToTrade platform offers retail investors the ability to invest directly in physical stocks and shares, as well as trading in global financial markets such as indices, FX and commodities via CFDs. TimeToTrade provides an industry leading technical trading environment which allows clients to simply create and automate their trading activity. With the platform's 'Strategy Builder' clients can back-test and then forward-test trading strategies via a demo trading account before implementing them into the live markets. These strategies can be tested and executed without the requirement of programming any complex coding languages.\nSimon Denham, founder of Mercor Index said, \"This is an exciting moment for both TimeToTrade and TigerWit. In the past few years we have built a significant database of traders that use our platform with its fully integrated alerting, strategy builder and chart trading functions. With TigerWit's expertise we will be able to pool our technical knowhow and industry knowledge to provide clients with the best tools and a safe trading environment.\"\nNotes to Media\nAbout TigerWit\nTigerWit's cutting-edge mobile and online trading technology allows clients to trade global FX markets, indices, commodities and metals, whilst ensuring exceptional client protection and providing clients access to global interbank liquidity. TigerWit has offices in Beijing, Shanghai and Nassau.\nTigerWit Holding Limited is the parent company of the TigerWit Group. The Group includes TigerWit Financial Services Ltd which is authorised and regulated by the Securities Commission of The Bahamas, licence number SIA-F185.\nhttps://global.tigerwit.com/\nRisk Warning\nTrading CFDs carries a high level of risk and can result in the loss of all of your invested capital.\nView original content: http://www.prnewswire.com/news-releases/tigerwit-acquires-uk-based-fca-regulated-retail-broker-mercor-index-ltd-300581324.html\nSOURCE TigerWit", "external_links": ["https://global.tigerwit.com/", "http://www.prnewswire.com/news-releases/tigerwit-acquires-uk-based-fca-regulated-retail-broker-mercor-index-ltd-300581324.html"], "published": "2018-01-11T14:17:00.000+02:00", "crawled": "2018-01-11T15:13:58.000+02:00", "highlightTitle": ""}