{"organizations": [], "uuid": "38e400c80eca32b9fbe7b56cea904eef38d1fdea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-european-stocks-to-dip-as-global-rally-fizzles-out-idUSL8N1P60LF", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Morning call: European stocks to dip as global rally fizzles out", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T08:14:00.000+02:00", "replies_count": 0, "uuid": "38e400c80eca32b9fbe7b56cea904eef38d1fdea"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-european-stocks-to-dip-as-global-rally-fizzles-out-idUSL8N1P60LF", "ord_in_thread": 0, "title": "LIVE MARKETS-Morning call: European stocks to dip as global rally fizzles out", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sodexo", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "cartier", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "sodexo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "richemont", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 6:15 AM / Updated an hour ago LIVE MARKETS- Closing snapshot: STOXX retreats as ECB minutes push euro higher Reuters Staff 17 Min Read \n* European shares slip after ECB minutes * Results disappointment hits Pandora, Tesco, M&S * CS upgrades 'relatively very cheap' UK stocks * Italian stocks set for 7 straight days of gains * FTSE hits new record despite M&S, Tesco shares slump Jan 11 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Helen Reid. Reach her on Messenger to share your thoughts on market moves: helen.reid.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: STOXX RETREATS AS ECB MINUTES PUSH EURO HIGHER (1635 GMT) The STOXX closed down 0.3 percent and never recovered from the rise in the euro following the publication of the ECB's minutes, which bolstered expectations of a shift in monetary policy. Note also that despite the slump of Marks and Spencer and Tesco shares, the FTSE hit a new high. Good evening from us, here's your closing snapshot: (Julien Ponthus) MACQUARIE FAVOURS U.S. BANKS OVER EUROPE (1547 GMT) The sector has come into focus with the Q4 results season just round the corner and bond yields on the rise. \"We believe U.S. banks will push their advantage and continue to gain share due to stronger capital position and a lower tax rate improving internal returns,\" Macquarie analysts said in a note. \"As a result, we prefer US to European banks,\" Macquarie adds, singling out Bank of America , Goldman and Morgan Stanley. Their 'top shorts' are Deutsche Bank and UBS, while they like BNP's more diversified model. (Kit Rees) O BREXIT CONSENSUS, WHERE ART THOU? (1515 GMT) With Brexit hardliner Nigel Farage now warming to the idea of a second UK referendum on EU membership, it seems no one -- be it the public, markets or politicians -- can make up their mind on when, how or even whether Britain will exit the EU. Nomura just updated its tick list of signs that could lead to \"No Brexit\", such as a second referendum, after Farage's comments. \"Rarely has the UK’s economic and political outlook seemed so uncertain\", said Kallum Pickering, senior UK economist at Berenberg. Consider this: Didier Saint-Georges, managing director at Carmignac says that given the economic pain expected in 2018 in the UK, he is \"starting the year with a short position on sterling which should pay off if a downward spiral gets going\". Taking the opposite view, Guy Stephens, technical investment director at Rowan Dartington, said Prime Minister Theresa May's recent cabinet reshuffle is \"further evidence of her strengthening position which must be good for sterling\". Also, while being underweight UK equities is a common call for most international investment banks, Credit Suisse just went back to \"neutral\" and Raymond James made the case that \"ever more conciliatory\" commentary around Brexit could support equities. Here below is Nomura's chart showing the shift in public opinion in favour of the view that Britain was, with hindsight, wrong to vote 'Leave'. (Julien Ponthus and Helen Reid) NEW YEAR PARTY CONTINUES IN ITALY (1426 GMT) Italy's top FTSE MIB index is bucking today's weakness, has hit a fresh 29-month high and is rising for the seventh session in a row, its longest winning streak since October 2016. The index is also the biggest gainer among the European bourses year-to-date. Why such buoyancy? After all, Italy is set to hold a general election on March 4 and its outcome is all but certain. We've asked Alessandro Balsotti, head of asset management at JCI Capital. \"It's been a strong start of the year for global stocks and Italy has a high beta that can explain why it's outperforming. Italy is a proxy of European markets and it's gearing towards financial stocks which are doing particularly well because of the yield curve steepening. I don't think there is an immediate political reason,\" he says. (Danilo Masoni) UK EQUITY ALLOCATIONS TO RISE? (1338 GMT) While allocations to UK equities have been at rock bottom \"for many months\", Raymond James European strategist Chris Bailey reckons a recent recovery in the pound and UK domestic stocks (see chart below) could continue, driving money back into the market some investors have shunned as Brexit looms. \"Our call is that the UK doesn't end 2018 so out of favour,\" he says, adding \"ever more conciliatory\" commentary around Brexit will support equities. \"The longer the transition, the better for the UK.\" Meanwhile Credit Suisse is also sounding more optimistic on British stocks. It just upgraded MSCI UK to 'neutral' from 'underperform', saying \"UK equities are very cheap on a relative basis, but the fundamentals and technicals are challenging\". CS had moved UK equities to underweight back in September last year. (Dhara Ranasinghe and Helen Reid) \"JUST ONE WORD: PLASTICS\" (1312 GMT) In \"The Graduate\", a young Dustin Hoffman (a.k.a. Benjamin Braddock), fresh out of university, is famously given a piece of advice for his future career: \"just one word, plastics\". Fifty years later, the future isn't what it used to be: Theresa May just pledged to eliminate avoidable plastic waste within 25 years. Here's the story : According to Paul Moran, head of research for Northern Trust Capital Markets, this could be a game changer (a 'diesel' moment) for the industry which investors, particularly shareholders in UK packaging group RPC, should not overlook. \"If we look at plastic packaging stocks in Europe, RPC stands out given it's basically all plastic. As plastic is viewed as the structural grower in the packaging industry, this ought to be a big concern for long term investors.\" RPC shares are currently down 1.2 percent. Bonus: the \"plastics\" scene : bit.ly/1t8d96b (Julien Ponthus) EUROPEAN SHARES GIVE UP GAINS AS MARKETS EYE ECB POLICY SHIFT (1247 GMT) The STOXX 600 gave up its gains and is now down 0.1 percent as investors eye a policy shift it the ECB's decision to revisit its communication stance in early 2018. Here's the link to our story on the minutes from the central bank's December policy meeting: And here's the market reaction after the minutes were released: (Julien Ponthus) BUBBLE CONCERNS FOR U.S. EQUITIES \"OVERDONE\", AMUNDI RECKONS (1203 GMT) While a growing number of investors are increasingly nervous about the gap in valuations between U.S. and European equities and accordingly shifting investments towards the Euro zone or Japan, it's interesting to note that Amundi is keeping quite a positive view on U.S shares. \"Looking into 2018, we believe that the concerns about a bubble for US equities are overdone\", writes Kenneth J. Taubes, CIO of Amundi's US Investment Management, who believes there is room for corporate profits to rise. \"We expect that the combined impact of an improving US economy, a stronger global economy and lower taxes will support EPS growth\", Taubes said, adding that stock picking will however be more important than ever. \"As certain stocks are over-valued, a rigorous bottom-up security selection will be key\", he said. Here's a SocGen chart showing the gap between valuations in the U.S., Japan and the Euro zone : (Julien Ponthus) MULTI-ASSET MANAGERS REASSESS BOND-EQUITY RELATIONSHIP (1135 GMT) The prospect of monetary policy normalization this year has got multi-asset managers thinking about how best to keep their portfolios well-diversified. Tommaso Mancuso, head of multi as", "external_links": [], "published": "2018-01-11T08:14:00.000+02:00", "crawled": "2018-01-11T08:47:12.005+02:00", "highlightTitle": ""}