{"organizations": [], "uuid": "c6629e3a2c6d269eda624a7a7d2b20130ec9edfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221733906&w=1200&r=LYNXMPEE0C0FT", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-che-lei/chelsea-held-0-0-at-home-by-leicester-idUKKBN1F20PH", "country": "US", "domain_rank": 408, "title": "Chelsea held 0-0 at home by Leicester", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T19:08:00.000+02:00", "replies_count": 0, "uuid": "c6629e3a2c6d269eda624a7a7d2b20130ec9edfb"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-che-lei/chelsea-held-0-0-at-home-by-leicester-idUKKBN1F20PH", "ord_in_thread": 0, "title": "Chelsea held 0-0 at home by Leicester", "locations": [], "entities": {"persons": [{"name": "chelsea", "sentiment": "negative"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "antonio conte", "sentiment": "none"}, {"name": "pedro", "sentiment": "none"}, {"name": "daniel amartey", "sentiment": "none"}, {"name": "willian", "sentiment": "none"}, {"name": "ben chilwell", "sentiment": "none"}, {"name": "matty james", "sentiment": "none"}, {"name": "riyad mahrez", "sentiment": "none"}, {"name": "cesc fabregas", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "leicester city - stamford bridge", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "negative"}, {"name": "leicester", "sentiment": "negative"}, {"name": "leicester reuters staff", "sentiment": "negative"}, {"name": "l - r", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "nicholls  chelsea", "sentiment": "none"}, {"name": "leicester city soccer football", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 5:12 PM / Updated 36 minutes ago Tired Chelsea held 0-0 at home by lively Leicester William Schomberg , Clare Lovell 3 Min Read \nLONDON (Reuters) - Lacklustre Chelsea were held to a goalless draw at home by 10-man Leicester City on Saturday, handing the advantage to Manchester United in what has become a race for second place in the Premier League behind runaway leaders Manchester City. Soccer Football - Premier League - Chelsea vs Leicester City - Stamford Bridge, London, Britain - January 13, 2018 (L - R) Leicester City's Daniel Amartey, Jamie Vardy, Matty James and Demarai Gray after the match REUTERS/Peter Nicholls \nIt was the third game in a row that Chelsea had failed to score, after 0-0 cup stalemates against Norwich City and Arsenal with striker Alvaro Morata looking frustrated and devoid of confidence. \nThe champions struggled for much of the game against the team that won the title a year before them, with Leicester creating a string of chances in the first half, thanks in large part to winger Riyad Mahrez, who has been the subject of constant transfer speculation. \nChelsea improved after coach Antonio Conte replaced Eden Hazard and Cesc Fabregas with Pedro and Willian in the 58th minute. \nBut even though Leicester went down to 10 men when defender Ben Chilwell was booked twice in five minutes midway through the second half, the home side failed to capitalise on the advantage, lacking ruthlessness and the final incisive pass. \n“I think I saw a lot of very tired players,” Conte said. “We suffered a lot, then when I decided to put fresh energy on we had a big chance to score.” \nChelsea have played seven games in the last three weeks, including a League Cup semi-final against Arsenal on Wednesday. Soccer Football - Premier League - Chelsea vs Leicester City - Stamford Bridge, London, Britain - January 13, 2018 Chelsea's N'Golo Kante and Leicester City's Matty James after the match REUTERS/Peter Nicholls \nMorata has failed to score for five games but Conte said the problem was not with his striker. \n“The problem is for the team not only for Morata,” he said. “Compared to last season we are conceding less. But at the same time we are showing not great quality in our finishing... it’s not just Morata.” \nLeicester coach Claude Puel said he felt his side had dropped two points, based on the their performance until the sending off. Slideshow (2 Images) \n“In the end it was a good point, playing 10 against eleven... I think the sending off was harsh,” he said. \nPuel’s side defended patiently and in numbers for the last 20 minutes, Harry Maguire and Aleksandar Dragovic snuffing out Chelsea moves and Algerian Mahrez looking dangerous on the break. \n“He (Mahrez) is happy in playing, in training, he is happy with us and his team mates,” Puel said. “There is a lot of speculation about the players... and we want to keep our best player.” \nThe result puts Chelsea on 47 points, the same as Manchester United who play on Monday at home to struggling Stoke City. Leaders Manchester City have a 15-point advantage over both clubs. \nThe London side meet Norwich City in an FA Cup replay at Stamford Bridge on Wednesday. Reporting by William Schomberg and Clare Lovell; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-13T19:08:00.000+02:00", "crawled": "2018-01-13T19:58:42.000+02:00", "highlightTitle": ""}