{"organizations": [], "uuid": "d2195d577fe932ca2b1347886a3e37a1d27f4c8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226633966&w=1200&r=LYNXMPEE0T131", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-northkorea-missiles-usa/u-s-general-says-north-korea-not-demonstrated-all-components-of-icbm-idUSKBN1FJ23Z", "country": "US", "domain_rank": 408, "title": "U.S. general says North Korea not demonstrated all components of ICBM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:13:00.000+02:00", "replies_count": 0, "uuid": "d2195d577fe932ca2b1347886a3e37a1d27f4c8c"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-usa/u-s-general-says-north-korea-not-demonstrated-all-components-of-icbm-idUSKBN1FJ23Z", "ord_in_thread": 0, "title": "U.S. general says North Korea not demonstrated all components of ICBM", "locations": [], "entities": {"persons": [{"name": "selva", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}, {"name": "paul selva", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "idrees aliediting", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. joint chiefs of staff", "sentiment": "none"}, {"name": "u.s. air force", "sentiment": "none"}, {"name": "icbm reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:14 PM / in 4 hours U.S. general says North Korea not demonstrated all components of ICBM Idrees Ali 3 Min Read \nWASHINGTON (Reuters) - North Korea’s nuclear program has made strides in recent months but the country has not yet demonstrated all the components of an intercontinental ballistic missile (ICBM), including a survivable re-entry vehicle, the vice chairman of the U.S. Joint Chiefs of Staff said on Tuesday. \nAir Force General Paul Selva’s remarks confirmed an assessment by Defense Secretary Jim Mattis in December that North Korea’s ICBM did not pose an imminent threat to the United States. \n“What he has not demonstrated yet are the fusing and targeting technologies and survivable re-entry vehicle,” Selva said, referring to North Korean leader Kim Jong Un. \n“It is possible he has them, so we have to place the bet that he might have them, but he hasn’t demonstrated them,” Selva, the second highest-ranking U.S. military official, added. \nIn November, North Korea said it had successfully tested a new type of ICBM that could reach all of the U.S. mainland and South Korea. U.S.-based experts said data from the test appeared to support that. FILE PHOTO - Vice Chairman of the Joint Chiefs of Staff U.S. Air Force General Paul Selva speaks at the Center for Strategic and International Studies in Washington, U.S., October 28, 2016. REUTERS/Gary Cameron \nSelva said that if conflict were to break out, it was unlikely the United States would be able to get an early indication of North Korean launches. \n“It is very unlikely that in a tactical situation, we would get any of the indications and warning that would precede a launch other than if we got lucky and saw the movement of the launch mechanism to the launch platform,” Selva said. \nHe added that by using mobile erected launchers, the warning time for the United States had decreased from up to an hour to about a dozen minutes. \nThe Trump administration has said all options are on the table in dealing with North Korea, but debate on military options has lost some momentum in recent weeks after North and South Korea resumed talks ahead of next month’s Winter Olympics in the South. \nSelva said the Pentagon’s upcoming nuclear posture review, expected to be released on Friday, would lay out the future of nuclear modernization and may include new missiles on submarines. \nA leaked draft policy document posted online this month, said the United States would pursue development of a new nuclear-armed sea-launched cruise missile. Reporting by Idrees Ali; Editing by Chizu Nomiyama, James Dalgleish and David Gregorio", "external_links": [], "published": "2018-01-30T17:13:00.000+02:00", "crawled": "2018-01-30T17:35:53.022+02:00", "highlightTitle": ""}