{"organizations": [], "uuid": "2bbccc3ceb4cef9d2bb0ce184a949d3a36a66504", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/24/104044009-IMG_2470r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/19/investor-bill-miller-attributes-his-success-to-studying-philosophy.html", "country": "US", "domain_rank": 767, "title": "Investor Bill Miller attributes his success to studying philosophy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.597, "site_type": "news", "published": "2018-01-22T16:17:00.000+02:00", "replies_count": 0, "uuid": "2bbccc3ceb4cef9d2bb0ce184a949d3a36a66504"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/19/investor-bill-miller-attributes-his-success-to-studying-philosophy.html", "ord_in_thread": 0, "title": "Investor Bill Miller attributes his success to studying philosophy", "locations": [], "entities": {"persons": [{"name": "bill miller", "sentiment": "positive"}, {"name": "miller", "sentiment": "none"}, {"name": "johns hopkins", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "lee university", "sentiment": "none"}, {"name": "johns hopkins university", "sentiment": "none"}, {"name": "hub", "sentiment": "none"}, {"name": "miller value partners", "sentiment": "none"}, {"name": "legg mason", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "johns hopkins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Legendary hedge fund investor Bill Miller says he is successful in large part because he studied philosophy.\nMiller, who managed a fund at Legg Mason that beat the S&P 500 for 15 years straight through 2005, was first introduced to the subject while getting his undergraduate degree in economics from Washington and Lee University in 1972.\n\"I had taken exactly one philosophy course in college, but it led me to read a lot more philosophy when I was in the army during the Vietnam War,\" says Miller to Johns Hopkins' online news outlet, the Hub . \"I decided to apply to a PhD program once my time in the military was ending.\"\nMiller ended up taking graduate courses in philosophy as part of a PhD program at The Johns Hopkins University. Tuesday, the school said that Miller was donating $75 million to its philosophy department.\nIt means that much to Miller, who founded his own investment fund, Miller Value Partners .\n\"I attribute much of my business success to the analytical training and habits of mind that were developed when I was a graduate student at Johns Hopkins,\" Miller says.\nIn addition to ancient Greek philosophers like Plato and Aristotle Miller appreciated David Hume, Immanuel Kant, William James, John Dewey and Ludwig Wittgenstein, he tells CNBC Make It , through a representative.\nshow chapters Warren Buffett is worth $75 billion but says he would be 'very happy' with way less 11:50 AM ET Wed, 28 June 2017 | 01:04 While it may seem counter-intuitive for a finance executive to attribute his success to studying philosophy, billionaire tech investor Mark Cuban also sees the benefits.\n\"I would not want to be a CPA right now. I would not want to be an accountant right now,\" says Cuban, speaking at SXSW in Austin . \"I would rather be a philosophy major.\"\nAutomation is accelerating so quickly, argues Cuban, that it's smart to spend tim learning something computers won't be able to replicate.\n\"Knowing how to critically think and assess them from a global perspective I think is going to be more valuable than what we see as exciting careers today which might be programming or CPA or those types of things,\" Cuban says.\nSee also:\nMark Cuban: The world's first trillionaire will be an artificial intelligence entrepreneur\nLegendary investor Bill Miller: Market could be headed for a 'melt-up' of 30%\nBitcoin makes up nearly a third of Bill Miller's market-crushing hedge fund, report says\nshow chapters Mark Cuban: AI will produce the world’s first trillionaires 4:19 PM ET Fri, 21 April 2017 | 00:46 Like this story? Like CNBC Make It on Facebook .\nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-22T16:17:00.000+02:00", "crawled": "2018-01-22T16:44:03.018+02:00", "highlightTitle": ""}