{"organizations": [], "uuid": "4c17abe465e5294ad54e0bf3060d19216aa5a1eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sap-increases-commitment-to-powering-innovation-in-france.html", "country": "US", "domain_rank": 767, "title": "SAP Increases Commitment to Powering Innovation in France", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:00:00.000+02:00", "replies_count": 0, "uuid": "4c17abe465e5294ad54e0bf3060d19216aa5a1eb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sap-increases-commitment-to-powering-innovation-in-france.html", "ord_in_thread": 0, "title": "SAP Increases Commitment to Powering Innovation in France", "locations": [], "entities": {"persons": [{"name": "bill mcdermott", "sentiment": "negative"}], "locations": [{"name": "france walldorf", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "sap", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "leonardo machine learning", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALLDORF, Germany, Jan. 22, 2018 /PRNewswire/ -- SAP SE (NYSE: SAP) CEO Bill McDermott today announced a series of planned investments for SAP's operations in France over the next five years to accelerate the company's digital strategy and support France's growing position as a hub of innovation.\nThe move includes:\nOpening the second SAP.iO Foundry location in Europe to provide more than 50 startups with mentorship, technology and access to the vibrant SAP ecosystem Investment by SAP.iO Fund in French startups in the seed or Series A round Spend by SAP of €150 million in research and development annually over the next five years Acquisition of Recast.AI to accelerate development of SAP ® Leonardo Machine Learning capabilities\nSignaling its continued support for France, SAP estimates a more than €2 billion spend over five years, intended to accelerate the company's fast growth in the cloud and advance a technology community focused on machine learning (ML), blockchain, the Internet of Things (IoT) and software as a service (SaaS). The step reflects SAP's global strategy – fueled by the SAP Leonardo digital innovation system – to help every organization become an intelligent enterprise. SAP will focus on startups that build solutions complementary to the SAP Leonardo system to foster fast collaboration and global scale.\n\"There is a real sense of economic momentum in France,\" Bill McDermott, CEO, SAP, said after a meeting with French President Emmanuel Macron. \"President Macron's bold embrace of the digital world will help France rise to an enviable position as a global innovation leader. We see immense potential in the entrepreneurial spirit of France to disrupt business models, create modern jobs and unleash exciting new opportunities that help the world run better.\"\nFor the first time, the incubation and innovation activities SAP undertakes in France include investment in startups with special focus on global impact, such as sustainability and climate change, where France is taking a leadership role. This new focus on social impact will complement the SAP.iO program's strategic investments, which align with core businesses and technologies of SAP. The startups, led by dynamic entrepreneurs, play a critical role in extending SAP's footprint and creating high-value use cases for customers.\nRecast.AI Acquisition to Accelerate Natural Language Processing Capabilities\nRecast.AI provides a development environment – software, technology and applications – that uses natural language, for example, chatbots. Recast.AI's technology matches the requirements of conversational chatbots and allows high-performance natural language processing that supports more than 20 languages.\nThe acquisition will help SAP enhance the natural language processing capabilities in SAP solutions to help customers enjoy an improved user experience. SAP aims to simplify complex business interactions and processes by employing conversational user experience technology. The intention is to have applications speak to SAP software users in natural language. SAP created the SAP CoPilot digital assistant, a Web application, and an in-house platform to build conversational applications. SAP intends to use this platform across a wide breadth of its portfolio.\nRecast.AI was founded in 2015, emerging from French coding school \"42,\" and is currently located at the incubator \"Station F.\" The company has grown quickly and today serves international customers in France, including large banks and insurance and tech companies. Recast.AI provides a modern ML-based technical architecture and owns proprietary algorithms that understand natural language. Its team of highly talented data scientists and engineers will strengthen ML development at SAP.\nSAP is acquiring Recast.AI through its direct French subsidiary SAP France Holding, a limited liability company. Both companies agreed not to disclose details of the transaction.\nSAP France celebrated its 30-year anniversary in 2017. Thousands of organizations in France – public and private – rely on SAP solutions and services to help them run at their best. In addition to hosting two of the 19 SAP Labs of SAP Labs Network, the company opened a flagship SAP Leonardo Center location in Paris last year. The location harnesses technologies such as AI and ML to deliver greater value to customers across the region. Innovation is core to operations in France. It includes plans to develop the France Innovation hub with the opening of Sports Center, an SAP Future Cities initiative and the extension of the SAP Leonardo Center location, which has already hosted more than 30,000 visitors since its opening.\nVisit the SAP News Center . Follow SAP on Twitter at @sapnews .\nAbout SAP\nAs market leader in enterprise application software, SAP (NYSE: SAP) helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable more than 365,000 business and public sector customers to operate profitably, adapt continuously, and grow sustainably. For more information, visit www.sap.com .\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"predict,\" \"should\" and \"will\" and similar expressions as they relate to SAP are intended to identify such forward-looking statements. SAP undertakes no obligation to publicly update or revise any forward-looking statements. All forward-looking statements are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. The factors that could affect SAP's future financial results are discussed more fully in SAP's filings with the U.S. Securities and Exchange Commission (\"SEC\"), including SAP's most recent Annual Report on Form 20-F filed with the SEC. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates.\n© 2018 SAP SE. All rights reserved.\nSAP and other SAP products and services mentioned herein as well as their respective logos are trademarks or registered trademarks of SAP SE in Germany and other countries. Please see http://www.sap.com/corporate-en/legal/copyright/index.epx#trademark for additional trademark information and notices.\nFor customers interested in learning more about SAP products:\nGlobal Customer Center: +49 180 534-34-24\nUnited States Only: 1 (800) 872-1SAP (1-800-872-1727)\nFor more information, press only:\nRajiv Sekhri, +49 6227 7-74871, rajiv.sekhri@sap.com , CET\nDaniel Reinhardt, SAP, +49 6227 7-40201, daniel.reinhardt@sap.com , CET\nSAP News Center press room ; press@sap.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sap-increases-commitment-to-powering-innovation-in-france-300585857.html\nSOURCE SAP SE", "external_links": ["http://www.news-sap.com/press-room/", "https://www.sap.com/products/leonardo/machine-learning.html#pdf-asset=7c6ceee8-d67c-0010-82c7-eda71af511fa&pdf-page=5", "https://recast.ai/", "http://www.prnewswire.com/news-releases/sap-increases-commitment-to-powering-innovation-in-france-300585857.html", "http://www.news.sap.com/", "http://twitter.com/sapnews/", "https://www.sap.com/products/leonardo.html", "http://www.sap.com/corporate-en/legal/copyright/index.epx#trademark", "http://www.sap.com/", "http://sap.io/en-us/fund.html"], "published": "2018-01-22T21:00:00.000+02:00", "crawled": "2018-01-22T23:34:47.000+02:00", "highlightTitle": ""}