{"organizations": [], "uuid": "997f2b2c343ce2bd695e1c8220e15a14cf077832", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 58, "shares": 58, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221976515&w=1200&r=LYNXMPEE0D0L2", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/us-swiss-franc-shock/three-years-on-from-currency-shock-swiss-central-bank-cant-get-back-to-normal-idUSKBN1F30FQ", "country": "US", "domain_rank": 408, "title": "Three years on from currency shock, Swiss central bank can't get back to normal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T04:58:00.000+02:00", "replies_count": 0, "uuid": "997f2b2c343ce2bd695e1c8220e15a14cf077832"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-swiss-franc-shock/three-years-on-from-currency-shock-swiss-central-bank-cant-get-back-to-normal-idUSKBN1F30FQ", "ord_in_thread": 0, "title": "Three years on from currency shock, Swiss central bank can't get back to normal", "locations": [], "entities": {"persons": [{"name": "daniel rempfler", "sentiment": "none"}], "locations": [{"name": "zurich", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "snb", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Three years after the Swiss National Bank shocked currency markets by scrapping the franc’s peg to the euro, it faces the toughest task of any major central bank in normalising ultra-loose monetary policy.\nIf it raises rates, the Swiss franc strengthens. If it sells off its massive balance sheet, the Swiss franc strengthens. If a global crisis hits, the Swiss franc strengthens.\nAnd the abrupt decision to scrap the currency peg on Jan. 15, 2015, means it still has credibility issues with financial markets.\n“The SNB will most probably be one of the last central banks to change course, and it will take years or even decades for monetary policy to return to ‘normal’,” said Daniel Rempfler, head of fixed income Switzerland at Swiss Life Asset Managers.\nThe Bank of Japan illustrated the problem of reducing expansive policy when a small cut to its regular bond purchases sent the yen and bond yields higher.\nThe scrapping of the cap - which sought to keep the franc at 1.20 to the euro EURCHF= to protect exporters and ward off deflationary pressure - sent it soaring. On the day of the announcement it went to 0.86 francs buying a euro before easing in later days.\nAlthough it weakened last year, SNB Chairman Thomas Jordan said in December it was too early to talk about normalising policy.\nThe SNB declined to comment further.\n(For a graphic of the Swiss Franc vs Euro click reut.rs/2CX9KDl )\nTHINKING IN DECADES The SNB has to wait for the European Central Bank to start raising interest rates before it can start hiking its own policy rate from minus 0.75 percent.\nIf the SNB acted first, the spread between Swiss and European market rates would narrow, making Swiss investments more attractive and boosting the franc.\nThe ECB has already scaled back its asset purchasing programme, which is expected to end this year, but more action may be someway off.\nMeanwhile, any attempt by the SNB to cut its balance sheet - which has ballooned to 837 billion francs ($861 billion) - will be hard because 94 percent of its investments are in foreign currencies, held via bonds and shares in companies such as Apple ( AAPL.O ) and Starbucks ( SBUX.O ).\nThe proceeds of sales would convert to francs, again putting upward pressure on the Swiss currency, whose strength drags on the export-reliant economy.\nCommunicating policy that both cuts and protects would also be tricky.\n“It is very difficult to say you are ready to intervene in the forex markets when you also winding down the balance sheet,” said Florian Weber, an analyst at Bank J.Safra Sarasin.\nMeanwhile the massive increase of franc liquidity following the SNB’s printing of francs to weaken the currency has reduced the SNB’s ability to steer interest rates via repurchase agreements.\nBefore the crisis the SNB provided short-term cash to commercial banks to help reach minimum reserve requirements. The interest rate on repos helped steer the interbank lending rate.\n(For graphic click reut.rs/2Dn4eel )\nBut commercial banks now hold reserves nearly 460 billion francs above the minimum requirement, and the SNB has discontinued the repo business. The SNB would have to issue bills on a massive scale to absorb the liquidity.\n“There are particular problems that will lead the SNB to be very late in the game to normalise monetary policy,” said Alan Mudie, group head of investment strategy at Societe Generale.\n“It may take at least a decade.”\n($1 = 0.9718 Swiss francs)\nReporting by John Revill and Angelika Gruber Editing by Jeremy Gaunt\n ", "external_links": ["http://reut.rs/2Dn4eel", "http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2CX9KDl"], "published": "2018-01-15T04:58:00.000+02:00", "crawled": "2018-01-15T09:40:58.000+02:00", "highlightTitle": ""}