{"organizations": [], "uuid": "13ed79293b7f61a493e7a1d2f18e53038fca695e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-coca-cola-bottling-co-consolidated-announces-repositioning-of-its-executive-vice-presidents.html", "country": "US", "domain_rank": 767, "title": "Coca Cola Bottling Co. Consolidated Announces Repositioning of its Executive Vice Presidents", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:05:00.000+02:00", "replies_count": 0, "uuid": "13ed79293b7f61a493e7a1d2f18e53038fca695e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-coca-cola-bottling-co-consolidated-announces-repositioning-of-its-executive-vice-presidents.html", "ord_in_thread": 0, "title": "Coca Cola Bottling Co. Consolidated Announces Repositioning of its Executive Vice Presidents", "locations": [], "entities": {"persons": [{"name": "e. beauregarde fisher", "sentiment": "none"}, {"name": "hank flint", "sentiment": "none"}, {"name": "james e. harris", "sentiment": "none"}, {"name": "j. frank harrison", "sentiment": "none"}, {"name": "robert g. chambless", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "coca‑cola bottling co", "sentiment": "negative"}, {"name": "coke", "sentiment": "neutral"}, {"name": "coca cola bottling co", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "business transformation and business services david m. katz executive", "sentiment": "none"}, {"name": "coca-cola company", "sentiment": "none"}, {"name": "coke consolidated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Coca‑Cola Bottling Co. Consolidated (NASDAQ:COKE) today announced a repositioning of its executive vice president officer group effective January 26, 2018. The following officers will assume new titles:\nRobert G. Chambless Executive Vice President, Franchise Beverage Operations E. Beauregarde Fisher, III Executive Vice President, General Counsel and Secretary James E. Harris Executive Vice President, Business Transformation and Business Services David M. Katz Executive Vice President and Chief Financial Officer “The repositioning of our executive vice president team resulted from the Company’s ongoing, succession planning process and from our continued focus on maximizing stockholder value since our recent acquisitions from The Coca-Cola Company, which have transformed our Company,” said Coke Consolidated Chairman and CEO J. Frank Harrison, III. “I believe these changes will continue to position the Company for sustainable, long-term success in serving our consumers, customers, communities and teammates.”\nHank Flint, President and Chief Operating Officer, added, “This repositioning demonstrates the depth and quality of our senior leadership team, as well as our desire to empower this team to capitalize on the Company’s recent transformative growth, which resulted from our series of acquisitions of distribution territory and manufacturing facilities.”\nRobert Chambless, as Executive Vice President, Franchise Beverage Operations, will continue to oversee all of the Company’s sales, marketing and distribution operations, and will now manage product supply planning and manufacturing operations as well. Prior to this role, Chambless has served in various roles since joining the Company in 1986.\nBeau Fisher, as Executive Vice President, General Counsel and Secretary, will continue to oversee legal and governance matters and will now also oversee insurance and risk management, internal controls services and administrative services.\nJamie Harris, as Executive Vice President, Business Transformation and Business Services, will continue to oversee the Company’s information technology, real estate, business services, and the transition and integration of the recently-acquired distribution territories and manufacturing facilities. He also leads our business transformation group that will coordinate planning and implementation of enterprise business and continuous improvement initiatives. Harris has served in a number of roles since joining the Company in January 2008, including as Chief Financial Officer of the Company.\nDave Katz, as Executive Vice President and Chief Financial Officer, will assume executive responsibility for finance, accounting, tax, treasury, public affairs and communications. Katz has served in various roles since joining the Company in January 2013, including as Assistant to the Chairman and Senior Vice President of Product Supply and Human Resources, and Culture & Stewardship. Before joining the Company, Mr. Katz also served in multiple roles with Coca-Cola Refreshments and its predecessor, Coca-Cola Enterprises, Inc.\nAbout Coca‑Cola Bottling Co. Consolidated\nCoke Consolidated is the largest Coca-Cola bottler in the United States. Our Purpose is to honor God, serve others, pursue excellence and grow profitably. For 115 years, we have been deeply committed to the consumers, customers, and communities we serve and passionate about the broad portfolio of beverages and services we offer. We make, sell, and deliver beverages of The Coca-Cola Company and other partner companies in more than 300 brands and flavors to 65 million consumers in territories spanning 14 states and the District of Columbia.\nHeadquartered in Charlotte, N.C., Coke Consolidated is traded on the NASDAQ under the symbol COKE. More information about the company is available at www.cokeconsolidated.com . Follow Coke Consolidated on Facebook , Twitter , Instagram and LinkedIn .\nCautionary Information Regarding Forward-Looking Statements\nCertain statements contained in this news release are “forward-looking statements” that involve risks and uncertainties. The words “believe,” “expect,” “project,” “will,” “should,” “could” and similar expressions are intended to identify those forward-looking statements. Factors that might cause Coke Consolidated’s actual results to differ materially from those anticipated in forward-looking statements include, but are not limited to: our inability to integrate the operations and employees acquired in expansion transactions; lower than expected selling pricing resulting from increased marketplace competition; changes in how significant customers market or promote our products; changes in our top customer relationships; changes in public and consumer preferences related to nonalcoholic beverages, including concerns related to obesity and health concerns; unfavorable changes in the general economy; miscalculation of our need for infrastructure investment; our inability to meet requirements under beverage agreements; material changes in the performance requirements for marketing funding support or our inability to meet such requirements; decreases from historic levels of marketing funding support; changes in The Coca-Cola Company’s and other beverage companies’ levels of advertising, marketing and spending on brand innovation; the inability of our aluminum can or plastic bottle suppliers to meet our purchase requirements; our inability to offset higher raw material costs with higher selling prices, increased bottle/can sales volume or reduced expenses; consolidation of raw material suppliers; incremental risks resulting from increased purchases of finished goods; sustained increases in fuel costs or our inability to secure adequate supplies of fuel; sustained increases in the cost of labor and employment matters, product liability claims or product recalls; technology failures or cyberattacks; changes in interest rates; the impact of debt levels on operating flexibility and access to capital and credit markets; adverse changes in our credit rating (whether as a result of our operations or prospects or as a result of those of The Coca-Cola Company or other bottlers in the Coca-Cola system); changes in legal contingencies; legislative changes affecting our distribution and packaging; adoption of significant product labeling or warning requirements; additional taxes resulting from tax audits; natural disasters and unfavorable weather; global climate change or legal or regulatory responses to such change; issues surrounding labor relations with unionized employees; bottler system disputes; our use of estimates and assumptions; changes in accounting standards; the impact of volatility in the financial markets on access to the credit markets; the impact of acquisitions or dispositions of bottlers by their franchisors; changes in the inputs used to calculate our acquisition related contingent consideration liability; and the concentration of our capital stock ownership. These and other factors are discussed in the Company’s regulatory filings with the Securities and Exchange Commission, including those in the Company’s fiscal 2016 Annual Report on Form 10-K, Item 1A. Risk Factors. The forward-looking statements contained in this news release speak only as of this date, and the Company does not assume any obligation to update them except as required by law.\n—Enjoy Coca‑Cola—\nMedia Contact:\nKimberly Kuo\nSenior Vice President, Public Affairs,\nCommunications and Communities\n704-557-4584\nSource:Coca-Cola Bottling Co. Consolidated", "external_links": ["https://www.globenewswire.com/Tracker?data=CrAUluvU3K14KsLo0VV71dvTfjA63sMKfdTKuQPp_PIsVMwXWgG1Xhsh0Cu0iXoNc5o5PjTeipTc5iCRs66x4A==", "https://www.globenewswire.com/Tracker?data=NpsvCScPhNZdTuxZcY3d7HRK-p4UDCPUHBd1zQr8ppBdK42guUdBQ7HlhL4RR1AEiM7hE-rlpncbX9UJi-UL_u0uEE6V4KbZbh-5OmzXEoU=", "https://www.globenewswire.com/Tracker?data=QGZQIxUh4YVYH0R0rida_qcMgrWiYB4UhPRFyIosk83LJBY1srQsqKtWnwEHzPwmzfZqVNxA-SAzE-AMsyo2eTcn3sO7P5wOxqHmkjY8FuA=", "https://www.globenewswire.com/Tracker?data=IZ3htUk7yLCqT4ocP-LkCMUb-rb3LG1OmsRh8-NpH_mrKKBSX3dLx_YW0LbS_IVIKefP8X3j14jsA4AQiNKK4vgJLyBjzO3Xs2AOFmzD9S-zwOZTahXLrxvqlICi-WbAcJ72C3sk5_ZSt8Vlc844vw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/399813bc-b491-495c-99c4-b531d2982193", "https://www.globenewswire.com/Tracker?data=v-NbV2U1t81j061UeQU0m8QG5R757i0p8VKOUI3-DwaJ54ctfimtLf6C4aYnWlMVvJAewVSHn-8DxPdW9fW5ALMx_a3NMhIrWVui9pRiyR4="], "published": "2018-01-27T00:05:00.000+02:00", "crawled": "2018-01-27T02:18:06.008+02:00", "highlightTitle": ""}