{"organizations": [], "uuid": "e890fbbf0506edfe5aa82bc8977c554eb14357cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/01/104923056-GettyImages-900286856.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/hong-kong-democracy-protesters-take-to-the-streets.html", "country": "US", "domain_rank": 767, "title": "Hong Kong democracy protesters take to the streets", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.854, "site_type": "news", "published": "2018-01-02T02:12:00.000+02:00", "replies_count": 0, "uuid": "e890fbbf0506edfe5aa82bc8977c554eb14357cb"}, "author": "Anthony Wallace", "url": "https://www.cnbc.com/2018/01/01/hong-kong-democracy-protesters-take-to-the-streets.html", "ord_in_thread": 0, "title": "Hong Kong democracy protesters take to the streets", "locations": [], "entities": {"persons": [{"name": "anthony wall", "sentiment": "neutral"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "civic square", "sentiment": "none"}], "organizations": [{"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hong Kong democracy protesters take to the streets Published 17 Hours Ago SHARES Anthony Wallace | AFP | Getty Images One of the last protesters is removed by members of security as he takes part in a New Year's Day pro-democracy rally in Hong Kong at the recently reopened Civic Square late on January 1, 2018. \nAfter a year that saw democracy advocates in Hong Kong jailed and ousted from public office, thousands marched through the streets of Hong Kong on New Year's Day to warn China not to meddle further in the city's affairs and undermine its autonomy. \nOver the past year, Hong Kong, a former British colony which returned to Chinese rule in 1997, has experienced what critics and pro-democracy activists describe as an intensifying assault on its autonomy by China's Communist Party leaders. \nThis is despite Beijing's promises to grant the city wide-ranging freedoms including an independent judiciary, under a so-called \"one country, two systems\" framework. \nBesides the controversial jailing of several prominent young activists for unlawful assembly over the massive 2014 \"Occupy\" pro-democracy protests, authorities also ejected six pro-democracy lawmakers from the legislature for failing to take proper oaths of office. \nThe city's reputation as one of Asia's most robust legal jurisdictions has also come under a cloud amidst accusations of a politicization of certain legal cases. \nThe protesters, who included many middle-aged and elderly citizens, held up banners and chanted the march's main theme to \"Protect Hong Kong\" during a walk of several kilometers to the city's government headquarters. show chapters 11:13 PM ET Thu, 29 June 2017 | 01:29 \nOthers decried an unprecedented move by China's parliament last week that said part of a high-speed railway station being built in Hong Kong would be regarded as mainland territory governed by mainland laws. \n\"We are here to tell the government that we will not give up,\" said Joshua Wong, one of the democracy activists jailed last year, but who is now out on bail pending an appeal. \n\"We have encountered many difficulties last year, including some of us being sued and jailed, but we will stand with Hong Kong people. We will fight for the rule of law, fight for Hong Kong, fight for the future, fight for the next generations.\" \nTwo protesters who dressed up as People's Liberation Army soldiers said they were concerned about the reach of China's security apparatus. Others called for full democracy as the only lasting means to safeguard the city's way of life. \nThe organizers of the march said some 10,000 people had showed up. Police, however, put the figure at 6,200. \nThe demonstration was largely peaceful, though some protesters who tried to later gather in a forecourt of the government's headquarters skirmished briefly with security guards. \nThe so-called \"Civic Square\" was where the 2014 pro-democracy protests first kicked off when a group of protesters stormed over a fence and faced off with local police. \nDespite the defiance on show, some said they feared Hong Kong would continue to be squeezed by Beijing. \n\"Everyone's doing what they can,\" said Andy Lau who was among the marchers. \"If we have the right to demonstrate then we should. But I'm not feeling positive. I think things will get worse.\" \nThe Hong Kong government, in a statement, said it \"fully respects the right of Hong Kong people to take part in processions and their freedom of expression.\" \nChina's leader Xi Jinping has said that while Hong Kong enjoys a high degree of autonomy under \"one country, two systems\", Beijing still holds supreme authority over the city and won't tolerate any challenge to its authority. Playing", "external_links": [], "published": "2018-01-02T02:12:00.000+02:00", "crawled": "2018-01-02T02:12:27.000+02:00", "highlightTitle": ""}