{"organizations": [], "uuid": "96a530ed2465ba2c7549953291685aab8ad7b081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222639341&w=1200&r=LYNXMPEE0G0AA", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-global-bitcoin/bitcoin-falls-more-than-7-pct-as-regulation-worriers-mount-idINKBN1F60CH", "country": "US", "domain_rank": 408, "title": "Bitcoin jolted by regulation worries, tumbles 11 percent on extended sell-off", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:47:00.000+02:00", "replies_count": 0, "uuid": "96a530ed2465ba2c7549953291685aab8ad7b081"}, "author": "", "url": "https://in.reuters.com/article/us-global-bitcoin/bitcoin-falls-more-than-7-pct-as-regulation-worriers-mount-idINKBN1F60CH", "ord_in_thread": 0, "title": "Bitcoin jolted by regulation worries, tumbles 11 percent on extended sell-off", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}, {"name": "charles hayter", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:00 AM / Updated 23 minutes ago Bitcoin slumps below $10,000, half its peak, as regulatory fears intensify Tommy Wilkes , Hideyuki Sano 5 Min Read \nLONDON/TOKYO (Reuters) - Bitcoin skidded below $10,000 on Wednesday, halving in value from its peak price, with investors gripped by fears regulators could clamp down on the volatile cryptocurrency that sky-rocketed last year. \nThe price of bitcoin, the world’s biggest and best known cryptocurrency, fell to as low as $9,500 on the Luxembourg-based Bitstamp exchange, the lowest since Dec. 1. \nBitcoin had touched a peak of almost $20,000 in December - and indeed crossed over that threshold on some exchanges - but has since been roiled by several large selloffs. \nOther cryptocurrencies plunged as well. Ethereum and Ripple were both down heavily after reports South Korea and China could ban cryptocurrency trading, sparking worries of a wider regulatory crackdown. \n“There is a lot of panic in the market. People are selling to try and get the hell out of there,” said Charles Hayter, founder of Cryptocompare, which owns cryptocurrencies. \n“You have more regulatory uncertainty ... and because of these falls, you have these other fallouts,” he said, referring to the collapse of some cryptocurrencies in the recent slump in prices. \nAnalysts at Citi said on Wednesday bitcoin could halve again in value amid the current rout, adding that a possible fall to between the $5,605 and $5,673 area “looks very likely to be very speedy”. \nWith South Korea, Japan and China all making noises about a regulatory swoop, and officials in France and the United States vowing to investigate cryptocurrencies, there are concerns that global coordination on how to regulate them will accelerate. \nOfficials are expected to debate the rise of bitcoin at the upcoming G20 summit in Argentina in March. \n“Cryptocurrencies could be capped in the current quarter ahead of the G20 meeting in March, where policymakers could discuss tighter regulations,” said Shuhei Fujise, chief analyst at Alt Design. \nAt its lows on Tuesday, bitcoin suffered its biggest daily decline in four months. It was a far cry from its peak close to $20,000 in December, when the virtual currency had risen nearly 2,000 percent over the year. \nBitcoin has plummeted before. Marc Singer, an adviser at Singer Xenos in Miami, noted bitcoin fell 93 percent in value over a five-month period in 2011. The last time bitcoin more than halved in value was from November 2014 to January 2015. FILE PHOTO: Broken representation of the Bitcoin virtual currency, placed on a monitor that displays stock graph and binary codes, are seen in this illustration picture, December 21, 2017. REUTERS/Dado Ruvic/Illustration/File Photo \nTuesday’s decline followed reports that South Korea’s finance minister had said banning trading in cryptocurrencies is still an option and that Seoul plans a set of measures to clamp down on the “irrational” cryptocurrency investment craze. \nSeparately, a senior Chinese central banker said authorities should ban centralized trading of virtual currencies as well as individuals and businesses that provide related services. \n“Bitcoin is deciding whether this is the moment to crash and burn,” said Steven Englander, head of strategy at New York-based Rafiki Capital. \n“My conjecture is that cryptocurrency holders are trying to decide whether to abandon bitcoin because its limitations mean it will be superseded by better products or bet that it can thrive despite them.” FILE PHOTO: Sparks glow from broken Bitcoin (virtual currency) coins in this illustration picture, December 8, 2017. REUTERS/Dado Ruvic/Illustration/File Photo WILD SWINGS \nCryptocurrencies enjoyed a bumper year in 2017 as mainstream investors entered the market and as an explosion in so-called initial coin offerings (ICOs) - digital, token-based fundraising rounds - drove demand. \nWhile many observers say the recent falls show that the bubble has burst, those backing the nascent markets say that regulation is welcomed and wild price swings to be expected. \n“The volatility of bitcoin - and other crypto currencies - is an expected, and important, part of the journey to becoming a mature asset class. We expect the volatility to continue throughout 2018 but fundamentally believe that bitcoin is still in a bull market,” said Christopher Keshian, co-founder of $APEX Token Fund. Related Coverage Bitcoin slumps to $10,000 after losing half its value \nEthereum, the second largest cryptocurrency by market value, was down 27 percent since Tuesday, according to website CoinMarketCap. \nRipple, the third biggest, has lost 32 percent of its value over the past 24 hours and was quoted at $0.94, down from a high of $3.81 on Jan. 4. \nBitcoin futures maturing on Wednesday on the CBOE Global Markets Inc’s CBOE Futures Exchange were at $9,580, with 3,996 contracts traded, after having opened at $10,850. \n“The run-up in bitcoin created a mystique of one-way trading which is being shaken, but the pricing requires faith that there will always be demand,” Englander wrote. \n“This is far from guaranteed given the existence of alternatives with better characteristics.” Reporting by Tommy Wilkes in London and Hideyuki Sano in Tokyo, Writing by Vidya Ranganathan and Tommy Wilkes; editing by Mark Heinrich and Nick Zieminski", "external_links": [], "published": "2018-01-17T13:47:00.000+02:00", "crawled": "2018-01-17T14:15:45.013+02:00", "highlightTitle": ""}