{"organizations": [], "uuid": "8c3dec2a3854be9b918881c6871dffabc8cc9d81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/europe-stocks/live-markets-uk-firms-under-the-cosh-once-again-idUSL8N1PE1DA", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Further euro strength could dent earnings, says Deutsche", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-19T16:45:00.000+02:00", "replies_count": 0, "uuid": "8c3dec2a3854be9b918881c6871dffabc8cc9d81"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-stocks/live-markets-uk-firms-under-the-cosh-once-again-idUSL8N1PE1DA", "ord_in_thread": 0, "title": "LIVE MARKETS-Further euro strength could dent earnings, says Deutsche", "locations": [], "entities": {"persons": [{"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "negative"}, {"name": "deutsche", "sentiment": "negative"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European shares edge higher * STOXX at 2 1/2 year peak * Carpetright, Dignity drop after profit warnings Jan 19 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net FURTHER EURO STRENGTH COULD DENT EARNINGS, SAYS DEUTSCHE (0943 GMT) With the euro rising again to a new 18-month high against the dollar, Deutsche Bank's forex strategists up their forecasts for the currency - which they say doesn't bode well for European earnings and could worsen the region's underperformance relative to the US. They've raised their year-end prediction for the trade-weighted index by 4 percent, implying 7 percent upside from current levels. Every 10 percent rise in the euro TWI reduces STOXX 600 EPS growth by 5 percentage points, they reckon. This could bring them closer to increasing their relative underweight Europe vs US equities, which we mentioned earlier this week. They see European EPS growing 2 percent this year, already significantly under the 9 percent consensus estimate. (Helen Reid) UK FIRMS UNDER THE COSH ONCE AGAIN (0836 GMT) It's a familiar story with Carpetright and Dignity - big falls after profit warnings, which has been the case this year with UK firms such as Mothercare, Countrywide and Debenhams. Inflationary pressures on consumers seem to be to blame, with Dignity caught in a price battle and forced to cut funeral prices, while Carpetright's sales in the post-Christmas period missed expectations. \"Again it's the same old story as with other brands that have failed to adapt to changing consumer trends – lower footfall has left transaction numbers down significantly from last year,\" Neil Wilson, senior market analyst at ETX Capital, said in relation to Carpetright. \"We must also consider weaker consumer sentiment for big ticket items as a factor, as well tougher competition from a more diverse marketplace.\" Dignity is also in the top 20 most-shorted stocks in the UK, according to regulatory data. As you can see from the chart below, shares in both stocks have struggled over the past two years. (Kit Rees) OPENING SNAPSHOT: EUROPEAN SHARES NUDGE HIGHER, PROFIT WARNINGS DOMINATE UK STOCKS (0812 GMT) It's not a particularly strong open in Europe as gains for basic resources and defensive stocks only just outweigh losses among financials and energy. Likewise moves among individual stocks are limited to a range of between +3 to -3 percent on the STOXX, but elsewhere UK firms Dignity and Carpetright have just opened and slumped 41 percent and 48 percent respectively. Here's your opening snapshot: (Kit Rees) WHAT YOU NEED TO KNOW (0750 GMT) European shares are expected to open little changed at the end of a directionless week that has seen the top pan-regional STOXX 600 benchmark steady around a 2 ½ year peak as confidence over economic and earnings growth helped consolidate a strong start of the year. In spite of the flat weekly performance EPFR Global said it was a good week for European equity funds with inflows into Sweden and the UK more than offsetting outflows from France and Italy. Futures were last up 0.1 percent. On the corporate front earnings are in focus. In the UK shares in Carpetright and Dignity could be heavily hit after both groups issued a profit warning, while French spirits group Remy Cointreau are seen rising after like-for-like sales growth slowed to 3.2 percent but topped expectations. For other possible stock movers see the post below on overnight headlines. (Danilo Masoni) **** OVERNIGHT HEADLINES (0744 GMT) Nestle nominates three board directors to help advance strategy Deutsche Bank CEO says overhaul will take time UK's Carpetright warns on profit after post-Christmas sales fall Software AG takes hit on U.S. tax reform Peugeot CEO: UK plants uncompetitive,open to S.America alliance British Land names Simon Carter as next CFO BASF says 2017 adjusted EBIT up 32 percent on basic chemicals UK's esure CEO steps down, finance chief at helm in interim Thyssenkrupp CEO says will sharpen strategy - Handelsblatt Daimler, Bosch hit by walkouts in sector-wide labour dispute Airbus says supplier bottlenecks easing as deliveries rise HSBC to pay $100 mln to settle U.S. probe into currency rigging TF1 announces deal to buy Aufeminin From Springer Late timing of Chinese New Year weighs on Remy Cointreau Q3 At AstraZeneca, fewer drug projects bring big productivity jump Italy's Geox to name top Gucci executive as new CEO (Tom Pfeiffer) EUROPE'S STOCK FUTURES FLAT (0710 GMT) Futures have opened with marginal gains in Europe, reversing earlier indications from spreadbetters for a dip. Both however suggest the market is lacking of clear direction and could move sideways through the session. (Danilo Masoni) \"IT WAS A GOOD WEEK FOR EUROPE EQUITY FUNDS\" (0640 GMT) That's what Cameron Brandt, Research Director at EPFR Global, said in his latest weekly update on fund flows. The positive week came despite the broader European market was little changed in percentage terms with the STOXX 600 up less than 0.1 percent so far this week. At the country level there were divergences: \"flows into Sweden and UK Equity Funds hit 12 and 39-week highs while France Equity Funds saw their three-week inflow streak snapped and Italy Equity Funds experienced net redemptions for the 11th time in the past 12 weeks,\" he added. On sectors globally, cyclicals dominated. Financials, Industrials and Technology Sector Funds all took in over $600 million during the week ending Jan. 17 while Real Estate Sector Funds recorded their biggest outflow since late October, he said. (Danilo Masoni)", "external_links": [], "published": "2018-01-19T16:45:00.000+02:00", "crawled": "2018-01-19T14:24:16.080+02:00", "highlightTitle": ""}