{"organizations": [], "uuid": "a3a38cfc878bc12ec5e5f5c17cc57a00ba9db2fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/japan-stocks-close/nikkei-ends-at-26-year-high-as-oil-securities-shares-shine-idUSL4N1OZ28C", "country": "US", "domain_rank": 408, "title": "Nikkei ends at 26-year high as oil, securities shares shine", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T08:35:00.000+02:00", "replies_count": 0, "uuid": "a3a38cfc878bc12ec5e5f5c17cc57a00ba9db2fb"}, "author": "", "url": "https://www.reuters.com/article/japan-stocks-close/nikkei-ends-at-26-year-high-as-oil-securities-shares-shine-idUSL4N1OZ28C", "ord_in_thread": 0, "title": "Nikkei ends at 26-year high as oil, securities shares shine", "locations": [], "entities": {"persons": [{"name": "yutaka miura", "sentiment": "none"}, {"name": "topix", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mizuho securities", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 6:38 AM / in 34 minutes Nikkei ends at 26-year high as oil, securities shares shine Reuters Staff 3 Min Read \nTOKYO, Jan 4 (Reuters) - Japanese stocks rallied on the first trading day of 2018, with the Nikkei and Topix pushing to multi-decade highs as brokerage and oil shares surged. \nCatching up to overseas gains after the long Japanese New Year’s holiday, the Nikkei share average finished up 3.26 percent at its session high of 23,506.33, its highest level since January 1992. \nThursday’s gain was the Nikkei’s biggest for one day since Nov. 10, 2016. \n“The market was mostly domestically-driven in the morning, with foreign buyers emerging in the afternoon,” said Yutaka Miura, a senior technical analyst at Mizuho Securities, who added that further gains were possible as the Nikkei topped a resistance point at 23,500. \nThe broader Topix added 2.55 percent to end at a session high of 1,863.82, its best level since November 1991. \nAdvancers outnumbered decliners 492 to 143, with 40 issues ending unchanged. \nIn 2017, the Nikkei gained 19.1 percent and the Topix rose 19.7 percent, as the stronger global economy as well as domestic political stability and the Bank of Japan’s ultra-easy monetary policy underpinned Japanese corporate earnings. \nOn Thursday, gains in many sectors helped power brokerage shares, with the securities subindex surging 4.86 percent. Nomura Holdings added 3.16 percent and Daiwa Securities Group was up 3.82 percent. \nBuoyant crude prices boosted the oil & coal subindex by 3.73 percent. JXTG Holdings added 3.99 percent and Cosmo Energy Holdings was 7.29 percent higher. \nCrude oil futures rose about 2 percent on Wednesday to their highest in 2-1/2 years, lifted by unrest in OPEC member Iran and strong U.S. and German economic data \nSemiconductor-related shares also outperformed, in line with their U.S. counterparts and PHLX Semiconductor Sector gains. Tokyo Electron shares rose 6.18 percent, and Screen Holdings shares were up 6.51 percent. \nNintendo shares climbed 4.90 percent. The Financial Times reported on Monday that game developer Niantic Inc plans to launch its blockbuster Pokemon Go augmented reality game, in which Nintendo has a stake, in China through a partnership deal with local company NetEase. \nMitsubishi Heavy Industries shares were 2.57 percent higher, after the head of the company’s aircraft unit said it was on track to deliver its repeatedly delayed commercial jet by mid-2020 despite risk of an order cancellation. (Reporting by Lisa Twaronite; Editing by Richard Borsuk)", "external_links": [], "published": "2018-01-04T08:35:00.000+02:00", "crawled": "2018-01-04T08:53:11.002+02:00", "highlightTitle": ""}