{"organizations": [], "uuid": "2a07f4564739c3694183d936af6926e97076d2d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 21}, "facebook": {"likes": 232, "shares": 232, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220368302&w=1200&r=LYNXMPEE071H1", "site_section": "http://feeds.feedburner.com/reuters/euzPJ", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-northkorea-southkorea-talks/north-south-korea-to-hold-talks-as-winter-olympics-helps-break-ice-idUSKBN1EX2CW", "country": "US", "domain_rank": 408, "title": "North, South Korea to hold talks as Winter Olympics helps break ice", "performance_score": 2, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:05:00.000+02:00", "replies_count": 0, "uuid": "2a07f4564739c3694183d936af6926e97076d2d6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-northkorea-southkorea-talks/north-south-korea-to-hold-talks-as-winter-olympics-helps-break-ice-idUSKBN1EX2CW", "ord_in_thread": 0, "title": "North, South Korea to hold talks as Winter Olympics helps break ice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL/WASHINGTON (Reuters) - North and South Korea held their first talks in more than two years on Tuesday and Washington hailed them as a good first step in solving the crisis over the North’s nuclear missile program, even though Pyongyang said it would not discuss weapons that were only aimed at the United States.\nThe U.S. State Department said Washington would be interested in joining future talks, but stuck to its insistence they must be aimed at denuclearization, something North Korea rejects, showing that a diplomatic breakthrough remains far off.\nIn a joint statement after 11 hours of talks with South Korea, North Korea pledged to send a large delegation to next month’s Winter Olympics in South Korea, but made a “strong complaint” after Seoul proposed talks to denuclearize the Korean peninsula.\n“Clearly this is a positive development,” Steve Goldstein, a spokesman for the U.S. State Department told a news briefing, while adding: “We would like nuclear talks to occur; we want denuclearization of the Korean peninsula. This is a good first step in that process.”\nNorth and South Korea said they agreed to meet again to resolve problems and avert accidental conflict, amid high tension over North Korea’s program to develop nuclear missiles capable of hitting the United States, but Pyongyang said disarmament would not be part of the discussions.\n“All our weapons, including atomic bombs, hydrogen bombs and ballistic missiles, are only aimed at the United States, not our brethren, nor China and Russia,” Pyongyang’s chief negotiator, Ri Son Gwon, said.\n“This is not a matter between North and South Korea, and to bring up this issue would cause negative consequences and risks turning all of today’s good achievement into nothing,” Ri, chairman of the North’s Committee for the Peaceful Reunification of the Fatherland, warned in closing remarks.\nU.S. President Donald Trump and North Korean leader Kim Jong Un have exchanged threats and insults in the past year, raising fears of a new war on the peninsula.\nThe White House did not immediately comment on the United States being the only potential target of North Korea’s nuclear weapons.\nThe United States, which has 28,500 troops stationed in South Korea as a legacy of the 1950-1953 Korean War, initially responded coolly to the idea of inter-Korean meetings, but Trump later called them “a good thing” and said he would be willing to speak to Kim.\n“At the appropriate time, we’ll get involved,” Trump said on Saturday, although U.S.-North Korean talks appear unlikely, given entrenched positions on both sides.\nThe United States - which has warned that all options, including military ones, are on the table in dealing with North Korea - insists that any future talks must have the aim of denuclearization, and the North-South thaw has not altered the U.S. intelligence assessment of North Korea’s weapons programs.\nThe consensus, according to five U.S. officials familiar with the classified analysis, is that Kim remains convinced the United States is determined to overthrow him and that only a nuclear arsenal that threatens America can deter that.\nOne of the officials said the North-South talks were likely to follow the pattern of past diplomatic efforts, in which the North has benefited from additional food and other aid without making any concessions on the weapons front.\nThe additional danger now, said a second official, was that Kim would seek to use the talks to take advantage of Trump’s sometimes bellicose rhetoric to try to drive a wedge between Washington and Seoul.\nOn Tuesday, U.N. Secretary-General Antonio Guterres welcomed the progress made in the talks, particularly the agreement to hold military-to-military talks, calling this “critical to lowering the risk of miscalculation.”\nHe also welcomed North Korea’s decision to send a delegation to the Olympics and said he hoped for the resumption of dialogue leading to denuclearization of the Korean Peninsula.\nIn spite of the North Korean negotiator’s remarks, South Korea’s Unification Ministry said it believed Tuesday’s talks could lead to discussion of a “fundamental resolution” of the nuclear issue.\n“We will closely coordinate with the United States, China, Japan and other neighbors in this process,” it said, adding that Seoul had asked North Korea to halt acts that stoke tension.\nSouth and North Korean delegations attend their meeting at the truce village of Panmunjom in the demilitarised zone separating the two Koreas, South Korea, January 9, 2018. Yonhap via REUTERS Tuesday’s meeting followed a year of ramped-up North Korean missile launches and its sixth and most powerful nuclear test, which have prompted a stepped-up U.S.-led campaign to toughen U.N. sanctions, which Pyongyang has called an act of war.\nNorth Korea-South Korea talks: tmsnrt.rs/2Ar8lUu\nNorth Korea revealed: reut.rs/2z4KDPt\n“HIGH HOPES”\nEarlier on Tuesday, Seoul said it was prepared to lift some unilateral sanctions temporarily so North Koreans could visit for the Winter Olympics. North Korea said its delegation would include athletes, high-ranking officials, a cheering squad, art performers, reporters and spectators.\nSlideshow (16 Images) Talks to work out details would be held soon, the South’s unification ministry said.\nThe talks were the first between the two Koreas since 2015 and were held at the Peace House on the South Korean side of Panmunjom truce village.\n“We came to this meeting with the thought of giving our brethren, who have high hopes for this dialogue, invaluable results as the first present of the year,” Ri said at the start of the meeting.\nSeoul said it proposed reunions of divided families in time for February’s Lunar New Year holiday, but the joint statement made no mention of any agreement on this.\nSeoul said North Korea had finished technical work to restore a military hotline, with normal communications set to resume on Wednesday.\nNorth Korea cut communications in February 2016, following South Korea’s decision to shut down a jointly run industrial park.\nSeoul also said North Korea responded “positively” to the South’s proposal for athletes from both sides to march together in the Olympic opening ceremony.\nSuch a joint parade has not happened since the 2007 Asian Winter Games in China.\nChina’s Foreign Ministry said it was happy to see talks between North and South Korea and welcomed all positive steps. Russia echoed the sentiment, with a Kremlin spokesman saying: “This is exactly the kind of dialogue that we said was necessary.”\nSome U.S.-based analysts have hailed the talks as an opening for diplomacy, but others see an attempt by North Korea to weaken U.S. pressure so that it is eventually accepted as a nuclear-armed state.\nEvans Revere, a former senior U.S. diplomat for East Asia, said that by engaging Seoul, North Korea was clearly seeking to weaken the U.S.-South Korean alliance and it was important that Seoul had raised the nuclear issue to show it was not just a U.S.-North Korea matter.\nInternational Olympic Committe", "external_links": [], "published": "2018-01-09T05:05:00.000+02:00", "crawled": "2018-01-09T09:40:03.774+02:00", "highlightTitle": ""}