{"organizations": [], "uuid": "83e870e6c9204e1b26d0846691e5898398a21d0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/italy-banks-nouy/rpt-ecbs-nouy-inflexible-in-meeting-with-italian-banks-sources-idUSL8N1PD1Q3", "country": "US", "domain_rank": 408, "title": "RPT-ECB's Nouy 'inflexible' in meeting with Italian banks - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:40:00.000+02:00", "replies_count": 0, "uuid": "83e870e6c9204e1b26d0846691e5898398a21d0c"}, "author": "", "url": "https://www.reuters.com/article/italy-banks-nouy/rpt-ecbs-nouy-inflexible-in-meeting-with-italian-banks-sources-idUSL8N1PD1Q3", "ord_in_thread": 0, "title": "RPT-ECB's Nouy 'inflexible' in meeting with Italian banks - sources", "locations": [], "entities": {"persons": [{"name": "nouy", "sentiment": "negative"}, {"name": "daniele nouy", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "rpt-ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bank of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:40 AM / Updated 27 minutes ago RPT-ECB's Nouy 'inflexible' in meeting with Italian banks - sources Reuters Staff 3 Min Read \n(Repeats Wednesday’s story with no changes to text) \nMILAN, Jan 17 (Reuters) - The European Central Bank’s Chief Supervisor Daniele Nouy was “inflexible” at a meeting with Italian lenders on Wednesday where topics such as bad loans were discussed, two sources with knowledge of the matter said. \nItalian banks piled up soured loans in a deep recession and are struggling to get rid of them as a clogged judicial system hampers recoveries and sales can only be carried out at a loss. \nThe Bank of Italy spoke of a “very constructive and useful exchange of views” in a statement issued after the meetings that Nouy held with domestic supervisors, top executives from Italy’s bigger banks and the national banking association. \nNew rules the ECB proposed late last year on new loans turning sour and the supervisory approach to banks’ handling of existing bad debts were discussed, the Bank of Italy said. \nOne of the sources said Nouy did not indicate when the new rules - whose introduction has been delayed due to a backlash led by Italy - would become effective. \nShe also refrained from providing targets for reducing bad loans. But the sources said she reiterated the ECB’s position in a way that left banks with very little room for manoeuvre. \nIt was not possible to reach the ECB for comment. \nAt around 16 percent of total lending, Italy’s impaired loan burden is around three times the European average of 5.5 percent. \nBankers have said the ECB wants larger lenders to cut soured loans below 10 percent of total lending. Despite the delay in introducing the new rules, the regulator has kept the pressure on individual lenders, they say. \nIntesa Sanpaolo, a top Italian bank, last week announced a shift in strategy over bad debts, in a move that sources have said was driven by the ECB’s proposed new rules and the regulator’s stance. \nAfter betting in recent years on recovering bad loans internally to avoid costly large-scale sales, Intesa said it was now considering selling a chunk of its bad loans and spinning off part of its debt collection business. \nCEO Carlo Messina said on Wednesday the bank agreed with the need to speed up the reduction of bad debts. \nOther banks are also considering selling their debt collection units together with some of their bad debts, industry and financial sources have said. \nAnalysts expect lenders to book more writedowns of bad debts, taking advantage of the introduction in January of a new accounting rule which temporarily allows them to avoid booking the loss - though it would still have an impact on capital. (Reporting by Andrea Mandala, Stefano Bernabei and Valentina Za; Editing by Mark Potter)", "external_links": [], "published": "2018-01-18T10:40:00.000+02:00", "crawled": "2018-01-18T11:11:15.001+02:00", "highlightTitle": ""}