{"organizations": [], "uuid": "fc9be47fd59a31858c4ded22adfd58ca94aa2292", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-babson-college-names-gustavo-trindade-director-of-miami-campus.html", "country": "US", "domain_rank": 767, "title": "Babson College Names Gustavo Trindade Director Of Miami Campus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-17T21:06:00.000+02:00", "replies_count": 0, "uuid": "fc9be47fd59a31858c4ded22adfd58ca94aa2292"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-babson-college-names-gustavo-trindade-director-of-miami-campus.html", "ord_in_thread": 0, "title": "Babson College Names Gustavo Trindade Director Of Miami Campus", "locations": [], "entities": {"persons": [{"name": "gustavo trindade", "sentiment": "negative"}, {"name": "gustavo trin", "sentiment": "negative"}, {"name": "trindade", "sentiment": "none"}, {"name": "gustavo", "sentiment": "none"}, {"name": "babson", "sentiment": "none"}, {"name": "kerry healey", "sentiment": "none"}], "locations": [{"name": "miami campus wellesley", "sentiment": "none"}, {"name": "mass.", "sentiment": "none"}, {"name": "babson miami", "sentiment": "none"}, {"name": "southern u.s.", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "babson college", "sentiment": "negative"}, {"name": "babson", "sentiment": "none"}, {"name": "institutional investor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WELLESLEY, Mass., Jan. 17, 2018 /PRNewswire-USNewswire/ -- Babson College has appointed Gustavo Trindade, Babson MBA Class of 2017, Director of Babson Miami --the institution's newest global hub.\nAt Babson Miami, Trindade will be focused on strategic planning for the College's presence in both the Miami area and Latin America, as well as managing the hub's daily operations, including all activities, events, programming, and more.\nGustavo Trindade has more than ten years of entrepreneurial work experience within several large, global corporations, including in the areas of marketing, business development, finance, and investor relations. In 2012, Trindade was named a 'Top Three LATAM Professional in Investor Relations' by Institutional Investor magazine.\n\"We are delighted to welcome Gustavo back to Babson and look forward to the leadership and entrepreneurial mindset he will bring to Babson Miami,\" said Babson College President Kerry Healey . \"Miami is a thriving entrepreneurial ecosystem and a gateway to our vibrant network of 5,000 Babson alumni in the Southern U.S. and Latin America. Our expanded presence in Miami is an important step toward our goal of making entrepreneurship education accessible to everyone, everywhere, and Gustavo's leadership and experience will be invaluable as we prepare to welcome our inaugural class of Miami graduate students this fall.\"\nTrindade graduated with an MBA from Babson's F.W. Olin Graduate School of Business in 2017. He also holds a Master of Science in Economics from Ibmec Business School (Brazil). While at Babson, Trindade served as a graduate assistant to Professor Robert Turner in the Accounting Division. He is proudly multi-lingual in English, Spanish, Portuguese, and French, and resides in Miami.\n\"I take great pride and responsibility in having been entrusted with running Babson's hub in Miami, and am thrilled to bring the No. 1 school for entrepreneurship to the No. 1 city for startup activity. Our innovative programs will not only tap into the growth needs of local entrepreneurs and corporations, but also help further develop the Florida ecosystem,\" said Trindade. \"As an alumnus, it is fulfilling to be a part of such a big institutional endeavor, and to be able to engage with our 5,000 fellow alumni spread throughout the Southern U.S. and Latin America.\"\nBabson in Miami\nBabson College has expanded to Miami with three graduate programs--including the Blended Learning MBA, ranked No. 1 for alumni earnings and top 10 worldwide by Financial Times (FT) and The Princeton Review .\nThe application period is open and classes are set to begin in Fall 2018. Learn more and apply »\nAccepted Babson Miami graduate students referred by alumni can receive up to $20,000 in scholarships. Learn more »\nBabson's Women Innovating Now (WIN) Lab (r) has had local roots since 2016, with the support of The John S. and James L. Knight Foundation, FedEx, and Akerman LLP. The program's first cohort of women entrepreneurs raised nearly $2 million in funding and the second cohort is on its way to celebrating its finale this Spring.\nBabson College is also the academic architect of the Goldman Sachs 10,000 Small Businesses program , hosted at Miami-Dade College since 2014, empowering participating local small business owners to help their businesses grow.\nMiami also is a hub for a vibrant network of 5,000 Babson alumni who live and work in the region, Southern U.S. and Latin America. The region boasts the fourth-largest concentration of Babson graduates, many of whom are involved in family enterprises and entrepreneurial ventures in the Miami area. Some of Babson's most notable Miami-area alumni include: Alberto Perlman '98, co-founder and CEO of Zumba Fitness, LLC; Murilo Amaral MBA'16 and Alfredo Keri MBA'16, founders of Cargo42 ; Carla Curiel '05, founder and CEO of Mundo Lanugo; the Zamora family , who run the financial institution LAFISE; and Diego Lowenstein '90 P'21, CEO and the third generation to work at Lionstone Development, founded and headquartered in Miami.\nAbout Babson College\nBabson College is the educator, convener, and thought leader for Entrepreneurship of All Kinds (r) . The top-ranked college for entrepreneurship education, Babson is a dynamic living and learning laboratory where students, faculty, and staff work together to address the real-world problems of business and society. We prepare the entrepreneurial leaders our world needs most: those with strong functional knowledge and the skills and vision to navigate change, accommodate ambiguity, surmount complexity, and motivate teams in a common purpose to make a difference in the world, and have an impact on organizations of all sizes and types. As we have for nearly a half-century, Babson continues to advance Entrepreneurial Thought & Action (r) as the most positive force on the planet for generating sustainable economic and social value.\nMedia Contact: Michael Chmura\nPublic Relations Director\nmchmura@babson.edu\nPhone: 781-239-4549\nThis news release was issued on behalf of Newswise(TM). For more information, visit http://www.newswise.com .\nView original content: http://www.prnewswire.com/news-releases/babson-college-names-gustavo-trindade-director-of-miami-campus-300583978.html\nSOURCE Babson College", "external_links": ["http://www.babson.edu/news-events/babson-news/Pages/2017-financial-times-blended-learning-mba-ranking.aspx", "http://www.babson.edu/news-events/babson-news/Pages/2017-babson-offers-inaugural-miami-class-scholarships.aspx", "http://www.prnewswire.com/news-releases/babson-college-names-gustavo-trindade-director-of-miami-campus-300583978.html", "http://www.babson.edu/news-events/babson-news/Pages/princeton-review-entrepreneur-magazine-top-online-mba-program.aspx", "http://blogs.babson.edu/news/2017/11/02/babson-alumni-business-cargo42-receives-key-to-miami-dade-county/", "http://magazine.babson.edu/2017/05/01/from-generation-to-generation/", "http://www.babson.edu/admission/visiting-babson/miami/Pages/default.aspx", "http://www.babson.edu/Academics/centers/cwel/educational-programs/win-lab/Pages/win-lab-miami.aspx", "http://magazine.babson.edu/2016/05/04/dont-be-defined-define-yourself/", "http://www.mdc.edu/10ksb/about.aspx", "http://www.babson.edu/about-babson/at-a-glance/pages/entrepreneurial-thought-and-action.aspx", "http://www.babson.edu/news-events/babson-news/Pages/2017-20-women-entrepreneurs-join-win-lab-miami.aspx", "http://action.babson.edu/#perlman", "http://www.babson.edu/about-babson/at-a-glance/Pages/rankings.aspx", "http://www.babson.edu/about-babson/president/Pages/biography.aspx", "http://action.babson.edu/#zamora", "http://www.newswise.com/", "http://www.babson.edu/about-babson/at-a-glance/pages/entrepreneurship-of-all-kinds.aspx"], "published": "2018-01-17T21:06:00.000+02:00", "crawled": "2018-01-17T21:10:19.036+02:00", "highlightTitle": ""}