{"organizations": [], "uuid": "12b0ca91db57b88031b7225cef498991d731b09a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923924-GettyImages-899729338.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/europe-markets-ftse-cac-dax-seen-higher-iran-protests.html", "country": "US", "domain_rank": 767, "title": "Europe markets: FTSE, CAC, DAX seen higher, Iran protests", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.221, "site_type": "news", "published": "2018-01-04T08:50:00.000+02:00", "replies_count": 0, "uuid": "12b0ca91db57b88031b7225cef498991d731b09a"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/04/europe-markets-ftse-cac-dax-seen-higher-iran-protests.html", "ord_in_thread": 0, "title": "Europe markets: FTSE, CAC, DAX seen higher, Iran protests", "locations": [], "entities": {"persons": [], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "European markets closed higher Thursday, as services PMI data showed the euro zone was hovering close to its best growth in seven years and oil prices hovered around 2.5 year highs amid unrest in Iran .\nThe pan-European Stoxx 600 closed provisionally 0.9 percent higher, with all sectors and most major bourses in positive territory.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- Automotive stocks led the gains on better-than-expected U.S. car sales data , and the sector was up 1.9 percent. Fiat Chrysler was the sector's top performer, up 8 percent.\nAs European indexes rallied, Britain's FTSE 100 hit a record high of 7,701.93 at about 3 p.m. London time.\nLooking at individual stocks, Steinhoff extended its recovery from the start of the new year as shares skyrocketed more than 21 percent on Thursday. The embattled South African retailer had seen shares tank in December after its CEO quit amid a probe into accounting errors.\nMeanwhile, Remy Cointreau slumped to the bottom of the benchmark, after Investec cut its stock recommendation to \"sell\" from \"hold\". Shares of the French spirits group slipped 3.6 percent on the news.\nOn the data front, services PMI data showed the euro area was hovering close to its best growth in seven years, while Spain and Italy both beat the previous flash estimates.\nOn Wall Street, the Dow Jones industrial average broke above 25,000 for the first time following the release of stronger-than-expected jobs data.\nIran unrest U.S. factory activity was stronger-than-anticipated in December, according to data released Wednesday, and Germany's unemployment rate was reported to have hit a record low in December.\nIn commodities, oil prices flirted with two-and-a-half year highs amid ongoing anti-government protests in Iran. The clashes, which began last week, have rattled Tehran's clerical leadership and left 21 people dead. Brent crude traded at around $67.87 a barrel on Thursday, up 0.02 percent, while U.S. crude was seen at $61.94, up 34 percent.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-04T08:50:00.000+02:00", "crawled": "2018-01-04T08:57:59.000+02:00", "highlightTitle": ""}