{"organizations": [], "uuid": "039971503ae397a6cca887fed2cdc09858416104", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104947733-GettyImages-590584798.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/cost-of-divorce-uk-company-offers-online-separation-service.html", "country": "US", "domain_rank": 767, "title": "Cost of divorce: UK company offers online separation service", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.341, "site_type": "news", "published": "2018-01-16T14:56:00.000+02:00", "replies_count": 0, "uuid": "039971503ae397a6cca887fed2cdc09858416104"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/16/cost-of-divorce-uk-company-offers-online-separation-service.html", "ord_in_thread": 0, "title": "Cost of divorce: UK company offers online separation service", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "money advice service", "sentiment": "none"}, {"name": "co-operative group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Couples often plan to separate ahead of the holiday season but don't discuss it until January to avoid upsetting family members, according to a U.K. grocery and services group.\nNow they won't even have to leave home to get a settlement, thanks to a new online service.\nBritish company the Co-operative Group — known as the Co-op — is aiming to make it easy for couples to split up, by offering customers a \"digital divorce\" service that can be completed in as little as four months.\nIt means a couple can formally separate without having to leave home and avoid costly legal fees potentially involved when visiting a lawyer's office.\nThe starting price for a Co-op digital divorce is £600 ($825), with court fees of £550. If a couple goes to a solicitor, they would usually pay between £2,000 and £3,000 in fees, up to around £30,000 for contested cases that end up in court, according to the U.K.'s Money Advice Service.\nIn the U.S., the average cost of a divorce is around $20,000, according to the Divorce Statistics website.\nshow chapters When it comes to divorce, not all assets are equal 3:14 PM ET Fri, 22 Sept 2017 | 00:39 Sixty-two percent of the Co-op's divorce enquiries come through its website and the company said the first three months of the year are its busiest.\n\"Couples have often already considered divorcing for a number of months, but they then hold off announcing their plans until after the festive period, mainly to avoid upset among family members,\" Tracey Moloney, head of family law at Co-op Legal Services, said in an online statement. \"We receive the highest number of enquiries in March after couples have discussed their plans in January.\"\nSometimes divorce queries come through in the early hours of the morning, Moloney added.\nThe Co-op's website shows how someone can \"Get divorced in five steps.\" After filling out a form online, a solicitor will call the customer, before divorce papers are signed. These are then sent to court, and the spouse of the person who filed for divorce will be contacted. Once they agree, the divorce is completed.\nThis type of separation isn't for everyone, however. It will only work for those who remain amicable, or have agreed mutually to separate.\nThe Co-operative Group, which is made up of grocery chain Co-op Food, as well as a funeral service, insurance and legal arms, has 3,750 outlets in the U.K. The legal business made £22 million in revenue in 2016, according to its latest filing.", "external_links": [], "published": "2018-01-16T14:56:00.000+02:00", "crawled": "2018-01-16T15:11:50.000+02:00", "highlightTitle": ""}