{"organizations": [], "uuid": "330bd07672125aabb4fd648995d95b5117efbcfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-san-juan-basin-royalty-trust-declares-january-cash-distribution.html", "country": "US", "domain_rank": 767, "title": "San Juan Basin Royalty Trust Declares January Cash Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "330bd07672125aabb4fd648995d95b5117efbcfd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-san-juan-basin-royalty-trust-declares-january-cash-distribution.html", "ord_in_thread": 0, "title": "San Juan Basin Royalty Trust Declares January Cash Distribution", "locations": [], "entities": {"persons": [{"name": "hilcorp", "sentiment": "none"}], "locations": [{"name": "san juan basin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}], "organizations": [{"name": "san juan basin royalty trust", "sentiment": "negative"}, {"name": "compass bank", "sentiment": "negative"}, {"name": "burlington resources oil & gas company lp", "sentiment": "none"}, {"name": "hilcorp san juan l.p.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WORTH, Texas--(BUSINESS WIRE)-- Compass Bank, as Trustee of the San Juan Basin Royalty Trust (the “Trust”) (NYSE:SJT), today declared a monthly cash distribution to the holders of its units of beneficial interest of $3,115,522.27 or $0.066844 per unit, based principally upon estimated production during the month of November 2017. The distribution is payable February 14, 2018, to unit holders of record as of January 31, 2018.\nThe sale of San Juan Basin assets, including the oil and gas interests from which the Trust’s royalty interest was carved (“Subject Interests”), from Burlington Resources Oil & Gas Company LP (“Burlington”) to Hilcorp San Juan L.P. (“Hilcorp”) closed on July 31, 2017. Due to the transition from Burlington, Hilcorp informed the Trust that Hilcorp does not yet have all of the revenue decks for November 2017 installed, and therefore does not have the appropriate detail to provide actual revenue numbers for the January 2018 distribution.\nTherefore, Hilcorp estimated the January 2018 distribution based on the revenue distribution detail for the July 2017 production month (September distribution month) previously provided by Burlington and rounded to the nearest thousand. The January 2018 declaration of cash distribution includes an additional $1.0 million in estimated gross revenue based on Hilcorp’s knowledge that production volumes in November 2017 were in line with production volumes during the previous month. The January 2018 declaration of cash distribution includes actual expenses for the month of November, however, severance taxes continue to be estimated.\nHilcorp has also informed the Trust that Hilcorp may need to use estimated revenue and severance tax numbers to calculate distributions for subsequent months. Once Hilcorp has all of the revenue decks finalized, Hilcorp will reconcile the actual revenue numbers versus the estimated numbers and true-up any distributions, as needed.\nEstimated gas production for the Subject Interests totaled 2,155,000 Mcf (2,394,444 MMBtu) for November 2017. Dividing revenues by production volume yielded an average estimated gas price for November 2017 of $2.60 per Mcf ($2.34 per MMBtu) which was identical to August, September and October 2017.\nThe average monthly gas price Hilcorp reports to the Trust is a calculated price. It is determined by dividing gross monthly revenue by production volume, and therefore, it does not represent an average of actual sales prices. The average gas price may vary from the posted index price for the San Juan Basin. The index price is a gross sales price, and the revenues used in the calculation of average gas prices are net of transportation, processing and gathering costs. Furthermore, the distribution to the Trust in any given month may include significant volume adjustments for sales in prior months that reflect pricing for those prior months.\nFor the month ended November 2017, capital costs were $66,207, lease operating expenses were $1,783,260 and property taxes were $26. Estimated severance taxes were $594,800.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005086/en/\nSan Juan Basin Royalty Trust\nCompass Bank, Trustee\nJoshua R. Peterson, Vice President & Senior Trust Officer\nKaye Wilke, Investor Relations, toll-free: 866-809-4553\nwww.sjbrt.com\nsjt.us@bbva.com\nSource: San Juan Basin Royalty Trust", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sjbrt.com&esheet=51745632&lan=en-US&anchor=www.sjbrt.com&index=1&md5=7f2a13643a2710ebc3fe62e21e2296a6", "http://www.businesswire.com/news/home/20180119005086/en/"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:01:32.010+02:00", "highlightTitle": ""}