{"organizations": [], "uuid": "d6affe7ce3a8e3aff8d3168f01b9563bd27cf32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA761_cmo_ca_SOC_20180117114107.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/mattress-firm-casper-tucks-in-new-execs-to-expand-its-sleep-empire-1516210217", "country": "US", "domain_rank": 387, "title": "Mattress Company Casper Tucks In New Execs To Expand Its Sleep Empire", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:30:00.000+02:00", "replies_count": 0, "uuid": "d6affe7ce3a8e3aff8d3168f01b9563bd27cf32d"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/mattress-firm-casper-tucks-in-new-execs-to-expand-its-sleep-empire-1516210217", "ord_in_thread": 0, "title": "Mattress Company Casper Tucks In New Execs To Expand Its Sleep Empire", "locations": [], "entities": {"persons": [{"name": "brooks", "sentiment": "none"}, {"name": "michael behrens", "sentiment": "none"}, {"name": "greg macfarlane", "sentiment": "none"}, {"name": "casper", "sentiment": "none"}, {"name": "philip krim", "sentiment": "none"}, {"name": "jeff brooks", "sentiment": "none"}], "locations": [], "organizations": [{"name": "casper inc.", "sentiment": "negative"}, {"name": "h&r block inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Online mattress retailer Casper Inc. is looking to extend beyond the bed-in-a-box category it helped create and put its brand behind new products and technology that can influence sleep at various points of the day.\nTo help lead the push, the company is bolstering its executive team. \nJeff Brooks will take over as Casper’s new chief marketing officer. Mr. Brooks was most-recently global president and chief marketing officer at digital advertising firm Huge, which was appointed as Casper’s lead creative agency last year. He replaces Michael Behrens, who left in December to spend more time with his family, according to the company.\nCasper is also hiring its first chief financial officer, Greg Macfarlane, who joins from H&R Block Inc.\nCasper is one of the best-known and well-funded entrants in the direct-to-consumer mattress space. Launched in 2014, Casper has expanded its product lineup to pillows, sheets, mattress protectors and a dog bed. \nCasper Chief Executive Philip Krim said in an interview the company is exploring “how technology comes into the bedroom.”\nIn recent years, a number of competitors have flooded into the mattress retail space, using a mixture of marketing tactics, such as money-back-guarantee trial periods and refer-a-friend discount codes. There is now a cottage industry of mattress-reviewing websites where influencers tout the merits of individual brands. But sometimes it’s not obvious reviewers have received a free mattress, or will receive a cut of the sales associated with their glowing reviews.\nMr. Krim says while the industry has been “plagued by an opaque sales process,” Casper continues to focus on transparency to ensure there are clear disclosures around reviews and endorsements.\nCasper also invests in traditional advertising such as TV and outdoor, and on social media and podcasts. The company recently shut down its sleep-focused digital publication, Van Winkle’s, and replaced it with a quarterly print magazine called Woolly . \nCasper has appointed Jeff Brooks as its chief marketing officer Photo: Casper Mr. Brooks doesn’t immediately envisage Casper signing up a famous spokesperson, despite the company having celebrity cachet. Its investors include rapper 50 Cent, Boston Celtics star Kyrie Irving and Leonardo DiCaprio.\n“To suggest Casper may link itself as a brand with an individual or certain individuals doesn’t feel right to me and is not something we’ve contemplated,” according to Mr. Brooks.\nCasper spent an estimated $24 million on advertising in the U.S in the first nine months of 2017, according to data from Kantar Media. That was up on the $19 million it spent in the same period the prior year.\nWhile Casper has faced increased competition over the years, Mr. Krim said customer acquisition costs have stayed flat and are “decreasing in some channels.”\nThe company generated “over $300 million” in revenue in 2017, up from around $200 million the prior year, according to Mr. Krim. He declined to comment on whether the company is profitable.\nCasper has raised $240 million in funding to date, the company said. Its most recent round was led by Target Corp., which now sells Casper products in stores and on Target.com.\nMr. Krim said there is “no update” on the company’s timing for going public, but said the hire of Mr. Macfarlane will help ensure Casper is “public company-ready” and up its game from an operational perspective.\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nDespite its growing popularity, Mr. Krim said building awareness is still the brand’s biggest barrier to growth.\n“The vast majority of people still don’t know Casper exists and still don’t know that you don’t have to go into a sleepy mattress store on every corner to go get a great night of sleep and that there really is a smarter, better alternative,” Mr. Krim said.\nLast September, Casper announced a partnership with American Airlines Inc., offering its bedding for passengers to use on some of the carrier’s routes. Mr. Krim said the company is assessing the “ton of inbound interest” from other brands looking to forge tie-ups.\nIf brands like Nike Inc. helped make exercising a “cultural paradigm” and companies like Whole Foods, now owned by Amazon, ushered in new thinking around healthy and responsible eating habits, Mr. Krim said Casper is pushing for sleep to be “the third pillar of wellness.”\nWrite to Lara O’Reilly at lara.oreilly@wsj.com", "external_links": [], "published": "2018-01-17T19:30:00.000+02:00", "crawled": "2018-01-17T20:22:41.013+02:00", "highlightTitle": ""}