{"organizations": [], "uuid": "18e4d19bc9a54924aa5824ff951d1a8671ab4aaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943609-IMG_0574.1910x1000.JPG", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/democrats-add-momentum-to-gop-push-to-loosen-banking-rules.html", "country": "US", "domain_rank": 767, "title": "Democrats add momentum to GOP push to loosen banking rules", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:24:00.000+02:00", "replies_count": 0, "uuid": "18e4d19bc9a54924aa5824ff951d1a8671ab4aaf"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/democrats-add-momentum-to-gop-push-to-loosen-banking-rules.html", "ord_in_thread": 0, "title": "Democrats add momentum to GOP push to loosen banking rules", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "gop", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The most significant attempt to loosen rules imposed in the wake of the 2008 financial crisis is underway in Congress as the Senate looks to pass legislation within the next month that would roll back restrictions on swaths of the finance industry.\nBuoyed by their success in rewriting the tax code, the Trump administration and Republican lawmakers have now set their sights on helping the financial industry, which has been engaged in a quiet but concerted push to relax many post-crisis rules and regulatory obligations, particularly for thousands of small- and medium-sized banks.\nBut unlike the $1.5 trillion tax overhaul, which passed along party lines, the effort to loosen the post-crisis rules is somewhat bipartisan. A group of Senate Democrats has joined Republicans to support legislation that would mark the first major revision of the 2010 Dodd-Frank Act, a signature accomplishment of President Barack Obama that has been deemed \"a disaster\" by President Trump. \nThe bill would allow hundreds of smaller banks to avoid certain elements of federal oversight, including stress tests, which measure a bank's ability to withstand a severe economic downturn. Under current law, banks with assets of $50 billion or more are considered \"systemically important financial institutions\" and therefore governed by stricter rules. The bill would raise that threshold to institutions with assets of $250 billion or more, leaving fewer than 10 big banks in the United States subject to the stricter oversight.\nRead more: \nBlackRock's message: Contribute to society, or risk losing our support\nWorkplace raids signal shifting tactics in immigration fight \nOil briefly reaches $70 as buoyant global economy bolsters demand \nBanks with assets of $50 billion to $100 billion would be immediately freed from those requirements. Financial institutions with $100 billion to $250 billion in assets, such as BB&T and American Express , would no longer be subject to tougher rules after 18 months, although the Federal Reserve would retain the authority to periodically conduct stress tests on those firms.\nSenator Mitch McConnell, the majority leader and Kentucky Republican, is expected to bring the bill to the Senate floor within the next month.\nHurdles remain. The House has already passed its own far more sweeping deregulatory effort. And progressive Democrats who warn that the legislation would return Wall Street to its more reckless past are mobilizing in hopes of derailing the legislation — even if that means attacking fellow Democrats who support it.\n\"This bill increases the risk of another taxpayer bailout, and I will continue to challenge supporters of this bill — from both parties — to explain why they stand on the side of big banks instead of working families,\" said Senator Elizabeth Warren, the Massachusetts Democrat.\nStill, lobbyists, lawmakers and administration officials saying this is the make or break year for overhauling Dodd-Frank.\nRob Nichols, president of the American Bankers Association, said the legislation would correct what banks view as regulatory overreach borne of a hasty legislative effort to shore up a cratering financial system after the 2008 crisis. \"What I do think is significant here is that you have a recognition that's been building for several years that parts of the policy response were misguided, ill-conceived and missed the mark,\" Mr. Nichols said.\nBanking giants such as J.P. Morgan and Goldman Sachs — which would see little in the way of change under the Senate bill — have said little about the looming legislation. But Jamie Dimon, the chief executive of J.P. Morgan, has been a vocal proponent of revising the Dodd-Frank law, saying in a letter to shareholders in April 2017 that \"poorly conceived and uncoordinated regulations have damaged our economy, inhibiting growth and jobs.\"\nSome industry lobbyists have pointed out that rules ushered in after the financial crisis have in some ways been beneficial for the big banks, acting as a barrier to entry for any bank without the resources to handle the additional compliance costs.\nThe bill that is working its way through the Senate was brokered primarily by Senator Mike Crapo, the Idaho Republican who chairs the banking committee, and moderate Democrats such as Senator Heidi Heitkamp of North Dakota, Senator Jon Tester of Montana, Senator Joe Donnelly of Indiana and Senator Mark Warner of Virginia. Eleven Senate Democrats are co-sponsoring the bill, making its passage in the Senate likely.\nBackers argue that the bill would offer much-needed relief to small banks and credit unions in parts of America that have been struggling under regulations that had primarily been aimed at the biggest banks.\n\"A lot of what was Too Big To Fail under Dodd-Frank became 'too small to succeed' because of the onerous regulatory burdens,\" Ms. Heitkamp said.\nUnder the bill, firms with less than $10 billion in assets would be exempt from the so-called Volcker Rule, which prohibits banks from making risky bets with federally-guaranteed deposits. Mortgage rules for small lenders would also be eased.\nSome critics of the bill say it goes too far. They argue that many of the institutions that received bailout money during the downturn would get less oversight.\n\"I think it's going to increase stress on the financial system,\" said Marcus Stanley, policy director for Americans for Financial Reform, a nonprofit organization calls for tougher regulation of Wall Street. \"It's going to increase the risk to individual banks and when significant numbers of individual banks go bust, that increases the stress on the system.\"\nStill, in a sign of the fight to come, other critics — including some House members — say the Senate legislation does not go far enough. House Republicans passed a far more aggressive bill last summer , which would be far more crippling to Dodd-Frank. That bill would, among other things, remove the prohibition against using federally insured funds for risking lending and gut the Consumer Financial Protection Bureau. Under the Senate bill, it would remain intact.\nMany House Republicans could find it difficult to back a bill that leaves the bureau unscathed, but weakening it has almost no chance in the Senate.\nThe Trump administration has signaled its support of the Senate bill, with Gary D. Cohn, director of the White House's National Economic Council, telling Bloomberg News earlier this month that the Senate bill would \"change the regulatory environment for the vast, vast majority of banks in the United States.\"\nIn an interview with The Wall Street Journal last week, Mr. Trump said: \"We're looking at Dodd-Frank very strongly and I think we'll have something on that.\"\nEfforts to loosen Wall Street regulations are already underway , even without legislation. The Office of Financial Research, which is supposed to spot red flags on Wall Street, lost its director last month and the Treasury Department is seeking to reduce its funding and staff . The Treasury Department has also issued a series of reports recommending changes to a number of other post-crisis rules, including rescinding a requirement that companies disclose the pay ratio between chief executives and workers.\nMr. Trump has been hiring regulators who have expressed reservations about — or been critical of — some of the post-crisis rules. In November, Mr. Trump tapped Mick Mulvaney, his budget director, to be acting director of the Consumer Financial Protection Bureau.", "external_links": ["https://www.ncua.gov/newsroom/Pages/news-2017-july-mcwatters-letter-to-cfpb.aspx", "https://www.nytimes.com/2018/01/16/business/energy-environment/oil-prices.html?rref=collection%2Fsectioncollection%2Fbusiness", "https://www.nytimes.com/2017/10/06/business/treasury-financial-rules-dodd-frank.html", "https://www.jpmorganchase.com/corporate/investor-relations/document/ar2016-ceolettershareholders.pdf", "https://www.nytimes.com/2017/01/30/business/dealbook/republicans-unravel-dodd-frank-act.html", "https://www.nytimes.com/2018/01/15/business/dealbook/blackrock-laurence-fink-letter.html?rref=collection%2Fsectioncollection%2Fbusiness", "https://www.treasury.gov/about/budget-performance/CJ18/18.", "https://www.nytimes.com/2018/01/15/business/economy/immigration-raids.html?rref=collection%2Fsectioncollection%2Fbusiness", "https://www.nytimes.com/2017/06/08/business/dealbook/how-house-bill-would-dismantle-an-array-of-dodd-frank-reforms.html?_r=0", "https://www.nytimes.com/2017/11/27/business/financial-regulation-rollback-trump.html?_r=0"], "published": "2018-01-16T18:24:00.000+02:00", "crawled": "2018-01-16T17:31:23.007+02:00", "highlightTitle": ""}