{"organizations": [], "uuid": "c78704b8622ccda84baf4ac3a895902d1b5cfa41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222502206&w=1200&r=LYNXMPEE0F1EE", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-israel-palestinians-usa/u-s-to-provide-60-million-for-palestinians-withhold-65-million-idUSKBN1F52GA", "country": "US", "domain_rank": 408, "title": "U.S. to provide $60 million for Palestinians, withhold $65 million", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:58:00.000+02:00", "replies_count": 0, "uuid": "c78704b8622ccda84baf4ac3a895902d1b5cfa41"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-usa/u-s-to-provide-60-million-for-palestinians-withhold-65-million-idUSKBN1F52GA", "ord_in_thread": 0, "title": "U.S. to provide $60 million for Palestinians, withhold $65 million", "locations": [], "entities": {"persons": [{"name": "cynthia osterman", "sentiment": "none"}, {"name": "arshad mohammed", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "united nations relief and works agency", "sentiment": "none"}, {"name": "unrwa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The United States will give a U.N. agency $60 million in aid for Palestinians refugees but withhold a further $65 million for now, the State Department said on Tuesday, as the Trump administration carried out a threat it made two weeks ago to cut funding.\nWhile saying the decision would sustain schools and health services, State Department spokeswoman Heather Nauert echoed President Donald Trump in calling on other nations to provide more funds because he believes the United States pays more than its share.\nThe decision to keep back some money is likely to compound the difficulty of reviving Israeli-Palestinian peace talks and to further undermine Arabs’ faith that the United States can act as an impartial arbitrator, particularly following Trump’s Dec. 6 announcement reversing decades of U.S. policy and recognizing Jerusalem as Israel’s capital.\nA Palestinian official quickly criticized Washington’s decision to withhold some of the money and United Nations Secretary-General Antonio Guterres said he was unaware of any cut in aid but he was “very concerned” about the possibility.\nThe State Department notified the United Nations Relief and Works Agency for Palestinian Refugees (UNRWA) of the decision in a letter, Nauert said at a daily briefing. She said the Trump administration was conditioning the release of the additional funds on whether the organization makes unspecified reforms.\nShe insisted, however, the U.S. decision was “not aimed at punishing” anyone.\nA U.S. official, who spoke on condition of anonymity, said UNRWA must be fundamentally reevaluated “in the way it operates and the way it is funded.”\n“Without the funds we are providing today, UNRWA operations were at risk of running out of funds and closing down. The funds provided by the United States will prevent that from happening for the immediate future,” the official said, saying the additional “$65 million will be held for future consideration.”\nIn a Twitter post on Jan. 2, Trump said that Washington gives the Palestinians ”HUNDRED OF MILLIONS OF DOLLARS a year and get no appreciation or respect.\nBoxes containing aid from the U.N. Relief and Works Agency (UNRWA) are seen ahead of their transfer to the Gaza Strip, inside the Kerem Shalom border crossing terminal between Israel and Gaza Strip January 16, 2018. REUTERS/Amir Cohen “They don’t even want to negotiate a long overdue peace treaty with Israel ... with the Palestinians no longer willing to talk peace, why should we make any of these massive future payments to them?” Trump added in his tweet.\nBURDEN SHARING While U.S. officials did not link the U.S. decision to Trump’s tweet, they made a point often advanced by the president by saying the United States had been UNRWA’s single largest donor for decades and demanded other nations do more.\n“The United States government and the Trump administration believes there should be more burden sharing going around,” spokeswoman Nauert said.\nTrump’s aides initially debated whether to cut off all UNRWA aid after the tweet, a second U.S. official said. But those opposed to the idea argued that it could further destabilize the region, the official said.\n“UNRWA has proven time and again to be an agency that misuses the humanitarian aid of the international community and instead supports anti-Israel propaganda, perpetuates the plight of Palestinian refugees and encourages hate,” Danny Danon, Israel’s ambassador to the United Nations, said.\nPalestine Liberation Organization official Wasel Abu Youssef told Reuters: “This decision confirms the U.S administration is continuing in wiping out the rights of the Palestinian people. First was declaring Jerusalem as the capital of Israel and today the refugee issue.”\nHistorically, U.S. administrations had said the status of Jerusalem must be decided in Israeli-Palestinian peace talks. The city is holy to three major monotheistic faiths.\nAt the United Nations, Guterres told reporters that the services provided by UNRWA were “of extreme importance, not only for the well-being of these populations ... but also in my opinion and an opinion that is shared by most international observers, including some Israeli ones, it is an important factor of stability.”\n“So if UNRWA will not be in a position to provide the vital services and the emergency forms of support that UNRWA has been providing this will create a very, very serious problem and we will do everything we can to avoid this situation,” he said.\nReporting By Arshad Mohammed; Additional reporting by Matt Spetalnick in Washington, Nidal al-Mughrabi in Gaza and Michelle Nichols at the United Nations; Editing by Grant McCool\n ", "external_links": [], "published": "2018-01-16T20:58:00.000+02:00", "crawled": "2018-01-16T21:07:56.000+02:00", "highlightTitle": ""}