{"organizations": [], "uuid": "415b4f675b2e5df93a81f16fbcc7b256996377c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 85}, "facebook": {"likes": 835, "shares": 835, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955954-GettyImages-482331761.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/48227449/device/rss/rss.html", "section_title": "Futures Now", "url": "https://www.cnbc.com/2018/01/19/bitcoin-could-lose-90-percent-of-its-value-wall-st-veteran-boockvar-warns.html", "country": "US", "domain_rank": 767, "title": "Bitcoin could lose 90% of its value, Wall Street veteran Peter Boockvar warns", "performance_score": 8, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T00:00:00.000+02:00", "replies_count": 0, "uuid": "415b4f675b2e5df93a81f16fbcc7b256996377c3"}, "author": "", "url": "https://www.cnbc.com/2018/01/19/bitcoin-could-lose-90-percent-of-its-value-wall-st-veteran-boockvar-warns.html", "ord_in_thread": 0, "title": "Bitcoin could lose 90% of its value, Wall Street veteran Peter Boockvar warns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wall Street veteran Peter Boockvar predicts an epic crash will hit the cryptocurrency market.\nHe isn't sure if it'll come to a grinding halt or be a slow and steady drop — but he says it's coming.\nBoockvar, chief investment officer at Bleakley Advisory Group, is certain crypto is in a giant bubble, and the air is already coming out.\n\"When something goes parabolic like this has, it typically ends up to where that parabola began,\" he said on CNBC's \" Futures Now .\"\nBoockvar, a CNBC contributor, contends bitcoin is in danger of dropping 90 percent from current levels. He calls it a classic bubble.\n\"I wouldn't be surprised if over the next year it's down to $1,000 to $3,000,\" he added. \nThat's where bitcoin, the largest cryptocurrency player, was trading less than 12 months ago. Friday afternoon it was trading above $11,000.\nBoockvar sees the collapse coming in tandem as interest rates rise around the globe. He blames central banks, including the Federal Reserve, for the cryptocurrency craze due to their easy money policies that were designed to ease the effects of the global financial crisis.\n\"You have to wonder if we never heard of quantitative easing , would there have been cryptocurrencies?\" Boockvar asked rhetorically in Thursday's interview.\nOnce the cryptocurrency market cracks, he contends, investor attitudes toward risk assets will change. According to Boockvar, the stock market could see collateral damage, but it would all be based on psychology — not on anything that's fundamentally wrong with the economy.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-22T00:00:00.000+02:00", "crawled": "2018-01-22T00:12:11.009+02:00", "highlightTitle": ""}