{"organizations": [], "uuid": "7fb6d72fa26b08f2ece2c6949859db93b21f2577", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-hospitality-asset-managers-association-ahamaa-names-2018-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Hospitality Asset Managers Association (“HAMA”) Names 2018 Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-16T16:55:00.000+02:00", "replies_count": 0, "uuid": "7fb6d72fa26b08f2ece2c6949859db93b21f2577"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-hospitality-asset-managers-association-ahamaa-names-2018-board-of-directors.html", "ord_in_thread": 0, "title": "Hospitality Asset Managers Association (“HAMA”) Names 2018 Board of Directors", "locations": [], "entities": {"persons": [{"name": "steven nicholas", "sentiment": "none"}, {"name": "tim dick", "sentiment": "none"}, {"name": "derrick yee", "sentiment": "none"}, {"name": "fulcrum hospitality", "sentiment": "none"}, {"name": "larry kaminsky", "sentiment": "none"}, {"name": "anjali agarwal", "sentiment": "none"}, {"name": "kim gauthier", "sentiment": "none"}, {"name": "christopher ostapovicz", "sentiment": "none"}, {"name": "greg kennealey", "sentiment": "none"}, {"name": "larry trabulsi", "sentiment": "none"}, {"name": "matthew arrants", "sentiment": "none"}, {"name": "melissa silvers", "sentiment": "none"}, {"name": "maxine taylor", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "hospitality asset managers association", "sentiment": "negative"}, {"name": "chmwarnick", "sentiment": "none"}, {"name": "three wall capital", "sentiment": "none"}, {"name": "noble investment group", "sentiment": "none"}, {"name": "chartres lodging", "sentiment": "none"}, {"name": "scs advisors", "sentiment": "none"}, {"name": "pinnacle advisory group", "sentiment": "none"}, {"name": "host hotels & resorts", "sentiment": "none"}, {"name": "new hama", "sentiment": "none"}, {"name": "watermark capital partners", "sentiment": "none"}, {"name": "ksl capital partners", "sentiment": "none"}, {"name": "cham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA--(BUSINESS WIRE)-- Officials of the Hospitality Asset Managers Association (“HAMA”) today announced their new board of directors for 2018. Recently appointed at the group’s semi-annual conference, the new members include:\nCHMWarnick’s Maxine Taylor as president Three Wall Capital’s Tim Dick as vice-president Fulcrum Hospitality’s Larry Kaminsky as secretary Host Hotels & Resorts’ Christopher Ostapovicz as treasurer Pinnacle Advisory Group ’s Matthew Arrants as marketing chair hotelAVE’s Kim Gauthier, CHAM (Certified Hotel Asset Manager), as head of the education chair CHMWarnick’s Larry Trabulsi as head of the international chair KSL Capital Partners’ Greg Kennealey as industry chair Noble Investment Group’s Steven Nicholas as an at-large board member Watermark Capital Partners’ Derrick Yee as an at-large board member Chartres Lodging’s Anjali Agarwal as an at-large board member SCS Advisors’ Melissa Silvers, CHAM, as an at-large board member\nNew HAMA president Maxine Taylor brings 30 years hospitality industry experience and a career largely dedicated to the discipline of hotel asset management, including her current role as a senior vice president with CHMWarnick, a leading hotel asset management and owner advisory company. Formerly she served as executive vice president of asset management at Chartres Lodging Group and vice president of asset management at Capital Hotel Management. Prior to that, Taylor also worked with Horwath Landauer Hospitality Consulting, The Ritz-Carlton hotels in Fla. and Ga., and served as a professor of hospitality management at Edison Community College. Prior to her appointment as HAMA president, she served as international chair and has played an active role in many other industry organizations, such as the Consumer Innovation Forum (CIF), the former Association of Sheraton Franchisees of North America (ASFONA) and former Starwood Owners Advisory Council. She also was voted Top 100 Most Influential Women in the East Bay in 2011 by the San Francisco Business Times. Taylor received her master’s in Hospitality Management from Florida International University in Miami, is a Certified Hotel Administrator (CHA) and is a United States Army Veteran, having spent three years in the military as a telecommunications specialist in Korea and Germany. A regular speaker on asset management and hotel ownership issues, she is a featured panelist at the upcoming 2018 Americas Lodging Investment Summit (ALIS) on the topic of asset optimization.\n“With HAMA entering its 26th year, it is clear that the role of the asset manager has grown and evolved as the collective voice of ownership, actively partnering with brands and management to optimize profitability and investment returns,” said Taylor. “Our new board represents industry leaders and distinguished asset management professionals across a full-spectrum of the discipline, from companies with in-house asset management capabilities to nationwide, third-party asset management providers. As our industry evolves, we have the responsibility to be the collective voice on key issues to benefit the hospitality ownership community worldwide.”\nAbout HAMA\nHAMA members are involved in asset management, acquisition, financing and disposition of hotels and resorts and are directly responsible for making decisions concerning capital investments, renovations, asset repositioning, operational policies and management selection. Its U.S. members represent more than 3,500 hotels and resorts across every major brand, accounting for 775,000 hotel rooms, 250,000 employees, $40 billion in annual revenue and $3 billion in capital expenditures. The organization boasts an additional 245 international affiliate members, as well.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005261/en/\nDaly Gray Public Relations\nChris Daly, media\n703-435-6293\nchris@dalygray.com\nSource: Hospitality Asset Managers Association (HAMA)", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hamagroup.org&esheet=51742801&newsitemid=20180116005261&lan=en-US&anchor=About+HAMA&index=1&md5=20435e2459ecbb3e6fa67104a41d0a74", "http://www.businesswire.com/news/home/20180116005261/en/"], "published": "2018-01-16T16:55:00.000+02:00", "crawled": "2018-01-16T19:38:29.000+02:00", "highlightTitle": ""}