{"organizations": [], "uuid": "a52dd4da962c61f9f3beced4a64b24e597a45629", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222375257&w=1200&r=LYNXMPEE0F0JP", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy-inflation/inflation-falls-back-for-first-time-since-june-as-brexit-hit-wanes-idUKKBN1F50XU", "country": "US", "domain_rank": 408, "title": "Inflation falls back for first time since June as Brexit hit wanes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T11:33:00.000+02:00", "replies_count": 0, "uuid": "a52dd4da962c61f9f3beced4a64b24e597a45629"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-inflation/inflation-falls-back-for-first-time-since-june-as-brexit-hit-wanes-idUKKBN1F50XU", "ord_in_thread": 0, "title": "Inflation falls back for first time since June as Brexit hit wanes", "locations": [], "entities": {"persons": [{"name": "reuters/darrin zammit lupi", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "oxford circus", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 9:33 AM / Updated 6 hours ago Inflation falls back for first time since June as Brexit hit wanes Reuters Staff 5 Min Read \nLONDON (Reuters) - British inflation eased off its post-Brexit vote high in December, official data showed on Tuesday, suggesting the financial squeeze on many households could be about to get a little bit easier. \nConsumer price inflation slipped to an annual rate of 3.0 percent in December, below November’s nearly six-year high of 3.1 percent and the first fall since June. \nThe figure was in line with the median forecast of economists in a Reuters poll. \nInflation jumped in Britain after the decision by voters in June 2016 to leave the European Union which hammered the value of the pound and pushed up the cost of imports. \nIn the euro zone, inflation was just 1.4 percent in December, less than half the rate in Britain. \nThe combination of high inflation and slow wage growth - as well as uncertainty about the terms on which Britain will leave the EU in 2019 - is expected to mean Britain grows more weakly than other European economies this year. \nConsumer price growth looks set to wane as the peak impact from sterling’s sharp fall in mid-2016 drops out of the data. \nBut the Office for National Statistics said it could not yet declare that inflation was definitely on the slide. \n“It remains too early to say whether today’s slight fall is the start of any longer-term reduction in the rate of inflation,” James Tucker, an ONS statistician, said. Shoppers cross the street at Oxford Circus in London, Britain, November 25, 2017. REUTERS/Darrin Zammit Lupi \nTuesday’s official data showed growth in food prices slowed in December while airline fares rose less strongly than a year earlier, also pushing down on the overall inflation rate. \nHowever, pressure in the pipeline grew as factory gate prices rose, confounding predictions of a fall. \nThe Bank of England has said it expects inflation peaked in late 2017 before falling slowly over the next three years to just above its 2 percent target. \nMany private economists think the fall in inflation could be faster, possibly subsiding to 2 percent this year. \nThe BoE is widely expected to keep interest rates unchanged at 0.5 percent next month as it waits for signs that wages are rising more quickly. \nOn Monday, BoE rate-setter Silvana Tenreyro said she felt the central bank had “ample time” to look at the impact of its rate hike in November - the first in more than a decade - before moving again. \nThe alternative measure of retail price inflation, which is used to calculate payments on government bonds and many commercial contracts, rose to a six-year high of 4.1 percent - pushed up by higher mortgage bills after the BoE rate hike. \nAmong manufacturers, the cost of raw materials - many of them imported - was 4.9 percent higher than in December 2016, down from 7.3 percent in November and the weakest increase since July 2016. \nEconomists polled by Reuters had expected input prices to rise by 5.4 percent. \nBut manufacturers increased the prices they charged by 3.3 percent compared with a rise of 3.1 percent in November, stronger than all forecasts in the Reuters poll. \nThe ONS also said house prices in November rose by an annual 5.1 percent across the United Kingdom as a whole, slowing from October. Prices in London alone rose by a weaker 2.3 percent, the smallest increase since March. Reporting by William Schomberg and David Milliken", "external_links": [], "published": "2018-01-16T11:33:00.000+02:00", "crawled": "2018-01-16T11:43:37.000+02:00", "highlightTitle": ""}