{"organizations": [], "uuid": "ab00d8a4cb78ef97296c7018c83249b3e08963cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/04/104383621-GettyImages-624276410.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/31/james-altucher-the-face-of-bitcoin-says-hes-happy-about-facebooks-bitcoin-ban.html", "country": "US", "domain_rank": 767, "title": "Facebook: James Altucher says he's happy about the crypto ad ban", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:09:00.000+02:00", "replies_count": 0, "uuid": "ab00d8a4cb78ef97296c7018c83249b3e08963cc"}, "author": "Peter Kafka", "url": "https://www.cnbc.com/2018/01/31/james-altucher-the-face-of-bitcoin-says-hes-happy-about-facebooks-bitcoin-ban.html", "ord_in_thread": 0, "title": "Facebook: James Altucher says he's happy about the crypto ad ban", "locations": [], "entities": {"persons": [{"name": "james altucher", "sentiment": "positive"}, {"name": "altucher", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "James Altucher has made himself the face of bitcoin.\nNow Facebook has banned him, and everyone else who wants to advertise anything to do with bitcoin and and other cryptocurrencies.\nGood idea, Altucher says.\n\" I think this is a very good move for Facebook,\" Altucher says via email, in response to questions from Recode. \"There are many scams and illegitimate services out there.\"\nThat's the same sentiment Facebook expressed yesterday, when it announced its ban on all crypto ads. And Facebook reps made it clear that the ad ban included the ones Altucher had paid for, on Facebook and throughout the web, with come-ons like \"crypto-genius reveals the next bitcoin.\"\nMore from Recode:\nTech is now a weapon for propaganda and the problem is way bigger than Russia It's not just bitcoin: Look at all the stuff Facebook won't let you advertise. Trump didn't say much about tech in his first-ever State of the Union address Altucher is a one-man self-help industry, who says he grossed $11 million in 2016 , before the most recent crypto boom. He distributes free content on Facebook, podcasts and other outlets, and charges for subscriptions to services that offer stock picks and other financial advice.\nAltucher is currently selling a \" Crypto Trader \" package that includes a \"six-video crypto masterclass\" and other services for $2,000.\nI asked Altucher how much he spent marketing his crypto services, and what percent of his marketing spend went to Facebook, and what his plans are now. He didn't answer those questions, but did praise Facebook for \"trying to clean up all of the garbage out there.\"\nHere's the text of two emails Altucher sent in response to my queries:\nI think this is a very good move for Facebook. There are many scams and illegitimate services out there.\nAbout a year ago I had an opportunity to do a $100mm+ hedge fund in the crypto space. I turned it down in order to create a solid research service in the cryptocurrency space. I hired people, wrote a book, created a class, and send out reports every week to subscribers. In addition to my normal newsletter which is on entrepreneurship, health / well-being, and there are some articles each month or week on stocks.\nI wanted an opportunity to help many people instead of just a few (I've been there, done that in the hedge fund space). So I welcome any opportunity to help legitimate and sincere voices rise to the top, as they always do.\nMy hope is that a lot more focus in the cypto space will be on education services. Something like 70% of Bitcoins are owned by men under 35. It's about time that ads and services start being focused on the enormous number of people that simply need to learn what a Bitcoin IS.\nAnd again, kudos to Facebook for trying to clean up all of the garbage out there. This is an enormous opportunity but, like any new financial opportunity, the schemers and crooked charlatans are having a field day.\nI've worked with Rob Leathern (the product manager at Facebook who wrote the press release) before (I was on the board of directors of his last company, Optimal, which sold to Brand Networks for $35 million) before. He's a genius level guy in this space and knows what he is doing. Overall, this is a positive move for the cryptocurrency space.", "external_links": [], "published": "2018-01-31T17:09:00.000+02:00", "crawled": "2018-01-31T17:28:20.008+02:00", "highlightTitle": ""}