{"organizations": [], "uuid": "5dd4006f81d9ae1cbc7ba19c45e1d84a87ae0512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226336530&w=1200&r=LYNXMPEE0S162", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-smoking-casinos/effect-of-illinois-smoke-free-law-on-casino-revenue-is-topic-of-dispute-idUSKBN1FI1YT", "country": "US", "domain_rank": 408, "title": "Effect of Illinois smoke-free law on casino revenue is topic of dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:41:00.000+02:00", "replies_count": 0, "uuid": "5dd4006f81d9ae1cbc7ba19c45e1d84a87ae0512"}, "author": "", "url": "https://www.reuters.com/article/us-health-smoking-casinos/effect-of-illinois-smoke-free-law-on-casino-revenue-is-topic-of-dispute-idUSKBN1FI1YT", "ord_in_thread": 0, "title": "Effect of Illinois smoke-free law on casino revenue is topic of dispute", "locations": [], "entities": {"persons": [{"name": "carolyn crist", "sentiment": "none"}, {"name": "john tauras", "sentiment": "none"}], "locations": [{"name": "illinois", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "tobacco control", "sentiment": "none"}, {"name": "national bureau of economic research", "sentiment": "none"}, {"name": "university of illinois", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - The Illinois law that banned smoking in casinos hasn’t negatively impacted casino numbers and dollars, according to a new study in the journal Tobacco Control.\nAt the same time, casino officials in Illinois disagree with the study’s methods and say revenues have definitely decreased.\n“Workers in casinos that allow smoking are at high risk for secondhand smoke exposure,” lead study author Dr. John Tauras of the National Bureau of Economic Research and the University of Illinois in Chicago told Reuters Health by email. “By eliminating secondhand smoke exposure, smoking bans in casinos have the potential to significantly improve the health of casino workers and patrons of casinos.”\nIn 2008, Illinois become one of the first states to prohibit smoking in commercial casinos. The Smoke-Free Illinois Act banned smoking inside and within 15 feet of building entrances. Notably, the law went into effect one month after the beginning of the national recession.\nTo understand the law’s effects on casino revenues, Tauras and colleagues analyzed casino admissions and receipts for 10 years before and eight years after the law went into effect. They also looked at numbers for Illinois, Indiana, Iowa and Missouri, and in particular at per-capita adjustments based on the states’ populations.\nThey found that the Smoke-Free Illinois Act didn’t have a statistically significant impact on per-capita casino admissions and revenues. In general, casino admissions in Illinois reached a peak in July 2000 and have been on a downward trend since, according to the report. Initial comparisons before and after the ban show a 5 percent decline in casino admissions in the state, whereas admissions in Indiana, Iowa and Missouri gradually increased.\nAfter a more in-depth analysis, however, the research team saw that per-capita gross receipts dropped 20 percent in Illinois from the first quarter of 2007 to the first quarter of 2008, compared to an 11 percent decline in Indiana, a 5.6 decline in Missouri and slight increase in Iowa.\nAt the same time, when they accounted for other factors, such as the economic recession and the new availability of video game gambling, they determined that the smoking ban had no effect on casino numbers.\n“Estimates from our study clearly indicated that the Illinois law that banned smoking in casinos has had no significant negative economic consequences for casinos in terms of per-capita admissions or revenues,” Tauras said.\nIllinois casino officials disagree, said Tom Swoik, executive director of the Illinois Casino Gambling Association in Chicago.\nHe believes the discrepancy in numbers may be related to the way admissions and revenues were calculated for the study. By looking at per-capita and state-wide numbers, he said, calculations may indicate that the smoking ban hasn’t made a difference.\nA 2009 report on the website of the Federal Reserve Bank of St. Louis said the ban could be responsible for a 20 percent revenue decline that meant more than $400 million in lost revenue and more than $200 million in tax revenue for Illinois in 2008. ( bit.ly/2rKhbgk )\n“We do know from other studies that the more time someone spends on the casino floor, they more likely they are to keep playing,” Swoik said. “If they have to go outside to smoke, they’re more likely to light up and then leave.”\nFuture studies should investigate potential effects at casinos owned by Native American tribes, the study authors say. Of the 485 tribally-owned casinos nationwide, smoking is allowed in about 75 percent.\n“Many tribes rely on casinos as a significant source of revenue, and they’re reluctant to adopt smoke-free casino policies because they fear their revenues will decline,” Tauras said.\nBeyond the effect on casino admissions and revenue, public health experts have concerns about secondhand smoke for casino employees.\n“We know that secondhand smoke is not beneficial to your health, and at the same time, having a facility where people can smoke at a casino is beneficial for revenue,” Swoik said. “It can be hard to weigh the negative health effects versus the economic numbers.”\nSOURCE: bit.ly/2rUpw15 Tobacco Control, online January 19, 2018.\n ", "external_links": [], "published": "2018-01-29T17:41:00.000+02:00", "crawled": "2018-01-29T18:07:02.025+02:00", "highlightTitle": ""}