{"organizations": [], "uuid": "065eea04ab04d23ce237fc9d27157442e7344c4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fibra-prologis-announces-fourth-quarter-and-full-year-2017-earnings-results.html", "country": "US", "domain_rank": 767, "title": "FIBRA Prologis Announces Fourth Quarter and Full Year 2017 Earnings Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:48:00.000+02:00", "replies_count": 0, "uuid": "065eea04ab04d23ce237fc9d27157442e7344c4f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fibra-prologis-announces-fourth-quarter-and-full-year-2017-earnings-results.html", "ord_in_thread": 0, "title": "FIBRA Prologis Announces Fourth Quarter and Full Year 2017 Earnings Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "fibra prologis", "sentiment": "negative"}, {"name": "fibrapl", "sentiment": "negative"}, {"name": "cbfi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY, Jan. 25, 2018 /PRNewswire/ -- FIBRA Prologis (BMV:FIBRAPL 14), a leading owner and operator of Class-A industrial real estate in Mexico, today reported results for the fourth quarter and full year 2017.\nHIGHLIGHTS FROM THE YEAR:\nOperating portfolio occupancy increased to 97.3 percent Net effective rents on rollover increased 11.9 percent Same store cash NOI grew 2.8 percent Lowered weighted average debt cost to 4.0% Completed US$29.6 million of asset acquisitions\nNet earnings per CBFI in the fourth quarter was Ps. 1.2176 (US$0.0669) compared with Ps. 1.0580 (US$0.0538) for the same period in 2016. For the full year 2017, net earnings per CBFI was Ps. 2.4624 (US$0.1340).\nFunds from operations (FFO) per CBFI was Ps. 0.7209 (US$0.0407) for the fourth quarter compared with Ps. 0.8306 (US$0.0423) for the same period in 2016. For the full year 2017, FFO per CBFI was Ps. 2.9077 (US$0.1541).\nPORTFOLIO QUALITY AND LOCATION DRIVE SOLID OPERATING PERFORMANCE\n\"2017 was an excellent year for FIBRA Prologis as we delivered on both internal and external growth which resulted in a higher, sustainable distribution,\" said Luis Gutierrez, CEO, Prologis Property Mexico. \"We successfully increased both occupancy and rents in our portfolio. Additionally, we expanded our footprint, acquiring two new Class-A buildings from our sponsor, Prologis.\"\nGutierrez added, \"As we enter another year of political uncertainty, our strategy of owning high-quality, logistics facilities in high-barrier-to-entry markets has never been more important. Our team remains focused on delivering quality results and I am confident that we can maintain our momentum into 2018.\"\nOperating Portfolio\n4Q17\n4Q16\nNotes\nPeriod End Occupancy\n97.3%\n96.8%\nThree of our six markets ended 2017 with occupancy of 98.0% or greater\nLeases Signed\n1.8 MSF\n1.7 MSF\nCustomer Retention\n89.0%\n80.3%\nNet Effective Rent Change\n13.5%\n8.3%\n11.9% for full year 2017\nCash Same Store NOI\n4.8%\n1.9%\n2.7% for full year 2017\nSame Store NOI\n3.7%\n0.0%\nSOLID FINANCIAL POSITION\nAt December 31, 2017 FIBRA Prologis' leverage was 33.2% and liquidity was Ps. 3.3 billion (US$169.0 million), which included Ps. 3.0 billion (US$150.0 million) of available capacity on its unsecured credit facility and Ps. 371.4 million (US$18.8 million) of unrestricted cash.\nGUIDANCE ESTABLISHED FOR 2018 – FULL-YEAR DISTRIBUTIONS TO INCREASE 5 PERCENT\n\"We are introducing 2018 guidance that builds on the momentum of our exceptional 2017 performance,\" said Jorge Girault, senior vice president, Finance, Prologis Property Mexico. \"The outlook for Mexico remains positive and our business should capitalize on a healthy real estate market.\"\n(Based in millions of U.S. dollars, except\nper CBFI amounts)\nLow\nHigh\nNotes\nFFO per CBFI\n$0.1550\n$0.1650\nExcludes the impact of foreign\nexchange movements and any\npotential incentive fee\nFull Year 2018 Distributions per CBFI\n$0.1240\n$0.1240\nYear End Occupancy\n96.0%\n97.0%\nSame Store NOI (Cash)\n4.0%\n5.0%\nBased in U.S. dollars\nAnnual Capital Expenditures as % of NOI\n13.0%\n14.0%\nAsset Management and Professional Fees\nUS$19.5\n$21.5\nBuilding Acquisitions\n$100.0\n$300.0\nBuilding Dispositions\n$0.0\n$200.0\nForeign Exchange Rate\nPs20.0/USD\nPs20.0/USD\nWEBCAST & CONFERENCE CALL INFORMATION\nFIBRA Prologis will host a live webcast/conference call to discuss quarterly results, current market conditions and future outlook. Here are the event details:\nFriday, January 26, 2018, at 9 a.m. CT/10 a.m. ET Live webcast at www.fibraprologis.com , in the Investor Relations section, by clicking Events Dial in: +1 877 256 7020 or +1 973 409 9692 and enter Passcode 93296070.\nA telephonic replay will be available January 26 – February 2 at +1 855 859 2056 from the U.S. and Canada or at +1 404 926 9157 from all other countries using conference code 93296070 and security code 31833. The replay will be posted in the Investor Relations section of the FIBRA Prologis website.\nABOUT FIBRA PROLOGIS\nFIBRA Prologis is a leading owner and operator of Class-A industrial real estate in Mexico. As of December 31, 2017, FIBRA Prologis was comprised of 196 logistics and manufacturing facilities in six industrial markets in Mexico totaling 34.6 million square feet (3.2 million square meters) of gross leasable area.\nFORWARD-LOOKING STATEMENTS\nThe statements in this release that are not historical facts are . These are based on current expectations, estimates and projections about the industry and markets in which FIBRA Prologis operates, management's beliefs and assumptions made by management. Such statements involve uncertainties that could significantly impact FIBRA Prologis financial results. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" variations of such words and similar expressions are intended to identify such , which generally are not historical in nature. All statements that address operating performance, events or developments that we expect or anticipate will occur in the future — including statements relating to rent and occupancy growth, acquisition activity, development activity, disposition activity, general conditions in the geographic areas where we operate, our debt and financial position, are . These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions that are difficult to predict. Although we believe the expectations reflected in any are based on reasonable assumptions, we can give no assurance that our expectations will be attained and therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such . Some of the factors that may affect outcomes and results include, but are not limited to: (i) national, international, regional and local economic climates, (ii) changes in financial markets, interest rates and foreign currency exchange rates, (iii) increased or unanticipated competition for our properties, (iv) risks associated with acquisitions, dispositions and development of properties, (v) maintenance of real estate investment trust (\"FIBRA\") status and tax structuring, (vi) availability of financing and capital, the levels of debt that we maintain and our credit ratings, (vii) risks related to our investments (viii) environmental uncertainties, including risks of natural disasters, and (ix) those additional factors discussed in reports filed with the \"Comisión Nacional Bancaria y de Valores\" and the Mexican Stock Exchange by FIBRA Prologis under the heading \"Risk Factors.\" FIBRA Prologis undertakes no duty to update any appearing in this release.\nNon-Solicitation - Any securities discussed herein or in the accompanying presentations, if any, have not been registered under the Securities Act of 1933 or the securities laws of any state and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements under the Securities Act and any applicable state securities laws. Any such announcement does not constitute an offer to sell or the solicitation of an offer to buy the securities discussed herein or in the presentations, if and as applicable.\nView original content with multimedia: http://www.prnewswire.com/news-releases/fibra-prologis-announces-fourth-quarter-and-full-year-2017-earnings-results-300588629.html\nSOURCE FIBRA Prologis", "external_links": ["http://www.prnewswire.com/news-releases/fibra-prologis-announces-fourth-quarter-and-full-year-2017-earnings-results-300588629.html", "http://www.fibraprologis.com/"], "published": "2018-01-26T01:48:00.000+02:00", "crawled": "2018-01-26T01:27:42.008+02:00", "highlightTitle": ""}