{"organizations": [], "uuid": "140066f22867a995a32a9dacf942e396e61e4d05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/gadgets/cameras", "section_title": "", "url": "https://www.reuters.com/article/xerox-fujifilm-icahn/update-1-carl-icahn-seeks-revision-or-termination-of-xerox-fujifilm-deal-idUSL3N1PD4VX", "country": "US", "domain_rank": 408, "title": "UPDATE 3-Xerox-Fujifilm deal should have been changed long ago -Icahn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T09:56:00.000+02:00", "replies_count": 0, "uuid": "140066f22867a995a32a9dacf942e396e61e4d05"}, "author": "", "url": "https://www.reuters.com/article/xerox-fujifilm-icahn/update-1-carl-icahn-seeks-revision-or-termination-of-xerox-fujifilm-deal-idUSL3N1PD4VX", "ord_in_thread": 0, "title": "UPDATE 3-Xerox-Fujifilm deal should have been changed long ago -Icahn", "locations": [], "entities": {"persons": [{"name": "makiko yamazaki", "sentiment": "none"}, {"name": "darwin deason", "sentiment": "none"}, {"name": "deason", "sentiment": "none"}, {"name": "carl icahn", "sentiment": "none"}, {"name": "icahn", "sentiment": "none"}, {"name": "muvija", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fujifilm", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "fujifilm holdings", "sentiment": "none"}, {"name": "icahn reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "xerox corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 2:59 PM / Updated 2 hours ago CORRECTED-UPDATE 3-Xerox-Fujifilm deal should have been changed long ago -Icahn Reuters Staff 4 Min Read \n(Corrects paragraph 10 to say “Xerox” instead of “Fuji Xerox” and deletes reference to larger stake) \nBy Muvija M and Makiko Yamazaki \nJan 18 (Reuters) - Hedge fund investor Carl Icahn has called for the termination or renegotiation of Xerox Corp’s long-running photocopier joint venture with Fujifilm Holdings , reiterating demands for a change of leadership at Xerox. \nIn an open letter addressed to shareholders on Thursday, Icahn added his voice to that of another major owner of Xerox stock, Darwin Deason, who told the company on Wednesday to make public the terms of a deal with Fujifilm he said was probably “one-sided”. \n“We are obviously in favor of renegotiating the joint venture agreement to make it more favorable for Xerox,” Icahn said. “This should have been done a long, long time ago.” \nXerox, which has called Deason’s criticism “false and misleading”, said it was aware of Icahn’s letter and was “focused on creating value for all shareholders and will continue to take action to achieve this objective.” \nThe five-decade-old joint venture, 75 percent owned by Fujifilm and 25 percent by Xerox, is a pillar of Fujifilm’s business, accounting for nearly half the group’s overall operating profit. However, it has limited prospects for future growth due to declining demand for office printing. \nThe joint venture, called Fuji Xerox, reported operating profit of about $750 million on sales of $10 billion in the year ended last March. It covers the Asia-Pacific region including Japan and China. \nFujifilm, which declined to comment on Icahn’s letter, is aiming to expand the joint venture with a larger focus on document solutions services, while tapping fresh demand in emerging markets in Asia. \nIcahn, who has in the past called for a leadership change at Xerox, said it was self-evident that the current management team at the photocopier specialist was incapable of renegotiating the joint venture in Xerox’s favour. \nThe Wall Street Journal reported last week that Xerox, under pressure to find new growth sources amid shrinking demand for its printer and copier business, was in talks on a deal with the Japanese camera maker that could include a change in control of Xerox. \nDeutsche Bank analysts said in a report to clients this week that they do not see much advantage in Fujifilm taking a stake in Xerox given the current market climate. \nBut buying Xerox’s 25 percent share of the joint venture “could push for a more aggressive integration with Fuji Xerox that could have cost benefits,” the report said. \n“We believe drastic action is needed NOW because we fear that failing to replace Jeff Jacobson as (Xerox) CEO could inevitably result in the loss of our entire investment,” Icahn wrote. \n81-year old Icahn, through Icahn Associates Corp, holds about a 9.7 percent stake in Xerox, making him the largest shareholder. Deason is the third-largest shareholder, according to Thomson Reuters data. \nIcahn’s stake in Xerox dates back to 2015, when he called the shares “undervalued”. \nShares of Xerox, which fell 1.2 percent to $31.53 on Thursday, and have risen over 3 percent since Jan. 10, the day before the Journal’s report. \nFujifim shares edged up 0.6 percent by early Friday afternoon and have been little changed during that same period. ($1 = 110.9700 yen) (Reporting by Munsif Vengattil and Muvija M in Bengaluru, Makiko Yamazaki in Tokyo; Editing by Bernard Orr and Malcolm Foster)", "external_links": [], "published": "2018-01-19T09:56:00.000+02:00", "crawled": "2018-01-19T11:36:05.056+02:00", "highlightTitle": ""}