{"organizations": [], "uuid": "50166a301bb5c75dc723b3d8df4681a2f3ce5d6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224358632&w=1200&r=LYNXMPEE0M06W", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/china-internet-gameshow/china-online-quiz-craze-lures-prize-seekers-tech-giants-idINKBN1FC0DM", "country": "US", "domain_rank": 408, "title": "China online quiz craze lures prize seekers, tech giants", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T06:34:00.000+02:00", "replies_count": 0, "uuid": "50166a301bb5c75dc723b3d8df4681a2f3ce5d6f"}, "author": "", "url": "https://in.reuters.com/article/china-internet-gameshow/china-online-quiz-craze-lures-prize-seekers-tech-giants-idINKBN1FC0DM", "ord_in_thread": 0, "title": "China online quiz craze lures prize seekers, tech giants", "locations": [], "entities": {"persons": [{"name": "wang jianlin", "sentiment": "none"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "toutiao", "sentiment": "none"}, {"name": "adam jourdan", "sentiment": "none"}, {"name": "wang sicong", "sentiment": "none"}, {"name": "pei li", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "baidu inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "netease inc", "sentiment": "none"}, {"name": "alibaba group holding ltd-owned ucweb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 4:35 AM / Updated 9 hours ago China online quiz craze lures prize seekers, tech giants Pei Li , Adam Jourdan 4 Min Read \nBEIJING/SHANGHAI (Reuters) - It seems like a game everyone wins: some of China’s biggest tech companies, looking to hook in new consumers, are using cash prizes to draw millions of contenders to mobile-based online quiz shows. \nUp to 6 million people at a time log into the free, live games on their smartphones to answer a series of rapid-fire questions in an elimination battle, with those remaining sharing the prize money. \nOver the weekend, search engine giant Baidu Inc and video game maker NetEase Inc launched their own online shows, joining news feed platform Toutiao, Alibaba Group Holding Ltd-owned UCWeb and Wang Sicong, the scion of Chinese billionaire Wang Jianlin. \nBut how they will cash in on the games and stay on the right side of government censors might prove to be a tricky question. \nThe trivia games have drawn some controversy, heightened by a broader crackdown on online content during the last year under President Xi Jinping, from livestreams and blogs to a campaign against internet addiction. \nThis month, one quiz show, “Millions Winner,” backed by internet security company Qihoo 360, apologised after it was chastised by a regulator for listing Taiwan and Hong Kong, over which China claims sovereignty, as independent countries in a question. \nHow firms will monetise the craze is also not yet clear, though some companies, such as online retailer JD.com Inc, have already jumped on the trend, sponsoring shows to help raise their profiles. Many of the games show ads to players during the shows. \n“If you ask me why I do this, to be honest, I don’t really know if I can make money,” Zhou Hongyi, chairman of Qihoo, said at an event where he presented a contestant with a 1 million yuan ($156,115.84) prize cheque two weeks ago. “But from a user’s perspective, I think this is really fun.” \nThe quiz mania underlines the fierce appetite of China’s consumers for internet entertainment, a trend helping drive billions of dollars of investment into digital news portals, online gaming, internet advertising and television content. \n“I heard about this game from a friend who won 1,700 yuan in one day. I immediately decided to join up myself,” Wang Ting, a 26-year-old graduate student in Qingdao, told Reuters. She now spends three hours each day on her phone playing the games. \nQuestions, read by a live host, might include: “From which country were pineapples imported to China in the 16th century?”“In which dynasty was the lamb hot pot invented?” or “How many fingers does Mickey Mouse have?” \nContestants get 10 seconds - a time frame designed cut out cheating - to select the correct answer from a choice of three. Winnings can be up to 3 million yuan per game, but are often split between many winners. \nToutiao parent Bytedance said that “millions of our users” had taken part in its live quiz “Million Dollar Hero” since the show launched at the start of January. It also has a tougher “Hero Game” with harder questions and bigger prizes. \n“We’ve been running for just two weeks, so it’s still in the very early stages, but it’s encouraging to see how the game has taken off across the country, and with all age groups,” the company said in a statement to Reuters. \nToutiao, a highly popular news feed app, was valued at around $20 billion in a fund-raising last year, sources close to the company told Reuters. \nRaymond Wang, managing partner at Beijing law firm Anli Partners, said the shows were a “relatively low-cost way to get to users,” but cautioned there were political and technical risks. \nWang Ran, a prominent investor and head of Beijing-based private investment bank CEC Capital Group, posed a question on his WeChat account about the future of the online quiz show trend. \n“A) Growing numbers will jump into the market. B) Someone will win 10 million yuan in one go. C) Authorities will strictly crack down on it. 10 seconds. Go!” \n($1 = 6.4055 Chinese yuan renminbi) Reporting by Pei Li and Adam Jourdan; Editing by Gerry Doyle", "external_links": [], "published": "2018-01-23T06:34:00.000+02:00", "crawled": "2018-01-23T06:52:12.004+02:00", "highlightTitle": ""}