{"organizations": [], "uuid": "17eb857c7eca0d213a760090772c9b74bea0cc2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WV157_sizmek_TOP_20180103051849.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/ad-tech-firm-sizmek-promises-marketers-total-transparency-with-digital-ad-buys-1514977200", "country": "US", "domain_rank": 387, "title": "Ad Tech Firm Sizmek Promises Marketers ‘Total Transparency’ With Digital Ad Buys", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.108, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "17eb857c7eca0d213a760090772c9b74bea0cc2d"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/ad-tech-firm-sizmek-promises-marketers-total-transparency-with-digital-ad-buys-1514977200", "ord_in_thread": 0, "title": "Ad Tech Firm Sizmek Promises Marketers ‘Total Transparency’ With Digital Ad Buys", "locations": [], "entities": {"persons": [{"name": "sizmek", "sentiment": "none"}], "locations": [], "organizations": [{"name": "digital ad buys", "sentiment": "negative"}, {"name": "vector capital", "sentiment": "none"}, {"name": "sizmek", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS As marketers increasingly scrutinize their digital advertising spending, one ad-tech vendor is promising “total transparency” into the cost of the ads they are buying.\nSizmek, an ad-tech company that provides marketers and ad-buying agencies with tools to purchase digital ad space, announced Wednesday it would offer all clients using its platform access to itemized information about its technology fees and other costs such as data and service-related charges.\nClients will be able to audit how much they are spending through Sizmek’s platform with different media outlets and ad providers, and Sizmek also will offer more detailed information about how its “AI-enabled” media recommendation model works.\nSizmek, owned by private-equity firm Vector Capital, is responding to marketers’ frustrations with what they feel are hidden fees and a lack of clarity around where on the web their advertisements actually appear and which investments were the most effective. The ad-tech ecosystem has often come under criticism over the level of transparency vendors offer ad buyers about how they make their margins when they manage media spend within the complex system of online ad auctions that allow marketers to target specific audiences at scale across a range of sites and apps.\nA report published last month by the Association of National Advertisers , a U.S. trade body that represents some of the biggest ad-spenders, found that only 40% of marketers it surveyed were comfortable with the level of transparency they receive about their programmatic investments. Concerns included hidden fees, too many middlemen and a lack of visibility into where their ads end up running.\n“The more transparency we provide, the better [marketers] understand programmatic, and the better they can make their own judgements about which providers provide the best level of value,” said Sizmek Chief Executive Mark Grether.\nThe “total transparency” announcement comes four months after Sizmek completed the acquisition of public ad-tech company Rocket Fuel for $125.5 million.\nMr. Grether said while Rocket Fuel had been known for the performance of its technology, it operated with “an opaque transaction model, as many others have.”\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nRocket Fuel had been trying to pivot from being a managed-service business, which made the majority of its revenue from taking a cut of clients’ media spend, to a technology platform that charged recurring software fees.\nHowever, in July, when the Sizmek deal was announced, former Rocket Fuel CEO Randy Wootton told The Wall Street Journal that the transition was taking longer than expected as the costs of being a public company made the process more challenging. The Rocket Fuel brand has since been retired and its technology has been integrated into Sizmek.\nAndrew Casale, CEO of Index Exchange, a company that helps online publishers generate revenue through programmatic advertising, said transparency is now “table stakes” in the ad tech ecosystem and Sizmek is among the players setting the bar that will force more to follow.\n“For any platform that hasn’t made this pivot, they are likely going to be hearing increasingly from their customers for a similar model or an expectation for a similar level of transparency,” Mr. Casale said.\nAn executive at a large agency group who asked not to be named said that Sizmek is “filling a clear gap and need” from a marketer perspective and that many ad agencies are looking for an alternative to Google, Facebook and large independent ad tech company AppNexus.\n“On the other hand, no marketer has pioneered or tried to move dollars away from the status quo in the past decade with any success, so why will it work now?” the agency executive said.\nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": ["http://www.ana.net/content/show/id/47123"], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T13:49:59.002+02:00", "highlightTitle": ""}