{"organizations": [], "uuid": "ba900573df77e08e964fa9af6cd1e3b26740a569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-cleveland-cliffs-inc-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Cleveland-Cliffs Inc. Reports Fourth-Quarter and Full-Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "ba900573df77e08e964fa9af6cd1e3b26740a569"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-cleveland-cliffs-inc-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Cleveland-Cliffs Inc. Reports Fourth-Quarter and Full-Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "cleveland-cliffs inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "cleveland-cliffs inc.", "sentiment": "none"}, {"name": "clf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth-quarter Net Income of $318 million and Earnings of $1.05 per diluted share Fourth-quarter Adjusted EBITDA 1 of $129 million\nCLEVELAND--(BUSINESS WIRE)-- Cleveland-Cliffs Inc. (NYSE: CLF) today reported fourth-quarter and full-year results for the period ended December 31, 2017.\nFourth-quarter 2017 consolidated revenues were $601 million, compared to prior-year fourth-quarter revenues of $754 million. Cost of goods sold was $492 million, compared to $573 million reported in the fourth quarter of 2016.\nFor the fourth quarter of 2017, the Company recorded net income of $318 million, or $1.05 per diluted share, compared to net income of $81 million, or $0.34 per diluted share, recorded in the prior-year quarter.\nFor the fourth-quarter of 2017, adjusted EBITDA 1 was $129 million, compared to $174 million in the fourth quarter of 2016.\nFull-Year Consolidated Results\nFull-year 2017 consolidated revenues were $2.3 billion, compared to the prior year's revenues of $2.1 billion. Cost of goods sold was $1.8 billion, compared to $1.7 billion reported in 2016.\nFor the full-year 2017, the Company recorded net income of $371 million, or $1.28 per diluted share, compared to net income of $199 million, or $0.87 per diluted share, recorded in the prior year.\nFor the full-year 2017, adjusted EBITDA 1 was $513 million, compared to $374 million in 2016.\nAdjusted EBITDA 1 by Segment (in millions) U.S. Asia Pacific Corporate/ Iron Ore Iron Ore Other Total Q4 2017 Adjusted\nEBITDA 1 (in millions)\n$ 159.6 $ (3.4 ) $ (27.0 ) $ 129.2 2017 Adjusted\nEBITDA 1 (in millions)\n$ 559.4 $ 58.3 $ (104.9 ) $ 512.8 Lourenco Goncalves, Chairman, President and Chief Executive Officer, said: “Cleveland-Cliffs delivered in 2017 strong and sustainable financial results, and that was exactly what I promised one year ago. As a consequence of the several successful initiatives implemented in overall strategy, commercial, operations, and finance since I joined this great company in August of 2014, we have delivered in 2017 the second consecutive year of greater than 25 percent EBITDA growth.\" Mr. Goncalves added: \"2017 was also the year in which the industry finally woke up to the importance of both rational supply behavior and environmental compliance. This new, more logical approach to business should provide us solid support to deliver even stronger results in 2018.\"\nU.S. Iron Ore\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Volumes - In Thousands of Long Tons\nTotal sales volume 5,392 6,881 18,683 18,224 Total production volume 5,543 4,923 18,776 15,982 Sales Margin - In Millions\nRevenues from product sales and services $ 511.8 $ 579.0 $ 1,866.0 $ 1,554.5 Cost of goods sold and operating expenses 396.2 453.0 1,400.6 1,278.8 Sales margin $ 115.6 $ 126.0 $ 465.4 $ 275.7 Sales Margin - Per Long Ton\nRevenues from product sales and services* $ 83.38 $ 73.86 $ 88.03 $ 75.71 Cash cost of goods sold and operating expense rate 2 58.79 52.80 59.55 55.97 Depreciation, depletion and amortization 3.15 2.75 3.56 4.61 Cost of goods sold and operating expenses* 61.94 55.55 63.11 60.58 Sales margin $ 21.44 $ 18.31 $ 24.92 $ 15.13 *Excludes revenues and expenses related to domestic freight, which are offsetting and have no impact on sales margin. Revenues and expenses also exclude venture partner cost reimbursements. U.S. Iron Ore pellet sales volume in the fourth quarter of 2017 was 5.4 million long tons, a 22 percent decrease when compared with 6.9 million long tons sold in the fourth quarter of 2016. The decrease was a result of a stronger than historical shipping pace during the first nine months of 2017 leading to lower required fourth quarter shipments to meet full-year customer nominations, as well as the previously disclosed nomination reduction from a major customer.\nCash cost of goods sold and operating expense rate 2 in U.S. Iron Ore was $58.79 per long ton, up 11 percent from $52.80 per long ton in the prior year's fourth quarter. The increase was primarily driven by higher costs associated with maintenance and repairs, employee benefits, and energy rates.\nAsia Pacific Iron Ore\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Volumes - In Thousands of Metric Tons\nTotal sales volume 2,049 2,937 9,812 11,642 Total production volume 2,203 3,264 10,113 11,839 Sales Margin - In Millions\nRevenues from product sales and services $ 89.1 $ 175.0 $ 464.2 $ 554.5 Cost of goods sold and operating expenses 96.1 119.5 420.0 440.9 Sales margin $ (7.0 ) $ 55.5 $ 44.2 $ 113.6 Sales Margin - Per Metric Ton\nRevenues from product sales and services* $ 42.61 $ 57.30 $ 45.31 $ 45.85 Cash cost of goods sold and operating expense rate 2 44.56 36.40 39.35 33.94 Depreciation, depletion and amortization 1.46 2.01 1.46 2.16 Cost of goods sold and operating expenses* 46.02 38.41 40.81 36.10 Sales margin $ (3.41 ) $ 18.89 $ 4.50 $ 9.75 *Excludes revenues and expenses related to freight, which are offsetting and have no impact on sales margin. Fourth-quarter 2017 Asia Pacific Iron Ore sales volume of 2.0 million metric tons decreased 30 percent from the prior-year quarter. The decrease was driven primarily by lower production volumes, a result of operational decisions reflecting current market conditions and quality ore availability.\nCash cost of goods sold and operating expense rate 2 in Asia Pacific Iron Ore was $44.56 per metric ton in the fourth quarter of 2017, a 22 percent increase from $36.40 in the prior-year quarter. This was primarily attributable to increased mining costs, driven by a change in the overall production plan resulting in a higher strip ratio. It was also driven by increased logistics and unfavorable exchange rate variances.\nOther Income Statement Items\nCliffs' fourth-quarter 2017 SG&A expenses were $28 million. This represents a 22 percent decrease when compared to the fourth-quarter 2016 expenses of $36 million. The decrease was driven primarily by reduced incentive compensation.\nCliffs' net interest expense during the fourth quarter was $29 million, a 35 percent decrease when compared to the fourth-quarter 2016 expense of $44 million, as a result of capital structure optimization initiatives executed by the Company during 2017.\nCliffs recognized a $246 million income tax benefit during the quarter. This was primarily attributable to a reversal of the valuation allowance on approximately $250 million of Alternate Minimum Tax (AMT) credit carryovers. With the passage of the Tax Cuts and Jobs Act of 2017 and corresponding repeal of the AMT, this amount will be refunded to Cliffs in cash over the next four tax years.\nDebt and Cash Flow\nTotal capital expenditures during the quarter were $77 million, which included sustaining capital, preliminary spending related to the Hot-Briquetted Iron (HBI) project, and the acquisition of certain real estate interests located in Nashwauk, Minnesota (Nashwauk) from Glacier Park Iron Ore Properties LLC (GPIOP). The purchased and leased properties include parcels that were formerly leased by GPIOP to Mesabi Metallics Company LLC, formerly known as Essar Steel Minnesota.\nCash and cash equivalents at the end of the fourth quarter of 2017 totaled $1.0 billion, compared to $323 million at the end of the fourth quarter of 2016. Total debt at the end of the fourth quarter of 2017 was $2.3 billion, versus $2.2 billion at the end of the fourth quarter of 2016. At the end of the fourth quarter of 2017, including the impact of the transactions related to the ownership of Tilden, Empire, and Nashwauk, Cliffs had net debt 3 of $1.3 billion, compared to $1.8 billion of net debt 3 at the end of the fourth quarter of 2016.\nSegment Outlook\nAfter evaluating current and anticipated future market conditions in connection with the remaining iron ore reserves at Cliffs' APIO, including quality and the current market price for the ore, the Company has decided to accelerate the projected time frame for the planned closure of mining operations in Australia, which will more than likely occur in 2018. Accordingly, the Company will no longer provide guidance related to this business segment.\n2018 Outlook Summary Per Long Ton Information U.S. Iron Ore Revenues from product sales and services (A) $97 - $102 Cost of goods sold and operating expense rate $69 - $74 Less: Freight expense rate (B) $7 Depreciation, depletion & amortization rate $4 Cash cost of goods sold and operating expense rate 2 $58 - $63 Sales volume (million long tons) 20 Production volume (million long tons) 20 (A) This expectation is based on the assumption that iron ore prices, steel prices, and pellet premiums will average for the remainder of 2018 their respective year-to-date averages. (B) Freight has an offsetting amount in revenue and has no impact on sales margin. U.S. Iron Ore Outlook (Long Tons)\nBased on the assumption that iron ore prices, steel prices, and pellet premiums will average for the remainder of 2018 their respective year-to-date averages, Cliffs would realize USIO revenue rates in the range of $97 to $102 per long ton.\nAs previously disclosed, for 2018 Cliffs expects full-year sales and production volumes of approximately 20 million long tons from its U.S. Iron Ore business. This compares to 18.7 million long tons of sales and 18.8 million long tons of production in 2017.\nCliffs' full-year 2018 U.S. Iron Ore cash cost of goods sold and operating expense 2 expectation is $58 - $63 per long ton, which compares to $60 per long ton for the full-year 2017.\nSG&A Expenses and Other Expectations\nFull-year 2018 SG&A expenses are expected to be approximately $115 million. Cliffs also notes that of the $115 million expectation, approximately $20 million is considered non-cash. The increase compared to 2017 is partially attributable to an accounting change related to the reclassification of certain Pension/OPEB components.\nThe Company's full-year 2018 interest expense is expected to be approximately $130 million, compared to $132 million recorded in 2017. Consolidated full-year 2018 depreciation, depletion and amortization is expected to be approximately $100 million, incurred ratably throughout the year.\nCapital Expenditures\nCliffs' 2018 capital spending expectations are:\nApproximately $85 million in sustaining capital Approximately $250 million toward the HBI project in Toledo, OH (fully funded with the December 2017 financing transactions) Approximately $50 million toward the upgrade of the Northshore mine to produce up to 3.5 million long tons of DR-grade pellets a year\nConference Call Information\nCleveland-Cliffs Inc. will host a conference call this morning, January 25, 2018, at 10 a.m. ET. The call will be broadcast live and archived on Cliffs' website: www.clevelandcliffs.com\nAbout Cleveland-Cliffs Inc.\nFounded in 1847, Cleveland-Cliffs Inc. is the largest and oldest independent iron ore mining company in the United States. We are a major supplier of iron ore pellets to the North American steel industry from our mines and pellet plants located in Michigan and Minnesota. Additionally, we operate an iron ore mining complex in Western Australia. By 2020, Cliffs expects to be the sole producer of hot briquetted iron (HBI) in the Great Lakes region with the development of its first production plant in Toledo, Ohio. Driven by the core values of safety, social, environmental and capital stewardship, our employees endeavor to provide all stakeholders with operating and financial transparency. For more information, visit http://www.clevelandcliffs.com .\nForward-Looking Statements\nThis release contains statements that constitute \" \" within the meaning of the federal securities laws. As a general matter, relate to anticipated trends and expectations rather than historical matters. Forward-looking statements are subject to uncertainties and factors relating to Cliffs’ operations and business environment that are difficult to predict and may be beyond our control. Such uncertainties and factors may from those expressed or implied by the . These statements speak only as of the date of this release, and we undertake no ongoing obligation, other than that imposed by law, to update these statements. Uncertainties and risk factors that could affect Cliffs’ future performance and cause results to differ from the in this release include, but are not limited to: uncertainty and weaknesses in global economic conditions, including downward pressure on prices caused by oversupply or imported products, the impact of barriers to trade, the outcomes of trade cases, reduced market demand and any change to the economic growth rate in China; continued volatility of iron ore and steel prices and other trends, including the supply approach of the major iron ore producers, affecting our financial condition, results of operations or future prospects—specifically, the impact of price-adjustment factors on our sales contracts; our ability to successfully diversify our product mix and add new customers beyond our traditional blast furnace clientele, specifically successful completion of our HBI production plant; our level of indebtedness could limit cash flow available to fund working capital, capital expenditures, acquisitions and other general corporate purposes or ongoing needs of our business; availability of capital and our ability to maintain adequate liquidity; risks related to former and current international operations, including our ability to successfully conclude the CCAA process in Canada and plan for the end of mine life in Australia in a manner that minimizes cash outflows and associated liabilities; our actual economic iron ore reserves or changes in current mineral estimates, including whether any mineralized material qualifies as a reserve; the impact of our customers reducing their steel production due to increased market share of steel produced using other methods or lighter-weight steel alternatives; the ability of our customers, joint venture partners and significant suppliers and service providers to meet their obligations to us on a timely basis or at all; the outcome of any litigation or arbitration, including any contractual disputes with our customers, joint venture partners or significant energy, material or service providers; our ability to maintain satisfactory relations with unions and employees; impacts of existing and increasing governmental regulation and related costs and liabilities, including failure to receive or maintain required operating and environmental permits, approvals, modifications or other authorization of, or from, any governmental or regulatory entity and costs related to implementing improvements to ensure compliance with regulatory changes; problems or uncertainties with productivity, tons mined, transportation, capital spending, mine-closure obligations, environmental liabilities, employee-benefit costs and other risks of the mining industry; our ability to cost-effectively achieve planned production rates or levels, including at our HBI production plant; our ability to successfully identify and consummate any strategic investments or development projects, including our HBI production plant; changes in sales volume or mix; our ability to reach agreement with our customers regarding any modifications to sales contract provisions, renewals or new arrangements; events or circumstances that could impair or adversely impact the viability of a mine and the carrying value of associated assets, as well as any resulting impairment charges; uncertainties associated with natural disasters, weather conditions, unanticipated geological conditions, supply or price of energy, equipment failures and other unexpected events; adverse changes in currency values, currency exchange rates, interest rates and tax laws; uncertainty relating to restructurings in the steel industry and/or affecting the steel industry; and the potential existence of significant deficiencies or material weaknesses in our internal control over financial reporting.\nFor additional factors affecting the business of Cliffs, refer to Part I – Item 1A. Risk Factors of our Annual Report on Form 10-K for the year ended December 31, 2016. You are urged to carefully consider these risk factors.\nFINANCIAL TABLES FOLLOW\nCLEVELAND-CLIFFS INC. AND SUBSIDIARIES STATEMENTS OF UNAUDITED CONDENSED CONSOLIDATED OPERATIONS (In Millions, Except Per Share Amounts) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 REVENUES FROM PRODUCT SALES AND SERVICES Product $ 536.9 $ 676.5 $ 2,089.2 $ 1,913.5 Freight and venture partners' cost reimbursements 64.0 77.5 241.0 195.5 600.9 754.0 2,330.2 2,109.0 COST OF GOODS SOLD AND OPERATING EXPENSES (492.3 ) (572.5 ) (1,820.6 ) (1,719.7 ) SALES MARGIN 108.6 181.5 509.6 389.3 OTHER OPERATING INCOME (EXPENSE) Selling, general and administrative expenses (28.0 ) (36.0 ) (105.8 ) (117.8 ) Miscellaneous - net 24.7 (13.8 ) 27.7 (30.7 ) (3.3 ) (49.8 ) (78.1 ) (148.5 ) OPERATING INCOME\n105.3 131.7 431.5 240.8 OTHER INCOME (EXPENSE) Interest expense, net (28.9 ) (44.3 ) (132.0 ) (200.5 ) Gain (loss) on extinguishment/restructuring of debt — 2.2 (165.4 ) 166.3 Other non-operating income 0.9 — 3.2 0.4 (28.0 ) (42.1 ) (294.2 ) (33.8 ) INCOME FROM CONTINUING OPERATIONS BEFORE INCOME TAXES AND EQUITY LOSS FROM VENTURES 77.3 89.6 137.3 207.0 INCOME TAX BENEFIT 245.6 10.5 252.4 12.2 INCOME FROM CONTINUING OPERATIONS 322.9 100.1 389.7 219.2 LOSS FROM DISCONTINUED OPERATIONS, net of tax (5.1 ) (19.3 ) (18.7 ) (19.9 ) NET INCOME 317.8 80.8 371.0 199.3 INCOME (LOSS) ATTRIBUTABLE TO NONCONTROLLING INTEREST — (1.7 ) 3.9 (25.2 ) NET INCOME ATTRIBUTABLE TO CLIFFS SHAREHOLDERS $ 317.8 $ 79.1 $ 374.9 $ 174.1 EARNINGS (LOSS) PER COMMON SHARE ATTRIBUTABLE TO CLIFFS SHAREHOLDERS - BASIC Continuing operations $ 1.09 $ 0.43 $ 1.36 $ 0.98 Discontinued operations (0.02 ) (0.08 ) (0.06 ) (0.10 ) $ 1.07 $ 0.35 $ 1.30 $ 0.88 EARNINGS (LOSS) PER COMMON SHARE ATTRIBUTABLE TO CLIFFS SHAREHOLDERS - DILUTED Continuing operations $ 1.07 $ 0.42 $ 1.34 $ 0.97 Discontinued operations (0.02 ) (0.08 ) (0.06 ) (0.10 ) $ 1.05 $ 0.34 $ 1.28 $ 0.87 AVERAGE NUMBER OF SHARES (IN THOUSANDS) Basic 296,429 231,273 288,435 197,659 Diluted 300,858 234,640 292,961 200,145 CLEVELAND-CLIFFS INC. AND SUBSIDIARIES STATEMENTS OF UNAUDITED CONDENSED CONSOLIDATED FINANCIAL POSITION (In Millions) December 31, 2017 2016 ASSETS\nCURRENT ASSETS Cash and cash equivalents $ 1,007.7 $ 323.4 Accounts receivable, net 140.6 128.7 Inventories 183.4 178.4 Supplies and other inventories 93.9 91.4 Derivative assets 39.4 33.1 Loans to and accounts receivables from the Canadian Entities 51.6 48.6 Other current assets 28.0 21.0 TOTAL CURRENT ASSETS 1,544.6 824.6 PROPERTY, PLANT AND EQUIPMENT, NET 1,051.0 984.4 Income tax receivable 235.3 — Other non-current assets 122.5 114.9 TOTAL ASSETS $ 2,953.4 $ 1,923.9 LIABILITIES\nCURRENT LIABILITIES Accounts payable $ 127.7 $ 107.6 Accrued employment costs 56.1 56.1 State and local taxes payable 30.2 28.3 Accrued expenses 33.7 41.1 Accrued interest 31.4 40.2 Accrued royalties 17.3 26.2 Contingent claims 55.6 — Partnership distribution payable 44.2 8.7 Other current liabilities 56.0 82.9 TOTAL CURRENT LIABILITIES 452.2 391.1 POSTEMPLOYMENT BENEFIT LIABILITIES Pensions 222.8 245.7 Other postretirement benefits 34.9 34.8 TOTAL POSTEMPLOYMENT BENEFIT LIABILITIES 257.7 280.5 ENVIRONMENTAL AND MINE CLOSURE OBLIGATIONS 188.5 193.9 LONG-TERM DEBT 2,304.2 2,175.1 OTHER LIABILITIES 186.9 213.8 TOTAL LIABILITIES 3,389.5 3,254.4 EQUITY\nCLIFFS SHAREHOLDERS' DEFICIT (436.3 ) (1,464.3 ) NONCONTROLLING INTEREST 0.2 133.8 TOTAL DEFICIT (436.1 ) (1,330.5 ) TOTAL LIABILITIES AND DEFICIT $ 2,953.4 $ 1,923.9 CLEVELAND-CLIFFS INC. AND SUBSIDIARIES STATEMENTS OF UNAUDITED CONDENSED CONSOLIDATED CASH FLOWS (In Millions) Year Ended December 31, 2017 2016 OPERATING ACTIVITIES Net income $ 371.0 $ 199.3 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation, depletion and amortization 87.7 115.4 Loss (gain) on extinguishment/restructuring of debt 165.4 (166.3 ) Loss on deconsolidation, net of cash deconsolidated 20.2 17.5 Other 12.9 10.0 Changes in operating assets and liabilities: Receivables and other assets (248.6 ) 43.2 Product inventories (1.8 ) 157.8 Payables and accrued expenses (68.9 ) (73.9 ) Net cash provided by operating activities 337.9 303.0 INVESTING ACTIVITIES Purchase of property, plant and equipment (155.7 ) (69.1 ) Other investing activities (4.3 ) 11.2 Net cash used by investing activities (160.0 ) (57.9 ) FINANCING ACTIVITIES Net proceeds from issuance of common shares 661.3 287.4 Proceeds from issuance of debt 1,771.5 — Debt issuance costs (28.2 ) (5.2 ) Borrowings under credit facilities — 105.0 Repayment under credit facilities — (105.0 ) Repayments of equipment loans — (95.6 ) Repurchase of debt (1,720.7 ) (305.4 ) Acquisition of noncontrolling interest (105.0 ) — Distributions of partnership equity (49.1 ) (59.9 ) Other financing activities (26.7 ) (27.7 ) Net cash provided (used) by financing activities 503.1 (206.4 ) EFFECT OF EXCHANGE RATE CHANGES ON CASH 3.3 (0.5 ) INCREASE IN CASH AND CASH EQUIVALENTS 684.3 38.2 CASH AND CASH EQUIVALENTS AT BEGINNING OF YEAR 323.4 285.2 CASH AND CASH EQUIVALENTS AT END OF YEAR $ 1,007.7 $ 323.4 1 CLEVELAND-CLIFFS INC. AND SUBSIDIARIES\nNON-GAAP RECONCILIATION - EBITDA AND ADJUSTED EBITDA\nIn addition to the consolidated financial statements presented in accordance with U.S. GAAP, the Company has presented EBITDA and adjusted EBITDA on both a consolidated basis and on a segment basis, which are non-GAAP financial measures that management uses in evaluating operating performance. The presentation of these measures is not intended to be considered in isolation from, as a substitute for, or as superior to, the financial information prepared and presented in accordance with U.S. GAAP. The presentation of these measures may be different from non-GAAP financial measures used by other companies. A reconciliation of these consolidated measures to their most directly comparable GAAP measures is provided in the table below.\n(In Millions) (In Millions) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Net Income $ 317.8 $ 80.8 $ 371.0 $ 199.3 Less: Interest expense, net (28.9 ) (44.3 ) (132.0 ) (200.5 ) Income tax benefit (expense) 245.6 10.5 252.4 12.2 Depreciation, depletion and amortization (21.4 ) (26.5 ) (87.7 ) (115.4 ) EBITDA $ 122.5 $ 141.1 $ 338.3 $ 503.0 Less: Gain (loss) on extinguishment/restructuring of debt — 2.2 (165.4 ) 166.3 Impact of discontinued operations (5.1 ) (19.3 ) (18.7 ) (19.9 ) Foreign exchange remeasurement 0.2 (15.6 ) 11.4 (16.8 ) Severance and contractor termination costs — — — (0.1 ) Supplies inventory adjustment (1.8 ) — (1.8 ) — Adjusted EBITDA 129.2 173.8 512.8 373.5 2 CLEVELAND-CLIFFS INC. AND SUBSIDIARIES\nNON-GAAP RECONCILIATION EXPLANATIONS\nThe Company presents cash cost of goods sold and operating expense rate per long/metric ton, which is a non-GAAP financial measure that management uses in evaluating operating performance. Cliffs believes the presentation of non-GAAP cash cost of goods sold and operating expenses is useful to investors because it excludes depreciation, depletion and amortization, which are non-cash, and freight and venture partners' cost reimbursements, which have no impact on sales margin, thus providing a more accurate view of the cash outflows related to the sale of iron ore. The presentation of this measure is not intended to be considered in isolation from, as a substitute for, or as superior to, the financial information prepared and presented in accordance with U.S. GAAP. The presentation of this measure may be different from non-GAAP financial measures used by other companies.\n(In Millions) Three Months Ended December 31, Three Months Ended December 31, 2017 2016 U.S. Iron Asia Pacific U.S. Iron Asia Pacific Ore Iron Ore Total Ore Iron Ore Total Cost of goods sold and operating expenses $ (396.2 ) $ (96.1 ) $ (492.3 ) $ (453.0 ) $ (119.5 ) $ (572.5 ) Less: Freight and reimbursements (62.2 ) (1.8 ) (64.0 ) (70.8 ) (6.7 ) (77.5 ) Depreciation, depletion & amortization (17.0 ) (3.0 ) (20.0 ) (18.9 ) (5.9 ) (24.8 ) Cash cost of goods sold and operating expenses $ (317.0 ) $ (91.3 ) $ (408.3 ) $ (363.3 ) $ (106.9 ) $ (470.2 ) (In Millions) Year Ended December 31, Year Ended December 31, 2017 2016 U.S. Iron Asia Pacific U.S. Iron Asia Pacific Ore Iron Ore Total Ore Iron Ore Total Cost of goods sold and operating expenses $ (1,400.6 ) $ (420.0 ) $ (1,820.6 ) $ (1,278.8 ) $ (440.9 ) $ (1,719.7 ) Less: Freight and reimbursements (221.4 ) (19.6 ) (241.0 ) (174.8 ) (20.7 ) (195.5 ) Depreciation, depletion & amortization (66.6 ) (14.3 ) (80.9 ) (84.0 ) (25.1 ) (109.1 ) Cash cost of goods sold and operating expenses $ (1,112.6 ) $ (386.1 ) $ (1,498.7 ) $ (1,020.0 ) $ (395.1 ) $ (1,415.1 ) 3 NET DEBT RECONCILIATION\nNet debt is a non-GAAP financial measure that management uses in evaluating financial position. The presentation of this measure is not intended to be considered in isolation from, as a substitute for, or as superior to, the financial information prepared and presented in accordance with U.S. GAAP. The presentation of this measure may be different from non-GAAP financial measures used by other companies. Net debt is defined as long-term debt plus the current portion of short term debt, less cash and cash equivalents and undiscounted interest. A reconciliation of this measure to its most directly comparable GAAP measure is provided in the table below.\n(In Millions) December 31, December 31, 2017 2016 Long-term debt $ 2,304.2 $ 2,175.1 Short-term debt and current portion of long-term debt — 17.5 Total Debt $ 2,304.2 $ 2,192.6 Less: Cash and cash equivalents 1,007.7 323.4 Undiscounted interest — 65.7 Net Debt $ 1,296.5 $ 1,803.5\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005357/en/\nCleveland-Cliffs Inc.\nMEDIA CONTACT:\nPatricia Persico, 216-694-5316\nDirector, Global Communications\nor\nINVESTOR CONTACT:\nPaul Finan, 216-694-6544\nDirector, Investor Relations\nSource: Cleveland-Cliffs Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clevelandcliffs.com&esheet=51748592&newsitemid=20180125005357&lan=en-US&anchor=http%3A%2F%2Fwww.clevelandcliffs.com&index=2&md5=e0de962403b4c14afe81c7e6c6ee66b8", "http://www.businesswire.com/news/home/20180125005357/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clevelandcliffs.com&esheet=51748592&newsitemid=20180125005357&lan=en-US&anchor=www.clevelandcliffs.com&index=1&md5=e4ea369bb3ac4a74bd9d67a8abc20faa"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:36:01.000+02:00", "highlightTitle": ""}