{"organizations": [], "uuid": "0ab9449b7758f0ed6202ba8ad74171695552a79e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-foreign-fishermen-settle-human-trafficking-suit.html", "country": "US", "domain_rank": 767, "title": "Foreign fishermen settle human trafficking suit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T10:15:00.000+02:00", "replies_count": 0, "uuid": "0ab9449b7758f0ed6202ba8ad74171695552a79e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-foreign-fishermen-settle-human-trafficking-suit.html", "ord_in_thread": 0, "title": "Foreign fishermen settle human trafficking suit", "locations": [], "entities": {"persons": [{"name": "sorihin", "sentiment": "none"}, {"name": "abdul fatah", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A human trafficking lawsuit just settled between two Indonesian fishermen and an American boat owner will not impact nearly 800 other foreign fishermen in Hawaii's fleet who are banned from leaving boats when the vessels reach shore, industry officials say.\nThe 130 commercial fishing boats based in Honolulu rely almost entirely on foreign crews from impoverished Southeast Asian and Pacific countries who have no legal standing and never set foot in the U.S.\nAn Associated Press investigation into the Hawaiian fleet in 2016 found men living in squalor on some boats, forced to use buckets instead of toilets, suffering sores from bed bugs and sometimes lacking sufficient food.\nWhile many workers covet the jobs which pay more than they could earn back home, two Indonesian fishermen — Sorihin, who uses just one name, and Abdul Fatah — ran away from their boat, the Sea Queen II, in 2009 when it was unloading its catch at San Francisco's Fisherman's Wharf.\nEventually, federal officials issued each of them a special visa designated for victims of human trafficking, and in 2015 they sued the boat owner, claiming they were denied medical treatment, verbally abused and threatened with hefty fees if they tried to leave. The settlement was disclosed Wednesday.\nThe settlement, for an undisclosed sum, requires workers on the Sea Queen II and its sister vessel to receive detailed codes of conduct outlining their rights and ways to get help if needed. Crews on the two boats must have at least 77 hours of rest a week and access to their passports.\nIt doesn't impact all of the other commercial fishing boats in Hawaii and California, but attorney Agnieska Fryszman said it should act as a wakeup call to the industry.\n\"There's simply no excuse for turning a blind eye to human trafficking, and we look forward to continuing our efforts to hold others in the industry accountable,\" she said.\nHer client Sorihin, who now drives for a ride-share company and lives with his family in the San Francisco Bay Area, said in an email that the settlement has given him \"a sense of peace.\"\n\"I hope it will bring better treatment to seamen on the Sea Queen and in the fishing industry,\" he said.\nKen Bass, Nguyen's son-in-law who is acting as his attorney, said it wasn't a case of human trafficking and instead was a contract mix-up between labor brokers in Indonesia and a Hawaiian recruiter acting as a middleman.\n\"So they basically had different contracts but no one at the time knew that, so that's immediately going to lead to misunderstanding,\" Bass said. \"If anybody was culpable, it was the broker in Indonesia.\"\nHawaii state legislator Kaniela Ing, who has pushed for legal protections for the fishermen, said more needs to be done.\n\"You've got to remember the plaintiffs in this case had to run off the docks and through the town, risking their livelihoods,\" he said. \"This is obviously a bigger problem than this isolated case, so how can we create a policy that can protect all workers on these vessels?\"\nJim Cook at the Hawaii Longline Association, which represents boat owners, said the settlement outlines common sense items that are standard in the fleet, \"so we don't see any impact.\"\nCook said the association is preparing its own code of conduct to distribute to boat owners.\nHawaii's entire elected delegation in Washington is supporting federal legislation that would allow fishermen to get visas so they could come onshore when they're not fishing.\nSen. Mazie Hirono said the lawsuit underscores concerns surrounding some people in the longline fishing industry.\n\"My legislation would provide transparency and sustainability for good actors in Hawaii's longline fishing industry, while protecting foreign workers and holding bad actors accountable,\" she said.\nBruce Anderson, the administrator for the Hawaiian department that issues fishing licenses to foreign fishermen, said the settlement addresses many of the issues raised by those concerned about the treatment and conditions on some 130 longline vessels in Hawaii.\n\"It may be a good model for employment contracts with fishermen on longline vessels based here in Hawaii,\" he said.\nAssociated Press writer Margie Mason contributed to this report.\nRead the entire AP series on abuses in the fishing industry: https://www.ap.org/explore/seafood-from-slaves", "external_links": [], "published": "2018-01-04T10:15:00.000+02:00", "crawled": "2018-01-04T16:13:25.008+02:00", "highlightTitle": ""}