{"organizations": [], "uuid": "746fe3247159158e4c751fba483c864b0e85b1f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221381276&w=1200&r=LYNXMPEE0B0EW", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-china-delta/china-demands-public-apology-from-delta-for-listing-taiwan-tibet-as-countries-idUSKBN1F10RC", "country": "US", "domain_rank": 408, "title": "China demands public apology from Delta for listing Taiwan, Tibet as countries", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:18:00.000+02:00", "replies_count": 0, "uuid": "746fe3247159158e4c751fba483c864b0e85b1f6"}, "author": "", "url": "https://www.reuters.com/article/us-china-delta/china-demands-public-apology-from-delta-for-listing-taiwan-tibet-as-countries-idUSKBN1F10RC", "ord_in_thread": 0, "title": "China demands public apology from Delta for listing Taiwan, Tibet as countries", "locations": [], "entities": {"persons": [{"name": "brenda goh", "sentiment": "none"}, {"name": "john ruwitch", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "tibet", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "delta", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "civil aviation administration of china", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 8:20 AM / Updated 7 hours ago China cracks down on foreign companies calling Taiwan, other regions countries Brenda Goh , John Ruwitch 5 Min Read \nSHANGHAI (Reuters) - China’s aviation authority on Friday demanded an apology from Delta Air Lines ( DAL.N ) for listing Taiwan and Tibet as countries on its website, while another government agency took aim at Inditex-owned ( ITX.MC ) fashion brand Zara and medical device maker Medtronic Plc ( MDT.N ) for similar issues. \nThe moves follow a regulator’s decision on Thursday to suspend Marriott International Inc’s ( MAR.O ) Chinese website for a week to punish the world’s biggest hotel chain for listing Tibet, Taiwan, Hong Kong and Macau as separate countries in a customer questionnaire. \nThe apparent intensification of efforts to police how foreign businesses refer to Chinese-claimed territories - even if only in pull-down menus - underscores just how sensitive the issue of sovereignty has become in a China that is increasingly emboldened on the international stage. \nThe involvment of more than one Chinese authority in rebuking businesses across different industries suggested possible coordination at a high level of government. \n“It’s hard not to see it as part of the wider trend where nationalist issues are being emphasized very deliberately as part of the new era,” said a China-based Western businessman who declined to be identified due to the sensitivity of the topic. \n“It’s hard not to think that this is the shape of things to come for foreign companies, having to be even more careful about these sensitivities.” \nHong Kong and Macau are former European colonies that are now part of China but run largely autonomously. China annexed Tibet in 1950, although Beijing has long claimed the Himalayan region has been an indivisible part of China throughout history. \nTaiwan is China’s most sensitive territorial issue. The ruling Communist Party considers the self-ruled, democratic island a wayward province and refuses to renounce the threat of force to bring it into the fold. \nOn Friday, the Civil Aviation Administration of China asked Delta to investigate the listing of Taiwan and Tibet as countries on its website, and called for an “immediate and public” apology. FILE PHOTO: A Delta Airlines plane is seen at a gate in San Diego, California, U.S., January 10, 2018. REUTERS/Mike Blake/File Photo \nThe aviation authority also said it would require all foreign airlines operating routes to China to conduct comprehensive investigations of their websites, apps and customer-related information and “strictly comply with China’s laws and regulations to prevent a similar thing from happening”. \nIn a statement, Delta apologized for making “an inadvertent error with no business or political intention”, saying it recognized the seriousness of the issue and had taken steps to resolve it. \nSeparately, the same regulator that penalized Marriott - the Shanghai branch of the state cyberspace administration - accused Zara of placing Taiwan in a pull-down list of countries on its Chinese website. \nMedtronic had also put “Republic of China (Taiwan)” on one of its websites, the office said in a WeChat post, giving both companies until 6 pm local time to apologize. \nMedtronic issued an apology via social media, saying it had updated the website. An executive who answered the phone at Zara’s Shanghai office was not able to immediately comment. \nChina has long-running territorial disputes with several neighbors and has never been shy about correcting what it sees as misrepresentations of Chinese territory. \nForeign ministry spokesman Lu Kang told a regular briefing on Friday that Hong Kong, Macau, Taiwan and Tibet were all part of China. \n“The companies that come to China should respect China’s sovereignty and territorial integrity, abide by China’s laws, and respect the feelings of the Chinese people. This is the minimum requirement of any company going to another country to carry out business and investment,” he said. \nLast year, German carmaker Audi AG apologized for using a map that excluded Taiwan and parts of Tibet and the western Xinjiang region after it was heavily crticized on Chinese social media. Reporting by Brenda Goh and John Ruwitch; Additional Reporting by Christian Shepherd in BEIJING and SHANGHAI Newsroom; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-12T10:18:00.000+02:00", "crawled": "2018-01-12T10:36:33.024+02:00", "highlightTitle": ""}