{"organizations": [], "uuid": "bc2a6ee3cf13e71f39f17622babdcdc1df88cd88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-hunt-companies-inc-announces-pricing-of-600-million-senior-secured-notes-due-2026.html", "country": "US", "domain_rank": 767, "title": "Hunt Companies, Inc. Announces Pricing of $600 Million Senior Secured Notes Due 2026", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T01:00:00.000+02:00", "replies_count": 0, "uuid": "bc2a6ee3cf13e71f39f17622babdcdc1df88cd88"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-hunt-companies-inc-announces-pricing-of-600-million-senior-secured-notes-due-2026.html", "ord_in_thread": 0, "title": "Hunt Companies, Inc. Announces Pricing of $600 Million Senior Secured Notes Due 2026", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "el paso", "sentiment": "negative"}, {"name": "hunt companies, inc.", "sentiment": "neutral"}, {"name": "hunt companies, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EL PASO, Texas--(BUSINESS WIRE)-- Hunt Companies, Inc. (the “Company”) announced today that it priced $600 million aggregate principal amount of 6.250% Senior Secured Notes due 2026 (the “Notes”) at an issue price of 100.000%. The offering was upsized from the previously announced $550 million aggregate principal amount. The offering is expected to close on February 2, 2018 subject to customary closing conditions. The Notes will mature on February 15, 2026.\nThe Notes are being offered by the initial purchasers only to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”), and to persons outside of the United States in compliance with Regulation S under the Securities Act. The Notes will not be registered under the Securities Act or any state securities laws and may not be offered or sold in the United States absent an effective registration statement, an applicable exemption from registration requirements or in a transaction not subject to the registration requirements of the Securities Act or any state securities laws.\nThe Company intends to use the net proceeds from the offering of the Notes, together with cash on hand, to fund the redemption of its 9.625% Senior Secured Notes due 2021 and the repayment of its existing revolving credit facility, as well as related fees and expenses. The Company intends to use any remaining amount of net proceeds for general corporate purposes.\nThis announcement does not constitute an offer to sell or a solicitation of an offer to buy any securities nor will there be any sales of the Notes in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Hunt Companies, Inc.\nFounded in 1947, Hunt Companies, Inc. is today a holding company that invests in businesses focused in the real estate and infrastructure markets. The activities of Hunt’s affiliates and investees include investment management, mortgage banking, direct lending, loan servicing, asset management, property management, development, construction, consulting and advisory. To learn more about Hunt, please visit www.huntcompanies.com .\nCautionary Statement Regarding Forward‐Looking Information\nThis communication includes, and oral statements made by our representatives from time to time may include, statements that are, or may be deemed to be, “forward‐looking statements.” Forward‐looking statements are statements that are not historical facts. These statements can be identified by the use of forward‐looking terminology such as “believe,” “expect,” “may,” “will,” “should,” “project,” “could,” “plan,” “goal,” “potential,” “pro forma,” “seek,” “intend” or “anticipate” or the negative thereof or comparable terminology, and include discussions of strategy, financial projections, guidance and estimates (including their underlying assumptions), statements regarding plans, objectives, expectations or consequences of announced transactions, and statements about the future performance, operations, products and services of the Company and its subsidiaries. The Company cautions readers not to place undue reliance on these statements. These forward‐looking statements are subject to a variety of risks and uncertainties. Consequently, actual results and experience may materially differ from those contained in any forward‐ looking statements. Any forward‐looking statements in this communication are based upon information available to the Company on the date of this release. The Company does not undertake to publicly update or revise its forward‐looking statements even if experience or future changes make it clear that any statements expressed or implied therein will not be realized.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005665/en/\nHunt Companies, Inc.\nStu Milam, 915-298‐4382\nSenior Vice President – Investor Accounting Services\nStuart.milam@huntcompanies.com\nSource: Hunt Companies, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180126005665/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.huntcompanies.com&esheet=51749789&newsitemid=20180126005665&lan=en-US&anchor=www.huntcompanies.com&index=1&md5=b400742ce6e1269c96eda301fc1b4735"], "published": "2018-01-27T01:00:00.000+02:00", "crawled": "2018-01-27T02:07:01.009+02:00", "highlightTitle": ""}