{"organizations": [], "uuid": "e3acabbd647f042cef1e141e2378f34aec2daa48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-patrick-industries-inc-announces-proposed-offering-of-125-million-convertible-senior-notes-due-2023.html", "country": "US", "domain_rank": 767, "title": "Patrick Industries, Inc. Announces Proposed Offering of $125 Million Convertible Senior Notes Due 2023", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:05:00.000+02:00", "replies_count": 0, "uuid": "e3acabbd647f042cef1e141e2378f34aec2daa48"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-patrick-industries-inc-announces-proposed-offering-of-125-million-convertible-senior-notes-due-2023.html", "ord_in_thread": 0, "title": "Patrick Industries, Inc. Announces Proposed Offering of $125 Million Convertible Senior Notes Due 2023", "locations": [], "entities": {"persons": [], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}], "organizations": [{"name": "patrick industries, inc.", "sentiment": "neutral"}, {"name": "patrick industries, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Jan. 16, 2018 /PRNewswire/ -- Patrick Industries, Inc. (NASDAQ: PATK) (\"Patrick\" or the \"Company\") today announced its intention to offer, subject to market conditions and other factors, $125 million aggregate principal amount of its convertible senior notes due 2023 (the \"Convertible Notes\") in a private placement to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"). The Company also expects to grant the initial purchasers of the Convertible Notes a 30-day option to purchase up to an additional $18.75 million aggregate principal amount of the Convertible Notes, solely to cover over-allotments, if any.\nThe Convertible Notes are expected to pay interest semiannually in arrears and can be convertible into cash, shares of the Company's common stock or a combination thereof, at the Company's election, based on a conversion rate to be determined. The Convertible Notes will mature on February 1, 2023 unless earlier purchased or converted. Prior to August 1, 2022, the Convertible Notes may be converted at the option of the holders only upon the occurrence of specified events and during certain periods, and thereafter until the close of business on the second scheduled trading day immediately preceding the maturity date, the Convertible Notes may be converted at any time. The interest rate, initial conversion rate and other terms of the Convertible Notes are to be determined upon pricing of the offering by negotiations between the Company and the initial purchasers of the Convertible Notes.\nIn connection with the offering, the Company expects to enter into convertible note hedge transactions with one or more of the initial purchasers of the Convertible Notes or their respective affiliates (in this capacity, the \"option counterparties\"). The Company also expects to enter into warrant transactions with the option counterparties. The convertible note hedge transactions are expected generally to reduce potential dilution to the Company's common stock upon any conversion of the Convertible Notes and/or offset any cash payments the Company is required to make in excess of the principal amount of converted Convertible Notes, as the case may be. However, the warrant transactions could separately have a dilutive effect to the extent that the market value per share of the Company's common stock exceeds upon expiration the applicable strike price of the warrants.\nIn connection with establishing their initial hedges of the convertible note hedge and warrant transactions, the option counterparties or their respective affiliates expect to enter into various derivative transactions with respect to the Company's common stock concurrently with or shortly after the pricing of the Convertible Notes. This activity could increase (or reduce the size of any decrease in) the market price of the Company's common stock or the Convertible Notes at that time. In addition, the option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to the Company's common stock and/or purchasing or selling the Company's common stock or other securities of the Company in secondary market transactions following the pricing of the Convertible Notes and prior to the maturity of the Convertible Notes (and are likely to do so during any observation period related to a conversion of Convertible Notes). This activity could also cause or avoid an increase or a decrease in the market price of the Company's common stock or the Convertible Notes, which could affect the ability of noteholders to convert the Convertible Notes and, to the extent the activity occurs during any observation period related to a conversion of Convertible Notes, it could affect the number of shares and value of the consideration that a noteholder will receive upon conversion of the Convertible Notes.\nThe Company intends to use a portion of the net proceeds from this offering to pay the cost of the convertible note hedge transactions that the Company expects to enter into with the option counterparties, after such cost is partially offset by the proceeds to the Company from the warrant transactions that the Company intends to enter into with the option counterparties. The Company intends to use the remainder of the net proceeds from this offering in alignment with its capital allocation strategy, which includes funding future potential acquisitions, investing in its infrastructure through strategic capital expenditures and expansions, and for general corporate purposes. Pending these uses, the Company intends to use the remainder of the net proceeds from this offering to repay a portion of the amounts due under its current credit facility.\nIf the initial purchasers exercise their option to purchase additional Convertible Notes, the Company expects to sell additional warrants to the option counterparties and use a portion of the net proceeds from the sale of the additional Convertible Notes, together with the proceeds from the sale of the additional warrants, to enter into additional convertible note hedge transactions with the option counterparties. Any remaining proceeds will be used for the purposes as described above.\nThe offer and sale of the Convertible Notes are not being registered under the Securities Act, or the securities laws of any other jurisdiction. The Convertible Notes may not be offered or sold in the United States except in transactions exempt from, or not subject to, the registration requirements of the Securities Act and any applicable state securities laws.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. Any offers of the Convertible Notes will be made only by means of a private offering memorandum. The Convertible Notes being offered have not been approved or disapproved by any regulatory authority, nor has any such authority passed upon the accuracy or adequacy of the applicable private offering memorandum.\nPatrick Industries, Inc.\nPatrick Industries, Inc. is a major manufacturer of component products and distributor of building products serving the recreational vehicle, manufactured housing, marine, kitchen cabinet, office and household furniture, fixtures and commercial furnishings, and other industrial markets and operates coast-to-coast through locations in 20 states and in China. Patrick's major manufactured products include decorative vinyl and paper laminated panels, countertops, fabricated aluminum products, wrapped profile mouldings, slide-out trim and fascia, cabinet doors and components, hardwood furniture, fiberglass bath fixtures and tile systems, thermoformed shower surrounds, specialty bath and closet building products, fiberglass and plastic helm systems and component products, wiring and wire harnesses, electrical systems components including instrument and dash panels, softwoods lu", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/patrick-industries-inc-announces-proposed-offering-of-125-million-convertible-senior-notes-due-2023-300583506.html"], "published": "2018-01-17T00:05:00.000+02:00", "crawled": "2018-01-16T23:44:08.000+02:00", "highlightTitle": ""}