{"organizations": [], "uuid": "fa92c8228238877be168009add2fdfe330fb3b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-bank-of-the-james-announces-fourth-quarter-12-months-2017-financial-results-and-declaration-of-dividend.html", "country": "US", "domain_rank": 767, "title": "Bank of the James Announces Fourth Quarter, 12 Months 2017 Financial Results and Declaration of Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.048, "site_type": "news", "published": "2018-01-26T20:00:00.000+02:00", "replies_count": 0, "uuid": "fa92c8228238877be168009add2fdfe330fb3b23"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-bank-of-the-james-announces-fourth-quarter-12-months-2017-financial-results-and-declaration-of-dividend.html", "ord_in_thread": 0, "title": "Bank of the James Announces Fourth Quarter, 12 Months 2017 Financial Results and Declaration of Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "lynchburg", "sentiment": "none"}, {"name": "harrisonburg", "sentiment": "none"}, {"name": "charlottesville", "sentiment": "none"}, {"name": "lynchburg", "sentiment": "none"}, {"name": "roanoke", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "james announces fourth quarter", "sentiment": "negative"}, {"name": "bank of the james financial group, inc.", "sentiment": "neutral"}, {"name": "bank", "sentiment": "none"}, {"name": "bank of the james", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LYNCHBURG, Va., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Bank of the James Financial Group, Inc. (the “Company”) (NASDAQ:BOTJ), the parent company of Bank of the James, a full-service commercial and retail bank serving the greater Lynchburg area (Region 2000), and the Charlottesville, Harrisonburg, and Roanoke, Virginia markets, today announced unaudited results for the three months and 12 months ended December 31, 2017.\nNet income for the three months ended December 31, 2017 was $360,000 or $0.08 per diluted share compared with $293,000 or $0.07 per diluted share for the three months ended December 31, 2016. Net income for the 12 months ended December 31, 2017 was $2.92 million or $0.67 per diluted share compared with $3.29 million or $0.75 per diluted share for the 12 months ended December 31, 2016. Results for the quarter and year ended December 31, 2017 include a one-time income tax expense related to a reduction in the value of the Bank’s deferred tax asset of $878,000 resulting from the reduction in corporate income tax rates in the recently passed Tax Cuts and Jobs Act.\nHighlights\nContinued growth in commercial and construction lending contributed to a 12% growth of interest income from earning assets in the fourth quarter of 2017 compared with the fourth quarter of 2016, and a 10% increase for the year ended December 31, 2017 compared with a year earlier. Net interest income before provision for loan losses rose 10% for the fourth quarter of 2017 and 8% for the 12 months of 2017 compared to the same periods of 2016. Total noninterest income in the fourth quarter of 2017 rose 18% compared with the fourth quarter of 2016, primarily reflecting increasing fee income from business-related electronic treasury management services and growth in gains on sale of residential mortgage loans, particularly in the second half of 2017. Income before income taxes was $1.63 million for the three months ended December 31, 2017 compared with $399,000 for the three months ended December 31, 2016. For the 12 months ended December 31, 2017, income before income taxes was $5.36 million compared with $4.81 million for the 12 months ended December 31, 2016. Deposits increased to a Company-record $567.49 million, up 8%, led by a 20% year-over-year growth in noninterest bearing demand deposits. Total assets were a Company-record $626.34 million at December 31, 2017, up 9% from year-end 2016. Asset quality ratios remained strong, reflecting loan portfolio strength. Increased shareholder value was reflected in year-over-year growth in book value per share, a 5% higher stockholders’ equity, and an 18% rise in retained earnings. Based on the results achieved in the fourth quarter, on January 16, 2018 the Company’s board of directors approved a $0.06 per share dividend payable to stockholders of record on March 9, 2018, to be paid on March 23, 2018. In addition, the new full-service branch in Appomattox, Virginia opened in the fourth quarter of 2017.\nRobert R. Chapman III, President and CEO, commented: “The Company’s fourth quarter operating results demonstrated solid year-over-year growth in commercial lending, and higher interest and noninterest income driven by investments the Company has made in market expansion, growing commercial banking, and a larger team.\n“The second half of 2017, in particular, reflected the progress made to generate increased revenue and consistent pre-tax earnings. The changes in the tax law resulted in a write-down to our deferred tax asset. The income tax expense related to the one-time impact of the tax reform amounted to $0.20 per share in the fourth quarter, which evidences that our fourth quarter earnings of $0.08 per share was a strong follow up to the third quarter of 2017 EPS of $0.23, where we began to see to the positive impact of our investment in growing the Company.\n“Lending activity, use of treasury services, deposit growth and increased interest income and fee income all reflected the traction we are gaining. We were pleased with deposit growth, and particularly noninterest-bearing deposits that are frequently part of commercial banking relationships. Strong residential mortgage originations in the fourth quarter of 2017 reflected increased activity throughout our franchise, and was a highlight of a quarter in which housing markets are typically quiet.\n“We entered the new year with a robust commercial loan pipeline and numerous client relationship opportunities, giving us confidence that we will continue building momentum of 2017.”\nFourth Quarter 2017 Operational Review\nTotal interest income was $6.24 million in the fourth quarter of 2017, up 12% from a year earlier, primarily reflecting consistent commercial and construction loan growth. On a consecutive quarter basis, interest income was $5.51 million in the first quarter of 2017, $5.85 million in the second quarter of 2017, and $6.07 million in the third quarter of the year. The average rate earned on loans, including fees, was 4.54% in the fourth quarter of 2017.\n“The lending environment remains competitive and interest rates low, however, we have maintained relative rate stability throughout the Company’s loan portfolio and met our goal of keeping average loan rates above 4% ,” Chapman noted. “The Federal Reserve has given signs of additional rate increases in the near future. A significant portion of our commercial loan portfolio varies with the prime rate, and therefore upward rate adjustments would positively impact our interest rate income.”\nTotal interest expense was $825,000 in the fourth quarter of 2017 compared with $636,000 in the fourth quarter of 2016. The year-over-year increase primarily reflected growth in interest bearing accounts, and interest paid on capital notes issued in February 2017. The average rate paid on interest bearing accounts was marginally higher than a year earlier. For the three months ended December 31, 2017, the Company’s net interest margin was 3.64% and net interest spread was 3.46%.\nNet interest income increased to $5.41 million for the three months ended December 31, 2017 from $4.93 million for the three months ended December 31, 2016, primarily reflecting loan growth. Net interest income after the provision for loan losses increased significantly in the fourth quarter of 2017 compared with the fourth quarter of 2016, reflecting a sharp reduction in the Company’s loan loss provision. This decrease in provision was primarily related to the funding of a large specific reserve in the fourth quarter of 2016.\nNoninterest income, including gains from the sale of residential mortgages to the secondary market, and income from the Bank's line of treasury management services for commercial customers was $1.40 million in the fourth quarter of 2017 compared with $1.19 million in the fourth quarter of 2016. Income from service charges, fees and commissions, driven primarily by growth in fee income from treasury management services, increased to $510,000 in the fourth quarter of 2017 from $337,000 a year earlier. Strong residential mortgage originations in the fourth quarter of 2017 drove gains on sale of loans to $771,000 compared with $668,000 a year earlier.\n“It was exciting to note such strong mortgage origination activity in the fourth quarter, which is not typically a robust period for residential purchase mortgages,” explained J. Todd Scruggs, Executive Vice President and CFO. “The Bank’s increased visibility in all our markets, and particularly newer markets like Roanoke and Harrisonburg, great outreach by our mortgage team, strong demand and tightening inventories, and the prospect of rising rates all contributed to brisk activity.”\nNoninterest expense for the three months ended December 31, 2017 was $4.94 million compared with $4.70 million a year earlier. As in the past several quarters, the increase primarily reflected the Company’s larger banking team and market expansion.\n2017 Full-Year Operational Overview\nTotal interest income of $23.67 million in the 12 months of 2017 rose 10% compared to $21.57 million in the 12 months of 2016, eighty percent of which was due to an increase in income received on loans. Net interest income in the 12 months of 2017 increased to $20.67 million from $19.22 million in the 12 months of 2016, primarily reflecting increased total interest income, partially offset by increased total interest expense related to capital notes issued and growth in time deposits and related interest. Net interest income after the provision for loan losses increased to $19.68 million from $17.61 million a year earlier, reflecting higher interest income and a significantly lower provision for loan losses.\nThe Company's net interest margin was 3.67% in 2017 compared with 3.77% in 2016, and net interest spread was 3.51% in 2017 compared with 3.62% in 2016. Average rates earned on loans, including fees, was 4.53% in 2017 and the average rate earned on total earning assets was 4.20%.\nNoninterest income was $4.86 million in 2017 compared with $4.80 million in 2016. Noninterest income reflected higher year-over-year income from service charges, fees and commissions. Residential mortgage originations (and subsequent loan sales) accelerated in the second half of 2017, reflecting increased home buying activity and increasing contributions from the Roanoke, Charlottesville and Harrisonburg markets. Noninterest expense increased in 2017, with the majority of the increase reflecting investment in expansion into Roanoke, Charlottesville, Harrisonburg, and most recently Appomattox which resulted in higher personnel costs for the larger banking team.\nBalance Sheet Review: Growth, Asset Quality\nTotal assets were a record $626.34 million at December 31, 2017, up from $574.20 million at December 31, 2016. The primary driver of asset growth continues to be loans held for investment, net of the allowance for loan losses, which totaled $491.02 million compared with $464.35 million at December 31, 2016.\n“Increased commercial lending has supported a more asset-sensitive loan portfolio,” explained Chapman. “The large majority of commercial loans within our portfolio carrying adjustable rates will re-price in response to rate increases. With the Federal Reserve hinting at additional possible rate hikes in the in the coming year, we can better ensure loan rates will match a changing interest rate environment.”\nThe Company’s commercial loan portfolio, primarily commercial and industrial (C&I) increased 10% to $96.89 million at December 31, 2017 from $87.86 million at December 31, 2016. Management noted the types of C&I loans, which have grown consistently, reflect a diverse range including operating capital, equipment, and facilities loans, with contributions from all the Company’s served markets.\nOwner occupied real estate loans, led by commercial real estate (CRE) lending, increased 5% year-over-year to $146.91 million, non-owner occupied real estate (primarily commercial and investment property) increased by $1.48 million to $145.13 million, and total construction loans grew by $9.90 million to $20.43 million. Construction lending was particularly strong throughout 2017. Management noted that commercial loan originations were consistently strong throughout the year. Loan growth in the fourth quarter of 2017 was impacted by pay downs of commercial loans, particularly revolving lines of credit. In addition, because of uncertainty surrounding the tax reform process, some tax exempt and nonprofit clients replaced bank financing with long-term, tax exempt financing, which resulted in bank loan pay-downs.\nTotal deposits at December 31, 2017 were $567.49 million, up 8% from $523.11 million at December 31, 2016. Noninterest bearing deposits, primarily reflecting increased commercial banking relationship business throughout the franchise, rose 20% to $123.21 million from $102.65 million at December 31, 2016. Interest bearing demand and savings deposits were $258.88 million, a slight increase from year-end 2016, and time deposits increased to $185.40 million from $165.03 million at year-end 2016. Core deposits accounted for 67% of total deposits.\nAsset quality remained strong, with a nonperforming loans to total loans ratio of 0.87%, up from 0.54% at December 31, 2016. Total nonperforming assets, inclusive of OREO, were $6.96 million at December 31, 2017 compared with $4.92 million at December 31, 2016. The increase in nonperforming loans year over year included $1,757,000 of impaired loans related to four customer relationships. These loans were charged down to the estimated net realizable value of their underlying collateral during the fourth quarter of 2017 and as such, little to no additional loan loss provisions are expected to be required for these credits. Total charge-offs during the fourth quarter were $1,543,000, which included $1,411,000 related to the four relationships noted above. The Company's allowance for loan losses to total losses declined from 1.22% at December 31, 2016 to 0.96% at December 31, 2017, primarily as a result of the decline in recorded specific reserves. The general reserve component of the allowance for loan losses remained relatively consistent with the prior year end.\nThe Company grew measures of stockholder value. Total stockholders’ equity was $51.67 million, up 5% compared with $49.42 million at December 31, 2016, retained earnings grew 18% to $12.03 million from $10.16 million, and tangible book value per share increased to $11.80 from $11.29. The Bank's regulatory capital ratios continued to exceed accepted regulatory standards for a well-capitalized institution.\nAbout the Company\nBank of the James, a wholly owned subsidiary of Bank of the James Financial Group, Inc. opened for business in July 1999 and is headquartered in Lynchburg, Virginia. The bank operates 13 banking offices and two limited services offices in Virginia serving Altavista, Amherst, Appomattox, Bedford, Charlottesville, Forest, Harrisonburg, Lynchburg, Madison Heights, and Roanoke. The bank offers full investment and insurance services through its BOTJ Investment Services division and BOTJ Insurance, Inc. subsidiary. The bank provides mortgage loan origination through Bank of the James Mortgage, a division of Bank of the James. Bank of the James Financial Group, Inc. common stock is listed under the symbol “BOTJ” on the NASDAQ Stock Market, LLC. Additional information on the Company is available at www.bankofthejames.bank .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains statements that constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. The words \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"anticipate,\" \"plan\" and similar expressions and variations thereof identify certain of such forward-looking statements which speak only as of the dates on which they were made. Bank of the James Financial Group, Inc. (the \"Company\") undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Readers are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those indicated in the forward-looking statements as a result of various factors. Such factors include, but are not limited to, competition, general economic conditions, potential changes in interest rates, and changes in the value of real estate securing loans made by Bank of the James (the \"Bank\"), a subsidiary of the Company. Additional information concerning factors that could cause actual results to materially differ from those in the forward-looking statements is contained in the Company's filings with the Securities and Exchange Commission and previously filed by the Bank (as predecessor of the Company) with the Federal Reserve Board.\nCONTACT: J. Todd Scruggs, Executive Vice President and Chief Financial Officer (434) 846-2000.\ntscruggs@bankofthejames.com\nFINANCIAL STATEMENTS FOLLOW\nBank of the James Financial Group, Inc. and Subsidiaries Dollar amounts in thousands, except per share data unaudited Selected Data: Three\nmonths\nending\nDec 31,\n2017 Three\nmonths\nending\nDec 31,\n2016 Change Year\nto\ndate\nDec 31,\n2017 Year\nto\ndate\nDec 31,\n2016 Change Interest income $ 6,235 $ 5,563 12.08 % $ 23,665 $ 21,568 9.72 % Interest expense 825 636 29.72 % 2,993 2,344 27.69 % Net interest income 5,410 4,927 9.80 % 20,672 19,224 7.53 % Provision for loan losses 248 1,017 -75.61 % 993 1,612 -38.40 % Noninterest income 1,401 1,190 17.73 % 4,855 4,795 1.25 % Noninterest expense 4,937 4,701 5.02 % 19,174 17,594 8.98 % Income taxes 1,266 106 1094.34 % 2,438 1,527 59.66 % Net income 360 293 22.87 % 2,922 3,286 -11.08 % Weighted average shares outstanding - basic 4,378,436 4,378,436 0.00 % 4,378,436 4,378,436 0.00 % Weighted average shares outstanding – diluted 4,378,519 4,378,460 0.00 % 4,378,524 4,378,436 0.00 % Basic net income per share $ 0.08 $ 0.07 $ 0.01 $ 0.67 $ 0.75 $ (0.08 ) Fully diluted net income per share $ 0.08 $ 0.07 $ 0.01 $ 0.67 $ 0.75 $ (0.08 )\nBalance Sheet at\nperiod end: Dec 31,\n2017 Dec 31,\n2016 Change Dec 31,\n2016 Dec 31,\n2015 Change Loans, net $ 491,022 $ 464,353 5.74 % $ 464,353 $ 430,445 7.88 % Loans held for sale 2,626 3,833 -31.49 % 3,833 1,964 95.16 % Total securities 61,025 44,075 38.46 % 44,075 38,515 14.44 % Total deposits 567,493 523,112 8.48 % 523,112 467,610 11.87 % Stockholders' equity 51,665 49,421 4.54 % 49,421 48,196 2.54 % Total assets 626,341 574,195 9.08 % 574,195 527,143 8.93 % Shares outstanding 4,378,436 4,378,436 - 4,378,436 4,378,436 - Book value per share $ 11.80 $ 11.29 0.51 $ 11.29 $ 11.01 $ 0.28\nDaily averages: Three\nmonths\nending\nDec 31,\n2017 Three\nmonths\nending\nDec 31,\n2016 Change Year\nto\ndate\nDec 31,\n2017 Year\nto\ndate\nDec 31,\n2016 Change Loans, net $ 493,978 $ 459,528 7.50 % $ 480,138 $ 446,281 7.59 % Loans held for sale 3,575 3,599 -0.67 % 2,628 3,611 -27.22 % Total securities 59,719 44,751 33.45 % 54,913 41,083 33.66 % Total deposits 569,243 514,636 10.61 % 543,783 492,472 10.42 % Stockholders' equity 52,701 50,971 3.39 % 51,789 49,807 3.98 % Interest earning assets 589,938 531,132 11.07 % 563,538 510,275 10.44 % Interest bearing liabilities 446,707 410,065 8.94 % 431,190 393,966 9.45 % Total assets $ 628,069 $ 566,347 10.90 % $ 601,820 $ 543,897 10.65 %\nFinancial Ratios: Three\nmonths\nending\nDec 31,\n2017 Three\nmonths\nending\nDec 31,\n2016 Change Year\nto\ndate\nDec 31,\n2017 Year\nto\ndate\nDec 31,\n2016 Change Return on average assets 0.23 % 0.21 % 0.02 0.49 % 0.60 % (0.11 ) Return on average equity 2.71 % 2.29 % 0.42 5.64 % 6.60 % (0.96 ) Net interest margin 3.64 % 3.68 % -0.04 % 3.67 % 3.77 % -0.10 % Efficiency ratio 72.49 % 76.85 % (4.36 ) 75.11 % 73.25 % 1.86 Average equity to average assets 8.39 % 9.00 % (0.61 ) 8.61 % 9.16 % (0.55 )\nAllowance for loan losses: Three\nmonths\nending\nDec 31,\n2017 Three\nmonths\nending\nDec 31,\n2016 Change Year\nto\ndate\nDec 31,\n2017 Year\nto\ndate\nDec 31,\n2016 Change Beginning balance $ 6,020 $ 4,953 21.54 % $ 5,716 $ 4,683 22.06 % Provision for losses 248 1,017 -75.61 % 993 1,612 -38.40 % Charge-offs (1,543 ) (267 ) 477.90 % (2,094 ) (759 ) 175.89 % Recoveries 27 13 107.69 % 137 180 -23.89 % Ending balance 4,752 5,716 -16.86 % 4,752 5,716 -16.86 %\nNonperforming assets: Dec 31,\n2017 Dec 31,\n2016 Change Dec 31,\n2016 Dec 31,\n2015 Change Total nonperforming loans $ 4,308 $ 2,550 68.94 % $ 2,550 $ 3,406 -25.13 % Other real estate owned 2,650 2,370 11.81 % 2,370 1,965 20.61 % Total nonperforming assets 6,958 4,920 41.42 % 4,920 5,371 -8.40 % Troubled debt restructurings - (performing portion) 440 455 -3.30 % 455 646 -29.57 %\nAsset quality ratios: Dec 31,\n2017 Dec 31,\n2016 Change Dec 31,\n2016 Dec 31,\n2015 Change Nonperforming loans to total loans 0.87 % 0.54 % 0.33 0.54 % 0.78 % (0.24 ) Allowance for loan losses to total loans 0.96 % 1.22 % (0.26 ) 1.22 % 1.08 % 0.14 Allowance for loan losses to nonperforming loans 110.31 % 224.16 % (113.85 ) 224.16 % 137.49 % 86.67 Bank of the James Financial Group, Inc. and Subsidiaries\nConsolidated Balance Sheets\n(dollar amounts in thousands, except per share amounts)\n(unaudited) Assets 12/31/2017 12/31/2016 Cash and due from banks $ 20,267 $ 16,938 Federal funds sold 16,751 11,745 Total cash and cash equivalents 37,018 28,683 Securities held-to-maturity (fair value of $5,619 in 2017 and $3,273 in 2016) 5,713 3,299 Securities available-for-sale, at fair value 55,312 40,776 Restricted stock, at cost 1,505 1,373 Loans, net of allowance for loan losses of $4,752 in 2017 and $5,716 2016 491,022 464,353 Loans held for sale 2,626 3,833 Premises and equipment, net 11,890 10,771 Software, net 165 176 Interest receivable 1,713 1,378 Cash value - bank owned life insurance 13,018 12,673 Other real estate owned 2,650 2,370 Income taxes receivable 1,366 1,214 Deferred tax asset 1,418 2,374 Other assets 925 922 Total assets $ 626,341 $ 574,195 Liabilities and Stockholders' Equity Deposits Noninterest bearing demand 123,211 102,654 NOW, money market and savings 258,878 255,429 Time 185,404 165,029 Total deposits 567,493 523,112 Capital notes 5,000 - Interest payable 111 88 Other liabilities 2,072 1,574 Total liabilities $ 574,676 $ 524,774 Stockholders' equity Common stock $2.14 par value; authorized 10,000,000 shares; issued and outstanding 4,378,436 as of December 31, 2017 and 2016 9,370 9,370 Additional paid-in-capital 31,495 31,495 Accumulated other comprehensive loss (1,228 ) (1,600 ) Retained earnings 12,028 10,156 Total stockholders' equity $ 51,665 $ 49,421 Total liabilities and stockholders' equity $ 626,341 $ 574,195\nBank of the James Financial Group, Inc. and Subsidiaries\nConsolidated Statements of Income\n(dollar amounts in thousands, except per share amounts) (unaudited) For the Three Months\nEnded December 31, For the Year\nEnded December 31, Interest Income 2017 2016 2017 2016 Loans $ 5,745 $ 5,269 $ 22,081 $ 20,481 Securities US Government and agency obligations 185 111 550 479 Mortgage backed securities 85 35 299 201 Municipals 84 77 342 240 Dividends 31 28 73 67 Other (Corporates) 24 22 105 35 Interest bearing deposits 29 3 82 31 Federal Funds sold 52 18 133 34 Total interest income 6,235 5,563 23,665 21,568 Interest Expense Deposits NOW, money market savings 192 162 722 590 Time Deposits 501 407 1,788 1,539 Brokered time deposits 82 67 283 203 Federal Funds purchased - - - 4 Reverse repurchase agreements - - 13 - Capital notes 50 - 187 8 Total interest expense 825 636 2,993 2,344 Net interest income 5,410 4,927 20,672 19,224 Provision for loan losses 248 1,017 993 1,612 Net interest income after provision for loan losses 5,162 3,910 19,679 17,612 Noninterest income Gains on sale of loans held for sale 771 668 2,434 2,433 Service charges, fees and commissions 510 337 1,887 1,444 Increase in cash value of life insurance 86 87 345 292 Other 34 50 76 132 Gains on sales and calls of securities, net - 48 113 494 Total noninterest income 1,401 1,190 4,855 4,795 Noninterest expenses Salaries and employee benefits 2,698 2,513 10,012 9,230 Occupancy 366 342 1,493 1,312 Equipment 375 338 1,521 1,287 Supplies 130 134 520 480 Professional, data processing, and other outside expense 683 672 2,795 2,731 Marketing 143 188 739 686 Credit expense 139 126 595 425 Other real estate expenses 10 11 88 68 FDIC insurance expense 90 88 375 363 Other 303 289 1,036 1,012 Total noninterest expenses 4,937 4,701 19,174 17,594 Income before income taxes 1,626 399 5,360 4,813 Income tax expense 1,266 106 2,438 1,527 Net Income $ 360 $ 293 $ 2,922 $ 3,286 Weighted average shares outstanding - basic 4,378,436 4,378,436 4,378,436 4,378,436 Weighted average shares outstanding - diluted 4,378,519 4,378,460 4,378,524 4,378,436 Income per common share - basic $ 0.08 $ 0.07 $ 0.67 $ 0.75 Income per common share - diluted $ 0.08 $ 0.07 $ 0.67 $ 0.75\nSource:Bank of the James Financial Group, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=JTgb7RjWxlAjLKZ3o2bOGBiHrBzxUcm70OR2GuBBCh6N_ayA-ZDfAAn3QgASICA-kTWJ6j83I_sTsOw3iQRnvflmZtqE88FUyCeNzHb_sSG2Q8dUgp8eBdQwT4uGZe2n", "https://www.globenewswire.com/Tracker?data=1iKtveKK4kw-o3CHedBRdIJSzV6uYhpYbDzwaLIuDVxChJHtDMX2LJs1CM7YVv_NZxbufud0kO4nOQ0BO159VmU_XGuVf0Qx2-GQZIRaiTc=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/03068947-62ee-46d9-91bd-afe56049bd07"], "published": "2018-01-26T20:00:00.000+02:00", "crawled": "2018-01-26T20:03:41.049+02:00", "highlightTitle": ""}