{"organizations": [], "uuid": "24bc039c38370494eceba32475da1b40dbc1aa98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/17/104778275-RTS1GV92-maduro.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/concerns-mount-as-venezuela-closes-in-on-petro-an-oil-backed-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "Concerns mount as Venezuela closes in on petro, an oil-backed cryptocurrency", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T07:00:00.000+02:00", "replies_count": 0, "uuid": "24bc039c38370494eceba32475da1b40dbc1aa98"}, "author": "Michelle Caruso-Cabrera", "url": "https://www.cnbc.com/2018/01/08/concerns-mount-as-venezuela-closes-in-on-petro-an-oil-backed-cryptocurrency.html", "ord_in_thread": 0, "title": "Concerns mount as Venezuela closes in on petro, an oil-backed cryptocurrency", "locations": [], "entities": {"persons": [{"name": "mckeon", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "stephen mckeon", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "ayacucho", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "orinoco", "sentiment": "none"}], "organizations": [{"name": "university of oregon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A cryptocurrency backed by oil would be a big first. A cryptocurrency backed by a sovereign government would be even bigger.\nBut while Venezuela claims it is going to do both very soon with the petro, experts are doubtful the country has the capabilities or the characteristics to achieve its goal.\nThe petro will be dogged by a major question, \"Is it redeemable, in other words, can you take physical delivery?\" notes finance professor Stephen McKeon of the University of Oregon.\nThe strength of any currency backed by a commodity, regardless of whether it is physical or digital, is that holders must believe they can exchange it for the actual commodity. When the U.S. was on the gold standard, individuals could bring their dollars to a bank and exchange them for physical gold.\nVenezuelan President Nicolas Maduro says each petro will be worth the equivalent of one barrel of oil, and he has specifically designated the oil from field one of the Ayacucho block in the Orinoco region of Venezuela, which contains more than 5 billion barrels.\nBut McKeon says Venezuela carries a lot of \"counterparty risk\" because it has little rule of law and falling oil production. If Venezuela fails to deliver the oil, he asks, what is the legal recourse for holders?\nJoshua Satten, blockchain partner at Wipro, also questions whether Venezuela is a \"sound enough government\" to instill confidence in would-be miners and holders of the petro.\nVenezuela oil-backed cryptocurrency to launch in days, government says Several other countries are examining the possibility of a sovereign-backed currency. Sweden is studying the possibility of an e-krona. Singapore is considering a digital currency as well, the ubin. Estonia is considering the estcoin.\nBut none are moving as fast as Venezuela. Maduro has made clear the move is designed to help the country evade sanctions imposed by the U.S., Canada and the EU for human rights violations. And he also aims to help alleviate the country's economic woes.\nVenezuela's oil is currently trading at around $50 a barrel while West Texas Intermediate trades at about $61. (Venezuela trades as at discount because it is heavy oil, containing higher levels of sulfur.)\nEven so, 100 million units would bring in $5 billion in much needed revenue.\nDespite their doubts about the petro in particular, blockchain experts assert there will soon be many \"asset-backed\" digital currencies. In fact, the Royal Mint of the United Kingdom has already started one backed by gold — the RMG.\nFive predictions for digital currencies in 2018 — including stomach-churning drops, bitcoin-related IPO Satten at Wipro also has numerous technical doubts about the government's plans. \"They haven't advised what protocol on which they plan to build, or are they going to build their own?\" he said. Satten also questions their ability to maintain security.\nThere may be more answers come Jan. 14, when Maduro has called for a meeting of all those who will mine the currency. Technical details will be reportedly be released that day.\nAnother issue: oil, unlike gold, is an asset that eventually disappears when it's used. \"How are they going to retire coins?\" asked Satten.\nThe government's explicit desire to evade sanctions bothers those who want to legitimize blockchain. Ultimately, Satten says what Venezuela is trying to achieve isn't a cryptocurrency, but \"a digitized barter system that sidesteps the global financial system. It's a bit scary and very concerning.\"", "external_links": [], "published": "2018-01-08T07:00:00.000+02:00", "crawled": "2018-01-08T18:01:51.004+02:00", "highlightTitle": ""}