{"organizations": [], "uuid": "7c78f00633bee275e92b27f835db352808489f64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220662515&w=1200&r=LYNXMPEE081N2", "site_section": "http://feeds.reuters.com/reuters/INhollywood", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-television-versace/versace-tv-murder-series-treats-family-with-kindness-producer-says-idINKBN1EY2P8", "country": "US", "domain_rank": 408, "title": "Versace TV murder series treats family with kindness, producer says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:23:00.000+02:00", "replies_count": 0, "uuid": "7c78f00633bee275e92b27f835db352808489f64"}, "author": "", "url": "https://in.reuters.com/article/us-television-versace/versace-tv-murder-series-treats-family-with-kindness-producer-says-idINKBN1EY2P8", "ord_in_thread": 0, "title": "Versace TV murder series treats family with kindness, producer says", "locations": [], "entities": {"persons": [{"name": "versace", "sentiment": "negative"}, {"name": "maureen orth", "sentiment": "none"}, {"name": "gianni versace", "sentiment": "none"}, {"name": "donatella", "sentiment": "none"}, {"name": "ryan murphy", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "versace tv", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "variety", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 10:27 PM / Updated an hour ago Versace TV murder series treats family with kindness, producer says Reuters Staff 2 Min Read \nLOS ANGELES (Reuters) - The producer of an upcoming American TV series about the murder of designer Gianni Versace has defended the show from criticism, saying the family is treated “with respect and kindness.” FILE PHOTO: Italian designer Gianni Versace waves at the end of his presentation of his spring-summer '97 ready-to-wear collection at a Milan fashion show, in Milan, Italy, Oct. 5, 1996. REUTERS/Stringer/File Photo \nThe Versace company said in a statement issued in Italy on Monday that the series was “an act of fiction” given that it was based on Maureen Orth’s 1999 book “Vulgar Favors.” It said it “did not authorize and was not involved in the television series.” \n“The Assassination of Gianni Versace: American Crime Story” dramatizes the violent death of Versace in a shooting at his Miami mansion in 1997. \nExecutive producer Ryan Murphy told Hollywood trade publication Variety at a Los Angeles event that Versace’s sister, Donatella, sent actress Penelope Cruz flowers when Cruz was representing the series at the Golden Globes ceremony on Sunday. Director Ryan Murphy participates in a panel for the FX Networks \"The People v. O.J. Simpson: American Crime Story\" during the Television Critics Association (TCA) Cable Winter Press Tour in Pasadena, California, January 16, 2016. REUTERS/Kevork Djansezian \nEdgar Ramirez plays Gianni Versace and Cruz plays Donatella Versace in the nine-part series by Twenty-First Century Fox Inc’s FX cable network that will start broadcasting on Jan. 17. Donatella is artistic director and vice president of the privately held fashion company. \n“I don’t know if she (Donatella) is going to watch the show, but if she did I think that she would see that we treat her and her family with respect and kindness,” Murphy told Variety on Tuesday night. \n“She really is a feminist role model in my book, because she had to step into an impossible situation, which she did with grace and understanding. I think that she really loves Penelope and knows that Penelope would never do anything to represent her in a negative light,” Murphy said. \nScreenwriter Tom Rob Smith said the series aimed to be truthful in its spirit, even if it gets some details wrong. \n“The show is full of love for him (Versace),” Smith said. “I‘m sure there are points where (the family) could correct some of the smaller details, but I think the bigger picture is that this is a figure that we’re celebrating and a figure that we all fell in love with.” Reporting by Jill Serjeant; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-10T00:23:00.000+02:00", "crawled": "2018-01-10T01:04:13.000+02:00", "highlightTitle": ""}