{"organizations": [], "uuid": "175f7837cde9bf715dddbea1407295f7abc6b319", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219792959&w=1200&r=LYNXMPEE0506X", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump-book-author/trump-book-author-says-his-revelations-will-bring-down-u-s-president-idINKBN1EV08C", "country": "US", "domain_rank": 408, "title": "Trump book author says his revelations will bring down U.S. president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T11:00:00.000+02:00", "replies_count": 0, "uuid": "175f7837cde9bf715dddbea1407295f7abc6b319"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-book-author/trump-book-author-says-his-revelations-will-bring-down-u-s-president-idINKBN1EV08C", "ord_in_thread": 0, "title": "Trump book author says his revelations will bring down U.S. president", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "reuters/brendan mcdermid  michael wolff", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The author of a book that is highly critical of Donald Trump’s first year as U.S. president said his revelations were likely to bring an end to Trump’s time in the White House.\nAuthor Michael Wolff is seen on the set of NBC's 'Today' show prior to an interview about his book \"Fire and Fury: Inside the Trump White House\" in New York City, U.S., January 5, 2018. REUTERS/Brendan McDermid Michael Wolff told BBC radio that his conclusion in “Fire and Fury: Inside the Trump White House”-- that Trump is not fit to do the job -- was becoming a widespread view.\n“I think one of the interesting effects of the book so far is a very clear emperor-has-no-clothes effect,” Wolff said in an interview broadcast on Saturday.\n“The story that I have told seems to present this presidency in such a way that it says he can’t do his job,” Wolff said.\n“Suddenly everywhere people are going ‘oh my God, it’s true, he has no clothes’. That’s the background to the perception and the understanding that will finally end ... this presidency.”\nTrump has dismissed the book as full of lies. It depicts a chaotic White House, a president who was ill-prepared to win the office in 2016, and Trump aides who scorned his abilities.\nA copy of the book \"Fire and Fury: Inside the Trump White House\" by author Michael Wolff is seen at the Book Culture book store in New York, U.S. January 5, 2018. REUTERS/Shannon Stapleton Trump took to Twitter late on Friday to renew his attacks on Wolff, and on his former top aide Steve Bannon who was Quote: d in the book.\n“Michael Wolff is a total loser who made up stories in order to sell this really boring and untruthful book,” Trump said. “He used Sloppy Steve Bannon, who cried when he got fired and begged for his job. Now Sloppy Steve has been dumped like a dog by almost everyone. Too bad!”\nBannon, formerly Trump’s chief strategist, is chairman of the so-called alt-right Breitbart News website\nIn his interview with the BBC, Wolff was asked if he believed that Bannon felt Trump was unfit to serve as president and would try to bring him down. “Yes,” Wolff replied.\nHe also hit back at claims that the book was untruthful.\n“This is what’s called reporting. This is how you do it.” he said. “You ask people, you get as close as you can to the event, you interview the people who were privy to the event, you interview other people who were privy to the event, you come to know the circumstance as well as anybody and then you report it.”\nAdditional reporting by Brendan O'Brien in Milwaukee; Writing by William Schomberg; Editing by Jeremy Gaunt\n ", "external_links": [], "published": "2018-01-06T11:00:00.000+02:00", "crawled": "2018-01-06T11:40:23.004+02:00", "highlightTitle": ""}