{"organizations": [], "uuid": "34cf70bf1e82681ba0f33329219073b83cb053b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 38}, "facebook": {"likes": 171, "shares": 171, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220424672&w=1200&r=LYNXMPEE08039", "site_section": "http://feeds.feedburner.com/reuters/topNews/", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-global-oil/u-s-oil-prices-hit-highest-since-2015-but-doubts-loom-over-rally-idUSKBN1EY059", "country": "US", "domain_rank": 408, "title": "U.S. oil prices hit highest since 2015, but doubts loom over rally", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:34:00.000+02:00", "replies_count": 0, "uuid": "34cf70bf1e82681ba0f33329219073b83cb053b3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/u-s-oil-prices-hit-highest-since-2015-but-doubts-loom-over-rally-idUSKBN1EY059", "ord_in_thread": 0, "title": "U.S. oil prices hit highest since 2015, but doubts loom over rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:34 AM / in 6 minutes U.S. crude hits three-year high as prices climb in tight market Devika Krishna Kumar 4 Min Read \nNEW YORK (Reuters) - Oil prices edged higher on Tuesday, with U.S. crude touching its highest since December 2014, supported by OPEC-led production cuts and expectations that U.S. crude inventories have dropped for an eighth week in a row. \nThe Organization of the Petroleum Exporting Countries and allies including Russia are keeping supply limits in place in 2018, a second year of restraint, to reduce a price-denting glut of oil held in inventories. \nU.S. West Texas Intermediate (WTI) crude rose $1.23, or 2 percent, to settle at $62.96 a barrel after touching its highest since December 2014 at $63.24. \nBrent crude ended the session up $1.04, or 1.5 percent, at $68.82 per barrel after hitting a session high of $69.08, its highest since May 2015. Both contracts had their strongest close since December 2014. \n“You’re so long this market at this point, you could certainly get more interest at these levels,” said Rob Haworth, senior investment strategist at U.S. Bank Wealth Management. \n“This is a little more confirmation of what speculators have been looking for and after tomorrow’s (U.S. government inventory) report, we’ll see if they look to do some profit-taking.” \nOPEC is cutting output by even more than it promised and the restraint is reducing oil stocks globally, a trend most visible in the United States, the world’s largest and most transparent oil market. [OPEC/O] \nSupply reports this week from industry group the American Petroleum Institute and the U.S. government’s Energy Information Administration are expected to show U.S. crude stocks fell 3.9 million barrels, an eighth week of decline. [EIA/S] \nThe API releases its data at 4:30 p.m. EST on Tuesday and the government report is due at 10:30 a.m. EST on Wednesday. FILE PHOTO: A pump jack operates at a well site leased by Devon Energy Production Company near Guthrie, Oklahoma, U.S., September 15, 2015. REUTERS/Nick Oxford/File Photo \n“We expect oil demand growth to outpace non-OPEC supply growth in both 2018 and 2019,” Standard Chartered analysts said in a note. \n“In our view, the back of the Brent and WTI curves are both still underpriced. We do not think that prices below $65 per barrel are sustainable into the medium term.” \nMany producers, still suffering from a 2014 price collapse, are enjoying the rally, although they are wary it will spur rival supply sources. Iran said OPEC members were not keen on increased prices. \nThe rise in prices is expected to drive gains in U.S. production during 2018, offsetting curbs by others. \nU.S. crude oil production is expected to surpass 10 million barrels per day (bpd) next month, en route to an all-time record months ahead of previous forecasts, the U.S. Energy Information Administration said Tuesday. \nProduction was expected to rise to an average 10.04 million bpd during the first quarter of this year. \nSome analysts have said the rise in U.S. shale oil production could discourage OPEC and Russia to maintain their deal to curb supply until the end of the year for fears of losing market share. \n“I am now on the lookout for bearish technical patterns to emerge on oil prices as I believe they will struggle to go north of $65-$75 per barrel given the above fundamental consideration,” said Fawad Razaqzada, technical analyst for Forex.com. \n“If WTI were to go back below the 2017 high of $60.48, which was hit late in the year, and the 2018’s opening price of $60.09, then the technical outlook would turn bearish on oil. But for now, the bullish trend remains intact as prices remain above key supports.” Additional reporting by Alex Lawler in London, Henning Gloystein in Singapore; editing by Marguerita Choy and David Gregorio", "external_links": [], "published": "2018-01-09T08:34:00.000+02:00", "crawled": "2018-01-09T09:38:01.779+02:00", "highlightTitle": ""}