{"organizations": [], "uuid": "26023231b09da0c29e5b8345c53f9dc04aac431e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-geysers-yes-ellis-island-no-some-us-parks-open-some-not.html", "country": "US", "domain_rank": 767, "title": "Geysers yes, Ellis Island no: Some US parks open, some not", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T19:03:00.000+02:00", "replies_count": 0, "uuid": "26023231b09da0c29e5b8345c53f9dc04aac431e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-geysers-yes-ellis-island-no-some-us-parks-open-some-not.html", "ord_in_thread": 0, "title": "Geysers yes, Ellis Island no: Some US parks open, some not", "locations": [], "entities": {"persons": [{"name": "yellowston", "sentiment": "negative"}, {"name": "carol weaver", "sentiment": "none"}, {"name": "dan o'meara", "sentiment": "none"}], "locations": [{"name": "ellis island", "sentiment": "none"}, {"name": "wyo.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "yellowstone national park", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "national park", "sentiment": "none"}, {"name": "yellowstone", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "interior department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YELLOWSTONE NATIONAL PARK, Wyo. (AP) — Visitors could still ride snowmobiles and ski into Yellowstone National Park Saturday to marvel at the geysers and buffalo herds, despite the federal government shutdown.\nBut across the country in New York, the nation's most famous monuments to immigration — the Statue of Liberty and Ellis Island — were closed.\nThe Interior Department had vowed to keep open as many parks, monuments and public lands as possible during the shutdown, which began at midnight Friday on the East Coast.\nBy mid-day Saturday, the pattern was spotty, and some visitors were frustrated.\n\"My initial reaction is, they really kind of screwed up our day. We had a great day planned,\" said Dan O'Meara, a California firefighter who wanted to visit the Statue of Liberty and Ellis Island.\n\"But the next thing is, you know — it's troubling that the people we voted in are not doing the job that they're supposed to be doing. So, it's very frustrating,\" he said.\nIn Yellowstone, cross-country skier Carol Weaver was unhappy with lawmakers, even though the trails were open for her and a group of friends making a two-day visit.\nWeaver, from Bozeman, Montana, worried about what would happen if the impasse is lengthy.\n\"This is our public land, and we should be able to use it any time we want,\" she said. \"Congress better get its act together. They've been so irresponsible the last year, as well as the White House.\"\nSen. Steve Daines, R-Mont., said the Trump administration is trying to minimize the effects of the shutdown by keeping parks open, but he accused former President Barack Obama of doing the opposite.\n\"There's a little different philosophy on the shutdown from the Obama administration, which was, 'We're going to try to inflict pain on the American people,'\" Daines said.\nHe said Interior Secretary Ryan Zinke, a former Montana congressman, wants to keep Montana's Glacier National Park and Yellowstone open. Most of Yellowstone is in Wyoming but three of the five entrances are in Montana.\nOn Saturday, Zinke tweeted, \"Not all national parks are fully open but we're working hard to make as much accessible as is safely possible.\"\nYellowstone had 2 inches of fresh snow on Saturday and temperatures in the teens. Visitor centers, public toilets and other facilities run by the National Park Service were closed, but privately operated hotels, tour services and gift shops were open.\nSnow coaches — small buses with tank-like tracks and oversized tires — shuttled visitors from the edge of the park to the geyser field that includes Old Faithful and to other popular destinations within the parks remote interior.\nXanterra Parks & Resorts and other private companies that serve visitors at Yellowstone said they'd cover the cost of grooming the park's snow-packed roads for at least a week to keep them open.\nGinger Lee, visiting the park from Palm Beach County, Florida with her husband and daughter, worried before coming that Yellowstone might be closed. But after cruising past the closed booth where entrance fees are usually collected, the Lees were soon trudging through the snow on a boardwalk leading to one of the park's famous thermal features.\n\"The bison and the elk and the bighorn sheep — the shutdown doesn't affect them so we're happy,\" Lee said.\nIn Philadelphia, the Liberty Bell and Independence Hall — where the Declaration of Independence and the Constitution were signed — were closed.\nGaetana Dimauro of Adelaide, Australia, wasn't aware of the government shutdown when she went to see the Liberty Bell.\n\"That's bad though,\" she said. \"I never heard of that before.\"\nIn Boston, the USS Constitution, the 220-year-old warship anchored at Charlestown Navy Yard, was open to visitors. But the site of the Revolutionary War Battle of Bunker Hill was closed.\nMartin Luther King Jr.'s childhood home in Atlanta was closed, along with historic Ebenezer Baptist Church and the visitor center at MLK National Historic Site, The Atlanta Journal-Constitution reported.\nA monument and museum dedicated to the victims of the 1995 Oklahoma City bombing, however, stayed open. Kari Watkins, executive director of the Oklahoma City National Memorial and Museum, said the center is affiliated with the National Park Service but is owned and operated by the Oklahoma City National Memorial Foundation.\nIn New Mexico, parts of Bandelier National Monument's cliff dwellings and fragile archaeological sites were off-limits to protect them from damage, but the entrance road and some trails were open.\nRocky Mountain National Park in Colorado and Yosemite National Park in California were open, but few Park Service staff were available to help visitors.\nA storm moving into Colorado Saturday was expected to drop up to 18 inches of snow, and Rocky Mountain National Park spokeswoman Kyle Patterson said crews would not plow the roads.\nIn Florida, the western entrance to Everglades National Park was closed but boat tours were still operating, the Naples Daily News reported .\nElliott reported from Denver. Associated Press writers Matthew Daly in Washington; Paul Davenport in Phoenix; Anthony Izaguirre in Philadelphia; Robert Jablon in Los Angeles; Ken A. Miller in Oklahoma City; Bob Salsberg in Boston and Julie Walker in New York contributed to this report.", "external_links": [], "published": "2018-01-20T19:03:00.000+02:00", "crawled": "2018-01-21T10:37:39.028+02:00", "highlightTitle": ""}