{"organizations": [], "uuid": "7500b833e0ca287d73aad3d5129bc4dcade0f002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224492621&w=1200&r=LYNXMPEE0M15Q", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-russia-film-stalin/russian-premiere-of-death-of-stalin-film-called-off-tass-idUSKBN1FC1X6", "country": "US", "domain_rank": 408, "title": "Russian premiere of 'Death of Stalin' film called off - TASS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "7500b833e0ca287d73aad3d5129bc4dcade0f002"}, "author": "", "url": "https://www.reuters.com/article/us-russia-film-stalin/russian-premiere-of-death-of-stalin-film-called-off-tass-idUSKBN1FC1X6", "ord_in_thread": 0, "title": "Russian premiere of 'Death of Stalin' film called off - TASS", "locations": [], "entities": {"persons": [{"name": "stalin", "sentiment": "negative"}, {"name": "nadezhda usmanova", "sentiment": "none"}, {"name": "armando iannucci", "sentiment": "none"}], "locations": [{"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "tass", "sentiment": "negative"}, {"name": "russian military historical society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:31 PM / in 31 minutes Russia cancels release of 'insulting' film about Stalin's death Denis Pinchuk , Andrew Osborn 4 Min Read \nMOSCOW (Reuters) - Russia said on Tuesday it had canceled the release of “Death of Stalin”, a dark, satirical movie from British director Armando Iannucci, saying many Russians would find it an insulting mockery of the country’s Soviet past. \nThe film, which focuses on back-stabbing and in-fighting among the Soviet leader’s closest allies as they vie for power immediately after his 1953 death, had been privately viewed by culture ministry officials and advisers. \nVladimir Medinsky, the culture minister, said on Tuesday his ministry had received a number of complaints after the showing which had prompted him to withdraw its general release license. \nHe said he had asked legal experts to make extra checks on its content. \n“Many people of the older generation, and not only, will regard it as an insulting mockery of all the Soviet past, of the country that defeated fascism and of ordinary people, and what’s even worse, even of the victims of Stalinism,” Medinsky said in a statement. \nHe said his ministry had told the film’s distributor that it was inappropriate to release the film on the eve of the 75th anniversary of the victorious World War Two Battle of Stalingrad in which so many Soviet soldiers lost their lives fighting for a city which bore Stalin’s name. \nBut he said the distributor had not heeded the warning. \n“We don’t have censorship,” said Medinsky. “We are not afraid of critical and unpleasant assessments of our history. But there is a moral line between the critical analysis of our history and desecrating it.” \nIannucci, the film’s director, said he had not lost hope the Russian authorities would perform a U-turn. \n“All the Russians we’ve shown the film to so far, including Russian journalists, have said how much they enjoyed and appreciated the film,” he said. “They say two things: it’s funny, but it’s true. I‘m still confident we can get it in cinemas.” \n‘BAD BLOOD’ \nRussia holds a presidential election on March 18 which incumbent Vladimir Putin is expected to win easily. Putin, who has dominated Russian politics for the last 18 years, has put patriotism at the center of his rule. \nStalin was repudiated by the Soviet Union after his death. He is recognized as responsible for the deaths of millions, from policies that included the forced collectivization of farms that caused famine, and from a succession of purges that saw mass executions and imprisonment at an archipelago of camps. \nBut the Soviet leader during World War Two is still associated by many Russians with the country’s greatest achievements. Putin has called Stalin “a complex figure” and said attempts to demonize him were a ploy to attack Russia. \nSome of the people who attended the film’s private viewing told Reuters they were disgusted. \n“It’s a despicable film,” said Nadezhda Usmanova, head of the Russian Military Historical Society’s department of information. The group was involved in organizing the pre-release screening. \n“It’s a bad film, it’s a boring film, and it’s vile, repugnant and insulting,” Usmanova told Reuters. \nElena Drapeko, deputy head of the culture committee in the State Duma, the lower house of Parliament, said she found “extremism” in the movie. \n“It’s an effort to breed bad blood into the social harmony that has been reached in Russian society”, said Drapeko, who earlier in her career was a popular Soviet and Russian actress. Writing by Polina Ivanova and Andrew Osborn; Editing by Peter Graff", "external_links": [], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T16:45:20.040+02:00", "highlightTitle": ""}