{"organizations": [], "uuid": "6958935d52a37899007774b332e150dcfc131720", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-crane-co-reports-2017-results-and-updates-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Crane Co. Reports 2017 Results and Updates 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T01:01:00.000+02:00", "replies_count": 0, "uuid": "6958935d52a37899007774b332e150dcfc131720"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-crane-co-reports-2017-results-and-updates-2018-guidance.html", "ord_in_thread": 0, "title": "Crane Co. Reports 2017 Results and Updates 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "max mitchell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "crane co", "sentiment": "neutral"}, {"name": "crane co.", "sentiment": "none"}, {"name": "crane currency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highlights from Full Year 2017 Results and 2018 Guidance:\nGAAP earnings per diluted share (EPS) of $2.84 compared to $2.07 in 2016. Excluding Special Items, EPS of $4.53 increased 7% compared to last year. Record free cash flow (cash provided by operating activities less capital spending) of $269 million. Revising 2018 GAAP EPS guidance range to $4.65-$4.85. Excluding Special Items, the new guidance range is $5.35-$5.55. Guidance now includes the impact of the Crane Currency acquisition, the impacts of the 2017 U.S. tax reform legislation, a new repositioning program, and expenses associated with acceleration of growth investments enabled by tax reform.\nSTAMFORD, Conn.--(BUSINESS WIRE)-- Crane Co. (NYSE: CR), a diversified manufacturer of highly engineered industrial products, reported full year and fourth quarter 2017 financial results, and provided an update on its 2018 outlook.\n\"We delivered three new records in 2017: adjusted EPS of $4.53, adjusted operating margins of 15.2%, and free cash flow of $269 million,\" said Max Mitchell, Crane Co. President and Chief Executive Officer. \"I am very proud of our 2017 performance, and I have never been more excited about Crane's multi-year earnings outlook than I am today. Our core business is executing extremely well; the recently completed Crane Currency acquisition is off to a great start; the recent tax reform legislation will not only improve our profitability, but it will enable us to accelerate investments for future growth; and we continue to focus on margin improvement through productivity and certain new repositioning actions.\n\"While there is a lot of exciting activity in our core business, including strong execution on growth and productivity initiatives, several other developments are also contributing to our positive outlook. Earlier this month, we closed on the Crane Currency acquisition, the second largest transaction in Crane's history. Crane Currency is the fastest growing, fully integrated global currency provider in the global banknote supply and security industry, and it is an excellent fit to complement our expanding presence in the currency and payment markets, bringing proprietary and differentiated technology. We believe that the combined businesses will be stronger together, offering end-to-end currency and security solutions, from substrate manufacturing and banknote design and printing to micro-optics and banknote validation. The integration is well underway, and we expect Crane Currency to contribute $0.15 of adjusted EPS in 2018, growing to approximately $1.00 of EPS annually by 2021.\n\"We also view the recently enacted Tax Cuts and Jobs Act (TCJA) as a very favorable development with an annual EPS benefit of approximately $0.50. The TCJA should also improve our global competitiveness by enabling increased flexibility to deploy capital in the United States. Because of the benefits and related flexibility we expect from this legislation, we have decided to accelerate strategic growth investments across several of our businesses over the next two years. These investments will offset approximately $0.25 per share of the tax benefit in 2018, and then decline to approximately $0.15 in 2019, with the full $0.50 annual EPS benefit from the TCJA reading through by 2020.\n\"In addition, our relentless focus on continuously improving our operations has resulted in a significant opportunity to execute proactive facility consolidations within our Fluid Handling, Aerospace & Electronics, and Payment & Merchandising businesses. We believe that these actions will not only improve our cost position, but enable us to meet higher expected future demand and provide the footprint that best serves our customers. These actions should contribute approximately $0.10 of EPS, excluding Special Items, in 2018, growing to an annualized EPS run-rate of approximately $0.35 by the end of 2020.\"\nMr. Mitchell concluded, \"The growth potential of our core business, combined with the benefits from the Crane Currency acquisition, tax reform, accelerated growth investments, and repositioning activities, will position Crane for double-digit annual adjusted earnings growth for at least the next several years, with further upside possible from additional capital deployment. We also announced today that we are raising our dividend for the first time since 2014, further reflecting confidence in our outlook.\" (Please see the attached Non-GAAP Financial Measures tables.)\nFourth Quarter 2017 Results\nThe fourth quarter 2017 GAAP net loss was $0.48 per share, compared to a fourth quarter 2016 GAAP net loss of $1.09 per share. Fourth quarter 2017 results include: a tax charge of $87 million, or $1.44 per diluted share, related to the TCJA; an after-tax charge of $8 million, or $0.13 per diluted share, related to repositioning, net; and, an after-tax charge of $5 million, or $0.08 per diluted share, for M&A related items. Fourth quarter 2016 results include an after-tax net asbestos provision of $125 million, or $2.13 per diluted share. Excluding Special Items, fourth quarter 2017 EPS was $1.18, compared to $1.02 in 2016. (Please see the attached Non-GAAP Financial Measures tables.)\nFourth quarter 2017 sales were $714 million, up 5% compared to 2016. Core sales increased $13 million, or 2%, with $14 million, or 2%, of favorable foreign exchange, and a $5 million, or 1%, net acquisition benefit.\nFourth quarter 2017 operating profit was $91 million compared to an operating loss of $92 million in 2016. Excluding Special Items, fourth quarter 2017 operating profit was $109 million, an increase of 8% compared to 2016. (Please see the attached Non-GAAP Financial Measures tables.)\nFull Year 2017 Results\nFull year 2017 GAAP EPS was $2.84, compared to $2.07 in 2016. Full year 2017 results include: a tax charge of $87 million, or $1.44 per share, related to the TCJA; an after-tax charge of $8 million, or $0.13 per share, related to repositioning, net; and, an after-tax charge of $7 million, or $0.11 per share, for M&A related items. Full year 2016 results include an after-tax net asbestos provision of $125 million, or $2.11 per share, and a $3 million net after-tax legal settlement charge, or $0.05 per share. Excluding Special Items, 2017 EPS of $4.53 increased 7% compared to $4.23 in 2016. (Please see the attached Non-GAAP Financial Measures tables.)\nFull year 2017 sales were $2.8 billion, up 1% compared to 2016. Core sales increased $31 million, or 1%, and net acquisitions contributed $14 million, partially offset by $7 million of unfavorable foreign exchange.\nFull year 2017 operating profit was $402 million compared to $200 million in 2016. Excluding Special Items, full year 2017 operating profit was $423 million, an increase of 6% compared to $398 million in 2016. Full year 2017 adjusted operating margin of 15.2% increased 70 basis points compared to 14.5% in 2016. (Please see the attached Non-GAAP Financial Measures tables.)\nCash Flow and Other Financial Metrics\nCash provided by operating activities for full year 2017 was $318 million, flat compared to $318 million in 2016. Free cash flow (cash provided by operating activities less capital spending) was $269 million in 2017, compared to $267 million in 2016. The Company's cash position was $706 million at December 31, 2017, compared to $510 million at December 31, 2016. Total debt was $743 million at December 31, 2017, compared to $745 million at December 31, 2016. On January 10, 2018, Crane Co. acquired Crane Currency for $800 million on a cash free and debt free basis using a combination of short-term debt and cash on hand.\nTax Reform Bill Enabling Accelerated Growth Investments\nOn December 22, 2017, the TCJA was signed into law, significantly changing U.S. corporate tax law. As a result, the fourth quarter of 2017 included a one-time tax charge of $87 million related to both the remeasurement of U.S. deferred tax balances and to taxation of unremitted earnings of non-U.S. subsidiaries.\nFor 2018, we expect a GAAP tax rate of approximately 22%. Excluding Special Items, we expect a 2018 effective tax rate of approximately 22%, a decrease of approximately eight to nine percentage points compared to Crane's typical effective tax rate prior to the TCJA.\nAs a result of the tax savings and greater flexibility to repatriate foreign cash related to the TCJA, Crane Co. is accelerating growth investments across its businesses. On a pre-tax basis, these incremental growth investments are expected to be approximately $20 million in 2018 and $10 million in 2019.\nRepositioning Initiatives\n2018 benefits from repositioning actions in our Fluid Handling, Payment & Merchandising Technologies, and Aerospace & Electronics businesses are expected to be approximately $8 million, increasing to an annual run-rate of approximately $30 million by the end of 2020. Net pre-tax charges associated with these repositioning activities are expected to be approximately $30 million through 2020, including the $13 million net charge in the fourth quarter of 2017 and $11 million expected during 2018.\nRaising 2018 Guidance\nOn December 5, 2017, Crane Co. introduced preliminary 2018 full year earnings guidance of $4.85-$5.05 per diluted share, excluding any potential impact from the then-pending Crane Currency acquisition. (Please see the attached Non-GAAP Financial Measures tables.)\nWe now expect 2018 full year GAAP EPS of $4.65-$4.85. Excluding Special Items, we expect 2018 full year EPS of $5.35-$5.55. Guidance assumes core sales growth of +2% to +4%, a modest benefit from favorable foreign exchange, and approximately $400 million of sales contribution from the Crane Currency acquisition.\nFull year 2018 free cash flow (cash provided by operating activities less capital spending) is expected to be in a range of $220-$250 million, including capital expenditures of approximately $125 million. Capital expenditures are expected to be elevated in 2018 primarily due to repositioning activities, further investments enabled by the TCJA, and investment activity at Crane Currency.\nSegment Results\nAll comparisons detailed in this section refer to operating results for the fourth quarter 2017 versus the fourth quarter 2016.\nFluid Handling\nFourth Quarter Change (dollars in millions) 2017 2016 Sales $ 272 $ 240 $ 32 13 % Operating Profit $ 20 $ 28 $ (8 ) (27 %) Operating Profit, before Special Items* $ 31 $ 28 $ 3 12 % Profit Margin 7.5 % 11.6 % Profit Margin, before Special Items* 11.5 % 11.6 % *Please see the attached Non-GAAP Financial Measures tables Sales increased $32 million, driven by $16 million, or 7%, core growth, a $6 million, or 2.5%, contribution from net acquisitions, and $10 million, or 4%, of favorable foreign exchange. Operating margin declined to 7.5%, compared to 11.6% last year, reflecting the impact of repositioning charges. Excluding Special Items, operating margin was 11.5%, approximately flat compared to 11.6% in 2016. Fluid Handling order backlog was $262 million at December 31, 2017, compared to $228 million at December 31, 2016.\nPayment & Merchandising Technologies\nFourth Quarter Change (dollars in millions) 2017 2016 Sales $ 194 $ 195 $ — — % Operating Profit $ 25 $ 38 $ (13 ) (34 %) Operating Profit, before Special Items* $ 38 $ 38 $ (1 ) (2 %) Profit Margin 13.1 % 19.7 % Profit Margin, before Special Items* 19.4 % 19.7 % *Please see the attached Non-GAAP Financial Measures tables Sales were flat, with a $4 million core sales decline approximately offset by favorable foreign exchange. Operating margin declined to 13.1%, from 19.7% last year, reflecting the impact of repositioning charges. Excluding Special Items, operating margin of 19.4% declined slightly from 19.7% last year.\nAerospace & Electronics\nFourth Quarter Change (dollars in millions) 2017 2016 Sales $ 185 $ 187 $ (2 ) (1 )% Operating Profit $ 55 $ 39 $ 16 41 % Operating Profit, before Special Items* $ 46 $ 39 $ 6 16 % Profit Margin 29.9 % 21.0 % Profit Margin, before Special Items* 24.7 % 21.0 % *Please see the attached Non-GAAP Financial Measures tables Sales decreased $2 million, or 1%, primarily as a result of unfavorable comparisons related to shipments for a large military program in the fourth quarter of 2016. Operating margin increased to 29.9%, from 21.0% last year, primarily as a result of a gain on the sale of an asset related to repositioning activities. Excluding Special Items, operating margin increased 370 basis points to 24.7%, primarily as a result of strong productivity. Aerospace & Electronics order backlog was $374 million at December 31, 2017, compared to $353 million at December 31, 2016.\nEngineered Materials\nFourth Quarter Change (dollars in millions) 2017 2016 Sales $ 63 $ 60 $ 3 5 % Operating Profit $ 10 $ 10 $ — (4 )% Profit Margin 15.9 % 17.4 % Sales increased $3 million, or 5%, driven primarily by higher sales to the Recreational Vehicle market. Operating margin declined 150 basis points to 15.9%, as the higher volumes and productivity were more than offset by higher material costs.\nAdditional Information\nAdditional information with respect to the Company’s asbestos liability and related accounting provisions and cash requirements is set forth in the Current Report on Form 8-K filed with a copy of this press release.\nConference Call\nCrane Co. has scheduled a conference call to discuss the fourth quarter financial results on Tuesday, January 30, 2018 at 10:00 A.M. (Eastern). All interested parties may listen to a live webcast of the call at http://www.craneco.com . An archived webcast will also be available to replay this conference call directly from the Company’s website. Slides that accompany the conference call will be available on the Company’s website.\nCrane Co. is a diversified manufacturer of highly engineered industrial products. Founded in 1855, Crane provides products and solutions to customers in the hydrocarbon processing, petrochemical, chemical, power generation, unattended payment, banknote design and production, automated merchandising, aerospace, electronics, transportation and other markets. The Company has four business segments: Fluid Handling, Payment & Merchandising Technologies, Aerospace & Electronics and Engineered Materials. Crane has approximately 12,000 employees in the Americas, Europe, the Middle East, Asia and Australia. Crane Co. is traded on the New York Stock Exchange (NYSE:CR). For more information, visit www.craneco.com .\nThis press release may contain forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995. These statements present management’s expectations, beliefs, plans and objectives regarding future financial performance, and assumptions or judgments concerning such performance. Any discussions contained in this press release, except to the extent that they contain historical facts, are forward-looking and accordingly involve estimates, assumptions, judgments and uncertainties. There are a number of factors that could cause actual results or outcomes to differ materially from those addressed in the forward-looking statements. Such factors are detailed in the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and subsequent reports filed with the Securities and Exchange Commission.\n(CR-E)\n(Financial Tables Follow)\nCRANE CO. Income Statement Data (in millions, except per share data)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Net Sales: Fluid Handling $ 272.2 $ 240.4 $ 1,042.5 $ 999.5 Payment & Merchandising Technologies 194.4 194.6 776.7 745.8 Aerospace & Electronics 184.9 186.5 691.4 745.7 Engineered Materials 62.7 59.9 275.4 257.0 Total Net Sales $ 714.2 $ 681.4 $ 2,786.0 $ 2,748.0 Operating Profit (Loss): Fluid Handling $ 20.4 $ 28.0 $ 111.8 $ 119.5 Payment & Merchandising Technologies 25.4 38.4 148.5 135.5 Aerospace & Electronics 55.4 39.2 160.2 149.8 Engineered Materials 10.0 10.4 49.5 49.0 Corporate (20.3 ) (15.2 ) (68.1 ) (61.1 ) * Asbestos Provision — (192.4 ) — (192.4 ) Total Operating Profit (Loss) 90.9 (91.6 ) 401.9 200.3 Interest Income 0.7 0.5 2.5 1.9 Interest Expense (8.8 ) (9.0 ) (36.1 ) (36.5 ) Miscellaneous- Net 0.1 (1.1 ) (0.8 ) (1.6 ) Income (Loss) Before Income Taxes 82.9 (101.2 ) 367.5 164.1 Provision for (Benefit from) Income Taxes 111.4 (37.6 ) 195.0 40.3 Net (loss) income before allocation to noncontrolling interests (28.5 ) (63.6 ) 172.5 123.8 Less: Noncontrolling interest in subsidiaries' earnings 0.2 0.4 0.7 1.0 Net (loss) income attributable to common shareholders $ (28.7 ) $ (64.0 ) $ 171.8 $ 122.8 Share Data: (Loss) Earnings per Diluted Share $ (0.48 ) $ (1.09 ) $ 2.84 $ 2.07 Average Diluted Shares Outstanding 59.4 58.8 60.4 59.3 Average Basic Shares Outstanding 59.4 58.8 59.4 58.5 Supplemental Data:\nCost of Sales $ 455.6 $ 433.7 $ 1,770.9 $ 1,758.3 Asbestos Provision — 192.4 — 192.4 Selling, General & Administrative 150.0 146.9 592.4 597.0 * Transaction Related Charges (see non-GAAP measures) 4.7 — 7.8 — Repositioning Charges, net of gain on property sale (see non-GAAP measures) 13.0 — 13.0 — Depreciation and Amortization ** 18.7 16.6 72.7 67.4 Stock-Based Compensation Expense ** 5.3 4.9 21.8 21.7 * Includes a $5 million legal settlement. ** Amount included within cost of sales and selling, general & administrative costs. CRANE CO. Condensed Balance Sheets (in millions)\nDecember 31,\n2017 December 31, 2016\nASSETS Current Assets Cash and Cash Equivalents $ 706.2 $ 509.7 Accounts Receivable, net 418.4 396.4 Current Insurance Receivable - Asbestos 25.0 18.0 Inventories, net 349.3 342.5 Other Current Assets 19.6 49.1 Total Current Assets 1,518.5 1,315.7 Property, Plant and Equipment, net 282.4 278.9 Long-Term Insurance Receivable - Asbestos 90.1 125.2 Other Assets 495.6 559.0 Goodwill 1,206.9 1,149.2 Total Assets $ 3,593.5 $ 3,428.0\nLIABILITIES AND EQUITY Current Liabilities Notes Payable and Current Maturities of Long-Term Debt $ 249.4 $ — Accounts Payable 247.4 223.2 Current Asbestos Liability 85.0 71.0 Accrued Liabilities 252.1 223.1 Income Taxes 3.6 3.5 Total Current Liabilities 837.5 520.8 Long-Term Debt 494.1 745.3 Long-Term Deferred Tax Liability 44.9 42.4 Long-Term Asbestos Liability 520.3 624.9 Other Liabilities 348.2 348.9 Total Equity 1,348.5 1,145.7 Total Liabilities and Equity $ 3,593.5 $ 3,428.0 CRANE CO. Condensed Statements of Cash Flows (in millions)\nThree Months Ended December 31,\nTwelve Months Ended\nDecember 31, 2017 2016 2017 2016 Operating Activities: Net (loss) income attributable to common shareholders $ (28.7 ) $ (64.0 ) $ 171.8 $ 122.8 Noncontrolling interest in subsidiaries' earnings 0.2 0.4 0.7 1.0 Net (loss) income before allocations to noncontrolling interests (28.5 ) (63.6 ) 172.5 123.8 Asbestos Provision — 192.4 — 192.4 Gain on deconsolidation of joint venture (1.0 ) — (1.0 ) — Gain on sale of property related to facility consolidation (11.1 ) — (11.1 ) — Depreciation and amortization 18.7 16.6 72.7 67.4 Stock-based compensation expense 5.3 4.9 21.8 21.7 Defined benefit plans and postretirement credit (2.2 ) (1.8 ) (8.5 ) (9.1 ) Deferred income taxes 88.3 (41.2 ) 104.3 (25.1 ) Cash provided by operating working capital 92.0 61.4 54.0 27.0 Defined benefit plans and postretirement contributions (3.3\n) (2.4 ) (13.2\n) (8.8 ) Environmental payments, net of reimbursements (1.9 ) (3.4 ) (6.3 ) (11.6 ) Other 2.8\n1.3 (5.2\n) (3.6 ) Subtotal 159.1 164.2 380.0 374.1 Asbestos related payments, net of insurance recoveries (15.7 ) (14.5 ) (62.5 ) (56.0 ) Total provided by operating activities 143.4 149.7 317.5 318.1 Investing Activities: Capital expenditures (14.7 ) (13.0 ) (49.0 ) (51.5 ) Proceeds from disposition of capital assets 22.3 0.1 22.3 0.9 Impact of deconsolidation of joint ventures (5.2 ) — (5.2 ) — Payments for acquisitions, net of cash acquired — — (54.8 ) — Total provided by (used for) investing activities 2.4 (12.9 ) (86.7 ) (50.6 ) Financing Activities: Dividends paid (19.6 ) (19.4 ) (78.4 ) (77.2 ) Reacquisition of shares on open market — — (25.0 ) — Stock options exercised - net of shares reacquired 4.5 16.8 25.2 26.4 Debt issuance costs (2.6 ) — (2.6 ) — Repayment of commercial paper — (34.0 ) — (49.6 ) Total used for financing activities (17.7 ) (36.6 ) (80.8 ) (100.4 ) Effect of exchange rate on cash and cash equivalents 5.9 (26.8 ) 46.5 (20.9 ) Increase in cash and cash equivalents 134.0 73.4 196.5 146.2 Cash and cash equivalents at beginning of period 572.2 436.3 509.7 363.5 Cash and cash equivalents at end of period $ 706.2 $ 509.7 $ 706.2 $ 509.7 CRANE CO. Order Backlog (in millions)\nDecember 31,\n2017\nSeptember 30,\n2017\nJune 30,\n2017\nMarch 31,\n2017\nDecember 31,\n2016\nFluid Handling $ 262.1 * $ 268.8 * $ 258.9 * $ 249.8 $ 228.3 Payment & Merchandising Technologies 76.4 ** 87.6 ** 87.0 ** 85.8 94.0 Aerospace & Electronics 373.6 348.4 328.2 352.4 353.4 Engineered Materials 13.6 13.9 14.9 17.8 15.7 Total Backlog $ 725.7 $ 718.7 $ 689.0 $ 705.8 $ 691.4 * Includes $3.4 million, $3.5 million and $4.1 million as of each of December 31, 2017, September 30, 2017 and June 30, 2017, respectively, of backlog pertaining to the Westlock business acquired in April 2017. ** Includes $0.2 million, $0.2 million and $0.3 million as of each of December 31, 2017, September 30, 2017 and June 30, 2017, respectively, of backlog pertaining to the Microtronic business acquired in June 2017.\nCRANE CO. Non-GAAP Financial Measures (in millions, except per share data)\nThree Months Ended\nDecember 31, Twelve Months Ended\nDecember 31, Percent\nChange\nDecember\n31, 2017\nPercent\nChange\nDecember\n31, 2017\n2017 2016 2017 2016 Three\nMonths\nTwelve\nMonths INCOME ITEMS\nNet Sales $ 714.2 $ 681.4 $ 2,786.0 $ 2,748.0 4.8 %\n1.4 % Operating Profit (Loss) 90.9 (91.6 ) 401.9 200.3 (199.2 )% 100.7 % Percentage of Sales 12.7 % (13.4 )% 14.4 % 7.3 % Special Items impacting Operating Profit:\nAsbestos provision 192.4 192.4 Transaction related charges 4.7 — 7.8 — Repositioning charges, net of gain on property sale 13.0 — 13.0 — Legal settlement charge — — — 5.0 Operating Profit before Special Items $ 108.6 $ 100.8 $ 422.7 $ 397.7 7.8 %\n6.3 % Percentage of Sales 15.2 % 14.8 % 15.2 % 14.5 % Net (Loss) Income Attributable to Common Shareholders $ (28.7 ) $ (64.0 ) $ 171.8 $ 122.8 Per Share $ (0.48 ) $ (1.09 ) $ 2.84 $ 2.07 (55.6 )% 37.3 % Special Items Impacting Net Income Attributable to Common Shareholders:\nAsbestos provision — 125.1 — 125.1 Per Share 2.13 2.11 Transaction related charges - Net of Tax 4.6 — 6.7 — Per Share $ 0.08 $ 0.11 Repositioning charges, net of gain on property sale - Net of Tax 8.0 — 8.0 — Per Share 0.13 0.13 Legal settlement charge - Net of Tax — — — 3.3 Per Share 0.05 Impact of Tax Law Change 87.1 — 87.1 — Per Share $ 1.44 $ 1.44 Net Income Attributable To Common Shareholders Before Special Items $ 71.0 $ 61.1 $ 273.6 $ 251.1 16.1 %\n8.9 % Per Basic Share $ 1.20 $ 1.04 $ 4.61 $ 4.30 14.9 %\n7.2 % Per Diluted Share $ 1.18 $ 1.02 $ 4.53 $ 4.23 In the three months ended December 31, 2017 and December 31, 2016, Average Shares Outstanding excluding the effect of diluted stock options were used to compute the per share amounts since these periods were in a loss position. Had Net Income Attributable To Common Shareholders been reported for these periods, Average Shares Outstanding would have included the effect of diluted stock options when computing per share amounts (see chart below). (in thousands) (in thousands) Average Basic Shares Outstanding 59,373 58,768 Effect of Diluted Stock Options 1,041 991 Average Shares Outstanding including the effect of Stock Options 60,414 59,759\nWhen considering the effect of dilutive stock options on shares outstanding, Net Income Attributable To Common Shareholders Before Special Items is $1.18 per share and $1.02 per share for the three months ended December 31, 2017 and 2016, respectively. Special Items Impacting Provision for Income Taxes\nProvision for Income Taxes - GAAP Basis $ 111.4 $ (37.6 ) $ 195.0 $ 40.3 Tax effect of asbestos provision — 67.3 — 67.3 Tax effect of transaction related charges 0.1 — 1.1 — Tax effect of repositioning charges, net of gain on property sale 4.9 — 4.9 — Tax effect of legal settlement charge — — — 1.7 Impact of tax law change (87.1 ) — (87.1 ) — Provision for Income Taxes - non-GAAP Basis $ 29.4 $ 29.7 $ 113.9 $ 109.3 Segment Information:\nFor the three months ended December 31, 2017 Fluid\nHandling\nPayment &\nMerchandising\nTechnologies\nAerospace\n&\nElectronics\nEngineered\nMaterials\nCorporate Total\nCompany\nNet Sales $ 272.2 $ 194.4 $ 184.9 $ 62.7 $ — $ 714.2 Operating Profit - GAAP 20.4 25.4 55.4 10.0 (20.3 ) 90.9 Transaction related charges 0.4 0.1 — — 4.2 4.7 Repositioning charges, net of gain on property sale 10.6 12.2 (9.8 ) — — 13.0 Operating Profit before Special Items 31.4 37.7 45.6 10.0 (16.1 ) 108.6 Percentage of Sales 11.5 % 19.4 % 24.7 % 15.9 % 15.2 % Segment Information:\nFor the three months ended December 31, 2016 Fluid\nHandling\nPayment &\nMerchandising\nTechnologies\nAerospace\n&\nElectronics\nEngineered\nMaterials\nCorporate Total\nCompany\nNet Sales $ 240.4 $ 194.6 $ 186.5 $ 59.9 $ — $ 681.4 Operating Profit - GAAP 28.0 38.4 39.2 10.4 (207.6 ) (91.6 ) Asbestos provision — — — — 192.4 192.4 Operating Profit before Special Items 28.0 38.4 39.2 10.4 (15.2 ) 100.8 Percentage of Sales 11.6 % 19.7 % 21.0 % 17.4 % 14.8 % CRANE CO. Guidance (in millions, except per share data)\n2018 Full Year Guidance 2018 Earnings Per Share Guidance Low High Earnings Per Share - GAAP basis 4.65 4.85 Repositioning Costs 0.15 0.15 Acquisition Integration Costs $ 0.55 $ 0.55 Earnings Per Share - Non-GAAP basis $ 5.35 $ 5.55 Three Months\nEnded\nDecember 31,\nTwelve Months\nEnded\nDecember 31,\n2018 Full Year\nGuidance\n2017 2016 2017 2016 Low High CASH FLOW ITEMS\nCash Provided by Operating Activities before Asbestos - Related Payments\n$ 159.1 $ 164.2 $ 380.0 $ 374.1 $ 405.0 $ 435.0 Asbestos Related Payments, Net of Insurance Recoveries (15.7 ) (14.5 ) (62.5 ) (56.0 ) (60.0 ) (60.0 ) Cash Provided by Operating Activities 143.4 149.7 317.5 318.1 345.0 375.0 Less: Capital Expenditures (14.7 ) (13.0 ) (49.0 ) (51.5 ) (125.0 ) (125.0 ) Free Cash Flow $ 128.7 $ 136.7 $ 268.5 $ 266.6 $ 220.0 $ 250.0 Certain non-GAAP measures have been provided to facilitate comparison with the prior year. The Company reports its financial results in accordance with U.S. generally accepted accounting principles (GAAP). However, management believes that non-GAAP financial measures which exclude certain non-recurring items present additional useful comparisons between current results and results in prior operating periods, providing investors with a clearer view of the underlying trends of the business. Management also uses these non-GAAP financial measures in making financial, operating, planning and compensation decisions and in evaluating the Company's performance. In addition, Free Cash Flow provides supplemental information to assist management and investors in analyzing the Company’s ability to generate liquidity from its operating activities. The measure of Free Cash Flow does not take into consideration certain other non-discretionary cash requirements such as, for example, mandatory principal payments on the Company's long-term debt. Non-GAAP financial measures, which may be inconsistent with similarly captioned measures presented by other companies, should be viewed in addition to, and not as a substitute for, the Company’s reported results prepared in accordance with GAAP.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006189/en/\nCrane Co.\nJason D. Feldman, 203-363-7329\nDirector, Investor Relations\nwww.craneco.com\nSource: Crane Co.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.craneco.com&esheet=51750222&newsitemid=20180129006189&lan=en-US&anchor=www.craneco.com&index=2&md5=921654d68ad2fb0f5c939a2cb16771ff", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.craneco.com&esheet=51750222&newsitemid=20180129006189&lan=en-US&anchor=http%3A%2F%2Fwww.craneco.com&index=1&md5=e21d261c83a6599b0ba3f8a38ac03556", "http://www.businesswire.com/news/home/20180129006189/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.craneco.com&esheet=51750222&lan=en-US&anchor=www.craneco.com&index=3&md5=2cb856bacf6ba2ea35bf0bdad28da50e"], "published": "2018-01-30T01:01:00.000+02:00", "crawled": "2018-01-30T03:43:53.015+02:00", "highlightTitle": ""}