{"organizations": [], "uuid": "affb0000b352f100745f070141013a1b059b7081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-providence-medical-technology-announces-appointment-of-us-sales-executive-and-publication-of-two-additional-clinical-studies.html", "country": "US", "domain_rank": 767, "title": "Providence Medical Technology Announces Appointment of US Sales Executive and Publication of Two Additional Clinical Studies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:00:00.000+02:00", "replies_count": 0, "uuid": "affb0000b352f100745f070141013a1b059b7081"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-providence-medical-technology-announces-appointment-of-us-sales-executive-and-publication-of-two-additional-clinical-studies.html", "ord_in_thread": 0, "title": "Providence Medical Technology Announces Appointment of US Sales Executive and Publication of Two Additional Clinical Studies", "locations": [], "entities": {"persons": [{"name": "jeremy", "sentiment": "none"}, {"name": "jeremy laynor", "sentiment": "none"}, {"name": "jeff smith", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "pleasanton", "sentiment": "none"}, {"name": "providence", "sentiment": "none"}, {"name": "craniovertebral junction", "sentiment": "none"}], "organizations": [{"name": "providence medical technology", "sentiment": "negative"}, {"name": "cardinal health", "sentiment": "none"}, {"name": "medtronic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLEASANTON, Calif., Jan. 8, 2018 /PRNewswire/ -- Providence Medical Technology, an innovator in cervical spine fusion, today announced the appointment of Jeremy Laynor as Vice President of US sales. The company also announced the publication of two new studies in the Journal of Craniovertebral Junction and Spine further demonstrating the clinical benefits of its unique cervical fusion technology.\nJeremy is an accomplished sales executive who has successfully built high-growth sales teams launching disruptive medical technology. Jeremy most recently served as Vice President of Sales at Paradigm Spine where he led a team of direct and independent distributors selling novel spinal technology. He has also held sales leadership positions at Medtronic and Cardinal Health.\n\"Jeremy is an excellent fit for this critical leadership position,\" commented Jeff Smith, CEO of Providence Medical Technology. \"He understands the challenges of selling unique devices in the spine market and brings a strong network of spine surgeons and distributor partners to Providence. Jeremy completes the buildout of our executive team that will elevate our company to new levels as we further commercialize our differentiated posterior cervical fusion technology.\"\nAdditionally, the December issue of the Journal of Craniovertebral Junction and Spine features two studies both authored by Dr. Krzysztof Siemionow et al., that demonstrate the clinical performance of posterior fusion utilizing the company's DTRAX® Spinal System and CAVUX® cervical cages. One study reviewed the safety profile of 89 consecutive patients diagnosed with cervical radiculopathy and surgically treated with posterior cervical fusion and bilateral cages. The study reports a median hospital stay of 29 hours and overall complication rate related to the posterior cervical fusion of only 3.4%.\nA complete copy of this study can be found at http://bit.ly/2E1fKuY\nThe second study publishes for the first time a case series of posteriorly placed cervical cages as an adjunct to fusion in place of lateral mass screws. The study concludes that posterior cervical cages may be an alternative option to traditional lateral mass screws. These two new publications add to the growing body of evidence supporting the company's posterior cervical fusion technology of 13 total peer-reviewed scientific publications.\nA complete copy of this study can be found at http://bit.ly/2CB3vsg\n\"The DTRAX Spinal System has greatly increased my procedural efficiency during posterior cervical fusion surgeries,\" commented Dr. Kris Siemionow, MD, PhD Orthopedic Spine Surgeon at the University of Illinois at Chicago. \"The instruments allow me to perform all the steps of a cervical fusion in a controlled fashion with an intuitive workflow while the cages offer a safe alternative to traditional lateral mass screws.\"\nDTRAX Spinal System is a set of sterile packaged, single-use instruments designed to perform posterior cervical fusion and has been used in over 9,000 cases worldwide. The CAVUX Cervical Cage is indicated for use in skeletally mature patients with degenerative disc disease (DDD) of the cervical spine (C3-C7) with accompanying radicular symptoms at one disc level.\nAbout Providence Medical Technology, Inc.\nProvidence Medical Technology, Inc. is a privately-held medical device company focused on innovative solutions for cervical spinal conditions. The company has pioneered a proprietary approach to posterior cervical fusion and has developed surgical instrumentation and implants that offer unique benefits to the $2 billion worldwide cervical spine market. The Providence family of products includes the DTRAX® Spinal Instrumentation System, CAVUX® intervertebral implants, ALLY® line of bone, facet and cervical pedicle screws, and BIOLOGIX™ allograft cervical cages. All products are shipped-sterile and single-use to maximize perioperative efficiency and ensure consistent quality and performance. For more information, visit www.providencemt.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/providence-medical-technology-announces-appointment-of-us-sales-executive-and-publication-of-two-additional-clinical-studies-300579120.html\nSOURCE Providence Medical Technology", "external_links": ["http://www.prnewswire.com/news-releases/providence-medical-technology-announces-appointment-of-us-sales-executive-and-publication-of-two-additional-clinical-studies-300579120.html", "http://www.providencemt.com/", "http://bit.ly/2E1fKuY", "http://bit.ly/2CB3vsg"], "published": "2018-01-08T20:00:00.000+02:00", "crawled": "2018-01-08T21:04:49.012+02:00", "highlightTitle": ""}