{"organizations": [], "uuid": "5457baa9097906356dd1fc62779a4d0c67a14a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-valuation-practice-from-gabriel-partners-to-join-forces-with-bober-markey-fedorovich-cleveland-office.html", "country": "US", "domain_rank": 767, "title": "Valuation Practice from Gabriel Partners to Join Forces with Bober Markey Fedorovich Cleveland Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:48:00.000+02:00", "replies_count": 0, "uuid": "5457baa9097906356dd1fc62779a4d0c67a14a6d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-valuation-practice-from-gabriel-partners-to-join-forces-with-bober-markey-fedorovich-cleveland-office.html", "ord_in_thread": 0, "title": "Valuation Practice from Gabriel Partners to Join Forces with Bober Markey Fedorovich Cleveland Office", "locations": [], "entities": {"persons": [{"name": "bober markey fedorovich", "sentiment": "negative"}, {"name": "michael bigrigg", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "gabriel partners", "sentiment": "none"}, {"name": "schweda", "sentiment": "none"}, {"name": "zak", "sentiment": "none"}, {"name": "zachary schweda", "sentiment": "none"}, {"name": "mark b. bober", "sentiment": "none"}, {"name": "bigrigg", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}, {"name": "schweda", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "gabriel partners to join forces", "sentiment": "negative"}, {"name": "bober markey fedorovich cleveland office", "sentiment": "negative"}, {"name": "gabriel partners valuation and corporate services practice", "sentiment": "none"}, {"name": "gabriel partners", "sentiment": "none"}, {"name": "bmf", "sentiment": "none"}, {"name": "valuation advisory services practice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND--(BUSINESS WIRE)-- Bober Markey Fedorovich (BMF, www.bmfcpa.com ) announces that the leadership team from Gabriel Partners Valuation and Corporate Services Practice has joined BMF’s Valuation Advisory Services Practice. Moving to BMF are Zachary Schweda, former Managing Director/Partner at Gabriel Partners along with Michael Bigrigg, CPA/ABV, former Senior Manager within the practice. Schweda joins BMF as a Partner, and Bigrigg joins as a Senior Manager with BMF. The move became effective on January 3, 2018; both Schweda and Bigrigg will be located in the firm’s Cleveland office.\nAfter Gabriel Partners was acquired recently, Schweda said he made the decision to identify a new firm that would be a better strategic fit for his client base, a firm that ideally focused on growing and supporting a national valuation practice.\n“Building upon our already strong valuation business has long been a strategic focus for our firm, so we see a tremendous opportunity to add to our portfolio of services with the addition of Zak and Mike,” explained Mark B. Bober, partner in charge of BMF’s Valuation and Transaction Advisory Practice. “While our existing practice focuses on what’s often referred to as the ‘front end’ of valuation and dispute resolution services, Zak and Mike provide a very unique and complementary service that will bring deep expertise in ‘back end’ valuation techniques for valuing identifiable intangibles, goodwill, stock options and a variety of financial and tax reporting-related services. Further, their deep valuation services expertise related to business combination accounting (ASC 805) complements our national transaction advisory services practice.”\nBober said he was familiar with the quality and depth of Schweda’s and Bigrigg’s work, since BMF had partnered with their prior firm to provide certain valuation services that included purchase price allocations (ASC 805), goodwill and asset impairment (ASC 350/360), stock options (ASC 718) and IRC Section 409A.\nSchweda noted that affiliating with an established accounting firm will provide an important set of additional financial advisory knowledge and services that will be important to his client base.\n“BMF’s traditional strength in audit and tax regulations and compliance will be highly valued by our clients,” he noted. “Audit and tax are constantly evolving and changing fields of practice, with particular complexity in a wide variety of compliance matters. BMF’s historic focus and strong practice will be a significant enhancement to the services we’re providing clients today.”\nSchweda, a resident of Medina, joined BPP/Gabriel in 2005 after graduating from Brown University with a bachelor’s degree in business economics. He consults extensively with corporate clients, external auditors, and attorneys on valuation topics within a wide range of industries. His valuation opinions are often used to effect M&A transactions by providing a third-party opinion as to the reasonableness of a proposed purchase or sale and provide the accounting and tax support necessary to document executed transactions in accordance with the regulatory guidance.\nBigrigg has worked with a variety of financial and accounting firms since graduating from Kent State University in 2006 with a bachelor’s degree in accounting. A resident of Lakewood, he assists law firms, corporations, lenders and public institutions with analysis, understanding, and resolution of complex financial issues. Mike brings valuable skills to assist clients with complex financial issues such as financial and tax reporting, business succession planning, and economic damages analysis. He also has significant valuation experience related to shareholder disputes, estate and gift tax reporting, business succession, and risk management.\nAbout Bober Markey Fedorovich\nFounded in 1959, Bober Markey Fedorovich is a Top 20 independent CPA and business advisory firm in Northeast Ohio serving greater Akron, Cleveland and surrounding regions. Our clients span a variety of industries, many with multi-state and global operations. BMF specializes in accounting, audit, tax, litigation support, valuation and transaction advisory services, with focus on privately held businesses, private equity groups and SEC companies. BMF’s integrated approach with sophisticated advisory services assists in the resolution of business challenges across a broad spectrum of industry and service needs. BMF is a member of Allinial Global , Financial Consulting Group , and is registered with the Public Company Accounting Oversight Board . For more information, visit www.bmfcpa.com .\nFor high resolution images click here: http://www.ggcomm.com/BMF/Schweda.jpg , http://www.ggcomm.com/BMF/Bigrigg.jpg\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006245/en/\nBober Markey Fedorovich\nKaryn M. Sullivan, 330-255-2468\nChief Operating Officer\nksullivan@bmfcpa.com\nSource: Bober Markey Fedorovich", "external_links": ["http://www.businesswire.com/news/home/20180122006245/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fcgnetwork.org%2F&esheet=51746756&newsitemid=20180122006245&lan=en-US&anchor=Financial+Consulting+Group&index=3&md5=4c32108342d2eafb5a70d839be6741f8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fallinialglobal.com&esheet=51746756&newsitemid=20180122006245&lan=en-US&anchor=Allinial+Global&index=2&md5=8ec7302b78c9c100ff11c24070245487", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bmfcpa.com&esheet=51746756&newsitemid=20180122006245&lan=en-US&anchor=www.bmfcpa.com&index=1&md5=10125c11d2dd06938af495f53adc2d43", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpcaobus.org%2F&esheet=51746756&newsitemid=20180122006245&lan=en-US&anchor=Public+Company+Accounting+Oversight+Board&index=4&md5=95ac115f07905645a2234d34ba34df0d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bmfcpa.com&esheet=51746756&newsitemid=20180122006245&lan=en-US&anchor=www.bmfcpa.com&index=5&md5=397beebb9d10f8557000f716f3b49cdb"], "published": "2018-01-22T19:48:00.000+02:00", "crawled": "2018-01-22T20:11:19.000+02:00", "highlightTitle": ""}