{"organizations": [], "uuid": "4d7ec019e8d8799b548a45a307e7f4b53541d9c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-preferred-apartment-communities-inc-announces-2017-earnings-release-and-conference-call-dates-and-initial-2018-earnings.html", "country": "US", "domain_rank": 767, "title": "Preferred Apartment Communities, Inc. Announces 2017 Earnings Release and Conference Call Dates and Initial 2018 Earnings Guidance; Estimated 2017 Distribution Tax Treatment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.988, "site_type": "news", "published": "2018-01-25T00:20:00.000+02:00", "replies_count": 0, "uuid": "4d7ec019e8d8799b548a45a307e7f4b53541d9c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-preferred-apartment-communities-inc-announces-2017-earnings-release-and-conference-call-dates-and-initial-2018-earnings.html", "ord_in_thread": 0, "title": "Preferred Apartment Communities, Inc. Announces 2017 Earnings Release and Conference Call Dates and Initial 2018 Earnings Guidance; Estimated 2017 Distribution Tax Treatment", "locations": [], "entities": {"persons": [], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "preferred apartment communities, inc", "sentiment": "neutral"}, {"name": "communities, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 24, 2018 /PRNewswire/ --\nEarnings Release and Conference Call Dates\nPreferred Apartment Communities, Inc. (NYSE: APTS) (\"PAC\" or the \"Company\") today announced plans to release its fourth quarter and year ended 2017 earnings after the market closes on Monday, February 26, 2018.\nFollowing are the details of a conference call Preferred Apartment Communities will host on Tuesday, February 27, 2018 at 11:00 a.m. Eastern Time to discuss its fourth quarter and year ended 2017 results. To participate in the conference call, please dial in to the following:\nLive Conference Call Details\nDomestic Dial-in Number: (844) 890-1791\nInternational Dial-in Number: (412) 380-7408\nCompany: Preferred Apartment Communities, Inc.\nDate: Tuesday, February 27, 2018\nTime: 11:00 a.m. Eastern Time (8:00 a.m. Pacific Time)\nThe live broadcast of Preferred Apartment Communities' fourth quarter and year ended 2017 conference call will be available online, on a listen-only basis, at the company's website, www.pacapts.com , under \"Investors\" and then click on the \"Webcasts & Audio\" link. A replay of the call will be archived on Preferred Apartment Communities' website under Investors/Audio Archive.\n2018 Guidance\nThe Company today also announced its initial full year 2018 earnings guidance. As previously discussed, beginning in 2018, PAC will report its non-GAAP financial results primarily based on the standardized Funds from Operations (\"FFO\") methodology adopted by NAREIT. Other than PAC's upcoming fourth quarter and year ended 2017 results, the Company will neither report Core FFO nor provide guidance on Core FFO going forward.\n\"Our 2018 guidance reflects our confidence in our long-term growth opportunities and our ability to execute our strategic goals,\" said John A. Williams, Chief Executive Officer of PAC. Mr. Williams added, \"The classic NAREIT definition of FFO is one of the most commonly utilized non-GAAP measures currently in practice for real estate investment trusts like PAC and we believe that reporting our financial results using FFO will be a useful analytical tool for our stockholders.\"\nNet income (loss) per share - We are actively adding properties and real estate loan investments to our real estate portfolio and the specific timing of the closing of acquisitions is difficult to predict. Such activity by nature can cause material variations in our reported depreciation and amortization expense and interest income. Since net income (loss) per share is calculated net of depreciation and amortization expense, our net income (loss) results can fluctuate widely. For this reason, we are unable to reasonably forecast this measure or provide a reconciliation of our projected FFO per share to this measure.\nFFO per share – We currently project Funds from Operations, or FFO to be in the range of $1.43 - $1.47 per share for the full year 2018.\nRevenue – We currently project total revenues to be in the range of $400 million to $440 million for the full year 2018.\nCommon Stock Dividends - We currently expect to increase our Common Stock dividend by an aggregate of at least 10% during 2018 as compared to 2017.\nEstimated Income Tax Treatment of 2017 Distributions\nThe Company also announced today how it expects its 2017 distributions to be classified for federal income tax purposes. Stockholders are encouraged to consult with their personal tax advisors as to their specific tax treatment of these distributions. The estimated distribution classifications are shown on the charts below. This release is based on the preliminary results of work on PAC's tax filings and is subject to correction or adjustment when the filings are completed.\nPAC is releasing information at this time to aid those required to distribute Form 1099s on the Company's distributions. No material change in these classifications is expected.\nCommon Stock (CUSIP # 74039L103)\nRecord\nDate\nPayment\nDate\nCash\nDistribution\nPer Share\nOrdinary\nDividends\nForm 1099\nBox 1a\nCapital Gain\nDistribution\nForm 1099\nBox 2a\nNondividend\nDistributions\nForm 1099\nBox 3\n3/15/2017\n4/14/2017\n$0.22\n0.0%\n0.0%\n100.0%\n6/15/2017\n7/14/2017\n$0.235\n0.0%\n0.0%\n100.0%\n9/15/2017\n10/16/2017\n$0.235\n0.0%\n0.0%\n100.0%\n12/15/2017\n1/16/2018\n$0.25\n(1)\n0.0%\n0.0%\n100.0%\n(1) Note: The Common Stock dividend paid on 1/16/18 is taxable in Year 2017.\nSeries A Redeemable Preferred Stock\n(CUSIP #'s 74039L 202, 74039L 301, 74039L 400, 74039L 707, 74039L 806, 74039L 889, 74039L 871, 74039L 863, 74039L 855, 74039L 848, 74039L 822, 74039L 830, 74039L 814, 74039L 798, 74039L 780, 74039L 772, 74039L 756, 74039L 749, 74039L 731, 74039L 723, 74039L 715, 74039L 699, 74039L 681, 74039L 673, 74039L 665, 74039L 657, 74039L 640, 74039L 632, 74039L 624, 74039L 616, 74039L 590, 74039L 582, 74039L 574, 74039L 566, 74039L 558, 74039L 541, 74039L 533, 74039C 202, 74039C 301, 74039C 400, 74039C 509, 74039C 608, 74039C 707, 74039C 806, 74039C 889, 74039C 871, 74039C 863, 74039C 855, 74039C 848, 74039C 830, 74039C 822, 74039C 814, 74039C 798, 74039C 780, 74039C 772, 74039C 764, 74039C 756, 74039L 525, 74039C 749, 74039E 208, 74039E 307, 74039E 406, 74039E 505, 74039E 604, 74039C 731, 74039E 703, 74039C 723, 74039E 802, 74039C 715, 74039C 699, 74039E 885, 74039E 877, 74039C 681, 74039E 869, 74039E 851, 74039E 844, 74039E 836, 74039E 828, 74039E 810, 74039E 794, 74039E 786, 74039E 778, 74039J 207, 74039J 306, 74039J 405, 74039J 504, 74039J 603, 74039C 673, 74039C 665, 74039C 567, 74039J 702, 74039J 801, 74039J 884, 74039J 876, 74039J 868, 74039J 850, 74039J 843, 74039C 640, 74039J 835, 74039J 827, 74039C 632, 74039J 819, 74039J 793, 74039C 624, 74039J 785, 74039J 777, 74039E 760, 74039C 616, 74039C 590, 74039E 752, 74039J 769, 74039J 751, 74039J 744, 74039J 736, 74039J 728, 74039E 745, 74039E 729, 74039E 695, 74039J 686, 74039J 660, 74039E 687, 74039C 582, 74039E 661, 74039E 646, 74039E 620, 74039C 517, 74039E 596, 74039J 645, 74039E 570, 74039E 554, 74039J 629, 74039E 539, 74039E 513, 74063B 203 and 74039J 595)\nRecord\nDate\nPayment\nDate\nCash\nDistribution\nPer Share (1)\nOrdinary\nDividends\nForm 1099\nBox 1a\nCapital Gain\nDistribution\nForm 1099\nBox 2a\nNondividend\nDistributions\nForm 1099\nBox 3\n1/31/2017\n2/21/2017\n$5.00\n64.04%\n8.5%\n27.46%\n2/28/2017\n3/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n3/31/2017\n4/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n4/28/2017\n5/22/2017\n$5.00\n64.04%\n8.5%\n27.46%\n5/31/2017\n6/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n6/30/2017\n7/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n7/31/2017\n8/21/2017\n$5.00\n64.04%\n8.5%\n27.46%\n8/31/2017\n9/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n9/29/2017\n10/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n10/31/2017\n11/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n11/30/2017\n12/20/2017\n$5.00\n64.04%\n8.5%\n27.46%\n12/29/2017\n1/22/2018\n$5.00\n(2)\n64.04%\n8.5%\n27.46%\n(1)\nDividend amount shown is for the full month in which the record date occurs. This amount is subject to additional amounts paid on shares of Series A Redeemable Preferred Stock issued in the month prior to the record date for the period from the date of issuance to the end of the month prior to the record date. Notwithstanding the different amounts, the classification for federal income tax purposes is not altered.\n(2)\nNote: The Series A Redeemable Preferred Stock dividend paid on 1/22/18 is taxable in Year 2017.\nSeries M Redeemable Preferred Stock\n(CUSIP #'s 74039E 711, 74039J 694, 74039J 678, 74039J 652, 74039E 679, 74039C 574, 74039E 653, 74039E 638, 74039E 612, 74039C 525, 74039E 588, 74039J 637, 74039E 562, 74039E 547, 74039J 611, 74039E 521, 74039E 497, 74063B 302 and 74039J 587)\nRecord\nDate\nPayment\nDate\nCash\nDistribution\nPer Share (1)\nOrdinary\nDividends\nForm 1099\nBox 1a\nCapital Gain\nDistribution\nForm 1099\nBox 2a\nNondividend\nDistributions\nForm 1099\nBox 3\n1/31/2017\n2/21/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n2/28/2017\n3/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n3/31/2017\n4/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n4/28/2017\n5/22/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n5/31/2017\n6/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n6/30/2017\n7/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n7/31/2017\n8/21/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n8/31/2017\n9/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n9/29/2017\n10/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n10/31/2017\n11/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n11/30/2017\n12/20/2017\n$4.7916670\n64.04%\n8.5%\n27.46%\n12/29/2017\n1/22/2018\n$4.7916670\n(2)\n64.04%\n8.5%\n27.46%\n(1)\nDividend amount shown is for the full month in which the record date occurs. This amount is subject to additional amounts paid on shares of Series M Redeemable Preferred Stock issued in the month prior to the record date for the period from the date of issuance to the end of the month prior to the record date. Notwithstanding the different amounts, the classification for federal income tax purposes is not altered.\n(2)\nNote: The Series M Redeemable Preferred Stock dividend paid on 1/22/18 is taxable in Year 2017.\nAbout Preferred Apartment Communities, Inc.\nPreferred Apartment Communities, Inc. is a Maryland corporation formed primarily to acquire and operate multifamily properties in select targeted markets throughout the United States. As part of our business strategy, we may enter into forward purchase contracts or purchase options for to-be-built multifamily communities and we may make real estate related loans, provide deposit arrangements, or provide performance assurances, as may be necessary or appropriate, in connection with the development of multifamily communities and other properties. As a secondary strategy, we may acquire or originate senior mortgage loans, subordinate loans or real estate loans secured by interests in multifamily properties, membership or partnership interests in multifamily properties and other multifamily related assets and invest a lesser portion of our assets in other real estate related investments, including other income-producing property types, senior mortgage loans, subordinate loans or real estate loans secured by interests in other income-producing property types, membership or partnership interests in other income-producing property types as determined by our manager as appropriate for us. At September 30, 2017, the Company was the approximate 97.5% owner of Preferred Apartment Communities Operating Partnership, L.P., the Company's operating partnership. Preferred Apartment Communities, Inc. has elected to be taxed as a real estate investment trust under the Internal Revenue Code of 1986, as amended, commencing with its tax 2011. Learn more at www.pacapts.com .\nDefinitions of Non-GAAP Measures\nFunds From Operations Attributable to Common Stockholders and Unitholders (\"FFO\")\nAnalysts, managers and investors make certain adjustments to reported net income amounts under U.S. GAAP in order to better assess these vehicles' operating results. FFO is one of the most commonly utilized Non-GAAP measures currently in practice. In its 2002 \"White Paper on Funds From Operations,\" which was most recently revised in 2012, the National Association of Real Estate Investment Trusts, or NAREIT, standardized the definition of how Net income/loss should be adjusted to arrive at FFO, in the interests of uniformity and comparability.\nThe NAREIT definition of FFO (and the one reported by the Company) is:\nNet income/loss:\nexcluding impairment charges on and gains/losses from sales of depreciable property; plus depreciation and amortization of real estate assets and deferred leasing costs; and after adjustments for the Company's proportionate share of unconsolidated partnerships and joint ventures.\nNot all companies necessarily utilize the standardized NAREIT definition of FFO, so caution should be taken in comparing the Company's reported FFO results to those of other companies. The Company's FFO results are comparable to the FFO results of other companies that follow the NAREIT definition of FFO and report these figures on that basis. The Company believes FFO is useful to investors as a supplemental gauge of our operating results.\nForward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements may be identified by the use of forward-looking terminology such as \"may\", \"trend\", \"will\", \"expects\", \"plans\", \"estimates\", \"anticipates\", \"projects\", \"intends\", \"believes\", \"goals\", \"objectives\", \"outlook\" and similar expressions. Because such statements include risks, uncertainties and contingencies, actual results may differ materially from the expectations, intentions, beliefs, plans or predictions of the future expressed or implied by such forward-looking statements. These risks, uncertainties and contingencies include, but are not limited to, those disclosed in PAC's filings Commission. PAC undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events, except as may be required by law.\nAdditional Information\nThe SEC has declared effective the registration statement (including prospectus) filed by the Company for each of the offerings to which this communication may relate. Before you invest, you should read the final prospectus, and any prospectus supplements, forming a part of the registration statement and other documents the Company has filed with the SEC for more complete information about the Company and the offering to which this communication may relate. In particular, you should carefully read the risk factors described in the final prospectus and in any related prospectus supplement and in the documents incorporated by reference in the final prospectus and any related prospectus supplement to which this communication may relate. You may obtain these documents for free by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, the Company or its dealer manager, Preferred Capital Securities, LLC, with respect to PAC's mShares Redeemable Preferred Stock Offering and Series A Redeemable Preferred Stock and Warrant Unit Offering, and JonesTrading Institutional Services LLC, with respect to PAC's ATM Common Stock Offering, will arrange to send you a prospectus if you request it by calling Leonard A. Silverstein at (770) 818-4100, 3284 Northside Parkway NW, Suite 150, Atlanta, Georgia 30327.\nThe ATM Common Stock Offering prospectus supplement, dated July 10, 2017, including a base prospectus, dated May 17, 2016, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm\nThe mShares Redeemable Preferred Stock Offering prospectus, dated January 19, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217 8/a424prospectus-mshares1.htm\nThe Series A Redeemable Preferred Stock and Warrant Unit Offering prospectus, dated March 16, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm\nView original content with multimedia: http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-2017-earnings-release-and-conference-call-dates-and-initial-2018-earnings-guidance-estimated-2017-distribution-tax-treatment-300587805.html\nSOURCE Preferred Apartment Communities, Inc.", "external_links": ["https://www.sec.gov/Archives/edgar/data/1481832/000148183217000008/a424prospectus-mshares1.htm", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm", "http://www.pacapts.com/", "http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-2017-earnings-release-and-conference-call-dates-and-initial-2018-earnings-guidance-estimated-2017-distribution-tax-treatment-300587805.html", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm"], "published": "2018-01-25T00:20:00.000+02:00", "crawled": "2018-01-25T01:35:51.015+02:00", "highlightTitle": ""}