{"organizations": [], "uuid": "10b646ffd1574450144d41d9b5bb2385d669b306", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219262156&w=1200&r=LYNXMPEE030ES", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/israel-palestinians-probe/israeli-military-to-probe-death-of-disabled-palestinian-in-gaza-idINKBN1ET0QT", "country": "US", "domain_rank": 408, "title": "Israeli military to probe death of disabled Palestinian in Gaza", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T10:14:00.000+02:00", "replies_count": 0, "uuid": "10b646ffd1574450144d41d9b5bb2385d669b306"}, "author": "", "url": "https://in.reuters.com/article/israel-palestinians-probe/israeli-military-to-probe-death-of-disabled-palestinian-in-gaza-idINKBN1ET0QT", "ord_in_thread": 0, "title": "Israeli military to probe death of disabled Palestinian in Gaza", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "zeid ra‘ad al-hussein", "sentiment": "none"}, {"name": "ibrahim abu thurayeh", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "gaza city", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (Reuters) - The Israeli military said on Thursday it would further investigate the death of a wheechair-bound Palestinian who was killed in clashes over U.S. President Donald Trump’s recognition of Jerusalem as Israel’s capital.\nWheelchair-bound Palestinian demonstrator Ibrahim Abu Thurayeh is pushed before he was killed during clashes with Israeli troops on Friday, at a protest against U.S. President Donald Trump's decision to recognise Jerusalem as the capital of Israel, near the border with Israel in the east of Gaza City December 15, 2017. REUTERS/Mohammed Salem The Dec. 15 death of Ibrahim Abu Thurayeh was denounced by the Palestinians and decried by U.N. High Commissioner for Human Rights Zeid Ra‘ad al-Hussein, who said the a 29-year-old amputee was shot in the head by Israeli troops close to the Gaza-Israel border fence.\nThe Israeli military said its own operational investigation, carried out shortly after the incident, had found that it was not possible to say what had killed Abu Thurayeh. It said no live fire had been directed at him during the dispersal of the demonstration, in which protesters hurled explosive devices and rocks and set tyres alight.\n“In order to further examine the case, including information received from organizations operating in the Gaza Strip, it was decided that the circumstances of Thurayeh’s death will also be examined by a Military Police investigation,” the army said in a statement.\nTrump’s announcement on Jerusalem infuriated the Arab world and upset Western allies. It has sparked violent protests on a weekly basis along the Israel-Gaza border and in the occupied West Bank.\nAbu Thurayeh was a regular at such demonstrations. In media interviews, he had said he had lost both his legs in a 2008 Israeli missile strike in Gaza.\nThe status of Jerusalem has been one of the biggest obstacles to a peace agreement between Israel and the Palestinians for generations.\nIsrael considers all of Jerusalem to be its capital. Palestinians want the eastern part of the city as the capital of a future independent state of their own.\nReporting by Maayan Lubell; Editing by Catherine Evans\n ", "external_links": [], "published": "2018-01-04T10:14:00.000+02:00", "crawled": "2018-01-04T10:37:49.006+02:00", "highlightTitle": ""}