{"organizations": [], "uuid": "3d37e14531240eba4e3f13a436999155f26fa171", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/25/104729900-GettyImages-849112956-brian-Krzanich.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/after-hours-buzz-intc-tsla-more.html", "country": "US", "domain_rank": 767, "title": "After-hours buzz: INTC, TSLA & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.879, "site_type": "news", "published": "2018-01-04T00:40:00.000+02:00", "replies_count": 0, "uuid": "3d37e14531240eba4e3f13a436999155f26fa171"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/03/after-hours-buzz-intc-tsla-more.html", "ord_in_thread": 0, "title": "After-hours buzz: INTC, TSLA & more", "locations": [], "entities": {"persons": [{"name": "brian krzanich  check", "sentiment": "neutral"}, {"name": "krzanich", "sentiment": "none"}, {"name": "brian krzanich", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}], "locations": [], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "16 Hours Ago | 03:17 \nCheck out the companies making headlines after the bell : \nIntel shares fell 1 percent in extended trading, after CEO Brian Krzanich responded to allegations about the functioning of the company's chips. The chipmaker's taken heat throughout the past week after an industry blog reported a patch for a security flaw in some of its chips would hamper performance. \nKrzanich said Google made Intel aware of the widespread security exploit a while back and that the companies had been working together to fix it. He also said high-level devices, like speakers and phones, could be affected. \nTesla stock fell more than 1 percent after the bell, after the electric automaker announced its fiscal 2017 fourth quarter production and deliveries. The financial report revealed Tesla well missed Wall Street projections on several fronts, amid production issues. \nOn the report, Tesla updated production guidance for the highly anticipated Model 3 sedan, postponing promises to ramp up production for the second time. \nRite Aid stock plunged more than 6 percent in extended trading. The drugstore chain beat third quarter estimates for earnings and revenue, after adjusting to account for discontinued operations. Rite Aid reported a drop in year-over-year same store sales. \nRite Aid has been struggling with eroding profits in its pharmacy business, amid slowing branded drug price increases and growing pressure for generic drug reimbursement, Thomson Reuters reported. \nShares of Zumiez soared more than 12 percent in the extended session. The specialty clothing retailer reported a 7.9 percent increase in year-over-year same store sales for the month of December. Sales beat analyst estimates of a 4.4 percent increase, and the year-ago quarter's 3.4 percent growth in comparable store sales. On the report, Zumiez raised its fourth quarter earnings and comp sales guidance. Chloe Aiello News Associate for CNBC.com Related Securities", "external_links": [], "published": "2018-01-04T00:40:00.000+02:00", "crawled": "2018-01-04T00:39:58.046+02:00", "highlightTitle": ""}