{"organizations": [], "uuid": "46220ef760d0d6cca8337bb1511b4bfd5d5bb6f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/04/reuters-america-u-s-to-open-atlantic-arctic-offshore-leases-in-new-drilling-plan.html", "country": "US", "domain_rank": 767, "title": "U.S. to open Atlantic, Arctic offshore leases in new drilling plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:32:00.000+02:00", "replies_count": 0, "uuid": "46220ef760d0d6cca8337bb1511b4bfd5d5bb6f4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-u-s-to-open-atlantic-arctic-offshore-leases-in-new-drilling-plan.html", "ord_in_thread": 0, "title": "U.S. to open Atlantic, Arctic offshore leases in new drilling plan", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}], "organizations": [{"name": "interior department", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "neutral"}, {"name": "interior", "sentiment": "none"}, {"name": "national outer continental shelf oil and gas leasing program", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 4 (Reuters) - The U.S. Interior Department on Thursday will open up the largest area on record to offshore oil and gas drilling in a new five-year leasing plan, including previously protected parts of the Arctic, Atlantic and Pacific oceans, sources familiar with the proposal said.\nThe move dovetails with President Donald Trump's promise to expand domestic energy production, but will come over the objections of environmentalists, state officials, and some business groups worried about spills and coastal tourism.\nInterior Secretary Ryan Zinke will unveil the updated National Outer Continental Shelf Oil and Gas Leasing Program at 13:00 EST, the department said in a press release. It would replace the Obama administration's five-year leasing plan, and is expected to open up more areas to offshore drilling, including previously off-limits federal waters off the Atlantic, Arctic and Pacific coasts.\nWeeks before leaving office, former President Barack Obama had banned new oil and gas drilling in federal waters in the Atlantic and Arctic oceans, protecting 115 million acres (46.5 million hectares) of waters off Alaska and 3.8 million acres in the Atlantic from New England to the Chesapeake Bay.\nBut Trump last April ordered the Interior Department to overhaul the existing offshore drilling plan.\nIn his executive order, Trump said it was U.S. policy to \"encourage energy exploration and production... in order to maintain the nation's position as a global energy leader and foster energy security and resilience for the benefit of the American people.\"\nThe proposal comes as low oil prices and soaring onshore production have curtailed industry demand for offshore leases, raising questions about the benefits of the move.\nAhead of Thursday's announcement, lawmakers from both parties, environmental groups, and local business leaders along the Atlantic coast said they are opposed to any effort to open up their coastlines to drilling rigs, citing environmental risks and threats to their lucrative tourism industries.\nA spokesman for Florida Republican Governor Rick Scott said in a statement on Wednesday that he \"is aggressively fighting to protect Floridas environment by proposing more than $3.8 billion to preserve it.\"\nCoastal tourism business groups are girding for a long fight against the Interior Department.\nFrank Knapp, founder of the South Carolina Small Business Chamber of Commerce, accused the Interior Department of favoring the oil and gas sector over the tourism sector.\nWhat part of the business sector are they listening to? Its certainly not small or coastal businesses whose livelihoods are dependent on healthy oceans, Knapp said. (Reporting By Valerie Volcovici; Editing by Nick Zieminski)", "external_links": [], "published": "2018-01-04T17:32:00.000+02:00", "crawled": "2018-01-05T04:35:18.000+02:00", "highlightTitle": ""}