{"organizations": [], "uuid": "dcbe3c51838702fa6eb3ecb2d0bcd349265968d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-main-street-announces-preliminary-estimate-of-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "Main Street Announces Preliminary Estimate of Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "dcbe3c51838702fa6eb3ecb2d0bcd349265968d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-main-street-announces-preliminary-estimate-of-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "Main Street Announces Preliminary Estimate of Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "main street capital corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 16, 2018 /PRNewswire/ -- Main Street Capital Corporation (NYSE: MAIN) (\"Main Street\") is pleased to announce its preliminary operating results for the fourth quarter of 2017, the tax treatment of its 2017 dividends and its fourth quarter and full year 2017 earnings release and conference call schedule.\nPreliminary Estimates of Fourth Quarter 2017 Results\nMain Street's preliminary estimate of fourth quarter 2017 distributable net investment income (\"DNII\"), which is net investment income before non-cash, share-based compensation expense, is $0.68 to $0.69 per share. (1) Main Street's preliminary estimate of net investment income is $0.63 to $0.64 per share. The preliminary estimate of DNII significantly exceeds both the regular monthly dividends paid per share for the fourth quarter of 2017 of $0.57 per share and the previously provided DNII guidance range for the fourth quarter of 2017 of between $0.61 and $0.63 per share.\nMain Street's preliminary estimate of net asset value (\"NAV\") per share as of December 31, 2017 is $23.48 to $23.58. After adjustment for the semi-annual supplemental dividend paid in December 2017 of $0.275 per share, this represents an increase of approximately $0.74 to $0.84 per share, or 3.2% to 3.6%, from the reported NAV per share of $23.02 as of September 30, 2017. Main Street estimates that the increase in NAV per share is primarily due to net unrealized appreciation relating to its Lower Middle Market portfolio investments and the accretive impact from equity issued under its at-the-market equity program. Furthermore, Main Street estimates that approximately 40% to 50% of the net unrealized appreciation relating to its Lower Middle Market portfolio investments is due to the favorable impact from the recently passed U.S. tax reform on the valuations of its equity investments in Lower Middle Market portfolio companies.\nFederal Tax Treatment of 2017 Dividends\nMain Street has posted information regarding the U.S. federal income tax characteristics of its dividends that are attributable to 2017 on its website under \"2017 Form 1099 Information\" ( http://ir.mainstcapital.com/tax-information ). Main Street paid dividends totaling $2.79 per share that are attributable to 2017 for tax purposes, with approximately 17.6% of such dividends taxed as long-term capital gains, approximately 3.0% taxed as qualified dividends and approximately 79.4% taxed as ordinary income. Long-term capital gains and qualified dividends paid to non-corporate taxpayers (including individuals) qualify for favorable tax treatment under the Internal Revenue Code (\"IRC\") and, for 2017, will generally be subject to a maximum 20% U.S. federal income tax rate (plus a 3.8% Medicare surtax, if applicable).\nFederal Tax Treatment of 2017 Dividends – Non-U.S. Shareholders\nNon-U.S. resident and foreign corporation shareholders (\"Non-U.S. Shareholders\") in a Regulated Investment Company (\"RIC\") such as Main Street are exempt from U.S. withholding tax on both \"interest-related\" dividends and short-term capital gains in accordance with the IRC sections 871(k) and 881(e). In addition, Non-U.S. Shareholders in a RIC are also exempt from U.S. withholding tax on long-term capital gains. Main Street paid dividends totaling $2.79 per share that are attributable to 2017 for tax purposes, with approximately 75.8% of such dividends relating to \"interest-related\" dividends, short-term capital gains and long-term capital gains. See the \"Tax Treatment of 2017 Dividends for Non-U.S. Shareholders\" posted on Main Street's website for more details ( http://ir.mainstcapital.com/tax-information ).\nTo the extent Non-U.S. Shareholder taxes were withheld on dividends distributed, this information may be considered in connection with any claims for refund of taxes made with the U.S. Internal Revenue Service. Non-U.S. Shareholders should contact their tax advisor with any questions regarding this information.\nFourth Quarter and Full Year 2017 Earnings Release and Conference Call Scheduled\nMain Street's fourth quarter and full year 2017 results will be released on Thursday, February 22, 2018, after the financial markets close. In conjunction with the release, Main Street has scheduled a conference call, which will be broadcast live via phone and over the Internet, on Friday, February 23, 2018, at 10:00 a.m. Eastern time. Investors may participate either by phone or audio webcast.\nBy Phone :\nDial 412-902-0030 at least 10 minutes before the call. A replay will be available through March 2, 2018 by dialing 201-612-7415 and using the access code 13674997#.\nBy Webcast :\nConnect to the webcast via the Investor Relations section of Main Street's website at www.mainstcapital.com . Please log in at least 10 minutes in advance to register and download any necessary software. A replay of the conference call will be available on Main Street's website shortly after the call and will be accessible for approximately 90 days.\nABOUT MAIN STREET CAPITAL CORPORATION\nMain Street ( www.mainstcapital.com ) is a principal investment firm that primarily provides long-term debt and equity capital to lower middle market companies and debt capital to middle market companies. Main Street's portfolio investments are typically made to support management buyouts, recapitalizations, growth financings, refinancings and acquisitions of companies that operate in diverse industry sectors. Main Street seeks to partner with entrepreneurs, business owners and management teams and generally provides \"one stop\" financing alternatives within its lower middle market portfolio. Main Street's lower middle market companies generally have annual revenues between $10 million and $150 million. Main Street's middle market debt investments are made in businesses that are generally larger in size than its lower middle market portfolio companies.\nMain Street's common stock trades on the New York Stock Exchange (\"NYSE\") under the symbol \"MAIN.\" In addition, Main Street has outstanding 6.125% Notes due 2023, which trade on the NYSE under the symbol \"MSCA.\"\nFORWARD-LOOKING STATEMENTS AND OTHER MATTERS\nMain Street cautions that statements in this press release which are forward‑looking and provide other than historical information, including but not limited to the preliminary estimates of fourth quarter 2017 results, involve risks and uncertainties that may impact its future results of operations. The forward‑looking statements in this press release are based on current conditions and include statements regarding Main Street's goals, beliefs, strategies and future operating results and cash flows. Although its management believes that the expectations reflected in those forward‑looking statements are reasonable, Main Street can give no assurance that those expectations will prove to have been correct. Those statements are made based on various underlying assumptions and are subject to numerous uncertainties and risks, including, without limitation: Main Street's continued effectiveness in raising, investing and managing capital; adverse changes in the economy generally or in the industries in which its portfolio companies operate; chang", "external_links": ["http://ir.mainstcapital.com/tax-information", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/main-street-announces-preliminary-estimate-of-fourth-quarter-2017-results-300582876.html", "http://www.mainstcapital.com/"], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T17:09:32.001+02:00", "highlightTitle": ""}