{"organizations": [], "uuid": "64425d084333f0c6c0c2613a78aee2d63f0a173d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224240238&w=1200&r=LYNXMPEE0L1VZ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-eurozone-greece-eurogroup/euro-zone-to-disburse-new-loans-to-greece-when-all-reforms-are-done-statement-idINKBN1FB2MP", "country": "US", "domain_rank": 408, "title": "Euro zone to disburse new loans to Greece when all reforms are done - statement", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:02:00.000+02:00", "replies_count": 0, "uuid": "64425d084333f0c6c0c2613a78aee2d63f0a173d"}, "author": "", "url": "https://in.reuters.com/article/us-eurozone-greece-eurogroup/euro-zone-to-disburse-new-loans-to-greece-when-all-reforms-are-done-statement-idINKBN1FB2MP", "ord_in_thread": 0, "title": "Euro zone to disburse new loans to Greece when all reforms are done - statement", "locations": [], "entities": {"persons": [], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "esm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Euro zone finance ministers welcomed Greek progress in delivering reforms but said on Monday they would only disburse the next tranche of loans once all agreed actions are complete.\nWhile Athens may have to wait until February for the money from the euro zone bailout fund ESM, the ministers said they would start technical work on more debt relief for Greece that could be granted after the end of the bailout in August.\nTo pay out new loans, international lenders have asked Greece first to adopt 110 “prior actions”.\nTo meet that condition, Greece’s parliament passed a so-called omnibus bill last week. Lenders’ experts said, however, that so far only 92 of the agreed steps were implemented.\n“The Eurogroup welcomes the implementation of almost all of the agreed prior actions,” the statement said. “The Eurogroup calls on the Greek authorities to complete the outstanding prior actions as a matter of urgency,” it said.\n“Following the full implementation of the prior actions and subject to the completion of national procedures, the ESM governing bodies are expected to ... approve the disbursement of the fourth tranche,” the ministers’ statement said.\nThe new loans worth 6.7 billion euros would be disbursed in two tranches, starting in February with 5.7 billion euros for debt servicing needs. A further 1 billion could be paid out in April, ESM head Klaus Regling told a news conference.\nGreek Finance Minister Euclid Tsakalotos told reporters after the meeting Greece was pleased with the result because the last stage of the bailout did not foresee as many prior actions as the one just completed and talks could start on debt relief.\nThe technical work will be done by junior finance ministers and treasury officials from euro zone countries -- the Eurogroup Working Group (EWG) -- in a bid to link the size of potential debt relief to Greece’s economic performance over time.\n“The Eurogroup confirms the start of the technical work by the EWG on the growth-adjustment mechanism, as part of the medium-term debt relief measures to be implemented, if needed, following the successful conclusion of the program,” the statement said.\nSuch a growth-linked mechanism could help bridge the gap between some euro zone countries like Germany, which believe Greece may not need any further debt relief, and the International Monetary Fund, which insists on substantial debt relief for Athens now, if it is to take part in the bailout.\nOne of the main reasons why the IMF and Germany are at odds over the need for debt relief is different growth forecasts for Greece over the next 40 years.\nThe euro zone is more optimistic about growth in Greece than the IMF and even small differences in forecasts, accrued over such a long period, produce starkly different effect on debt projections.\nEuro zone ministers called in the statement on the various institutions involved to converge in their views in order to produce a reliable debt sustainability analysis (DSA).\n“The Eurogroup invites the European institutions and the IMF to take into account the holistic Greek growth strategy when updating the DSA,” the statement said.\nReporting By Jan Strupczewski in Brussels and Renee Maltezou in Athens; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-22T21:02:00.000+02:00", "crawled": "2018-01-22T21:33:14.016+02:00", "highlightTitle": ""}