{"organizations": [], "uuid": "3b87edf860eca138ad1d482ecc2db2f9d1712528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/07/07/101816693-RTR3JEFX.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/puerto-rico-will-try-and-privatize-its-bankrupt-power-utility.html", "country": "US", "domain_rank": 767, "title": "Puerto Rico will try and privatize its bankrupt power utility", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.612, "site_type": "news", "published": "2018-01-23T04:23:00.000+02:00", "replies_count": 0, "uuid": "3b87edf860eca138ad1d482ecc2db2f9d1712528"}, "author": "Dawn Giel", "url": "https://www.cnbc.com/2018/01/22/puerto-rico-will-try-and-privatize-its-bankrupt-power-utility.html", "ord_in_thread": 0, "title": "Puerto Rico will try and privatize its bankrupt power utility", "locations": [], "entities": {"persons": [{"name": "ana martinez", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "san juan", "sentiment": "none"}, {"name": "prepa", "sentiment": "none"}], "organizations": [{"name": "puerto rico", "sentiment": "negative"}, {"name": "puerto rico electric power authority", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The governor of Puerto Rico announced Monday his intentions to privatize the island's beleaguered power utility.\nThe announcement comes just two days before the bankrupt Puerto Rico Electric Power Authority, or \"PREPA,\" is due to submit a revised fiscal plan following the destruction of Hurricane Maria.\nThe nearly category 5 storm made landfall on Sept. 20 and left the island's electrical grid in shambles — after more than 100 days, some residents still haven't had power restored.\n\"The Puerto Rico Electric Power Authority (PREPA) has become a heavy burden on our people, who are now hostage to its poor service and high cost. What we know today as the Puerto Rico Electric Power Authority does not work and cannot continue to operate like this,\" Gov. Ricardo Rossello said.\nGov. Rossello gave an overview of how he envisions the 18-month privatization process would work.\n\"The Puerto Rico Electric Power Authority will cease to exist as it deficiently operates today. Over the next few days the process will start, through which PREPA assets will be sold to companies who will transform the generation system into a modern, efficient, and less expensive one for the people,\" he said.\nThe three-phase process would start with defining the legal framework through legislation and then opening the market to interested companies. Offers from companies would then be made and then, in the final phase, the terms of awarding and hiring the selected companies would be negotiated.\nSome experts said, however, that there are crucial components being overlooked.\n\"One of the key considerations that Gov. Rossello neglected to mention in his announcement was that PREPA's bondholders — as well as municipal bond insurers MBIA and Assured Guaranty — have a permanent contractual lien on the utility's net revenues,\" said Mark Palmer, an analyst at BTIG, in a research note issued late on Monday.\n\"We believe it would not be feasible for Puerto Rico to sell PREPA's assets without the net revenue lien following those assets to the benefit of AGO [Assured Guaranty], MBI [MBIA] and bondholders. We also believe that before a privatization of the utility could occur those creditors would have to be satisfied such that it could exit the Title III debt restructuring. While Puerto Rico may attempt such an end-around maneuver, we doubt that it would pass muster with the courts,\" Palmer, who covers MBIA and Assured Guaranty, said.\nPREPA has approximately $9 billion in outstanding debt and entered Title III bankruptcy proceedings in July 2017.\nBoth U.S. District Judge Laura Taylor Swain, who is overseeing the island's bankruptcy-like proceedings, and the seven-member federally appointed Oversight Board, will have to approve of the governor's plan for PREPA before it can go forward.\n\"We have long said that a full operational and financial transformation of PREPA — including private investment — is necessary to deliver the resilient, reliable, and cost effective power system that Puerto Rico needs for its economic recovery,\" a spokesman for the Oversight Board said in a written statement. \"The Oversight Board welcomes the Governor's announcement, looks forward to reviewing the Government's plans, and intends to incorporate any transformation of PREPA into the revised Fiscal Plan, which it expects to certify on February 23, 2018.\"\nThe deadline for PREPA, Puerto Rico Aqueducts and Sewers Authority (PRASA) and the Commonwealth to submit their revised fiscal plans following Hurricane Maria's destruction is on Wednesday. All three entities were given a two-week deadline extension to file.", "external_links": [], "published": "2018-01-23T04:23:00.000+02:00", "crawled": "2018-01-23T04:23:15.000+02:00", "highlightTitle": ""}