{"organizations": [], "uuid": "ca87968919dd78a0e25c68cb5e56235ea2e0d451", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-two-idUKL3N1PB2E9", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Tennis-Australian Open day two", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T09:17:00.000+02:00", "replies_count": 0, "uuid": "ca87968919dd78a0e25c68cb5e56235ea2e0d451"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-two-idUKL3N1PB2E9", "ord_in_thread": 0, "title": "HIGHLIGHTS-Tennis-Australian Open day two", "locations": [], "entities": {"persons": [{"name": "aiava", "sentiment": "none"}, {"name": "destanee aiava", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "halep", "sentiment": "none"}, {"name": "destanee", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "serena", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne park  sharapova", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "donald young", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 7:21 AM / Updated 11 minutes ago WRAPUP 1-HIGHLIGHTS-Tennis-Australian Open day two Reuters Staff 8 Min Read \nMELBOURNE, Jan 16 (Reuters) - Defending champion Roger Federer cruised to victory at the Australian Open on Tuesday and was joined in the second round by former champions Novak Djokovic and Stan Wawrinka. \nFederer, bidding for his 20th grand slam title, beat Aljaz Bedene 6-3 6-4 6-3 at Melbourne Park, Djokovic defeated Donald Young 6-1 6-2 6-4 and Wawrinka battled to a 6-3 6-4 2-6 7-6(2) win over Lithuanian Ricardas Berankis. \nIn the women’s draw, world number one Simona Halep beat 17-year-old Destanee Aiava 7-6(5) 6-1 as top players including Garbine Muguruza, Maria Sharapova, Angelique Kerber, Karolina Pliskova and Johanna Konta registered opening victories. \nKristina Mladenovic and Petra Kvitova were the surprise early exits in the women’s singles while Canadian Milos Raonic, seeded 23rd, was the biggest upset loser on the men’s side. \nLeading men’s contenders Alexander Zverev, Dominic Thiem, Juan Martin Del Potro, Tomas Berdych and David Goffin booked second-round spots. READ MORE \nSublime Federer breezes through Melbourne opener \nSandgren claims first grand slam win to land Wawrinka clash \nPressure will determine whether Djokovic is back - Wilander \nPetkovic dumps Kvitova out of Australian Open after marathon \nWawrinka happy to be back, still feeling pain \nDjokovic delighted after elbowing out Young \nNovak Djokovic v Donald Young - match stats \nMy brother still makes fun of me, says Zverev \nHalep survives date with Destanee to advance \nKerber consigns 2017 to the history books \nRaonic slumps to early exit at Melbourne Park \nSharapova enjoys winning return to Melbourne \nDjokovic dismisses talk of boycott over purses \nAggressive Konta makes light work of Brengle \nOrder of play on Wednesday \nHighlights of Tuesday’s second day of the Australian Open, the first grand slam tournament of the year: 1225 BARTY BATTLES PAST SABALENKA \nAustralian 18th-seed Ashleigh Barty beat Belarus’ Aryna Sabalenka 6-7(7) 6-4 6-4 in the first round but faces a tough test against Italian Camila Giorgi in the next stage. 1215 DEL POTRO RUMBLES THROUGH TO SECOND ROUND \nArgentine Juan Martín del Potro, who last played at the Australian Open in 2014, battled to a 6-3 6-4 6-3 win over American Frances Tiafoe to set up a second-round clash with Russia’s Karen Khachanov. 1115 THIEM CRUISES PAST PELLA \nAustrian fifth-seed Dominic Thiem brushed Argentina’s Guido Pella aside with a dominant 6-4 6-4 6-4 win and will face American qualifier Denis Kudla in the second round. 1050 PUTINTSEVA PULLS OFF WATSON UPSET \nKazakhstan’s Yulia Putintseva earned a hard-fought 7-5 7-6(6) victory over Heather Watson, meaning Johanna Konta and Kyle Edmund are the only British hopes left to claim the Melbourne Park title. 1015 BERDYCH ENDS DE MINAUR RUN \nCzech 19th-seed Tomas Berdych ended Australian youngster Alex De Minaur’s strong start to the season with a 6-3 3-6 6-0 6-1 win over the 18-year-old. 1000 FEDERER CRUISES INTO ROUND TWO \nDefending champion Roger Federer, chasing his 20th grand slam title, beat Slovenian Aljaz Bedene 6-3 6-4 6-3 to reach the second round. It was the 36-year-old’s 88th win in 101 matches at Melbourne Park. \nFederer will next face Germany’s Jan-Lennard Struff, who hit 45 winners, including 19 aces, past wildcard Kwon Soon-woo of South Korea in a 6-1 6-2 6-4 victory in 77 minutes. 0940 MUGURUZA MARCHES ON TO SECOND ROUND \nWorld number three Garbine Muguruza breezed into the second round with a 6-4 6-3 win over French wildcard Jessika Ponchet. 0845 PETKOVIC STUNS KVITOVA IN MARATHON \nGerman Andrea Petkovic won the final three games to beat two-time Wimbledon winner Petra Kvitova 6-3 4-6 10-8 in a thrilling first-round encounter, which lasted two hours and 52 minutes. 0645 HALEP SURGES PAST AIAVA \nWorld number one Simona Halep overcame an ankle injury to move on to the next round after a 7-6(5) 6-1 victory over Australian teenager Destanee Aiava. \nHalep praised Aiava, ranked 193 in the world, for her booming groundstrokes, which helped earn the 17-year-old wildcard two set points in the opener. \n“She’s a little bit like Serena (Williams), she’s hitting the ball strong, she’s a powerful girl and for sure she will be good in the future.” Halep said. 0610 DOMINANT DJOKOVIC BOOKS SECOND ROUND SPOT \nSix-time Australian Open champion Novak Djokovic beat American Donald Young 6-1 6-2 6-4 to reach the second round for a 12th consecutive year. \n“A month ago I didn’t know if I was going to come to Australia or not because the elbow was still not prepared for this level of competition,” Djokovic, playing his first match since Wimbledon last year, said in an on-court interview. 0555 WAWRINKA PREVAILS IN TRICKY RETURN \nFormer Australian Open champion Stan Wawrinka battled to a 6-3 6-4 2-6 7-6(2) victory over Lithuanian Ricardas Berankis in his first competitive match since July. 0530 BOUCHARD ENDS LOSING STREAK \nCanadian Eugenie Bouchard ended a six-match losing run on the tour by beating France’s Oceane Dodin 6-3 7-6(5). 0525 GOFFFIN BEGINS 2018 IN STYLE \nSeventh seed David Goffin started his 2018 season with 55 winners to seal a 6-7(3) 6-3 6-2 6-4 win over German qualifier Matthias Bachinger. 0520 KERBER LOOKS AHEAD AFTER FIRST ROUND WIN \nFormer Australian Open champion Angelique Kerber, flying from her title-winning run in Sydney, needed a little more than an hour to fellow German Anna-Lena Friedsam 6-0 6-4. \n“2017, I have said goodbye already, I am not looking back,” Kerber, who failed to claim a title last year, said after the match. \n“I‘m feeling good and trying to continue how I have played in the last few weeks. I‘m just trying to enjoy it again on court.” 0430 ZVEREV SAILS THROUGH \nWorld number four Alexander Zverev opened with a 6-1 7-6(5) 7-5 first round victory over Italian Thomas Fabbiano. 0330 QUERREY ADVANCES \nAmerican Sam Querrey, a quarter-finalist last year, began his campaign with a 6-3 6-4 6-2 win over Spanish veteran Feliciano Lopez. 0325 SASNOVICH ADVANCES \nBrisbane finalist Aliaksandra Sasnovich claimed a convincing 6-3 6-2 win over American Christina McHale. 0320 SHARAPOVA STROLLS INTO ROUND TWO \nFormer world number one Maria Sharapova, the 2008 winner in Melbourne, progressed to the second round with a 6-1 6-4 victory over German Tatjana Maria. 0220 VERDASCO POWERS PAST BAUTISTA AGUT \nSpaniard Fernando Verdasco, a semi-finalist in 2009, recorded 41 winners to upset 20th-seeded compatriot Roberto Bautista Agut 6-1 7-5 7-5. 0150 PLISKOVA THROUGH TO ROUND TWO \nSixth seed Karolina Pliskova kept her hopes of lifting a maiden grand slam titles alive with a 6-3 6-4 victory over Paraguayan Veronica Cepede Royg in the first round. \n“The first one is always the toughest for me... Hopefully I take it match-by-match and I think I’ll have a good chance,” Pliskova, who reached the quarter-finals in Melbourne last year, said after the match. 0140 GARCIA SURGES PAST WITTHOEFT \nEighth seed Caroline Garcia overcame big-hitting German Carina Witthoeft 7-5 6-3. 0130 KONTA CRUISES PAST BRENGLE \nNinth seeded Briton Johanna Konta skipped past Madison Brengle into the second round, overpowering the American 6-3 6-1 in 66 ", "external_links": [], "published": "2018-01-16T09:17:00.000+02:00", "crawled": "2018-01-16T09:51:07.003+02:00", "highlightTitle": ""}