{"organizations": [], "uuid": "a4bc6271b7f97be4c6910769ec096016af3a4cbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221314211&w=1200&r=LYNXMPEE0B04E", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-hna-group-anz-bank/anz-drops-plans-to-sell-unit-to-hna-after-new-zealand-blocks-deal-idUSKBN1F107P", "country": "US", "domain_rank": 408, "title": "ANZ drops plans to sell unit to HNA after New Zealand blocks deal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-12T10:40:00.000+02:00", "replies_count": 0, "uuid": "a4bc6271b7f97be4c6910769ec096016af3a4cbf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hna-group-anz-bank/anz-drops-plans-to-sell-unit-to-hna-after-new-zealand-blocks-deal-idUSKBN1F107P", "ord_in_thread": 0, "title": "ANZ drops plans to sell unit to HNA after New Zealand blocks deal", "locations": [], "entities": {"persons": [{"name": "ambar warrick", "sentiment": "none"}, {"name": "edwina gibbs", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "new zealand banking group ltd", "sentiment": "negative"}, {"name": "hna", "sentiment": "negative"}, {"name": "anz", "sentiment": "negative"}, {"name": "udc finance", "sentiment": "none"}, {"name": "hna group", "sentiment": "none"}, {"name": "overseas investment office", "sentiment": "none"}, {"name": "udc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Australia and New Zealand Banking Group Ltd ( ANZ.AX ) has dropped plans to sell its vehicle finance unit to HNA Group after New Zealand blocked the $460 million deal last month over concerns about the Chinese conglomerate’s ownership structure.\nHNA had agreed to buy UDC Finance, New Zealand’s largest non-bank lender, early last year. But in December New Zealand’s Overseas Investment Office cited uncertainty over HNA’s ownership structure for the rejection.\nThe failed bid for UDC Finance adds to recent setbacks that the aviation-to-property Chinese conglomerate has faced in its overseas push into the financial sector after spending $50 billion over the past two years in debt-fueled acquisitions.\nThese include large minority stakes in Deutsche Bank ( DBKGn.DE ) and the U.S. operations of Old Mutual Asset Management.\nHNA’s July announcement indicating two named shareholders were actually acting as proxies for the company’s founding executives has increased international concerns about the group’s transparency and governance, resulting in heightened scrutiny and due diligence checks from financial regulators and some global banks.\nThe UDC sale, which ANZ called off on Friday, was part of the lender’s plans to offload assets to meet new capital requirements. ANZ had warned last month that it would back out of the deal unless HNA managed to get the decision of the New Zealand regulator overturned.\nHNA said on Friday it had nothing further to add at this time beyond its statement on the deal last month. It had said at that time the New Zealand watchdog’s decision was inconsistent with the views of other regulators around the world that had approved HNA and other Chinese investments.\nThe failed UDC transaction comes a week after HNA’s talks with Value Partners Group ( 0806.HK ) over purchase of a stake in the Hong Kong-listed asset manager were called off, hurting its plan to expand beyond its base in airlines, tourism and logistics.\nFinancial services accounted for about 17 percent of the group’s operating revenue of 183 billion yuan ($28.22 billion), and more than 40 percent of gross profit in 2016, led by its financial leasing operations, an HNA Group bond filing shows.\nPressure on HNA’s finances has risen after the Chinese government told major banks in June to review their credit exposure to the conglomerate and a handful of other non-state companies.\nThe financial strains and increased borrowing costs have slowed its deal making pace and raised concerns about the group’s liquidity situation.\nHNA is in talks with a leading Hong Kong property developer for a loan to refinance its repayment liabilities linked to a land parcel in the Asian financial hub, sources told Thomson Reuters Loan Pricing Corp on Thursday.\nANZ said on Friday it would continue to assess its strategic options regarding UDC.\n“It’s a setback, yes...but it’s not a bad outcome if they don’t sell it, it’s profitable, it generates good return on equity and fits nicely within the group business,” said David Ellis, an analyst at research firm Morningstar in Sydney.\n“I’d say they will have a good chance of finding another buyer.”\nReporting by Ambar Warrick in Bengaluru and Sumeet Chatterjee in Hong Kong; Additional reporting by Matt Miller in Beijing, Tom Westbrook and Paulina Duran in Sydney; Editing by Edwina Gibbs and Muralikumar Anantharaman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T10:40:00.000+02:00", "crawled": "2018-01-12T04:46:47.000+02:00", "highlightTitle": ""}