{"organizations": [], "uuid": "f537a6abe97dfe9bdf01b52fe620049bf4b88359", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/01/104140279-GC-Image5.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/self-made-millionaire-grant-cardone-become-more-valuable-at-your-job.html", "country": "US", "domain_rank": 767, "title": "Self-made millionaire Grant Cardone: Become more valuable at your job", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-22T22:38:00.000+02:00", "replies_count": 0, "uuid": "f537a6abe97dfe9bdf01b52fe620049bf4b88359"}, "author": "Grant Cardone", "url": "https://www.cnbc.com/2018/01/22/self-made-millionaire-grant-cardone-become-more-valuable-at-your-job.html", "ord_in_thread": 0, "title": "Self-made millionaire Grant Cardone: Become more valuable at your job", "locations": [], "entities": {"persons": [{"name": "grant cardone", "sentiment": "negative"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3:00 PM ET Mon, 15 May 2017 | 00:56 SHARES \nValue, really, is just a fancy way of saying something creates worth. If something matters, it has worth and becomes important to people. \nHow can you become more important to people that you work with? Here are three steps to take: Understand your real value \nHaving worth is not limited to a specific job title. You have to think bigger than the description on your business card. There's always someone next in line with similar or even better skills. \nIt's going to be difficult for you to advance in life and increase your income if you don't start to think this way. Creating value at your existing job is about distinguishing yourself from your job title. To be clear, I'm not suggesting you give up your current responsibilities. Far from it. \nIf you had to label me, what would you say? Sales trainer, mentor, real estate investor, money fanatic? You could probably come up with a hundred ways to describe me but you can't put me in a box with one word or title. \nI'm worth something to a wide range of people in a variety of fields. The descriptions keep coming because my focus is on creating value, not on a particular role. \nInstead of thinking of yourself as your job — programmer, graphic designer, lawyer, real estate agent, sale professional — think of yourself as a business that creates beneficial exchanges between groups of people. Courtesy of Grant Cardone Operate as a business \nUnderstand that you don't start a business. You are a business. \nHow does that happen? You just have to choose it. All a business is is an entity that makes a living by engaging in commerce. \nYou don't need to file an LLC. You're already a money-making, idea-generating, creation machine. Become a unique proposition with the goal of exchanging something of worth. \nEven my daughter thinks of herself as a business. She understands that she can build and bring value because she is a unique proposition. You can do the same at your company. Branch out \nI've always said that the holy grail to wealth is creating multiple flows of income. That's true for you personally and for your company. Now you get what creating value is and you're looking for ways to create it as a business within your company. It comes down to creating multiple flows of value. \nWhen you shift your mindset, you'll start to look for opportunities where you can exchange value. These will fall outside of your current job that might even create a new role for you. \"You don't start a business. You are a business.\" \nTake Robert, my video guy, for example. He came to me and said, \"Hey, what else can I do here?\" I said, \"Let's sell some other products here. Let's sell some video production. Let's produce video for people. Let's produce video that's so sick that other companies want to call us. Why don't we produce some advertising, some commercials?\" \nThis was a perfect scenario because it piggybacked off of Robert's existing skills. Now he has three streams of income instead of just one and he's more than doubled his earnings from the previous year. He not only created more value for my company but also for himself. \nOperate yourself like a business. Brainstorm what you can do at your job to earn more money. The goal is to become something bigger than a specific job title. Whatever it is you do, get a second value flow and watch the income and your worth to the company grow.", "external_links": [], "published": "2018-01-22T22:38:00.000+02:00", "crawled": "2018-01-22T22:44:25.031+02:00", "highlightTitle": ""}