{"organizations": [], "uuid": "fbbef1f5deebdfdb993f2a1cc8ff62ff36fdcb3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222337814&w=1200&r=LYNXMPEE0F0CM", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-oil-record-shale-analysis/u-s-oil-industry-set-to-break-record-upend-global-trade-idUSKBN1F50HV", "country": "US", "domain_rank": 408, "title": "U.S. oil industry set to break record, upend global trade", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:16:00.000+02:00", "replies_count": 0, "uuid": "fbbef1f5deebdfdb993f2a1cc8ff62ff36fdcb3f"}, "author": "", "url": "https://www.reuters.com/article/us-usa-oil-record-shale-analysis/u-s-oil-industry-set-to-break-record-upend-global-trade-idUSKBN1F50HV", "ord_in_thread": 0, "title": "U.S. oil industry set to break record, upend global trade", "locations": [], "entities": {"persons": [{"name": "liz hampton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 6:16 AM / Updated 3 minutes ago U.S. oil industry set to break record, upend global trade Liz Hampton 9 Min Read \nHOUSTON (Reuters) - Surging shale production is poised to push U.S. oil output to more than 10 million barrels per day - toppling a record set in 1970 and crossing a threshold few could have imagined even a decade ago. \nAnd this new record, expected within days, likely won’t last long. The U.S. government forecasts that the nation’s production will climb to 11 million barrels a day by late 2019, a level that would rival Russia, the world’s top producer. \nThe economic and political impacts of soaring U.S. output are breathtaking, cutting the nation’s oil imports by a fifth over a decade, providing high-paying jobs in rural communities and lowering consumer prices for domestic gasoline by 37 percent from a 2008 peak. \nFears of dire energy shortages that gripped the country in the 1970s have been replaced by a presidential policy of global “energy dominance.” \n“It has had incredibly positive impacts for the U.S. economy, for the workforce and even our reduced carbon footprint” as shale natural gas has displaced coal at power plants, said John England, head of consultancy Deloitte’s U.S. energy and resources practice. \nU.S. energy exports now compete with Middle East oil for buyers in Asia. Daily trading volumes of U.S. oil futures contracts have more doubled in the past decade, averaging more than 1.2 billion barrels per day in 2017, according to exchange operator CME Group. \nThe U.S. oil price benchmark, West Texas Intermediate crude, is now watched closely worldwide by foreign customers of U.S. gasoline, diesel and crude. \nThe question of whether the shale sector can continue at this pace remains an open debate. The rapid growth has stirred concerns that the industry is already peaking and that production forecasts are too optimistic. \nThe costs of labor and contracted services have recently risen sharply in the most active oilfields; drillable land prices have soared; and some shale financiers are calling on producers to focus on improving short-term returns rather than expanding drilling. \nBut U.S. producers have already far outpaced expectations and overcome serious challenges, including the recent effort by the Organization of the Petroleum Exporting Countries (OPEC) to sink shale firms by flooding global markets with oil. \nThe cartel of oil-producing nations backed down in November 2016 and enacted production cuts amid pressure from their own members over low prices - which had plunged to below $27 earlier that year from more than $100 a barrel in 2014. \nShale producers won the price war through aggressive cost-cutting and rapid advances in drilling technology. Oil now trades above $64 a barrel, enough for many U.S. producers to finance both expanded drilling and dividends for shareholders. BOOMING OIL EXPORTS \nEfficiencies spurred by the battle with OPEC - including faster drilling, better well designs and more fracking - helped U.S. firms produce enough oil to successfully lobby for the repeal of a ban on oil exports. In late 2015, Congress overturned the prohibition it had imposed following OPEC’s 1973 embargo. \nThe United States now exports up to 1.7 million barrels per day of crude, and this year will have the capacity to export 3.8 billion cubic feet per day of natural gas. Terminals conceived for importing liquefied natural gas have now been overhauled to allow exports. \nThat export demand, along with surging production in remote locations such as West Texas and North Dakota, has led to a boom in U.S. pipeline construction. Firms including Kinder Morgan and Enterprise Products Partners added 26,000 miles of liquids pipelines in the five years between 2012 and 2016, according to the Pipeline and Hazardous Materials Safety Administration. Several more multi-billion-dollar pipeline projects are on the drawing board. \nU.S. drillers say they can supply plenty more. \n“We continue to see and drive improvements” in drilling speed and efficiency, said Mathias Schlecht, a technology vice president at Baker Hughes, General Electric Co’s oilfield services business. \nNew wells can be drilled in as little as a week, he said. A few years ago, it could take up to a month. TECHNOLOGY OPENS UP NEW FIELDS \nThe next phase of shale output growth depends on techniques to squeeze more oil from each well. Companies are now putting sensors on drill bits to more precisely access oil deposits, using artificial intelligence and remote operators to get the most out of equipment and trained engineers. \nAs expanded investments push more producers to add wells in less productive regions, technology will help make those plays more profitable, said Kate Richard, chief executive of Warwick Energy Group, which owns interests in more than 5,000 U.S. wells. \nIn an interview, she estimated about a third of the money from private equity investments in shale will be used to wring more oil from overlooked regions. \nHigher prices - up about $10 a barrel in the last two months - also may encourage the industry to work through a backlog of some 7,300 drilled-but-uncompleted shale wells that have built up because of crew and equipment shortages. \nThe higher prices have suppliers that provide hydraulic fracturing services, such as Keane Group and Liberty Oilfield Services, buying expensive new equipment in anticipation of more work. \nU.S. fracking service revenues are expected to grow by 20 percent this year, approaching a record of $29 billion set in 2014, according to oilfield research firm Spears & Associates. OIL MAJORS JOIN SHALE FRAY \nThe shale revolution initially upended the traditional industry hierarchy, making billionaires out of wildcatters such as Harold Hamm, who founded Continental Resources, and the late Aubrey McClendon of Chesapeake Energy. \nTop U.S. oil firms such as Exxon Mobil and Chevron a decade ago turned much of their focus to foreign fields, leaving smaller firms to develop U.S. shale. Now they’re back, buying shale companies, land and shifting more investments back home from overseas. \nExxon last year agreed to pay up to $6.6 billion for land in the Permian basin, the epicenter of U.S. shale. Chevron this year plans to spend $4.3 billion on shale development. \nThe majors’ shift is driving up costs for labor and drillable land in the region, another boost to wages and wealth in rural areas. \nIn the shale industry hub of Midland, Texas, unemployment has fallen to a mere 2.6 percent, said Willie Taylor, executive director of the Permian Basin Workforce Development Board, a group that helps firms find staff. \nCompanies are now offering signing bonuses to attract workers to West Texas. One oil company flies workers to Midland from Houston weekly to fill a local labor void, he said. \n“It was an employer’s market,” he said. “Now it’s more of a job seeker’s market.” Additional reporting by Ernest Scheyder; Editing by Gary McWilliams and Brian Thevenot", "external_links": [], "published": "2018-01-16T08:16:00.000+02:00", "crawled": "2018-01-16T08:28:19.000+02:00", "highlightTitle": ""}