{"organizations": [], "uuid": "18f9193cb39c6d25b57960f88caaf6e54761093b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/pvoil-ipo/update-1-vietnam-raises-184-mln-by-selling-20-pct-of-pvoil-in-ipo-idUSL4N1PK3ML", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Vietnam raises $184 mln by selling 20 pct of PVOIL in IPO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-25T18:36:00.000+02:00", "replies_count": 0, "uuid": "18f9193cb39c6d25b57960f88caaf6e54761093b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/pvoil-ipo/update-1-vietnam-raises-184-mln-by-selling-20-pct-of-pvoil-in-ipo-idUSL4N1PK3ML", "ord_in_thread": 0, "title": "UPDATE 1-Vietnam raises $184 mln by selling 20 pct of PVOIL in IPO", "locations": [], "entities": {"persons": [{"name": "mai nguyen", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "pvoil", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}], "organizations": [{"name": "pvoil", "sentiment": "negative"}, {"name": "petrovietnam oil corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* State-owned PVOIL’s IPO proceeds exceed expectations\n* Sale was oversubscribed by 2.3 times\n* Foreign investors bought 6.62 percent stake (Adds details, background)\nBy Mai Nguyen\nHANOI, Jan 25 (Reuters) - The Vietnamese government raised 4.18 trillion dong ($184 million) through the sale of a 20 percent stake in state-owned Petrovietnam Oil Corp (PVOIL) in an initial public offering (IPO), the company said on Thursday.\nThe proceeds exceeded the government’s target of raising at least $122 million from the sale, which is part of a plan to privatise hundreds of state-owned enterprises to boost their performances and ease budget pressure.\nDemand at Thursday’s IPO of PVOIL, Vietnam’s sole crude oil exporter, exceeded supply by 2.3 times, with foreign investors buying a 6.62 percent stake in the company, the firm said in a statement.\nVietnam was among the world’s fastest-growing stock markets last year, with the benchmark VN Index leaping nearly 50 percent. It has jumped around 12 percent so far in 2018, despite a technical glitch that shut down the market for two days.\nThe market was supported by listings and share sales in companies such as brewer Sabeco, mall operator Vincom Retail and airline Vietjet Aviation, which have good earnings or market share and attracted foreign funds.\nA further 44.7 percent stake in PVOIL, which plans to raise its market share in Vietnam’s retail fuel distribution to 35 percent from 22 percent now, will be offered to strategic investors, including both foreign and domestic players.\nPVOIL has said Royal Dutch Shell PLC, Japan’s Idemitsu and Thailand’s PTT are among eight companies registered to become PVOIL’s strategic investors.\nVietnam’s Sovico Holdings, chaired by Vietnam’s first woman billionaire and also founder and chief executive of Vietjet Aviation, has expressed interest in picking up a strategic stake in PVOIL, the energy firm has said.\nVietnam retains a cap on foreign ownership limit in PVOIL at 49 percent.\nPVOIL is among dozens of units that come under the wings of state oil and gas company PetroVietnam (PVN), which is caught up in a widespread corruption crackdown. Many PVN officials are on trial or have been given sentences ranging from jail terms to the death penalty.\nThe Vietnamese government is also selling shares in Petrovietnam Power Co later this month. It sold nearly 8 percent of refinery operator Binh Son Refining and Petrochemical company for $245 million last week. ($1=22,710 dong) (Reporting by Mai Nguyen; Editing by Sunil Nair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T18:36:00.000+02:00", "crawled": "2018-01-26T21:37:05.014+02:00", "highlightTitle": ""}