{"organizations": [], "uuid": "d45d72f8aac5517a8aa8e33d56168f61ffedb9e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sierra-bancorp-declares-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Sierra Bancorp Declares Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:01:00.000+02:00", "replies_count": 0, "uuid": "d45d72f8aac5517a8aa8e33d56168f61ffedb9e7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sierra-bancorp-declares-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "Sierra Bancorp Declares Quarterly Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "porterville", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "sierra bancorp", "sentiment": "negative"}, {"name": "bank", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "bank of the sierra", "sentiment": "none"}, {"name": "sierra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTERVILLE, Calif., Jan. 19, 2018 /PRNewswire/ -- Sierra Bancorp (Nasdaq:BSRR), parent of Bank of the Sierra, today announced that its Board of Directors has declared a regular quarterly cash dividend of $0.16 per share, which represents an increase of $0.02 per share, or 14%, relative to quarterly dividends paid in 2017. The dividend, which will be paid on February 15, 2018 to shareholders of record as of February 1, 2018, was approved subsequent to the Board's review of the Company's financial performance and capital strength for the quarter ended December 31, 2017. In addition to an anticipated lift in net income from a lower corporate income tax rate in 2018, the fact that fourth quarter 2017 results include substantial non-recurring items was taken into consideration when determining the appropriate dividend level. Counting dividends paid by Bank of the Sierra prior to the formation of Sierra Bancorp, the Company has paid regular cash dividends to shareholders every year since 1987, comprised of annual dividends through 1998 and quarterly dividends since then. The dividend noted in today's announcement marks the Company's 76 th consecutive quarterly cash dividend.\nSierra Bancorp is the holding company for Bank of the Sierra ( www.bankofthesierra.com ), which is in its 41 st year of operations and is the largest independent bank headquartered in California's South San Joaquin Valley. Bank of the Sierra is a community-centric regional bank, which offers a full range of retail and commercial banking services with full-service branches located within the counties of Tulare, Kern, Kings, Fresno, Los Angeles, Ventura, San Luis Obispo, and Santa Barbara. The bank also maintains an online branch, and provides specialized lending services through an agricultural credit center, a real estate industries center, and an SBA center. In 2018, Bank of the Sierra received a Bauer Financial 5-star rating, an honor only awarded to the strongest financial institutions in the country.\nForward-Looking Statements\nThe statements contained in this release that are not historical facts are forward-looking statements based on management's current expectations and beliefs concerning future developments and their potential effects on the Company. Readers are cautioned not to unduly rely on forward looking statements. Actual results may differ from those projected. These forward-looking statements involve risks and uncertainties including but not limited to the Company's ability to maintain current dividend payments or increase dividend payouts to shareholders, the Company's ability to generate adequate financial results, changes in economic conditions, interest rates and loan portfolio performance, and other factors detailed in the Company's SEC filings. Sierra Bancorp undertakes no responsibility to update or revise any forward-looking statements.\nView original content with multimedia: http://www.prnewswire.com/news-releases/sierra-bancorp-declares-quarterly-cash-dividend-300585103.html\nSOURCE Sierra Bancorp", "external_links": ["http://www.prnewswire.com/news-releases/sierra-bancorp-declares-quarterly-cash-dividend-300585103.html"], "published": "2018-01-19T16:01:00.000+02:00", "crawled": "2018-01-19T18:20:32.007+02:00", "highlightTitle": ""}