{"organizations": [], "uuid": "4fe331b8aedfe7386bfa11c5768629ba068f6bcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/12/the-associated-press-lawmakers-to-justice-department-keep-online-gambling-legal.html", "country": "US", "domain_rank": 767, "title": "Lawmakers to Justice Department: Keep online gambling legal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:55:00.000+02:00", "replies_count": 0, "uuid": "4fe331b8aedfe7386bfa11c5768629ba068f6bcc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/the-associated-press-lawmakers-to-justice-department-keep-online-gambling-legal.html", "ord_in_thread": 0, "title": "Lawmakers to Justice Department: Keep online gambling legal", "locations": [], "entities": {"persons": [{"name": "cory booker", "sentiment": "none"}, {"name": "rod rosenstein", "sentiment": "none"}, {"name": "tom macarthur", "sentiment": "none"}, {"name": "frank lobiondo", "sentiment": "none"}, {"name": "leonard lance", "sentiment": "none"}, {"name": "bill pascrell jr.", "sentiment": "none"}, {"name": "donald payne jr", "sentiment": "none"}, {"name": "albio sires", "sentiment": "none"}, {"name": "bob menendez", "sentiment": "none"}, {"name": "bonnie watson coleman", "sentiment": "none"}, {"name": "josh gottheimer", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "atlantic city", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "atlantic city", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "u.s. justice department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTIC CITY, N.J. (AP) — Federal lawmakers who represent New Jersey from both parties have asked the U.S. Justice Department to keep internet gambling legal.\nIn a letter Thursday to Deputy Attorney General Rod Rosenstein, the lawmakers urged the department not to rescind its 2011 legal opinion that says internet gambling is permissible under federal law.\nInternet gambling is a thriving industry in New Jersey, helping Atlantic City's seven casinos recover from a three-year period in which five of the city's 12 casinos closed. The additional money brought in online often makes the difference between an up month and a down month for Atlantic City casinos.\nFigures released Friday show Atlantic City's casinos won $245 million online in 2017, an increase of nearly 25 percent from a year earlier.\nThe letter was signed by New Jersey's two Democratic senators, Bob Menendez and Cory Booker, along with Republican Reps. Frank LoBiondo, Leonard Lance, and Tom MacArthur, and Democrats Josh Gottheimer, Albio Sires, Bonnie Watson Coleman, Bill Pascrell Jr. and Donald Payne Jr.\nIt was a response to a letter in November from Republican Sen. Lindsey Graham of South Carolina and Democratic Sen. Dianne Feinstein of California asking the Justice Department to change course and have Congress determine whether to permit online gambling.\nThat unlikely pairing voiced concern about a rapid, unchecked spread of gambling — something that has not happened. Only four states — New Jersey, Nevada, Delaware and Pennsylvania — have legalized internet gambling, and New Jersey's regulatory standards are considered the strictest in the nation.\nGraham and Feinstein repeated their warning of several years ago that the Justice Department opinion permitting internet gambling \"could usher in the most fundamental change in gambling in our lifetimes by turning every smart phone, tablet and personal computer in our country into a casino available 24 hours a day, seven days a week.\"\nBut the New Jersey lawmakers said their state has proven online gambling can be done safely and responsibly.\n\"Placing a blanket prohibition for online gambling would be an antiquated approach to a 21st century issue, punishing states like New Jersey, which have invested in creating a safe and secure online gaming structure, while also permitting black market operators to put millions of Americans at risk,\" the letter from the New Jersey delegation read.\nThe Justice Department said it has received the New Jersey delegation's letter, but it would not say whether it is considering changing its 2011 opinion regarding internet gambling. In a 2016 interview during the presidential campaign, Donald Trump, the former Atlantic City casino owner, told The Associated Press he would not take a position regarding online gambling, saying he has many friends on both sides of the issue.\nFollow Wayne Parry at http://twitter.com/WayneParryAC", "external_links": [], "published": "2018-01-12T16:55:00.000+02:00", "crawled": "2018-01-13T06:18:44.009+02:00", "highlightTitle": ""}