{"organizations": [], "uuid": "91edf91d7d521831dc7a027393ca8bb247a33cd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219076507&w=1200&r=LYNXMPEE020UC", "site_section": "https://www.reuters.com/finance", "section_title": "Business News &amp; Financial News | Reuters", "url": "https://www.reuters.com/article/us-usa-autos-sales/automakers-post-mixed-december-u-s-new-vehicle-sales-idUSKBN1ES1B9", "country": "US", "domain_rank": 408, "title": "Automakers post lower December U.S. sales; eye taxes, rate hikes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T23:27:00.000+02:00", "replies_count": 0, "uuid": "91edf91d7d521831dc7a027393ca8bb247a33cd8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-autos-sales/automakers-post-mixed-december-u-s-new-vehicle-sales-idUSKBN1ES1B9", "ord_in_thread": 0, "title": "Automakers post lower December U.S. sales; eye taxes, rate hikes", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - Most major automakers on Wednesday reported lower December U.S. sales despite hefty consumer discounts, as higher interest rates and a new tax code cast uncertainty over their prospects in 2018.\nAutomakers had benefited in 2017 from the continued shift in consumer tastes away from passenger cars to far more profitable pickup trucks and SUVs, with final U.S. new vehicle sales set to come in just under the record 17.55 million in 2016.\nBut industry observers expect sales to edge lower again in 2018 after a long bull run, thanks to a saturated market and rising interest rates that will boost consumers’ monthly payments and reduce their purchasing power.\nLast month, the Federal Reserve raised rates a quarter of a percentage point to a range of 1.25 percent to 1.50 percent and maintained its forecast of three more increases in 2018 and 2019.\nIt is unknown if sales will see any benefit from the sweeping tax overhaul passed by the Republican-controlled U.S. Congress. In a conference call with analysts, Ford Motor Co ( F.N ) said the new tax code should be a “net positive” for the industry.\nConsumer discounts aimed at moving vehicles off dealer lots will likely remain a concern for the industry. Discounts of more than 10 percent of a vehicle’s sticker price can hurt resale values, in turn weighing on new vehicle sales. In December, auto consultancies J.D. Power and LMC estimated discounts had topped 10 percent for the 17th time in the last 18 months.\nGeneral Motors Co ( GM.N ) reported a 3.3 percent drop in sales in December, driven by a decline in lower-margin fleet sales to government agencies and rental car companies. The company’s retail sales were up 1.8 percent in December.\nFor the full year, GM’s sales fell 1.3 percent. The automaker said its average transaction price hit $35,400, above the industry average of $31,600.\nThe No. 1 U.S. automaker said it expects industry-wide U.S. new vehicle sales in 2018 “in the high 16 million-unit range.”\n“This year, many consumers will see their take-home pay rise because of tax reform,” GM chief economist Mustafa Mohatarem said in a statement. “That will keep the broad economy growing, and help keep sales at very healthy levels even as the Fed increases interest rates.”\nGM’s high inventory of unsold vehicles had been a concern for observers earlier in the year. The automaker said at the end of December it had 63 days supply unsold vehicles, beating its target of around 70 days supply.\nFord reported a 0.9 percent increase in sales for December, fueled by a 17 percent increase in fleet sales.\nThe No. 2 U.S. automaker said retail sales were down 4 percent and that lucrative pickup truck sales were 1 percent lower than in December 2016.\nIn late morning trading, GM shares were up 2.2 percent, Ford shares were up 0.6 percent and Fiat Chrysler was up 1.2 percent.\nFiat Chrysler Automobiles NV (FCA) ( FCHA.MI ) posted an 11 percent sales decrease, with retail sales dropping 3 percent. Fleet sales slumped 42 percent, in line with a company strategy over the last year to cut back on this low-margin way to offload product.\nToyota Motor Corp ( 7203.T ) said its sales fell 8.3 percent in December, with decreases across all segments. Sales of the Japanese automaker’s passenger cars were off 12.2 percent and its luxury Lexus brand was down 13.9 percent versus December 2016.\nHonda Motor Co Ltd ( 7267.T ) posted a 7 percent drop in sales in December, driven mostly by declining passenger car sales.\nReporting by Nick Carey; Editing by Bernadette Baum and Meredith Mazzilli\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T23:27:00.000+02:00", "crawled": "2018-01-03T19:36:19.005+02:00", "highlightTitle": ""}