{"organizations": [], "uuid": "e481813e6f33644ac3fb07344c650043cfa3e6b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222555537&w=1200&r=LYNXMPEE0F1P5", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-brazil-ronaldinho/brazil-great-ronaldinho-to-retire-says-brother-idUKKBN1F52V4", "country": "US", "domain_rank": 408, "title": "Brazil great Ronaldinho to retire, says brother", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:54:00.000+02:00", "replies_count": 0, "uuid": "e481813e6f33644ac3fb07344c650043cfa3e6b0"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-brazil-ronaldinho/brazil-great-ronaldinho-to-retire-says-brother-idUKKBN1F52V4", "ord_in_thread": 0, "title": "Brazil great Ronaldinho to retire, says brother", "locations": [], "entities": {"persons": [{"name": "assis", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "ronaldinho", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gremio", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "rio de janeiro", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters / ed sykes  ronaldinho", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "o globo", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "world xi's ronaldinho action images", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 10:57 PM / Updated an hour ago Brazil great Ronaldinho to retire, says brother Reuters Staff 2 Min Read \nSAO PAULO (Reuters) - Former Brazil and Barcelona midfielder Ronaldinho, who won the World Cup, Champions League, Copa Libertadores and World Player of the Year award, is retiring from the game, his brother and agent Assis said on Tuesday. FILE PHOTO - Britain Football Soccer - England XI v Rest of the World XI - Soccer Aid 2016 - Old Trafford - 5/6/16 Rest of the World XI's Ronaldinho Action Images via Reuters / Ed Sykes \nRonaldinho has not played a competitive match since 2015 but had avoided calling a definitive halt to his career until now. \n“He’s stopped. It’s over,” Assis told the Rio de Janeiro newspaper O Globo. “We’re going to do something pretty big, something cool, after the World Cup in Russia, probably in August.” \nThe events, most likely farewell matches, will take place in Brazil, Europe and Asia, and could include a match with the national team, Assis said. \nRonaldinho, who will be 38 in March, began his career at Gremio and played for seven other clubs, including Paris Saint-Germain, AC Milan, Queretaro and Brazilian sides Flamengo, Atletico Mineiro and Fluminense. FILE PHOTO - Brazil's soccer player Ronaldinho participates during the second night of the carnival parade at the Sambadrome in Rio de Janeiro, Brazil February 28, 2017. REUTERS/Pilar Olivares \nBut it was at Barcelona between 2003 and 2008 where he spent his glory years, turning in some of the greatest performances ever seen by the storied Spanish club, perhaps most memorably in a 3-0 win over Real Madrid at the Bernabeu in 2005. \nHe helped guide the Catalan side to the Champions League in 2006, La Liga in 2005 and 2006 and won the Ballon D’Or in 2005. FILE PHOTO - Football Soccer - Motagua v Real Espana - International Friendly - Tiburcio Carias Andino National Stadium - Tegucigalpa, Honduras - July 30, 2017 - Brazilian player Ronaldinho waves to fans after the match. REUTERS/Jorge Cabrera \nRonaldinho left for Milan in 2008 and won the scudetto there in 2011, before heading back to Brazil and taking Atletico Mineiro to their first Copa Libertadores title in 2013. \nHe never again reached the heights he scaled at Barca for prolonged periods, though he remained a captivating presence, known for his no-look passes, superb free kicks and free-wheeling style that typified the way Brazilians play the game. \nHe played 101 times for Brazil, scoring 35 goals including a 40-yard free kick that knocked England out the 2002 World Cup. Reporting by Andrew Downie; Editing by Ken Ferris", "external_links": [], "published": "2018-01-17T00:54:00.000+02:00", "crawled": "2018-01-17T01:29:29.077+02:00", "highlightTitle": ""}