{"organizations": [], "uuid": "260d4ae2f8205839b25f354911027c531ffd4f6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/29/104866208-GettyImages-881258254-north-korea.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/us-north-korea-nuclear-war-fears-lead-to-potassium-iodide-pill-boom.html", "country": "US", "domain_rank": 767, "title": "US-North Korea nuclear war fears lead to potassium iodide pill boom", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.991, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "260d4ae2f8205839b25f354911027c531ffd4f6e"}, "author": "Rick Morgan", "url": "https://www.cnbc.com/2018/01/23/us-north-korea-nuclear-war-fears-lead-to-potassium-iodide-pill-boom.html", "ord_in_thread": 0, "title": "US-North Korea nuclear war fears lead to potassium iodide pill boom", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "negative"}, {"name": "fukushima", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us-north korea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "centers for disease control", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fear of a nuclear holocaust pushes Americans to stockpile essentials: food, water and fuel. But the increase in tensions with North Korea that peaked with President Donald Trump's Jan. 2 tweet saying he had a \"much bigger\" nuclear button than North Korean leader Kim Jong Un led to a spike of a lesser-known commodity: potassium iodide pills.\nThe FDA-approved drug blocks the thyroid gland from absorbing radioactive iodine released in a nuclear accident or attack. Despite the boom in sales, health experts stress taking potassium iodide only at the advice of public health or emergency management officials or one's private physician. No prescription is required.\n\"It's amazing to watch the graph,\" Keith Bansemer, the vice president of marketing at an online survival store called Mypatriotsupply.com, said about potassium iodide pill sales after the tweet.\nFalse alarms about North Korea missile attacks — like the false alarm in Hawaii on Jan. 13 — may exacerbate the tense situation.\nGetty Images A television broadcast of the North Korean missile launch at the Seoul Railway Station on September 15, 2017, in Seoul, South Korea. \nDisaster preparedness is not a new business niche, and people known as \"preppers\" stock up regardless of the latest geopolitical tweets. But the escalation of hostilities between the United States and North Korea is making disaster preparedness and, in particular, medical supplies for a nuclear blast a bigger business. \"We see [increased sales] every time North Korea is in the news,\" Bansemer said.\nAt emergency protection website Nukepills.com, which has distributed potassium iodide pills for 19 years, business went up more than 5,000 percent in August during North Korean nuclear testing. The company had to stop taking orders, and it took the company 10 days to catch up. After Trump's Jan. 2 tweet, Nukepills.com owner Troy Jones sold another 140,000 doses and had to staff seven more people. All but two of these employees are full-time. Last week's false alarm in Hawaii indicating a nuclear attack also fueled sales. He's working day now starts at 7 a.m. through to midnight.\nPrevious sales spikes have been driven by consumers within the states most vulnerable to a nuclear attack. When North Korea launched a missile over Japan in August, Mypatriotsupply.com sold potassium iodide pills mostly to the Pacific Northwest and California, Bansemer said. But now the company is receiving orders from all over the United States.\nMore from Modern Medicine: \nThe flu season is peaking, and the US is underprepared \nApple urged to take action on smartphone addiction \nAn A.I. designed for the end of human life is already here \nJones said the increased consumer interest in radiation preparation equipment started the morning Trump was elected. Nukepills.com offers other products, such as decontamination kits and water filtration devices, but potassium iodide pills have always been the top seller. This year has been the site's best year since the 2011 Fukushima nuclear disaster in Japan. Now when Jones sees an increase in sales he can't understand, he checks Twitter. Every time Trump tweets about North Korea, Jones sells out in one day what normally sells out in a few weeks.\nThe three FDA-approved brands of potassium iodide Jones sells cost $10, $12.95 and $19.95 for a 10- to 15-day supply for a single adult. The customers vary. \"It would be incorrect to say it's just the tinfoil hat-wearing person ,\" he said. He added that families and the highly educated make up a large number of customers.\nshow chapters Ian Bremmer: 2018 will bring a disastrous geopolitical event      12:57 AM ET Sat, 13 Jan 2018 | 00:56 The recent increase in potassium iodide sales also comes on the heels of the Centers for Disease Control and Prevention announcing it will host a webinar titled \"Public Health Response to a Nuclear Detonation.\"\nWhen the number of press reports and level of public interest in the webinar took the CDC by surprise, the organization felt the need to explain that the webinar had been planned for months and is unrelated to Trump's recent tweet. On Jan. 19 the CDC announced they are postponing the webinar due to the intense U.S. flu season and the need to focus on that issue with its next web education program. There are no plans to cancel the nuclear detonation preparation webinar, however.\nPotassium iodide's pros and cons  Despite their popularity during times of public anxiety, potassium iodide pills can do only so much. The FDA explains, \"Potassium iodide (KI) works only to prevent the uptake of radioactive iodine into the thyroid gland.\" In other words, it blocks the absorption of the radiation within the thyroid. It doesn't protect any other body part, and it doesn't protect against a radioactive blast. \"It is not a general radioprotective agent,\" the FDA states. How effective it is depends on many factors, including the time lapse after contamination, the age of the patient and the dosage.\nNorth Korean Leader Kim Jong Un just stated that the “Nuclear Button is on his desk at all times.” Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger & more powerful one than his, and my Button works!\n— Donald J. Trump (@realDonaldTrump) January 3, 2018 People of all ages can take potassium iodide. Pregnant women and infants, the two most at-risk groups, need the medication the most. A single dose protects the thyroid gland for 24 hours and should be taken within four hours of an emergency. In a nuclear disaster, officials might tell you to take one dose every 24 hours for a few days. \nPotassium iodide should not be taken in anything but a worst-case scenario. Side effects include skin rashes and the potential for a severe allergic reaction, especially for adults older than 40. \nThe medication comes in both pill and liquid form. The pills are either 130mg or 65mg, and the liquid form comes in a 1-oz (30-ml) bottle. A dropper allows users to dispense in 1, 1/2 and 1/4 milliliter doses; each milliliter equals 65mg. The FDA advises adults take 130mg each dose, but the liquid dropper means users can dispense smaller doses that the FDA advises for children (65mg), toddlers (32mg) and infants (16mg) . The website also lists the FDA-approved products.\nTroy Jones Potassium iodide pills protect against thyroid cancer in the event of a nuclear disaster. Jones said the pills protect against the plume from a radioactive event, not the blast itself. The CDC had noted in announcing its planned webinar that some of the most important steps to take in the event of a blast are not pharmaceutical in nature. The overarching CDC guidelines are \"Get inside, stay inside and stay tuned .\" The CDC also recommends removing contaminated clothing and washing exposed body parts. \n\n\nA historical guide The 1945 nuclear attacks on Hiroshima and Nagasaki caused long-term effects in the form of cancer, but the risk of leukemia far outweighed the risk for other cancers (such as thyroid cancer). Survivors were 46 percent more likely to contract leukemia, but they were only 10.7 percent more likely to contract other cancers, according to Columbia University's K=1 Project .\n\"I would not take this because you think there is going to be an attack,\" Dr. Ivana Hughes, a senior lecturer in chemistry at Columbia and faculty affiliate for the K=1 Project, said about potassium iodide. She cautions against treating these pills like vitamins and thinking there is no downside; the severest allergic reactions can be fatal. \"This is something you definitely want to be careful about.\" \nGetty Images Workers outside Reactor 4 work to decontaminate the Tokyo Electric Power Co.'s Fukushima Daiichi nuclear power plant on Feb. 25, 2016, in Okuma, Japan. The 1986 Chernobyl disaster caused radioactive iodine to seep into surrounding grass that was eaten by cows. A 2016 World Health Organization report estimated 11,000 people who were under the age of 18 during the disaster have since developed thyroid cancer. Quick evacuation and regular medical screening has doctors less worried about Fukushima's young survivors ( a screening initiative that found high rates of thyroid abnormalities has since been attributed to overzealous ultrasound screening, which doctors say would find the same abnormalities in a sample population.)\nAdults have a much lower chance of developing thyroid cancer from radioactive iodine. \"The younger you are, the more susceptible you are,\" Hughes said. She hopes people learn they should take potassium iodide in the event of an attack, but she stresses it isn't something you should take just because you're worried about North Korea. Save it for an actual disaster, she said. \nThe Nuclear Regulatory Commission and the Federal Emergency Management Agency recommend, but do not require, states provide potassium iodide to populations within 10 miles of a commercial nuclear power plant . Out of 34 states with such a population, 25 have received potassium iodide from the NRC. Consumers who don't trust this distribution system in an emergency will understandably continue to purchase their own pills.\nAnd if they really want them fast, it's best to order before the next Trump or Kim Jong Un Twitter blast.\n— By Rick Morgan, special to CNBC.com", "external_links": [], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T16:47:10.011+02:00", "highlightTitle": ""}