{"organizations": [], "uuid": "d7f12a96d972d850044ab15164b10756da53cb9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222671180&w=1200&r=LYNXMPEE0G0GP", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-asia/garcia-hopes-for-another-golden-year-from-singapore-start-idUKKBN1F60V7", "country": "US", "domain_rank": 408, "title": "Garcia hopes for another golden year from Singapore start", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:44:00.000+02:00", "replies_count": 0, "uuid": "d7f12a96d972d850044ab15164b10756da53cb9f"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-asia/garcia-hopes-for-another-golden-year-from-singapore-start-idUKKBN1F60V7", "ord_in_thread": 0, "title": "Garcia hopes for another golden year from Singapore start", "locations": [], "entities": {"persons": [{"name": "garcia", "sentiment": "neutral"}, {"name": "john o'brien", "sentiment": "none"}, {"name": "sergio garcia", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "sentosa golf club", "sentiment": "none"}, {"name": "min read  singapore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:48 AM / Updated 2 hours ago Garcia hopes for another golden year from Singapore start John O'Brien 4 Min Read \nSINGAPORE (Reuters) - Sergio Garcia finally fulfilled his incredible promise when he captured a first major at last year’s U.S. Masters and the Spanish Ryder Cup veteran is hoping for another big season as he kicks off his 2018 campaign at a familiar venue. \nThe 38-year-old started last season at the Singapore Open and Garcia, who tied for 11th in 2017, is hoping he can use the event again as launch pad to add more majors and tournament victories to his ever-expanding list of honours. \n“Winning is nice and it doesn’t matter which time of year it comes. To do it early is great for confidence and I played well here last year, then went on to Dubai and managed to win there,” Garcia told reporters at the Sentosa Golf Club on Wednesday. \n“It was a good kick-start point so it would be nice to play well, if we win here it will be amazing but even if we don‘t, we can still take a lot of positives out of it,” he added. \n“The first week is always interesting to test yourself as you haven’t played a tournament for a couple of months, everything is fresh and hopefully we can build from that.” \nFollowing his Dubai Desert Classic win in February, Garcia backed up his Augusta victory with a second Andalucia Masters triumph in October and as he embarks on a campaign that will likely see a ninth Ryder Cup appearance, the Spaniard is looking forward to another “big” year. \n“All years are big. There are no small years anymore. There’s always four majors and they are all special no matter where they are played,” Garcia, who is due to welcome his first child in March, said. \n“Obviously, the Ryder Cup is in even years and it makes them a little bit more special as it’s always exciting, so it will be great,” he added of this September’s edition, which will be held in France for the first time. \n“I just hope to stay healthy and keep improving on aspects of the game that I know I can get better. If I manage to do that then it will be fine. We’ll see if we can pull another one out of the bag like we did last April.” CALENDAR CHANGE \nGarcia also gave his approval to the calendar changes global golf will undertake from 2019, when the PGA Championships will be moved from it’s current September slot to May, a decision he feels can only improve the event. \n“I think its a good idea as it opens up more possibilities for the PGA Championship because now, being played in late summer when its extremely hot means there’s only so many courses that can host it at that time of the year,” he said. \n“Moving it earlier will open more doors to new venues, different types of grass and different courses.” \nOf his own future, Garcia remains more flexible and will be content to just put himself in position for more victories and maybe one day triumph at his “favourite major”, the British Open. \n“I just want to keep on improving my game and hopefully give myself plenty of more chances at majors,” he added. \n“Obviously I would love to win a British Open before I call it quits but all I can do is put myself in contention to win it and see if I can perform like I did at Augusta last year.” Reporting by John O'Brien; Editing by Amlan Chakraboty", "external_links": [], "published": "2018-01-17T10:44:00.000+02:00", "crawled": "2018-01-17T13:00:54.009+02:00", "highlightTitle": ""}