{"organizations": [], "uuid": "c8ce51526e0ae94b298439bab8e8566e85254161", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 22}, "facebook": {"likes": 263, "shares": 263, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2015/12/mil-opener.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/bitcoin-millennials-robinhood-cryptocurrency/", "country": "US", "domain_rank": 1196, "title": "Bitcoin: Investing App Robinhood to Add Cryptocurrencies | Fortune", "performance_score": 2, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.218, "site_type": "news", "published": "2018-01-26T12:59:00.000+02:00", "replies_count": 0, "uuid": "c8ce51526e0ae94b298439bab8e8566e85254161"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/25/bitcoin-millennials-robinhood-cryptocurrency/", "ord_in_thread": 0, "title": "Bitcoin: Investing App Robinhood to Add Cryptocurrencies | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}], "locations": [{"name": "ethereum", "sentiment": "none"}, {"name": "litecoin", "sentiment": "none"}], "organizations": [{"name": "robinhood", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 10:59 AM EST \nA trading app popular with millennials, is making a big move into crypto. Starting in February, Robinhood will let customers buy bitcoin, Ripple, and 15 other cryptocurrencies using the same streamlined, no-commission approach it offers for stocks. \nThe move is significant for cryptocurrency markets because Robinhood has 3 million users with a median age of 26, a demographic considered to be especially enthusiastic about bitcoin and other types of digital money. \nIn announcing the news on Thursday, Robinhood said users will be immediately be able to track market data for the 16 cryptocurrencies—which also include the likes of Litecoin, Ethereum, and Ripple—and to read crypto news and set price alerts. \nThe company’s trading platform will go live next month, allowing users in states where Robinhood has obtained regulatory approval to acquire digital currency with no minimum purchase amount. It will make the 16 different types of currency available in waves, beginning with bitcoin and Ethereum, and allowing customers to track the other ones. \nThe service will initially be available in California, Massachusetts, Missouri, Montana, and New Hampshire, and will become available to other states in coming months. The list of cryptocurrencies largely corresponds with those with the biggest market cap, and also includes the likes of Monero and Dogecoin (full list below). \nGet Data Sheet , Fortune’s technology newsletter. \nRobinhood says trading cryptocurrency on the app will function in the same as with equities, allowing customers to acquire stakes without paying a commission or fees. This is notable in part because popular exchanges, such as Coinbase, all charge a commission (typically around 1%) on buying and selling. \nRobinhood’s co-CEO Baiju Bhatt tells Fortune the company will act as a broker-dealer rather than an exchange in the cryptocurrency market. Bhatt adds that Robinhood will partner with a number of large institutions to acquire the digital currencies on behalf of customers, but notes that he could not disclose the identity of those partners. \nWhile the company will offer the crypto-trading service to consumers without a commission, the trading price will presumably incorporate the cost Robinhood pays to its partners to acquire the digital assets in the first place. This cost is likely to be low, however, as Bhatt suggests its purchasing power will allow it obtain crypto assets at a steep discount. \nBhatt explains the decision to add cryptocurrencies to the app reflects Robinhood’s focus on providing services aimed at younger people who seek diverse products, and easy and low-cost trading platforms. \nThe move comes after a year in which Robinhood soared to so-called “unicorn” status (obtaining a valuation of more than $1 billion) and enjoyed plenty of buzz as a preferred trading app for millennials. Its decision to add cryptocurrency is somewhat surprising, however, since as recently as last October the company downplayed the popularity of digital assets compared to traditional stocks. \nRobinhood, whose investors include Index Ventures and Andreessen Horowitz, makes money by earning interest from uninvested customer balances and by collecting fees from customers who trade on margin. \nHere is the full list of currencies that will be available to trade: Bitcoin; Ethereum; Bitcoin Cash; Litecoin; Ripple; Ethereum Classic; Zcash; Monero; Dash; Stellar; Qtum; Bitcoin Gold; OmiseGo; NEO; Lisk; Dogecoin. \nAn earlier version of this story incorrectly said the crypto feature will initially be available in New York and Illinois; it as also been updated to include the full list of currencies. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T12:59:00.000+02:00", "crawled": "2018-01-26T01:15:35.009+02:00", "highlightTitle": ""}