{"organizations": [], "uuid": "8dc7d7d33d75703579ea2cc610c7024c6162a1d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/16/103245522-GettyImages-169117083.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/dollar-stung-by-mnuchin-comments-euro-awaits-ecbs-currency-views.html", "country": "US", "domain_rank": 767, "title": "Dollar stung by Mnuchin comments, euro awaits ECB's currency views", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:54:00.000+02:00", "replies_count": 0, "uuid": "8dc7d7d33d75703579ea2cc610c7024c6162a1d5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/dollar-stung-by-mnuchin-comments-euro-awaits-ecbs-currency-views.html", "ord_in_thread": 0, "title": "Dollar stung by Mnuchin comments, euro awaits ECB's currency views", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The euro surged to a fresh three-year high on Thursday after European Central Bank President Mario Draghi said economic data pointed to \"solid and broad\" growth with inflation likely to rise in the medium term from subdued levels.\nThe euro jumped about 1 percent to $1.2536, its highest since mid-December 2014. It was last up 0.61 percent at $1.2482.\nDraghi warned that the surge in the euro was a source of uncertainty and said the ECB might have to review strategy if U.S. comments on the benefits of a weak dollar lead to a change in monetary conditions.\nThe dollar had slipped against the euro on Wednesday after U.S. Treasury Secretary Steve Mnuchin said he welcomed a weaker greenback.\nSome market participants had been expecting Draghi to take a firmer stance addressing the euro's potentially damaging surge against the dollar.\n\"Overall, the comments regarding the exchange rate were benign,\" said Eric Viloria, currency strategist at Wells Fargo Securities in New York.\n\"There was a lack of any forceful comments with respect to the recent euro strength,\" he said.\nThe single currency has gained more than 3 percent already this year after double digit gains last year amid a broad-based dollar sell-off that intensified on Wednesday when U.S. Treasury Secretary Steven Mnuchin said a weaker dollar was \"good for us.\"\nMnuchin, whose comments were a departure from traditional U.S. currency policy, said on Thursday that he was not concerned where the dollar was in the short term.\nshow chapters Cashin: Mnuchin's comments on dollar come back to haunt markets 2:04 PM ET Wed, 24 Jan 2018 | 01:40 The dollar index , which measures the greenback against a basket of six major currencies, was down 0.54 percent at 88.73, after dropping as low as 88.438, its lowest since December 2014.\n\"Some of this USD sell off is now technical in nature, and the trend following crowd is likely pressing the bet a bit,\" Brad Bechtel, managing director FX at Jefferies, said in a note.\nWells Fargo's Viloria said that from a technical standpoint the dollar index has scope to move lower.\n\"It remains within an overall downwards trend,\" he said.\nThe greenback had already been on the defensive thanks to trade protectionism worries fanned by U.S. President Donald Trump's decision to impose steep import tariffs on washing machines and solar panels earlier in the week.\nWith a weaker dollar, the yen strengthened despite the Bank Of Japan keeping monetary settings unchanged on Tuesday and Governor Haruhiko Kuroda quashing speculation of a shift away from ultra-easy policy later this year.\nSterling strengthened to its highest levels on a trade-weighted basis since shortly after June 2016's European Union referendum, as optimism around Brexit and the economy continued to fuel a surge in the currency.\nSterling unchanged at $1.4241.\nThe Canadian dollar hit a four-month high against its U.S. counterpart on Thursday as oil prices rose.\n— Reuters and CNBC's Patti Domm contributed to this report.", "external_links": [], "published": "2018-01-25T03:54:00.000+02:00", "crawled": "2018-01-25T03:04:30.010+02:00", "highlightTitle": ""}