{"organizations": [], "uuid": "6c779600e5a597c18ac2a30832bdae63476db274", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/powerbourse-eex-data/european-energy-bourse-sees-rising-trade-in-2017-but-power-futures-fall-idUSL8N1PB571", "country": "US", "domain_rank": 408, "title": "European energy bourse sees rising trade in 2017 but power futures fall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:45:00.000+02:00", "replies_count": 0, "uuid": "6c779600e5a597c18ac2a30832bdae63476db274"}, "author": "", "url": "https://www.reuters.com/article/powerbourse-eex-data/european-energy-bourse-sees-rising-trade-in-2017-but-power-futures-fall-idUSL8N1PB571", "ord_in_thread": 0, "title": "European energy bourse sees rising trade in 2017 but power futures fall", "locations": [], "entities": {"persons": [{"name": "peter reitz", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "eex", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "deutsche boerse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 3:46 PM / in 14 minutes European energy bourse sees rising trade in 2017 but power futures fall Reuters Staff 3 Min Read \nFRANKFURT, Jan 16 (Reuters) - Trading of gas, carbon emissions rights and freight on the European energy bourse EEX rose last year, but its flagship product, power derivatives, saw a decline amid regulatory uncertainty, it said on Tuesday. The Leipzig-based exchange, part of Deutsche Boerse group , blamed additional compliance duties and the regulators' decision to split up the German and Austrian joint power trading zones as of Oct. 18. Chief Executive Peter Reitz said that aside from the German/Austrian issue, EEX had diversified its product range. \"(This) enables us to continue along our growth path,\" he said. Last week, EEX's spot power unit EPEX SPOT reported a rise in trading volume for the past year, boosted by integration across European prompt markets. Trading volumes of the flagship German power futures fell 29 percent last year to 1,882 terawatt hours (TWh) due to the Austrian/German power trading zone split. EEX had argued that the split was not the best option. However, it started offering alternative contracts separately for both markets and they have established themselves since. The purely German contract is the new European electricity benchmark. Gas trading on EEX, which spans much of western Europe and the Nordic countries, jumped by 13 percent last year to 1,982 TWh. EEX carbon emissions rights trading increased by 45 percent to total 1,381 million tonnes. The bourse carries out primary market auctions for EU Emissions and Aviation Allowances, and the remainder on the emissions allowances' secondary market. EEX also trades agricultural and freight products. Below is a selection of key trading volumes, allowing for rounding errors. 2017 2016 Yr-Yr change Power derivatives 3,217 TWh 3,920 TWh - 18 pct Power total* 3,761 TWh 4,456 TWh - 17 pct Gas spot 828 TWh 666 TWh + 24 pct Gas derivatives 1,154 TWh 1,090 TWh + 6 pct Gas total** 1,982 TWh 1,756 TWh + 69 pct Carbon 1,381 mln T 949 mln T + 45 pct (Reporting by Vera Eckert, editing by Susan Fenton)", "external_links": [], "published": "2018-01-16T17:45:00.000+02:00", "crawled": "2018-01-16T18:02:18.007+02:00", "highlightTitle": ""}