{"organizations": [], "uuid": "0e4f20a545308e5a9aaad4f4ccee752e22a26f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-cements-gains-as-policy-surprise-hopes-grow-idUSL4N1P0305", "country": "US", "domain_rank": 408, "title": "FOREX-Euro cements gains as policy surprise hopes grow", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-05T16:50:00.000+02:00", "replies_count": 0, "uuid": "0e4f20a545308e5a9aaad4f4ccee752e22a26f0c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-cements-gains-as-policy-surprise-hopes-grow-idUSL4N1P0305", "ord_in_thread": 0, "title": "FOREX-Euro cements gains as policy surprise hopes grow", "locations": [], "entities": {"persons": [{"name": "richard falkenhall", "sentiment": "none"}, {"name": "saikat chatterjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "adp", "sentiment": "negative"}, {"name": "seb", "sentiment": "none"}, {"name": "fx", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar struggles despite strong ISM, ADP data\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 5 (Reuters) - The euro consolidated gains below a four-month high on Friday on some expectations that European policymakers may have to start withdrawing stimulus policies earlier than previously forecasted against the backdrop of a strengthening economy.\nWith the U.S. dollar failing to draw any strength from this week’s manufacturing and private payrolls data and two U.S. interest rate hikes already baked into market expectations, traders believe there is more upside room for the euro against the greenback.\n“Currency markets broadly know what the Fed is going to do this year but the ECB monetary policy may be the surprise package of 2018,” said Richard Falkenhall, senior FX strategist at SEB in Stockholm.\nMoney markets expect the U.S. Federal Reserve to raise interest rates two times this year compared to a Fed forecast of three times.\nIn contrast, markets don’t expect any change in policy interest rates in Europe until 2019 though some of those expectations may have been slightly bought forward in recent days after comments by senior ECB policymakers.\nThe European Central Bank may end its stimulus programme this year if the euro zone economy continues to grow strongly, ECB rate-setter Ewald Nowotny told a German newspaper.\n“Market participants might bank on the ECB following in the Fed’s footsteps earlier after all if the economic environment improves further, which would be a reason to prefer the euro over the dollar,” Commerzbank strategists said in a note.\nOn Friday, the euro was broadly steady at $1.2060, just shy of a September 2017 high of $1.2092. A break above that level would take the single currency to its highest level since January 2015.\nWeighed down by the greenback’s weakness against the euro, the dollar index against a basket of six major currencies was poised for a loss of 0.3 percent this week.\nIt probed a three-month low of 91.751 on Tuesday and last stood at 91.996, headed for its third week of losses.\nThe U.S. currency’s lack of traction was highlighted overnight as the dollar failed to draw support from stronger-than-expected jobs report. U.S. private employers added 250,000 jobs in December, data from ADP Research Institute showed, the biggest monthly increase since March.\nAlso weighing on the dollar was a renewed flattening of the U.S. yield curve with spreads of ten-year U.S. Treasury bonds over two-year debt falling below 50 basis points to its lowest levels in more than a decade.\nThe markets are now focused on Friday’s U.S. non-farm payrolls report, which is expected to show job gains of 190,000 for December, and eurozone flash inflation estimates due at 10 GMT.\nA Reuters poll expects eurozone inflation of 1.4 percent in December compared to 1.5 percent in November and still below an ECB target of just below 2 percent.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Additional reporting by Shinichi Saoshiro in TOKYO; Editing by Peter Graff)\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T16:50:00.000+02:00", "crawled": "2018-01-05T22:37:02.029+02:00", "highlightTitle": ""}