{"organizations": [], "uuid": "9f64b12e1c4a17d0df8ec6e0af1919325b70137f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/nintendo-labo-robot-kit.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/20/nintendo-stock-labo-switch/", "country": "US", "domain_rank": 1196, "title": "Nintendo Labo: Stock Surges After Surprise Accessory Reveal | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.634, "site_type": "news", "published": "2018-01-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "9f64b12e1c4a17d0df8ec6e0af1919325b70137f"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/20/nintendo-stock-labo-switch/", "ord_in_thread": 0, "title": "Nintendo Labo: Stock Surges After Surprise Accessory Reveal | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}, {"name": "labo", "sentiment": "none"}], "locations": [{"name": "labo", "sentiment": "none"}], "organizations": [{"name": "nintendo", "sentiment": "negative"}, {"name": "tokyo stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris January 20, 2018 \nNintendo clearly spent 2017 doing more than just basking in the huge success of its Switch console. The company was also preparing to maintain its momentum into 2018 – and in a uniquely Nintendo way. \nOn Friday, Nintendo stock jumped more than 4% on the Tokyo Stock Exchange after the announcement of Labo, a new suite of accessories for the Switch. But Labo isn’t a VR headset, RFID reader , or other high-tech doodad. Instead, it’s a set of cardboard toys, aimed at letting young players assemble interactive Switch peripherals including a fishing rod, piano keyboard, periscope, or robot suit. \nThat’s right — a cardboard robot suit. If your heart doesn’t leap at the very idea, you might consider spending a bit more time with your inner child. \nNintendo’s announcement video shows Labo to be a very rare thing in video gaming. While most new games or consoles are touted as awe-inspiring technological leaps that will draw players into fantastic made-up worlds, Labo is simple, elegant, and rooted in tangible reality. While the Switch hardware is integrated into all of the cardboard toys, they still manage to evoke a simpler, more imagination-fueled era. \nGet Data Sheet , Fortune’s technology newsletter. \nOn top of what looks like a huge inherent fun factor, the timing of Labo could hardly be better. Anxiety over the risks of technology, including to children, reached a new peak in 2017. A series of high-profile studies showed that excessive use of smartphones and social media were producing a generation that is more isolated, depressed, and anxious than any before. Add to that lingering worry about how little outdoor playtime kids are getting. \nIn that context, the Labo could tap into parents’ desire to draw kids’ attention away from screens, at least a little bit, acting as a kind of bridge from the digital world back into the real one. For a start, the accessories have to be built carefully by hand, and can even be customized, features which are often touted as building confidence and creativity through toys like LEGO. \nInvestors clearly think Nintendo is on to something big here. There’s still some trepidation over whether shoppers will want to shell out $70 for the Labo Variety Kit or $80 for the more elaborate (that is, totally awesome-looking) Robot Kit. But even if it’s not a wild success, Labo should be heartening in a much broader sense. It shows Nintendo, which started life in the late 20th century as a playing-card manufacturer, staying true to its ethos of focusing on fun, rather than just flashy technology. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-20T02:00:00.000+02:00", "crawled": "2018-01-21T11:51:30.000+02:00", "highlightTitle": ""}