{"organizations": [], "uuid": "f6b44dfc509ffa3cdcec611ac1ad5fa489b5b559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-intrexon-announces-proposed-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Intrexon Announces Proposed Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:15:00.000+02:00", "replies_count": 0, "uuid": "f6b44dfc509ffa3cdcec611ac1ad5fa489b5b559"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-intrexon-announces-proposed-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Intrexon Announces Proposed Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GERMANTOWN, Md., Jan. 16, 2018 /PRNewswire/ -- Intrexon Corporation (NYSE: XON) announced today it has commenced an underwritten public offering of shares of its common stock. In addition, Intrexon intends to grant the underwriters a 30-day option to purchase additional shares of its common stock. The offering is subject to market and other conditions and there can be no assurances as to whether or when the offering may be completed, or as to the size or terms of the offering.\nJMP Securities LLC is acting as sole book-running manager for the offering.\nThe public offering will be made pursuant to an automatic shelf registration statement on Form S-3 that was previously filed with the Securities and Exchange Commission (SEC) and became effective on September 1, 2017. A preliminary prospectus supplement and accompanying base prospectus relating to and describing the terms of the offering have been filed with the SEC and are available on the SEC's website at www.sec.gov . Copies of the preliminary prospectus supplement and base prospectus relating to this offering may be obtained from JMP Securities LLC, 600 Montgomery Street, Suite 1100, San Francisco, California 94111, Attention: Prospectus Department, by calling +1 (415) 835-8985, or by email at syndicate@jmpsecurities.com. The final terms of the offering will be disclosed in a final prospectus supplement to be filed with the SEC.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Intrexon Corporation\nIntrexon Corporation (NYSE: XON) is Powering the Bioindustrial Revolution with Better DNA ™ to create biologically-based products that improve the quality of life and the health of the planet. Intrexon's integrated technology suite provides its partners across diverse markets with industrial-scale design and development of complex biological systems delivering unprecedented control, quality, function, and performance of living cells.\nTrademarks\nIntrexon and Powering the Bioindustrial Revolution with Better DNA are trademarks of Intrexon and/or its affiliates. Other names may be trademarks of their respective owners.\nForward-Looking Safe Harbor Statement\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which involve risks and uncertainties, including statements regarding the proposed public offering. Various factors may cause differences between Intrexon's expectations and actual results, including risks and uncertainties associated with market conditions and the satisfaction of customary closing conditions related to the proposed offering. More information about potential factors that could affect Intrexon's business and financial results is contained in its annual report on Form 10-K, its quarterly reports on Form 10-Q and other filings with the SEC. Intrexon does not intend, and undertakes no duty, to update this information to reflect future events or circumstances.\nFor more information about Intrexon Corporation, contact:\nInvestor Contact:\nThomas Shrader, PhD\nVice President, Communications & Strategy\ninvestors@intrexon.com\nCorporate Contact:\nMarie Rossi, Ph.D.\nDirector, Technical Communications\nTel: +1 (301) 556-9850\npublicrelations@intrexon.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/intrexon-announces-proposed-public-offering-of-common-stock-300583512.html\nSOURCE Intrexon Corporation", "external_links": ["http://www.prnewswire.com/news-releases/intrexon-announces-proposed-public-offering-of-common-stock-300583512.html"], "published": "2018-01-17T00:15:00.000+02:00", "crawled": "2018-01-17T00:04:52.000+02:00", "highlightTitle": ""}