{"organizations": [], "uuid": "0f1683ad3e3ad31ee0facbc2624ab25bb8c47302", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-biomerica-announces-second-quarter-financial-results-sales-up-12-point-7-percent-for-the-quarter.html", "country": "US", "domain_rank": 767, "title": "Biomerica Announces Second Quarter Financial Results; Sales Up 12.7% for the Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.482, "site_type": "news", "published": "2018-01-16T17:18:00.000+02:00", "replies_count": 0, "uuid": "0f1683ad3e3ad31ee0facbc2624ab25bb8c47302"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-biomerica-announces-second-quarter-financial-results-sales-up-12-point-7-percent-for-the-quarter.html", "ord_in_thread": 0, "title": "Biomerica Announces Second Quarter Financial Results; Sales Up 12.7% for the Quarter", "locations": [], "entities": {"persons": [{"name": "zackary irani", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "biomerica", "sentiment": "negative"}, {"name": "biomerica, inc.", "sentiment": "neutral"}, {"name": "ibs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 16, 2018 (GLOBE NEWSWIRE) -- Biomerica, Inc. (Nasdaq:BMRA) today reported net sales of $1,613,636 for the three months ended November 30, 2017, compared to $1,432,206 for the same period in the previous year, an increase of 12.7%. Net sales were $3,058,119 for the six months ended November 30, 2017 compared to $2,842,317 for the same period in fiscal 2017.\nBiomerica announced a net loss for the three months ended November 30, 2017 of $268,661, or $0.03 per share, versus a net loss of $202,887, or $0.02 per share, in the previous fiscal year during the same quarter. The net loss for the six months ended November 30, 2017 was $475,720, or $0.06 per share, compared to net loss of $258,600, or $0.03 per share.\n“While we are pleased with our continued growth in sales, the combination of fully establishing our maquiladora production facility and reduction of finished goods/WIP inventory resulted in a higher cost of goods sold,” said Zackary Irani, Biomerica CEO. “We are excited about moving our InFoods® IBS product forward through the regulatory process and recently announced signing definitive agreements with two of America’s leading research institutes (Beth Israel Deaconess Medical Center Inc., a Harvard Medical School Teaching Hospital, and the University of Michigan) to perform trials for the product. It is estimated that up to 45 million Americans suffer from IBS, and we believe our approach is differentiated by focusing on a possible root cause of IBS compared to simply treating symptoms. At the same time, we are moving forward with our H. pylori clinical trials and look forward to providing updates on the progress of the studies.”\nAbout Biomerica (Nasdaq:BMRA)\nBiomerica, Inc. ( www.biomerica.com ) is a global biomedical company that develops, manufactures and markets advanced diagnostic products used at the point-of-care (in home and in physicians’ offices) and in hospital/clinical laboratories for the early detection of medical conditions and diseases. The Company’s products are designed to enhance the health and well being of people, while reducing total healthcare costs. Biomerica primarily focuses on products for Diabetes, Gastrointestinal Disease and esoteric testing.\nThe Biomerica InFoods® IBS product identifies patient specific foods that when removed may alleviate an individual's IBS symptoms. This patent-pending, diagnostic-guided therapy is designed to allow for a patient specific, guided dietary regimen to improve Irritable Bowel Syndrome (IBS) outcomes. The point-of-care product is being developed to allow physicians to perform the test in-office using a finger stick blood sample while a clinical laboratory version of the product will be the first for which the company will seek regulatory approval. A billable CPT code that can be used by both clinical labs and physicians' offices is available for InFoods® diagnostic products. Since the InFoods® product is a diagnostic-guided therapy, and not a drug, it has no drug type side effects.\nThe Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for forward-looking statements. Certain information included in this press release (as well as information included in oral statements or other written statements made or to be made by Biomerica) contains statements that are forward-looking; such as statements relating to intended launch dates, sales potential, significant benefits, continued growth, market size, prospects, new products, favorable outlook, new distributors, possible expansion, increases in productivity and margins, expected orders, market possibilities, anticipated future sales or production volume of the Company, the launch or success of product and new product offerings. Such forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future, and accordingly, such results may differ materially from those expressed in any forward-looking statements made by or on behalf of Biomerica. The potential risks and uncertainties include, among others, fluctuations in the Company’s operating results due to its business model and expansion plans, downturns in international and or national economies, the Company’s ability to raise additional capital, the competitive environment in which the Company will be competing, and the Company’s dependence on strategic relationships. The Company is under no obligation to update any forward-looking statements after the date of this release.\nCONTACT INFORMATION\nZack Irani, CEO\n949-645-2111\nwww.biomerica.com\nSource:Biomerica, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3461b9f0-3e95-484f-96e9-71608fc20239"], "published": "2018-01-16T17:18:00.000+02:00", "crawled": "2018-01-16T18:33:12.006+02:00", "highlightTitle": ""}