{"organizations": [], "uuid": "a9a3460bd3fd2cdfd8c0f21d53e64de1143af195", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104907724-Bill_Gates_Wave.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/online-tools-bill-gates-uses-to-learn-something-new-every-day.html", "country": "US", "domain_rank": 767, "title": "Online tools Bill Gates uses to learn something new every day", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.857, "site_type": "news", "published": "2018-01-04T21:55:00.000+02:00", "replies_count": 0, "uuid": "a9a3460bd3fd2cdfd8c0f21d53e64de1143af195"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/04/online-tools-bill-gates-uses-to-learn-something-new-every-day.html", "ord_in_thread": 0, "title": "Online tools Bill Gates uses to learn something new every day", "locations": [], "entities": {"persons": [{"name": "bill gates", "sentiment": "neutral"}, {"name": "david rubenstein", "sentiment": "none"}, {"name": "aurelien meunier", "sentiment": "none"}, {"name": "gates", "sentiment": "none"}], "locations": [], "organizations": [{"name": "microsoft", "sentiment": "neutral"}, {"name": "harvard", "sentiment": "neutral"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "the new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nAlthough Bill Gates dropped out of Harvard in the 1970's to found Microsoft, he's never stopped learning. \n\"I'm a weird dropout because I take college courses all the time,\" Gates told David Rubenstein during a 2016 Bloomberg interview . \nAlthough Gates \"loved being a student\" and enjoyed the college environment, he doesn't feel as though he lost out by not earning a degree. \n\"I don't think I missed any knowledge, because whatever I needed to learn, I was still in a learning mode,\" he says. Aurelien Meunier | Getty Images \nOne major way the billionaire continually broadens his knowledge is through reading . He spends an hour reading every day and finishes around 50 books a year. Gates told The New York Times that reading, \"is one of the chief ways that I learn, and has been since I was a kid.\" \nGates even attributes a portion of his success to his hunger for books. \n\"You don't really start getting old until you stop learning,\" he told Time in 2017 . \"Every book teaches me something new or helps me see things differently … Reading fuels a sense of curiosity about the world, which I think helped drive me forward in my career and in the work that I do now with my foundation.\" show chapters 4:42 PM ET Mon, 7 Aug 2017 | 00:54 \nGates also uses a number of online programs and videos to pick up new skills and educate himself about global cultures and world events. \nIn a Time article published Thursday , Gates shared four helpful online resources. \"There's never been a better time to be alive if you're curious,\" he writes. \"When I wanted to learn something outside of school as a kid, cracking open my World Book encyclopedia was the best I could do. Today, all you have to do is go online.\" \nHere are his favorites: 1. Khan Academy \nKhan Academy features hundreds of instructional and informational videos for students of all ages, including specialized content from organizations such as NASA, The Museum of Modern Art and MIT. \n\"Their videos are a tremendous resource on topics ranging from basic arithmetic to complicated subjects like electrical engineering,\" Gates says. \nThe best part: It's all free. The company's mission is to make world-class education available to anyone, anywhere. show chapters 7:56 AM ET Wed, 18 Oct 2017 | 01:50 2. Code.org \nAs technology continues to advance, online skills are in demand. Gates believes coding is something virtually everyone should try to learn, and Code.org provides resources to help coders of all abilities improve. \n\"Even if you don't use it in your day-to-day life, computer science forces you to think abstractly and solve concrete problems,\" he says. 3. The Great Courses from The Teaching Company \nWhether you want to learn how to draw or dive into the history of Egyptian hieroglyphics, The Great Courses from The Teaching Company has you covered with lectures from top college professors. \n\"I always take at least one of their DVDs to watch when I travel,\" Gates says. \"Right now, I've got their courses on oceanography, the surveillance state and physiology.\" show chapters 7:25 PM ET Thu, 3 Aug 2017 | 05:35 4. Big History Project \nBig History is a free online social studies course designed to teach middle and high school students how people and civilizations throughout the history of the world are connected. It aligns with Common Core standards for classroom use, but it can also be taken by adults looking to continue their education. \nAlthough Gates admits that he's biased toward the project because he's an investor, he says it's a must for any lifelong learner.", "external_links": [], "published": "2018-01-04T21:55:00.000+02:00", "crawled": "2018-01-04T22:00:57.015+02:00", "highlightTitle": ""}