{"organizations": [], "uuid": "7c3887a17744a09fd8879d2feae176188ef1cac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-politics-europe/update-1-german-parties-offers-first-response-to-macron-on-europe-idUSL8N1P71QY", "country": "US", "domain_rank": 408, "title": "UPDATE 3-German parties offer Macron first response on Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-12T18:01:00.000+02:00", "replies_count": 0, "uuid": "7c3887a17744a09fd8879d2feae176188ef1cac9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-politics-europe/update-1-german-parties-offers-first-response-to-macron-on-europe-idUSL8N1P71QY", "ord_in_thread": 0, "title": "UPDATE 3-German parties offer Macron first response on Europe", "locations": [], "entities": {"persons": [{"name": "berl", "sentiment": "negative"}, {"name": "macron", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "noah barkin", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "andreas rinke", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}, {"name": "european monetary fund", "sentiment": "none"}, {"name": "esm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Policy document pledges “new awakening” for Europe\n* Document is first concrete response from Berlin to Macron\n* French, EU officials hail breakthrough\n* Devil in the detail on ESM, investment budget plans (Adds Juncker, French government reaction)\nBy Noah Barkin and Andreas Rinke\nBERLIN, Jan 12 (Reuters) - German Chancellor Angela Merkel’s conservatives and the Social Democrats pledged on Friday to work closely with France to strengthen the euro zone, in Berlin’s first substantive response to President Emmanuel Macron’s ambitious EU reform proposals.\nIn a 28-page policy document agreed after all-night talks between the German parties, they backed the idea of an “investment budget” for the single currency bloc and turning the ESM bailout mechanism into a full-blown European Monetary Fund under parliamentary control and anchored in EU law.\n“Together, we are determined to use Germany’s strength, both economically and politically, to make Europe a grand project again,” said Martin Schulz, leader of the SPD, at a news conference with Merkel after the marathon talks. “This is our common goal.”\nThe agreement was welcomed by France and the European Commission, where concerns have mounted in recent months that the window for reforming Europe could close without a German breakthrough. “This deal is important for the stability and future of Franco-German relations, but especially Europe,” said French government spokesman Benjamin Griveaux.\nEuropean Commission President Jean-Claude Juncker called it a “significant, positive, forward-looking contribution” to the European policy debate.\nThe document agreed on Friday is expected to form the basis for formal coalition talks between the parties that could begin later this month and be concluded by March.\nMerkel’s first attempt to form what Germans refer to as a “Jamaica” coalition with the Greens and Free Democrats (FDP) collapsed in November.\n“This is far better than what ‘Jamaica’ wanted to do. Good opening for DE-FR cooperation,” tweeted Henrik Enderlein, director of the Jacques Delors Institut Berlin, a think-tank. “But the devil is in the detail on these issues. So the key negotiations are still ahead.”\nPLODDING REACTION Macron was elected last May on a promise to overhaul the EU, shaken by nearly a decade of financial turmoil, the refugee crisis of 2015 and Britain’s decision, a year later, to leave the bloc. The shift to “America First” policies under President Donald Trump has also bolstered the case for reform.\nDays after the German election in September, Macron spelled out sweeping proposals in a speech in Paris, calling for a euro zone budget to help the bloc cope with external economic shocks and closer cooperation on defence and migration.\nBut he has been forced to wait for months for a concrete response from Merkel, who has come under mounting criticism at home and abroad for her plodding reaction to Macron, aggravated by her struggle to form a new government.\nIn the document, the German parties called for “a new awakening for Europe” and pledged to work closely with France to achieve this, but remained vague on the details.\n“In close partnership with France, we want to sustainably strengthen and reform the euro zone so the euro can better withstand global crises,” the parties said.\nThey promised to devote “specific budget funds” to the economic stabilisation of the single currency bloc and to support “social convergence” and structural reforms, saying this could form the basis of a future “investment budget”.\nThe document urged Europe to take its fate into its own hands in response to U.S. policy shifts under Trump and the challenges posed by a stronger China and more aggressive Russia.\nIt also stressed the crucial role of Franco-German cooperation in that process, saying a renewal of the EU could only succeed if Germany and France “work together with all their strength”.\nThe document made no mention of Brexit or of European plans to complete its so-called “banking union”, a vital project aimed at removing the link between troubled banks and sovereigns that has plagued countries like Ireland, Spain and Italy.\nMerkel vowed at a summit of EU leaders last month to finalise joint positions on Europe with Macron by March.\nBut that will likely depend on whether she can build on the policy document agreed on Friday over the coming months and forge what would be her third “grand coalition” with the SPD.\nAdditional reporting by Alastair Macdonald in Sofia and Jean-Baptiste Vey in Paris; Editing by Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:01:00.000+02:00", "crawled": "2018-01-13T14:44:02.000+02:00", "highlightTitle": ""}