{"organizations": [], "uuid": "a400557c5f4345698e908851dfac8a79061bd7b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-cyber-europe-kkr-optiv/kkr-backed-cyber-firm-optiv-expands-into-europe-with-deals-in-mind-idUSKBN1FC22E", "country": "US", "domain_rank": 408, "title": "KKR-backed cyber firm Optiv expands into Europe with deals in mind", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-23T23:21:00.000+02:00", "replies_count": 0, "uuid": "a400557c5f4345698e908851dfac8a79061bd7b2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cyber-europe-kkr-optiv/kkr-backed-cyber-firm-optiv-expands-into-europe-with-deals-in-mind-idUSKBN1FC22E", "ord_in_thread": 0, "title": "KKR-backed cyber firm Optiv expands into Europe with deals in mind", "locations": [], "entities": {"persons": [{"name": "optiv", "sentiment": "negative"}, {"name": "church", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "optiv", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kkr", "sentiment": "none"}, {"name": "simon church", "sentiment": "none"}, {"name": "integralis", "sentiment": "none"}, {"name": "ntt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Optiv Security, an acquisitive Denver-based company backed by private equity firm KKR, is expanding into Europe where it will offer its cyber security management and consultancy services, executives said on Tuesday.\nOptiv also is looking to roll-up independent security firms to gain geographic and technical scale, starting in Britain and then across Europe, they said. Rivals include national telecom operators and global computer and management consulting firms.\nThe company, which is majority owned by KKR, the world’s No.2 private equity firm, has hired Simon Church as European general manager and executive vice president.\nChurch, a veteran deal maker, executed a smaller-scale roll-up of European managed security services from 2009 to 2015 as director and later CEO of Integralis, which was acquired by Japan’s NTT Com Security. He aims to replicate that at Optiv.\n“There is no really pan-European player in the way Integralis was in the pure-play security provider market, along with two or three other worthy competitors at that time,” Church told Reuters in a phone interview.\nHe more recently worked at security venture capital investor C5 Capital and as CEO of Vodafone Enterprise Security Services.\nOptiv, which had a turnover of around $2.25 billion last year, draws up strategies for knitting together thousands of potential security products and then offers them as managed services for clients who can’t afford to maintain in-house security teams of their own.\nOptiv executives said they were looking to offer similar consulting and managed security services to European-centered firms and offer more services on the ground to existing U.S. clients in Europe.\nFrost & Sullivan predicts that managed security service revenue in Europe, the Middle East and Africa will nearly double to $8.3 billion between 2016 and 2021.\nEurope’s managed security market is stratified among mature technology providers and newer entrants focused on cloud and mobile services and data breach remediation, experts say. Staff are in short supply, stoking demand for managed services.\nOrganizations also are racing to comply with Europe’s General Data Protection Regulation, which takes effect in May, which sets stiff penalties for data breach failings.\nOptiv aims to grow through a mix of organic, internally generated sales growth, outside security acquisitions and so-called “acquihires” in order to pick up top talent, Church said.\nAcquisitions can run up to tens of millions of dollars each, or be far larger if strategic deals come into play, Evans said.\nOptiv is itself the result of a 2015 merger of Accuvant and FishNet Security, both roughly around $700 million revenue companies at the time. The company expanded further into Canada in November.\nIt has 1,800 employees and counts nearly two-thirds of Fortune 1000 companies among its customers, Chief Marketing Officer Peter Evans said by phone.\nOutside of North America, Western Europe is the largest market for corporate security, larger than all other regions combined, Gartner estimates. It forecasts total spending to grow to around US$32.6 billion by 2021, up 27 percent from 2017.\n(1 British pound = $1.3989)\nReporting by Eric Auchard; Editing by Douglas Busvine and Susan Fenton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T23:21:00.000+02:00", "crawled": "2018-01-23T17:34:28.000+02:00", "highlightTitle": ""}