{"organizations": [], "uuid": "01dcb04af16783e08f2a00063c2a0f06babc2b70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-bulgaria-church-treaty/treaty-opposing-violence-against-women-will-lead-to-moral-decay-bulgarian-church-says-idUSKBN1FB2LS", "country": "US", "domain_rank": 408, "title": "Treaty opposing violence against women will lead to 'moral decay', Bulgarian church says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:46:00.000+02:00", "replies_count": 0, "uuid": "01dcb04af16783e08f2a00063c2a0f06babc2b70"}, "author": "", "url": "https://www.reuters.com/article/us-bulgaria-church-treaty/treaty-opposing-violence-against-women-will-lead-to-moral-decay-bulgarian-church-says-idUSKBN1FB2LS", "ord_in_thread": 0, "title": "Treaty opposing violence against women will lead to 'moral decay', Bulgarian church says", "locations": [], "entities": {"persons": [{"name": "boyko borissov", "sentiment": "none"}], "locations": [{"name": "sofia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bulgarian orthodox church", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:46 PM / in 36 minutes Treaty opposing violence against women will lead to 'moral decay', Bulgarian church says Reuters Staff 3 Min Read \nSOFIA (Reuters) - The Bulgarian Orthodox Church on Monday urged lawmakers not to ratify a treaty designed to combat violence against women and domestic violence, saying it was opening the door to “moral decay”. \nIt said some of the treaty’s clauses raised concern about the future of European Christian civilization, importing alien values from a godless society. \nEarlier this month the center-right government led by Prime Minister Boyko Borissov submitted the Council of Europe convention for ratification in the parliament in a move that divided opinions in the European Union’s poorest country, which now holds the EU’s rotating presidency for the first time since it joined the bloc in 2007. \nThe 81-article document, also known as the Istanbul Convention, is intended to reinforce measures to protect women from violence. Some 28 countries ratified the treaty, which has been signed by 45 countries, including Bulgaria. \nThe Bulgarian Church, however, has joined the chorus against ratification, saying it is opening the door to moral decay. It said the document opposes the basic beliefs of the Bulgarian people about faith, nationality, morality, honor, dignity, education and family. \n“It is a tool that instills a value system that is unfamiliar to us in order to allow society to be governed by a new model in the interests of a small part of it,” the Church’s Holy Synod, its top executive body, said in a statement. \nJunior coalition partner United Patriots, an alliance of three nationalist parties, and the Socialist Party - the largest opposition party in the Balkan country, have joined forces to oppose the cabinet’s decision while populist Will said some texts should be removed. \nBut Tsvetan Tsvetanov, the head of the ruling GERB party’s parliamentary group, it was an EU commitment and would not bring the coalition down. \nThe Church said the treaty opens the door to spiritual death and is totally opposed to Christianity. \n“It raises concerns about the future of the European Christian civilization because it contains a new understanding of man - man as an absolute master, the man without God who follows his desires and passions to such an extent that he can even determine his gender,” the Holy Synod said. \n“The consequences of denying biblical truths are tragic and we are witnessing them in many societies where ”gender“ ideology has long been a state policy,” the church said. \nAround 80 percent of Bulgarians identify themselves as Orthodox Christians - the mainstream religion also in Russia, Ukraine, Belarus, Greece, Romania and Serbia. But only a few see church-going as important to their lives. \nTrust in the Orthodox Church was shaken after a history commission showed a few years ago that many bishops collaborated with the former communist era secret police. Reporting by Angel Krasimirov Editing by Jeremy Gaunt.", "external_links": [], "published": "2018-01-22T20:46:00.000+02:00", "crawled": "2018-01-22T20:58:55.002+02:00", "highlightTitle": ""}