{"organizations": [], "uuid": "1e9ba1d81bca3bfd0d1616853b24e9164d6a22b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923665-GettyImages-899781822-iran.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/how-iran-protests-could-impact-oil-prices.html", "country": "US", "domain_rank": 767, "title": "How Iran protests could impact oil prices", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.206, "site_type": "news", "published": "2018-01-03T15:40:00.000+02:00", "replies_count": 0, "uuid": "1e9ba1d81bca3bfd0d1616853b24e9164d6a22b8"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/03/how-iran-protests-could-impact-oil-prices.html", "ord_in_thread": 0, "title": "How Iran protests could impact oil prices", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "helima croft", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "mashhad", "sentiment": "none"}], "organizations": [{"name": "renewable energy how iran", "sentiment": "negative"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The protests spreading across Iran pose no immediate threat to the nation's oil exports, analysts said. However, the unrest could cause the Trump administration to take an even tougher stance against Iran, increasing the odds of a major supply disruption.\nIran has restored its oil production to nearly 4 million barrels a day since a historic 2015 deal with six world powers that lifted crippling sanctions on the country. A major disruption in Iran could send crude prices sharply higher just as the oil market is emerging from a prolonged period of oversupply.\nDemonstrations began last week in Mashhad, Iran's second largest city, and have spread to several urban and provincial areas, including the capital Tehran. Dissatisfaction with Iran's sluggish economy emerged as a unifying grievance, but protesters have also spoken out against Iran's leadership and its financial support for foreign groups.\n\"If there is a particularly brutal crackdown like in 2009, [Trump] may feel more empowered to take the moral high ground with the Europeans.\" -Helima Croft, global head of commodity strategy, RBC Capital Markets The protests lack a central leader or a clear objective and have not reached the scale of demonstrations that broke out after a contested election in 2009, according to Cliff Kupchan, chairman of risk consultancy the Eurasia Group.\n\"It's really small. It's not even a remote threat at this point to Iranian production. The 2.3 million barrels a day that Iran exports I think are quite safe right now,\" Kupchan told CNBC's \"Closing Bell\" on Tuesday.\nIn order to disrupt those supplies, the protests would have to spark strikes in the nation's oil fields, and there is so far no indication that will happen, analysts said.\nshow chapters Oil exports from Iran not likely to be disrupted by protests      8:42 PM ET Mon, 1 Jan 2018 | 04:07 \"I think that's another stage down the road. I'm not saying it couldn't happen, but it's certainly not something I'm going to bet my little dollars on today. No, I think the oil price is where it should be,\" David Roche, president of advisory firm Independent Strategy, told CNBC Asia's \"Squawk Box.\" \nAt least some traders were bidding up the price of oil this week. U.S. West Texas Intermediate crude hit its highest level since mid-2015 in early trading on Tuesday, slipped back throughout the session and then struck a fresh 2½-year high on Wednesday morning.\nAnalysts said that response is to be expected — but so is a corresponding dip in oil prices.\n\"There is a knee-jerk reaction in the market, but then as the market sees that actual supplies aren't really being affected, there's a little bit of a pullback typically,\" said Vandana Hari, founder and CEO of Vandana Insights, an Asian energy markets analysis firm.\nHari said the protests spreading throughout Iran right now are distinct from the instability that has gripped producer nations like Nigeria and Libya, where militants have directly targeted oil infrastructure to achieve their political aims. Even if the demonstrations continue or grow larger, they are unlikely to affect Iranian oil supplies, she told CNBC Asia's \"Capital Connection \" on Tuesday.\nshow chapters The bullish tone in the crude market to start the year a bit of a surprise      11:49 PM ET Mon, 1 Jan 2018 | 02:26 Helima Croft, global head of commodity strategy for RBC Capital Markets, said an oil worker strike is unlikely, but she sees another threat to Iranian supplies in the near term.\nThe protests may embolden President Donald Trump to refuse to waive the sanctions targeting Iran's economy and energy industry that the United States suspended as part of the 2015 Iran nuclear deal. Trump faces several deadlines in coming weeks on whether to extend sanctions and or certify that Iran is complying with the deal.\nDepending on Tehran's response to the protests, Trump may try to force Europeans to curtail Iranian crude imports and delay planned investments in Iran's oil and gas development.\n\"If there is a particularly brutal crackdown like in 2009, he may feel more empowered to take the moral high ground with the Europeans,\" Croft told CNBC in an email.\nThe Iranian regime has a vast security apparatus loyal to Supreme Leader Ayatollah Ali Khamenei that is more than capable of suppressing the current demonstrations, analysts said. The death toll from the protests has reached at least 21, and hundreds of people have been detained, according to news reports.\nWhile Iranian protests are likely to result in further oppression, that is not likely to significantly influence international attitudes toward Iran, according to Roche.\n\"There will be of course the usual mouthings about being nice to your citizens, but it won't lead to abrogation, for example, of the nuclear deal,\" he said. \"That's just not going to happen.\"", "external_links": [], "published": "2018-01-03T15:40:00.000+02:00", "crawled": "2018-01-03T15:59:12.001+02:00", "highlightTitle": ""}