{"organizations": [], "uuid": "49398ff82e4410737a1f6242461cc5a2a52139fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/17/104476749-Dell_headquarters.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/dell-is-considering-a-sale-to-vmware-in-what-may-be-techs-biggest-deal.html", "country": "US", "domain_rank": 767, "title": "Dell is considering a sale to VMWare in what may be tech's biggest deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.17, "site_type": "news", "published": "2018-01-29T18:25:00.000+02:00", "replies_count": 0, "uuid": "49398ff82e4410737a1f6242461cc5a2a52139fe"}, "author": "Alex Sherman", "url": "https://www.cnbc.com/2018/01/29/dell-is-considering-a-sale-to-vmware-in-what-may-be-techs-biggest-deal.html", "ord_in_thread": 0, "title": "Dell is considering a sale to VMWare in what may be tech's biggest deal", "locations": [], "entities": {"persons": [{"name": "ralph orlowski", "sentiment": "none"}], "locations": [], "organizations": [{"name": "vmware", "sentiment": "neutral"}, {"name": "dell", "sentiment": "neutral"}, {"name": "emc", "sentiment": "none"}, {"name": "getty images  dell technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Ralph Orlowski | Getty Images \nDell Technologies could emerge as a public company through a reverse-merger with VMware , the $60 billion cloud computing company it already controls, according to people familiar with the matter. \nThe reverse merger, whereby VMware would actually buy the larger Dell, would then allow Dell to be traded publicly without going through a formal listing. It would also likely be the biggest deal in tech industry history, giving investors who backed Dell's move to go private in 2013 a way to monetize their deal, while helping Dell pay down some of its approximately $50 billion debt. \nWhile Dell may also pursue a more traditional initial public offering, said the people, a reverse merger would allow the company to avoid a new public offering. Dell hasn't decided on a strategic option and is also considering several other paths forward, including other acquisitions or buying the remaining stake of VMware it doesn't own, as has been previously reported . Dell is unlikely to sell the company outright or sell its stake in VMware, one of the people said. \nVMware was seen as the crown jewel in 2015 when Dell acquired EMC for $67 billion. That gave Dell 80 percent of VMware, which was an early pioneer in a technology called virtualization. That process gave companies a way to run the large computers in their data centers more efficiently by packing multiple \"virtual\" computers on a single piece of hardware. \nWhile the technique is still widely used, VMware's growth prospects have been tempered as companies have moved more of their infrastructure from their own data centers to large cloud providers like Amazon and Microsoft . In 2016, the company agreed to let customers run its software on arch-rival Amazon's cloud service, an admission that the cloud model is taking precedence. \nThe reverse-merger is one of the more audacious strategic initiatives being looked at by Dell and its advisers, said the people, who asked not to be named because the discussions are private. Dell's board of directors will meet later this month to consider a slew of options, many of which are still in the early stages of examination, including the reverse merger. \nIf VMware were to buy Dell, VMware would issue shares to Michael Dell and Silver Lake, the private owners of Dell. The owners could then sell shares on the public market as a way of monetizing their investment in Dell, the people said. \nThe exact valuation of Dell isn't known because the company is private. Dell took itself private in a $24.4 billion deal in 2013. It then acquired EMC for $67 billion in 2015, a deal that still stands as the largest technology acquisition of all time. \nTheoretically, a VMware acquisition for Dell would top that, making it the largest technology deal ever. Dell acquired more than 80 percent of VMware when it completed its deal for EMC in 2016. VMware's platform virtualization software was a key reason Dell pursued EMC two years ago. \nWhile VMware's revenue has consistently grown each year, that has slowed. Annual sales rose 6.7 percent in 2016 from 2015 after six consecutive years of double-digit percentage growth. Still, net income of $1.2 billion was an all-time high for the company for 2016, and 2017 full-year estimates suggest the company will top that mark. \nA spokesman for Dell declined to comment. A spokeswoman for VMware didn't immediately respond for comment. Alex Sherman Technology Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-29T18:25:00.000+02:00", "crawled": "2018-01-29T18:25:22.008+02:00", "highlightTitle": ""}