{"organizations": [], "uuid": "33cf303b7851fd854ad4b895e3c9c6c0b0a914bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-blackbaud-names-catherine-cook-lacour-as-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "Blackbaud Names Catherine Cook LaCour as Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:02:00.000+02:00", "replies_count": 0, "uuid": "33cf303b7851fd854ad4b895e3c9c6c0b0a914bf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-blackbaud-names-catherine-cook-lacour-as-chief-marketing-officer.html", "ord_in_thread": 0, "title": "Blackbaud Names Catherine Cook LaCour as Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "catherine cook lacour", "sentiment": "negative"}, {"name": "lacour", "sentiment": "none"}, {"name": "blackbaud", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "blackbaud", "sentiment": "none"}], "organizations": [{"name": "blackbaud, inc.", "sentiment": "neutral"}, {"name": "cmo", "sentiment": "none"}, {"name": "regent education", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "international telecommunications union", "sentiment": "none"}, {"name": "blackbaud institute for philanthropic impact", "sentiment": "none"}, {"name": "blackbaud", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLESTON, S.C., Jan. 12, 2018 /PRNewswire/ -- Blackbaud, Inc. (NASDAQ: BLKB), the world's leading cloud software company powering social good, announced today that Catherine Cook LaCour has been named Chief Marketing Officer (CMO), overseeing global marketing and the Blackbaud Institute for Philanthropic Impact™.\nLaCour takes the reins as CMO for the social good software leader with a career track record of breakthrough results in the public, private and social sectors. Prior to joining Blackbaud in 2010, she served as vice president of marketing & product management at Regent Education and vice president of marketing and business development for Infotech Strategies. She also served in Africa for the International Telecommunications Union, an arm of the United Nations.\nDuring her tenure at Blackbaud, LaCour has served in multiple marketing leadership roles. Over the last three years as senior vice president, she re-engineered Blackbaud's corporate marketing function from the ground up and led the company to re-imagine its brand to better align with its purpose-driven mission and values. Under her leadership, Blackbaud has been honored with more than fifty noteworthy accolades and named to Fortune's prestigious 56 \"Companies Changing the World\" list in 2017. She also launched the Blackbaud Institute for Philanthropic Impact to advance research and collaboration that accelerates social impact around the world.\n\"As we embrace our commitment to help every organization in the social good community achieve digital transformation, there is no more qualified leader than Catherine LaCour to lead our global marketing strategy,\" said Mike Gianoni, president and CEO of Blackbaud. \"Her track record of building high-impact marketing teams coupled with her passion for creating remarkable customer experiences will play a critical role in our next season of innovation and growth.\"\nLaCour is co-chair of Blackbaud's women's executive networking community and is actively involved as part of Fortune's Most Powerful Women network. She regularly convenes leaders across sectors—in conjunction with platforms like the World Economic Forum and UN Week—to drive partnerships that strengthen the social economy. She currently serves on the Board of Directors of the Women's Refugee Commission, a nonprofit advocating for laws, policies and programs to improve the lives and protect the rights of refuge women and children. She also serves on the College of Charleston Graduate School's Advisory Board. LaCour is a distinguished fellow with the Liberty Fellowship (a part of The Aspen Institute Global Leadership Network), a worldwide community of leaders from business, government and the nonprofit sectors who share a commitment to enlightened leadership and to using their creativity, energy and resources to tackle the foremost societal challenges of our times. She was recently invited by Secretary Bobby Hitt to serve on South Carolina Department of Commerce's Council for Innovation Initiatives.\nLaCour is a sought-after expert on marketing and social impact, who regularly speaks at events like TEDx, the Social Innovation Summit, and more. She has a Master of Business Administration from American Graduate School of International Management (Thunderbird) and a Bachelor of Science in Business from the College of Charleston.\n\"For Blackbaud, excellence in marketing is about a relentless pursuit of new ways to delight customers, to connect organizations and people, and to inspire innovation in ways that drives unprecedented impact,\" said LaCour. \"As a shared value company, we're more bullish than ever about flexing this muscle for the good of the entire social economy.\"\nFor more about LaCour, and Blackbaud's full executive leadership team, visit www.blackbaud.com/company/executive-leadership.aspx .\nAbout Blackbaud\nBlackbaud (NASDAQ: BLKB ) is the world's leading cloud software company powering social good. Serving the entire social good community—nonprofits, foundations, corporations, education institutions, healthcare institutions and individual change agents—Blackbaud connects and empowers organizations to increase their impact through software, services, expertise, and data intelligence. The Blackbaud portfolio is tailored to the unique needs of vertical markets, with solutions for fundraising and CRM, marketing, advocacy, peer-to-peer fundraising, corporate social responsibility, school management, ticketing, grantmaking, financial management, payment processing, and analytics. Serving the industry for more than three decades, Blackbaud is headquartered in Charleston, South Carolina and has operations in the United States, Australia, Canada and the United Kingdom. For more information, visit www.blackbaud.com .\nMedia Contact\nNicole McGougan\nPublic Relations Manager\n843.654.3307\nmedia@blackbaud.com\nForward-looking Statements\nExcept for historical information, all of the statements, expectations, and assumptions contained in this news release are forward-looking statements that involve a number of risks and uncertainties, including statements regarding expected benefits of products and product features. Although Blackbaud attempts to be accurate in making these forward-looking statements, it is possible that future circumstances might differ from the assumptions on which such statements are based. In addition, other important factors that could cause results to differ materially include the following: general economic risks; uncertainty regarding increased business and renewals from existing customers; continued success in sales growth; management of integration of acquired companies and other risks associated with acquisitions; risks associated with successful implementation of multiple integrated software products; the ability to attract and retain key personnel; risks associated with management of growth; lengthy sales and implementation cycles, particularly in larger organization; technological changes that make our products and services less competitive; and the other risk factors set forth from time to time in the SEC filings for Blackbaud, copies of which are available free of charge at the SEC's website at www.sec.gov or upon request from Blackbaud's investor relations department. All Blackbaud product names appearing herein are trademarks or registered trademarks of Blackbaud, Inc.\nView original content with multimedia: http://www.prnewswire.com/news-releases/blackbaud-names-catherine-cook-lacour-as-chief-marketing-officer-300581987.html\nSOURCE Blackbaud, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/blackbaud-names-catherine-cook-lacour-as-chief-marketing-officer-300581987.html", "http://www.blackbaudinstitute.com/", "http://www.blackbaud.com/company/executive-leadership.aspx", "https://www.blackbaud.com/", "http://phx.corporate-ir.net/phoenix.zhtml?c=176673&p=irol-irhome"], "published": "2018-01-12T18:02:00.000+02:00", "crawled": "2018-01-12T17:41:53.022+02:00", "highlightTitle": ""}