{"organizations": [], "uuid": "40906e0307f563656066cdfc6eb3dbc4195eccd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/06/102563001-467701296.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/02/oil-prices-close-to-mid-2015-highs-but-doubts-over-further-rises-loom.html", "country": "US", "domain_rank": 767, "title": "Oil prices close to mid-2015 highs, but doubts over further rises loom", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-03T05:12:00.000+02:00", "replies_count": 0, "uuid": "40906e0307f563656066cdfc6eb3dbc4195eccd2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/oil-prices-close-to-mid-2015-highs-but-doubts-over-further-rises-loom.html", "ord_in_thread": 0, "title": "Oil prices close to mid-2015 highs, but doubts over further rises loom", "locations": [], "entities": {"persons": [{"name": "ole hansen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "saxo bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices were stable on Wednesday, not far off mid-2015 highs reached the previous session, as strong demand and ongoing efforts led by OPEC and Russia to curb production tightened the market.\nU.S. West Texas Intermediate (WTI) crude futures were at $60.40 a barrel at 0141 GMT, up 3 cents from their last close, and not far off the $60.74 June 2015 high reached the previous day.\nBrent crude futures - the international benchmark for oil prices - were at $66.55 a barrel, down 2 cents but still not far off the $67.29 May 2015 high from the previous day.\nDespite this, there were indicators that markets had overshot in the last days of 2017 and trading this year, as U.S. production is set to rise further and doubts are emerging about whether demand growth can continue at current levels.\nOle Hansen, head of commodity strategy at Denmark's Saxo Bank warned that \"multiple but temporary supply disruptions\" like the North Sea Forties and Libyan pipeline outages (and) protests across Iran ... helped create a record speculative long bet.\"\nshow chapters Is a fresh supply response in store on higher oil prices? 11 Hours Ago | 02:18 With the pipeline outages resolved and the protests in Iran showing no signs of impacting its oil production, Hansen said there was potential for a price downturn in early 2018, especially due to rising U.S. output.\n\"It is only a matter of time before the 10 million barrel per day (bpd) production target will be reached,\" Hansen said.\nU.S. oil production has risen by almost 16 percent since mid-2016, hitting 9.75 million bpd at the end of last year.\nThere was also some concern that output by Russia, the world's biggest oil producer and one of the key drivers together with the Organization of the Petroleum Exporting Countries (OPEC) in cutting supplies, was in fact not falling.\nAs part of the supply cut deal, Russia pledged to reduce its output by 300,000 bpd from the 30-year monthly high of 11.247 million bpd hit in October 2016, which it achieved by the second quarter of 2017, according to Russian energy ministry data.\nFor the whole of 2017, however, Russian output rose to an average output of 10.98 million bpd, compared with 10.96 million bpd in 2016 and 10.72 million bpd in 2015.\n\"We also have some concerns about the Chinese economy in 2018 that ultimately could lead to lower than expected demand growth,\" Hansen said.\n\"By year-end we see Brent crude at $60 per barrel with WTI three dollars lower at $57 per barrel.\"", "external_links": [], "published": "2018-01-03T05:12:00.000+02:00", "crawled": "2018-01-03T04:35:00.019+02:00", "highlightTitle": ""}