{"organizations": [], "uuid": "a1bc3805eec872dba701fce96bf9705928214d81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226290967&w=1200&r=LYNXMPEE0S0VY", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-italy-referees/serie-a-coaches-angry-and-baffled-over-var-decisions-idUKKBN1FI1HI", "country": "US", "domain_rank": 408, "title": "Serie A coaches angry and baffled over VAR decisions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:38:00.000+02:00", "replies_count": 0, "uuid": "a1bc3805eec872dba701fce96bf9705928214d81"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-italy-referees/serie-a-coaches-angry-and-baffled-over-var-decisions-idUKKBN1FI1HI", "ord_in_thread": 0, "title": "Serie A coaches angry and baffled over VAR decisions", "locations": [], "entities": {"persons": [], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "gazzetta", "sentiment": "none"}, {"name": "min read  milan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ifab", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:38 PM / Updated 2 hours ago Serie A coaches angry and baffled over VAR decisions Reuters Staff 4 Min Read \nMILAN (Reuters) - The introduction of a video replay system (VAR) for referees was supposed to eliminate doubts over decisions and allow the football to take centre stage. \nThe main talking-points from the Sunday’s Serie A matches in Italy, however, again centred on refereeing decisions with VAR seemingly only adding to the confusion rather than stopping it. \nThat could make worrying viewing for FIFA which is hoping to use VAR at the World Cup in Russia provided the system, currently in use on a trial basis in a number of countries, is authorised by the sport’s law-making body IFAB. \nThat decision is expected on March 3. \nFIFA will have to ask how a system, which is still causing confusion after five months of use in Serie A, can be expected to run smoothly in a tournament where it will be new to most referees and players. \nNeither FIFA nor IFAB could immediately be reached for comment on Monday. \nThe incidents which led Gazzetta dello Sport to talk of a “black Sunday for referees and VAR” concerned a Milan goal against Lazio which both coaches agreed was handball and a last-minute match-winning Crotone goal disallowed against Cagliari. \nLazio coach Simone Inzaghi said it was unbelievable that Patrick Cutrone’s goal for Milan was given when television replays showed the ball went in off his arm. \n“I would like to lose for once without VAR in the middle,” said Inzaghi, who has previously complained that VAR has taken the enjoyment out of the sport. SEVERAL MINUTES \nCrotone’s 90th-minute goal was initially awarded but the referee changed his mind and gave offside after reviewing the incident, a decision which took several minutes. Replays suggested the goal should have stood. \n“We had won the game,” Crotone coach Walter Zenga said after the 1-1 draw. \n“I saw the incident on television and it dawned on me that it wasn’t offside and I don’t understand how the referee could have made that mistake despite reviewing the incident. It’s inexplicable.” \nAnother drawback with VAR, which has been exposed in Serie A, is that controversy also arises if a decision is not reviewed - as happened in Napoli’s 3-1 win over Bologna. \nBologna thought they should have been awarded a penalty for handball by Napoli defender Kalidou Koulibaly when the score was 1-1 and were equally angry at a penalty awarded to Napoli for the slightest contact on Jose Callejon. \n“In the first incident, (the referee) took the responsibility for the decision himself, maybe to save time, and in the second, he left it to someone else, in this case, the VAR,” Bologna coach Roberto Donadoni said. \n“I would have preferred the same degree of judgement for both decisions.” \nThe length of time it takes to make decisions is another bone of contention, with Juventus coach Massimiliano Allegri warning last year that matches could last “three or four hours” if it was overused. \nAtalanta coach Gian Piero Gasperini said on Monday that, with or without VAR, decisions would always depend on the interpretation of the referee. \n“Yesterday was unfortunate, but certain episodes are repeated on any given Sunday,” he said. “With VAR, the pictures don’t lie. It’s the interpretation which causes a storm.” Writing by Brian Homewood in Bern, editing by Ed Osmond", "external_links": [], "published": "2018-01-29T14:38:00.000+02:00", "crawled": "2018-01-29T16:22:21.012+02:00", "highlightTitle": ""}