{"organizations": [], "uuid": "8c4bfc7cb106576cdc6dde8e04dc9dd4eba4f7bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224199365&w=1200&r=LYNXMPEE0L1L1", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-football-nfl-superbowl/patriots-eagles-ready-for-super-bowl-showdown-idUKKBN1FB279", "country": "US", "domain_rank": 408, "title": "Patriots, Eagles ready for Super Bowl showdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:09:00.000+02:00", "replies_count": 0, "uuid": "8c4bfc7cb106576cdc6dde8e04dc9dd4eba4f7bd"}, "author": "", "url": "https://uk.reuters.com/article/uk-football-nfl-superbowl/patriots-eagles-ready-for-super-bowl-showdown-idUKKBN1FB279", "ord_in_thread": 0, "title": "Patriots, Eagles ready for Super Bowl showdown", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "patriots", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "minnesota vikings", "sentiment": "none"}, {"name": "jacksonville jaguars", "sentiment": "none"}, {"name": "pittsburgh steelers", "sentiment": "none"}, {"name": "eagles", "sentiment": "none"}, {"name": "nfc", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 13 PM / Updated 9 minutes ago Patriots, Eagles ready for Super Bowl showdown Reuters Staff 2 Min Read \n(Reuters) - The New England Patriots and Philadelphia Eagles have set up a second Super Bowl showdown after both teams won their respective conference championships with contrasting victories on Sunday. \nThe reigning NFL champion Patriots overcame a stubborn Jacksonville Jaguars 24-20 in the AFC title game, while the Eagles crushed the Minnesota Vikings 38-7 in the NFC decider to set up a Feb. 4 clash in Minneapolis. \nNew England enjoyed the upper hand when the two last contested an NFL title game in 2005, winning 24-21, and should the favoured Patriots repeat that triumph, they will secure a record-tying sixth Super Bowl victory. \nThe Pittsburgh Steelers are currently the only team with more NFL championships than the Patriots, who will be making their 10th appearance in the title game. \nPhiladelphia has never won a Super Bowl, the Eagles also losing in 1981 before that Patriots defeat 13 years ago. \nOverall, the teams have met have 13 times through the years, with the Eagles winning seven of the games, the last in 2015. Jan 21, 2018; Foxborough, MA, USA; New England Patriots quarterback Tom Brady (12) celebrates after a first down by running back Dion Lewis (33) picks up a first down in the fourth quarter in the AFC Championship Game against the Jacksonville Jaguars at Gillette Stadium. Mandatory Credit: Robert Deutsch-USA TODAY Sports \nTom Brady, despite an injured hand, rallied New England from a 10-point deficit in the fourth quarter with two touchdown passes to Danny Amendola to beat Jacksonville, \nPhiladelphia had its own quarterback star to thank for their victory when Nick Foles passed for three touchdowns as the Eagles scored 38 unanswered points. Slideshow (9 Images) \nThe Eagles also crushed Minnesota’s dream of becoming the first team to play a Super Bowl in their home stadium. \nAlong with chasing a sixth title, New England also has another goal: seeking to become the first team in 13 seasons to win back-to-back Super Bowls. \nThey were the last to achieve the feat, capturing the 2003 and 2004 crowns behind the arm of Brady, who has been the Patriots quarterback for all five of their titles, a record. \n“It’s just been an unbelievable run,” said Brady, who will be making his eighth Super Bowl appearance with coach Bill Belichick. Reporting by Gene Cherry in Salvo, North Carolina; Editing by John O'Brien", "external_links": [], "published": "2018-01-22T18:09:00.000+02:00", "crawled": "2018-01-22T18:25:57.008+02:00", "highlightTitle": ""}