{"organizations": [], "uuid": "e2cbb8bf436dc6a6b1bb57515e192f784d3daac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-forum-merger-corporation-announces-record-and-meeting-dates-for-special-meeting-relating-to-the-announced-business-combination.html", "country": "US", "domain_rank": 767, "title": "Forum Merger Corporation Announces Record and Meeting Dates for Special Meeting Relating to the Announced Business Combination with ConvergeOne", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-29T14:00:00.000+02:00", "replies_count": 0, "uuid": "e2cbb8bf436dc6a6b1bb57515e192f784d3daac2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-forum-merger-corporation-announces-record-and-meeting-dates-for-special-meeting-relating-to-the-announced-business-combination.html", "ord_in_thread": 0, "title": "Forum Merger Corporation Announces Record and Meeting Dates for Special Meeting Relating to the Announced Business Combination with ConvergeOne", "locations": [], "entities": {"persons": [], "locations": [{"name": "eagan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}], "organizations": [{"name": "forum merger corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "investment corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, and EAGAN, Minn., Forum Merger Corporation (Nasdaq: FMCI) (\"Forum\" or the \"Company\"), a special purpose acquisition company, today announced that it has set a record date of February 1, 2018 (the \"Record Date\") and a meeting date of February 20, 2018 for the special meeting (the \"Special Meeting\") relating to the previously announced business combination between Forum and ConvergeOne, a leading global IT services provider of collaboration and technology solutions.\nThe Record Date determines the holders of the Company's common stock entitled to notice of, and to vote at, the Special Meeting or any postponement or adjournment thereof, whereby stockholders will be asked to approve the Agreement and Plan of Merger, dated November 30, 2017 (the \"Merger Agreement\") and the transactions contemplated thereby, by which C1 Investment Corp. (\"C1\") will become a wholly-owned subsidiary of Forum through a two-step merger, (the \"Business Combination\"), and such other proposals as disclosed in the proxy statement relating to the Special Meeting.\nThe Special Meeting will take place at 9:00 a.m., Eastern Time, on February 20, 2018 at the offices of Ellenoff Grossman & Schole LLP, at 1345 Avenue of the Americas, 11th Floor, New York, New York 10105.\nIf the Business Combination is approved by stockholders, the Company anticipates closing the Business Combination shortly after the Special Meeting subject to satisfaction or waiver (as applicable) of all other closing conditions.\nA complete list of Forum stockholders of record entitled to vote at the Special Meeting will be available for ten days before the Special Meeting at the principal executive offices of Forum for inspection by stockholders during ordinary business hours for any purpose germane to the Special Meeting.\nAbout Forum\nForum Merger Corporation is a blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more businesses or entities. The Company's efforts to identify a prospective target business will not be limited to a particular industry or geographic region. Forum Merger Corporation is led by Executive Chairman Stephen A. Vogel, Co-Chief Executive Officer and President Marshall Kiev and Co-Chief Executive and Chief Financial Officer David Boris. More information is available at www.forummerger.com .\nAbout ConvergeOne\nFounded in 1993, ConvergeOne is a leading global IT service provider of collaboration and technology solutions for large and medium enterprise with decades of experience assisting customers to transform their digital infrastructure and realize a return on investment. Over 7,200 enterprise and mid-market customers trust ConvergeOne with collaboration, enterprise networking, data center, cloud and security solutions to achieve business outcomes. Our investments in cloud infrastructure and managed services provide transformational opportunities for customers to achieve financial and operational benefits with leading technologies. ConvergeOne has partnerships with more than 300 global industry leaders, including Avaya, Cisco, IBM, Genesys and Microsoft to customize specific business outcomes. We deliver solutions with a full life cycle approach including strategy, design and implementation with professional, managed and support services. ConvergeOne holds more than 2,100 technical certifications across hundreds of engineers throughout North America including three Network Operations Centers. More information is available at www.convergeone.com .\nAdditional Information and Where to Find It\nIn connection with the proposed transaction, Forum has filed a Registration Statement on Form S-4, which includes a preliminary proxy statement/prospectus of Forum. When available, Forum will mail a definitive proxy statement/prospectus and other relevant documents to its stockholders.\nInvestors and security holders of Forum are advised to read, when available, the preliminary proxy statement/prospectus, and amendments thereto, and the definitive proxy statement/prospectus in connection with Forum's solicitation of proxies for its special meeting of stockholders to be held to approve the proposed transaction because the proxy statement/prospectus will contain important information about the proposed transaction and the parties to the proposed transaction. The definitive proxy statement/prospectus will be mailed to stockholders of Forum as of the Record Date for voting on the proposed transaction.\nStockholders may obtain free copies of the Registration Statement, proxy statement/prospectus, as well as other filings containing information about the Company, without charge, at the SEC's website ( www.sec.gov ). Stockholders may also be able to obtain these documents, free of charge, by accessing the Company's website ( https://forummerger.com/ ). Copies of the proxy statement and the filings with the SEC that are incorporated by reference in the proxy statement/prospectus and copies of the transaction documents can also be obtained, without charge, by directing a request to Forum Merger Corporation, 135 East 57th Street, 8th Floor, New York, New York 10022, Attention: David Boris ,Tel: (212) 739-7860.\nForward Looking Statements\nThis press release includes \"forward‐looking statements\" regarding ConvergeOne, its financial condition and its results of operations that reflect ConvergeOne's current views and information currently available. This information is, where applicable, based on estimates, assumptions and analysis that ConvergeOne believes, as of the date hereof, provide a reasonable basis for the information contained herein. Forward‐looking statements can generally be identified by the use of forward‐looking words such as \"may\", \"will\", \"would\", \"could\", \"expect\", \"intend\", \"plan\", \"aim\", \"estimate\", \"target\", \"anticipate\", \"believe\", \"continue\", \"objectives\", \"outlook\", \"guidance\" or other similar words, and include statements regarding ConvergeOne's plans, strategies, objectives, targets and expected financial performance. These forward‐looking statements involve known and unknown risks, uncertainties and other factors, many of which are outside the control of Forum, ConvergeOne and their respective officers, employees, agents or associates. These risks, uncertainties, assumptions and other important factors include, but are not limited to: (1) the occurrence of any event, change or other circumstances that could give rise to the termination of the Merger Agreement and the proposed Business Combination contemplated thereby; (2) the inability to complete the transaction contemplated by the Merger Agreement due to the failure to obtain approval of the stockholders of Forum or other conditions to closing in the Merger Agreement; (3) the inability to meet the minimum cash requirements of the Merger Agreement due to the inability to consummate the concurrent pipe financing or the amount of cash available following any redemptions by Forum stockholders; (4) the ability to meet national exchange listing standards following the consummation of the transaction contemplated by the Merger Agreement; (5) the risk that the proposed transaction disrupts current plans and operations of ConvergeOne as a result of the announcement and consummation of the transaction described herein; (6) the ability to recognize the anticipated benefits of the proposed Business Combination, which may be affected by, among other things, competition, the ability of the combined company to grow and manage growth profitably, maintain relationships with customers and suppliers and retain its management and key employees; (7) costs related to the proposed Business Combination; (8) changes in applicable laws or regulations; (9) the possibility that ConvergeOne may be adversely affected by other economic, business, and/or competitive factors; (10) ConvergeOne's ability to identify and integrate acquisition; and (11) other risks and uncertainties indicated from time to time in the final proxy statement/prospectus of Forum, including those under \"Risk Factors\" therein, and other documents filed or to be filed with the Securities and Exchange Commission (\"SEC\") by Forum.\nActual results, performance or achievements may differ materially, and potentially adversely, from any projections and forward‐looking statements and the assumptions on which those vary from forward‐looking statements are based. There can be no assurance that the data contained herein is reflective of future performance to any degree. You are cautioned not to place undue reliance on forward‐looking statements as a predictor of future performance as projected financial information, cost savings, synergies and other information are based on estimates and assumptions that are inherently subject to various significant risks, uncertainties and other factors, many of which are beyond our control. All information herein speaks only as of (1) the date hereof, in the case of information about ConvergeOne, or (2) the date of such information, in the case of information from persons other than ConvergeOne. ConvergeOne undertakes no duty to update or revise the information contained herein. Forecasts and estimates regarding ConvergeOne's industry and end markets are based on sources we believe to be reliable, however there can be no assurance these forecasts and estimates will prove accurate in whole or in part.\nNo Offer or Solicitation\nThis announcement is for informational purposes only and is neither an offer to purchase, nor a solicitation of an offer to sell, subscribe for or buy any securities or the solicitation of any vote in any jurisdiction pursuant to the proposed transactions or otherwise, nor shall there be any sale, issuance or transfer or securities in any jurisdiction in contravention of applicable law. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended.\nParticipants in the Solicitation\nForum and ConvergeOne and their respective directors, executive officers, other members of management, and employees, under SEC rules, may be deemed to be participants in the solicitation of proxies of Forum's stockholders in connection with the proposed transaction. Investors and security holders may obtain more detailed information regarding the names and interests in the proposed transaction of Forum's directors and officers in Forum's filings with the SEC, including Forum's Registration Statement on Form S-4, which will include the proxy statement/prospectus of Forum for the proposed transaction.\nMedia Contact:\nScott Clark, Vice President, Marketing, ConvergeOne\n651.393.3957\nsclark@convergeone.com\n with multimedia: releases/forum-merger-corporation-announces-record-and-meeting-dates-for-special-meeting-relating-to-the-announced-business-combination-with-convergeone-300589311.html\nSOURCE ConvergeOne", "external_links": ["http://www.forummerger.com/", "http://www.convergeone.com/", "https://forummerger.com/", "http://www.prnewswire.com/news-releases/forum-merger-corporation-announces-record-and-meeting-dates-for-special-meeting-relating-to-the-announced-business-combination-with-convergeone-300589311.html"], "published": "2018-01-29T14:00:00.000+02:00", "crawled": "2018-01-29T16:49:03.025+02:00", "highlightTitle": ""}