{"organizations": [], "uuid": "67165349f94374ea3f8b3225b1161bd54624954b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-lando-anastasi-llp-names-new-partner-in-life-sciences-group.html", "country": "US", "domain_rank": 767, "title": "Lando & Anastasi, LLP Names New Partner in Life Sciences Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:40:00.000+02:00", "replies_count": 0, "uuid": "67165349f94374ea3f8b3225b1161bd54624954b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-lando-anastasi-llp-names-new-partner-in-life-sciences-group.html", "ord_in_thread": 0, "title": "Lando & Anastasi, LLP Names New Partner in Life Sciences Group", "locations": [], "entities": {"persons": [{"name": "anastasi", "sentiment": "negative"}, {"name": "lando", "sentiment": "negative"}, {"name": "allen c. nunnally", "sentiment": "none"}, {"name": "david lu", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "peter lando", "sentiment": "none"}, {"name": "diana collazo", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}], "organizations": [{"name": "lando & anastasi, llp names new partner in life sciences group", "sentiment": "neutral"}, {"name": "l&a", "sentiment": "none"}, {"name": "management committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Lando and Anastasi, LLP (L&A) recently announced the election of David Lu, Ph.D. as a Partner of the firm. The Cambridge-based intellectual property law firm is one of the largest IP firms in New England and is projecting 20% growth in its legal staff this year.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006229/en/\nDavid Lu, Ph.D. Joins L&A Partnership (Photo: Business Wire)\n“We are very excited to welcome David to the partnership. Throughout the nearly ten years he has been at L&A, David has worked tirelessly to support our clients and achieve their goals. His deep understanding of the underlying science and IP law enables David to work closely with our clients to develop and implement sophisticated patent strategies,” commented Diana Collazo, a partner and head of L&A’s life sciences practice, and Peter Lando, a founding partner and a member of the firm’s Management Committee.\nAllen C. Nunnally, Vice President, Corporate & Business Development/Associate General Counsel of Foundation Medicine, Inc., noted, “We are thrilled with the news of David’s recognition. His hard work and support of Foundation Medicine over the years and the accomplishments he has had with the progress and issuance of many important patents is deeply appreciated. We look forward to continuing our work with David and the L&A team.”\nLouis Myers, founder of Kendall Square IP Strategies, LLC and former partner of L&A, added, “I have worked with David for years, and have seen him develop into a superb practitioner. David is talented and incredibly knowledgeable, and he richly deserves having achieved this milestone.”\nDavid was previously an associate at L&A and joined the firm’s Life Sciences group in 2008. David represents clients in all areas of biotechnology and pharmaceuticals, including biochemistry, molecular biology, cancer biology, immunology, microbiology, genetics and genomics. He has particular expertise in patent prosecution, opinion work, due diligence and general intellectual property counseling.\nDavid graduated from Suffolk University Law School – IP Law Concentration with Distinction, and received his Ph.D. in Molecular Genetics and Microbiology, with a Certificate in Bioinformatics and Genome Technology from Duke University. He earned an M.S. in Genetics and a B.S. in Biochemistry from Fudan University (Shanghai, China), and a Certificate in Computer Software Engineering from the Chinese Ministry of Electronics Industry. David was a Postdoctoral Fellow at Dana-Farber Cancer Institute and Harvard Medical School.\nDavid is the author of more than a dozen peer-reviewed research articles published in leading scientific journals, and has presented his research at a number of national and international conferences. The technical expertise he acquired from his doctoral and post-doctoral training at prestigious universities and research institutions enables him to adapt rapidly to today’s cutting-edge technologies.\nLife Sciences Practice Group\nL&A’s Life Sciences team includes some of the most experienced and knowledgeable IP professionals in the Boston area. We combine Ph.D.-level life sciences expertise with a deep understanding of the commercial and legal realities that drive business success. From early-stage, venture-funded companies to multinational corporations, biotechnology and pharmaceutical innovators count on our team to help them navigate the complex IP landscape. Our attorneys have broad expertise in a wide range of cutting-edge diagnostic and therapeutic technologies, products, and processes.\nAbout Lando & Anastasi, LLP\nLando & Anastasi, LLP headquartered in Cambridge, Massachusetts, partners with clients to protect their innovations through effective intellectual property strategies. This partnership complements an emphasis on creative and strategic solutions guided by a solid understanding of each client’s business imperatives. Well versed in a wide range of industries including life sciences, software, cleantech, medical devices, chemical and electrical engineering, L&A attorneys counsel clients ranging from individuals to early-stage and venture-backed start-ups to small and large national and global corporations.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006229/en/\nLando & Anastasi, LLP\nKaren Borofsky, 617-395-7008\nkborofsky@lalaw.com\nSource: Lando & Anastasi, LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lalaw.com%2Fpeople%2Fdavid-lu-ph-d%2F&esheet=51746771&newsitemid=20180122006229&lan=en-US&anchor=David+Lu%2C+Ph.D.&index=1&md5=0ee013f77a791a7437b97ce309dad5ea", "http://www.businesswire.com/news/home/20180122006229/en/"], "published": "2018-01-22T19:40:00.000+02:00", "crawled": "2018-01-22T20:11:14.004+02:00", "highlightTitle": ""}