{"organizations": [], "uuid": "f6c1ccc88de5528693dc3f4cea1c48d5a63d482f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225242965&w=1200&r=LYNXMPEE0O1HC", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-putin-airplane/putin-hails-new-bomber-as-a-boost-to-russias-nuclear-forces-idUSKBN1FE27S", "country": "US", "domain_rank": 408, "title": "Putin hails new bomber as a boost to Russia's nuclear forces", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:08:00.000+02:00", "replies_count": 0, "uuid": "f6c1ccc88de5528693dc3f4cea1c48d5a63d482f"}, "author": "", "url": "https://www.reuters.com/article/us-russia-putin-airplane/putin-hails-new-bomber-as-a-boost-to-russias-nuclear-forces-idUSKBN1FE27S", "ord_in_thread": 0, "title": "Putin hails new bomber as a boost to Russia's nuclear forces", "locations": [], "entities": {"persons": [{"name": "putin", "sentiment": "negative"}, {"name": "vladimir soldatkin", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "ussr", "sentiment": "none"}], "organizations": [{"name": "min read  kazan", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 7:09 PM / in 2 hours Putin hails new bomber as a boost to Russia's nuclear forces Vladimir Soldatkin 3 Min Read \nKAZAN, Russia (Reuters) - President Vladimir Putin praised a newly-built supersonic strategic bomber on Thursday after watching it in flight, saying it would beef up Russia’s nuclear weapons capability. \nUnder a contract signed on Thursday, 10 of the modernized TU-160M nuclear bombers, codenamed Blackjacks by NATO, will be delivered to the Russian Air Force at a cost of 15 billion rubles ($269 million) each between now and 2027. \nThe giant swing-wing plane is a substantially modernized-version of a Soviet-era bomber that the USSR would have deployed in the event of a nuclear war with the West to deliver nuclear weapons at long distances. \n“This is a serious step towards developing our hi-tech sphere and strengthening the country’s ability to defend itself,” said Putin, who said the new plane would strengthen Russia’s nuclear weapons capability. \nThe TU-160M is capable of carrying 12 cruise missiles or 12 short-range nuclear missiles and can fly 12,000 km (7,500 miles) non—stop without re-fuelling. \nPutin, who is standing for re-election on March 18, a contest polls show he is likely to easily win, inspected the factory in Kazan where the new plane is being built as well as an airstrip, hangars and modernized workshops. Russian President Vladimir Putin, Defence Minister Sergei Shoigu and Deputy Defence Minister Yuri Borisov visit the Gorbunov Aviation factory in Kazan, Russia January 25, 2018. Sputnik/Alexei Nikolsky/Kremlin via REUTERS \nUnder Putin, who has dominated the political landscape for the last 18 years, Russia has significantly increased defense spending and used military force in Georgia, Ukraine and Syria. \nExisting versions of the TU-160 have flown from bases in Russia to Syria where they have bombed forces opposed to President Bashar al-Assad, one of Moscow’s closest Middle East allies. Slideshow (5 Images) \nTupolev, the plane’s manufacturer, says the modernized version will be 60 percent more effective than the older version with significant improvements to its weaponry, navigation and avionics. \nRinat Khamatov, the plant’s chief welder, said Russia needed a modernized version of the bomber. \n“The TU-160...is a weapon of deterrence and it is great that Russia is able to start making it again,” he told Reuters. \nRussia also aims to produce a modernized version of its Il-78 refueling tanker, codenamed Midas by NATO, which can refuel the TU-160 mid-air, enabling it to reach any point on the planet. Editing by Andrew Osborn and Angus MacSwan", "external_links": [], "published": "2018-01-25T21:08:00.000+02:00", "crawled": "2018-01-25T21:15:41.005+02:00", "highlightTitle": ""}