{"organizations": [], "uuid": "9c2959a4ee4a7021bfd1feef5edc4a029b76f3e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220020109&w=1200&r=LYNXMPEE060DP", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-awards-goldenglobes/golden-globes-its-not-who-wins-but-who-will-say-what-idUKKBN1EW0FN", "country": "US", "domain_rank": 408, "title": "Seth Meyers rips into Hollywood sex scandal at Golden Globes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T04:10:00.000+02:00", "replies_count": 0, "uuid": "9c2959a4ee4a7021bfd1feef5edc4a029b76f3e9"}, "author": "", "url": "https://uk.reuters.com/article/us-awards-goldenglobes/golden-globes-its-not-who-wins-but-who-will-say-what-idUKKBN1EW0FN", "ord_in_thread": 0, "title": "Seth Meyers rips into Hollywood sex scandal at Golden Globes", "locations": [], "entities": {"persons": [{"name": "seth meyers", "sentiment": "negative"}, {"name": "meyers", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "beverly hills", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "golden globe", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 12:17 PM / Updated 38 minutes ago 'Three Billboards' wins big as Golden Globes power through sex scandal Jill Serjeant 4 Min Read \nLOS ANGELES (Reuters) - Dark drama “Three Billboards Outside Ebbing, Missouri” was the big winner with four Golden Globes awards on Sunday on a night marked by scathing jokes about sexual harassment and passionate odes to those breaking their silence. Greta Gerwig director of Lady Bird accepts the award for Best Motion Picture Comedy or Musical at the 75th Golden Globe Awards in Beverly Hills, California, U.S. January 7, 2018. Paul Drinkwater/Courtesy of NBC/Handout via REUTERS \nMother-daughter comedy “Lady Bird” was named best comedy film and the indie A24 movie’s star Saoirse Ronan won for comedy actress. \nGary Oldman was named best drama movie actor for his role as British wartime leader Winston Churchill in Focus Features’“Darkest Hour” and Frances McDormand took home the award for drama actress for her role as an angry mother seeking vengeance in Fox Searchlight’s “Three Billboards.” \nJames Franco won the comedy actor award for his cult movie homage “The Disaster Artist,” also from A24. Mexican director Guillermo del Toro won best director for magical fantasy “The Shape of Water.” \nHowever, the night was dominated not by who took home prizes but by jokes and speeches about the sexual misconduct scandal that has rocked Hollywood. \n“Happy New Year Hollywood! It’s 2018. Marijuana is finally allowed and sexual harassment finally isn‘t,” quipped Globes host Seth Meyers in his opening remarks, bringing wild applause from the A-list audience in Beverly Hills. \nMultiple allegations against actors, filmmakers and Hollywood agents since October 2017 have led to many of the accused being fired, forced to step down, or dropped from creative projects. \nReferring to the male nominees gathered in Beverly Hills for the top television and movie awards, Meyers said: “This is the first time in three months it won’t be terrifying to hear your name read out loud.” \nThe evening began with the normally colorful red carpet transformed into a sea of black gowns as every actress showed solidarity with victims of sexual harassment inside and outside the entertainment industry. Many have given their own harrowing accounts. [L1N1P300D] Frances McDormand, wins Best Performance by an Actress in a Motion Picture Drama for \"Three Billboards Outside Ebbing, Missouri\" at the 75th Golden Globe Awards in Beverly Hills, California, U.S. January 7, 2018. Paul Drinkwater/Courtesy of NBC/Handout via REUTERS \nWomen kept up the theme inside the Beverly Hilton ballroom. \n“This year, we became the story,” Oprah Winfrey said in a rousing speech while accepting the annual lifetime achievement award. \nMcDormand said she was proud to be a woman in the industry. “It’s great to be here and be part of the tectonic shift in our industry’s power structure,” she said. Slideshow (25 Images) \nLaura Dern, a supporting actress winner for “Big Little Lies,” said: “May we teach our children that speaking out without retribution is our culture’s new north star.” \nThe HBO TV series was one of several female-driven winners on Sunday. \nThe Golden Globes ceremony, the first of the major awards shows in the run-up to the Oscars in March, marked the first big test for how Hollywood would handle the scandal. \nMeyers joked that, as the first of the hosts, he felt like “the first dog they shot into outer space.” \nHe appeared to have found the right balance, getting cheers in the room and warm early reviews. Industry website Deadline.com said Meyers “deftly executed a seemingly impossible task,” while E! News said he “made lemonade out of lemons.” \nDystopian tale “The Handmaid’s Tale” won best TV drama series and “The Marvelous Mrs. Maisel,” Amazon’s new series about a 1950s housewife who become a stand-up comedian, took best TV comedy or musical series. [L1N1P3046] \nFox Searchlight and parent company Twentieth Century Fox were the big winners in terms of studios, with their films winning seven awards. Indie movie studio A24 had three. Additional reporting by Piya Sinha-Roy and Nichola Groom; Editing by Sandra Maler and Paul Tait", "external_links": [], "published": "2018-01-08T04:10:00.000+02:00", "crawled": "2018-01-08T04:41:17.203+02:00", "highlightTitle": ""}