{"organizations": [], "uuid": "d55cafbb33b9f8149950512187273da6850ed780", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-un/syrian-peace-talks-start-in-vienna-as-russian-meeting-looms-idUSKBN1FE1SR", "country": "US", "domain_rank": 408, "title": "Syrian peace talks start in Vienna as Russian meeting looms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:14:00.000+02:00", "replies_count": 0, "uuid": "d55cafbb33b9f8149950512187273da6850ed780"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-un/syrian-peace-talks-start-in-vienna-as-russian-meeting-looms-idUSKBN1FE1SR", "ord_in_thread": 0, "title": "Syrian peace talks start in Vienna as Russian meeting looms", "locations": [], "entities": {"persons": [{"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "vienna", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA (Reuters) - U.N.-brokered peace talks with the Syrian government and opposition began on Thursday, days before Syria’s close ally Russia was due to host separate negotiations that the West views with suspicion. \n“The meeting was good,” the head of the Syrian government delegation, Bashar al-Ja‘afari, told Reuters as he left the U.N. offices in Vienna in the afternoon after talks with U.N. Special Envoy for Syria Staffan de Mistura. He declined to elaborate. \nAn opposition delegation arrived shortly before he left, but there was no sign the warring sides met. \nPrevious rounds of U.N.-sponsored talks have made little progress while Syrian government forces backed by Russia and Iran have gained ground, recovering swathes of the country from rebel fighters. \nGovernment forces have mounted offensives against two remaining rebel pockets, Idlib in the northwest and eastern Ghouta near Damascus. Turkey has also poured troops into the north to fight Kurdish militias that have established regional autonomy and are seen by Ankara as a menace to its security. \nHaving regained the upper hand in the almost seven-year-old civil war, President Bashar al-Assad appears far from ready to negotiate with his enemies at all, let alone step down as part of any peaceful solution as rebel groups have demanded. \nFew expect a breakthrough at these two-days talks aimed at addressing issues related to a new constitution, but de Mistura, has continued to express optimism. \n“It’s a very critical moment. Very, very critical,” he said on Wednesday. \nIn eight rounds of talks before this week‘s, de Mistura has not managed to coax the two sides into speaking face to face, and it was only at the last round in December that the rebel opposition united in one delegation, raising modest hopes for direct talks. \nRussia, Turkey and Iran convened eight Syria meetings in Astana last year, with the stated aim of agreeing “de-escalation” zones to ease hostilities in western Syria where the three states wield influence. \nThe Sochi peace congress was announced after their last meeting in December. De Mistura has acknowledged the Sochi congress but it remains unclear how he plans to address it. \nWestern and some Arab states believe that Moscow’s initiative would lay groundwork for a solution more favorable to the government in Damascus and its allies. \nThe opposition will decide in the next two days whether to attend Sochi, its chief negotiator Nasr Hariri, said on Wednesday. He said the talks would be a test of all sides’ commitment to a political solution rather than a military one. \nPrevious rounds have taken place sporadically in Geneva, with a mandate to discuss new elections, reformed governance, a new constitution and the fight against terrorism. \nAt the last round in December, the Syrian government delegation objected to the opposition’s tough line on the future of Assad, and those talks achieved nothing. \nReporting by Francois Murphy and Shadia Nasralla, Editing by Raissa Kasolowsky and Angus MacSwan\n ", "external_links": [], "published": "2018-01-25T15:14:00.000+02:00", "crawled": "2018-01-25T15:24:04.002+02:00", "highlightTitle": ""}