{"organizations": [], "uuid": "b96489c0d27644c93e03fdc54c92975b0fe7206e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223658323&w=1200&r=LYNXMPEE0J0M9", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-athletics-coleman/athletics-smashing-the-world-record-the-easy-part-for-coleman-idUSKBN1F90UK", "country": "US", "domain_rank": 408, "title": "Athletics: Smashing the world record the easy part for Coleman", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.355, "site_type": "news", "published": "2018-01-21T01:03:00.000+02:00", "replies_count": 0, "uuid": "b96489c0d27644c93e03fdc54c92975b0fe7206e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-athletics-coleman/athletics-smashing-the-world-record-the-easy-part-for-coleman-idUSKBN1F90UK", "ord_in_thread": 0, "title": "Athletics: Smashing the world record the easy part for Coleman", "locations": [], "entities": {"persons": [{"name": "coleman", "sentiment": "negative"}, {"name": "christian coleman", "sentiment": "none"}, {"name": "emanuel hudson", "sentiment": "none"}, {"name": "maurice greene", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "clemson", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Setting the 60 metres world record of 6.37 seconds turned out to be just part of the challenge for American Christian Coleman.\nWith no drug testing at the Clemson (South Carolina) Invitational on Friday, the world 100 metres silver medallist drove what seemed like halfway to Atlanta, Georgia, two hours away, to meet up with testers, provide a required sample and fill out the necessary paperwork to help ratify the record.\n“The race took six seconds but we have been at it for six hours to get the testing done,” Coleman’s agent Emanuel Hudson told Reuters after shepherding the process through several phone calls and even live social media from his California office.\nPart of the problem was not only finding a drug tester, but ensuring the proper forms for a world record were available.\nColeman, who was days away from his second birthday when compatriot Maurice Greene set the previous 60 metres world record of 6.39 seconds in 1998, said the extra time was worth it since without the drug test there would be no record.\n“It has been a pretty good day for me,” the sprinter told Reuters, still going strong more than two hours after midnight.\n“I always knew the sky was the limit as far as the potential I have.”\nHaving the same agent as Greene, the two have chatted from time to time and Coleman said: “...I told him I was coming for his record. He said he believed I had the capabilities.”\nBREAKTHROUGH YEAR Coleman had a breakthrough campaign in 2017, with the year’s fastest 100 metres, 9.82 seconds, at the U.S. collegiate championships before beating world record holder Usain Bolt for the 100 metres silver at London’s world championships.\nNow the 21-year-old has captured the indoor world record in his first meeting of 2018.\n“I just came into the season wanting to push myself to new heights,” said the former University of Tennessee sprinter who turned professional in June.\n“People turn professional and they are not running as fast as they did in college because it is a lot different, but I wanted to make sure that I didn’t have that kind of transition and always stayed on top.”\nNeither Coleman nor coach Tim Hall had expected what transpired on Friday.\nTraining had been going well, and a speedy 6.47 seconds, the top time in the world, in the preliminaries had set the two thinking maybe something special was possible in the final.\nMentally Coleman also knew he was stronger than last season.\n”Last year I wanted to be great so bad sometimes I would overwork. I would do workouts that weren’t part of the regime.\n“I realised this season I had to work smarter, not harder.”\nDIFFERENT FEELING Starting has also been a point of emphasis, and the Georgia native got out so fast on Friday, “it felt a little different,” he said.\n“It didn’t necessarily feel that great - I felt I could have got more out of it but when you are doing something different you obviously don’t always feel comfortable.”\nHe will next compete in the Boston Indoor Grand Prix on Feb. 10, then go for U.S. and world indoor titles, the latter scheduled for early March in Birmingham, England.\n“It (the world championships) is something I had my mind set on coming into the season because I think in big races is where I excel the most,” Coleman said.\nWhile many had thought Canada’s Andre De Grasse and South African world 400 metres record holder Wayde Van Niekerk would be the next great sprinters with Bolt’s retirement, Coleman had other ideas.\n“I knew potentially I could be the ‘next guy’,” he said.\nSuccess at the 2017 London worlds solidified that feeling.\n“If I can handle the type of pressure and that kind of competition, I am ready to take on the world,” he said.\nReporting by Gene Cherry in Salvo, North Carolina; Editing by Ken Ferris\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T01:03:00.000+02:00", "crawled": "2018-01-20T19:38:51.046+02:00", "highlightTitle": ""}