{"organizations": [], "uuid": "5bf180777e9529b35aa60280fc855c6db00a5e6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/autoshow-detroit-silverado/gms-new-chevy-silverado-bids-for-more-u-s-pickup-profits-idUSL1N1P71NS", "country": "US", "domain_rank": 408, "title": "GM's new Chevy Silverado bids for more U.S. pickup profits", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T17:03:00.000+02:00", "replies_count": 0, "uuid": "5bf180777e9529b35aa60280fc855c6db00a5e6c"}, "author": "", "url": "https://www.reuters.com/article/autoshow-detroit-silverado/gms-new-chevy-silverado-bids-for-more-u-s-pickup-profits-idUSL1N1P71NS", "ord_in_thread": 0, "title": "GM's new Chevy Silverado bids for more U.S. pickup profits", "locations": [], "entities": {"persons": [{"name": "nick carey", "sentiment": "none"}, {"name": "silverado", "sentiment": "none"}, {"name": "competi", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "chevy silverado", "sentiment": "negative"}, {"name": "reuters) - general motors co", "sentiment": "none"}, {"name": "chevrolet silverado", "sentiment": "none"}, {"name": "silverado", "sentiment": "none"}, {"name": "cox automotive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 3:03 PM / Updated 15 minutes ago GM's new Chevy Silverado bids for more U.S. pickup profits Nick Carey , Joseph White 3 Min Read \nDETROIT, Jan 13 (Reuters) - General Motors Co on Saturday will fire a new round in the battle for profits from one of the U.S. auto industry’s most lucrative segments when it shows a new generation of its Chevrolet Silverado pickup truck at Detroit’s auto show. \nThe new Silverado, a highlight of the show, is the successor to GM’s best-selling vehicle in North America. Sales of the current Silverado rose nearly 2 percent to 585,000 vehicles in 2017. \nAnalysts and company executives say the Silverado and the similar GMC Sierra are among the highest-profit models for the company, generating a significant share of its $9 billion in North American pretax earnings for the first nine months of 2017. \nBy adding luxury features to their pickups, automakers have pushed prices in the segment to an average $46,984 a vehicle, according to Cox Automotive. That is well above the industry’s average 2017 transaction price of $31,600 cited by GM. \nCompetition in the North American large pickup market will heat up as GM and rival Fiat Chrysler Automobiles NV begin selling their redesigned trucks later this year and Ford Motor Co invests in its best-selling F-series. \nFiat Chrysler plans to unveil a new generation of its Ram pickup truck at Detroit’s auto show on Monday. \nAt a sneak preview in December, GM said it would offer eight versions of the new Silverado and more engine and transmission combinations than the current lineup. \nExecutives said the new Silverado would have a high-strength steel bed floor and use “mixed materials” to cut weight and improve fuel economy. \nThe F-series, which has an aluminum body, has been the best-selling model line   for 41 years, with 2017 sales of nearly 900,000 vehicles. \nLast year GM sold a total of 947,972 of its four Chevrolet and GMC pickup models, two of which were mid-sized. \nU.S. consumers are shifting away from smaller cars in favor of larger SUVs, crossovers and pickup trucks, a major boon for the Detroit automakers. \nLight trucks accounted for 63.2 percent of U.S. new vehicle sales in 2017, up from 59.5 percent in 2016. \nHowever, U.S. new vehicle sales fell 2 percent in 2017 after hitting a record high in 2016 and are expected to drop further in 2018 as interest rates rise and more late-model used cars come back to dealer lots to compete with new ones. (Reporting by Nick Carey and Joseph White; Editing by Lisa Von Ahn)", "external_links": [], "published": "2018-01-13T17:03:00.000+02:00", "crawled": "2018-01-13T17:23:02.000+02:00", "highlightTitle": ""}