{"organizations": [], "uuid": "4e1bc8f8ca6cbc169236c52500475d0c18e6a06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-pnm-resources-management-to-meet-with-investors.html", "country": "US", "domain_rank": 767, "title": "PNM Resources Management to Meet with Investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-11T22:15:00.000+02:00", "replies_count": 0, "uuid": "4e1bc8f8ca6cbc169236c52500475d0c18e6a06f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-pnm-resources-management-to-meet-with-investors.html", "ord_in_thread": 0, "title": "PNM Resources Management to Meet with Investors", "locations": [], "entities": {"persons": [{"name": "jimmie blotter pahl shipley", "sentiment": "none"}], "locations": [{"name": "n.m.", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "pnm", "sentiment": "negative"}, {"name": "texas-new mexico power company", "sentiment": "none"}, {"name": "public service company of new mexico", "sentiment": "none"}, {"name": "pnm resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALBUQUERQUE, N.M., Jan. 11, 2018 /PRNewswire/ -- PNM Resources (NYSE: PNM) management will meet with analysts and investors this week in Arizona.\nThe presentation materials are available on the company's website at http://www.pnmresources.com/investors/events.cfm .\nBackground:\nPNM Resources (NYSE: PNM) is an energy holding company based in Albuquerque, N.M., with 2016 consolidated operating revenues of $1.4 billion. Through its regulated utilities, PNM and TNMP, PNM Resources has approximately 2,791 megawatts of generation capacity and provides electricity to more than 767,000 homes and businesses in New Mexico and Texas. For more information, visit the company's website at www.PNMResources.com .\nCONTACTS:\nAnalysts\nMedia\nJimmie Blotter\nPahl Shipley\n(505) 241-2227\n(505) 241-2782\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995\nStatements made in this news release that relate to future events or PNM Resources, Inc.'s (\"PNMR\"), Public Service Company of New Mexico's (\"PNM\"), or Texas-New Mexico Power Company's (\"TNMP\") (collectively, the \"Company\") expectations, projections, estimates, intentions, goals, targets, and strategies are made pursuant to the Private Securities Litigation Reform Act of 1995. Readers are cautioned that all forward-looking statements are based upon current expectations and estimates. PNMR, PNM, and TNMP assume no obligation to update this information. Because actual results may differ materially from those expressed or implied by these forward-looking statements, PNMR, PNM, and TNMP caution readers not to place undue reliance on these statements. PNMR's, PNM's, and TNMP's business, financial condition, cash flow, and operating results are influenced by many factors, which are often beyond their control, that can cause actual results to differ from those expressed or implied by the forward-looking statements. For a discussion of risk factors and other important factors affecting forward-looking statements, please see the Company's Form 10-K and Form 10-Q filings with the Securities and Exchange Commission, which factors are specifically incorporated by reference herein.\nNon-GAAP Financial Measures\nGAAP refers to generally accepted accounting principles in the U.S. Ongoing earnings is a non-GAAP financial measure that excludes the impact of net unrealized mark-to-market gains and losses on economic hedges, the net change in unrealized impairments on available-for-sale securities, and certain non-recurring, infrequent, and other items that are not indicative of fundamental changes in the earnings capacity of the Company's operations. The Company uses ongoing earnings and ongoing earnings per diluted share (or ongoing diluted earnings per share) to evaluate the operations of the Company and to establish goals, including those used for certain aspects of incentive compensation, for management and employees. While the Company believes these financial measures are appropriate and useful for investors, they are not measures presented in accordance with GAAP. The Company does not intend for these measures, or any piece of these measures, to represent any financial measure as defined by GAAP. Furthermore, the Company's calculations of these measures as presented may or may not be comparable to similarly titled measures used by other companies. The Company uses ongoing earnings guidance to provide investors with management's expectations of ongoing financial performance over the period presented. While the Company believes ongoing earnings guidance is an appropriate measure, it is not a measure presented in accordance with GAAP. The Company does not intend for ongoing earnings guidance to represent an expectation of net earnings as defined by GAAP. Since the future differences between GAAP and ongoing earnings are frequently outside the control of the Company, management is generally not able to estimate the impact of the reconciling items between forecasted GAAP net earnings and ongoing earnings guidance, nor their probable impact on GAAP net earnings; therefore, management is generally not able to provide a corresponding GAAP equivalent for ongoing earnings guidance.\nView original content with multimedia: http://www.prnewswire.com/news-releases/pnm-resources-management-to-meet-with-investors-300581613.html\nSOURCE PNM Resources, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/pnm-resources-management-to-meet-with-investors-300581613.html", "http://www.pnmresources.com/investors/events.cfm"], "published": "2018-01-11T22:15:00.000+02:00", "crawled": "2018-01-11T23:33:54.034+02:00", "highlightTitle": ""}