{"organizations": [], "uuid": "823435874a5bf1055c42ce0e26a211afd92429d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222045482&w=1200&r=LYNXMPEE0E05Z", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-williams/bencic-sends-venus-crashing-out-of-australian-open-idUSKBN1F40AP", "country": "US", "domain_rank": 408, "title": "Bencic sends Venus crashing out of Australian Open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:05:00.000+02:00", "replies_count": 0, "uuid": "823435874a5bf1055c42ce0e26a211afd92429d8"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-williams/bencic-sends-venus-crashing-out-of-australian-open-idUSKBN1F40AP", "ord_in_thread": 0, "title": "Bencic sends Venus crashing out of Australian Open", "locations": [], "entities": {"persons": [{"name": "venus", "sentiment": "negative"}, {"name": "bencic", "sentiment": "negative"}, {"name": "belinda bencic", "sentiment": "none"}, {"name": "peter rutherford", "sentiment": "none"}, {"name": "luksika kumkhum", "sentiment": "none"}, {"name": "johanna larsson", "sentiment": "none"}, {"name": "venus williams", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 4:10 AM / in 7 hours Bencic sends Venus packing on bleak day for America Ian Ransom 4 Min Read \nMELBOURNE (Reuters) - Swiss Belinda Bencic sent an early shockwave through the Australian Open on Monday by toppling last year’s finalist Venus Williams on an opening day of carnage for American tennis. \nWith defending champion and new mum Serena absent, 20-year-old Bencic’s brilliant 6-3 7-5 win under the Rod Laver Arena roof ensured there would not be a Williams sister in the second round of the tournament for the first time in over 20 years. \nIt also continued a bleak day for the United States, with three of their four women’s semi-finalists from Flushing Meadows last year falling at the first hurdle. \nU.S. Open champion Sloane Stephens tumbled in three sets against China’s plucky Zhang Shuai, before 10th seed Coco Vandeweghe was sent packing in two by Hungary’s Timea Babos. \nFor former world number seven Bencic, victory was another step on an impressive comeback trail from a wrist surgery that saw her tumble out of the top 300 last year before her return in September. \nIt was also a matter of felling a seven-times grand slam-winning idol, having never won a set against her in four previous matches. \n“I think (before) I had a little bit too much respect, played a little bit careful and safe,” Bencic, who was a toddler when Venus won her first grand slam at Wimbledon in 2000, told reporters. \n“This time, I really tried to come out and, you know, hit it big. Also tactically be smart on the court.” \nNow ranked 78th, Bencic teamed up with Roger Federer to win the Hopman Cup for Switzerland in the lead-up and was thrilled to have the defending champion’s parents watching from her players’ box as she worked over Williams in less than two hours. \nFederer’s parents are used to seeing wins and Bencic did not disappoint, playing the 37-year-old American to perfection. Tennis - Australian Open - Venus Williams of the U.S. v Belinda Bencic of Switzerland - Rod Laver Arena, Melbourne, Australia, January 15, 2018. Williams leaves after losing her match. REUTERS/Thomas Peter CLEAN HITTING \nSoaking up the fifth seed’s firepower, she counter-punched brilliantly to seal the match with a pair of rasping forehand winners. \nIt had started as a slow-burning contest of short, sharp rallies but burst into life when Williams’s serve crumbled in the seventh game. Slideshow (3 Images) \nThe American fought desperately to level but Bencic saved five break points before rain halted play for some 15 minutes to allow the roof to close. \nUpon resumption, Bencic laced a huge backhand down the line to finally consolidate, before breaking Williams to love and closing out the set with a crosscourt backhand. \nVenus battled to keep touch in an enthralling second set but the clean hitting and younger legs of Bencic carried away the match in the 12th game. \nBencic advances to meet the winner of the first round encounter between Swede Johanna Larsson and Thai qualifier Luksika Kumkhum as she continues her ascent into the upper echelons of the women’s game. \nWilliams, meanwhile, may have plenty of American company on the plane home, with men’s 16th seed John Isner also sent packing, upset in four sets by unfancied local Matthew Ebden. \nCrestfallen, Williams’s post-match news conference wrapped up quickly, with short responses and a sombre monotone. \n“I don’t think I played a bad match,” she said. “She just played above and beyond. I just have to give her credit for that.” Editing by Peter Rutherford/John O'Brien", "external_links": [], "published": "2018-01-15T06:05:00.000+02:00", "crawled": "2018-01-15T06:22:40.031+02:00", "highlightTitle": ""}