{"organizations": [], "uuid": "4a616f5bbc7b6a870fb541eb0f4e4a8aaaa102d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/law", "section_title": "", "url": "https://www.reuters.com/article/usa-healthcare-funding/update-2-n-y-minnesota-sue-trump-administration-over-healthcare-funding-cuts-idUSL2N1PL18C", "country": "US", "domain_rank": 408, "title": "UPDATE 2-N.Y., Minnesota sue Trump administration over healthcare funding cuts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:03:00.000+02:00", "replies_count": 0, "uuid": "4a616f5bbc7b6a870fb541eb0f4e4a8aaaa102d8"}, "author": "", "url": "https://www.reuters.com/article/usa-healthcare-funding/update-2-n-y-minnesota-sue-trump-administration-over-healthcare-funding-cuts-idUSL2N1PL18C", "ord_in_thread": 0, "title": "UPDATE 2-N.Y., Minnesota sue Trump administration over healthcare funding cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 8:28 PM / in an hour UPDATE 2-N.Y., Minnesota sue Trump administration over healthcare funding cuts Reuters Staff \n(Adds no comment from HHS, details from lawsuit, background) \nBy Brendan Pierson \nNEW YORK, Jan 26 (Reuters) - New York and Minnesota have filed a lawsuit seeking to block the Trump administration from cutting off federal funding for state programs that provide healthcare to hundreds of thousands of low-income people. \nThe lawsuit, filed on Friday in Manhattan federal court, seeks to restore more than $1 billion in funding for state health programs created under the Affordable Care Act, former President Barack Obama’s signature domestic policy achievement, a statement from New York Attorney General Eric Schneiderman said. \nA spokesman for the U.S. Department of Health and Human Services (HHS) declined to comment. A spokesman for Minnesota Attorney General Lori Swanson could not immediately be reached. \nNew York and Minnesota are the only states that operate so-called Basic Health Programs, a type of health insurance plan for low-income residents authorized by the law, according to Schneiderman’s statement. \nIn December, HHS told both states it would cut off some of the federal funding for the programs because Congress had not appropriated money for them, according to the lawsuit. Schneiderman said the cut amounted to about 25 percent of the funding for New York’s Basic Health Program. \nAbout 800,000 people in both states are covered by the programs, according to the lawsuit. The programs generally cover people who are not eligible for Medicaid, a joint state and federal health insurance program, whose income is less than 200 percent of the federal poverty level. \nHHS told the states in December that it was cutting off the portion of the Basic Health Program funds that went to so-called cost-sharing reduction, subsidies to help patients with co-payments and other out-of-pocket medical charges. \nPresident Donald Trump’s administration has already cut off cost-sharing subsidies for people who buy insurance on the Affordable Care Act’s health insurance exchanges in October. It said it could not continue making the payments, which are guaranteed under the Affordable Care Act (ACA), because Congress had not appropriated the money for them. \nTrump, a Republican, promised in his 2016 presidential campaign to repeal the ACA, sometimes known as Obamacare. (Reporting By Brendan Pierson in New York; editing by Susan Thomas and Frances Kerry)", "external_links": [], "published": "2018-01-27T00:03:00.000+02:00", "crawled": "2018-01-27T00:11:09.006+02:00", "highlightTitle": ""}