{"organizations": [], "uuid": "8f3461db3dcefa86cd01eac189df7eec2706433e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-dyadic-international-appoints-new-board-member.html", "country": "US", "domain_rank": 767, "title": "Dyadic International Appoints New Board Member", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T20:08:00.000+02:00", "replies_count": 0, "uuid": "8f3461db3dcefa86cd01eac189df7eec2706433e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-dyadic-international-appoints-new-board-member.html", "ord_in_thread": 0, "title": "Dyadic International Appoints New Board Member", "locations": [], "entities": {"persons": [{"name": "mark emalfarb", "sentiment": "none"}, {"name": "buckland", "sentiment": "none"}, {"name": "barry buckland", "sentiment": "none"}, {"name": "arindam bose", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "dyadic international appoints new board", "sentiment": "negative"}, {"name": "dyadic international, inc.", "sentiment": "neutral"}, {"name": "merck research laboratories", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUPITER, Fla., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Dyadic International, Inc. (“Dyadic”) (OTCQX:DYAI), a global biotechnology company focused on the development and large-scale manufacture of low cost, better performing biologic vaccines and drugs at flexible commercial scales, today announced the appointment of Barry Buckland, Ph.D., to its Board of Directors, effective January 3rd, 2018.\nDr. Buckland spent 29 years at Merck where he served in a number of senior R&D leadership roles. His last position was serving as Vice President Bioprocess R&D, Merck Research Laboratories focusing on fermentation and bioprocess development and the commercial manufacturing of biologics.\n“We are very excited that Dr. Buckland has joined Dyadic’s board of directors,” said Mark Emalfarb, Dyadic’s CEO. “His extensive background and experience in biological process development and commercialization, especially for vaccines, complement existing board member Dr. Arindam Bose’s expertise in externalized novel biopharmaceutical and biosimilar development, thereby providing the Company with invaluable expertise, insight and guidance for our research and commercial initiatives.” Mr. Emalfarb further commented, “Dr. Buckland has an extensive global network of business and research relationships that we expect will help us accelerate the introduction and adoption of our C1 technology by the pharmaceutical and biotech industry for use in the development and manufacture of biologic vaccines and drugs.”\nChairman of the Board, Michael Tarnok, stated, “Dr. Buckland is an ideal addition to Dyadic's team as we work to further commercialize our C1 technology platform.\"\nDr. Buckland commented, “I am truly excited to join the Dyadic team; the range of applications of Dyadic’s highly productive C1 microbial platform can be further extended using the rapidly developing tools of Synthetic Biology. This has the potential to become the platform of choice for manufacturing protein based biologics because of speed of development and low cost of goods.”\nCurrently, Dr. Buckland is the Executive Director, NIIMBL (National Institute for Innovation in Manufacturing Biopharmaceuticals) – a recently launched flagship US private-public sector partnership. In addition, Dr. Buckland also serves as a consultant and on Scientific Advisory Boards at various companies and institutions.\nPrior positions held by Dr. Buckland at Merck included: Exec. Director, Bioprocess R&D, Merck Research Laboratories (1993-1996), Senior Director, Bioprocess R&D, Merck Research Laboratories (1990-1993), Director, Biochemical Process R&D, Merck Research Laboratories (1986-1990) and Director Fermentation Pilot Plant Merck Research Laboratories (1980-1986) Dr. Buckland began his career as a Biochemical Engineer at Abbott Laboratories and was a Senior Biochemical Engineer at Lederle Laboratories. He received a Ph.D. and MSc in Biochemical engineering from University College London, UK and a BSc Chemical Engineering from Manchester University, UK.\nIn recognition of his outstanding professional accomplishments Dr. Buckland was elected a Member of the prestigious US National Academy of Engineering. In addition, he is a Fellow of the American Institute of Medical and Biological Engineering (AIMBE) as well as of University College, London. His other accolades include: American Chemical Society (ACS) Marvin Johnson Award for Biotechnology; Gold Medal Lecture, International Institute of Biotechnology, London; Donald Medal, UK Institute of Chemical Engineering; as well as the Merck Board of Directors award for leading process development, regulatory approval and launch of 4 major new vaccines. Dr. Buckland was selected by the American Institute of Chemical Engineering (AIChE) as one of the “One Hundred Chemical Engineers of the Modern Era” (defined as from World War II to the present) and Awarded Discoverers Award by the Pharmaceutical Research and Manufacturers of America (PhRMA) for role in discovery and development of Gardasil.\nAbout Dyadic International, Inc.\nDyadic International, Inc. is a global biotechnology company which is developing what it believes will be a potentially significant biopharmaceutical gene expression platform based on the fungus Myceliophthora thermophila , nicknamed C1. The C1 microorganism, which enables the development and large scale manufacture of low cost proteins, has the potential to be further developed into a safe and efficient expression system that may help speed up the development, lower production costs and improve the performance of biologic vaccines and drugs at flexible commercial scales. Dyadic is using the C1 technology and other technologies to conduct research, development and commercial activities for the development and manufacturing of human and animal vaccines, monoclonal antibodies, biosimilars and/or biobetters, and other therapeutic proteins. Dyadic pursues research and development collaborations, licensing arrangements and other commercial opportunities with its partners and collaborators to leverage the value and benefits of using these technologies in the development and manufacture of biopharmaceuticals. In particular, as the aging population grows in developed and undeveloped countries, Dyadic believes the C1 technology may help bring biologic drugs to market faster, in greater volumes, at lower cost, and with new properties to drug developers and manufacturers and, hopefully, improve access and cost to patients and the healthcare system, but most importantly save lives.\nPlease visit Dyadic’s website at www.dyadic.com for additional information, including details regarding Dyadic’s plans for its biopharmaceutical business.\nDyadic trades on the OTCQX tier of the OTC marketplace. Investors can find real-time Quote: s, market information and financial reports for Dyadic in the Company’s annual and quarterly reports which are filed with the OTC markets. Please visit the OTC markets website at www.otcmarkets.com/stock/DYAI/Quote: .\nSafe Harbor Regarding Forward-Looking Statements\nCertain statements contained in this press release are forward-looking statements within the meaning of the federal securities laws. These forward-looking statements involve risks, uncertainties and other factors that could cause Dyadic’s actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Investors are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. Any forward-looking statements speak only as of the date of this press release and, except as required by law, Dyadic expressly disclaims any intent or obligation to update or revise any forward-looking statements to reflect actual results, any changes in expectations or any change in events. Factors that could cause results to differ materially include, but are not limited to: (1) general economic, political and market conditions; (2) our ability to carry out and implement our biopharmaceutical research and business plans and strategic initiatives; (3) Dyadic’s ability to retain and attract employees, consultants, directors and advisors; (4) our ability t", "external_links": ["https://www.globenewswire.com/Tracker?data=80aHGIFgRCoQA354K7fKsUTWhsyMjss9T9SKwByezzQ0hyZt3owySHIJRKogHtckpN7mccWDLZWce-7k0z7bZmOP7Q04-UoG7o-IneRRbvYQJuTw5uXVbLoaEO3tWZ3vHgRXwMu1T4faP1YI0OReWA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/7c9352a9-ab47-4933-a7d6-21f0c82a13eb", "https://www.globenewswire.com/Tracker?data=vc7Ea0bWUZXA4Y2TxqLBI_BO2BbyHSwHcxQxYHcXG-27fBUAyc06zkrTvHyqmf3me0iMrIMl0LjcYI5sWBKguQ==", "https://www.globenewswire.com/Tracker?data=lCl1lLdJRokeCEaoIYYXNUD0eriRHrM_G0zjKoSmkdcoeI66Ge2zqIFmSdVYsClNkDet_mKdfEnxa17o5yeVYA_NP-q1WpyWjavXn7Oav9s="], "published": "2018-01-03T20:08:00.000+02:00", "crawled": "2018-01-03T22:59:44.038+02:00", "highlightTitle": ""}