{"organizations": [], "uuid": "920ec0a86dfabf7eeadd84563b7dfab06b226cb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/11/104702697-suzy_welch.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/suzy-welch-4-ways-to-make-a-great-first-impression.html", "country": "US", "domain_rank": 767, "title": "Suzy Welch: 4 ways to make a great first impression", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.176, "site_type": "news", "published": "2018-01-02T16:01:00.000+02:00", "replies_count": 0, "uuid": "920ec0a86dfabf7eeadd84563b7dfab06b226cb1"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/02/suzy-welch-4-ways-to-make-a-great-first-impression.html", "ord_in_thread": 0, "title": "Suzy Welch: 4 ways to make a great first impression", "locations": [], "entities": {"persons": [{"name": "suzy welch", "sentiment": "positive"}, {"name": "welch", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nFirst impressions set the tone for every subsequent experience you have with a boss, colleague or acquaintance. \nYes, you want to make eye contact, give a firm handshake and smile, but according to best-selling management author and CNBC contributor Suzy Welch, those are just the bare essentials for impressing someone. \nIf you really want to make a lasting impression, Welch suggests using these four techniques: CNBC Make It Bestselling management author and CNBC contributor Suzy Welch. 1. Eliminate the element of surprise \nYou'll want to find out everything you can about this person before you actually meet, Welch tells CNBC Make It . \nIn addition to researching the school they attended and past companies they've worked for, you also want to get a sense of their personality. This may mean talking to a mutual contact to get a better idea of who they are. \n\"You want to know ahead of time if they come off as awkward, stiff, aloof, carefree or gruff,\" she says, \"so that nothing about that first encounter throws you off and you can focus on selling yourself.\" 2. Don't wing your opening line \nAn off-the-cuff introduction might be fine at a party, but Welch says you should take a different approach when sparking a conversation in a professional setting. \nShe suggest using the information you researched to say something along the lines of, \"Hey, I've read you're an Ole Miss alum. So is my sister. It's a great school.\" \nOr if you're introduced to someone completely new and you're maybe sitting next to them at an event, she says, you can start a conversation with the opening line, \"So where do you call home?\" \nBoth of these introductions are welcoming and warm and can lead to a pleasant discussion. show chapters 8:54 AM ET Tue, 17 Oct 2017 | 01:35 3. Share an affirmation \nThis technique is one Welch says she picked up from her husband, former GE CEO Jack Welch. She says her husband usually starts off his first encounter with someone by praising an accomplishment. \nFor example, if a person works for a company that's recently had a big achievement, he might say, \"Congrats on your company's success — I can't wait to hear how you've done it.\" \nOr if the person he's meeting is highly regarded by others, he'll say, \"I've been looking forward to meeting you. If everyone's telling the truth, you're one heck of a leader.\" \nHowever, if you're going to use this approach, there is one caveat — it has to be real. \n\"Most people can smell a fake,\" she says. \"And that's definitely the wrong first impression.\" 4. Be totally present \nOnce you meet, you'll want to forget all outside distractions and be completely present in the conversation you're having. \n\"Once you're engaging, focus. Be there,\" she says. \"It's just the two of you meeting. Don't rush the moment.\" \nAfter all, Welch says, that moment is the only one you'll have \"to make a first impression that lasts in all the right ways.\" \nSuzy Welch is the co-founder of the Jack Welch Management Institute and a noted business journalist, TV commentator and public speaker. ", "external_links": [], "published": "2018-01-02T16:01:00.000+02:00", "crawled": "2018-01-02T16:17:36.026+02:00", "highlightTitle": ""}