{"organizations": [], "uuid": "11ef4f79eac5238617c3c7cd7b357284f9108cec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/will-govenment-shutdown-what-happens.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/government-shutdown-healthcare/", "country": "US", "domain_rank": 1196, "title": "How the Government Shutdown Would Affect Healthcare | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.975, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "11ef4f79eac5238617c3c7cd7b357284f9108cec"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/19/government-shutdown-healthcare/", "ord_in_thread": 0, "title": "How the Government Shutdown Would Affect Healthcare | Fortune", "locations": [], "entities": {"persons": [{"name": "andrew harrer", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "neutral"}, {"name": "brainstorm health daily", "sentiment": "none"}, {"name": "hhs", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "cdc", "sentiment": "none"}, {"name": "department of health and human services", "sentiment": "none"}, {"name": "national institutes of health", "sentiment": "none"}, {"name": "centers for disease control", "sentiment": "none"}, {"name": "nih", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's What Would Happen to U.S. Health Care if the Government Shuts Down Andrew Harrer—Bloomberg via Getty Images By Sy Mukherjee January 19, 2018 \nThe federal government will shut down at midnight Friday unless Congressional leaders and President Donald Trump reach a deal to keep it open. But, barring a last-minute arrangement, a government shutdown could have wide-ranging effects on essential services—including in health care. \nLawmakers and the Trump administration are still in talks trying to avert a shutdown ; it’s unclear whether or not those will pan out, and federal workers are reportedly in the dark about exactly what they’re supposed to do if no deal is struck. But the Department of Health and Human Services (HHS) has a detailed breakdown of the contingency plans the agency has for such a scenario, including the effects on major agencies like the Centers for Disease Control (CDC), the Food and Drug Administration (FDA), and the National Institutes of Health (NIH). \nSubscribe to Brainstorm Health Daily , our newsletter about the most exciting health innovations. \nThe biggest effect of a government shutdown on health care would be a mass of furloughs. “50% of HHS employees would be on furlough, and 50% would be retained,” writes HHS. The groups that would be most affected by a shutdown are the ones that have the most employees and rely the most on grants, including the Administration for Children and Families (ACF), the Substance Abuse and Mental Health Services Administration (SAMHSA), the Administration for Community Living (ACL), and the Agency for Healthcare Research and Quality (AHRQ). \nThese organizations provide a variety of community health services, including for objectives like suicide prevention at SAMHSA. They would have to rely on a skeleton staff and redirect resources to the most pressing objectives in the case of a shutdown, such as funneling patients to other public health resources. \nOutfits like the CDC, FDA, and NIH would also be affected. For instance, the CDC would “continue minimal support to protect the health and well-being of US citizens here and abroad through a significantly reduced capacity to respond to outbreak investigations, processing of laboratory samples, and maintaining the agency’s 24/7 emergency operations center.” A shutdown could be particularly troubling for the CDC given this year’s deadly flu season ; the last time the government shut down, in 2013, the CDC had trouble collecting critical data about the flu because of furloughs. \nYou can read the full breakdown of what the government shutdown would mean for HHS on its website. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T23:13:28.009+02:00", "highlightTitle": ""}