{"organizations": [], "uuid": "76c850a1976ef191f6c4ad6aff88b7327ca9e3de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222578460&w=1200&r=LYNXMPEE0G00A", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/uk-britain-eu-lawmaking/back-brexit-law-or-risk-chaos-mays-conservatives-tell-lawmakers-idINKBN1F600N", "country": "US", "domain_rank": 408, "title": "Back Brexit law or risk chaos, PM May's Conservatives tell lawmakers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:19:00.000+02:00", "replies_count": 0, "uuid": "76c850a1976ef191f6c4ad6aff88b7327ca9e3de"}, "author": "", "url": "https://in.reuters.com/article/uk-britain-eu-lawmaking/back-brexit-law-or-risk-chaos-mays-conservatives-tell-lawmakers-idINKBN1F600N", "ord_in_thread": 0, "title": "Back Brexit law or risk chaos, PM May's Conservatives tell lawmakers", "locations": [], "entities": {"persons": [{"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "paul scully", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cheam member of parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:15 AM / Updated an hour ago Back Brexit law or risk chaos, May's Conservatives tell MPs William James 3 Min Read \nLONDON (Reuters) - Prime Minister Theresa May’s Conservative Party urged MPs to back the government’s Brexit legislation at a vote in parliament later on Wednesday, warning opponents that trying to block the plan would bring chaos. Britain's Prime Minister, Theresa May, joins Sutton and Cheam Member of Parliament (MP), Paul Scully, as he campaigns for the forthcoming London local elections, in south west London, Britain January 13, 2018. REUTERS/Leon Neal/Pool \nThe European Union (Withdrawal) Bill is set to complete its first journey through parliament’s lower house some time after 1900 GMT, a milestone on the long road towards cementing the legal foundations of Brexit. \nThe bill repeals the 1972 law which made Britain a member of the EU and transfers EU laws into British ones. It has become a focal point for the divisive debate about what type of EU divorce Britain should seek, severely testing May’s ability to deliver on her exit strategy without a parliamentary majority. \nNevertheless, despite one embarrassing defeat, several government concessions and criticism from within her own party, May is expected to win a vote that will see the bill passed to parliament’s largely pro-EU upper chamber for more scrutiny. \nSpeaking ahead of the vote, Conservative Party Chairman Brandon Lewis called on the opposition Labour Party, which has opposed May’s strategy at almost every turn, to back the bill and show it is not trying to overturn the 2016 EU referendum. \n“Labour say over and again that they support the referendum result, and can be trusted to act responsibly, but today that will be put to the test. They can either back this bill or vote for chaos,” Lewis said. \nLabour leader Jeremy Corbyn has said he will instruct his party to vote against the bill if concerns about democratic accountability, protection of workers, the environment and consumer rights are not addressed. \nEven if Labour vote against, May should be able to win a vote thanks to an arrangement with a small, pro-Brexit Northern Irish Party. A number of Labour MPs could also defy Corbyn to help the bill through. \nThe upper house of parliament, the House of Lords, will take months to scrutinise the bill before it can become law. While many there are expected to try to soften the Brexit approach, the most likely area for changes to the bill involves rather technical, constitutional issues. \nThis month both pro- and anti-EU politicians have raised the question of whether to hold a second referendum to give voters the chance to approve whatever withdrawal treaty is agreed with Brussels before Britain leaves the bloc. \nLeaders of EU institutions weighed into this debate by saying on Tuesday that Britons were still welcome to stay in the EU if they had a change of heart. \nIn response, May’s spokesman repeated her determination to follow through on Brexit, even though she campaigned against it in 2016. Reporting by William James; editing by Mark Heinrich", "external_links": [], "published": "2018-01-17T02:19:00.000+02:00", "crawled": "2018-01-17T03:01:42.023+02:00", "highlightTitle": ""}