{"organizations": [], "uuid": "9e8f02135cea29ce8124addca381a87ec42478bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104846369-GettyImages-109352938.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/30/bonds-and-fixed-income-data-auctions-bonds-on-the-agenda-for-investors.html", "country": "US", "domain_rank": 767, "title": "US Treasury yields under pressure ahead of fresh economic data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:17:00.000+02:00", "replies_count": 0, "uuid": "9e8f02135cea29ce8124addca381a87ec42478bf"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/30/bonds-and-fixed-income-data-auctions-bonds-on-the-agenda-for-investors.html", "ord_in_thread": 0, "title": "US Treasury yields under pressure ahead of fresh economic data", "locations": [], "entities": {"persons": [{"name": "jerome powell", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "us treasury", "sentiment": "negative"}, {"name": "federal open market committee", "sentiment": "none"}, {"name": "fed chair", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "US 30-YR --- \nWith investors hoping for a bump in economic growth and corporate profits as a result of Republican tax cuts, inflation fears may be keeping yields afloat. Steady price increases undermine the real value of bonds, whose fixed payments diminish in value as the cost of living rising. \nOther investors have worried that the GOP tax plan will renew concerns over the safety of U.S. debt as the Treasury Department looks to issue more bonds to finance government spending. \nAlso giving yields a boost, consumer confidence jumped in January to 125.4, higher than the 123.1 expected by economists polled by Reuters. The key index rose to 129.5 in November, the highest mark since the index hit 132.6 in November 2000. \n\"Expectations improved, though consumers were somewhat ambivalent about their income prospects over the coming months, perhaps the result of some uncertainty regarding the impact of the tax plan,\" Lynn Franco, director of economic indicators at The Conference Board, said in a statement. \nIn the previous session, the yield on the benchmark 10-year Treasury note rose to its highest since April 2014 , as investors grew hopeful on the state of the U.S. economy — with a weaker U.S. dollar having also helped boost yields as of late. \nAnother factor expected to keep the bond markets on edge is the latest meeting by the U.S. central bank. \nThe Federal Open Market Committee started the first day of its two-day meeting. While no news conference is set to follow the two-day meeting, it will mark the last meeting chaired by Janet Yellen before Jerome Powell takes over as Fed Chair. \nThe central bank is widely expected to hold fire on changing its monetary policy this time around . \nThey will \"probably put their stamp of approval on the economy,\" said Thanos Bardas, head of global interest rates at Nueberger Berman, noting the economy has improved considerably since the Fed's last January meeting. \nPresident Donald Trump is expected to deliver his State of the Union address for 2018 to a joint session of Congress on Tuesday. \n—CNBC's Michael Sheetz and Gina Francolla contributed to this report. ", "external_links": [], "published": "2018-01-30T13:17:00.000+02:00", "crawled": "2018-01-30T12:55:07.021+02:00", "highlightTitle": ""}