{"organizations": [], "uuid": "006426963f0a7dd8cde914b67d0eb1e7d22311c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-neurocrine-biosciences-announces-retirement-of-christopher-obrien-m-d-and-appointment-of-eiry-w-roberts-m-d-as-chief-medical.html", "country": "US", "domain_rank": 767, "title": "Neurocrine Biosciences Announces Retirement of Christopher O'Brien, M.D., and Appointment of Eiry W. Roberts, M.D., as Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T21:01:00.000+02:00", "replies_count": 0, "uuid": "006426963f0a7dd8cde914b67d0eb1e7d22311c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/07/pr-newswire-neurocrine-biosciences-announces-retirement-of-christopher-obrien-m-d-and-appointment-of-eiry-w-roberts-m-d-as-chief-medical.html", "ord_in_thread": 0, "title": "Neurocrine Biosciences Announces Retirement of Christopher O'Brien, M.D., and Appointment of Eiry W. Roberts, M.D., as Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "eiry w. roberts", "sentiment": "neutral"}, {"name": "christopher o'brien", "sentiment": "neutral"}, {"name": "chris", "sentiment": "none"}, {"name": "o'brien", "sentiment": "none"}, {"name": "kevin gorman", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "neurocrine biosciences", "sentiment": "neutral"}, {"name": "neurocrine biosciences, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "neurocrine", "sentiment": "none"}, {"name": "ingrezza", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 7, 2018 /PRNewswire/ -- Neurocrine Biosciences, Inc. (NASDAQ: NBIX), a biotechnology company focused on neurological and endocrine related disorders, today announced that Christopher O'Brien, M.D., Chief Medical Officer, has notified the Company he plans to retire in February 2018, after a transition period with his successor. Dr. O'Brien joined Neurocrine in 2005, and has led the clinical development and medical affairs activities for more than 12 years. Dr. O'Brien will remain as an exclusive consultant for Neurocrine.\n\"On behalf of the board, shareholders and our employees, I want to thank Chris for his tremendous contributions as Chief Medical Officer of Neurocrine,\" said Kevin Gorman, Ph.D., Chief Executive Officer of Neurocrine Biosciences. \"With his considerable expertise and leadership, we successfully developed and obtained FDA approval of INGREZZA capsules for the treatment of adults with tardive dyskinesia and advanced our clinical development programs for Tourette syndrome, Parkinson's disease, endometriosis and congenital adrenal hyperplasia. I am very pleased that Chris will continue to be a part of the Neurocrine team for the foreseeable future.\"\nEiry W. Roberts, M.D., will join the company as Chief Medical Officer, effective January 8, 2018.\n\"We are very pleased to welcome Eiry to Neurocrine as she brings extensive senior leadership and pharmaceutical management experience to the team,\" Dr. Gorman said. \"Eiry's strong background in implementing strategic clinical development programs and navigating the regulatory approvals process across phases of drug development from research to commercialization in multiple therapeutic areas, including neuroscience, will be valuable as we execute on our commercialization and clinical plans and advance our pipeline in support of our commitment to relieve patient suffering and enhance lives.\"\nDr. Roberts has over 25 years of research and development experience in the pharmaceutical industry across all phases of drug development from research through commercialization in multiple therapeutic areas, including neuroscience, inflammation, oncology and metabolic diseases. She joins Neurocrine from Eli Lilly and Company where she held various positions during her tenure, including Vice President, Clinical Pharmacology and Vice President of R&D, BioMedicines Business Unit.\nDr. Roberts was the Chair of the Medical Review Committee, where she was responsible for review and approval of all the integrated clinical plans for molecules in the Lilly portfolio. She was also a member of Lilly's Corporate Portfolio Management Committee and Lilly Ventures Steering Committee. Dr. Roberts was accountable for early clinical development programs across all therapeutic areas within Lilly, as well as registration for new chemical entities and biproducts in Phase III development. During her time at Lilly, Dr. Roberts established a new therapeutic area, which resulted in the development of five potential novel medicines from Phase I through to approval, with two of them successfully receiving regulatory approval. Dr. Roberts also has extensive leadership and business development experience, including the management of strategic alliances, business partnerships and venture capital collaborations.\nDr. Roberts is a physician who trained in pharmacology and medicine in the UK, qualifying from the University of London in 1987. Her post-graduate clinical training was in clinical pharmacology and cardiology at St. Bartholomew's Hospital and the Royal London Hospital.\nNeurocrine also announced the grant of an inducement award to Dr. Roberts pursuant to Rule 5635(c)(4) of the NASDAQ Listing Rules. In connection with her employment by Neurocrine, Dr. Roberts will be granted an inducement award consisting of a stock option to purchase 70,000 shares of Neurocrine common stock. The stock option will vest over a period of four years, with 25% vesting on the first anniversary of its grant date and the balance vesting each month over the remaining three years. Dr. Roberts also received 20,000 restricted stock units which vest in equal increments over four years, with 25% vesting each year. These awards are subject to the terms and conditions of Neurocrine's Inducement Plan, and will be effective on January 8, 2018. The stock option grant will have an exercise price equal to the closing price of Neurocrine's common stock on the NASDAQ Global Select Market on that date. These awards were granted as an inducement material to Dr. Roberts' employment pursuant to Rule 5635(c)(4) of the NASDAQ Listing Rules.\nAbout Neurocrine Biosciences, Inc.\nNeurocrine Biosciences is a San Diego based biotechnology company focused on neurologic, psychiatric and endocrine related disorders. The Company markets INGREZZA ® (valbenazine) capsules in the United States for the treatment of adults with tardive dyskinesia. INGREZZA is a novel, selective vesicular monoamine transporter 2 (VMAT2) inhibitor, and is the first FDA approved product indicated for the treatment of adults with tardive dyskinesia. The Company's three late-stage clinical programs are: elagolix, a gonadotropin-releasing hormone antagonist for women's health that is partnered with AbbVie Inc.; opicapone, a novel, once-daily, peripherally-acting, highly-selective catechol-o-methyltransferase inhibitor under investigation as adjunct therapy to levodopa in Parkinson's patients; and INGREZZA, a novel, once-daily, selective VMAT2 inhibitor under investigation for the treatment of Tourette syndrome.\nNeurocrine Biosciences, Inc. news releases are available through the Company's website via the internet at http://www.neurocrine.com .\nForward-Looking Statements\nIn addition to historical facts, this press release contains forward-looking statements that involve a number of risks and uncertainties. These statements include, but are not limited to, statements related to our ability to execute on the Company's commercialization and clinical plans, and the Company's ability to advance its product candidate pipeline. Among the factors that could cause actual results to differ materially from those indicated in the forward-looking statements are: risks and uncertainties associated with Neurocrine's business and finances in general as well as risks and uncertainties associated with the commercialization of INGREZZA; risks and uncertainties relating to competitive products and technological changes that may limit demand for INGREZZA; risks associated with the Company's dependence on third parties for development and manufacturing activities related to INGREZZA and the ability of the Company to manage these third parties; risks that the FDA or other regulatory authorities may make adverse decisions regarding INGREZZA; risks that INGREZZA clinical trials may not be predictive of real-world results or of results in subsequent clinical trials; risks that INGREZZA may be alleged to infringe upon the proprietary rights of third parties, or have unintended side effects, adverse reactions or incidents of misuse; and other risks described in the Company's periodic reports filed with the Securities a", "external_links": ["http://www.prnewswire.com/news-releases/neurocrine-biosciences-announces-retirement-of-christopher-obrien-md-and-appointment-of-eiry-w-roberts-md-as-chief-medical-officer-300578677.html", "http://www.neurocrine.com/"], "published": "2018-01-07T21:01:00.000+02:00", "crawled": "2018-01-07T23:22:43.002+02:00", "highlightTitle": ""}