{"organizations": [], "uuid": "96612c154eb4f07c1b8458ecde564036eadd5763", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220762219&w=1200&r=LYNXMPEE090EB", "site_section": "http://feeds.reuters.com/reuters/INcricketNews\r", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-olympics/cricket-ex-players-ask-bcci-to-back-olympics-push-idINKBN1EZ0OX", "country": "US", "domain_rank": 408, "title": "Cricket-Ex-players ask BCCI to back Olympics push", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T10:04:00.000+02:00", "replies_count": 0, "uuid": "96612c154eb4f07c1b8458ecde564036eadd5763"}, "author": "", "url": "https://in.reuters.com/article/cricket-olympics/cricket-ex-players-ask-bcci-to-back-olympics-push-idINKBN1EZ0OX", "ord_in_thread": 0, "title": "Cricket-Ex-players ask BCCI to back Olympics push", "locations": [], "entities": {"persons": [{"name": "reuter", "sentiment": "neutral"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "bcci", "sentiment": "neutral"}, {"name": "board of control for cricket in india", "sentiment": "none"}, {"name": "ipl", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "indian premier league", "sentiment": "none"}, {"name": "international cricket council", "sentiment": "none"}, {"name": "icc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mcc committee", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}, {"name": "mcc world cricket", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 8:08 AM / Updated 10 hours ago Cricket: Ex-players ask BCCI to back Olympics push Reuters Staff 3 Min Read \n(Reuters) - The MCC World Cricket committee has asked the powerful Indian board to back the bid for the sport’s Olympics inclusion, saying it would greatly benefit the game. A policeman walks past a logo of the Board of Control for Cricket in India (BCCI) during a governing council meeting of the Indian Premier League (IPL) at BCCI headquarters in Mumbai April 26, 2010. REUTERS/Arko Datta/Files \nCricket was last played at the Olympics in the 1900 Paris Games and the governing International Cricket Council (ICC) has said most of its members backed the inclusion of the 20-overs format in Olympic Games. \nThe International Olympic Committee (IOC) is open to cricket’s future inclusion provided all top teams compete but the Board of Control for Cricket in India (BCCI), the game’s richest and most influential board, has been rather reluctant. \nAfter the MCC Committee meetings this week, the panel of former players requested the BCCI to reconsider its stance. \n“It’s one of those things that has frustrated me,” committee chairman Mike Gatting told a news conference. \n”We would like to urge the BCCI to have a look at it again and support the main body of boards that would like to get into the Olympics... \n“It seems strange that everyone else seems happy to get in there because it’s just going to be so good for the game,” said the former England captain. \n“Free-to-air TV all over the world. It’s only once every four years. It’s not going to be a scheduling matter. It just seems they seem reticent to try and get involved.” \nThe Indian board has not been keen on cricket’s Olympic inclusion partly because of apprehensions that BCCI might lose its autonomy and be answerable to the country’s Olympic committee. \nFormer Australia captain Ricky Ponting, who is part of the 14-person independent committee along with Sri Lankan Kumar Sangakkara, Indian Sourav Ganguly and Rod Marsh of Australia, said the sport must be represented by its best players at the Olympics. \n“We’re very conscious of not lessening the product we’re putting out,” Ponting said. \n”If cricket makes it into the Olympics it has to be the best players and showcasing the sport for what it is. \n“The players would want it because of how beneficial they would see that being for the game going forward.” \nThe independent committee also discussed the wage gap in the international game, making helmets compulsory and DRS technology among a variety of other topics. Reporting by Aditi Prakash in Bengaluru; editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-10T10:04:00.000+02:00", "crawled": "2018-01-10T10:38:27.001+02:00", "highlightTitle": ""}