{"organizations": [], "uuid": "f9adab254f1e396a3987eab297969229a162eab0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cro-industry-veteran-mike-wilkinson-joins-patient-ip-as-president-and-coo.html", "country": "US", "domain_rank": 767, "title": "CRO Industry Veteran Mike Wilkinson Joins Patient iP as President and COO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "f9adab254f1e396a3987eab297969229a162eab0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cro-industry-veteran-mike-wilkinson-joins-patient-ip-as-president-and-coo.html", "ord_in_thread": 0, "title": "CRO Industry Veteran Mike Wilkinson Joins Patient iP as President and COO", "locations": [], "entities": {"persons": [{"name": "mike wilkinson", "sentiment": "negative"}, {"name": "michael margiotta", "sentiment": "none"}, {"name": "wilkinson", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "coo rochester", "sentiment": "none"}], "organizations": [{"name": "quintiles", "sentiment": "none"}, {"name": "ppd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 11, 2018 /PRNewswire/ -- Patient iP, a health data and analytics company providing patient data insights to accelerate and transform clinical research, today announced that Mike Wilkinson has been named company President and Chief Operating Officer effective immediately. He will report directly to Chairman, Founder and Chief Executive Officer, Michael Margiotta.\nWilkinson joins Patient iP with more than nineteen years in the pharmaceutical industry, the last 15 of those in executive leadership positions. He spent the past ten years at PPD, a leading global contract research organization (CRO) providing comprehensive, integrated drug development, laboratory and lifecycle management services. At PPD Wilkinson first served as Executive Vice President (EVP) and Global Head of Clinical Development. Most recently he served as EVP and Chief Information Officer (CIO) where he led PPD's global technology, innovation and performance group. Prior to PPD, Wilkinson held numerous positions at Quintiles, another leading global CRO, with his last role being Global Head of Internal Medicine.\nPrior to his career in life sciences, Wilkinson spent 23 years in the U.S. Navy where he retired as a Commander. During his naval career, Wilkinson served in many positions, including Navy SEAL, Aerospace Physiologist, Physiology Systems Program Director, and White House Liaison Officer. Wilkinson holds a doctorate degree in physiological optics from Indiana University, a master's degree from Penn State University and a bachelor's degree from Ohio University.\n\"Our entire team is delighted to welcome Mike and his tremendous leadership capabilities to Patient iP at a time of great opportunity and market momentum,\" said Margiotta. \"His extensive experience in the CRO sector, both in global clinical operations and in developing technology and data initiatives, coupled with his incredible focus on results, will translate into clear executable strategies and solutions to disrupt the current yet outdated clinical research paradigm. With our award-winning analytics engine, robust and burgeoning data asset and now executive team expansion, 2018 is setting up to be a very successful year,\" added Margiotta.\nPatient iP's daTAscape asset is comprised of more than 14 million ambulatory electronic medical records (EMR) to power the delivery of industry solutions in protocol optimization and geo-targeted site selection and subsequent patient recruitment. With a focus on longitudinally documented medical history, Patient iP is uniquely positioned to help nurture and deepen an already \"trusted relationship\" between patients and their outpatient clinicians. This approach is grounded in the company's desire to help clinical research sponsors gain access to the estimated 90 percent of patients that are essentially overlooked in most clinical trial recruitment strategies.\n\"I am thrilled to join Patient iP at such a pivotal time in the company and in the pharmaceutical industry,\" said Wilkinson. \"Patient iP is incredibly well placed to solve challenges and realize the potential of leveraging patient EMR data to create better, faster and less expensive clinical research. I am looking forward to fully engaging with the Patient iP team to develop and deliver data-driven solutions for patients, investigators and the pharmaceutical industry.\"\nAbout Patient iP\nThe patented Patient iP data analytics platform provides unique value for the clinical research industry. Using a cloud-based infrastructure, the company leverages aggregated patient data to streamline and accelerate clinical trial design, site selection and participant matching to bring new therapies to market faster and more cost effectively. Deployed in concert, Patient iP's award-winning technology and expansive daTAscape™ enhance recruitment efforts, increase performance predictability, and maximize research yield given a focus on the untapped community-based patient market. For more information, visit us at www.patientip.com or follow us on Twitter @PatientIP.\nCONTACT: Jennifer Crowley, jen.crowley@patientip.com\nView original content: http://www.prnewswire.com/news-releases/cro-industry-veteran-mike-wilkinson-joins-patient-ip-as-president-and-coo-300580943.html\nSOURCE Patient iP", "external_links": ["http://www.patientip.com/", "http://www.prnewswire.com/news-releases/cro-industry-veteran-mike-wilkinson-joins-patient-ip-as-president-and-coo-300580943.html"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:02:55.009+02:00", "highlightTitle": ""}