{"organizations": [], "uuid": "b8a0209cb6cc309b81f76f1b3e3192ac5c05fc5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-hexcel-reports-2017-fourth-quarter-and-full-year-results.html", "country": "US", "domain_rank": 767, "title": "Hexcel Reports 2017 Fourth Quarter and Full", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-25T00:30:00.000+02:00", "replies_count": 0, "uuid": "b8a0209cb6cc309b81f76f1b3e3192ac5c05fc5e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-hexcel-reports-2017-fourth-quarter-and-full-year-results.html", "ord_in_thread": 0, "title": "Hexcel Reports 2017 Fourth Quarter and Full", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "hexcel", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Q4 2017 GAAP diluted EPS was $0.96, including a $0.24 benefit from new tax law adjustments. Q4 2017 adjusted diluted EPS was $0.70, an increase of 9% above Q4 2016. Q4 2017 Sales were a record $512 million, an increase of 6% over fourth quarter 2016 (+4% in constant currency). FY 2017 Sales were $1,973 million, a decrease of 2% compared to FY 2016 (-2% in constant currency). FY 2017 GAAP diluted EPS was $3.09. FY 2017 adjusted diluted EPS was $2.68, an increase of 4% above FY 2016. FY 2017 free cash flow was a record $151 million. Reaffirming FY 2018 sales, free cash flow and capital expenditure guidance; updating adjusted diluted EPS expectations to reflect newly passed tax law.\nSee Table C for reconciliation of GAAP and non-GAAP net income and earnings per share. Free cash flow is operating cash flow less cash paid for capital expenditures.\nSummary of Results from Operations Quarters Ended Years Ended December 31, December 31, (In millions, except per share data) 2017 2016 % Change 2017 2016 % Change Net Sales $ 511.7 $ 483.5 5.8 % $ 1,973.3 $ 2,004.3 (1.5 )% Net sales change in constant currency 4.1 % (1.6 )% Operating Income 93.2 87.0 7.1 % 350.6 360.1 (2.6 )% Net Income 88.1 59.5 48.1 % 284.0 249.8 13.7 % Diluted net income per common share $ 0.96 $ 0.64 50.0 % $ 3.09 $ 2.65 16.6 % Non-GAAP Measures for y-o-y comparisons: Adjusted Operating Income $ 93.2 $ 87.0 7.1 % $ 350.6 $ 360.1 (2.6 )% As a % of sales 18.2 % 18.0 % 17.8 % 18.0 % Adjusted Net Income (Table C) 63.7 59.5 7.1 % 246.3 243.5 1.1 % Adjusted diluted net income per share $ 0.70 $ 0.64 9.4 % $ 2.68 $ 2.58 3.9 % STAMFORD, Conn., Hexcel Corporation (NYSE:HXL) today reported fourth quarter and full year 2017 results.\nChairman, CEO and President Nick Stanage said, “2017 was a strong year for Hexcel. Our adjusted EPS was in line with expectations and higher than in 2016, with full year sales below our earlier guidance range. Our results reflect disciplined execution to drive operational excellence, new product developments and new process innovations, all of which strengthen our leadership position in the markets we serve. We exceeded our expectations on free cash flow by generating $151 million, which is about 50% above our targeted levels and reflects the beginning of the transition in our business from a period of cash investment to one of cash generation.” Mr. Stanage said, “As we enter 2018, we remain focused on driving increased shareholder value by executing our strategic priorities to partner with our customers on next-generation solutions to position the company for sustained long-term growth and robust cash flow generation.”\nFourth Quarter Results\nSales for the fourth quarter of 2017 were a record $511.7 million, an increase of 5.8% (4.1% in constant currency) over the fourth quarter of 2016, with adjusted diluted EPS for the fourth quarter of 2017 increasing 9.4% year-over-year to $0.70.\nCommercial Aerospace\nCommercial Aerospace sales of $361.1 million increased 3.2% (2.2% in constant currency) for the fourth quarter of 2017 as compared to the prior year period. Sales growth of narrowbody aircraft more than offset reductions in some widebody aircraft sales. Sales to “Other Commercial Aerospace,” (accounts for about 11% of our Commercial Aerospace sales), which includes regional and business aircraft customers, were up about 6.5% for the fourth quarter of 2017 as compared to 2016.\nSpace & Defense\nSpace & Defense sales of $96.4 million increased 21.9% (19.6% in constant currency) for the quarter as compared to the soft fourth quarter of 2016. Rotorcraft sales, which comprise around half of Space & Defense sales, contributed significantly to the improvement.\nIndustrial\nTotal Industrial sales of $54.2 million for the fourth quarter of 2017 decreased 0.6% (6.2% lower in constant currency) as compared to the fourth quarter of 2016. Wind energy sales (the largest submarket in Industrial) experienced a challenging transition year in 2017, and were down more than 20% in the fourth quarter of 2017 as compared to the prior year period.\nConsolidated Operations\nGross margin for the fourth quarter of 2017 was 27.8% compared to 28.0% in the fourth quarter of 2016, reflecting strong underlying performance while being impacted by start up costs related to our new manufacturing operations in France. Selling, general and administrative expenses for the fourth quarter were slightly lower than the prior year period, as the Company continued to focus on controlling cost and driving productivity. Operating income in the fourth quarter of 2017 was $93.2 million, or 18.2% of sales, compared to $87.0 million, or 18.0% of sales, in 2016. Exchange rates unfavorably impacted the fourth quarter of 2017 by about 10 basis points compared to 2016.\nFull Year 2017 Results\nFull year 2017 sales were $1,973.3 million, a decline of 1.5% (-1.6% in constant currency) as compared to 2016. However, adjusted diluted EPS increased 3.9% to $2.68.\nCommercial Aerospace (72% of 2017 sales)\nCommercial Aerospace sales of $1,409.8 million declined 1.4% (-1.5% in constant currency) as compared to 2016. Sales to “Other Commercial Aerospace” were down approximately 4.2% in 2017, driven by business jet sales.\nSpace & Defense (17% of 2017 sales)\nSpace & Defense sales of $343.7 million increased 6.8% (6.9% in constant currency) as compared to 2016. The increase was driven largely by strong sales for the F-35 Joint Strike Fighter, V-22 Osprey and Black Hawk helicopter programs.\nIndustrial (11% of 2017 sales)\nTotal Industrial sales of $219.8 million decreased 13.2% (-13.3% in constant currency) as compared to 2016. Wind energy sales, the largest submarket, were down just over 30% in 2017 as compared to the prior year.\nConsolidated Operations\nGross margin for 2017 was 28.0% compared to 28.2% for 2016, reflecting strong operating performance across the company while offsetting about $10 million in costs related to the startup and training for the greenfield sites in France (ongoing) and Morocco (completed in Q3). Selling, general and administrative expenses declined 3.7% in 2017 (3% lower in constant currency) compared to the prior year as we maintained tight control over discretionary spending. Research and technology expenses increased 5.5% in 2017 (6% in constant currency) as we continued to invest in innovative new composite products and solutions to support customers and next-generation programs. Adjusted operating income of $350.6 million in 2017 declined 2.6% as compared to 2016. Adjusted operating income margin was 17.8% of sales in 2017 compared to 18.0% in 2016. The 2017 margin was favorably impacted from exchange rates by about 40 basis points as compared to 2016. For 2017, depreciation and amortization expense increased by about $11 million over 2016 in constant currency.\nCash and Other\nThe effective tax rate for the fourth quarter of 2017 was minus 2.0% compared to 27.9% in the fourth quarter of 2016, and the effective tax rate for full year 2017 was 13.2% compared to 26.8% in 2016.\nThe fourth quarter was significantly impacted by adjustments made in relation to the recently enacted Tax Cuts and Jobs Act. These adjustments resulted in a net benefit to the fourth quarter tax provision of $22.1 million (a positive impact of $0.24 on our GAAP EPS). The impact was primarily comprised of a revaluation benefit of our deferred tax liabilities worth approximately $70 million, offset by a charge for the repatriation transition tax of approximately $50 million, plus some other adjustments. We believe that most of the impact of the new tax law for Hexcel has been taken in the fourth quarter of 2017, but there could be true-ups and further adjustments in the coming quarters as the relevant authorities continue to provide guidance to help taxpayers understand the impact of the new tax law.\nThe fourth quarter also included other tax benefits, including deductions associated with share-based compensation payments as well as a non-recurring discrete benefit of $2.3 million ($0.02 per diluted share) from the reversal of provisions for uncertain tax positions. The first nine months of 2017 included an additional $13.3 million of non-recurring discrete benefits. Excluding these non-recurring discrete items and the impact of the new tax law, the effective tax rate for 2017 included in our adjusted net income was 24.8%.\nBased on our initial reviews we estimate the effective tax rate (ETR) for 2018 will be about 25%. Our EPS guidance issued in December was based on an ETR of 29%. Our revised 2018 EPS guidance based on a 25% ETR is provided below. Free cash flow generated in 2017 was $150.6 million, more than doubling the free cash flow of $73.5 million generated in 2016. Working capital was a source of $20.3 million in 2017 as compared to a $18.6 million use in 2016. The primary driver of the working capital improvement was lower receivables through strong cash collections. Capital expenditures (accrual basis) were $284.4 million in 2017 compared to $320.2 million in 2016. Free cash flow is defined as cash provided from operating activities less cash paid for capital expenditures. In 2017, the Company used $150.3 million to repurchase shares of its common stock and has $242.5 million remaining under the authorized share repurchase program. As announced today, the Board of Directors declared a quarterly dividend of $0.125 per share payable to stockholders of record as of February 6, 2018, with a payment date of February 13, 2018.\n2018 Guidance\nSales of $2.10 billion to $2.20 billion (unchanged) Adjusted diluted earnings per share of $2.96 to $3.10 – based on an effective tax rate (ETR) of 25%. (Previously $2.80 - $2.94 based on an ETR of 29%.) Free cash flow greater than $230 million (unchanged) Accrual basis capital expenditures of $170 million to $190 million (unchanged)\nHexcel will host a conference call at 10:00 A.M. ET, on January 25, 2018 to discuss the fourth quarter and FY2017 results and respond to analyst questions. The event will be webcast via the investor relations webpage at www.Hexcel.com . The event can also be accessed by dialing (409) 350-3491 and the conference ID is 9299630. Replays of the call will be available on the website.\nHexcel Corporation is a leading advanced composites company. It develops, manufactures and markets lightweight, high-performance structural materials, including carbon fibers, specialty reinforcements, prepregs and other fiber-reinforced matrix materials, honeycomb, adhesives, engineered core and composite structures, used in commercial aerospace, space and defense and industrial applications. Learn more at www.Hexcel.com .\nDisclaimer on Forward Looking Statements\nThis news release contains statements that are forward looking, including statements relating to anticipated trends in constant currency for the markets we serve (including changes in commercial aerospace revenues, the estimates and expectations based on aircraft production rates provided or publicly available by Airbus, Boeing and others, the revenues we may generate from an aircraft model or program, the impact of delays in the startup or ramp-ups of new aircraft programs, the outlook for space & defense revenues and the trend in wind energy and other industrial applications, including whether certain programs might be curtailed or discontinued or customers’ inventory levels reduced); our ability to maintain and improve margins in light of the economic environment; the success of particular applications as well as the general overall economy; our ability to manage cash from operating activities and capital spending in relation to future sales levels such that the Company funds its capital spending plans from cash flows from operating activities, but, if necessary, maintains adequate availability under its credit facilities to cover any shortfalls; and the impact of the above factors on our expectations of all financial results for 2018 and beyond. The loss of, or significant reduction in purchases by Airbus, Boeing, Vestas, or any of our other significant customers could materially impair our business, operating results, prospects and financial condition. Actual results may the results anticipated in the forward looking statements due to a variety of factors, including but not limited to changes in currency exchange rates, changing market conditions, increased competition, inability to install, staff and qualify necessary capacity or achievement of planned manufacturing improvements, conditions in the financial markets, product mix, achieving expected pricing and manufacturing costs, availability and cost of raw materials, supply chain disruptions, work stoppages or other labor disruptions, uncertainty regarding the exit of the U.K. from the European Union, unforeseen vulnerability of our network and systems to interruptions or failures and changes in or unexpected issues related to environmental regulations, legal matters, interest rates and tax codes. Additional risk factors are described in our filings with the SEC. We do not undertake an obligation to update our forward-looking statements to reflect future events.\nContact Information Kurt Goddard,\nVice President – Investor Relations (203) 352-6826 Kurt.Goddard@Hexcel.com\nHexcel Corporation and Subsidiaries Consolidated Statements of Operations Unaudited Quarter Ended Year Ended December 31, December 31, (In millions, except per share data) 2017 2016 2017 2016 Net sales $ 511.7 $ 483.5 $ 1,973.3 $ 2,004.3 Cost of sales 369.5 347.9 1,421.5 1,439.7 Gross margin 142.2 135.6 551.8 564.6 % Gross Margin 27.8 % 28.0 % 28.0 % 28.2 % Selling, general and administrative expenses 36.1 36.5 151.8 157.6 Research and technology expenses 12.9 12.1 49.4 46.9 Operating income 93.2 87.0 350.6 360.1 Interest expense, net 7.4 5.3 27.4 22.1 Non-operating expense (a) - - - 0.4 Income before income taxes, and equity in earnings of affiliated companies 85.8 81.7 323.2 337.6 (Benefit) provision for income taxes (1.8 ) 22.8 42.5 90.3 Income before equity in earnings of affiliated companies 87.6 58.9 280.7 247.3 Equity in earnings from affiliated companies 0.5 0.6 3.3 2.5 Net income $ 88.1 $ 59.5 $ 284.0 $ 249.8 Basic net income per common share: $ 0.97 $ 0.65 $ 3.13 $ 2.69 Diluted net income per common share: $ 0.96 $ 0.64 $ 3.09 $ 2.65 Weighted-average common shares: Basic 90.0 91.8 90.6 92.8 Diluted 91.5 93.3 91.9 94.2 (a) Non-operating expense is the accelerated amortization of deferred financing costs related to refinancing our credit facility in June 2016.\nHexcel Corporation and Subsidiaries Consolidated Balance Sheets Unaudited December 31, December 31, (In millions) 2017 2016 Assets Cash and cash equivalents $ 60.1 $ 35.2 Accounts receivable, net 248.7 245.6 Inventories, net 314.0 291.0 Prepaid expenses and other current assets 33.9 35.2 Total current assets 656.7 607.0 Property, plant and equipment 2,743.9 2,378.4 Less accumulated depreciation (877.6 ) (752.8 ) Net Property, plant and equipment 1,866.3 1,625.6 Goodwill and other intangible assets, net 148.7 72.2 Investments in affiliated companies 47.7 53.1 Other assets 61.5 42.7 Total assets $ 2,780.9 $ 2,400.6 Liabilities and Stockholders' Equity Liabilities: Current portion of capital lease and term loan $ 4.3 $ 4.3 Accounts payable 144.1 137.3 Accrued liabilities 113.7 130.3 Total current liabilities 262.1 271.9 Long-term debt 805.6 684.4 Other non-current liabilities 218.1 199.4 Total liabilities $ 1,285.8 $ 1,155.7 Stockholders' equity: Common stock, $0.01 par value, 200.0 shares authorized, 107.8 shares issued at December 31, 2017 and 106.7 shares issued at December 31, 2016 $ 1.1 $ 1.1 Additional paid-in capital 774.3 738.8 Retained earnings 1,496.1 1,254.7 Accumulated other comprehensive loss (45.0 ) (174.4 ) 2,226.5 1,820.2 Less – Treasury stock, at cost, 18.2 and 15.3 shares at December 31, 2017 and December 31, 2016, respectively (731.4 ) (575.3 ) Total stockholders' equity 1,495.1 1,244.9 Total liabilities and stockholders' equity $ 2,780.9 $ 2,400.6\nHexcel Corporation and Subsidiaries Consolidated Statements of Cash Flows Unaudited Year to Date Ended December 31, (In millions) 2017 2016 Cash flows from operating activities Net income $ 284.0 $ 249.8 Reconciliation to net cash provided by operating activities: Depreciation and amortization 104.5 93.3 Amortization related to financing 0.7 1.7 Deferred income taxes 3.8 62.8 Equity in earnings from affiliated companies (3.3 ) (2.5 ) Share-based compensation expense 17.6 16.1 Changes in assets and liabilities: Decrease (increase) in accounts receivable 20.2 (17.4 ) Decrease in inventories 2.3 10.8 Increase in prepaid expenses and other current assets (0.1 ) (4.1 ) Decrease in accounts payable/accrued liabilities (2.1 ) (7.9 ) Other - net 1.1 (1.2 ) Net cash provided by operating activities (a) 428.7 401.4 Cash flows from investing activities Capital expenditures (b) (278.1 ) (327.9 ) Acquisitions of business and investments in affiliates (76.0 ) (38.6 ) Net cash used in investing activities (354.1 ) (366.5 ) Cash flows from financing activities Proceeds from senior notes due 2027 398.3 - Issuance costs related to senior notes due 2027 (3.7 ) - Proceeds from settlement of treasury locks 10.0 - Proceeds from Euro term loan 37.4 26.4 Repayments of Euro term loan (4.1 ) - Borrowings from senior unsecured credit facility - 78.0 Repayment of senior unsecured credit facility (315.0 ) - Issuance costs related to credit facility - (1.7 ) Borrowing (repayments) of other debt, net (0.5 ) 1.1 Dividends paid on common stock (42.6 ) (39.8 ) Repurchase of stock (150.3 ) (111.1 ) Activity under stock plans 12.2 0.3 Net cash used in financing activities (58.3 ) (46.8 ) Effect of exchange rate changes on cash and cash equivalents 8.6 (4.7 ) Net increase (decrease) in cash and cash equivalents 24.9 (16.6 ) Cash and cash equivalents at beginning of period 35.2 51.8 Cash and cash equivalents at end of period $ 60.1 $ 35.2 Supplemental data: Free Cash Flow (a)+(b) $ 150.6 $ 73.5 Accrual basis additions to property, plant and equipment $ 284.4 $ 320.2\nHexcel Corporation and Subsidiaries Net Sales to Third-Party Customers by Market Quarters Ended December 31, 2017 and 2016 Unaudited Table A (In millions) As Reported Constant Currency (a) B/(W) FX B/(W) Market 2017 2016 % Effect (b) 2016 % Commercial Aerospace $ 361.1 $ 349.9 3.2 $ 3.5 $ 353.4 2.2 Space & Defense 96.4 79.1 21.9 1.5 80.6 19.6 Industrial 54.2 54.5 (0.6 ) 3.3 57.8 (6.2 ) Consolidated Total $ 511.7 $ 483.5 5.8 $ 8.3 $ 491.8 4.0 Consolidated % of Net Sales % % % Commercial Aerospace 70.6 72.4 71.9 Space & Defense 18.8 16.3 16.4 Industrial 10.6 11.3 11.7 Consolidated Total 100.0 100.0 100.0 Year to Date Ended December 31, 2017 and 2016 Unaudited (In millions) As Reported Constant Currency (a) B/(W) FX B/(W) Market 2017 2016 % Effect (b) 2016 % Commercial Aerospace $ 1,409.8 $ 1,429.3 (1.4 ) $ 1.9 $ 1,431.2 (1.5 ) Space & Defense 343.7 321.7 6.8 (0.1 ) 321.6 6.9 Industrial 219.8 253.3 (13.2 ) 0.2 253.5 (13.3 ) Consolidated Total $ 1,973.3 $ 2,004.3 (1.5 ) $ 2.0 $ 2,006.3 (1.6 ) Consolidated % of Net Sales % % % Commercial Aerospace 71.5 71.3 71.3 Space & Defense 17.4 16.1 16.1 Industrial 11.1 12.6 12.6 Consolidated Total 100.0 100.0 100.0 (a) To assist in the analysis of our net sales trend, total net sales and sales by market for the quarter and year ended December 31, 2016 have been estimated using the same U.S. dollar, British pound and Euro exchange rates as applied for the respective period in 2017 and are referred to as “constant currency” sales.\n(b) FX effect is the estimated impact on “as reported” net sales due to changes in foreign currency exchange rates.\nHexcel Corporation and Subsidiaries Segment Information Unaudited Table B Composite Engineered Corporate & (In millions) Materials Products Other (a) Total Fourth Quarter 2017 Net sales to external customers $ 413.4 $ 98.3 $ - $ 511.7 Intersegment sales 15.0 0.4 (15.4 ) - Total sales 428.4 98.7 (15.4 ) 511.7 Operating income (loss) 95.4 11.5 (13.7 ) 93.2 % Operating margin 22.3 % 11.7 % 18.2 % Depreciation and amortization 26.2 1.9 0.1 28.2 Stock-based compensation expense 0.9 0.1 1.1 2.1 Accrual based additions to capital expenditures 61.8 4.6 - 66.4 Fourth Quarter 2016 Net sales to external customers $ 390.7 $ 92.8 $ - $ 483.5 Intersegment sales 14.4 0.1 (14.5 ) - Total sales 405.1 92.9 (14.5 ) 483.5 Operating income (loss) 87.1 13.2 (13.3 ) 87.0 % Operating margin 21.5 % 14.2 % 18.0 % Depreciation and amortization 22.5 1.8 - 24.3 Stock-based compensation expense 1.2 0.2 1.1 2.5 Accrual based additions to capital expenditures 83.6 4.0 - 87.6 Full Year 2017 Net sales to external customers $ 1,597.1 $ 376.2 $ - $ 1,973.3 Intersegment sales 63.6 0.4 (64.0 ) - Total sales 1,660.7 376.6 (64.0 ) 1,973.3 Operating income (loss) 359.4 48.7 (57.5 ) 350.6 % Operating margin 21.6 % 12.9 % 17.8 % Depreciation and amortization 96.8 7.5 0.2 104.5 Stock-based compensation expense 6.6 1.1 9.9 17.6 Accrual based additions to capital expenditures 270.3 14.1 - 284.4 Full Year 2016 Net sales to external customers $ 1,610.0 $ 394.3 $ - $ 2,004.3 Intersegment sales 67.6 0.1 (67.7 ) - Total sales 1,677.6 394.4 (67.7 ) 2,004.3 Operating income (loss) 368.3 50.0 (58.2 ) 360.1 % Operating margin 22.0 % 12.7 % 18.0 % Depreciation and amortization 86.0 7.2 0.1 93.3 Stock-based compensation expense 6.1 1.1 8.9 16.1 Accrual based additions to capital expenditures 305.2 14.9 0.1 320.2 (a) We do not allocate corporate expenses to the operating segments.\nHexcel Corporation and Subsidiaries Reconciliation of GAAP to Non-GAAP Net Income, EPS and Tax Rate Table C Unaudited Quarters Ended December 31, 2017 2016 Net Tax Net Tax (In millions, except per diluted share data) Income EPS Rate % Income EPS Rate % GAAP $ 88.1 $ 0.96 (2.0 ) $ 59.5 $ 0.64 27.9 - Discrete Tax Benefit (b) (2.3 ) (0.02 ) 2.6 - - - - Tax Reform (b) (22.1 ) (0.24 ) 25.8 - - - Non-GAAP $ 63.7 $ 0.70 26.4 $ 59.5 $ 0.64 27.9\nUnaudited Year Ended December 31, 2017 2016 Net Tax Net Tax (In millions, except per diluted share data) Income EPS Rate % Income EPS Rate% GAAP $ 284.0 $ 3.09 13.2 $ 249.8 $ 2.65 26.8 - Non-operating expense (net of tax) (a) - - - 0.3 - - - Discrete Tax Benefits (b) (15.6 ) (0.17 ) 4.8 (6.6 ) (0.07 ) 1.8 - Tax Reform (b) (22.1 ) (0.24 ) 6.8 - - - Non-GAAP $ 246.3 $ 2.68 24.8 $ 243.5 $ 2.58 28.6 (a) Non-operating expense is the accelerated amortization of deferred financing costs related to refinancing our credit facility in June 2016.\n(b) The 2017 quarter and year to date periods include benefits of $22.1 million related to the new tax law and $2.3 million and $15.6 million, respectively related to the release of reserves for uncertain tax positions and a valuation allowance in a foreign jurisdiction. The 2016 year to date period includes a benefit of $6.6 million primarily related to the release of reserves for uncertain tax positions.\nHexcel Corporation and Subsidiaries Table D Schedule of Total Debt, Net of Cash Unaudited December 31, September 30, December 31, (In millions) 2017 2017 2016 Current portion of capital lease $ - $ - $ 0.5 Euro term loan 4.3 4.2 3.8 Total current debt 4.3 4.2 4.3 Euro term loan 63.3 62.4 22.6 Long-term credit facility due 2021 50.0 75.0 365.0 Unsecured bonds due 2025, net 297.2 297.1 296.8 Unsecured bonds due 2027, net 395.1 394.9 - Other debt - 0.2 - Total long-term debt 805.6 829.6 684.4 Total Debt 809.9 833.8 688.7 Less: Cash and cash equivalents (60.1 ) (119.1 ) (35.2 ) Total debt, net of cash $ 749.8 $ 714.7 $ 653.5 NOTE: Management believes that an adjusted net income, adjusted diluted net income per share, the adjusted tax rate and free cash flow (defined as cash provided by operating activities less cash payments for capital expenditures), which are non-GAAP measurements, are meaningful to investors because they provide a view of Hexcel with respect to ongoing operating results excluding special items. Special items represent significant charges or credits that are important to an understanding of Hexcel’s overall operating results in the periods presented. In addition, management believes that total debt, net of cash, which is also a non-GAAP measure, is an important measure of Hexcel’s liquidity. Such non-GAAP measurements are not recognized in accordance with generally accepted accounting principles and should not be viewed as an alternative to GAAP measures of performance.\nSource:Hexcel Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=eAVAaK_a1Kp-bVt9cbfbQHW4VnxBbBJpHMV9rfwte2SDIr59IB6uFXl1QJwqRRFlAC728Q3Rvmci8HyvN5Cn_A==", "https://www.globenewswire.com/Tracker?data=eAVAaK_a1Kp-bVt9cbfbQBupWvlePiYoC7INoDLL1BqcJ2muDrMkqpayqYrdzfPZ4Y_Cmw6hipFUctWnPuLaKna-YIMZ1rt3R74BUrcmhXtgJVqUbQD3k-vHOFLEq2chNH0MLFRgPXRDCYJ591ngiDRulH43rtbuL51smgo6jPciheXA9a4npQhB9EKZTbIqfpvdK6Kli4HPSN9vAerHmaCYofxcfWYrhWQwXVzOJrg=", "https://www.globenewswire.com/Tracker?data=RdI2XiMdqjRjMvNrvvt39fHWhH_oalnKi7LsC8LBdzH6YffDwOndlwmfyzIaD341X7pTDpjctHY64y6F3Gr93xh_jV1k3CHI_tRBpUiWFS6kjyzdkQ-goiXIGPa0IXnZSRfjpLjEg8zIGOQaDhaWRngjZY5A1wZhO6vX5b2ez3N3UWgT9CiSaBKNgzge_owJBLPjXNRh373xrqSv6v3ONHNf9qphUQKqZjCt_kxQtL2tMcK2edv4r0QbzI1r5hfpwzrVQDmWUyxbSFdMzCNFGR1C0W84hDaplEsjzKrCemE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/a6d6e0b4-e887-4527-8eb8-d25345b2279b"], "published": "2018-01-25T00:30:00.000+02:00", "crawled": "2018-01-25T01:47:39.017+02:00", "highlightTitle": ""}