{"organizations": [], "uuid": "12578f6eda16a702a0566579232cae9529255478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-lsc-communications-board-of-directors-increases-regular-quarterly-dividend-by-4-percent-company-to-host-an-investor-meeting.html", "country": "US", "domain_rank": 767, "title": "LSC Communications Board of Directors Increases Regular Quarterly Dividend by 4%; Company to Host an Investor Meeting on March 6, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:10:00.000+02:00", "replies_count": 0, "uuid": "12578f6eda16a702a0566579232cae9529255478"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-lsc-communications-board-of-directors-increases-regular-quarterly-dividend-by-4-percent-company-to-host-an-investor-meeting.html", "ord_in_thread": 0, "title": "LSC Communications Board of Directors Increases Regular Quarterly Dividend by 4%; Company to Host an Investor Meeting on March 6, 2018", "locations": [], "entities": {"persons": [{"name": "thomas j. quinlan iii", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "lsc communications board", "sentiment": "neutral"}, {"name": "lsc communications", "sentiment": "neutral"}, {"name": "the yale club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- (NYSE: LKSD) The Board of Directors of LSC Communications declared a regular quarterly dividend of $0.26 per common share. This dividend is a 4% increase from the level paid quarterly since October 2016. The dividend is payable March 2, 2018 to stockholders of record as of the close of business on February 15, 2018.\n“The 4% annual dividend increase represents our ongoing commitment to balanced capital deployment and our continued ability to generate strong free cash flow,” said Thomas J. Quinlan III, LSC Communications’ Chairman and Chief Executive Officer. “Over the last year we have made several strategic acquisitions and investments to enhance our capabilities, and as we focus on the integration of these acquisitions as well as the positive cash impact from the new tax legislation, we are committed to increasing the return of capital to our shareholders.”\nInvestor meeting to be held March 6 th in New York City\nAn investor meeting and live webcast will be held at The Yale Club in New York City on Tuesday, March 6, 2018 from 8:30 am to 11:30 am Eastern Time. A management presentation will be followed by a question and answer session. Individuals wishing to attend in person must pre-register, and the live webcast will be accessible on LSC Communications’ web site: www.lsccom.com . Further details about the event, webcast and pre-registration will be posted in advance on the company's website.\nAbout LSC Communications\nWith a rich history of industry experience, innovative solutions and service reliability, LSC Communications (NYSE: LKSD) is a global leader in print and digital media solutions. The company’s traditional and digital print-related services and office products serve the needs of publishers, merchandisers and retailers around the world. With advanced technology and a consultative approach, LSC’s supply chain solutions meet the needs of each business by getting their content into the right hands as efficiently as possible.\nForward-Looking Statements\nThis news release may contain \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and the U.S. Private Securities Litigation Reform Act of 1995. Readers are cautioned not to place undue reliance on these forward-looking statements and any such forward-looking statements are qualified in their entirety by reference to the following cautionary statements. All forward-looking statements speak only as of the date of this news release and are based on current expectations and involve a number of assumptions, risks and uncertainties that could cause the actual results to differ materially from such forward-looking statements, including risks associated with the ability of LSC Communications to perform as expected as a separate, independent entity and risks associated with the volatility and disruption of the capital and credit markets, and adverse changes in the global economy. Readers are strongly encouraged to read the full cautionary statements contained in LSC’s filings with the SEC. LSC disclaims any obligation to update or revise any forward-looking statements.\n //www.businesswire.com/news/home/20180118006209/en/\nInvestor Relations Contact:\nLSC Communications, Inc.\nJanet Halpin, SVP Treasurer and Investor Relations\ninvestor.relations@lsccom.com\n773-272-9275\nSource: LSC Communications, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180118006209/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lsccom.com&esheet=51745546&newsitemid=20180118006209&lan=en-US&anchor=www.lsccom.com&index=1&md5=a4969341a32af4fb7005481ab777852f"], "published": "2018-01-19T00:10:00.000+02:00", "crawled": "2018-01-19T00:32:59.027+02:00", "highlightTitle": ""}