{"organizations": [], "uuid": "236f8b85a286fb4ab6c1b7a8544a438610da1aa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-cerus-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Cerus Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "236f8b85a286fb4ab6c1b7a8544a438610da1aa6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-cerus-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Cerus Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CONCORD, Calif.--(BUSINESS WIRE)-- Cerus Corporation (NASDAQ:CERS) today announced the pricing of a registered underwritten public offering of its common stock for proceeds of $50.0 million, before deducting estimated offering expenses payable by Cerus. The offering is expected to close on February 2, 2018, subject to customary closing conditions. All of the shares sold in the offering were sold by Cerus. In addition, Cerus has granted the underwriter a 30-day option to purchase up to an additional $7.5 million of shares of its common stock. On January 30, 2018, the last sale price of the shares as reported on The Nasdaq Global Market was $4.76 per share.\nBTIG, LLC is acting as sole book-running manager for the offering.\nA shelf registration statement on Form S-3 relating to the public offering of the shares of common stock described above was declared effective by the Securities and Exchange Commission (SEC) on January 8, 2018. You should read the prospectus in the registration statement and related final prospectus supplement that Cerus will file with the SEC for more complete information about Cerus and this offering. An electronic copy of the final prospectus supplement and accompanying prospectus relating to the offering will be available on the website of the SEC at www.sec.gov . Copies of the final prospectus supplement, when available, and the accompanying prospectus relating to the offering may be obtained by contacting BTIG, LLC, at 825 Third Avenue, 6th Floor, New York, NY, 10022, or by telephone at (212) 593-7555 or by e-mail at equitycapitalmarkets@btig.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nABOUT CERUS\nCerus Corporation is a biomedical products company focused in the field of blood transfusion safety. Cerus currently markets and sells the INTERCEPT Blood System for both platelets and plasma in the United States, Europe, the Commonwealth of Independent States, the Middle East and selected countries in other regions around the world. The INTERCEPT Red Blood Cell system is in clinical development.\nINTERCEPT and the INTERCEPT Blood System are trademarks of Cerus Corporation.\nForward-Looking Statements\nThis press release contains forward-looking statements. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including, without limitation, statements relating to Cerus’ public offering. These forward-looking statements are based upon Cerus’ current expectations. Actual results could differ materially from these forward-looking statements as a result of certain factors, including, without limitation, risks related to market conditions and the satisfaction of customary closing conditions related to the proposed public offering, risks related to the application of the net proceeds from the proposed public offering, risks associated with the uncertain research and product development process, and other risks detailed in Cerus' filings with the SEC, including in Cerus' quarterly report on Form 10-Q for the quarter ended September 30, 2017, filed with the SEC on November 3, 2017 and in the preliminary prospectus supplement related to the proposed offering filed with the SEC on January 30, 2018. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Cerus does not undertake any obligation to update any forward-looking statements as a result of new information, future events, changed assumptions or otherwise.\n //www.businesswire.com/news/home/20180131005475/en/\nCerus Corporation\nTim Lee, 925-288-6137\nInvestor Relations Director\nSource: Cerus Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751402&newsitemid=20180131005475&lan=en-US&anchor=www.sec.gov&index=1&md5=56c5adecacfd59451a5d6c7641b1ebee", "http://www.businesswire.com/news/home/20180131005475/en/"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:46:25.000+02:00", "highlightTitle": ""}