{"organizations": [], "uuid": "9c71aff98a9f19faa0134b1eb312006cbdd8d58b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224771648&w=1200&r=LYNXMPEE0N0V1", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-vietnam-usa-mattis/mattis-praises-vietnams-leadership-on-north-korea-sanctions-idUKKBN1FD18L", "country": "US", "domain_rank": 408, "title": "Mattis praises Vietnam's 'leadership' on North Korea sanctions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:47:00.000+02:00", "replies_count": 0, "uuid": "9c71aff98a9f19faa0134b1eb312006cbdd8d58b"}, "author": "", "url": "https://uk.reuters.com/article/uk-vietnam-usa-mattis/mattis-praises-vietnams-leadership-on-north-korea-sanctions-idUKKBN1FD18L", "ord_in_thread": 0, "title": "Mattis praises Vietnam's 'leadership' on North Korea sanctions", "locations": [], "entities": {"persons": [{"name": "mattis", "sentiment": "negative"}, {"name": "north k", "sentiment": "negative"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "phil stewart", "sentiment": "none"}, {"name": "james pearson", "sentiment": "none"}, {"name": "jim mattis", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}], "organizations": [{"name": "min read  hanoi", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:50 AM / Updated an hour ago Mattis praises Vietnam's 'leadership' on North Korea sanctions Phil Stewart , James Pearson 4 Min Read \nHANOI (Reuters) - U.S. Defense Secretary Jim Mattis praised Vietnam on Wednesday for adhering to sanctions against North Korea, saying at the start of a two-day visit to Hanoi that its leadership on the issue came despite the costs associated with lost trade. \n“I have to pay my respects there and thank them for their support on the (North Korea) issue. They have been supporting the United Nations sanctions, at some cost to them,” Mattis told reporters before landing in Hanoi. \n“And so we appreciate their leadership on that, leading by example and stepping up.” \nNorth Korea’s development of nuclear weapons and missiles capable of hitting the United States has spurred deepening U.N. sanctions and stoked fears of a military conflict. \nU.S. Secretary of State Rex Tillerson said last week that the United States was getting evidence that sanctions were “really starting to hurt” North Korea, although there are no signs yet that they have altered Pyongyang’s military calculus. \nVietnam and North Korea, at one time both within the influence of the former Soviet Union, maintain traditional diplomatic and political ties. \nBut those relations have been tested in recent years, particularly following the alleged involvement of a Vietnamese citizen in the murder of Kim Jong Un’s half brother in 2017. \nHanoi expelled blacklisted North Koreans last year by asking them to voluntarily leave, taking into account “traditional relations” between the two countries, South Korea’s Yonhap news agency reported. \nIn a report to the U.N. Security Council in April 2017, Vietnam also said it had taken measures to implement U.N. sanctions on North Korea. \nMattis said Vietnam was adhering to those sanctions and noted that cutting off trade with a country so close carried an economic cost to Vietnam. \n“DPRK sells coal very cheaply and so obviously if they turn that off, there could be costs associated,” Mattis explained, referring to North Korea by the initials of its official name, the Democratic People’s Republic of Korea. SOUTH CHINA SEA \nMattis’ first stop in Vietnam was to a U.S. Defense Department office in Hanoi that sits just across the street from the North Korean embassy and seeks to recover the remains of U.S. troops killed in the 1965-75 Vietnam War. \nSome 1,293 U.S. forces are still unaccounted for, one U.S. official said. \nMattis’ trip comes amid steadily strengthening U.S.-Vietnamese ties, including between their two militaries, as both countries seek to put the Vietnam War firmly behind them. \nRelations these days are seen largely through shared concern over China’s aggressive behaviour in the South China Sea, where more than $3 trillion in cargo passes every year. \nVietnam has emerged as the most vocal opponent of China’s expansive territorial claims and has been buying U.S. military hardware, including its acquisition of an armed, Hamilton-class Coast Guard cutter. \nThe ship, one U.S. official said, was larger than anything Vietnam had in its navy. \n“(Vietnam) does have one of the region’s fastest growing economies and so freedom of navigation and access in the South China Sea will be critical to them economically and of course in their security efforts,” Mattis said. Reporting by Phil Stewart; editing by Nick Macfie", "external_links": [], "published": "2018-01-24T12:47:00.000+02:00", "crawled": "2018-01-24T13:00:45.006+02:00", "highlightTitle": ""}