{"organizations": [], "uuid": "3188ce2f1ae73e5909189ba57d413d96cf07f908", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-ptc-therapeutics-provides-corporate-update-and-outlines-2018-strategic-priorities.html", "country": "US", "domain_rank": 767, "title": "PTC Therapeutics Provides Corporate Update and Outlines 2018 Strategic Priorities", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "3188ce2f1ae73e5909189ba57d413d96cf07f908"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-ptc-therapeutics-provides-corporate-update-and-outlines-2018-strategic-priorities.html", "ord_in_thread": 0, "title": "PTC Therapeutics Provides Corporate Update and Outlines 2018 Strategic Priorities", "locations": [], "entities": {"persons": [{"name": "stuart w. peltz", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "south plainfield", "sentiment": "none"}], "organizations": [{"name": "ptc therapeutics, inc.", "sentiment": "neutral"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}, {"name": "ptc therapeutics", "sentiment": "none"}, {"name": "unaudited financial results ptc", "sentiment": "none"}, {"name": "ptc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH PLAINFIELD, N.J., Jan. 8, 2018 /PRNewswire/ -- PTC Therapeutics, Inc. (NASDAQ: PTCT) today provided a corporate update, which will be detailed as part of the company's presentation at the 36th Annual J.P. Morgan Healthcare Conference on Wednesday, January 10th at 2:30 pm PT. Stuart W. Peltz, Ph.D., PTC's Chief Executive Officer, will highlight the company's 20-year commitment to bring best-in-class therapies to patients affected by rare disorders, the company's 2018 strategic priorities, preliminary 2017 financial results and 2018 financial guidance. The presentation will be webcast live on the Events and Presentations page under the investors section of PTC Therapeutics' website at www.ptcbio.com .\nPreliminary 2017 Unaudited Financial Results\nPTC expects to report Translarna™ (ataluren) net product revenue for the treatment of nonsense mutation Duchenne muscular dystrophy (nmDMD) of approximately $145 million for 2017, an increase of 78% over the prior year. This strong performance, which achieves the upper end of the company's guidance for the full year 2017, reflects the rapid uptake and the high unmet need in this community. PTC continues to be pleased by the greater than 90% compliance rate of patients on therapy. PTC expects to report EMFLAZA™ (deflazacort) net product revenue for the treatment of Duchenne muscular dystrophy (DMD) of approximately $29 million for 2017, 16% higher than the upper end of the company's guidance for the full year 2017. PTC expects to report year-end cash and cash equivalents of approximately $191 million.\n2018 Guidance\nPTC anticipates full-year net product revenues to be between $260 and $295 million. PTC anticipates Translarna net product revenue for the full year 2018 to be between $170 and $185 million. PTC projects a 5-year (12/31/17-12/31/22) compound annual growth rate of 15% representing continued strong growth year-over-year of Translarna in existing countries and in expansion into new territories. PTC anticipates EMFLAZA net product revenue for the full year 2018 to be between $90 and $110 million. PTC anticipates GAAP R&D and SG&A expense for the full year 2018 to be between $280 and $290 million. PTC anticipates Non-GAAP R&D and SG&A expense for the full year 2018 to be between $250 and $260 million, excluding estimated non-cash, stock-based compensation expense of approximately $30 million.\nCorporate Highlights\nSuccessful commercial launch of EMFLAZA for the treatment of Duchenne muscular dystrophy. PTC has established programs with the goal of ensuring that all eligible patients will have access to EMFLAZA regardless of financial or insurance status. PTC is committed to improving the standard of care for all Duchenne patients. Continued strong growth of Translarna product revenue outside US in nonsense mutation Duchenne patients. PTC plans continued growth in Translarna ex-US business by increasing penetration in current countries, expanding into new geographies, and pursuing opportunities for label expansion. As part of the US FDA appeal process for the Translarna NDA, a meeting is scheduled at the request of the Office of New Drugs and PTC plans to provide an update in the first quarter. The SUNFISH trial in the spinal muscular atrophy (SMA) program transitioned to the pivotal portion in 2017 with FIREFISH anticipated to transition to the pivotal stage in the coming months. Survival data from FIREFISH study in Type 1 SMA patients will be presented at the upcoming SMA Europe International Scientific Congress in Krakow. The SMA program is a joint collaboration with Roche and the SMA Foundation. PTC continues to expand its innovative pipeline with internal research programs in the company's next generation readthrough platform, alternative splicing platform and key developments in oncology with two DHODH inhibitor compounds. PTC to host an analyst day in the upcoming months to provide an update on its growing pipeline.\nNon-GAAP Financial Measures:\nIn this press release, the unaudited financial results and financial guidance of PTC are provided in accordance with accounting principles generally accepted in the United States (GAAP) and using certain non-GAAP financial measures. In particular, non-GAAP financial measures exclude non-cash, stock-based compensation expense. This non-GAAP financial measure is provided as a complement to results reported in GAAP because management uses this non-GAAP financial measure when assessing and identifying operational trends. In management's opinion, this non-GAAP financial measure is useful to investors and other users of PTC's financial statements by providing greater transparency into the operating performance at PTC and the company's future outlook. Quantitative reconciliations of these non-GAAP financial measures to GAAP financial measures are included in the table below.\nPTC Therapeutics, Inc.\nReconciliation of Projected GAAP to Non-GAAP Full Year 2018 R&D and SG&A Expense (In thousands)\nLow End of Range\nHigh End of Range\nProjected GAAP R&D and SG&A expense\n280,000\n290,000\nLess: projected non-cash stock-based compensation expense\n30,000\n30,000\nTotal projected non-GAAP R&D and SG&A expense\n$\n250,000\n$\n260,000\nPreliminary 2017 Financial Results:\nPTC is currently in the process of finalizing its financial results for the 2017 fiscal year. The above information is based on preliminary unaudited information and management estimates for the full year 2017, subject to the completion of PTC's financial closing procedures. In addition, the above information is subject to revision as PTC completes its financial closing procedures for fiscal 2017.\nAbout PTC Therapeutics, Inc.\nPTC is a global biopharmaceutical company focused on the discovery, development, and commercialization of novel medicines using our expertise in RNA biology. PTC's internally discovered pipeline addresses multiple therapeutic areas, including rare disorders and oncology. PTC has discovered all of its compounds currently under development using its proprietary technologies. Since its founding nearly 20 years ago, PTC's mission has focused on developing treatments to fundamentally change the lives of patients living with rare genetic disorders. The company was founded in 1998 and is headquartered in South Plainfield, New Jersey. For more information on the company, please visit our website www.ptcbio.com .\nFor More Information:\nInvestors:\nEmily Hill\n+1 (908) 912-9327\nehill@ptcbio.com\nMedia:\nJane Baj\n+1 (908) 912-9167\njbaj@ptcbio.com\nForward Looking Statements:\nThis press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. All statements contained in this release are forward-looking statements, including the information provided under the headings \"Preliminary Unaudited 2017 Financial Results\", including with respect to (i) 2017 net sales of Translarna for the treatment of nmDMD and EMFLAZA for the treatment of Duchenne muscular dystrophy and (ii) year-end 2017 cash and cash equivalents, and \"2018 Guidance\", including with respect to (i) 2018 net product revenue and net sales guidance for Translarna and Emflaza and (ii) 2018 GAAP and non-GAAP R&D and SG&A expense guidance, and statements regarding: the future expectations, plans and prospects for PTC; PTC's p", "external_links": ["http://www.ptcbio.com/", "http://www.prnewswire.com/news-releases/ptc-therapeutics-provides-corporate-update-and-outlines-2018-strategic-priorities-300578810.html"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:07:45.014+02:00", "highlightTitle": ""}