{"organizations": [], "uuid": "97b7071e614465e78fc9548af649e6c979410e8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-slips-after-hitting-a-3-year-high-on-ecb-talk-idUSL3N1PC2YD", "country": "US", "domain_rank": 408, "title": "FOREX-Euro slips after hitting a 3-year high on ECB talk", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:53:00.000+02:00", "replies_count": 0, "uuid": "97b7071e614465e78fc9548af649e6c979410e8c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-slips-after-hitting-a-3-year-high-on-ecb-talk-idUSL3N1PC2YD", "ord_in_thread": 0, "title": "FOREX-Euro slips after hitting a 3-year high on ECB talk", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "neutral"}, {"name": "vitor constancio", "sentiment": "none"}, {"name": "jens weidmann", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "repubblica", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 17 (Reuters) - The euro fell on Wednesday after rocketing to a fresh three-year high in early trades above the $1.23 line as some investors ramped up bullish bets about the currency though some concerns from policymakers this week damped broader optimism.\nOverall dollar weakness and growing optimism about the outlook of the European economy in 2018 has lent fresh legs to the euro’s rally after it gained more than 10 percent last year.\nBut the speed of the rise in the opening days of 2018 -- up more than 3 percent in the last two weeks -- has invited some comments from ECB officials this week, highlighting some growing concerns, according to analysts.\nIn an interview to an Italian daily la Repubblica, Vitor Constancio, the vice president of the European Central Bank, said he did not rule out that monetary policy would still continue to be “very accommodating for a long time”.\nOn Tuesday, Jens Weidmann, Germany’s representative on the ECB’s policymaking body said it would be “appropriate” for the European Central Bank to stop its bond purchases, due to run at least until September.\n“The ECB is playing the good cop and the bad cop in terms of their comments over the euro but there is no doubt the currency’s rally has sowed the seeds of uncertainty in the ids of ECB policymakers,” said Viraj Patel, an FX strategist at ING in London.\nThe single currency rose to a session high of $1.2323 against the dollar in Asian trading before falling 0.2 percent to stand at $1.2238.\nFor euro bulls, these are key levels for a couple of reasons. Unlike 2017’ summer, when positioning wasn’t as stretched and valuations still reasonably attractive, current levels are not as supportive for the single currency.\nLatest positioning data showed that net long euro positions are at a record high while both ECB and IMF valuation metrics show the euro is only about 6-7 percent currently compared to more than 12 percent before the French elections last year.\nMorgan Stanley strategists said in a daily note that as long as inflation expectations are met and growth remains strong, the euro’s strength will be tolerated by the ECB.\nElsewhere, Canada’s central bank is widely expected to raise interest rates by 25 basis points and take the benchmark borrowing cost to 1.25 percent. Analyst expect the BoC to raise rates as many as three times in 2018.\nThe Australian dollar rose 0.1 percent to $0.7970 and the New Zealand dollar dipped 0.1 percent to $0.7260 .\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets\nReporting by Saikat Chatterjee; Additional reporting by Shinichi Saoshiro in TOKYO; Editing by Toby Chopra\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T16:53:00.000+02:00", "crawled": "2018-01-18T16:15:28.014+02:00", "highlightTitle": ""}