{"organizations": [], "uuid": "2bd7caf898406813d110874cf82ab0ef3aa97e59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226961598&w=1200&r=LYNXMPEE0U117", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "https://www.reuters.com/article/us-germany-economy-retail/germanys-political-deadlock-takes-toll-on-consumers-retail-body-idUSKBN1FK206", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Germany's political deadlock takes toll on consumers - retail body", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:51:00.000+02:00", "replies_count": 0, "uuid": "2bd7caf898406813d110874cf82ab0ef3aa97e59"}, "author": "", "url": "https://www.reuters.com/article/us-germany-economy-retail/germanys-political-deadlock-takes-toll-on-consumers-retail-body-idUSKBN1FK206", "ord_in_thread": 0, "title": "UPDATE 1-Germany's political deadlock takes toll on consumers - retail body", "locations": [], "entities": {"persons": [{"name": "joseph nasr", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "stefan genth", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "hde", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:11 PM / Updated 2 hours ago Germany's political deadlock takes toll on consumers - retail body Joseph Nasr 3 Min Read \nBERLIN (Reuters) - Germany’s months-long political deadlock contributed to weaker retail sales data in December, suppressing consumers’ appetite for goods and services, the country’s leading retail association said on Wednesday. \nGermany has been without a government since an election in September that weakened Chancellor Angela Merkel’s conservatives. They are now in talks with the center-left Social Democrats (SPD) on renewing a coalition that governed Germany from 2013 to 2017. \n“Consumers finally want to have a government,” said Stefan Genth, secretary-general of the HDE retail association, after data showed retail sales had fallen by 1.9 percent both on the month and on the year in December. \nThe fall was also partly linked to December having had two fewer working days than in 2016. The retail sales readings of the highly volatile indicator for November were revised down. \nThe data belied a consumption-based growth cycle in Europe’s largest economy, fueled by rising real wages, record low unemployment and the cheap-money environment created by the European Central Bank (ECB). \nMerkel’s first attempt to form a three-way alliance with the ecologist Greens and the pro-business Free Democrats collapsed suddenly in November, forcing her to turn to the SPD. \nThe economy has weathered the political crisis resulting from an inconclusive election on Sept. 24 that brought the anti-immigrant, eurosceptic Alternative for Germany (AfD) party into parliament for the first time and made coalition building more difficult. \nThe German economy grew by 2.2 percent last year and the government on Wednesday raised it growth forecast for 2018 to 2.4 percent, citing consumption and a robust labor market as the backbone of the growth cycle. \n“CAUTIOUS PEOPLE” \nThe HDE retail association said it expected sales to rise by 2 percent this year, lower than the 4.1 percent growth recorded last year. \n“We are cautious people,” HDE president Josef Sanktjohanser said of the forecast, adding that the December dip in sales was followed by a start to 2018 that was “not so euphoric”. \nBut the bigger picture for consumption remains positive. Retail sales grew 2.3 percent in real terms last year on the whole, and a survey last week showed consumer morale rose heading into February, unperturbed by the political deadlock. \nSeparate data published on Wednesday showed that the seasonally adjusted unemployment rate fell to 5.4 percent in January, the lowest level since German reunification in 1990. \nThe economy has also benefited from rising exports, as demand from euro zone partners enjoying a solid recovery as well as from China and the United States increase demand for German goods and services. \nThe government expects exports to grow by 5.3 percent this year. Additional reporting by Emma Thomasson and Gernot Heller; Editing by Gareth Jones", "external_links": [], "published": "2018-01-31T17:51:00.000+02:00", "crawled": "2018-01-31T18:05:13.003+02:00", "highlightTitle": ""}