{"organizations": [], "uuid": "487e703ca5acfb579b200ec16409387ee4296e0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224409829&w=1200&r=LYNXMPEE0M0I0", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-dimitrov/tennis-inspiration-runs-dry-for-jaded-dimitrov-idUSKBN1FC0V7", "country": "US", "domain_rank": 408, "title": "Tennis: Inspiration runs dry for jaded Dimitrov", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-23T16:51:00.000+02:00", "replies_count": 0, "uuid": "487e703ca5acfb579b200ec16409387ee4296e0f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-dimitrov/tennis-inspiration-runs-dry-for-jaded-dimitrov-idUSKBN1FC0V7", "ord_in_thread": 0, "title": "Tennis: Inspiration runs dry for jaded Dimitrov", "locations": [], "entities": {"persons": [{"name": "dimitrov", "sentiment": "negative"}, {"name": "grigor dimitrov", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "none"}, {"name": "rod laver", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "nick", "sentiment": "none"}, {"name": "edmund", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "brisbane", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kyrgios", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Bulgarian Grigor Dimitrov returned to the well in search of inspiration but found it dry as a bone as his Australian Open hopes were ended by British firebrand Kyle Edmund on Tuesday.\nAfter some patchy form in the opening rounds Dimitrov hit top form to beat home hope Nick Kyrgios in the last 16, fuelling hopes of a first grand slam final appearance.\nBut the 26-year-old looked flat as unseeded Edmund a fired-up Edmund bludgeoned 46 winners on his way to a 6-4 3-6 6-3 6-4 quarter-final victory on Rod Laver.\nDimitrov said Edmund, who he had beaten in both previous meetings including in Brisbane this month, deserved his win but said victory over Kyrgios had taken an emotional and physical toll.\n“Against Nick, for sure, you played the crowd, you played him, you played your own expectations. There’s a lot of components that come into the game,” Dimitrov said.\n”I was at least happy I found the way (to the quarter-finals). Doesn’t matter how fit I am, I think mentally I was just a little bit tired. With each match, you’re draining up.\nTennis - Australian Open - Quarterfinals - Rod Laver Arena, Melbourne, Australia, January 23, 2018. Grigor Dimitrov of Bulgaria waves as he leaves after losing against Kyle Edmund of Britain. REUTERS/Thomas Peter ”You try things the next day to kind of get better, get into a better shape, in a better head space.\n“Today was just one of those days that I just couldn’t find a way. Simple as that. You have days like that.”\nSlideshow (2 Images) Dimitrov’s title run on his debut at the ATP Finals in November meant his off-season was shorter than usual.\nIt also meant he arrived in Melbourne as one of the favorites for the title -- a situation he will have to learn to deal with if his career is to continue on the upward curve.\n”In order for me to be a top three guy or chase number one one day, this is what I have to do year in and year out,“ he said. ”This is my first year I’ve done something like this.\n”At least I know what it is. I’ve gone through the way now. At the same time, I still need to push and see where the limits are. For sure once you get to the top, everything becomes more narrow. You have a bigger target on your back.\n“Everybody wants to beat you. Everybody plays better matches against you. So, yeah, it gets harder.”\nReporting by Martyn Herman; Editing by Amlan Chakraborty\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T16:51:00.000+02:00", "crawled": "2018-01-24T15:42:25.012+02:00", "highlightTitle": ""}