{"organizations": [], "uuid": "f73fd9763f19a528e6109b2bddee877e8c699a99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-ibhs-announces-key-leadership-changes-advancements.html", "country": "US", "domain_rank": 767, "title": "IBHS Announces Key Leadership Changes, Advancements", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:42:00.000+02:00", "replies_count": 0, "uuid": "f73fd9763f19a528e6109b2bddee877e8c699a99"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-ibhs-announces-key-leadership-changes-advancements.html", "ord_in_thread": 0, "title": "IBHS Announces Key Leadership Changes, Advancements", "locations": [], "entities": {"persons": [{"name": "cope", "sentiment": "none"}, {"name": "anne d. cope", "sentiment": "none"}, {"name": "mother nat", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}], "organizations": [{"name": "ibhs", "sentiment": "negative"}, {"name": "the insurance institute for business & home safety", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares highlights of 2018 FORTIFIED Home™ growth plans and aggressive research agenda to protect homes and businesses from severe weather damage\nTAMPA, Fla.--(BUSINESS WIRE)-- The Insurance Institute for Business & Home Safety (IBHS) is proud to announce the promotion of Anne D. Cope, Ph.D., P.E., as Senior Vice President of Research and Chief Engineer. Cope has assumed leadership of IBHS’ multimillion-dollar research agenda to make homes and businesses stronger against multiple natural hazards, and now also oversees the FORTIFIED Home program.\n“Across our nation and territories, 2017 weather was brutal by every measure, causing significant loss of life and $306 billion in property damage. This weather will happen again, but our research and science proves that home and business owners can prevent storms from becoming catastrophes and tragedies. ‘Never again’ is possible for homes built to stronger standards,” Cope said. “As America rebuilds, I am inspired by the goal of IBHS and our member companies to find and share construction methods and materials that can stand up to Mother Nature so those who were harmed in 2017 can choose to rebuild stronger and avoid future damage.”\nCope, who joined IBHS in 2009, assumes leadership of IBHS’ team of scientists and engineers from Timothy Reinhold, Ph.D., P.E., who retired in December 2017 after several years as IBHS Senior Vice President of Research and Chief Engineer. IBHS is grateful for Reinhold’s extraordinary talent and his deep contributions to informing wind resistance and resilient construction, and the entire IBHS team is pleased he will remain in close consultation with IBHS going forward.\nAlso promoted were:\n• Tanya Brown-Giammanco, Ph.D., to Vice President, Research\n• Fred Malik to Vice President, FORTIFIED Programs\n• Chuck Miccolis to Vice President, Commercial Lines\n• Murray Morrison, Ph.D., to Vice President, Research\n“IBHS is proud to congratulate and promote this exceptionally talented group of professionals whose work at IBHS is solving the complex problem of making America’s current and future housing and business building stock stronger and safer,” said Julie Rochman, CEO and president of IBHS. “Together with the entire IBHS team, these leaders in their field are discovering affordable, effective ways to help our communities stand strong even against the fierce weather events that were so destructive in 2017.”\nFORTIFIED Home, the national standard for resilient construction, is a set of engineering and building standards designed to help strengthen new and existing homes against specific natural hazards, including hurricanes, high winds, and high winds and hail. A new report on mitigation demonstrates savings of $5 for every $1 invested in FORTIFIED Home wind resilient construction standards.\nDuring 2018, the FORTIFIED Home team is focusing on post-Hurricane Harvey recovery efforts by launching the FORTIFIED Home–Hurricane program in coastal Texas and by recruiting and training evaluators and builders. IBHS also will continue efforts to scale the program in Alabama, Oklahoma and North Carolina.\n“Much of the damage inflicted by weather events each year can be avoided if homes and businesses are built with resilience in mind,” Cope said. “At IBHS, we are driven to expand our FORTIFIED program and protect thousands more homes and families from weather disasters,” Cope said. “We will work with the roofing industry to share and encourage adoption of our proven techniques, and pursue multiple strategies to educate homeowners, builders, architects and materials manufacturers on the value of FORTIFIED.”\nIn parallel during 2018, Cope’s team at the IBHS Research Center will be analyzing weather and damage data from 2017 hurricanes and fires to glean additional information on how these extreme weather events impacted structures of various designs and code standards. In addition, IBHS will:\nIssue a first-of-kind data set resulting from IBHS’ extensive continuous load path testing and demonstration project during 2017, including pressure data that resulted in new guidance urging homes outside flood zones to close all interior doors when high wind events are expected. Conduct hail, wind, and wildfire testing on roof specimens aging at the IBHS “roof farm” to understand how shingles perform against these risks as they age in a natural environment. Continue the ongoing hail field study, and continue refining a hail testing protocol and damage matrix. Conduct testing to identify the appropriate size for a noncombustible zone for structures located in wildfire-prone areas. Conduct research on wind-driven rain penetration of typical high-rise HVAC units to determine mitigation strategies for this risk.\nNote: Staff bio information available at www.disastersafety.org , or by request.\nAbout the Insurance Institute for Business & Home Safety (IBHS)\nIBHS ’ mission is to conduct objective, scientific research to identify and promote effective actions that strengthen homes, businesses and communities against natural disasters and other causes of loss.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006489/en/\nInsurance Institute for Business & Home Safety (IBHS)\nSusan G. Millerick, 813-675-1066\n@NewsIBHS\nsmillerick@ibhs.org\nSource: Insurance Institute for Business & Home Safety (IBHS)", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nibs.org%2Fpage%2Fmitigationsaves&esheet=51747083&newsitemid=20180122006489&lan=en-US&anchor=new+report+on+mitigation&index=2&md5=0723008973f67257a05728908a05a993", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.disastersafety.org&esheet=51747083&newsitemid=20180122006489&lan=en-US&anchor=www.disastersafety.org&index=3&md5=d5f6f90f063ec9a9fa0127311be93d63", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.disastersafety.org%2F&esheet=51747083&newsitemid=20180122006489&lan=en-US&anchor=IBHS&index=4&md5=ffdfe3052c11b44de2d140bba0db07db", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fdisastersafety.org%2Ffortified%2F&esheet=51747083&newsitemid=20180122006489&lan=en-US&anchor=FORTIFIED+Home&index=1&md5=29d7339d8314cde781989bbf73174499", "http://www.businesswire.com/news/home/20180122006489/en/"], "published": "2018-01-22T23:42:00.000+02:00", "crawled": "2018-01-23T02:15:16.032+02:00", "highlightTitle": ""}