{"organizations": [], "uuid": "436a71c57c7cba87ba9f23d8c52dd84c714c3c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-stantec-signs-letter-of-intent-to-acquire-occam-engineers-inc.html", "country": "US", "domain_rank": 767, "title": "Stantec Signs Letter of Intent to Acquire Occam Engineers Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:45:00.000+02:00", "replies_count": 0, "uuid": "436a71c57c7cba87ba9f23d8c52dd84c714c3c5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-stantec-signs-letter-of-intent-to-acquire-occam-engineers-inc.html", "ord_in_thread": 0, "title": "Stantec Signs Letter of Intent to Acquire Occam Engineers Inc.", "locations": [], "entities": {"persons": [{"name": "stantec", "sentiment": "none"}, {"name": "john take", "sentiment": "none"}], "locations": [{"name": "alberta", "sentiment": "none"}, {"name": "southwest edmonton", "sentiment": "none"}, {"name": "santa fe", "sentiment": "none"}, {"name": "roswell", "sentiment": "none"}, {"name": "las cruces", "sentiment": "none"}, {"name": "silver city", "sentiment": "none"}, {"name": "southwestern united states", "sentiment": "none"}, {"name": "tucumcari", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "artesia", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "stantec signs letter of intent to acquire occam engineers inc", "sentiment": "neutral"}, {"name": "oei", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "occam engineers inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Firm enhances water, transportation, and public works services in Southwest\nEDMONTON, Alberta & NEW YORK--(BUSINESS WIRE)-- TSX, NYSE: STN\nGlobal design firm Stantec is strengthening its water, transportation, and public works service in the Southwestern United States with the planned acquisition of New Mexico-based consulting engineering firm, Occam Engineers Inc. (OEI). The transaction is expected to close in March.\nWith established service to both local and regional clients, OEI specializes in the professional service areas of civil engineering, public works, transportation, development engineering, planning and feasibility, program management, water resources and value analysis. The 55-person firm is headquartered in Albuquerque, with offices throughout New Mexico in Santa Fe, Roswell, Artesia, Las Cruces, Silver City, and Tucumcari. OEI also has an office in Houston, Texas.\n“OEI brings a long-held focus on integrity, excellence, and collaboration, and we are thrilled to welcome their talented team members to our growing company community,” said John Take, Stantec senior vice president, Water. “OEI’s strong client relationships in both the water and transportation markets will help us as we continually expand both the depth and breadth of our professional services across the Southwest US.”\nOEI is the result of the merger of firms Engineers, Inc., Occam Consulting Engineers, Inc., and Easterling Consultants, LLC. The firm supports a variety of prominent clients to solve complex infrastructure challenges. Among the firm’s notable projects, OEI teamed with Stantec to support Santa Fe County in the negotiations of an Operating Agreement for the Pojoaque Basin Regional Supply System. The project consists of surface water diversion facilities on the Rio Grande, along with treatment, transmission, storage, and distribution facilities, which will ultimately supply up to 4,000 acre-feet of water annually to local and regional water users. OEI also led the reconstruction of a rural and isolated area of US 54 near Tularosa, New Mexico, for the New Mexico Department of Transportation. The project aims to improve safety along the corridor, with OEI spearheading the redesign of a bridge and an increase in driving and passing lanes. Additionally, the firm provides data collection and monitoring assistance for a large-scale groundwater remediation project in Albuquerque to successfully treat 185 million gallons of contaminated groundwater annually, returning safe water to the aquifer facility with zero safety-related incidents.\n“This is a tremendous opportunity to pursue large-scale public works projects not only in New Mexico, but across all of the Colorado River Basin states, while providing our existing clients an expanded array of capabilities drawn from the larger Stantec network,” says Scott Verhines, P.E., OEI president. “Stantec’s technical expertise, coupled with our strong relationships in both transportation and water, provide our employees exciting avenues to pursue meaningful projects advancing the quality of life in communities across the region.”\nFrom its base of more than 22,000 team members worldwide, Stantec currently has more than 9,000 US employees, with more than 1,100 employees in the Southwest US.\nAbout Stantec\nCommunities are fundamental. Whether around the corner or across the globe, they provide a foundation, a sense of place and of belonging. That’s why at Stantec, we always design with community in mind.\nWe care about the communities we serve—because they’re our communities too. We’re designers, engineers, scientists, and project managers, innovating together at the intersection of community, creativity, and client relationships. Balancing these priorities results in projects that advance the quality of life in communities across the globe. Stantec trades on the TSX and the NYSE under the symbol STN. Visit us at stantec.com or find us on social media.\nCautionary Note Regarding Forward-Looking Statements\nThis news release contains forward-looking statements. By their nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties. There is a significant risk that a number of factors could cause actual future results to differ materially from the forward-looking statements made in this news release. These factors include, but are not limited to, the risk that the proposed transaction does not close when expected or at all or that the anticipated benefits of the transaction are not realized.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005233/en/\nStantec\nMedia Contact\nRyan Lamont, (213) 955-3528\nryan.lamont@stantec.com\nStantec Media Relations\nor\nInvestor Contact\nSonia Kirby, (780) 616-2785\nsonia.kirby@stantec.com\nStantec Investor Relations\nor\nOEI Contact\nScott Verhines, P.E., (505) 275-0022\nPresident\nscott@oeipro.com\nSource: Stantec", "external_links": ["http://www.businesswire.com/news/home/20180131005233/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.stantec.com%2F&esheet=51750103&newsitemid=20180131005233&lan=en-US&anchor=stantec.com&index=1&md5=77c332df6d67e360298390856e15e391"], "published": "2018-01-31T16:45:00.000+02:00", "crawled": "2018-01-31T18:34:51.006+02:00", "highlightTitle": ""}