{"organizations": [], "uuid": "d4846a696b288d5a180e30da302b767afb88cabe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/us", "section_title": "U.S. News | Reuters", "url": "https://www.reuters.com/article/us-new-york-crime/new-york-charges-17-with-numerous-crimes-ties-to-salvadoran-drug-gang-idUSKBN1F031Y", "country": "US", "domain_rank": 408, "title": "New York charges 17 with numerous crimes, ties to Salvadoran drug gang", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.951, "site_type": "news", "published": "2018-01-12T06:33:00.000+02:00", "replies_count": 0, "uuid": "d4846a696b288d5a180e30da302b767afb88cabe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-new-york-crime/new-york-charges-17-with-numerous-crimes-ties-to-salvadoran-drug-gang-idUSKBN1F031Y", "ord_in_thread": 0, "title": "New York charges 17 with numerous crimes, ties to Salvadoran drug gang", "locations": [], "entities": {"persons": [{"name": "mara salvatrucha", "sentiment": "none"}, {"name": "madeline singa", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "nassau county", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Law enforcement authorities on Thursday unveiled a slew of charges, including murder, drug trafficking and conspiracy, against 17 alleged members of a Central America-tied gang that they say is running a global criminal enterprise.\nA grand jury in Nassau County, on Long Island just east of New York City, earlier this week indicted the alleged members of MS-13, or Mara Salvatrucha, on 21 criminal counts that prosecutors said could result in prison sentences for each of 25 years to life.\n“This massive multi-agency investigation laid bare the global size, complexity and brutality of MS-13, and these indictments strike a heavy blow to the gang’s operations on Long Island,” Nassau County District Attorney Madeline Singa said.\nThe seven-month investigation started as a drug case, then unearthed an El Salvador-based global narcotics network that prosecutors said relies on violence and intimidation and stretches to Mexico, Columbia, South Korea, France, Australia, Peru, Egypt, Ecuador and Cuba.\nThe grand jury indictment alleges crimes committed in New York, New Jersey, Maryland, Virginia and Texas. Nine of the 17 defendants are still at large, prosecutors said.\nThe gang is organized into several sub-groups, or cliques, each of which reports to gang leaders in El Salvador and sends them proceeds from their drug sales, the prosecutors said.\nIn a speech on Long Island last summer, U.S. President Donald Trump cited MS-13, which started in Los Angeles, as a key source of violence in U.S. communities, and blamed lax enforcement of illegal immigration from Central America as a reason for its existence in the United States.\nAt least seven of the defendants are foreign nationals from El Salvador or Honduras, although prosecutors did not identify those still at large.\nThe indictment accuses two defendants, David Sosa Guevara and Victor Lopez, with the murder of a 15-year-old in Nassau County last July.\nOther charges included conspiracy to commit murder and trafficking in cocaine and heroin. Prosecutors said they seized four kilograms of heroin, cocaine and weapons.\nAs a result of the investigation, prosecutors said they were able to solve two murders last year in Maryland’s Prince George’s County.\n”Not only did we arrest the highest-level Mara Salvatrucha leader in the Northeast who reports to MS-13 in El Salvador, but we sent a message that we will continue to investigate their violent crimes and bring justice to their victims,” said Special Agent in Charge James Hunt of the U.S. Drug Enforcement Administration.\nReporting by Peter Szekely; Editing by Leslie Adler\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T06:33:00.000+02:00", "crawled": "2018-01-12T05:05:17.000+02:00", "highlightTitle": ""}