{"organizations": [], "uuid": "a050ff5d20798bc4a41fcf29ca5f402ec4ada5d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-mexicos-finance-minister-jose-antonio-gonzalez-anaya-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Mexico’s Finance Minister, José Antonio González Anaya from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-24T08:00:00.000+02:00", "replies_count": 0, "uuid": "a050ff5d20798bc4a41fcf29ca5f402ec4ada5d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-mexicos-finance-minister-jose-antonio-gonzalez-anaya-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Mexico’s Finance Minister, José Antonio González Anaya from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "josé antonio gonzález anaya", "sentiment": "negative"}, {"name": "akiko fujita", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with José Antonio González Anaya, Mexico's Finance Minister and CNBC's Akiko Fujita & Geoff Cutmore from the World Economic Forum 2018.\nAF: Thankfully, we've got a guest who can talk more to that. We're joined by the Finance Minister of Mexico, José Antonio González Anaya, great to have you on today-,\nJA: Thank you very much.\nAF: I'd love to start with the NAFTA negotiations here, because we did hear from President Trump earlier, saying that the negotiations are moving along pretty well, but he is of the mind that if it doesn't work out, we will terminate. Given where things stand right now with the negotiations, where do you put that likelihood, of the US pulling out at the end of talks?\nJA: Well, I think it's hard to say, but one of the things we can say is that, just a year ago, at this time of year, in Mexico, there was a lot of uncertainty around all of these topics. You know, he was about to take office, and there was a lot of talk, and we didn't really know where we stood. What I-, what we can say, about NAFTA, and the NAFTA negotiations, is that there's dialogue and there's a process. There have been five rounds of negotiations, as it has been announced, there's a current round, in Montreal, as we speak, that is also happening. So, we-, you know, our central scenario is that this will go to a-, to a good-, to a good deal. We believe trade is-, is good for all three nations, and that's what we're hoping for.\nAF: Mm. Well, let me see if we can talk a bit more about what appears to be the sticking point, rules of origin, a big part of that. The US has said that 50% of the parts for products produced in North America would need to be sourced directly from the US. IS that a non-starter for Mexico?\nJA: Well, there are lots of issues that are outstanding, and I think, you know, the Minister of Economy, not of Finance, is the-, is the head of the negotiations, on behalf of Mexico, and it's important, and we like to negotiate on the negotiating-, on the negotiating table. And so, in that case, we're going to do what's best for Mexico, and we have very clear positions on quite a few of those issues.\nGC: Let me ask you. Clearly, if there is no deal, that would have significant consequences for the budgeting of your government, going forward. Do you have a Plan B, for a failed negotiation?\nJA: Well, I was just in Canada last week, and they asked the same question to Minister Morneau, and he said, 'We're working on Plan A. Let us work on Plan A,' and Plan A is that NAFTA has been good for Mexico, good for the United States, and good for Canada, that's the way we see it, and we're going to continue to work on a new version that is also good for all of us.\nGC: But, we've just seen Justin Trudeau talk about the success of TPP, and countries have come together in spite of that agreement being abandoned by the United States. Is that a model for what could happen with NAFTA, if America refuses to play softball with you?\nJA: Well, it's a different arrangement. TPP has a large number of country members. In-, in the case of NAFTA, there's-, there's three of us. So, it's important, and we want to keep it as a trilateral deal, and we've always worked on that front. And, as I said, there have been five rounds of negotiations, there is a-, there is a current one, so, the dialogue is going on, and that's what we should bet on.\nGC: You-, you said explicitly, back on the 12 th of January, that you see the US tax overhaul as largely regressive in its focus. Is there anything that this Trump administration has done, that you, in Mexico, can say you approve of?\nJA: Well, you know, I was merely stating an analyst's fact. You know, the fact, by analysts in the United States is that a large portion of the benefit of that tax reform is concentrated on a small segment of the population. So, for us, when we are dealing with our largest trading partner, it's important that we remain, you know, competitive, and we are taking measures to see how we do that, and we want to make sure that it's-, you know, we don't do anything where we concentrate further the wealth in Mexico. For us, it's very important that we redistribute wealth, through our policies.\nAF: One of the challenges in dealing with this White House is the question of who, exactly, speaks for the administration. Just this week, we heard the Chief of Staff saying that President Trump was supportive of who would pay for the border wall, and then President Trump himself came out and said the US would not, it would be Mexico. Just another example of the mixed messages coming from the US. How challenging is it to have these discussions, given the division we are seeing within the administration itself?\nJA: Well, I am glad you framed it that way, because, in Mexico, we have given-, we have been given clear instructions by the President on who decides what. That's why I was very careful around the NAFTA negotiations. That's the Minister of the Economy. The-, you know, the migration issues, and the relationship with the US, is the Minister of Foreign Affairs, so we each have our-, our tasks on what we do. Regarding different positions, we always try to mimic whoever is in charge in our positions. With the US, our relationship with the US is very broad, there's lots of issues that we have to deal with, and we have clear instructions on what to say, and what positions to hold.\nAF: Okay, we'll have to leave it on that note. Great to have you on set today, José Antonio González Anaya joining us, the Finance Minister of Mexico.\nJA: Thank you very much.\nGC: Thank you so much for being with us.\nJA: Thank you.\nENDS", "external_links": [], "published": "2018-01-24T08:00:00.000+02:00", "crawled": "2018-01-24T17:48:37.001+02:00", "highlightTitle": ""}