{"organizations": [], "uuid": "d4b68961b3c8a5ea8c242bfde2877915979dd3d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224986281&w=1200&r=LYNXMPEE0O01W", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-oil/oil-hits-highest-since-late-2014-on-u-s-crude-inventory-drop-weaker-dollar-idINKBN1FE04F", "country": "US", "domain_rank": 408, "title": "Oil hits highest since late 2014 on U.S. crude inventory drop, weaker dollar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:26:00.000+02:00", "replies_count": 0, "uuid": "d4b68961b3c8a5ea8c242bfde2877915979dd3d2"}, "author": "", "url": "https://in.reuters.com/article/global-oil/oil-hits-highest-since-late-2014-on-u-s-crude-inventory-drop-weaker-dollar-idINKBN1FE04F", "ord_in_thread": 0, "title": "Oil hits highest since late 2014 on U.S. crude inventory drop, weaker dollar", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Oil retreated late on Thursday as the U.S. dollar rebounded from early losses and strengthened, denting support for the latest crude rally, but tight U.S. supplies limited the commodity’s decline.\nThe U.S. dollar rose against a basket of currencies .DXY after President Donald Trump said he wanted a “strong dollar.” A day earlier, the greenback tumbled when U.S. Treasury Secretary Steven Mnuchin said he welcomed a weaker currency.\nOil fell as the dollar rose. A stronger dollar makes dollar-denominated commodities more expensive for other currency holders. The dollar’s earlier weakness had boosted oil prices.\nBrent crude LCOc1, the international oil benchmark settled down 11 cents at $70.42 a barrel. Its session high of $71.28 a barrel was the highest since early December 2014.\nU.S. West Texas Intermediate crude CLc1 futures for March delivery fell 10 cents to settle at $65.51 a barrel. Its session high of $66.66 was also the highest since December 2014.\nTightening global supplies have also lifted oil, as the Organization of the Petroleum Exporting Countries and allies including Russia have continued supply curbs. An involuntary drop in Venezuela’s production in recent months has deepened the impact of the output cuts.\nU.S. crude stockpiles have been dropping, underscoring the idea that global supply is rebalancing after a glut. U.S. crude inventories fell for a record 10th straight week to the lowest since February 2015, official figures showed on Wednesday.\n“The rebalance of the fundamental picture continues,” said Gene McGillian, a director at Tradition Energy. Still, he pointed to rising product inventories as a potential bearish signal.\nThe supply cuts led by OPEC and Russia started a year ago and are set to last throughout 2018. They have been somewhat offset by growing output of U.S. shale oil, as higher prices have encouraged more investment in expanding supplies.\nU.S. crude oil production is expected to surpass 10 million barrels per day (bpd) in February, on the way to a record ahead of previous forecasts, according to the U.S. Energy Information Administration.\nAdditional reporting by Alex Lawler in London, Henning Gloystein in Singapore and Aaron Sheldrick in Tokyo; Editing by David Gregorio and David Evans\n ", "external_links": [], "published": "2018-01-25T03:26:00.000+02:00", "crawled": "2018-01-25T03:53:42.005+02:00", "highlightTitle": ""}