{"organizations": [], "uuid": "a877f9a9c676a37a03765a73ee5fd2f469367afd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-enstar-reinsures-a840-million-portfolio-of-novae-legacy-business.html", "country": "US", "domain_rank": 767, "title": "Enstar Reinsures £840 Million Portfolio of Novae Legacy Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.699, "site_type": "news", "published": "2018-01-29T15:00:00.000+02:00", "replies_count": 0, "uuid": "a877f9a9c676a37a03765a73ee5fd2f469367afd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-enstar-reinsures-a840-million-portfolio-of-novae-legacy-business.html", "ord_in_thread": 0, "title": "Enstar Reinsures £840 Million Portfolio of Novae Legacy Business", "locations": [], "entities": {"persons": [{"name": "dominic silvester", "sentiment": "none"}], "locations": [{"name": "bermuda", "sentiment": "none"}], "organizations": [{"name": "enstar group limited", "sentiment": "negative"}, {"name": "enstar", "sentiment": "negative"}, {"name": "starstone underwriting limited", "sentiment": "none"}, {"name": "axis managing agency limited", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Enstar Group Limited (Nasdaq:ESGR) announced today that its Lloyd’s managing agency, StarStone Underwriting Limited, has finalized a reinsurance-to-close transaction with AXIS Managing Agency Limited (“AXIS”) under which Enstar's Syndicate 2008 will reinsure to close the 2015 and prior underwriting years of account of Novae Syndicate 2007.\nEnstar will assume net reinsurance reserves of approximately £600 million (approximately $811 million) relating to the portfolio and gross reserves of approximately £840 million (approximately $1,136 million) effective January 1, 2018.\nCommenting on the transaction, Dominic Silvester, Enstar's Chief Executive Officer, said:\n“As one of several reinsurance-to-close transactions undertaken by Enstar recently - one of the largest transactions of its type in recent years - the Novae deal underlines Enstar’s capability as a leading reinsurance-to-close provider. By working closely with the Novae and AXIS teams, we were able to complete this significant transaction, highlighting our ability to efficiently enable our partners to restructure their liabilities, improve their capital position and strengthen their businesses.”\nAbout Enstar\nEnstar is a multi-faceted insurance group, with over $14 billion in assets, which offers innovative capital release solutions and specialty underwriting capabilities through its network of group companies in Bermuda, the United States, the United Kingdom, Continental Europe, Australia, and other international locations. Enstar is a market leader in completing legacy acquisitions, having acquired over 80 companies and portfolios since its formation in 2001. Enstar’s active underwriting businesses include the StarStone group of companies, an A- rated global specialty insurance group with multiple global underwriting platforms, and the Atrium group of companies, which manage and underwrite specialist insurance and reinsurance business for Lloyd’s Syndicate 609. For further information about Enstar, see www.enstargroup.com .\nCautionary Statement\nThis press release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements include statements regarding the intent, belief or current expectations of Enstar and its management team. Investors are cautioned that any such forward-looking statements speak only as of the date they are made, are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those projected in the forward-looking statements as a result of various factors. Important risk factors regarding Enstar can be found under the heading \"Risk Factors\" in Enstar's Form 10-K for the year ended December 31, 2016 and in Enstar’s Form 10-Q for the nine months ended September 30, 2017, and are incorporated herein by reference. Furthermore, Enstar undertakes no obligation to update any written or oral forward-looking statements or publicly announce any updates or revisions to any of the forward-looking statements contained herein, to reflect any change in its expectations with regard thereto or any change in events, conditions, circumstances or assumptions underlying such statements, except as required by law.\nContact: Guy Bowker Telephone: +1 (441) 292-3645\nSource:Enstar Group Limited", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dffdd7cb-b81e-4ec3-9846-675607b74c80"], "published": "2018-01-29T15:00:00.000+02:00", "crawled": "2018-01-29T16:52:27.015+02:00", "highlightTitle": ""}