{"organizations": [], "uuid": "1dacd727aa4298b64765d720c2baa06e8db08f9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-bank-first-reports-fourth-quarter-2017-net-income-of-3-point-3-million-or-0-point-50-per-share-declares-a-cash-dividend-of-0.html", "country": "US", "domain_rank": 767, "title": "Bank First reports fourth quarter 2017 net income of $3.3 million, or $0.50 per share, declares a cash dividend of $0.16 per share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:00:00.000+02:00", "replies_count": 0, "uuid": "1dacd727aa4298b64765d720c2baa06e8db08f9e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-bank-first-reports-fourth-quarter-2017-net-income-of-3-point-3-million-or-0-point-50-per-share-declares-a-cash-dividend-of-0.html", "ord_in_thread": 0, "title": "Bank First reports fourth quarter 2017 net income of $3.3 million, or $0.50 per share, declares a cash dividend of $0.16 per share", "locations": [], "entities": {"persons": [], "locations": [{"name": "wis.", "sentiment": "none"}], "organizations": [{"name": "manitowoc", "sentiment": "neutral"}, {"name": "bank first", "sentiment": "neutral"}, {"name": "bank first national corporation", "sentiment": "neutral"}, {"name": "waupaca bancorporation, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANITOWOC, Wis., Jan. 17, 2018 /PRNewswire/ -- Bank First National Corporation (OTC-PINK: BFNC), the holding company for Bank First, reported net income for the fourth quarter of 2017 of $3.3 million, or $0.50 per share, down 7.8% from the same period in 2016. For the year ended December 31, 2017, Bank First earned $15.3 million or $2.44 per share, up 2.7% from the year ended December 31, 2016.\nFourth quarter 2017 net income was adversely impacted by $2.0 million ($1.4 million after tax) in expenses related to the acquisition of Waupaca Bancorporation, Inc. Also, federal tax reform legislation signed in December required the revaluation of the net deferred tax asset to the lower corporate tax rates enacted, resulting in additional income tax expense of $0.6 million. These two nonrecurring expense items reduced fourth quarter earnings per share by $0.31. Without these two items, fourth quarter 2017 earnings per share would have been $0.81, up 40.6% from the same period in 2016.\nNet interest income after provision for loan losses was $14.7 million for the quarter ended December 31, 2017, compared to $9.9 million for the prior year fourth quarter, representing a 48.1% increase year-over-year. For the year ended December 31, 2017, net interest income after provision for loan losses totaled $44.7 million, up 16.1% from $38.5 million for the year ended December 31, 2016.\nNoninterest income was $1.9 million in the fourth quarter of 2017, compared to $2.3 million during the fourth quarter of 2016. Sales and servicing of secondary market mortgage loans saw a decline in 2017, leading to the overall decline in noninterest income. For the year ended December 31, 2017, noninterest income totaled $9.8 million, up 6.5% from the previous year.\nNoninterest expense was $10.4 million in the fourth quarter of 2017, compared to $6.7 million during the fourth quarter of 2016. For the year ended December 31, 2017, noninterest expense was $30.4 million, up 21.1% from $25.1 million in the prior year. Expenses from the acquisition of Waupaca Bancorporation, Inc. made up $2.7 million of this increase year-over-year. The remainder resulted from two months of operations with six added branches from the acquisition as well as normal inflationary increases to most expenses.\n\"We are very proud of the Bank First team, including those added through our Waupaca acquisition, for an extremely well implemented bank acquisition and conversion,\" stated Mike Molepske, Chief Executive Officer. \"With only six months between the announcement and the close of this deal, including converting all operating systems the weekend of the transaction close, we could not have asked for a smoother process.\"\nBank First reported total loan growth of $371.3 million, or 36.2%, and total deposit growth of $379.6 million, or 33.7%, during 2017. This increase was the result of both organic growth and the Waupaca acquisition. Demand deposit accounts continue to represent a significant portion of core deposits, at 29% as of December 31, 2017.\n\"We are very optimistic as we move into 2018,\" continued Molepske. \"We look forward to making a positive impact in the communities we now serve in Waupaca and Barron Counties, as well as continuing this tradition in all of our legacy markets. Our board and management team will continue to explore opportunities in new markets through acquisitions and de novo branch openings, as well as anticipating the potential of becoming a fully public SEC registrant.\"\nThe Corporation's Board of Directors approved a quarterly cash dividend of $0.16 per common share, payable on April 4, 2018, to shareholders of record as of March 28, 2018.\nBank First National Corporation (BFNC) provides financial services through its subsidiary, Bank First National, which was incorporated in 1894. The Bank is an independent community bank with 18 banking locations in Manitowoc, Brown, Sheboygan, Outagamie, Winnebago, Waupaca and Barron counties. The Bank has grown through both acquisitions and de novo branch expansion. The Bank offers loan, deposit and treasury management products at each of its banking offices. Insurance services are available through our bond with Ansay & Associates, LLC. Trust, investment advisory and other financial services are offered through the Bank's partnership with Legacy Private Trust, an alliance with Morgan Stanley and an affiliation with McKenzie Financial Services, LLC. The Bank is a co-member of a data processing subsidiary, UFS, LLC, which provides data services for over 50 Midwest banks. The Company employs approximately 243 full-time equivalent staff and has assets of $1.75 billion as of December 31, 2017. Further information about Bank First National Corporation is available by clicking on the Investor Relations tab at www.BankFirstNational.com .\nFor further information, contact:\nKevin M. LeMahieu, Chief Financial Officer\nPhone: (920) 652-3200\nklemahieu@bankfirstnational.com\nView original content: http://www.prnewswire.com/news-releases/bank-first-reports-fourth-quarter-2017-net-income-of-33-million-or-050-per-share-declares-a-cash-dividend-of-016-per-share-300584004.html\nSOURCE Bank First National Corporation", "external_links": ["http://www.prnewswire.com/news-releases/bank-first-reports-fourth-quarter-2017-net-income-of-33-million-or-050-per-share-declares-a-cash-dividend-of-016-per-share-300584004.html", "http://www.bankfirstnational.com/"], "published": "2018-01-17T20:00:00.000+02:00", "crawled": "2018-01-17T21:27:05.001+02:00", "highlightTitle": ""}