{"organizations": [], "uuid": "9a5dd76636e36f0f9fb33b5999f6a147ff132cab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 56, "shares": 56, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-905729408.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/nestle-confectionary-ferrero-sale/", "country": "US", "domain_rank": 1196, "title": "Nestle Is Selling Its U.S. Candy Business to Italy's Ferrero | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.662, "site_type": "news", "published": "2018-01-17T22:51:00.000+02:00", "replies_count": 0, "uuid": "9a5dd76636e36f0f9fb33b5999f6a147ff132cab"}, "author": "Reuters", "url": "http://fortune.com/2018/01/16/nestle-confectionary-ferrero-sale/", "ord_in_thread": 0, "title": "Nestle Is Selling Its U.S. Candy Business to Italy's Ferrero | Fortune", "locations": [], "entities": {"persons": [{"name": "butterfi", "sentiment": "negative"}, {"name": "lindt", "sentiment": "none"}, {"name": "ferrero rocher", "sentiment": "none"}, {"name": "hershey", "sentiment": "none"}, {"name": "mark schneider", "sentiment": "none"}, {"name": "ferrero", "sentiment": "none"}, {"name": "joe raedle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "ferrero nestle", "sentiment": "negative"}, {"name": "ferrero | fortune nestle nestle", "sentiment": "negative"}, {"name": "nestle", "sentiment": "negative"}, {"name": "euromonitor international", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nestle Nestle Is Selling Its U.S. Candy Business to Italy's Ferrero Nestle Butterfinger and Butterfinger Cups are seen on a store shelf, on Jan. 16, 2018 in Miami, Florida. Joe Raedle—Getty Images By Reuters 8:51 PM EST \nSwiss food group Nestle (nsrgy) has agreed to sell its U.S. confectionery business to Italy’s Ferrero for $2.8 billion, it said on Tuesday, marking CEO Mark Schneider’s first big sale and a small step on its path towards healthier products. \nNestle, the world’s biggest packaged-food company, has cited the unit’s weak position in the United States, where it trails Hershey (hsy) , Mars (mars) and Lindt, as the rationale for a sale. \nFor family-owned Ferrero, the cash deal offers a chance for the Italian company to build scale quickly in that key market, where it has done two other deals in the past year. \nThe maker of Nutella spread and Ferrero Rocher pralines will become the third-largest chocolate company in the U.S. and globally, according to Euromonitor International. \nFor Nestle, which first sold milk chocolate in the 1880s, a consumer shift away from junk and sugary foods has led the Swiss company to focus on “nutrition, health and wellness,” although it says it is committed to its non-U.S. confectionery business. \nHowever, bankers and analysts have speculated that it could dispose of other weak brands, or even step away from candy altogether by forming a joint venture as it recently did in ice cream. Hershey, which owns Nestle‘s KitKat brand in the United States, would be the obvious partner, one banker said. \nTuesday’s deal only accounts for about 1% of Nestle‘s sales, but is part of a larger shake-up by chief executive Schneider, a healthcare industry veteran one year into the job. \nSchneider has been tasked with accelerating Nestle‘s growth strategy in an increasingly tough environment for multinational food companies due to slowing growth and greater competition from niche, upstart brands. \nNestle‘s mass-market chocolate bars, such as BabyRuth, Butterfinger and Crunch, have underperformed rivals for years as consumers have turned towards healthier snacks such as fruit bars and premium chocolate brands such as Lindt. \nNestle said last week it was selling Australian chocolate bar Violet Crumble. The company is expanding into consumer health, bidding for the vitamin and supplements business being sold by Germany’s Merck after agreeing last month to buy vitamin maker Atrium Innovations. \n“The switch of assets makes a lot of sense,” Vontobel analyst Jean-Philippe Bertschy said of the moves out of U.S. chocolate and into vitamins. “You’re going out of a weak business in terms of financials and … entering a market with strong growth and higher margins. \nNestle paid $2.3 billion for Atrium, which has about $700 million in annual sales. The chocolate business, which it is selling for $2.8 billion, has about $900 million in sales. \nLiberum analyst Robert Waldschmidt estimates the deal represents a multiple of roughly 20.7 times earnings before interest, tax, depreciation and amortization, which he said “feels like quite a top multiple.” \nWaldschmidt pointed to the recent sale of Reckitt Benckiser’s food business, which is higher margin, at 20.3 times EBITDA. \nThird Point, the U.S.-based hedge fund that has pushed Nestle to boost returns, was not immediately available to comment. Chocolate woes \nThe United States accounts for nearly 19% of a global chocolate market worth $102.3 billion at retail, according to Euromonitor. The value of the market has been buoyed by people increasingly choosing more expensive treats, but volume has been weighed down by the popularity of other alternatives. \nNestle has lost market share in recent years, as start-up brands like Kind have grown quickly. \nEven Lindt, whose Lindor chocolate balls command premium prices, has felt the pain, reporting on Tuesday that 2017 organic sales rose only 3.7%, below its long-term target of 6% to 8%. Sales in North America fell 1.6%. \nFerrero was advised by Credit Suisse and Lazard while Davis Polk and Wardwell acted as its legal adviser. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T22:51:00.000+02:00", "crawled": "2018-01-17T05:02:10.040+02:00", "highlightTitle": ""}