{"organizations": [], "uuid": "fef9988edf456e73279d712399b7ba3e13f771d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-johnson-controls-reports-first-quarter-earnings-and-re-affirms-full-year-guidance.html", "country": "US", "domain_rank": 767, "title": "Johnson Controls reports first quarter earnings and re-affirms full year guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:55:00.000+02:00", "replies_count": 0, "uuid": "fef9988edf456e73279d712399b7ba3e13f771d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-johnson-controls-reports-first-quarter-earnings-and-re-affirms-full-year-guidance.html", "ord_in_thread": 0, "title": "Johnson Controls reports first quarter earnings and re-affirms full year guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "johnson controls international plc", "sentiment": "negative"}, {"name": "jci", "sentiment": "negative"}, {"name": "johnson controls", "sentiment": "negative"}, {"name": "cork", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "scott safety", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CORK, Ireland, Jan. 31, 2018 /PRNewswire/ -- Johnson Controls International plc (NYSE: JCI) today reported fiscal first quarter 2018 GAAP earnings per share (\"EPS\") from continuing operations, including special items, of $0.25. Excluding these items, adjusted EPS from continuing operations was $0.54, up 2% versus the prior year period (see attached footnotes for non-GAAP reconciliation).\nSales of $7.4 billion increased 5% compared to the prior year. Excluding the impacts of M&A, foreign exchange and changes in lead prices, total sales grew 3% organically.\nGAAP earnings before interest and taxes (\"EBIT\") was $654 million and the EBIT margin was 8.8%. Adjusted EBIT was $748 million and adjusted EBIT margin of 10.1% includes a 30 basis point headwind related to the divestiture of Scott Safety, foreign exchange and lead prices.\n\"Despite anticipated margin pressure in the quarter, we were able to deliver earnings growth. We are seeing solid traction around our efforts to increase sales capacity and gross margins on orders are beginning to improve, both of which support our confidence in delivering fiscal 2018 adjusted earnings per share guidance of $2.75 to $2.85,\" said George Oliver, Johnson Controls chairman & CEO.\n\"Additionally, we continue to strive for increased accountability and improved execution. During the quarter, we nominated two highly accomplished female executives to our Board, and more closely aligned executive compensation incentives with shareholder expectations and improved financial performance. We remain intensely focused on improving the cash generation potential of the Company, both near and long-term, while at the same time achieving our cost synergy and productivity targets,\" Oliver added.\nU.S. Tax Reform\nIn connection with the passage of U.S. Tax Reform during the quarter, the Company recorded a provisionally estimated one-time net tax charge of approximately $200 million. This was comprised of a non-cash benefit of approximately $100 million, related to the remeasurement of the Company's net U.S. deferred tax liabilities and a one-time tax charge of approximately $300 million based on the preliminary estimate of income taxes on unremitted foreign earnings, payable over an 8-year period in accordance with the new legislation. The Company continues to expect a 14% adjusted effective tax rate in fiscal 2018. As certain other provisions of the new legislation become effective for the Company in fiscal 2019, the effective tax rate is expected to increase to 16 to 18%.\nIncome and EPS amounts attributable to Johnson Controls ordinary shareholders\n($ millions, except per-share amounts)\nThe financial highlights presented in the tables below are in accordance with GAAP, unless otherwise indicated. All comparisons are to the first quarter of 2017. The spin-off of Adient plc occurred on Oct. 31, 2016 and the results of this business are reported in discontinued operations for all historical periods presented.\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$7,086\n$7,435\n$7,096\n$7,435\n+5%\nSegment EBITA\n824\n1,040\n968\n943\n(3%)\nEBIT\n521\n654\n757\n748\n(1%)\nNet income from continuing operations\n372\n230\n502\n502\n-\nDiluted EPS from continuing operations\n$0.39\n$0.25\n$0.53\n$0.54\n+2%\nOrganic sales growth, adjusted segment EBITA, adjusted EBIT, adjusted EPS from continuing operations and adjusted free cash flow are non-GAAP financial measures. For a reconciliation of these non-GAAP measures and detail of the special items, refer to the attached footnotes. A slide presentation reviewing first quarter results can be found in the Investor Relations section of Johnson Controls' website at http://investors.johnsoncontrols.com .\nBUSINESS RESULTS\nBuilding Solutions North America\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$1,942\n$2,012\n$1,942\n$2,012\n+4%\nSegment EBITA\n$196\n$227\n$236\n$236\n-\nSegment EBITA margin %\n10.1%\n11.3%\n12.2%\n11.7%\n(50bps)\nSales in the first quarter of 2018 were $2.0 billion, an increase of 4% versus the prior year quarter. Excluding M&A and foreign exchange, organic sales increased 3% versus the prior year driven by growth in HVAC and Controls.\nOrders in the quarter, excluding M&A and adjusted for foreign exchange, increased 4% year-over-year. Backlog at the end of the quarter of $5.3 billion was 4% higher year-over-year, excluding M&A and adjusted for foreign exchange.\nAdjusted segment EBITA was $236 million, consistent with the prior year. Adjusted segment EBITA margin of 11.7% declined 50 basis points over the prior year as the benefit of cost synergies and productivity savings, as well as volume leverage, were more than offset by expected low margin backlog conversion and salesforce additions.\nBuilding Solutions EMEA/LA (Europe, Middle East, Africa/Latin America)\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$875\n$915\n$878\n$915\n+4%\nSegment EBITA\n$49\n$69\n$65\n$71\n+9%\nSegment EBITA margin %\n5.6%\n7.5%\n7.4%\n7.8%\n+40bps\nSales in the first quarter of 2018 were $915 million, an increase of 4% versus the prior year quarter. Excluding M&A and foreign exchange, organic sales also increased 4% versus the prior year driven by strong growth in the Middle East & Africa and the Latin America regions.\nOrders in the quarter, excluding M&A and adjusted for foreign exchange, increased 6% year-over-year. Backlog at the end of the quarter of $1.4 billion increased 1% year-over-year, excluding M&A and adjusted for foreign exchange.\nAdjusted segment EBITA was $71 million, up 9% versus the prior year. Adjusted segment EBITA margin of 7.8% improved 40 basis points over the prior year driven by cost synergies and productivity savings, as well as volume leverage.\nBuilding Solutions Asia Pacific\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$575\n$597\n$576\n$597\n+4%\nSegment EBITA\n$63\n$74\n$72\n$74\n+3%\nSegment EBITA margin %\n11.0%\n12.4%\n12.5%\n12.4%\n(10bps)\nSales in the first quarter of 2018 were $597 million, an increase of 4% versus the prior year quarter. Excluding M&A and foreign exchange, organic sales increased 2% versus the prior year driven by strong growth in service.\nOrders in the quarter, excluding M&A and adjusted for foreign exchange, increased 9% year-over-year. Backlog at the end of the quarter of $1.4 billion was 11% higher year-over-year, excluding M&A and adjusted for foreign exchange.\nAdjusted segment EBITA was $74 million, up 3% versus the prior year. Adjusted segment EBITA margin of 12.4% declined 10 basis points over the prior year, including a 30 basis point headwind related to foreign exchange. Adjusting for foreign exchange, the underlying margin improved 20 basis points driven by the benefit of cost synergies and productivity savings, as well as volume leverage, partially offset by pricing pressure in China.\nGlobal Products\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$1,794\n$1,781\n$1,800\n$1,781\n(1%)\nSegment EBITA\n$127\n$286\n$205\n$178\n(13%)\nSegment EBITA margin %\n7.1%\n16.1%\n11.4%\n10.0%\n(140bps)\nSales in the first quarter of 2018 were $1.8 billion, a decrease of 1% versus the prior year quarter. Excluding M&A and foreign exchange, organic sales increased 6% versus the prior year driven by mid-single digit growth across Building Management, HVAC and Refrigeration Equipment, and Specialty Products.\nAdjusted segment EBITA was $178 million, a 13% decline versus the prior year primarily attributable to the impact of the Scott Safety divestiture. Adjusted segment EBITA margin of 10.0% declined 140 basis points over the prior year including a 110 basis point headwind related to the divestiture of the Scott Safety business. The underlying margin declined 30 basis points as the benefit of cost synergies and productivity savings, as well as volume leverage, was more than offset by planned product and channel investments and expected price/cost pressure.\nPower Solutions\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nSales\n$1,900\n$2,130\n$1,900\n$2,130\n+12%\nSegment EBITA\n$389\n$384\n$390\n$384\n(2%)\nSegment EBITA margin %\n20.5%\n18.0%\n20.5%\n18.0%\n(250bps)\nSales in the first quarter of 2018 were $2.1 billion, an increase of 12% versus the prior year. Excluding the impact of higher lead pass-through and foreign exchange, organic sales grew 1% versus the prior year as favorable technology mix more than offset lower unit volumes. Global original equipment battery shipments declined 1% and aftermarket shipments declined 2% compared to the prior year. Start-stop battery shipments increased 20% year-over-year, led by growth in China and the Americas.\nPower Solutions adjusted segment EBITA was $384 million, a 2% decline compared to the prior year, as favorable product mix and productivity benefits were more than offset by higher transportation costs and planned incremental investments. Adjusted segment EBITA margin of 18.0% decreased 250 basis points compared with the prior year, including a 150 basis point headwind related to the impact of foreign exchange and lead, and a decrease of 100 basis points primarily due to higher transportation costs and planned investments.\nCorporate\nGAAP\nGAAP\nAdjusted\nAdjusted\nQ1 2017\nQ1 2018\nQ1 2017\nQ1 2018\nChange\nCorporate expense\n($193)\n($134)\n($108)\n($101)\n(6%)\nAdjusted Corporate expense was $101 million in the first quarter, a decrease of 6% compared to the prior year driven primarily by cost synergies and productivity initiatives.\nOTHER ITEMS\nDuring the quarter, the Company repurchased 3.6 million shares for approximately $150 million. The sale of the Scott Safety business to 3M closed on Oct. 4, 2017. The net cash proceeds from the transaction of approximately $1.9 billion were used to repay a portion of the Tyco International Holding Sarl's (\"TSarl\") $4.0 billion merger-related debt. During the quarter, the Company issued €750 million, 0.0% Senior Notes due 2020. Additionally, the Company repaid a $300 million bond and a €150 million loan. For the quarter, cash from operating activities was a cash outflow of $0.1 billion. Adjusted free cash outflow was $0.3 billion for the quarter, in-line with normal seasonality. Adjusted free cash flow excludes net cash outflows of $0.1 billion primarily related to integration costs. The Company nominated Gretchen R. Haggerty, former Executive Vice President & Chief Financial Officer of United States Steel Corporation, and Simone Menne, former Chief Financial Officer at Boehringer Ingelheim GmbH to the Board of Directors. Both Gretchen and Simone have extensive senior leadership experience and deep financial acumen. In addition, the Board has addressed various corporate governance areas, including executive compensation, which are outlined in the Company's recently filed proxy.\nAbout Johnson Controls:\nJohnson Controls is a global diversified technology and multi industrial leader serving a wide range of customers in more than 150 countries. Our 120,000 employees create intelligent buildings, efficient energy solutions, integrated infrastructure and next generation transportation systems that work seamlessly together to deliver on the promise of smart cities and communities. Our commitment to sustainability dates back to our roots in 1885, with the invention of the first electric room thermostat. We are committed to helping our customers win and creating greater value for all of our stakeholders through strategic focus on our buildings and energy growth platforms. For additional information, please visit http://www.johnsoncontrols.com or follow us @johnsoncontrols on Twitter.\nJohnson Controls International plc Cautionary Statement Regarding Forward-Looking Statements\nJohnson Controls International plc has made statements in this communication that are forward-looking and therefore are subject to risks and uncertainties. All statements in this document other than statements of historical fact are, or could be, \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In this communication, statements regarding Johnson Controls' future financial position, sales, costs, earnings, cash flows, other measures of results of operations, synergies and integration opportunities, capital expenditures and debt levels are forward-looking statements. Words such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe,\" \"should,\" \"forecast,\" \"project\" or \"plan\" and terms of similar meaning are also generally intended to identify forward-looking statements. However, the absence of these words does not mean that a statement is not forward-looking. Johnson Controls cautions that these statements are subject to numerous important risks, uncertainties, assumptions and other factors, some of which are beyond Johnson Controls' control, that could cause Johnson Controls' actual results to differ materially from those expressed or implied by such forward-looking statements, including, among others, risks related to: any delay or inability of Johnson Controls to realize the expected benefits and synergies of recent portfolio transactions such as the merger with Tyco and the spin-off of Adient, changes in tax laws (including but not limited to the recently enacted Tax Cuts and Jobs Act), regulations, rates, policies or interpretations, the loss of key senior management, the tax treatment of recent portfolio transactions, significant transaction costs and/or unknown liabilities associated with such transactions, the outcome of actual or potential litigation relating to such transactions, the risk that disruptions from recent transactions will harm Johnson Controls' business, the strength of the U.S. or other economies, automotive vehicle production levels, mix and schedules, energy and commodity prices, the availability of raw materials and component products, currency exchange rates, and cancellation of or changes to commercial arrangements. A detailed discussion of risks related to Johnson Controls' business is included in the section entitled \"Risk Factors\" in Johnson Controls' Annual Report on Form 10-K for the 2017 year filed with the SEC on November 21, 2017, and available at www.sec.gov and www.johnsoncontrols.com under the \"Investors\" tab. Shareholders, potential investors and others should consider these factors in evaluating the forward-looking statements and should not place undue reliance on such statements. The forward-looking statements included in this communication are made only as of the date of this document, unless otherwise specified, and, except as required by law, Johnson Controls assumes no obligation, and disclaims any obligation, to update such statements to reflect events or circumstances occurring after the date of this communication.\nNon-GAAP Financial Information\nThe Company's press release contains financial information regarding adjusted earnings per share, which is a non-GAAP performance measure. The adjusting items include mark-to-market for pension and postretirement plans, transaction/integration/separation costs, restructuring and impairment costs, nonrecurring purchase accounting impacts related to the Tyco merger, Scott Safety gain on sale and discrete tax items. Financial information regarding adjusted sales, organic sales, adjusted segment EBITA, adjusted segment EBITA margin and adjusted free cash flow are also presented, which are non-GAAP performance measures. Adjusted segment EBITA excludes special items such as transaction/integration/separation costs and nonrecurring purchase accounting impacts because these costs are not considered to be directly related to the underlying operating performance of its business units. Management believes that, when considered together with unadjusted amounts, these non-GAAP measures are useful to investors in understanding period-over-period operating results and business trends of the Company. Management may also use these metrics as guides in forecasting, budgeting and long-term planning processes and for compensation purposes. These metrics should be considered in addition to, and not as replacements for, the most comparable GAAP measure.\nCONTACT:\nInvestors:\nAntonella Franzen\n(609) 720-4665\nRyan Edelman\n(609) 720-4545\nMedia :\nFraser Engerman\n(414) 524-2733\nJOHNSON CONTROLS INTERNATIONAL PLC\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share data; unaudited)\nThree Months Ended December 31,\n2017\n2016\nNet sales\n$ 7,435\n$ 7,086\nCost of sales\n5,266\n4,972\nGross profit\n2,169\n2,114\nSelling, general and administrative expenses\n(1,417)\n(1,570)\nRestructuring and impairment costs\n(158)\n(78)\nNet financing charges\n(116)\n(136)\nEquity income\n60\n55\nIncome from continuing operations before income taxes\n538\n385\nIncome tax provision (benefit)\n267\n(27)\nIncome from continuing operations\n271\n412\nLoss from discontinued operations, net of tax\n-\n(34)\nNet income\n271\n378\nLess: Income from continuing operations attributable to noncontrolling interests\n41\n40\nLess: Income from discontinued operations attributable to noncontrolling interests\n-\n9\nNet income attributable to JCI\n$ 230\n$ 329\nIncome from continuing operations\n$ 230\n$ 372\nLoss from discontinued operations\n-\n(43)\nNet income attributable to JCI\n$ 230\n$ 329\nDiluted earnings per share from continuing operations\n$ 0.25\n$ 0.39\nDiluted loss per share from discontinued operations\n-\n(0.05)\nDiluted earnings per share *\n$ 0.25\n$ 0.35\nDiluted weighted average shares\n933.3\n947.4\nShares outstanding at period end\n926.1\n938.7\n* May not sum due to rounding.\nJOHNSON CONTROLS INTERNATIONAL PLC\nCONDENSED CONSOLIDATED STATEMENTS OF FINANCIAL POSITION\n(in millions; unaudited)\nDecember 31,\nSeptember 30,\n2017\n2017\nASSETS\nCash and cash equivalents\n$ 552\n$ 321\nAccounts receivable - net\n6,731\n6,666\nInventories\n3,459\n3,209\nAssets held for sale\n40\n189\nOther current assets\n1,647\n1,907\nCurrent assets\n12,429\n12,292\nProperty, plant and equipment - net\n6,105\n6,121\nGoodwill\n19,717\n19,688\nOther intangible assets - net\n6,657\n6,741\nInvestments in partially-owned affiliates\n1,219\n1,191\nNoncurrent assets held for sale\n-\n1,920\nOther noncurrent assets\n3,640\n3,931\nTotal assets\n$ 49,767\n$ 51,884\nLIABILITIES AND EQUITY\nShort-term debt and current portion of long-term debt\n$ 1,605\n$ 1,608\nAccounts payable and accrued expenses\n4,903\n5,342\nLiabilities held for sale\n-\n72\nOther current liabilities\n4,738\n4,832\nCurrent liabilities\n11,246\n11,854\nLong-term debt\n10,895\n11,964\nOther noncurrent liabilities\n5,900\n6,315\nNoncurrent liabilities held for sale\n-\n173\nRedeemable noncontrolling interests\n226\n211\nShareholders' equity attributable to JCI\n20,535\n20,447\nNoncontrolling interests\n965\n920\nTotal liabilities and equity\n$ 49,767\n$ 51,884\nJOHNSON CONTROLS INTERNATIONAL PLC\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nThree Months Ended December 31,\n2017\n2016\nOperating Activities\nNet income attributable to JCI\n$ 230\n$ 329\nIncome from continuing operations attributable to noncontrolling interests\n41\n40\nIncome from discontinued operations attributable to noncontrolling interests\n-\n9\nNet income\n271\n378\nAdjustments to reconcile net income to cash used by operating activities:\nDepreciation and amortization\n272\n346\nPension and postretirement benefit income\n(36)\n(155)\nPension and postretirement contributions\n(24)\n(247)\nEquity in earnings of partially-owned affiliates, net of dividends received\n(36)\n(64)\nDeferred income taxes\n(79)\n580\nNon-cash restructuring and impairment costs\n30\n16\nGain on business divestiture\n(114)\n-\nOther - net\n17\n37\nChanges in assets and liabilities, excluding acquisitions and divestitures:\nAccounts receivable\n(30)\n37\nInventories\n(233)\n(142)\nOther assets\n64\n(87)\nRestructuring reserves\n93\n20\nAccounts payable and accrued liabilities\n(623)\n(796)\nAccrued income taxes\n299\n(1,808)\nCash used by operating activities\n(129)\n(1,885)\nInvesting Activities\nCapital expenditures\n(230)\n(371)\nSale of property, plant and equipment\n5\n2\nAcquisition of businesses, net of cash acquired\n-\n(3)\nBusiness divestitures, net of cash divested\n2,011\n47\nOther - net\n(12)\n(6)\nCash provided (used) by investing activities\n1,774\n(331)\nFinancing Activities\nIncrease (decrease) in short and long-term debt - net\n(1,045)\n556\nDebt financing costs\n(4)\n(6)\nStock repurchases\n(150)\n-\nPayment of cash dividends\n(232)\n-\nProceeds from the exercise of stock options\n16\n29\nDividends paid to noncontrolling interests\n-\n(31)\nDividend from Adient spin-off\n-\n2,050\nCash transferred to Adient related to spin-off\n-\n(564)\nCash paid related to prior acquisitions\n-\n(45)\nOther - net\n(25)\n(25)\nCash provided (used) by financing activities\n(1,440)\n1,964\nEffect of exchange rate changes on cash and cash equivalents\n17\n(55)\nChange in cash held for sale\n9\n105\nIncrease (decrease) in cash and cash equivalents\n$ 231\n$ (202)\nFOOTNOTES\n1. Financial Summary\nThe Company evaluates the performance of its business units primarily on segment earnings before interest, taxes and amortization (EBITA), which represents income from continuing operations before income taxes and noncontrolling interests, excluding general corporate expenses, intangible asset amortization, net financing charges, significant restructuring and impairment costs, and the net mark-to-market adjustments related to pension and postretirement plans.\n(in millions; unaudited)\nThree Months Ended December 31,\n2017\n2016\nActual\nAdjusted Non-GAAP\nActual\nAdjusted Non-GAAP\nNet sales (1)\nBuilding Solutions North America\n$2,012\n$ 2,012\n$1,942\n$ 1,942\nBuilding Solutions EMEA/LA\n915\n915\n875\n878\nBuilding Solutions Asia Pacific\n597\n597\n575\n576\nGlobal Products\n1,781\n1,781\n1,794\n1,800\nTotal Building Technologies & Solutions\n5,305\n5,305\n5,186\n5,196\nPower Solutions\n2,130\n2,130\n1,900\n1,900\nNet sales\n$7,435\n$ 7,435\n$7,086\n$ 7,096\nSegment EBITA (1)\nBuilding Solutions North America\n$ 227\n$ 236\n$ 196\n$ 236\nBuilding Solutions EMEA/LA\n69\n71\n49\n65\nBuilding Solutions Asia Pacific\n74\n74\n63\n72\nGlobal Products\n286\n178\n127\n205\nTotal Building Technologies & Solutions\n656\n559\n435\n578\nPower Solutions\n384\n384\n389\n390\nSegment EBITA\n1,040\n943\n824\n968\nCorporate expenses (2)\n(134)\n(101)\n(193)\n(108)\nAmortization of intangible assets (3)\n(94)\n(94)\n(149)\n(103)\nMark-to-market gain for pension plans (4)\n-\n-\n117\n-\nRestructuring and impairment costs (5)\n(158)\n-\n(78)\n-\nEBIT (6)\n654\n748\n521\n757\nNet financing charges (7)\n(116)\n(116)\n(136)\n(119)\nIncome from continuing operations before income taxes\n538\n632\n385\n638\nIncome tax benefit (provision) (8)\n(267)\n(89)\n27\n(96)\nIncome from continuing operations\n271\n543\n412\n542\nIncome from continuing operations attributable to\nnoncontrolling interests\n(41)\n(41)\n(40)\n(40)\nNet income from continuing operations attributable to JCI\n$ 230\n$ 502\n$ 372\n$ 502\nBuilding Technologies & Solutions- Provides facility systems and services including comfort, energy and security management for the non-residential buildings market, and provides heating, ventilating, and air conditioning products and services, security products and services, and fire detection and suppression products and services.\nPower Solutions- Services both automotive original equipment manufacturers and the battery aftermarket by providing advanced battery technology, coupled with systems engineering, marketing and service expertise.\n(1) The Company's press release contains financial information regarding adjusted net sales, adjusted segment EBITA and adjusted segment EBITA margins, which are non-GAAP performance measures. The Company's definition of adjusted segment EBITA excludes special items because these costs are not considered to be directly related to the underlying operating performance of its business units. Management believes these non-GAAP measures are useful to investors in understanding the ongoing operations and business trends of the Company.\nThe following is the three months ended December 31, 2017 and 2016 reconciliation of net sales, segment EBITA and segment EBITA margin as reported to adjusted net sales, adjusted segment EBITA and adjusted segment EBITA margin (unaudited):\n(in millions)\nBuilding Solutions North America\nBuilding Solutions EMEA/LA\nBuilding Solutions\nAsia Pacific\nGlobal Products\nTotal Building Technologies & Solutions\nPower Solutions\nConsolidated JCI plc\n2017\n2016\n2017\n2016\n2017\n2016\n2017\n2016\n2017\n2016\n2017\n2016\n2017\n2016\nNet sales as reported\n$ 2,012\n$1,942\n$ 915\n$ 875\n$ 597\n$ 575\n$ 1,781\n$ 1,794\n$ 5,305\n$ 5,186\n$ 2,130\n$ 1,900\n$ 7,435\n$ 7,086\nAdjusting items:\nNonrecurring purchase accounting impacts\n-\n-\n-\n3\n-\n1\n-\n6\n-\n10\n-\n-\n-\n10\nAdjusted net sales\n$ 2,012\n$1,942\n$ 915\n$ 878\n$ 597\n$ 576\n$ 1,781\n$ 1,800\n$ 5,305\n$ 5,196\n$ 2,130\n$ 1,900\n$ 7,435\n$ 7,096\nSegment EBITA as reported\n$ 227\n$ 196\n$ 69\n$ 49\n$ 74\n$ 63\n$ 286\n$ 127\n$ 656\n$ 435\n$ 384\n$ 389\n$ 1,040\n$ 824\nSegment EBITA margin as reported\n11.3%\n10.1%\n7.5%\n5.6%\n12.4%\n11.0%\n16.1%\n7.1%\n12.4%\n8.4%\n18.0%\n20.5%\n14.0%\n11.6%\nAdjusting items:\nTransaction costs\n-\n10\n-\n2\n-\n2\n-\n3\n-\n17\n-\n1\n-\n18\nIntegration costs\n9\n7\n2\n2\n-\n1\n6\n4\n17\n14\n-\n-\n17\n14\nScott Safety gain on sale\n-\n-\n-\n-\n-\n-\n(114)\n-\n(114)\n-\n-\n-\n(114)\n-\nNonrecurring purchase accounting impacts\n-\n23\n-\n12\n-\n6\n-\n71\n-\n112\n-\n-\n-\n112\nAdjusted segment EBITA\n$ 236\n$ 236\n$ 71\n$ 65\n$ 74\n$ 72\n$ 178\n$ 205\n$ 559\n$ 578\n$ 384\n$ 390\n$ 943\n$ 968\nAdjusted segment EBITA margin\n11.7%\n12.2%\n7.8%\n7.4%\n12.4%\n12.5%\n10.0%\n11.4%\n10.5%\n11.1%\n18.0%\n20.5%\n12.7%\n13.6%\n(2) Adjusted Corporate expenses for the three months ended December 31, 2017 excludes $28 million of integration costs and $5 million of transaction costs. Adjusted Corporate expenses for the three months ended December 31, 2016 excludes $50 million of integration costs, $31 million of transaction costs and $4 million of separation costs.\n(3) Adjusted amortization of intangible assets for the three months ended December 31, 2016 excludes $46 million of nonrecurring asset amortization related to Tyco purchase accounting.\n(4) The three months ended December 31, 2016 pension and postretirement mark-to-market gain of $117 million due to lump sum payouts for certain U.S. pension plans in the quarter is excluded from the adjusted non-GAAP results.\n(5) Restructuring and impairment costs for the three months ended December 31, 2017 and 2016 of $158 million and $78 million, respectively, are excluded from the adjusted non-GAAP results.\n(6) Management defines earnings before interest and taxes (EBIT) as income from continuing operations before net financing charges, income taxes and noncontrolling interests.\n(7) Adjusted net financing charges for the three months ended December 31, 2016 exclude $17 million of transaction costs related to the debt exchange offers.\n(8) Adjusted income tax provision for the three months ended December 31, 2017 excludes the net tax provision related to the U.S. Tax Reform legislation of $204 million and the Scott Safety gain on sale of $30 million, partially offset by the tax benefits for tax audit settlements of $25 million, restructuring and impairment costs of $24 million, integration costs of $6 million and transaction costs of $1 million. Adjusted income tax provision for the three months ended December 31, 2016 excludes the tax benefits of changes in entity tax status of $101 million, Tyco nonrecurring purchase accounting impacts of $43 million, restructuring and impairment costs of $14 million, integration costs of $7 million and transaction costs of $4 million, partially offset by the tax provision for gain on mark-to-market pension of $46 million.\n2. Diluted Earnings Per Share Reconciliation\nThe Company's press release contains financial information regarding adjusted earnings per share, which is a non-GAAP performance measure. The adjusting items include transaction/integration/separation costs, nonrecurring purchase accounting impacts related to the Tyco merger, mark-to-market gain or loss for pension and postretirement plans, Scott Safety gain on sale, restructuring and impairment costs and discrete tax items. The Company excludes these items because they are not considered to be directly related to the underlying operating performance of the Company. Management believes these non-GAAP measures are useful to investors in understanding the ongoing operations and business trends of the Company.\nA reconciliation of diluted earnings per share as reported to diluted adjusted earnings per share for the respective periods is shown below (unaudited):\nNet Income Attributable to JCI plc\nNet Income Attributable to JCI plc from Continuing Operations\nThree Months Ended\nThree Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nEarnings per share as reported for JCI plc\n$ 0.25\n$ 0.35\n$ 0.25\n$ 0.39\nAdjusting items:\nTransaction costs\n0.01\n0.07\n0.01\n0.07\nIntegration costs\n0.05\n0.07\n0.05\n0.07\nRelated tax impact\n(0.01)\n(0.01)\n(0.01)\n(0.01)\nSeparation costs\n-\n0.09\n-\n-\nNonrecurring purchase accounting impacts\n-\n0.17\n-\n0.17\nRelated tax impact\n-\n(0.05)\n-\n(0.05)\nMark-to-market gain for pension plans\n-\n(0.12)\n-\n(0.12)\nRelated tax impact\n-\n0.05\n-\n0.05\nScott Safety gain on sale\n(0.12)\n-\n(0.12)\n-\nRelated tax impact\n0.03\n-\n0.03\n-\nRestructuring and impairment costs\n0.17\n0.08\n0.17\n0.08\nRelated tax impact\n(0.03)\n(0.01)\n(0.03)\n(0.01)\nDiscrete tax items\n0.19\n(0.08)\n0.19\n(0.11)\nAdjusted earnings per share for JCI plc*\n$ 0.54\n$ 0.59\n$ 0.54\n$ 0.53\n* May not sum due to rounding.\nThe following table reconciles the denominators used to calculate basic and diluted earnings per share for JCI plc (in millions; unaudited):\nThree Months Ended\nDecember 31,\n2017\n2016\nWeighted Average Shares Outstanding for JCI plc\nBasic weighted average shares outstanding\n926.1\n937.2\nEffect of dilutive securities:\nStock options, unvested restricted stock and unvested performance share awards\n7.2\n10.2\nDiluted weighted average shares outstanding\n933.3\n947.4\nThe Company has presented forward-looking statements regarding adjusted EPS from continuing operations, adjusted EBIT margin, organic adjusted net sales growth and adjusted free cash flow conversion (defined as adjusted free cash flow divided by adjusted net income from continuing operations attributable to JCI) for the full fiscal year of 2018, which are non-GAAP financial measures. These non-GAAP financial measures are derived by excluding certain amounts, expenses, income or cash flows from the corresponding financial measures determined in accordance with GAAP. The determination of the amounts that are excluded from these non-GAAP financial measures are a matter of management judgment and depends upon, among other factors, the nature of the underlying expense or income amounts recognized in a given period, including but not limited to the high variability of the net mark-to-market adjustments related to pension and postretirement plans and the effect of foreign currency exchange fluctuations. Our fiscal 2018 outlook for organic adjusted net sales growth also excludes the effect of acquisitions and divestitures, and for our Power Solutions business, the impacts of lead price fluctuations. We are unable to present a quantitative reconciliation of the aforementioned forward-looking non-GAAP financial measures to their most directly comparable forward-looking GAAP financial measures because such information is not available and management cannot reliably predict all of the necessary components of such GAAP measures without unreasonable effort or expense. The unavailable information could have a significant impact on the Company's full year 2018 GAAP financial results.\n3. Organic Adjusted Net Sales Growth Reconciliation\nThe components of the changes in adjusted net sales for the three months ended December 31, 2017 versus the three months ended December 31, 2016, including organic net sales, is shown below (unaudited):\n(in millions)\nAdjusted Net Sales\nfor the Three\nMonths Ended\nDecember 31, 2016\nBase Year Adjustments -\nDivestitures\nAdjusted Base Net\nSales for the Three Months Ended\nDecember 31, 2016\nForeign Currency\nLead Impact\nOrganic Net Sales\nAdjusted Net Sales\nfor the Three\nMonths Ended\nDecember 31, 2017\nBuilding Solutions North America\n$ 1,942\n$ -\n0.0%\n$ 1,942\n$ 10\n0.5%\n$ -\n0.0%\n$ 60\n3.1%\n$ 2,012\n3.6%\nBuilding Solutions EMEA/LA\n878\n(43)\n-4.9%\n835\n47\n5.6%\n-\n0.0%\n33\n4.0%\n915\n9.6%\nBuilding Solutions Asia Pacific\n576\n(7)\n-1.2%\n569\n14\n2.5%\n-\n0.0%\n14\n2.5%\n597\n4.9%\nGlobal Products\n1,800\n(138)\n-7.7%\n1,662\n23\n1.4%\n-\n0.0%\n96\n5.8%\n1,781\n7.2%\nTotal Building Technologies & Solutions\n5,196\n(188)\n-3.6%\n5,008\n94\n1.9%\n-\n0.0%\n203\n4.1%\n5,305\n5.9%\nPower Solutions\n1,900\n-\n0.0%\n1,900\n78\n4.1%\n131\n6.9%\n21\n1.1%\n2,130\n12.1%\nTotal net sales\n$ 7,096\n$ (188)\n-2.6%\n$ 6,908\n$ 172\n2.5%\n$ 131\n1.9%\n$ 224\n3.2%\n$ 7,435\n7.6%\n4. Adjusted Free Cash Flow Reconciliation\nThe Company's press release contains financial information regarding free cash flow and adjusted free cash flow, which are non-GAAP performance measures. Free cash flow is defined as cash used by operating activities less capital expenditures. Adjusted free cash flow excludes special items, as included in the table below, because these cash flows are not considered to be directly related to its underlying business. Management believes these non-GAAP measures are useful to investors in understanding the strength of the Company and its ability to generate cash.\nThe following is the three months ended December 31, 2017 and 2016 reconciliation of free cash flow and adjusted free cash flow (unaudited):\n(in billions)\nThree Months Ended December 31, 2017\nThree Months Ended December 31, 2016\nCash used by operating activities\n$ (0.1)\n$ (1.9)\nCapital expenditures\n(0.2)\n(0.4)\nReported free cash flow *\n$ (0.4)\n$ (2.3)\nAdjusting items:\nTransaction/integration/separation costs\n0.1\n0.2\nTransaction tax payments\n-\n1.2\nAdient cash outflow\n-\n0.3\nChange in control pension payment\n-\n0.2\nTransaction related restructuring\n-\n0.1\nTotal adjusting items\n0.1\n2.0\nAdjusted free cash flow\n$ (0.3)\n$ (0.3)\n* May not sum due to rounding\n5. Net Debt to Capitalization\nThe Company provides financial information regarding net debt as a percentage of total capitalization, which is a non-GAAP performance measure. The Company believes the percentage of total net debt to total capitalization is useful to understanding the Company's financial condition as it provides a review of the extent to which the Company relies on external debt financing for its funding and is a measure of risk to its shareholders. The following is the December 31, 2017 and September 30, 2017 calculation of net debt as a percentage of total capitalization (unaudited):\n(in millions)\nDecember 31, 2017\nSeptember 30, 2017\nShort-term debt and current portion of long-term debt\n$ 1,605\n$ 1,608\nLong-term debt\n10,895\n11,964\nTotal debt\n12,500\n13,572\nLess: cash and cash equivalents\n552\n321\nTotal net debt\n11,948\n13,251\nShareholders' equity attributable to JCI\n20,535\n20,447\nTotal capitalization\n$ 32,483\n$ 33,698\nTotal net debt as a % of total capitalization\n36.8%\n39.3%\n6. Mark-to-Market of Pension and Postretirement Plans\nThe pension and postretirement mark-to-market gain or loss for each period is excluded from adjusted diluted earnings per share. There was no mark-to-market gain or loss for pension and postretirement plans for the three months ended December 31, 2017. The three months ended December 31, 2016 includes a mark-to-market gain for pension plans of $117 million due to lump sum payouts for certain U.S. pension plans in the quarter.\n7. Divestitures\nOn March 16, 2017, the Company announced that it signed a definitive agreement to sell its Scott Safety business to 3M for approximately $2.0 billion. The transaction closed on October 4, 2017. Net cash proceeds from the transaction approximated $1.9 billion and the Company recorded a net gain of $114 million ($84 million after tax). Scott Safety is a leader in the design, manufacture and sale of high performance respiratory protection, gas and flame detection, thermal imaging and other critical products for fire services, law enforcement, industrial, oil and gas, chemical, armed forces, and homeland defense end markets. The Scott Safety business is included within assets held for sale and liabilities held for sale in the accompanying condensed consolidated statement of financial position as of September 30, 2017.\nOn October 31, 2016, the Company completed the spin-off of its Automotive Experience business by way of the transfer of the Automotive Experience business from JCI plc to Adient plc and the issuance of ordinary shares of Adient plc directly to holders of JCI plc ordinary shares on a pro rata basis. Following the separation, Adient plc is now an independent public company trading on the New York Stock Exchange (NYSE) under the symbol \"ADNT.\" The Company did not retain any equity interest in Adient plc. Beginning in the first quarter of fiscal 2017, Adient's historical financial results are reflected in the Company's consolidated financial statements as a discontinued operation.\n8. Income Taxes\nThe Company's effective tax rate from continuing operations before consideration of the transaction/integration/separation costs, nonrecurring purchase accounting impacts related to the Tyco merger, mark-to-market gains or losses for pension and postretirement plans, Scott Safety gain on sale, restructuring and impairment costs and discrete tax items for the three months ending December 31, 2017 and 2016 is approximately 14 percent and 15 percent, respectively.\n9. Restructuring\nThe three months ended December 31, 2017 include restructuring and impairment costs of $158 million related primarily to workforce reductions, plant closures and asset impairments in the Building Technologies & Solutions and Power Solutions businesses, and at Corporate. The three months ended December 31, 2016 restructuring and impairment costs of $78 million related primarily to workforce reductions, plant closures and asset impairments in the Building Technologies & Solutions business and at Corporate.\nView original content: http://www.prnewswire.com/news-releases/johnson-controls-reports-first-quarter-earnings-and-re-affirms-full-year-guidance-300590884.html\nSOURCE Johnson Controls", "external_links": ["http://www.prnewswire.com/news-releases/johnson-controls-reports-first-quarter-earnings-and-re-affirms-full-year-guidance-300590884.html", "http://www.sec.gov/", "http://investors.johnsoncontrols.com/", "http://www.johnsoncontrols.com/"], "published": "2018-01-31T14:55:00.000+02:00", "crawled": "2018-01-31T15:50:11.000+02:00", "highlightTitle": ""}