{"organizations": [], "uuid": "339586cebdb9f9de5c695d8b5136c40404fb957c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-tax-paychecks/u-s-officials-see-tax-paycheck-windfall-but-urge-accuracy-check-idUSKBN1F0335", "country": "US", "domain_rank": 408, "title": "U.S. officials see tax paycheck windfall but urge accuracy check", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:18:00.000+02:00", "replies_count": 0, "uuid": "339586cebdb9f9de5c695d8b5136c40404fb957c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-tax-paychecks/u-s-officials-see-tax-paycheck-windfall-but-urge-accuracy-check-idUSKBN1F0335", "ord_in_thread": 0, "title": "U.S. officials see tax paycheck windfall but urge accuracy check", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "government accountability office", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The Trump administration on Thursday said most U.S. workers will see bigger paychecks in February, as a result of the Republican tax overhaul, but many will need to make sure taxes are withheld accurately with an online calculator that does not yet exist.\nTreasury and Internal Revenue Service officials made the predictions while releasing new tax withholding tables, which U.S. employers must begin using by Feb. 15 to determine how much federal tax gets subtracted from employee wages under the new tax law.\nPresident Donald Trump and Republicans in Congress claim their policy changes will deliver a massive tax cut to the middle-class, as they prepare to battle Democrats to keep control of the House of Representatives and Senate in the Nov. 6 election.\nDemocrats, who say the Republican tax overhaul is mainly a giveaway to the wealthy, have warned that the new IRS guidelines could be skewed to give taxpayers an exaggerated benefit ahead of the elections that they would have to repay in 2019. Two Democratic lawyers asked the watchdog Government Accountability Office to review the guidelines.\nAdministration officials insisted that the guidelines would withhold the correct amount of tax from wages but acknowledged that they are geared to out-of-date W-4 individual withholding forms. Setting up a new withholding system is expected to take most of 2018.\nTo ensure an accurate calculation, taxpayers will have to enter their personal financial information into a calculator expected to be unveiled next month on the website IRS.gov.\n“We would encourage every taxpayer to go to IRS.gov and run their financial information through that calculator so that they understand what their situation is,” said a senior IRS official, who spoke at a briefing with reporters on the condition he was not named.\nHe said new guidelines would provide an accurate picture for many. But he recommended the calculator for those with “more complicated financial situations” including families with two earners and four children under the age of 17.\nThe Republican tax bill that Trump signed into law in December lowered individual tax rates through 2025 and nearly doubled the standard deduction that families can use to reduce taxable income.\nBut it also eliminated a $4,050 personal exemption for each household member until 2026 and scaled back a popular deduction for state and local taxes.\nIndependent analysts say many taxpayers could see their taxes go up. But officials predicted 90 percent of workers would see bigger paychecks while little would change for the remaining 10 percent.\nReporting by David Morgan; Editing by Lisa Shumaker\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T08:18:00.000+02:00", "crawled": "2018-01-12T18:25:08.011+02:00", "highlightTitle": ""}