{"organizations": [], "uuid": "19dc855fada410bffe43068f326ce54deaee9560", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-aurora-cannabis-and-cannimed-therapeutics-agree-to-terms-on-friendly-transaction.html", "country": "US", "domain_rank": 767, "title": "Aurora Cannabis and CanniMed Therapeutics Agree to Terms on Friendly Transaction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:09:00.000+02:00", "replies_count": 0, "uuid": "19dc855fada410bffe43068f326ce54deaee9560"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-aurora-cannabis-and-cannimed-therapeutics-agree-to-terms-on-friendly-transaction.html", "ord_in_thread": 0, "title": "Aurora Cannabis and CanniMed Therapeutics Agree to Terms on Friendly Transaction", "locations": [], "entities": {"persons": [], "locations": [{"name": "alberta", "sentiment": "none"}, {"name": "edmonton", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "canni", "sentiment": "none"}, {"name": "saskatchewan", "sentiment": "none"}, {"name": "saskatoon", "sentiment": "none"}], "organizations": [{"name": "aurora cannabis", "sentiment": "negative"}, {"name": "special committee support aurora", "sentiment": "negative"}, {"name": "board", "sentiment": "negative"}, {"name": "cannimed board", "sentiment": "none"}, {"name": "brent zettl", "sentiment": "none"}, {"name": "aurora cannabis inc.", "sentiment": "none"}, {"name": "cannimed therapeutics inc.", "sentiment": "none"}, {"name": "special committee", "sentiment": "none"}, {"name": "cannimed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CanniMed’s Board and Special Committee Support Aurora’s Offer of Shares and Cash\nEDMONTON, Alberta & SASKATOON, Saskatchewan--(BUSINESS WIRE)-- Aurora Cannabis Inc. (“ Aurora ”) (TSX: ACB) (OTCQB: ACBFF) (Frankfurt: 21P; WKN: A1C4WM) and CanniMed Therapeutics Inc. (“ CanniMed ”) (TSX: CMED) announce today that they have entered into a support agreement (the “Support Agreement”) whereby the Board of Directors and the Special Committee of the CanniMed Board have agreed to support a new offer made by Aurora for the acquisition of all of the issued and outstanding shares of CanniMed not owned by Aurora. In addition to the Board and Special Committee, the new offer (“New Offer”), as described below, will continue to be supported by certain CanniMed shareholders (the “Locked-up Shareholders”) representing 36% of CanniMed’s outstanding shares and by Brent Zettl, President and CEO of CanniMed.\nKey Transaction Highlights\nUnder the New Offer, CanniMed shareholders may receive in respect of each CanniMed share, 3.40 Aurora shares or a combination of cash and shares at the election of each CanniMed Shareholder, subject to pro-ration with the maximum aggregate cash consideration of $140 million. Based on an implied Aurora share price of $12.65 and the 3.40 exchange ratio, the New Offer would equate to $43.00, representing a 181% premium over the closing price of CanniMed Shares on November 14, 2017, the last day prior to the public disclosure of Aurora’s intention to pursue a combination with CanniMed, and a 79% increase to the previous offer Cap Price of $24.00.\nThe total consideration for CanniMed under the New Offer is approximately $1.1 billion based on Aurora’s implied share price of $12.65. The maximum amount of cash available under the amended offer will be $140 million, and the number of Aurora shares to be issued will be between approximately 72 million (assuming full cash elections) and 84 million (assuming full share elections and no cash elections). Assuming maximum cash elections, each CanniMed shareholder would receive $5.70 in cash and 2.9493 Aurora shares.\nSupport Agreement\nThe Support Agreement provides that CanniMed will support the New Offer and will recommend to its shareholders in an amended directors circular that CanniMed Shareholders will tender to the Aurora New Offer. In addition to the foregoing, Aurora will receive customary non-solicitation protection and a right to match any competing proposal made to CanniMed and a break fee payable to Aurora in certain circumstances, together with customary representations and warranties. In addition to the Locked-up Shareholders certain CanniMed shareholders representing approximately 15% of the issued shares of CanniMed, including Brent Zettl, Chief Executive Officer, have agreed to support the New Offer.\nThe New Offer and the transaction are subject to customary closing conditions, including Canadian Competition Act approval.\nTermination of Newstrike Arrangement Agreement\nIn connection with the New Offer, CanniMed has entered into a termination agreement with Newstrike Resources Ltd. (“Newstrike”), terminating the arrangement agreement between Newstrike and CanniMed, resulting in the payment of a $9.5 million break fee paid to Newstrike. As a result, the CanniMed shareholder meeting originally scheduled for January 23, 2018 and adjourned to January 25, 2018 has been cancelled.\nManagement Commentary\n\"We are very pleased to have come to terms with CanniMed on this powerful strategic combination that will establish a best-in-class cannabis company with operations across Canada and around the world,” said Terry Booth, CEO of Aurora. “Market recognition of Aurora`s continued performance and strategy execution since we first announced our intention to acquire CanniMed allows us to share that benefit directly with CanniMed shareholders by increasing the offer price, as well as by offering a cash component. The amended offer includes value certainty and represents a full, compelling and immediate 75% premium over CanniMed’s 20-day average price ending January 17, 2018, the day prior to CanniMed and Aurora disclosing they were in discussions. Aurora now invites CanniMed shareholders to share in Aurora’s ongoing growth, as we continue to create superior shareholder value, by joining with the CanniMed Board of Directors and tendering their shares to our amended offer.”\nBrent Zettl, President and CEO of CanniMed, added, “A testament to the great team at CanniMed, this transaction clearly confirms that the Company has been highly successful in becoming a preeminent global leader in the medical cannabis industry. In this leadership position, CanniMed has provided invaluable education, resources, support and relief of symptoms for thousands of patients served around the globe.”\n“This is an excellent outcome for both Aurora’s and CanniMed’s shareholders after a hard-fought and diligently negotiated process,” said Cam Battley, Aurora’s Chief Corporate Officer. “We now look forward to warmly welcoming CanniMed’s employees and forging one unified team. Together, under the Aurora banner we’ll continue to invest in domestic and international growth, and continue executing on our strategy of building the most dynamic, innovative integrated cannabis company in the world.”\nAdvisors\nCanaccord Genuity Corp. is acting as financial advisor to Aurora, McMillian LLP is acting as legal advisor and Laurel Hill LLP is acting as strategic shareholder advisor. Kingsdale Advisors is acting as strategic shareholder and communications advisor to CanniMed, AltaCorp Capital Inc. is acting as financial advisor to the board of CanniMed and Borden Ladner Gervais LLP is acting as legal advisor to the board of CanniMed. Cormark Securities Inc. is acting as financial advisor to the Special Committee of CanniMed and Stikeman Elliott LLP is acting as legal advisor to the Special Committee.\nAbout Aurora\nAurora's wholly-owned subsidiary, Aurora Cannabis Enterprises Inc., is a licensed producer of medical cannabis pursuant to Health Canada's Access to Cannabis for Medical Purposes Regulations (\"ACMPR\"). The Company operates a 55,200 square foot, state-of-the-art production facility in Mountain View County, Alberta, known as \"Aurora Mountain\", a second 40,000 square foot high-technology production facility known as “Aurora Vie” in Pointe-Claire, Quebec on Montreal’s West Island, and is currently constructing an 800,000 square foot production facility, known as \"Aurora Sky\", at the Edmonton International Airport, as well as is completing a fourth facility in Lachute, Quebec through its wholly owned subsidiary Aurora Larssen Projects Ltd. The Company owns a 17.62% interest in the Green Organic Dutchman, as well as a 51% interest in Aurora Nordic, which is constructing a 1,000,000 hybrid greenhouse similar to Aurora Sky. Including prorated participations, Aurora is on track for a total production capacity of around 200,000 kg per annum.\nIn addition, the Company holds approximately 17.23% of the issued shares in leading extraction technology company Radient Technologies Inc., based in Edmonton, and is in the process of completing an investment in Edmonton-based Hempco Food and Fiber for an ownership stake of up to 50.1%. Furthermore, Aurora is the cornerstone investor with a 22.9% stake in Cann Group Limited, the first Australian company licensed to conduct research on and cultivate medical cannabis. Aurora also owns Pedanios, a leading wholesale importer, exporter, and distributor of medical cannabis in the European Union, based in Germany. The Company offers further differentiation through its acquisition of BC Northern Lights Ltd. and Urban Cultivator Inc., industry leaders, respectively, in the production and sale of proprietary systems for the safe, efficient and high-yield indoor cultivation of cannabis, and in state-of-the-art indoor gardening appliances for the cultivation of organic microgreens, vegetables and herbs in home and professional kitchens. Aurora's common shares trade on the TSX under the symbol \"ACB\".\nAbout CanniMed\nCanniMed is a Canadian-based, international plant biopharmaceutical company and a leader in the Canadian medical cannabis industry, with 17 years of pharmaceutical cannabis cultivation experience, state-of-the-art, GMP-compliant production process and world class research and development platforms with a wide range of pharmaceutical-grade cannabis products. In addition, the Company has an active plant biotechnology research and product development program focused on the production of plant-based materials for pharmaceutical, agricultural and environmental applications.\nThe Company, through its subsidiaries, was the first producer to be licensed under the Marihuana for Medical Purposes Regulations, the predecessor to the current Access to Cannabis for Medical Purposes Regulations. It was the sole supplier to Health Canada under the former medical marijuana system for 13 years, and has been producing safe and consistent medical marijuana for thousands of Canadian patients, with no incident of product diversion or recalls.\nFor more information, please visit our websites: www.cannimed.ca (patients) and www.cannimedtherapeutics.com (investors).\nOn behalf of the Boards of Directors, AURORA CANNABIS INC. CanniMed Therapeutics Inc Terry Booth Brent Zettl CEO CEO Forward-Looking Information Cautionary Statement\nThis news release contains certain “forward-looking statements” within the meaning of such statements under applicable securities law. Forward-looking statements are frequently characterized by words such as “plan”, “continue”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate”, “may”, “will”, “potential”, “proposed” and other similar words, or statements that certain events or conditions “may” or “will” occur. These statements are only predictions. Forward looking statements in release include statements regarding the improved Offer, the anticipated value of the Offer, the number of shares to be issued and timing to complete the Offer. Various assumptions were used in drawing the conclusions or making the projections contained in the forward-looking statements throughout this news release, including assumptions based upon CanniMed’s publicly disclosed information, and that there will be no change in the business, prospects or capitalization of CanniMed or Aurora. Forward-looking statements are based on the opinions and estimates of management at the date the statements are made, and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking statements. The Company is under no obligation, and expressly disclaims any intention or obligation, to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as expressly required by applicable law. A more complete discussion of the risks and uncertainties facing the Company appears in the Company’s Annual Information Form and continuous disclosure filings, which are available at www.sedar.com .\nNeither TSX nor its Regulation Services Provider (as that term is defined in the policies of Toronto Stock Exchange) accepts responsibility for the adequacy or accuracy of this release.\nCautionary Statement Respecting CanniMed Information\nThe information concerning CanniMed contained in this News Release has been taken from, or is based upon, publicly available information filed by CanniMed with securities regulatory authorities in Canada prior to the date of this News Release and other public sources. CanniMed has not reviewed this News Release and has not confirmed the accuracy and completeness of the CanniMed information contained herein. Neither Aurora, nor any of the officers or directors of Aurora, assumes any responsibility for the accuracy or completeness of such CanniMed information or any failure by CanniMed to disclose events or facts that may have occurred, or which may affect the significance or accuracy of any such CanniMed information, but which are unknown to Aurora. Aurora has no means of verifying the accuracy or completeness of any of the CanniMed information contained in this News Release or whether there has been a failure by CanniMed to disclose events or facts that may have occurred or may affect the significance or accuracy of any such information.\nNotice to U.S. Holders\nThe Offer is made for the securities of a company formed outside of the United States. The Offer will be subject to disclosure requirements of Canada that are different from those of the United States. Financial statements included in the documents, if any, will be prepared in accordance with Canadian accounting standards and may not be comparable to the financial statements of United States companies.\nIt may be difficult for a securityholder in the United States to enforce his/her/its rights and any claim a securityholder may have arising under the U.S. federal securities laws, since the issuer is located in Canada, and some or all of its officers or directors may be residents of Canada or another country outside of the United States. A securityholder may not be able to sue a Canadian company or its officers or directors in a court in Canada or elsewhere outside of the United States for violations of U.S. securities laws. It may be difficult to compel a Canadian company and its affiliates to subject themselves to a U.S. court’s judgment. Securityholders should be aware that the issuer may purchase securities otherwise than under the Offer, such as in open market or privately negotiated purchases.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005621/en/\nFor Aurora\nCam Battley, +1.905.864.5525\nChief Corporate Officer\ncam@auroramj.com\nwww.auroramj.com\nor\nMarc Lakmaaker, +1.647.269.5523\nDirector, Investor Relations and Corporate Development\nmarc.lakmaaker@auroramj.com\nor\nLaurel Hill Advisory Group\nNorth America Toll Free: 1-877-452-7184\nCollect Calls Outside North America: 1-416-304-0211\nassistance@laurelhill.com\nor\nFor CanniMed\nMedia\nCanniMed Therapeutics Inc.\nDara Willis, 416-836-9272\ndhw@cannimed.com\nor\nInvestor Relations\nCanniMed Therapeutics Inc.\ninvest@cannimed.com\nor\nKingsdale Advisors\nIan Robertson, 416-867-2333\nCell: 647-621-2646\nExecutive Vice President, Communication Strategy\nirobertson@kingsdaleadvisors.com\nSource: CanniMed Therapeutics Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.auroramj.com&esheet=51748070&lan=en-US&anchor=www.auroramj.com&index=4&md5=1ea33a8374f1b28ab4ca4c4431b70e08", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51748070&newsitemid=20180124005621&lan=en-US&anchor=www.sedar.com&index=3&md5=0dc0adb4195be5d21e9ff61ad43bd5e7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cannimed.ca&esheet=51748070&newsitemid=20180124005621&lan=en-US&anchor=www.cannimed.ca&index=1&md5=c361e11fb1fd0bb5ce734c13a6d2fead", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cannimedtherapeutics.com&esheet=51748070&newsitemid=20180124005621&lan=en-US&anchor=www.cannimedtherapeutics.com&index=2&md5=782ad7bd42c2a4a786c5257eaa12546b", "http://www.businesswire.com/news/home/20180124005621/en/"], "published": "2018-01-24T16:09:00.000+02:00", "crawled": "2018-01-24T19:12:28.006+02:00", "highlightTitle": ""}