{"organizations": [], "uuid": "d0d68980f886812890178a8e9bde1482ea01d512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221880712&w=1200&r=LYNXMPEE0D06E", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-carillion-restructuring-lewis/uk-government-keeping-close-eye-on-services-company-carillion-conservative-chairman-idUSKBN1F30AK", "country": "US", "domain_rank": 408, "title": "UK government keeping close eye on services company Carillion - Conservative chairman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T11:50:00.000+02:00", "replies_count": 0, "uuid": "d0d68980f886812890178a8e9bde1482ea01d512"}, "author": "", "url": "https://www.reuters.com/article/us-carillion-restructuring-lewis/uk-government-keeping-close-eye-on-services-company-carillion-conservative-chairman-idUSKBN1F30AK", "ord_in_thread": 0, "title": "UK government keeping close eye on services company Carillion - Conservative chairman", "locations": [], "entities": {"persons": [{"name": "brandon lewis", "sentiment": "none"}, {"name": "elizabeth piper", "sentiment": "none"}, {"name": "louise heavens", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "carillion - conservative", "sentiment": "negative"}, {"name": "carillion", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 9:57 AM / Updated 4 hours ago Carillion holds survival talks under close UK government watch Reuters Staff 3 Min Read \nLONDON (Reuters) - Carillion held further emergency funding talks on Sunday as the British government said it hoped that the struggling construction and services company’s partners will find the cash it needs to stay in business. \nWith thousands of jobs and major infrastructure projects on the line, the chairman of the governing Conservatives said ministers were “keeping a very close eye” on the Carillion negotiations and contingency plans were in place. \nBrandon Lewis told the BBC that Carillion was still a going concern. The company said it was continuing to hold talks to avoid entering administration after contract delays and a downturn in new business, which have hit its profit and shares. \n“Hopefully, they will be able to work with their partners to get the working capital they need to continue to provide important services,” Lewis said. \nCarillion is part of a consortium that won a 1.4 billion pound ($1.9 billion) contract to help build Britain’s High Speed 2 railway on last year. The deal had offered it some respite after the company had lost other contracts. \nCarillion, which has been in discussions with stakeholders and creditors for nearly a week, said these were continuing as it battles for survival following several profit warnings and a first-half loss of more than 1 billion pounds ($1.37 billion). \nBut deputy general secretary of the Trades Union Congress, Paul Nowak, called on the government to step in. Cranes stand on a Carillion construction site in central London, Britain January 14, 2018. REUTERS/Simon Dawson \n“Tens of thousands of jobs are now at risk, along with vital public services and major infrastructure projects across the country,” Nowak said in a statement. \nCarillion, which is a major provider of public services, employs about 43,000 people worldwide. Cranes stand on a Carillion construction site in central London, Britain January 14, 2018. REUTERS/Simon Dawson \n“Workers, taxpayers and public service users could well be left to carry the can. Carillion is a textbook example of the failures of privatization and outsourcing. The government needs to step in, guarantee jobs and services, and explain how they let this mess happen in the first place.” \nThe Conservative Party’s Lewis declined to comment on whether ministers were ready to bail out the company, which Sky News had said could enter administration as soon as Monday unless the government backs a rescue plan. [nL8N1P80CJ] \nCarillion said on Friday it was having “constructive discussions” with creditors, rejecting suggestions that they did not like the plan put forward by the company. [nL8N1P72UE] \nShares in the company hit a new low of 14.2 pence on Friday after falling 30 percent. \n($1 = 0.7283 pounds)", "external_links": [], "published": "2018-01-14T11:50:00.000+02:00", "crawled": "2018-01-14T12:28:07.017+02:00", "highlightTitle": ""}