{"organizations": [], "uuid": "ecf84c23865e1bc93977e6e38a6d7f8b8fb950af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-atlas-cloud-provides-details-of-1000-bitcoin-miner-acquisition.html", "country": "US", "domain_rank": 767, "title": "Atlas Cloud Provides Details of 1000 Bitcoin Miner Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:54:00.000+02:00", "replies_count": 0, "uuid": "ecf84c23865e1bc93977e6e38a6d7f8b8fb950af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-atlas-cloud-provides-details-of-1000-bitcoin-miner-acquisition.html", "ord_in_thread": 0, "title": "Atlas Cloud Provides Details of 1000 Bitcoin Miner Acquisition", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "atlas cloud enterprises inc.", "sentiment": "negative"}, {"name": "asic", "sentiment": "none"}, {"name": "investment industry regulatory organization of canada (iiroc", "sentiment": "none"}, {"name": "atlas cloud", "sentiment": "none"}, {"name": "bitmain technologies", "sentiment": "none"}, {"name": "application specific integrated circuit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Atlas Cloud Enterprises Inc. (CSE:AKE) (XFRA:A49) (OTCPINK:ATLEF) (the “Company” or “Atlas Cloud”), is, at the request of the Investment Industry Regulatory Organization of Canada (IIROC), clarifying its news release of January 24, 2018, to include the capital acquisition investment incurred for the purchase of the 1000 Antminer S9 ASIC bitcoin mining devices noted in the release.\nThe full text of the clarified and corrected news release follows.\nVANCOUVER, BC, January 24, 2018--Atlas Cloud Enterprises Inc. (CSE:AKE) (XFRA:A49) (OTCPINK:ATLEF) (the “Company” or “Atlas Cloud”) an experienced IT service provider focussed on becoming the lowest cost producer in the blockchain and digital currency mining sector, is pleased to announce the milestone acquisition of 1,000 Application Specific Integrated Circuit (ASIC) mining servers slated for immediate mining deployment. The total purchase price was US$2,380,000 which was paid in full prior to delivery.\nAtlas Cloud’s initial hardware acquisition comes from Bitmain Technologies Ltd. ( Bitmain ). The Antminer S9 , is considered to be the most powerful, power-efficient, and first-ever consumer grade bitcoin miner in the world. Founded in 2013, Bitmain, as a private company, was established to develop and sell industry leading bitcoin miners utilizing specialised ASIC chip technology. Headquartered in Beijing and with offices in Amsterdam, Hong Kong, Tel Aviv, Qingdao, Chengdu, Shanghai and Shenzhen, the company is among the most recognizable organizations in the cryptocurrency space, and the parent of multiple sector-leading products and brands.\nCurrently, Atlas Cloud’s previously announced 3.0-megawatt Grant County Data Centre is completing refurbishment into a dedicated Bitcoin mining facility. In the interim, Atlas Cloud has entered into a private co-located hosting arrangement with an industry partner in order to commence immediate near-term mining operations. The S9 miners have arrived at the partner location, with the first units scheduled to come online on or around February 1 st . Activation and implementation of the entire 1,000 machine order is scheduled for no later than February 15 th .\nThe combined mining capability from the 1,000-machine installation provides 13.5 petahashes per second (PH/s) with a resultant mining capacity of 1.52 BTC/per day, based on current parameters. Operationally, Atlas Cloud plans to join Slushpool.com , the first Bitcoin mining pool in the world, to proportionally amalgamate resources with other global miners to reduce volatility of mining efficacy. In a further innovation to maximize returns, the Company will employ automated software switching that reacts to predetermined thresholds designed to swap mining operations between Bitcoin and Bitcoin Cash depending upon gross mining profitability.\nUnder the terms of the temporary co-location agreement, Atlas will pay all fees plus operational costs of $0.10 USD per kilowatt-hour (kWh) during this short-term hosting arrangement. When the updates to the wholly-owned Grant County Data Centre are completed, the 1,000 miners will be directly transferred to the newly outfitted subsidiary location to leverage electrical provisioning at approximately $0.03/kWh, one of the least expensive commercial rates in the world. Located proximal to Washington State’s Grand Coulee Dam on the Columbia River, the facility is configured to commence operations utilizing 80% of the currently dedicated 3.0 MW of available power to host up to 1,700 S9 or similar ASIC devices. A second phase infrastructure upgrade (an additional 2.0 MW) is expected to be completed in 2019, increasing total available energy dedicated to servicing digital currency mining up to an impressive 5.0 MW.\nThe development of the Company’s business to digital currency mining has been deemed a fundamental change under the policies of the Canadian Securities Exchange. As a result, the Company’s expansion of its business remains subject to the approval of the Company shareholders and the Exchange.\nAs part of its commitment to continuous disclosure as a reporting issuer, Atlas Cloud advises that subject to all required regulatory approvals, on January 17, 2017, the company granted to a consultant the right and option to purchase from the company 250,000 common shares of the company at an exercise price of $1.01 per share, expiring five years from the date of issuance. The number of options and the terms and conditions thereof have been approved by the company's board of directors. Additional compensation details will be filed as and where required on SEDAR.\nAbout Atlas Cloud Enterprises Inc.\nAtlas Cloud Enterprises Inc. is a growth oriented, CSE-listed company focusing on the business of providing co-location and backup/redundancy IT, telecom equipment and cloud computing. Atlas Cloud will provide customers with secure power access, cooling and bandwidth to ensure co-located, back-up or Cloud systems offer minimum risk of failure. Furthermore, Atlas is focussed on the blockchain sector and digital currency mining. Atlas Cloud aims to become the lowest-cost producer of digital currency mining and blockchain infrastructure. Atlas Cloud owns a facility currently undergoing preparations for use as a digital currency mining operation located in Electric City, WA. This location currently benefits from a dedicated low-cost energy source of 3.0 MW and the Company is seeking to significantly expand it operations with the development of additional facilities offering economical, high-yield energy infrastructure opportunities.\nOn behalf of the Board,\n“Fred Stearman”\nFred Stearman, President & Director\nContact\nAtlas Cloud Investor Relations\n+1(778) 871-0357\ninfo@atlascloud.ca\nwww.atlascloud.ca\nThe CSE does not accept responsibility for the adequacy or accuracy of this release.\nThis news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the “U.S. Securities Act”), or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available.\nFORWARD LOOKING INFORMATION\nCertain information set forth in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. These forward-looking statements are subject to numerous risks and uncertainties, certain of which are beyond the control of the Company, including but not limited to, the future business operations of Atlas Cloud. Readers are cautioned that the assumptions used in the preparation of such information, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, undue reliance should not be placed on forward- looking statements. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in the news release are made as of the date of this news release, and the Company does not undertake any obligations to update publicly or to revise any of the included forward-looking statements, whether as a result of new information, future events or otherwise, except as expressly required by applicable securities law.\nSource:Atlas Cloud Enterprises, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=uXdCW0YUKxGU-J6g01qqbiKGuNSDTUKkuUow3znJkrp3qBpvykwyHhK9RaJgMqZxO28Vz1FS5MKvUNIu8c6J9z6QKvCDhPzhWC3KpNQcFX1hiT9FOur9dho1tHac71pi", "https://www.globenewswire.com/Tracker?data=Vd3lBUv6RGFZK6QVY1IlP_AOnLLUueImTPIEBpYuRO7cz7adcM9tQ5HZvv1TG7NxHL3oRXhG59WYVrOmYQTLyw==", "https://www.globenewswire.com/Tracker?data=YgAXqQUDZ2TzCadSSC8QzOn9wzCJswhtC-S0ZodB345RBll4MUSixeqEq_LUBb6YeeXHdfcRD7IXyFCGJJqQKw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/86858380-3084-4a98-bf71-2e67e61c2111", "https://www.globenewswire.com/Tracker?data=AWZci2XjfKNAtMbk-s44EQbpz-tAaFq3tRNCYjd1SNZtwE1--uUb-Inf0XuGwbfI3MSvRa1C0CIa8Onpfm3jxUntNfqhIBIP8cv8N5tiIUs=", "https://www.globenewswire.com/Tracker?data=lFozNWkXnJum6rNx1RKUFD04fVXMfuMSCuNt8Mhn4a3pd_aKp-I-BDbe_J-FJB32EdJQWWHHf0QZxiJXn7TN5w=="], "published": "2018-01-25T21:54:00.000+02:00", "crawled": "2018-01-26T02:23:38.006+02:00", "highlightTitle": ""}