{"organizations": [], "uuid": "0c49a24073dc6a4fb359cc225d36c2eaeff5c541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-omnova-reports-5-point-1-percent-volume-growth-in-specialties-for-q4-2017-and-3-point-5-percent-for-full-year-2017-as-the.html", "country": "US", "domain_rank": 767, "title": "OMNOVA Reports 5.1% volume growth in specialties for Q4 2017 and 3.5% for full year 2017, as the Company's strategy gains momentum", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:15:00.000+02:00", "replies_count": 0, "uuid": "0c49a24073dc6a4fb359cc225d36c2eaeff5c541"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-omnova-reports-5-point-1-percent-volume-growth-in-specialties-for-q4-2017-and-3-point-5-percent-for-full-year-2017-as-the.html", "ord_in_thread": 0, "title": "OMNOVA Reports 5.1% volume growth in specialties for Q4 2017 and 3.5% for full year 2017, as the Company's strategy gains momentum", "locations": [], "entities": {"persons": [], "locations": [{"name": "ohio", "sentiment": "none"}, {"name": "beachwood", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEACHWOOD, Ohio, Jan. 31, 2018 /PRNewswire/ --\nFourth Quarter 2017 Highlights\nLoss per share in the fourth quarter of 2017 increased to $2.10 compared to a loss of $0.25 per share last year due to non-cash charges related to deferred taxes and a Performance Materials segment goodwill impairment.\nAdjusted Diluted Earnings per Share for the quarter was $0.10 compared to $0.14 last year.\nAll 2017 fourth quarter results include a pre-tax loss of $2.1 million resulting from a customer bankruptcy, along with the previously forecasted pre-tax Hurricane Harvey impact of $2.0 million and environmental equipment start-up delays at the Company's China antioxidant plant of $1.0 million. These three items reduced Adjusted Diluted Earnings per Share by approximately $0.07.\nSpecialty Solutions segment operating profit for the quarter was $14.3 million compared to $12.2 million last year. Adjusted Segment Operating Profit for the quarter was $14.6 million, up 16% from $12.6 million last year, reflecting stronger margins, the 5.1% increase in volume and contributions from our new product development pipeline.\nNet Debt to Adjusted EBITDA improved to 3.2x from 3.6x at the end of last year. Cash improved to $88 million at year-end compared to $72 million last year.\nIn December 2017, the Company used its strong cash position to pre-pay $40 million of Term Loan B debt.\nFor 2018, the Company is expecting its fourth consecutive year of growth in Adjusted Diluted Earnings per Share.\nOMNOVA Solutions Inc. (NYSE: OMN) Chief Executive Officer Anne Noonan, commenting on the fourth quarter of fiscal 2017, said, \"We continued to make progress on our key strategic initiatives. We were pleased with the Specialty Solutions segment's 15.9% growth in Adjusted Segment Operating Profit and 5.1% growth in volume compared to the fourth quarter of fiscal 2016. We saw particular strength in our laminates & films, coatings, elastomeric modifiers and oil & gas businesses. We realized volume growth of approximately 1% in Performance Materials with strength in our carpet markets and coated fabrics businesses after excluding the effect of continued coated paper market declines and the July 2017 sale of the China Coated Fabrics business.\n\"We also continued to improve our balance sheet. As a result of 2017's cash generation and profit growth, Net Debt to Adjusted EBITDA improved to 3.2x compared to 3.6x last year-end. In December 2017 we used our strong cash position to pre-pay $40 million of principle on our Term Loan B,\" continued Noonan.\n\"For 2018 we anticipate our fourth consecutive year of Adjusted EPS growth. We expect this improvement despite an anticipated year-over-year decline in our paper coatings business. As we have discussed in recent years, the rise of electronic media has led to a long-term structural decline of the paper coatings business and pricing for a portion of our historical paper coatings business has declined to unattractive levels. Since our specialization strategy continues to gain momentum with improving earnings and volumes, we will no longer serve this lower margin portion of the paper coating market. As a result, after taking into account cost reductions, the paper coatings business' 2018 contribution to Company profitability is expected to decline by approximately $3 - $4 million in comparison to 2017. We expect this decline to be offset by growth in Specialty Solutions and other lines of business in Performance Materials. In alignment with our specialization strategy, we will continue to supply and support higher value and specialty grades of paper coatings. By year end 2018 we anticipate that paper coatings will constitute approximately 6%-7% of our revenue compared to more than 25% a few years ago, as we continue to aggressively pursue our specialization strategy,\" concluded Noonan.\nConsolidated Results for the Fourth Quarter of Fiscal 2017\nThe loss per share for the fourth quarter ended November 30, 2017 was $2.10, compared to a loss per share of $0.25 last year. In the fourth quarter of 2017, the Company recorded non-cash charges of $76 million for the write down of deferred tax assets and $19.6 million for the write-down of goodwill related to the continued decline of the paper coatings market and charges of $3.1 million primarily related to severance and other restructuring related costs. In the fourth quarter of 2016, the Company recorded charges of $14.9 million related to facility closure costs, severance and debt refinancing costs.\nAdjusted Diluted Earnings per Share (Adjusted EPS) was $0.10 for the fourth quarter of 2017, compared with $0.14 last year. The reduction in Adjusted EPS was the result of charges related to the customer bankruptcy, the impact of Hurricane Harvey and the Company's China antioxidant plant delayed start-up costs.\nNet sales for the fourth quarter were $186.3 million, approximately even with last year's $187 million. China Coated Fabrics (CCF), which was sold in July 2017, accounted for $6.7 million of sales in last year's fourth quarter. Excluding the effect of CCF, sales increased 3.3% compared to the fourth quarter last year. Sales in Specialty Solutions increased 9.6% to $111.1 million, while sales in Performance Materials decreased 4.7%, excluding the effect of CCF. Overall volume declined $2.5 million, or 1.3%, primarily related to continued declines in paper. This volume decline was partially offset by strong growth in specialties and carpet. Pricing improved by $5.9 million, or 3.2%, reflecting index pricing adjustments and the results of the Company's continued value-pricing initiatives. Currency translation was favorable by $2.6 million or 1.4%.\nGross profit in the fourth quarter of 2017 was $45.9 million, or 24.6% of net sales, compared to $49.1 million, or 26.3% of net sales, last year. The year-over-year decrease was primarily in Performance Materials reflecting weakness in paper coatings, the Q4 hurricane impact and the China antioxidant plant environmental equipment start-up delays.\nSG&A in the fourth quarter was $28.9 million, up from $27.5 million in the same quarter last year. The primary driver of the increase was the bad debt provision partially offset by benefits from the \"One OMNOVA\" cost reduction initiatives.\nInterest expense was $5.5 million compared to $7.3 million last year reflecting lower interest rates and refinancing costs incurred last year.\nIncome tax expense in the fourth quarter of 2017 was $76.7 million compared to $4.9 million in 2016. During the fourth quarter of 2017, the Company established a valuation allowance reserve against its U.S. deferred tax assets, resulting in $75.7 million of additional non-cash income tax expense. While the Company is forecasting future taxable income sufficient to utilize these U.S. deferred tax assets, historical cumulative pretax losses, driven primarily by non-cash restructuring and impairment charges, required the Company to establish this non-cash tax valuation allowance.\nOn December 22, 2017, the Tax Cuts and Jobs Act (the \"TCJA\") was signed into federal law, which among other changes reduces the federal corporate tax rate to 21%. The reduction in the federal tax rate will lower our overall global effective tax rate beginning in the first quarter of 2018. In addition, OMNOVA expects during the first quarter of 2018 to incur a one-time tax benefit related to the re-measurement of the U.S. net deferred tax liabilities on the balance sheet to a lower U.S. federal tax rate. The Company expects the re-measurement to result in $3 million to $5 million of income tax benefit. The Company does not expect the new tax law regarding transition tax to have a material impact on the financials as it expects to have the ability to utilize federal net operating loss carryforwards. Overall, the Company views this U.S. tax reform to be beneficial to the Company.\nCash provided by operations in the fourth quarter of 2017 was $19.6 million, compared to $9.9 million last year. Working capital days were flat year-over-year in November after declining all year as inventory levels and receivables were up primarily reflecting timing of sales in the fourth quarter including the hurricane effect. Trailing 12 month adjusted EBITDA increased to $84.9 million from $82 million in the comparable period. Adjusted net leverage improved to 3.2x adjusted EBITDA as compared to 3.6x last year (see Tables C and D), reflecting the increases in earnings and cash generation.\nSpecialty Solutions Segment Results\nNet sales for Specialty Solutions during the fourth quarter of 2017 increased $9.7 million, or 9.6%, to $111.1 million, compared with $101.4 million last year. The improvement was driven by strong volume increases of $5.2 million, or 5.1%, and pricing and mix increases of $1.9 million, or 1.9%. Foreign currency translation had a favorable effect of $1.7 million. Volumes were strong in laminates & films, coatings, elastomeric modifiers and oil & gas.\nSegment Operating Profit was $14.3 million compared with $12.2 million last year. Adjusted Segment Operating Profit grew 15.8% to $14.6 million, or 13.1% of net sales, compared to $12.6 million or 12.4% of net sales last year. (See Tables A and B.) Increased pricing, volume leverage and cost controls drove the improvement in operating profit.\nPerformance Materials Segment Results\nNet sales for Performance Materials during the fourth quarter of 2017 were $75.2 million compared to $85.6 million last year. The divested CCF business accounted for $6.7 million of net sales in the fourth quarter of 2016. Continued declines in coated paper along with the impact of the environmental equipment start-up delays in the Company's China antioxidant manufacturing facility were the primary drivers of the unfavorable volume. Excluding the ongoing declines in paper coatings and the effect of the sale of CCF, volume increased approximately 1% primarily due to carpet, which is benefitting from new product initiatives.\nPerformance Materials' segment operating loss for the quarter was $18.4 million, which includes the $19.6 million non-cash goodwill charge compared with an operating loss of $0.1 million last year. Adjusted Segment Operating Profit was $3.1 million or 4% of net sales, compared to $6.1 million, or 7.1% of net sales, last year. (See Tables A and B.) There were several large drivers of the decrease including the bad debt provision, hurricane effect and China environmental equipment start up delays in antioxidants partially offset by continued cost control actions and the absence of the loss from CCF in last year's results.\nEarnings Conference Call - OMNOVA Solutions has scheduled its Earnings Conference Call for Wednesday, January 31, 2018, at 11:00 a.m. ET. OMNOVA Solutions' President and Chief Executive Officer, Anne Noonan will host the live audio event. The call is anticipated to be approximately one hour in length and may be accessed by the public from the investor relations section of the Company's website ( www.omnova.com ). Webcast attendees will be in a listen-only mode. Following the live webcast, OMNOVA will archive the call on its website until noon ET, February 19, 2018. A telephone replay also will be available beginning at 1:00 p.m. ET on January 31, 2018, and ending at 11:59 p.m. ET on February 19, 2018. To listen to the telephone replay, callers should dial: (USA) 800-475-6701, access code 442593 or (International) 320-365-3844, access code 442593.\nOMNOVA SOLUTIONS INC.\nNon-GAAP and Other Financial Matters\nReconciliation of Reported Segment Sales and Operating Profit to Net Sales and Net Income (Loss)\nThree Months Ended\nYear Ended\nNovember 30,\nNovember 30,\n(Dollars in millions)\n2017\n2016\n2017\n2016\nNet Sales\nSpecialty Solutions\n$\n111.1\n$\n101.4\n$\n441.4\n$\n404.3\nPerformance Materials\n75.2\n85.6\n341.7\n355.6\nTotal Net Sales\n$\n186.3\n$\n187.0\n$\n783.1\n$\n759.9\nSegment Operating Profit (Loss)\nSpecialty Solutions\n$\n14.3\n$\n12.2\n$\n59.9\n$\n59.8\nPerformance Materials\n(18.4)\n( .1)\n(12.6)\n8.5\nInterest expense\n(5.5)\n(7.3)\n(21.5)\n(24.7)\nCorporate expense\n(5.7)\n(4.9)\n(24.5)\n(25.8)\nCorporate severance\n(.4)\n(4.9)\n(2.9)\n(4.9)\nOperational improvement costs\n—\n.4\n—\n.8\nAsset impairment\n(.4)\n—\n(1.8)\n—\nDebt issuance costs write-off\n—\n(1.2)\n—\n(2.9)\nAcquisition and integration related expenses\n(.1)\n(.5)\n(.3)\n(.9)\nPension settlement\n—\n—\n(.4)\n—\nIncome (Loss) Before Income Taxes\n(16.2)\n(6.3)\n(4.1)\n9.9\nIncome tax expense\n(76.7)\n(4.9)\n(83.7)\n(10.3)\nNet Income (Loss)\n$\n(92.9)\n$\n(11.2)\n$\n(87.8)\n$\n(.4)\nDepreciation and amortization\n$\n7.2\n$\n7.1\n$\n27.9\n$\n30.6\nCapital expenditures\n$\n8.1\n$\n9.1\n$\n25.1\n$\n25.6\nThis Earnings Release includes Adjusted Segment Operating Profit, Adjusted Income, Adjusted Diluted Earnings Per Share, Adjusted EBIT, Net Debt and Adjusted EBITDA which are non-GAAP financial measures as defined by the Securities and Exchange Commission. Management reviews the adjusted financial measures in assessing the performance of the business segments and in making decisions regarding the allocation of resources to the business segments. Management also believes that the adjusted information is useful for providing investors with an understanding of the Company's business and operating performance. Management excludes the items shown in the tables below because Management does not consider them to be reflective of normal operations. These adjusted financial measurements are not measurements of financial performance under GAAP and such financial measures should not be considered as an alternative to Segment Operating Profit, Net Income, Diluted Earnings Per Share or other measures of financial performance determined in accordance with GAAP. These non-GAAP financial measures may not be comparable to similarly titled measures reported by other companies. Presented on Tables C and D is the Company's Net Leverage Ratio calculation (Net Debt / Adjusted EBITDA). Presented on Table E is the Company's Adjusted Return on Invested Capital calculation (Adjusted Net Operating Profit After Tax / Total Debt and Equity). The tables below provide the reconciliation of these financial measures to the comparable GAAP financial measures.\nOMNOVA SOLUTIONS INC.\nNon-GAAP and other Financial Matters (Continued)\nThree Months Ended November 30, 2017\nTable A - Reconciliation of Segment Sales and Operating Profit to Adjusted Segment Operating Profit and Adjusted Income from Continuing Operations\n(Dollars in millions except per share data)\nSpecialty Solutions\nPerformance Materials\nCombined\nCorporate\nConsolidated\nNet Sales\n$\n111.1\n$\n75.2\n$\n186.3\n$\n—\n$\n186.3\nSegment Operating Profit / Corporate Expense\n$\n14.3\n$\n(18.4)\n$\n(4.1)\n$\n(6.6)\n$\n(10.7)\nInterest expense\n—\n—\n—\n(5.5)\n(5.5)\nIncome (Loss) Before Income Taxes\n14.3\n(18.4)\n(4.1)\n(12.1)\n(16.2)\nManagement Excluded Items:\nRestructuring and severance\n—\n—\n—\n.4\n.4\nAcquisition and integration related expense\n—\n—\n—\n.1\n.1\nEnvironmental costs\n—\n.2\n.2\n—\n.2\nAsset impairment, facility closure costs and other\n.3\n21.3\n21.6\n.4\n22.0\nTotal Management Excluded Items\n.3\n21.5\n21.8\n.9\n22.7\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n14.6\n$\n3.1\n$\n17.7\n$\n(11.2)\n$\n6.5\nTax expense (30% rate)*\n(2.0)\nAdjusted Income\n$\n4.5\nAdjusted Diluted Earnings Per Share From Adjusted Income\n$\n.10\n*Tax rate is based on the Company's estimated normalized annual effective tax rate.\nAdjusted Segment Operating Profit as a % of\nSales\n13.1\n%\n4.1\n%\n9.5\n%\nCapital Expenditures\n$\n4.9\n$\n3.0\n$\n7.9\n$\n.2\n$\n8.1\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n14.6\n$\n3.1\n$\n17.7\n$\n(11.2)\n$\n6.5\nUnallocated corporate interest expense\n—\n—\n—\n5.5\n5.5\nSegment / Consolidated Adjusted EBIT\n14.6\n3.1\n17.7\n(5.7)\n12.0\nDepreciation and amortization\n3.8\n2.9\n6.7\n.5\n7.2\nSegment / Consolidated Adjusted EBITDA\n$\n18.4\n$\n6.0\n$\n24.4\n$\n(5.2)\n$\n19.2\nAdjusted EBITDA as a % of Sales\n16.6\n%\n8.0\n%\n13.1\n%\n10.3\n%\nOMNOVA SOLUTIONS INC.\nNon-GAAP and other Financial Matters (Continued)\nThree Months Ended November 30, 2016\nTable B - Reconciliation of Segment Sales and Operating Profit to Adjusted Segment Operating Profit and Adjusted Income from Continuing Operations\n(Dollars in millions except per share data)\nSpecialty Solutions\nPerformance Materials\nCombined\nCorporate\nConsolidated\nNet Sales\n$\n101.4\n$\n85.6\n$\n187.0\n$\n—\n$\n187.0\nSegment Operating Profit / Corporate Expense\n$\n12.2\n$\n(.1)\n$\n12.1\n$\n(11.1)\n$\n1.0\nInterest expense\n—\n—\n—\n(7.3)\n(7.3)\nIncome (Loss) Before Income Taxes\n12.2\n(.1)\n12.1\n(18.4)\n(6.3)\nManagement Excluded Items:\nRestructuring and severance\n—\n.5\n.5\n4.8\n5.3\nAcquisition and integration related expense\n—\n—\n—\n.5\n.5\nEnvironmental costs\n—\n.3\n.3\n—\n.3\nDebt issuance costs write-off\n—\n—\n—\n3.2\n3.2\nAsset impairment, facility closure costs and other\n.7\n5.5\n6.2\n(.1)\n6.1\nVacation policy change\n(.3)\n(.1)\n(.4)\n(.1)\n(.5)\nTotal Management Excluded Items\n.4\n6.2\n6.6\n8.3\n14.9\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n12.6\n$\n6.1\n$\n18.7\n$\n(10.1)\n$\n8.6\nTax expense (30% rate)*\n(2.6)\nAdjusted Income\n$\n6.0\nAdjusted Diluted Earnings Per Share From Adjusted Income\n$\n.14\n*Tax rate is based on the Company's estimated normalized annual effective tax rate.\nAdjusted Segment Operating Profit as a % of\nSales\n12.4\n%\n7.1\n%\n10.0\n%\nCapital Expenditures\n$\n4.1\n$\n4.9\n$\n9.0\n$\n.1\n$\n9.1\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n12.6\n$\n6.1\n$\n18.7\n$\n(10.1)\n$\n8.6\nUnallocated corporate interest expense excluding\ndebt premium\n—\n—\n—\n5.3\n5.3\nSegment / Consolidated Adjusted EBIT\n12.6\n6.1\n18.7\n(4.8)\n13.9\nDepreciation and amortization excluding\naccelerated depreciation\n3.5\n3.3\n6.8\n.3\n7.1\nSegment / Consolidated Adjusted EBITDA\n$\n16.1\n$\n9.4\n$\n25.5\n$\n(4.5)\n$\n21.0\nAdjusted EBITDA as a % of Sales\n15.9\n%\n11.0\n%\n13.6\n%\n11.2\n%\nOMNOVA SOLUTIONS INC.\nNon-GAAP and other Financial Matters (Continued)\nTwelve Months Ended November 30, 2017\nTable C - Reconciliation of Segment Sales and Operating Profit to Adjusted Segment Operating Profit and Adjusted Income from Continuing Operations\n(Dollars in millions except per share data)\nSpecialty Solutions\nPerformance Materials\nCombined\nCorporate\nConsolidated\nNet Sales\n$\n441.4\n$\n341.7\n$\n783.1\n$\n—\n$\n783.1\nSegment Operating Profit / Corporate Expense\n$\n59.9\n$\n(12.6)\n$\n47.3\n$\n(29.9)\n$\n17.4\nInterest expense\n—\n—\n—\n(21.5)\n(21.5)\nIncome (Loss) Before Income Taxes\n59.9\n(12.6)\n47.3\n(51.4)\n(4.1)\nManagement Excluded Items:\nRestructuring and severance\n.6\n1.7\n2.3\n2.9\n5.2\nAcquisition and integration related expense\n—\n—\n—\n.3\n.3\nEnvironmental costs\n—\n(2.0)\n(2.0)\n—\n(2.0)\nPension settlement\n—\n—\n—\n.4\n.4\nAsset impairment, facility closure costs and other\n.3\n33.6\n33.9\n1.8\n35.7\nTotal Management Excluded Items\n.9\n33.3\n34.2\n5.4\n39.6\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n60.8\n$\n20.7\n$\n81.5\n$\n(46.0)\n$\n35.5\nTax expense (30% rate)*\n$\n(10.7)\nAdjusted Income\n$\n24.8\nAdjusted Diluted Earnings Per Share From Adjusted Income\n$\n.56\n*Tax rate is based on the Company's estimated normalized annual effective tax rate.\nAdjusted Segment Operating Profit as a % of\nSales\n13.8\n%\n6.1\n%\n10.4\n%\nCapital Expenditures\n$\n13.4\n$\n10.9\n$\n24.3\n$\n.8\n$\n25.1\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n60.8\n$\n20.7\n$\n81.5\n$\n(46.0)\n$\n35.5\nUnallocated corporate interest expense\n—\n—\n—\n21.5\n21.5\nSegment / Consolidated Adjusted EBIT\n60.8\n20.7\n81.5\n(24.5)\n57.0\nDepreciation and amortization\n14.5\n11.4\n25.9\n2.0\n27.9\nSegment / Consolidated Adjusted EBITDA\n$\n75.3\n$\n32.1\n$\n107.4\n$\n(22.5)\n$\n84.9\nAdjusted EBITDA as a % of Sales\n17.1\n%\n9.4\n%\n13.7\n%\n10.8\n%\nNet Leverage\nTotal short and long-term debt (excluding OID and deferred financing fees of $7.8M)\n$\n361.8\nLess cash\n(88.0)\nNet Debt (Debt Less Cash)\n$\n273.8\nNet Leverage Ratio**\n3.2x\n** The above calculation is not intended to be used for purposes of calculating debt covenant compliance.\nOMNOVA SOLUTIONS INC.\nNon-GAAP and other Financial Matters (Continued)\nTwelve Months Ended November 30, 2016\nTable D - Reconciliation of Segment Sales and Operating Profit to Adjusted Segment Operating Profit and Adjusted Income from Continuing Operations\n(Dollars in millions except per share data)\nSpecialty Solutions\nPerformance Materials\nCombined\nCorporate\nConsolidated\nNet Sales\n$\n404.3\n$\n355.6\n$\n759.9\n$\n—\n$\n759.9\nSegment Operating Profit / Corporate Expense\n$\n59.8\n$\n8.5\n$\n68.3\n$\n(33.7)\n$\n34.6\nInterest expense\n—\n—\n—\n(24.7)\n(24.7)\nIncome (Loss) Before Income Taxes\n59.8\n8.5\n68.3\n(58.4)\n9.9\nManagement Excluded Items:\nRestructuring and severance\n.2\n3.3\n3.5\n4.9\n8.4\nAccelerated depreciation on production transfer\n—\n3.0\n3.0\n—\n3.0\nOperational improvements costs\n—\n(.4)\n(.4)\n—\n(.4)\nAcquisition and integration related expense\n—\n1.1\n1.1\n.9\n2.0\nEnvironmental costs\n—\n.3\n.3\n—\n.3\nDebt issuance costs write-off\n—\n—\n—\n4.9\n4.9\nCorporate Headquarters relocation costs\n—\n—\n—\n(.2)\n(.2)\nAsset impairment, facility closure costs and other\n1.5\n5.7\n7.2\n—\n7.2\nVacation Accrual\n(1.3)\n(1.5)\n(2.8)\n(.6)\n(3.4)\nTotal Management Excluded Items\n.4\n11.5\n11.9\n9.9\n21.8\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n60.2\n$\n20.0\n$\n80.2\n$\n(48.5)\n$\n31.7\nTax expense (30% rate)*\n$\n(9.5)\nAdjusted Income\n$\n22.2\nAdjusted Diluted Earnings Per Share From Adjusted Income\n$\n.50\n*Tax rate is based on the Company's estimated normalized annual effective tax rate.\nAdjusted Segment Operating Profit as a % of\nSales\n14.9\n%\n5.6\n%\n10.6\n%\nCapital Expenditures\n$\n11.9\n$\n11.9\n$\n23.8\n$\n1.8\n$\n25.6\nAdjusted Segment Operating Profit / Corporate\nExpense Before Income Taxes\n$\n60.2\n$\n20.0\n$\n80.2\n$\n(48.5)\n$\n31.7\nUnallocated corporate interest expense excluding\ndebt premium\n—\n—\n—\n22.7\n22.7\nSegment / Consolidated Adjusted EBIT\n60.2\n20.0\n80.2\n(25.8)\n54.4\nDepreciation and amortization excluding\naccelerated depreciation\n13.3\n13.2\n26.5\n1.1\n27.6\nSegment / Consolidated Adjusted EBITDA\n$\n73.5\n$\n33.2\n$\n106.7\n$\n(24.7)\n$\n82.0\nAdjusted EBITDA as a % of Sales\n18.2\n%\n9.3\n%\n14.0\n%\n10.8\n%\nNet Leverage\nTotal short and long-term debt (excluding OID and deferred financing fees of $9.3M)\n$\n366.0\nLess cash\n(72.0)\nNet Debt (Debt Less Cash)\n$\n294.0\nNet Leverage Ratio**\n3.6x\n** The above calculation is not intended to be used for purposes of calculating debt covenant compliance.\nOMNOVA Solutions Inc.\nNon-GAAP and other Financial Matters (Continued)\nTwelve Months Ended November 30, 2017 and 2016\nTable E - Adjusted Return on Invested Capital\nTwelve Months Ended\nNovember 30,\nAdjusted Net Operating Profit After Tax\n2017\n2016\nAdjusted income\n$\n24.8\n$\n22.2\nInterest add back excluding debt premium\n21.5\n22.7\nTax effect of Interest add back*\n(6.5)\n(6.8)\nTotal Adjusted Net Operating Profit After Tax\n$\n39.8\n$\n38.1\nAs of\nAs of\nDebt and Equity:\nNovember 30, 2017\nNovember 30, 2016\nShort-term debt\n$\n4.2\n$\n4.2\nLong-term debt\n349.8\n352.5\nTotal shareholders' equity\n38.2\n109.8\nTotal Debt and Equity\n$\n392.2\n$\n466.5\nAdjusted Return on Invested Capital\n10.1\n%\n8.2\n%\n*Tax rate is based on the Company's estimated normalized annual effective tax rate.\nNotice on Forward-Looking Statements\nThis press release includes descriptions of OMNOVA's current business, operations, assets and other matters affecting the Company as well as \" \" as defined by federal securities laws. All by the Company, including verbal statements, are intended to qualify for the protections afforded under the Private Securities Litigation Reform Act of 1995. Forward-looking statements reflect management's current expectation, judgment, belief, assumption, estimate or forecast about future events, circumstances or results and may address business conditions and prospects, strategy, capital structure, debt and cash levels, sales, profits, earnings, markets, products, technology, operations, customers, raw materials, claims and litigation, financial condition, and accounting policies among other matters. Words such as, but not limited to, \"will,\" \"may,\" \"should,\" \"projects,\" \"forecasts,\" \"seeks,\" \"believes,\" \"expects,\" \"anticipates,\" \"estimates,\" \"intends,\" \"plans,\" \"targets,\" \"optimistic,\" \"likely,\" \"would,\" \"could,\" \"committed,\" and similar expressions or phrases identify .\nAll descriptions of OMNOVA's current business, operations and assets, as well as all , involve risks and uncertainties. Many risks and uncertainties are inherent in business generally. Other risks and uncertainties are more specific to the Company's businesses and strategy, or to any new businesses the Company may enter into or acquire. There also may be risks and uncertainties not currently known to the Company. The occurrence of any such risks and uncertainties and the impact of such occurrences is often not predictable or within the Company's control. Such impacts could adversely affect the Company's business, operations or assets as well as the Company's results. In some cases, such impact could be material. Certain risks and uncertainties facing the Company are described below and in the Company's Quarterly Reports on Form 10-Q and Annual Report on Form 10-K.\nAll written and verbal descriptions of OMNOVA's business, operations and assets and all attributable to the Company or any person acting on the Company's behalf are expressly qualified in their entirety by the risks, uncertainties, and cautionary statements contained and referenced herein. All such descriptions and any forward-looking statement speak only as of the date on which such description or statement is made, and the Company undertakes no obligation, and specifically declines any obligation, other than that imposed by law, to publicly update or revise any such description or whether as a result of new information, future events or otherwise.\nThe Company's actual results and the value of your investment in OMNOVA may differ, perhaps materially, from expectations due to a number of risks and uncertainties including, but not limited to: (1) the Company's exposure to general economic, business, and industry conditions; (2) the risk of doing business in foreign countries and markets; (3) changes in raw material prices and availability; (4) the highly competitive markets the Company serves and continued consolidations among its competitors and customer base; (5) extraordinary events such as natural disasters, political disruptions, terrorist attacks and acts of war; (6) extensive and increasing governmental regulation, including environmental, health and safety regulations; (7) the Company's failure to protect its intellectual property or defend itself from intellectual property claims; (8) claims and litigation; (9) changes in accounting policies, standards, and interpretations; (10) the actions of activist shareholders; (11) the Company's inability to achieve or achieve in a timely manner the objectives and benefits of cost reduction initiatives; (12) the Company's ability to develop and commercialize new products at competitive prices; (13) the Company's use of purchase orders rather than long-term contracts for most of its business; (14) the disproportionate impact of certain product lines on the Company's operating profitability; (15) customer credit risk; (16) the Company's ability to identify and complete strategic transactions; (17) the Company's ability to successfully integrate acquired companies; (18) unanticipated capital expenditures; (19) risks associated with the use, production, storage, and transportation of chemicals; (20) information system failures and breaches in security; (21) continued increases in healthcare costs; (22) the Company's ability retain or attract key employees; (23) the Company's ability to renew collective bargaining agreements with employees on acceptable terms and the risk of work stoppages; (24) the Company's contribution obligations under its U.S. pension plan; (25) the Company's reliance on foreign financial institutions to hold some of its funds; (26) the effect of goodwill impairment charges; (27) the volatility in the market price of the Company's common shares; (28) the Company's substantial debt position; (29) a decision to incur additional debt; (30) the operational and financial restrictions contained in the Company's debt agreements; (31) the effects of a default under the Company's term loan or revolving credit facility; (32) the Company's ability to generate sufficient cash to service its outstanding debt; and (33) the Company's subsidiaries' ability to provide the Company with cash.\nOMNOVA Solutions provides greater detail regarding these risks and uncertainties in its 2017 Form 10-K and subsequent filings with the Securities and Exchange Commission, which are available online at www.omnova.com and www.sec.gov .\nOMNOVA Solutions Inc. is a global innovator of performance-enhancing chemistries and surfaces used in products for a variety of commercial, industrial and residential applications. As a strategic business-to-business supplier, OMNOVA provides The Science in Better Brands, with emulsion polymers, specialty chemicals, and functional and decorative surfaces that deliver critical performance attributes to top brand-name, end-use products sold around the world. OMNOVA's sales for the fiscal year ended November 30, 2017, were $783 million. The Company has a global workforce of approximately 1,800. Visit OMNOVA Solutions on the internet at www.omnova.com .\nOMNOVA SOLUTIONS INC.\nConsolidated Statements of Operations\n(Dollars in Millions, Except Per Share Data)\n(Unaudited)\nThree Months Ended\nYear Ended\nNovember 30,\nNovember 30,\n2017\n2016\n2017\n2016\nNet Sales\n$\n186.3\n$\n187.0\n$\n783.1\n$\n759.9\nCost of goods sold (exclusive of depreciation)\n140.4\n137.9\n582.3\n556.0\nGross Profit\n45.9\n49.1\n200.8\n203.9\nSelling, general and administrative\n28.9\n27.5\n117.1\n118.5\nDepreciation and amortization\n7.2\n7.1\n27.9\n30.6\nAsset impairment\n19.6\n5.3\n32.9\n5.7\nLoss on sale of assets\n.4\n.2\n.4\n.3\nRestructuring and severance\n.6\n5.8\n5.7\n11.1\nInterest expense\n5.5\n7.3\n21.5\n24.7\nDebt issuance costs write-off\n—\n1.2\n—\n2.9\nAcquisition and integration related expense\n.1\n.5\n.3\n.9\nOther (income) expense, net\n(.2)\n.5\n(.9)\n(.7)\n62.1\n55.4\n204.9\n194.0\nIncome (Loss) Before Income Taxes\n(16.2)\n(6.3)\n(4.1)\n9.9\nIncome tax (expense) benefit\n(76.7)\n(4.9)\n(83.7)\n(10.3)\nNet Income (Loss)\n$\n(92.9)\n$\n(11.2)\n$\n(87.8)\n$\n(.4)\nBasic and Diluted Income (Loss) Per Share\n$\n(2.10)\n$\n(.25)\n$\n(1.98)\n$\n(.01)\nWeighted average shares outstanding - Basic and Diluted\n44.4\n46.4\n44.4\n44.0\nOMNOVA SOLUTIONS INC.\nConsolidated Balance Sheets\n(Dollars in Millions, Except Per Share Data)\nNovember 30, 2017\nNovember 30, 2016\n(Unaudited)\n(Audited)\nASSETS:\nCurrent Assets\nCash and cash equivalents\n$\n88.0\n$\n72.0\nAccounts receivable, net\n99.0\n87.2\nInventories\n76.5\n74.0\nPrepaid expenses and other\n12.5\n18.1\nAssets held for sale - current\n—\n25.7\nTotal Current Assets\n276.0\n277.0\nProperty, plant and equipment, net\n208.9\n202.7\nIntangible assets, net\n56.0\n56.7\nGoodwill\n66.3\n80.2\nDeferred income taxes\n0.1\n66.7\nOther non-current assets\n5.5\n4.0\nTotal Assets\n$\n612.8\n$\n687.3\nLIABILITIES AND SHAREHOLDERS' EQUITY:\nCurrent Liabilities\nAmounts due banks\n$\n4.2\n$\n4.2\nAccounts payable\n78.3\n68.7\nAccrued payroll and personal property taxes\n26.1\n23.4\nEmployee benefit obligations\n2.9\n4.5\nOther current liabilities\n5.1\n7.4\nLiabilities held for sale - current\n—\n5.2\nTotal Current Liabilities\n116.6\n113.4\nLong-term debt\n349.8\n352.5\nPost-retirement benefits other than pensions\n6.3\n6.3\nPension liabilities\n70.5\n82.3\nDeferred income taxes\n23.4\n11.4\nOther non-current liabilities\n8.0\n11.6\nTotal Liabilities\n574.6\n577.5\nShareholders' Equity\nCommon stock - $0.10 par value; 135 million shares authorized, 48.3 million shares issued as of November 30, 2017 and 2016\n4.8\n4.8\nAdditional contributed capital\n343.4\n341.0\nRetained deficit\n(159.2)\n(74.3)\nTreasury stock at cost - 3.5 million and 3.2 million shares at November 30, 2017 and 2016, respectively\n(25.5)\n(23.2)\nAccumulated other comprehensive loss\n(125.3)\n(138.5)\nTotal Shareholders' Equity\n38.2\n109.8\nTotal Liabilities and Shareholders' Equity\n$\n612.8\n$\n687.3\nOMNOVA SOLUTIONS INC.\nConsolidated Statements of Cash Flows\n(Dollars in Millions)\nThree Months Ended\nYear Ended\nNovember 30,\nNovember 30,\n2017\n2016\n2017\n2016\nOperating Activities:\nNet income (loss)\n$\n(92.9)\n$\n(11.2)\n$\n(87.8)\n$\n(.4)\nAdjustments to reconcile net (loss) income to net cash provided by\noperating activities:\nLoss on disposal of fixed assets\n.4\n.3\n.4\n.3\nDepreciation and amortization\n7.2\n7.1\n27.9\n30.6\nAmortization & write-off of debt issuance costs\n.4\n1.6\n1.5\n4.7\nImpairment of long-lived assets\n20.0\n5.3\n32.9\n5.7\nNon-cash stock compensation expense\n.3\n1.7\n1.9\n3.5\nProvision for uncollectible accounts\n2.1\n.3\n2.1\n.3\nProvision for obsolete inventories\n—\n—\n.3\n—\nDeferred income taxes\n77.1\n5.2\n77.1\n5.2\nOther\n.4\n(.1)\n—\n(.8)\nChanges in operating assets and liabilities, net of effect from acquisitions and divestitures of businesses:\nAccounts receivable\n4.8\n3.5\n(13.9)\n4.1\nInventories\n.9\n2.0\n(.1)\n4.4\nOther current assets\n(1.8)\n(8.5)\n8.0\n(10.3)\nCurrent liabilities\n3.0\n.6\n2.1\n11.6\nOther non-current assets\n(15.6)\n(5.8)\n(8.3)\n(12.9)\nOther non-current liabilities\n13.6\n7.9\n11.3\n11.1\nContributions to defined benefit plan\n(.3)\n—\n(7.6)\n(6.2)\nNet Cash Provided By (Used In) Operating Activities\n19.6\n9.9\n47.8\n50.9\nInvesting Activities:\nCapital expenditures\n(8.1)\n(9.1)\n(25.1)\n(25.6)\nProceeds from notes receivable\n—\n—\n3.8\n—\nAcquisitions of business, less cash acquired\n—\n(.1)\n(7.3)\n5.2\nProceeds from insurance settlements\n—\n.1\n—\n.1\nOther\n—\n(.1)\n—\n—\nNet Cash Provided By (Used In) Investing Activities\n(8.1)\n(9.2)\n(28.6)\n(20.3)\nFinancing Activities:\nProceeds from borrowings\n—\n—\n—\n346.5\nRepayment of debt obligations\n(.9)\n(150.9)\n(4.2)\n(340.9)\nPayments for debt refinancing\n—\n(.1)\n—\n(4.3)\nOther equity transactions\n(.2)\n—\n(.2)\n—\nRedemption of common shares for employee tax withholdings\n—\n(.2)\n(2.2)\n(.7)\nRestricted cash\n—\n155.9\n—\n—\nNet Cash Provided By (Used In) Financing Activities\n(1.1)\n4.7\n(6.6)\n.6\nEffect of exchange rate changes on cash\n3.0\n2.3\n3.4\n1.9\nNet Increase (Decrease) In Cash And Cash Equivalents\n13.4\n7.7\n16.0\n33.1\nCash and Cash Equivalents At Beginning Of Period\n74.6\n64.3\n72.0\n38.9\nCash And Cash Equivalents At End Of Period\n$\n88.0\n$\n72.0\n$\n88.0\n$\n72.0\nView original content with multimedia: http://www.prnewswire.com/news-releases/omnova-reports-51-volume-growth-in-specialties-for-q4-2017-and-35-for-full-year-2017-as-the-companys-strategy-gains-momentum-300591038.html\nSOURCE OMNOVA Solutions Inc.", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/omnova-reports-51-volume-growth-in-specialties-for-q4-2017-and-35-for-full-year-2017-as-the-companys-strategy-gains-momentum-300591038.html", "http://www.omnova.com/"], "published": "2018-01-31T16:15:00.000+02:00", "crawled": "2018-01-31T17:52:51.001+02:00", "highlightTitle": ""}