{"organizations": [], "uuid": "f35cce98b97303ae45165816bfd09e2eedf45803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225228349&w=1200&r=LYNXMPEE0O1G6", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-britain-eu/eu-signals-some-flexibility-on-brexit-transition-idUSKBN1FE2OK", "country": "US", "domain_rank": 408, "title": "EU signals some flexibility on Brexit transition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:10:00.000+02:00", "replies_count": 0, "uuid": "f35cce98b97303ae45165816bfd09e2eedf45803"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu/eu-signals-some-flexibility-on-brexit-transition-idUSKBN1FE2OK", "ord_in_thread": 0, "title": "EU signals some flexibility on Brexit transition", "locations": [], "entities": {"persons": [{"name": "jan strup", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The European Union is willing to be flexible on the duration and other terms of a Brexit transition period, EU diplomats said as Britain prepares to detail its hopes for what happens after it leaves the bloc in March 2019. \nA document to be formally endorsed by EU ministers on Monday and seen by Reuters confirmed a readiness to amend a period set to last just 21 months, to consider letting London sign trade deals with other countries around the world before 2021, and to launch new EU-British partnerships in areas like security and defense before waiting for the transition period to end. \nBritain’s Brexit Secretary David Davis is expected to spell out on Friday London’s aims for the next round of negotiation with Brussels, which both sides want to result in a provisional agreement by March that will ease business concerns about what will happen once Britain is out of the EU on March 30, 2019. \nSince striking an interim accord a month ago under which Britain agreed to settle tens of billions of euros of financial commitments to Brussels and guarantee rights for EU citizens living there, the other 27 EU states agreed among themselves a set of conditions for a transition that will largely preserve the status quo until December 2020 but deny Britain any say. \nBritain has raised little public objection to terms that include insisting that even EU citizens who arrive in Britain after Brexit - but before the end of the transition - will be entitled to residence rights for life. \nDavis may give more indication of Britain’s position on Friday. He is expected to resume regular negotiating rounds in Brussels once EU ministers confirm their instruction to his EU counterpart Michel Barnier on Monday. \nHowever, Davis may also repeat his exhortation to hardline Brexit supporters in Britain to ease off on criticism of the fact that the country will remain bound by essentially all EU rules, including on immigration and the supremacy of EU courts, for nearly two years after Brexit. \nEarlier this week he dismissed a suggestion that Britain would be a “vassal state” and urged critics to focus on the opportunities of a future, looser relationship. \nDOCUMENT An annex to the negotiating directives to be agreed by ministers meeting in Brussels on Monday, seen by Reuters, includes statements by the other 27 governments of three areas in which they are willing to consider flexibility: \nFirst, on forging new security and defense partnerships without waiting for the transition to end; second, to update the directives depending on progress - a line that diplomats said meant that Britain would not necessarily be shoved off a “cliff edge” in 2021 if a new trade agreement was not ready; and third, that they might agree to let Britain sign new trade deals with others, despite being bound by EU trade rules in the transition. \nThe annex also contained a statement by the EU executive, the Commission, pledging to set out clear and consistent rules for Britain’s occasional non-voting participation in some EU meetings during the transition when its interests are at stake. \nSome British politicians have voiced disquiet that the EU might take advantage of the transition to force Britain into damaging situations. However, EU officials note that EU texts agreed last year spell out that both sides will be bound by a principle of “sincere cooperation” while bound by EU treaties. \nAt the same time, however, EU officials have said this month that they are taking seriously their obligation to pursue the best interests of the 27 continuing member states and are looking at how existing relationships across the range of EU activities could be changed to the EU’s advantage after Brexit. \nAdditional reporting by Alastair Macdonald and Gabriela Baczynska in Brussels, Elizabeth Piper in London; writing by Alastair Macdonald; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-25T20:10:00.000+02:00", "crawled": "2018-01-25T20:26:13.023+02:00", "highlightTitle": ""}