{"organizations": [], "uuid": "0ffb3b2da2fa68cc603cad89276d887fb731f53f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-steinhoff-intlnl-accounts/south-africas-central-bank-says-checking-whether-steinhoff-broke-fx-rules-idUSKBN1FK0T3", "country": "US", "domain_rank": 408, "title": "South Africa's central bank says checking whether Steinhoff broke FX rules", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:39:00.000+02:00", "replies_count": 0, "uuid": "0ffb3b2da2fa68cc603cad89276d887fb731f53f"}, "author": "", "url": "https://www.reuters.com/article/us-steinhoff-intlnl-accounts/south-africas-central-bank-says-checking-whether-steinhoff-broke-fx-rules-idUSKBN1FK0T3", "ord_in_thread": 0, "title": "South Africa's central bank says checking whether Steinhoff broke FX rules", "locations": [], "entities": {"persons": [{"name": "steinhoff", "sentiment": "negative"}, {"name": "steinho", "sentiment": "negative"}, {"name": "alexander", "sentiment": "none"}, {"name": "wendell roelf", "sentiment": "none"}, {"name": "james macharia", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reserve bank", "sentiment": "none"}, {"name": "fx", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAPE TOWN (Reuters) - Steinhoff has reported its former chief executive Markus Jooste to South Africa’s elite Hawks police unit over suspected corruption, its acting chairwoman told a parliamentary committee hearing on Wednesday.\nThe South African retailer, whose more than 40 brands include Britain’s Poundland, revealed accounting irregularities in December, causing an 85 percent fall in its share price that wiped more than $10 billion off its market value.\nIt has since been scrambling to sell assets and find short-term funds to avoid parts of its business pulling down the sprawling retail empire which became one of the world’s largest household goods retailers.\n“Based on our investigations to date, we have reported the former CEO Markus Jooste to the Hawks ... The matter is now in the hands of the Hawks for investigation and prosecution,” Steinhoff’s acting chairwoman Heather Sonn told the committee, citing the Prevention and Combating of Corrupt Practices Act.\nJooste, who oversaw the company’s rapid expansion over almost two decades, resigned on Dec. 5 as the accounting scandal broke. The former CEO has not made a public statement since and could not immediately be reached for comment on Wednesday.\n“We don’t know at this stage if the crisis could have been prevented,” Sonn told the joint finance, public accounts and public service administration committee that was called to get preliminary information on Steinhoff.\nShe said the company was committed to fixing what went wrong and that it was co-operating fully with all regulators.\nThe Hawks - whose full name is the Directorate of Priority Crime Investigation - is responsible for investigating national criminal priorities such as serious organized and commercial crimes and serious corruption.\nHangwani Mulaudzi, the Hawks spokesman, told Reuters the unit opened a case to investigate Steinhoff in December and has sought the help of Interpol in its inquiry.\n“No one is in custody, no one has reported to the Hawks, and we have not yet visited the offices to look at the company’s computers or books. We have a case plan, a schedule and we will go step-by-step, this is a complicated case,” he said.\n“We have written to Interpol seeking assistance in investigating Steinhoff’s activities abroad,” Maulaudzi said.\nSteinhoff shares fell around 2 percent as the hearing was taking place.\n“ABSOLUTE TURMOIL”\nSteinhoff officials said that retention of jobs, including 50,000 in South Africa, was one of the company’s key aims.\nSteinhoff’s former chairman and leading shareholder Christo Wiese, who also spoke at the hearing, said the scandal “came like a bolt from the blue”. Wiese said he became aware of problems at Steinhoff three working days before the company’s accounts had to finalised for a board meeting in December. He said Steinhoff was in “absolute turmoil” at the time “when this bomb exploded”, adding he “understood people’s anger”.\nSouth Africa’s Financial Services Board (FSB) said it was investigating two cases of possible insider trading and one of false or misleading statements relating to Steinhoff, while the Johannesburg Stock Exchange said it was still far from uncovering what had happened.\nMeanwhile, South Africa’s central bank said it was investigating whether Steinhoff had breached any exchange control laws or regulations. Were Steinhoff to collapse, it would not result in financial instability, the bank added.\nWriting by James Macharia; editing by Alexander Smith\n ", "external_links": [], "published": "2018-01-31T09:39:00.000+02:00", "crawled": "2018-01-31T10:18:43.005+02:00", "highlightTitle": ""}