{"organizations": [], "uuid": "dc710ff5fa902e039d5223a5e9908f9a8c0ff14b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/18/104478606-Comcast_offices.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/comcast-shares-fall-after-nomura-instinet-downgrade.html", "country": "US", "domain_rank": 767, "title": "Comcast shares fall after Nomura Instinet downgrade", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:49:00.000+02:00", "replies_count": 0, "uuid": "dc710ff5fa902e039d5223a5e9908f9a8c0ff14b"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/18/comcast-shares-fall-after-nomura-instinet-downgrade.html", "ord_in_thread": 0, "title": "Comcast shares fall after Nomura Instinet downgrade", "locations": [], "entities": {"persons": [{"name": "jeffrey kvaal", "sentiment": "none"}, {"name": "kvaal", "sentiment": "none"}], "locations": [], "organizations": [{"name": "comcast", "sentiment": "negative"}, {"name": "nomura instinet", "sentiment": "negative"}, {"name": "t-mobile", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "sprint", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeff Chiu | AP Comcast Corporation chairman & CEO Brian Roberts. \nComcast faces increasing challenges that will likely keep its stock at bay in 2018, according to one Wall Street bank. \nNomura Instinet downgraded shares to neutral from buy on Thursday, saying the media giant will confront a \"narrowing runway\" as over-the-top competitors drive declines in traditional video and broadband growth stalls. \nBroadband growth \"may narrow as a decline in DSL subscribers, rising fiber competition from telco rivals, and wireless technologies, such as LTE Advanced and 5G, emerge,\" wrote analyst Jeffrey Kvaal. \"We consider the proliferation of aggressively priced – if often limited – over the top competition likely to intensify in 2018. AT&T , T-Mobile , and Sprint have bundled video with mobile to reduce churn; Verizon should launch a bundled over the top service shortly.\" \nComcast rose slightly Thursday. Kvaal's new $45 price target represents 8 percent upside over the next year. \nThe news and entertainment company has become the largest broadband and cable provider in the country through strategic acquisitions and other initiatives over the past few decades, including CNBC parent NBCUniversal. Its competitive maneuvering, though, may be forced to take a new path as the industry evolves. \nTelecommunications companies like AT&T and Verizon have started offering video packages directly over the internet, vying for viewers traditionally claimed by the nation's largest cable corporations. \nTo be sure, Kvaal said, the media conglomerate does have positive catalysts in the pipeline. Advertising revenue from major sporting events like the Super Bowl and the Winter Olympics should contribute to stronger fiscal performance in the near term. \n\"While last year was impacted by a tough comp with the 2016 Summer Olympics, Comcast had its biggest ever upfront with inventory sold up 8 percent year over year,\" Kvaal said. \"We expect broadcast advertising revenue to increase 22 percent in fiscal year 2018 as NBC has both the Super Bowl and the Olympics coming up in the first quarter. NBC executive recently forecasted $1.4 billion in additional revenue for the Olympics and Super Bowl.\" \nThe \"drumbeat for a broader mobile entry [is] unlikely to fade\" either, said the analyst, who argued that Comcast's Wi-Fi network will offer \"neither the quality nor economics\" of owning a cellular network. \n—CNBC's Michael Bloom contributed to this report. \nDisclosure: Comcast is the owner of NBCUniversal, the parent company of CNBC and CNBC.com.", "external_links": [], "published": "2018-01-18T15:49:00.000+02:00", "crawled": "2018-01-18T16:10:43.045+02:00", "highlightTitle": ""}