{"organizations": [], "uuid": "8633f07c62bdf6504e75c3244fec66efeaf2bbe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-targa-resources-partners-lp-announces-monthly-distribution-on-preferred-units.html", "country": "US", "domain_rank": 767, "title": "Targa Resources Partners LP Announces Monthly Distribution on Preferred Units", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-17T00:15:00.000+02:00", "replies_count": 0, "uuid": "8633f07c62bdf6504e75c3244fec66efeaf2bbe7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-targa-resources-partners-lp-announces-monthly-distribution-on-preferred-units.html", "ord_in_thread": 0, "title": "Targa Resources Partners LP Announces Monthly Distribution on Preferred Units", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}], "organizations": [{"name": "targa resources partners lp", "sentiment": "negative"}, {"name": "targa resources partners lp targa resources partners lp", "sentiment": "none"}, {"name": "targa resources corp.", "sentiment": "none"}, {"name": "trc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Targa Resources Partners LP (“Targa Resources Partners” or the “Partnership”) (NYSE: NGLS PR A) announced its monthly distribution on the Partnership’s 9.00% Series A Fixed-to-Floating Rate Cumulative Redeemable Perpetual Preferred Units (\"Series A Preferred Units\") for January 2018.\nTarga Resources Partners LP announced today that the board of directors of its general partner has declared a monthly cash distribution of 18.75¢ per Series A Preferred Unit, or $2.25 per Series A Preferred Unit on an annualized basis, for January 2018. This cash distribution will be paid February 15, 2018 on all outstanding Series A Preferred Units to holders of record as of the close of business on January 31, 2018.\nAbout Targa Resources Partners LP\nTarga Resources Partners LP is a Delaware limited partnership formed in October 2006 by its parent, Targa Resources Corp. (“TRC” or the “Company”), to own, operate, acquire and develop a diversified portfolio of complementary midstream energy assets. On February 17, 2016 TRC completed the acquisition of all outstanding common units of the Partnership. Targa Resources Corp. is a leading provider of midstream services and is one of the largest independent midstream energy companies in North America. TRC owns, operates, acquires, and develops a diversified portfolio of complementary midstream energy assets. The Company is primarily engaged in the business of: gathering, compressing, treating, processing, and selling natural gas; storing, fractionating, treating, transporting, and selling NGLs and NGL products, including services to LPG exporters; gathering, storing, and terminaling crude oil; storing, terminaling, and selling refined petroleum products.\nThe principal executive offices of Targa Resources Partners LP are located at 811 Louisiana, Suite 2100, Houston, TX 77002 and their telephone number is 713-584-1000.\nFor more information please go to www.targaresources.com .\nForward-Looking Statements\nCertain statements in this release are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, included in this release that address activities, events or developments that the Partnership expects, believes or anticipates will or may occur in the future, are forward-looking statements. These forward-looking statements rely on a number of assumptions concerning future events and are subject to a number of uncertainties, factors and risks, many of which are outside the Partnership’s control, which could cause results expected by management of the Partnership. Such risks and uncertainties include, but are not limited to, weather, political, economic and market conditions, including a decline in the price and market demand for natural gas, natural gas liquids and crude oil, the timing and success of business development efforts; and other uncertainties. These and other applicable uncertainties, factors and risks are described more fully in the Partnership's filings with the Securities and Exchange Commission, including its Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. The Partnership does not undertake an obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.\nThis release is intended to be a qualified notice under Treasury Regulation Section 1.1446-4(b). Brokers and nominees should treat one hundred percent (100.0%) of Targa Resources Partners LP’s distributions to foreign investors as being attributable to income that is effectively connected with a United States trade or business. Accordingly, Targa Resources Partners LP’s distributions to foreign investors are subject to federal income tax withholding at the highest applicable effective tax rate.\nInvestor contact:\n713-584-1133\nSanjay Lad\nDirector – Investor Relations\nJennifer Kneale\nVice President - Finance\nSource:Targa Resources Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=OV9fs7Y4goxUkwbjr3tCCUdWqBJh8EzeXkm-37Vz9xwydjNtSS0v13Pxmrukwc0kOZfGTfBhp3Qy6NhrgTvbi5Ch5B4uqIAhgVZ-8t2QJfI=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4adbb0ec-38d0-43ea-8650-c8ebf185d0be"], "published": "2018-01-17T00:15:00.000+02:00", "crawled": "2018-01-17T00:03:21.007+02:00", "highlightTitle": ""}