{"organizations": [], "uuid": "943b526e040d14e95c8b0af63f085c1c5a795985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-pier-1-imports-brings-in-new-chief-financial-officer-to-embark-on-strategic-plan.html", "country": "US", "domain_rank": 767, "title": "Pier 1 Imports Brings in New Chief Financial Officer to Embark on Strategic Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:15:00.000+02:00", "replies_count": 0, "uuid": "943b526e040d14e95c8b0af63f085c1c5a795985"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-pier-1-imports-brings-in-new-chief-financial-officer-to-embark-on-strategic-plan.html", "ord_in_thread": 0, "title": "Pier 1 Imports Brings in New Chief Financial Officer to Embark on Strategic Plan", "locations": [], "entities": {"persons": [{"name": "walsh", "sentiment": "none"}, {"name": "darla d. ramirez", "sentiment": "none"}, {"name": "nancy a. walsh", "sentiment": "none"}, {"name": "nancy", "sentiment": "none"}, {"name": "alasdair james", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WORTH, Texas--(BUSINESS WIRE)-- Pier 1 Imports, Inc. (NYSE:PIR) today announced the appointment of Nancy A. Walsh, 57, as Executive Vice President and Chief Financial Officer, effective January 25, 2018. Ms. Walsh will be responsible for financial operations and accounting, including financial reporting, planning and analysis, treasury, tax and investor relations. Darla D. Ramirez will step down as Interim Chief Financial Officer when Ms. Walsh’s appointment becomes effective, and will continue to serve as the Company’s Principal Accounting Officer and Vice President – Controller of the Company’s operating subsidiaries.\n“Nancy comes to Pier 1 Imports with an extensive background in finance and retail,” said Alasdair James, President and CEO. “She has spent the better part of her 30-year career amidst iconic brands, home furnishings and specialty retail. We are confident Nancy has the financial skills and leadership needed to drive the strategic plans we’re presently developing. We are excited to have her join the Pier 1 Imports team.”\nMs. Walsh joins Pier 1 Imports from The Bon-Ton Stores, Inc. (OTCQX:BONT), where she served as Executive Vice President and Chief Financial Officer since 2015. Previously, Ms. Walsh spent 14 years in the finance organization at Tapestry, Inc. (NYSE:TPR), formerly Coach, Inc. She began her tenure with Coach as Chief Financial Officer of the Worldwide Wholesale Division and held positions of increasing responsibility until being named Senior Vice President, Finance, a role she held for six years. Earlier in her career, Ms. Walsh held positions in Finance and Treasury with Viacom, Inc. (NASDAQ:VIAB) and Timberland Company (NASDAQ:TSBK). She has a B.A. from University of New Hampshire – Durham and an M.B.A. from Northeastern University.\nCommenting on the appointment, Ms. Walsh stated, “I am thrilled to be joining Pier 1 Imports at this critical time for the Company. I look forward to working with Alasdair and the team to embark on this pivotal new chapter and execute against a new strategic plan. It is exciting to have the opportunity to drive important change and create shareholder value while redefining a brand with such tremendous history.”\nFinancial Disclosure Advisory\nExcept for historical information contained herein, the statements in this press release or otherwise made by our management in connection with the subject matter of this press release are forward-looking statements (as such term is defined in the Private Securities Litigation Reform Act of 1995) and involve risks and uncertainties and are subject to change based on various important factors. This press release includes forward-looking statements that are based on management’s current estimates or expectations of future events or future results. These statements are not historical in nature and can generally be identified by such words as “believe,” “expect,” “estimate,” “anticipate,” “plan,” “may,” “will,” “intend” and similar expressions. Management’s expectations and assumptions regarding future results are subject to risks, uncertainties and other factors that could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements included in this press release. These risks and uncertainties include, but are not limited to: the effectiveness of the Company’s marketing campaigns, merchandising and promotional strategies and customer databases; consumer spending patterns; inventory levels and values; the Company’s ability to implement planned cost control measures and its three-year strategic plan; expected benefits from the real estate optimization initiative, including cost savings and increases in efficiency; risks related to U.S. import policy; and changes in foreign currency values relative to the U.S. Dollar. These and other factors that could cause results to differ materially from those described in the forward-looking statements contained in this press release can be found in the Company’s Annual Report on Form 10-K and in other filings with the SEC. Refer to the Company’s most recent SEC filings for any updates concerning these and other risks and uncertainties that may affect the Company’s operations and performance. Undue reliance should not be placed on forward-looking statements, which are only current as of the date they are made. The Company assumes no obligation to update or revise its forward-looking statements.\nAbout Pier 1 Imports\nPier 1 Imports is dedicated to offering customers exclusive, one-of-a-kind products that reflect high quality at a great value. Starting with a single store in 1962, Pier 1 Imports’ product is now available in retail stores throughout the U.S. and Canada and online at pier1.com . For more information about Pier 1 Imports or to find the nearest store, please visit pier1.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006164/en/\nThe Blueshirt Group\nChristine Greany, 858-523-1732\nSource: Pier 1 Imports, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180103006164/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pier1.com&esheet=51736940&newsitemid=20180103006164&lan=en-US&anchor=pier1.com&index=1&md5=caa6458a19bcd565f689184a80afe6ca"], "published": "2018-01-04T00:15:00.000+02:00", "crawled": "2018-01-04T00:40:01.000+02:00", "highlightTitle": ""}