{"organizations": [], "uuid": "ea62f574ce6c7cdad635e912b609f30e2f874852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-corix-responds-to-minority-shareholders-lawsuit.html", "country": "US", "domain_rank": 767, "title": "Corix Responds to Minority Shareholders Lawsuit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:41:00.000+02:00", "replies_count": 0, "uuid": "ea62f574ce6c7cdad635e912b609f30e2f874852"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-corix-responds-to-minority-shareholders-lawsuit.html", "ord_in_thread": 0, "title": "Corix Responds to Minority Shareholders Lawsuit", "locations": [], "entities": {"persons": [{"name": "corix", "sentiment": "none"}, {"name": "michael ogburn", "sentiment": "none"}, {"name": "george sharp", "sentiment": "none"}, {"name": "sharp", "sentiment": "none"}], "locations": [{"name": "wyoming", "sentiment": "none"}, {"name": "az", "sentiment": "none"}], "organizations": [{"name": "corix bioscience, inc.", "sentiment": "neutral"}, {"name": "corix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SURPRISE, AZ, Jan. 10, 2018 (GLOBE NEWSWIRE) -- Corix Bioscience, Inc., (OTCQB: CXBS) a Wyoming corporation (“Corix”), acknowledges receipt of the lawsuit filed by a minority shareholder named George Sharp. Mr. Sharp holds 0.01% of Corix’s issued and outstanding shares of common stock. Mr. Sharp has filed numerous lawsuits against publicly reporting companies alleging the same or similar claims.\nCorix’s Chief Executive Officer, Michael Ogburn stated, “Corix denies all allegations of wrongdoing and will respond accordingly through the judicial process. Notwithstanding his claims that Corix has diminished value, Mr. Sharp has made settlement proposals to the company demanding not only financial remuneration, but also the issuance of additional stock. Corix believes this proposal contradicts Mr. Sharp’s allegations that the company is not viable or is being used as a conduit for fraudulent activity.”\nMr. Sharp recently issued a press release dated January 2, 2018 outlining the allegations in his Complaint against Corix. Corix similarly denies uniformly the allegations in Mr. Sharp’s press release as inaccurate and untrue. Corix believes Mr. Sharp’s press release is part of a pattern of abusive litigation tactics aimed at pressuring Corix to enter into a quick settlement. In fact, courts have previously barred Mr. Sharp from issuing inaccurate or defamatory press releases in cases similar to this. An example can be found here:\nhttp://floridalawsuit.yolasite.com/resources/Injunction%20-%20Executed%209-16-2013.pdf\nCorix will provide updates to this press release upon developments in this litigation.\nAbout Corix Bioscience Inc.\nCorix Bioscience, Inc. (“Corix”) is a fully reporting Wyoming corporation listed as OTCQB:CXBS. Corix is the developer of proprietary cannabis and industrial hemp strains using tissue cell cultures to propagate living plants, with plans to patent the strains to be used in the pharmaceutical medical industries.\nOur methods allow us to create and breed new and existing plant strains from tissue cells free of any pathogens or disease. We grow these plants to maturity and extract the oils which are the “medicine” part of the plant. Our sales are focused towards the medical industry and we are developing brand named products to be released in early 2018.\nCompany headquarters are in Phoenix, Arizona and with our laboratory and processing facility in Carson City, Nevada and we grow in Genoa, Nevada. We are currently looking at expanding our footprint into Washington, Oregon, California and Arizona. The Company’s mission is to create clean and consistent products in medical grade facilities. Consistency being the key which will ultima yield a safer and superior product, better for people and the environment. For more information, please visit Corix’s website at www.corixbioscience.com\nForward Looking Statement\nThis press release, and those statements regarding Corix Bioscience (the “Company”), contain forward-looking statements that relate to expectations, beliefs, projections, future plans and strategies, anticipated events and similar expressions. Forward-looking statements may be identified by use of words such as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" or \"potential\" or similar words or phrases which are predictions of or indicate future events or trends. Statements such as those concerning potential acquisition activity, investment objectives, strategies, opportunities, other plans and objectives for future operations or economic performance are based on the Company's current expectations, plans, estimates, assumptions and beliefs that involve numerous risks and uncertainties. You are cautioned not to place undue reliance on any forward-looking statements and the Company disclaims any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, new information, future events or other changes. Please refer to Company's filings with the Securities and Exchange Commission for further information.\nRelated Links: http://www.corixbioscience.com\nContact: Christ Froese 623 551 5808 CFroese@CorixBioscience.com\nSource:Corix Bioscience Inc.", "external_links": ["http://floridalawsuit.yolasite.com/resources/Injunction%20-%20Executed%209-16-2013.pdf", "https://www.globenewswire.com/Tracker?data=Re6loml8-ewYJbia4Vk_4CTUH-f3ty5m4duGHdGLQqM3VE2RKbC_ueth4rIpoRd029yXwrOqW3BvWLOmvy8b6OEEtbx1ptIq7PxfRHSgi28=", "https://www.globenewswire.com/Tracker?data=NsC5DEAzYzrhb2zGkuqOO4p4jIRGv6qn1X7DecD-yKtFDv5gPaCiOhgkgAuaxhPWvoOfu5Olx9SFC7Z8EYLngPfOqBgjyIIAm-yhxcXjFXHmuIBbGeIMzXeByfueMCkbvcEY7pVDVcw7XpOMpgZam93iI192uMc4ePbXJ6uZXHS8apEEKEs3G9FFavhogGNWTOPibIDcMCf-d88jzu4RbkEO0Slufku37KZpdd_nB6oeolmw-0ggm2lsKZIARwW-IUcoyeCxM3ZTFU8SJKDcyw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/6e720353-082f-4153-95c6-1eea5863f7d7", "https://www.globenewswire.com/Tracker?data=NsC5DEAzYzrhb2zGkuqOO44WgUk13COFg-QOexsLbOU0U0G1kXEFsxdD5QUd90CntRkFpgu_8oohJp54pWx4azWguambimT2L5celkXe_UBx5r1Tj5HiRrFINHf4Jv_n"], "published": "2018-01-11T00:41:00.000+02:00", "crawled": "2018-01-11T01:33:35.007+02:00", "highlightTitle": ""}