{"organizations": [], "uuid": "90bc35f2155e72d9a621e0f8b25f302080a6863c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/05/104146859-GettyImages-462520250.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/knight-frank-apac-expect-more-countries-to-join-the-belt-and-road.html", "country": "US", "domain_rank": 767, "title": "Knight Frank APAC: Expect more countries to join the Belt and Road", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.472, "site_type": "news", "published": "2018-01-30T08:34:00.000+02:00", "replies_count": 0, "uuid": "90bc35f2155e72d9a621e0f8b25f302080a6863c"}, "author": "Andrew Wong", "url": "https://www.cnbc.com/2018/01/30/knight-frank-apac-expect-more-countries-to-join-the-belt-and-road.html", "ord_in_thread": 0, "title": "Knight Frank APAC: Expect more countries to join the Belt and Road", "locations": [], "entities": {"persons": [{"name": "nicholas holt", "sentiment": "none"}, {"name": "holt", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}], "organizations": [{"name": "knight frank apac", "sentiment": "neutral"}, {"name": "cnbc", "sentiment": "none"}, {"name": "knight frank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The growing hype around China's massive global infrastructure push may be due to a fear of missing out, according to a research chief at real estate agency Knight Frank.\nThat is, more countries are expressing interest in China's so-called Belt and Road Initiative because of just how big it is growing, Nicholas Holt, the firm's Asia Pacific head of research, told CNBC.\n\"A lot of markets outside the initial sort of program are now trying to get a piece of the action,\" Holt said. \"We're seeing that the Belt and Road, which is a very inclusive and very large initiative, is starting to talk about countries in South America and even in Western Europe .\"\nThe Belt and Road Initiative aims to connect Asia, Europe, the Middle East and Africa with a vast logistics and transport network, using roads, ports, railway tracks, pipelines, airports, transnational electric grids and even fiber optic lines. The plan, which continues to evolve, at one point included 65 countries, which together accounted for one-third of global GDP and 60 percent of the world's population, or 4.5 billion people, according to Oxford Economics.\nIt's all part of Beijing's push to increase global clout — building modern infrastructure can attract more investment and trade along the route. The policy could also boost the domestic economy with demand abroad, and might soak up some of the overcapacity in China's industrial sector .\nHolt predicted that more countries would join the Belt and Road in the near future.\n\"If you remember when it was first announced in 2013, people were very confused with what it is,\" Holt said. \"I don't even think the Chinese knew what it was back then. But, it's taken more form over the last four years.\"\nThe initiative, he added, has \"really gained a lot of momentum.\"\n\"So yes, the initiative is growing and we do expect more countries to get on board as it builds up steam.\"\nEtienne Oliveau | Pool | Getty Images Chinese President Xi Jinping shakes hand with British Prime Minister Theresa May on September 5, 2016. Holt also said he believes the trade relations between the U.K. and China remains strong, predicting that trade relations between the two countries would improve.\n\"We're still really in the golden era or golden age that was announced a couple of years ago,\" Holt said of the bilateral relationship. \"Trade has grown significantly between the U.K. and China. The bilateral trade now accounts for $60 billion.\"\nThe researcher also said he hopes U.K. Prime Minister Theresa May's upcoming visit to China will help open up dialogue and increase access into the Chinese market.", "external_links": [], "published": "2018-01-30T08:34:00.000+02:00", "crawled": "2018-01-30T08:34:25.000+02:00", "highlightTitle": ""}