{"organizations": [], "uuid": "77a3a05c989f4febb03fbbbcbd7f70e955ee1845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/lockheed-martin-f-35-fighter-jets-testing.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/lockheed-martin-f-35-fighter-jets/", "country": "US", "domain_rank": 1196, "title": "Only Half of Lockheed-Martin F-35 Jets Are Ready to Fly | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.303, "site_type": "news", "published": "2018-01-24T11:07:00.000+02:00", "replies_count": 0, "uuid": "77a3a05c989f4febb03fbbbcbd7f70e955ee1845"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/24/lockheed-martin-f-35-fighter-jets/", "ord_in_thread": 0, "title": "Only Half of Lockheed-Martin F-35 Jets Are Ready to Fly | Fortune", "locations": [], "entities": {"persons": [{"name": "robert behler", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "lockheed-martin", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "lockheed martin corp.", "sentiment": "negative"}, {"name": "pentagon", "sentiment": "none"}, {"name": "defense department", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 9:07 AM EST \nEfforts to improve the reliability of Lockheed Martin Corp.’s F-35 are “stagnant,” undercut by problems such as aircraft sitting idle over the last year awaiting spare parts from the contractor, according to the Pentagon’s testing office. \nThe availability of the fighter jet for missions when needed — a key metric — remains “around 50 percent, a condition that has existed with no significant improvement since October 2014, despite the increasing number of aircraft,” Robert Behler, the Defense Department’s new director of operational testing, said in an annual report delivered Tuesday to senior Pentagon leaders and congressional committees. \nThe F-35 section, obtained by Bloomberg News, outlined the status of the costliest U.S. weapons system as it’s scheduled to end its 16-year-old development phase this year. Starting in September, the program is scheduled to proceed to intense combat testing that’s likely to take a year, an exercise that’s at least 12 months late already. Combat testing is necessary before the plane is approved for full-rate production — the most profitable phase for Lockheed. \nPentagon officials including Deputy Defense Secretary Patrick Shanahan and chief weapons buyer Ellen Lord have highlighted the need to reduce the F-35’s $406.5 billion projected acquisition cost and its estimated $1.2 trillion price tag for long-term operations and support through 2070. Still, the Defense Department is moving to accelerate contracting and production for the fighter despite the persistence of technical and reliability issues disclosed in the current phase of development testing. Spare Parts, Tires \nThose issues include the increasing number of planes that are down awaiting spare parts, difficulties with the electro-optical targeting system and flaws in launching air-to-air missiles and GPS-guided air-to-ground munitions during weapons testing. \nA final version of the plane’s complex software has gone through 31 variations and has yet to be deployed because of “key remaining deficiencies,” the report found. The troubles also include more mundane issues, such as tires on the Marine Corps version of the plane, the F-35B, that are proving less than durable. \nThe upcoming testing, “which provides the most credible means to predict combat performance, likely will not be completed until” December 2019, according to the testing office. \nBy the end of testing designed to demonstrate that the F-35 is operationally effective and suitable for its missions more than 600 aircraft already will have been built. That’s about 25 percent of a planned 2,456 U.S. jets; 265 have been delivered to date. \nJoe DellaVedova, spokesman for the Pentagon’s F-35 program office, and Lockheed spokeswoman Carolyn Nelson had no immediate comment on the new testing office report. \nIn an earlier statement, Nelson said Lockheed’s 66 F-35 deliveries in 2017 represented “more than a 40 percent increase from 2016, and the F-35 enterprise is prepared to increase production volume year-over-year to hit full rate of approximately 160 aircraft in 2023.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T11:07:00.000+02:00", "crawled": "2018-01-24T21:35:25.000+02:00", "highlightTitle": ""}