{"organizations": [], "uuid": "0c5d6fc3bd4b4c15b00f1d0028dc350bc0d92e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-bonds-cenbank/update-1-indias-fixed-income-body-sets-higher-levels-for-dec-end-bond-yields-idUSL4N1P63AI", "country": "US", "domain_rank": 408, "title": "UPDATE 1-India's fixed income body sets higher levels for Dec-end bond yields", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-11T19:18:00.000+02:00", "replies_count": 0, "uuid": "0c5d6fc3bd4b4c15b00f1d0028dc350bc0d92e42"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-bonds-cenbank/update-1-indias-fixed-income-body-sets-higher-levels-for-dec-end-bond-yields-idUSL4N1P63AI", "ord_in_thread": 0, "title": "UPDATE 1-India's fixed income body sets higher levels for Dec-end bond yields", "locations": [], "entities": {"persons": [{"name": "suvashree choudhury", "sentiment": "negative"}, {"name": "dvssv prasad", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fixed income money market and derivatives association", "sentiment": "none"}, {"name": "reserve bank of india", "sentiment": "none"}, {"name": "fimmda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates with background, details)\nBy Suvashree Choudhury\nMUMBAI, Jan 11 (Reuters) - India’s fixed income trade body set yields for government bonds at levels higher than the actual closing levels for the quarter from October to December, a top official of the market association told Reuters on Thursday.\nFIMMDA sets the final closing levels for all the country’s bonds at the end of the quarter, typically at the exact closing price for the quarter, which becomes the benchmark all lenders and financial institutions must use when valuing their portfolio holdings.\nBut DVSSV Prasad, the chief executive of the Fixed Income Money Market and Derivatives Association (FIMMDA) said this time, in a rare move, the yields for government bonds had been set at the direction of the Reserve Bank of India, and reflected the levels about 5 minutes before the close of trade in the last day of the quarter.\nData from FIMMDA published on Wednesday evening showed the yields prescribed by the RBI were set at up to 15 bps higher than the actual closing levels, with the sharp increases tending to impact the more illiquid debt, including the 8.33 percent 2026 and the 6.79 percent 2029 bonds.\n“It was a regulatory instruction from the central bank and we, as a valuation agency, followed the instruction,” he said.\nTraders speculated the RBI stepped in to prescribe that prices be set at a few minutes before the close to tamp down a widespread practice of window dressing by Indian bond investors.\nIn particular, banks have traditionally jacked up bond prices in the closing minutes of a quarter to improve their mark-to-market performance and bolster balance sheets. Banks are the biggest bond investors in India.\nThe RBI has previously warned banks to refrain from such quarter-end activities, since they can produce large volatility in markets.\nFor banks, the move is likely to lead to significant mark-to-market losses given that bonds have sold off sharply in the October-December quarter, with the benchmark 10-year yield up 67 basis points.\n“This shows that RBI has no sympathy for banks,” said a foreign bank trader. “Banks had a tough quarter in December and on top of that RBI comes and takes such measures. This clearly shows that RBI has no problem with yields rising.”\nThe news has fuelled nervousness among bond traders, with the mood remaining bearish ahead of consumer inflation data due on Friday.\nThe benchmark 10-year bond yield was trading at 7.45 percent on Thursday, up 1 basis point from its previous close and 5 basis points higher from the day’s low. (Reporting by Suvashree Dey Choudhury; Editing by Rafael Nam and Clarence Fernandez)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T19:18:00.000+02:00", "crawled": "2018-01-12T18:35:35.018+02:00", "highlightTitle": ""}