{"organizations": [], "uuid": "ea78877f25d735090b615724366f23b2efd31dbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-hess-layoffs/hess-to-cut-hundreds-of-workers-as-it-battles-activist-investor-sources-idUSKBN1F524G", "country": "US", "domain_rank": 408, "title": "Hess to cut hundreds of workers as it battles activist investor-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:45:00.000+02:00", "replies_count": 0, "uuid": "ea78877f25d735090b615724366f23b2efd31dbc"}, "author": "", "url": "https://www.reuters.com/article/us-hess-layoffs/hess-to-cut-hundreds-of-workers-as-it-battles-activist-investor-sources-idUSKBN1F524G", "ord_in_thread": 0, "title": "Hess to cut hundreds of workers as it battles activist investor-sources", "locations": [], "entities": {"persons": [{"name": "hess", "sentiment": "negative"}, {"name": "lorrie hecker", "sentiment": "none"}, {"name": "ernest scheyder", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "hess", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "hess corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON (Reuters) - Hess Corp ( HES.N ) is cutting roughly 13 percent of its workforce and streamlining operations as it battles an activist hedge fund shareholder pushing for the U.S. oil and gas producer to post its first quarterly profit since 2014.\nMost of the cuts, which could start as early as Tuesday and continue through the week, are in Houston, home to a majority of the company’s employees, according to two sources familiar with the matter.\nLorrie Hecker, a Hess spokeswoman, confirmed the cuts, saying about 300 workers, or about 13 percent of the company’s workforce, would be dismissed. The cuts also include an unknown number of contractors, who are not full-time employees.\nHedge fund Elliott Management Corp last month launched an activist campaign against Hess, saying it was frustrated by the company’s “continuing underperformance” and floated the idea of pushing to remove John Hess as chief executive.\nElliott declined to comment.\nExecutives from Hess’ New York headquarters were flying to Houston on Tuesday to meet with employees. The job cuts are part of a plan to reduce expenses by more than $150 million a year, the company said.\n“We are doing all we can to ease the transition for employees who are impacted including severance, outplacement assistance and other benefits and support,” Hecker said in an emailed statement to Reuters.\nThe cuts come despite a more than 20 percent rise in oil CLc1 prices in the past three months as the U.S. shale industry recovers on rising demand and shrinking global stockpiles.\nHess did not have major staff cuts two years ago even as some peers let thousands of workers go, with executives publicly saying they would retain talent in anticipation of a price rebound. Recent asset sales and pressure from investors to improve results have the company reversing course just as rivals post improved results from rising commodity prices.\nHess previously hived off assets in response to demands from Elliott and others. Last year the company sold its interests in projects in Norway and Equatorial Guinea. Some employees being let go had roles connected to those assets, one of the two sources said.\nHess has been stockpiling $2.53 billion in cash and short-term investments in order to fund its share of costs for an oil project off the coast of Guyana run by Exxon Mobil Corp ( XOM.N ). The first phase requires Hess to contribute $955 million out of the $4.4 billion total investment.\nHess shares fell about 1.6 percent to $53.67 in afternoon trading.\nReporting by Ernest Scheyder; Editing by Phil Berlowitz\n ", "external_links": [], "published": "2018-01-16T18:45:00.000+02:00", "crawled": "2018-01-16T19:05:28.012+02:00", "highlightTitle": ""}