{"organizations": [], "uuid": "0d948ed96b0716c6b230d4f5487f9bcdd2a4ed1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/facebook-uses-a-i-far-beyond-human-powered-m-assistant.html", "country": "US", "domain_rank": 767, "title": "Facebook uses A.I. far beyond human-powered M assistant", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.643, "site_type": "news", "published": "2018-01-08T23:41:00.000+02:00", "replies_count": 0, "uuid": "0d948ed96b0716c6b230d4f5487f9bcdd2a4ed1c"}, "author": "Jordan Novet", "url": "https://www.cnbc.com/2018/01/08/facebook-uses-a-i-far-beyond-human-powered-m-assistant.html", "ord_in_thread": 0, "title": "Facebook uses A.I. far beyond human-powered M assistant", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "alexa", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "cortana", "sentiment": "none"}], "locations": [{"name": "barcelona", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "cnbc facebook", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Brad Quick | CNBC Facebook CEO Mark Zuckerberg delivers a keynote address at the Mobile World Congress in Barcelona, Spain. \nIn an age of Alexa, Cortana, the Google Assistant and Siri, Facebook wanted to provide the world with an assistant that could do more. In 2015 the company launched M in its Messenger chat app. \nM wasn't just another chatbot that was trained to provide text responses based on previous conversations, using artificial intelligence. It had the power to take care of practically any task, as long as it wasn't illegal, because people were really doing the work . It was limited in its deployment, with M being made available to around 2,000 people, the Verge said, out of 1.3 billion Messenger users. \nLast year Facebook altered M by introducing automatic actions and responses into Messenger conversations for millions of people. And on Monday, the company finally did away with the human-powered version of M altogether. \nRelative to Facebook's expansive use of AI, M assistant was never very significant. Every day, for billions of people, Facebook counts on AI to make sense of text, speech, photos and videos. \nHere's an incomplete list of ways Facebook uses AI at a bigger scale than the full-blown M assistant. Predicting reasonable responses to messages users receive in Facebook Messenger. Blocking offensive comments on Instagram posts. Stabilizing photos and videos that people post to Facebook. Figuring out which places people are referencing when they respond to friends' requests for recommendations in Facebook posts. Recognizing users' faces in photos posted to Facebook and informing them of it. Translating the text of posts that people publish on Facebook into different languages. Adding interesting visual effects to videos that people record using the camera in Facebook's mobile apps. Coming up with captions for the words people say in video ads that companies post to Facebook. Identifying the most relevant \"On This Day\" memories to show to users in their news feed. Removing content posted to Facebook from terrorist groups. Spotting Facebook posts and Facebook Live videos that could indicate a user is having suicidal thoughts. Filtering out Facebook ads and posts that lead to content that's not what it seems to be. Writing out captions for photos that people share on Facebook so their visually impaired friends can better understand the content. Ranking posts that will appear in each user's news feed. Determining the best ads to show to Facebook users. Selecting the right types of Facebook content to search through when a user types in the search box. \nFacebook first established its AI research lab in 2013, and the company has continued to hire for it. With that commitment, Facebook's use of AI is only going to increase. Jordan Novet Technology Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-08T23:41:00.000+02:00", "crawled": "2018-01-08T23:42:26.008+02:00", "highlightTitle": ""}