{"organizations": [], "uuid": "c8d79446763bfa67957ca1b6d924faeb6653ac18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-25-idUSL4N1PK19C", "country": "US", "domain_rank": 408, "title": "Morning News Call - India, January 25", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T05:16:00.000+02:00", "replies_count": 0, "uuid": "c8d79446763bfa67957ca1b6d924faeb6653ac18"}, "author": "", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-25-idUSL4N1PK19C", "ord_in_thread": 0, "title": "Morning News Call - India, January 25", "locations": [], "entities": {"persons": [{"name": "reddy", "sentiment": "none"}, {"name": "jerome peze", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "tinubu square", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "sbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Morning News Call - India edition will not be published on Friday, January 26 as markets are closed for Republic Day) To access the newsletter, click on the link: here If you would like to receive this newsletter via email, please register at: here FACTORS TO WATCH 6:30 pm: Dr. Reddy’s post-earnings analyst conference call in Mumbai. GMF: BITCOIN AND FINTECH We discuss Bitcoin, fintech and digital finance with Jerome Peze, CEO of Financial market professionals - Tinubu Square at 1530 IST. To join the conversation, click on the link: here INDIA TOP NEWS India to inject nearly $14 billion into state banks by March in recapitalisation bid India's government pledged on Wednesday to inject nearly $14 billion combined into all but one state-run lender by March in return for them implementing reforms, in a bid to boost lending and tackle a record bad debt problem. SBI expects loan demand to rise with government spending Demand for loans from Indian companies is still muted but should increase following more government spending on infrastructure projects, the head of the country's largest state-owned bank said on Wednesday. InterGlobe Aviation Q3 profit up 56 pct on higher ticket revenue InterGlobe Aviation, the owner of India's biggest airline IndiGo, said net profit surged over 56 percent in the third quarter, helped by higher passenger ticket revenue and credit received from manufacturers. Idea Cellular posts biggest ever quarterly loss Indian mobile carrier Idea Cellular reported its biggest ever quarterly net loss, which was also wider than what analysts had expected, as a sharp cut in interconnection fees earned from rivals eroded its revenue. Canara Bank Q3 profit slumps 61 percent Canara Bank said on Wednesday its third-quarter net profit plunged 61 percent, missing analysts' estimates, pulled down by higher provisions for bad loans. Biocon Q3 profit plunges 46 percent Biocon, India's biggest biotechnology firm, posted a 46 percent fall in third-quarter profit on Wednesday hurt by an increase in interest and depreciation costs related to its Malaysia operations. GLOBAL TOP NEWS Trump says he is willing to testify under oath in U.S.-Russia probe President Donald Trump said on Wednesday he would be willing to be interviewed under oath by Special Counsel Robert Mueller, who is investigating Russian meddling in the 2016 U.S. election. U.S. official backs weak dollar amid fears of trade war U.S. Treasury Secretary Steven Mnuchin welcomed a weaker dollar on Wednesday, sending the greenback reeling and underlining concerns that U.S. President Donald Trump is stepping up his attack on China and other big trading partners as part of his America First agenda. Ford says commodities prices hurt, needs to be 'far fitter' Ford Motor on Wednesday posted a lower-than-expected quarterly net profit, hurt by rising commodity costs and unfavorable currency exchange rates, and said it expected more pain to come from higher raw material prices in 2018. LOCAL MARKETS OUTLOOK (As reported by NewsRise) The SGX Nifty Futures was trading at 11,091.50, trading up 0.15 percent from its previous close. The Indian rupee will likely edge higher against the dollar in early session, tracking further sell-off in the greenback even as traders await outcome to the European Central Bank’s monetary policy today for further cues. Indian government bonds are likely to ease in early trade tracking overnight gains in crude oil prices and ahead of an auction of notes. The yield on the benchmark 7.17 percent bond maturing in 2028 is likely to trade in a 7.26 percent-7.30 percent band today, a trader with a primary dealership said. GLOBAL MARKETS • The S&P 500 was little changed on Wednesday while the Nasdaq lagged in choppy trading in the wake of comments by U.S. Commerce Secretary Wilbur Ross which hinted at action against China in a trade war. • Asian stocks held near a record high though concerns about the Trump administration's protectionist stance cast a shadow on financial markets, while the dollar was under pressure after U.S. Treasury Secretary Steven Mnuchin welcomed a weaker currency. • The dollar wallowed near three-year lows against its peers after caving on comments by U.S. Treasury secretary Steven Mnuchin that he welcomed a weaker currency, while the euro steadied ahead of the European Central Bank's policy decision. • U.S. Treasury debt prices slumped on Wednesday, after Treasury Secretary Steven Mnuchin backed a weaker dollar to help boost America's global trade, breaking from the traditional strong currency policy of past administrations. • Oil prices hit their highest level since December 2014, lifted by a weak dollar and a 10th straight week of declines in U.S. crude inventories. • Gold prices held firm near 1-1/2-year highs hit in the previous session, with the dollar near three-year lows in the wake of comments by U.S. Treasury secretary Steven Mnuchin that he welcomed a weaker currency. CLOSE FII INVESTMENTS EQUITIES DEBT PNDF spot 63.61/63.64 January 24 $121.92 mln -$38.31 10-yr bond yield 7.41 pct Month-to-date $1.62 bln $939.29 Year-to-date $1.62 bln $939.29 For additional data: India govt bond market volumes Stock market reports Non-deliverable forwards data Corporate debt stories [IN CORPD] Local market closing/intraday levels [IN SNAPSHOT] Monthly inflows [INFLOWS RTRS TABLE IN] ($1 = 63.6500 Indian rupees)\n ", "external_links": [], "published": "2018-01-25T05:16:00.000+02:00", "crawled": "2018-01-25T05:37:58.000+02:00", "highlightTitle": ""}