{"organizations": [], "uuid": "df10f7c9d62912dfd6cdca5bc86af2c559e4c1b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-m-line-holdings-inc-agrees-terms-on-first-coal-mining-permit-addressing-asian-thermal-coal-shortage.html", "country": "US", "domain_rank": 767, "title": "M Line Holdings, Inc. Agrees Terms on First Coal Mining Permit, Addressing Asian Thermal Coal Shortage", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:32:00.000+02:00", "replies_count": 0, "uuid": "df10f7c9d62912dfd6cdca5bc86af2c559e4c1b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-m-line-holdings-inc-agrees-terms-on-first-coal-mining-permit-addressing-asian-thermal-coal-shortage.html", "ord_in_thread": 0, "title": "M Line Holdings, Inc. Agrees Terms on First Coal Mining Permit, Addressing Asian Thermal Coal Shortage", "locations": [], "entities": {"persons": [{"name": "tony anish", "sentiment": "none"}], "locations": [{"name": "costa mesa", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "first coal mining permit", "sentiment": "negative"}, {"name": "line holdings, inc", "sentiment": "neutral"}, {"name": "line coal development, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Costa Mesa, CA, Jan. 30, 2018 (GLOBE NEWSWIRE) -- M Line Holdings, Inc. (OTC Pink: MLHC; \"M Line\" or the “Company”), announces that its new subsidiary, M Line Coal Development, Inc., has agreed terms to acquire its first coal mining permit. Definitive contracts are expected to be signed very shortly with production due to start in March 2018.\nThis project, based on the geological reports, will produce in excess of 300,000 tons of coal with profit of approximately $5.00 per ton and anticipated revenues over a 3 to 5 year period of $15 million depending on monthly production levels.\nTony Anish, CEO of M Line stated: “We are excited to agree terms on the first coal mining permit. We are looking at several coalmining permits and expect to agree terms on others in the near future. The current market for coal is excellent as demand exceeds supply. We are also working on contracts for our transportation company and will keep you informed as to our progress. Keep watching, there will be more news to come.”\nThe Company has identified this opportunity as the Coal that will be produced is intended for specific industrial uses overseas. Thermal Coal specifically has recently risen 10 percent on the back of a months long rally. The supply levels are as small as 2-3 days demand in some Asian markets.\nAbout M Line Holdings, Inc.\nM Line has historically been a holding Company with subsidiaries primarily involved in the aerospace industry and business financing. In the future, the Company will continue with its business financing activities, continue to contemplate aerospace opportunities as well as introduce new businesses to the group.\nSafe Harbor and Informational Statement\nThis press release may contain forward-looking information within the meaning of Section 21E of the Security Exchange Act of 1934, as amended (the Exchange Act), including all statements that are not statement of historical fact regarding the intent, belief or current expectations of the company, its directors or its officers with respect to, among other things: (i) the company's financing plans; (ii) trends affecting the company's financial conditions or results of operations; (iii): the company's growth strategy and operating strategy; and (iv) the declaration and payment of dividends.\nThe words \"may\", \"would\", \"will\", \"expect\", \"estimate\", \"anticipate\", \"believe\", \"intend\", and similar expressions and variations thereof are intend to identify . Investors are cautioned that any such forward-looking statement are not a guarantee of future of future performance and involve risks and uncertainties, many of which are beyond the company's ability to control, and that actual results may differ materially from those projected in the as a result of various factors including the risk disclosed in the company's statements and reports filed with the OTC Markets. The Company claims the safe harbor provided by Section 21E(c) of the Exchange Act for all .\nContact M Line Holdings, Inc. Tony Anish info@mlineholdings.com\nSource:M Line Holdings, Inc.", "external_links": [], "published": "2018-01-30T14:32:00.000+02:00", "crawled": "2018-01-30T15:37:56.008+02:00", "highlightTitle": ""}