{"organizations": [], "uuid": "a96ebd58ef727f45a9e3a6c04585ead211446454", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222701575&w=1200&r=LYNXMPEE0G0O6", "site_section": "http://feeds.reuters.com/reuters/UKRugbyNews", "section_title": "Reuters: Rugby News", "url": "https://uk.reuters.com/article/uk-rugby-union-england-jones/england-head-coach-jones-extends-contract-until-2021-idUKKBN1F619G", "country": "US", "domain_rank": 408, "title": "Rugby-England head coach Jones extends contract until 2021", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:18:00.000+02:00", "replies_count": 0, "uuid": "a96ebd58ef727f45a9e3a6c04585ead211446454"}, "author": "", "url": "https://uk.reuters.com/article/uk-rugby-union-england-jones/england-head-coach-jones-extends-contract-until-2021-idUKKBN1F619G", "ord_in_thread": 0, "title": "Rugby-England head coach Jones extends contract until 2021", "locations": [], "entities": {"persons": [{"name": "rugby-england", "sentiment": "negative"}, {"name": "jones", "sentiment": "negative"}, {"name": "eddie jones", "sentiment": "none"}, {"name": "aditi prakash", "sentiment": "none"}, {"name": "hugh lawson", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "rugby football union", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:13 AM / Updated an hour ago England coach Jones extends contract until 2021 Mitch Phillips 4 Min Read \nLONDON (Reuters) - England coach Eddie Jones has extended his contract to 2021 where he will work with his eventual successor in the final year, though the handover process might be cut off at the knees if England fail again at the 2019 Rugby World Cup. \nJones, who has won 22 of his 23 tests since taking over from Stuart Lancaster at the end of 2015, was originally contracted until the end of next year’s World Cup. The new deal runs for a further two years, including a year mentoring his successor, but includes a break clause based on England’s performance in Japan. \nThe RFU’s CEO Steve Brown declined to give details of exactly what “success” in 2019 would represent following England’s pool stage exit in 2015. But, in a hastily-convened Twickenham news conference on Wednesday, he and Jones dropped enough hints to suggest that anything but winning the tournament would see Jones leaving and the succession plan in tatters. \n“We won’t go into specifics but the focus is on winning the World Cup,” Brown said. “We have a position that’s really clear if we don‘t.” \nIn November 2014, the RFU gave Lancaster a six-year contract extension, but 12 months later he was out of a job after the World Cup failure. \nAustralian Jones, 57, has led England to consecutive Six Nations triumphs as well as series wins in Australia and Argentina, taking them to number two behind New Zealand in the world rankings. He is the highest-paid national coach in the sport, earning a reported 500,000 pounds per year. \nJones, who had always said he planned to depart after the 2019 World Cup, said he was delighted to be asked to stay on in what had become a dream job. \n“I never take my role as England head coach for granted and did not presume I would be asked to stay on, but, once the conversations started very recently, it was not a difficult decision to make,” he said. Rugby Union - England - Eddie Jones Press Conference - Twickenham Stadium, London, Britain - January 17, 2018 England RFU CEO Steve Brown during the press conference Action Images via Reuters/Matthew Childs \n”It’s quite exciting. The team has great potential and I’d like to be involved in creating and sustaining a successful team. \n“The first priority is still to win the World Cup and then to make sure the guy taking over has a good team and good structure.” FUTURE PLANNING Slideshow (4 Images) \nBrown said the succession plan would involve the future head coach working with Jones until mid-2021, before taking over to lead England into the 2023 World Cup in France. \n“We now have a robust succession planning process in place which will avoid the historically disruptive pattern of resetting the coaching team and performance system every four years,” Brown said. \nBrown said that the process of identifying the new man was already underway and said everything was on the table. “We want the best coach for England not necessarily the best English coach,” he said. \nJones’s departure in 2021 would leave him available to lead the British and Irish Lions in South Africa that year, albeit with some potential shuffling as Lions officials now like their man to be full-time with them for much of the season preceding a tour. \nJones is likely to find the prospect appealing having achieved notable coaching success with England, Japan, South Africa and Australia. However, he predictably dodged the issue on Wednesday, saying his focus was entirely on England. \nHe will be back at Twickenham on Thursday to name his squad for the Six Nations, which begins for England away to Italy on Feb. 4. Reporting by Alan Baldwin/Aditi Prakash in Bengaluru/Mitch Phillips; Editing by Hugh Lawson and Christian Radnedge", "external_links": [], "published": "2018-01-17T12:18:00.000+02:00", "crawled": "2018-01-17T13:23:26.000+02:00", "highlightTitle": ""}