{"organizations": [], "uuid": "bed72159e786a81d8686096ff795582572482fc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/eu-health-technology/eu-proposes-joint-studies-to-speed-up-acceptance-of-new-medicine-idINKBN1FK1DY", "country": "US", "domain_rank": 408, "title": "EU proposes joint studies to speed up acceptance of new medicine", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:13:00.000+02:00", "replies_count": 0, "uuid": "bed72159e786a81d8686096ff795582572482fc5"}, "author": "", "url": "https://in.reuters.com/article/eu-health-technology/eu-proposes-joint-studies-to-speed-up-acceptance-of-new-medicine-idINKBN1FK1DY", "ord_in_thread": 0, "title": "EU proposes joint studies to speed up acceptance of new medicine", "locations": [], "entities": {"persons": [], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "national institute for health", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "institute for quality and efficiency in health care", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 11:17 AM / Updated 23 minutes ago EU proposes joint studies to speed up acceptance of new medicine Reuters Staff 3 Min Read \nBRUSSELS (Reuters) - The European Commission proposed on Wednesday joint clinical assessments to determine whether approved new drugs and medical devices offer value for money and should be prescribed for patients within national healthcare systems. \nThe joint action, set to take more than three years to enter force, would replace a largely national approach to health technology assessment (HTA) which duplicates work, offers limited transparency and impedes market access for innovation. \nThe Commission’s plans aim to make better use of available resources, to have a consistent methodology and to improve business predictability in a healthcare sector accounting for some 10 percent of the EU’s economic output. \nHTA is used by many European countries. \nAgencies such as Britain’s National Institute for Health and Care Excellence (NICE), France’s Haute Autorité de Santé (HAS) and Germany’s Institute for Quality and Efficiency in Health Care (IQWiG) effectively act as gatekeepers to big markets. \nTheir role can be frustrating for drug companies that have already had their medicines cleared as safe and effective by the European Medicines Agency, but then need to submit different evidence to different agencies in different countries to get their products reimbursed. \nThis has led to growing calls for some degree of harmonisation, although there has been voluntary cooperation for years, with an EU-wide network set up in 2013. \nThe Commission is proposing joint work on clinical assessments, scientific consultations with business, identification of emerging health technologies and voluntary cooperation on, for example, surgical procedures. \nA group of representatives from national authorities would be responsible for overseeing joint work. \nNational HTA authorities will still be responsible for determining pricing and reimbursement, albeit using the joint assessments. \nThe rules will apply some three years after approval by the European Parliament and EU members. There will then be a further three year transition period for EU countries to adapt. \nThe Commission said it envisaged 10-15 assessments could start in the first year, rising to 65 towards the end of the transition period. \nThe changes will therefore happen after Britain has exited the European Union and will have to be factored into the next EU budget covering the period after 2020. Reporting by Philip Blenkinsop; editing by Robert-Jan Bartunek", "external_links": [], "published": "2018-01-31T13:13:00.000+02:00", "crawled": "2018-01-31T13:36:01.021+02:00", "highlightTitle": ""}