{"organizations": [], "uuid": "afb6d74a713d21b8666d2633f1f4059185107b19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/11/104648007-GettyImages-86033609.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/following-this-popular-advice-could-tank-your-interview.html", "country": "US", "domain_rank": 767, "title": "Following this popular advice could tank your interview", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-31T15:18:00.000+02:00", "replies_count": 0, "uuid": "afb6d74a713d21b8666d2633f1f4059185107b19"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/31/following-this-popular-advice-could-tank-your-interview.html", "ord_in_thread": 0, "title": "Following this popular advice could tank your interview", "locations": [], "entities": {"persons": [{"name": "barry drexler", "sentiment": "none"}, {"name": "drexler", "sentiment": "none"}], "locations": [], "organizations": [{"name": "lloyds bank group", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "lehman brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:57 AM ET Tue, 10 Oct 2017 | 01:44 \nMemorizing your responses beforehand makes you seem awkward and stiff in an interview. \nThat's according to interview expert coach Barry Drexler , who has interviewed more than 10,000 candidates and worked as the head of HR at companies like Lloyds Bank Group and Lehman Brothers. \n\"I tell people, 'Don't memorize the words, but memorize the structure,'\" he says in an interview with CNBC Make It . \"It's very helpful to have a structured answer.\" \nTo create the perfect structured response, Drexler suggests that you follow this three-step approach: situation, action and response. \nStructured answers use a script of sorts and are particularly beneficial when answering behavioral questions, which Drexler says are the most difficult to prepare for. \nBehavioral questions run the gamut, but they typically ask for a real-life example of something that you've done. For example: \"Tell me how you delegated tasks on this project,\" \"give me an example of when you had to make a tough decision,\" \"when have you had to use your analytical skills\" or \"tell me a time you had to multitask.\" \n\"I used to feel sorry for candidates when I asked them [these questions] because I knew they were struggling,\" says the interview coach. \"Those are the absolute most difficult if you're not ready for them.\" Ben Stansall | Getty Images \nThis structured approach will also prevent you from rambling or getting scattered, which is easy to do when answering behavioral questions, he says. Plus, it will provide a good flow for your response so you don't sound robotic and over-rehearsed. \nThe three-step-system can also be used to answer more general interview questions, he says. For example, an interviewer may say, \"tell me about your background.\" \nYou could say, \"I first worked in marketing at this company and helped increase their revenue.\" But that doesn't tell the interviewer anything because it doesn't show growth, says Drexler. \nThis would be a better response using the three-step system: \nSituation: When I joined my previous company, the revenue figures were four percent, which was below the market starting point. \nAction: Over the course of a year, I implemented these specific marketing strategies to implement change. \nResult: After a year, our revenue figures increased by 10 percent and I exceeded our targets by this specified amount. \nYou can also rely on this structure when answering situational questions. Drexler notes that these types of questions can make applicants falter because they're based on hypothetical situations instead of actual experiences. Situational questions usually sound something like this: \"Tell me what you would do in this made up situation if these variables occurred.\" \nLuckily, and as the name suggests, the situation has already been determined. All that's left, says Drexler, is to draw on similar background experiences to properly answer what action you are likely to take and the intended result of said action. \nDrexler emphasizes that focusing on structure helps you think more quickly on your feet, gives you a solid road map of your talking points and enables you to talk in a more natural way. \nOn the other hand, memorizing your exact words or answers makes you come across as stiff, rigid and rehearsed. Plus, what normally happens, says Drexler, is you forgot that perfect word or answer so you sit there struggling to remember how you wanted to phrase your response. \n\"You could say the same thing ten different ways,\" says the interview coach. \"Just spit it out.\"", "external_links": [], "published": "2018-01-31T15:18:00.000+02:00", "crawled": "2018-01-31T15:25:31.025+02:00", "highlightTitle": ""}