{"organizations": [], "uuid": "2b8432870176f13ea3330753c00d5bd84185cf24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-embrace-home-loans-adds-benjamin-giumarra-esq-as-director-of-regulatory-and-legal-affairs.html", "country": "US", "domain_rank": 767, "title": "Embrace Home Loans Adds Benjamin Giumarra, Esq. as Director of Regulatory and Legal Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.468, "site_type": "news", "published": "2018-01-02T18:01:00.000+02:00", "replies_count": 0, "uuid": "2b8432870176f13ea3330753c00d5bd84185cf24"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-embrace-home-loans-adds-benjamin-giumarra-esq-as-director-of-regulatory-and-legal-affairs.html", "ord_in_thread": 0, "title": "Embrace Home Loans Adds Benjamin Giumarra, Esq. as Director of Regulatory and Legal Affairs", "locations": [], "entities": {"persons": [{"name": "benjamin giumarra", "sentiment": "negative"}, {"name": "benjamin gium", "sentiment": "negative"}, {"name": "giumarra", "sentiment": "none"}], "locations": [{"name": "middletown", "sentiment": "none"}, {"name": "r.i.", "sentiment": "none"}, {"name": "esq.", "sentiment": "none"}], "organizations": [{"name": "spillane consulting associates, inc.", "sentiment": "none"}, {"name": "boston university school of law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIDDLETOWN, R.I.--(BUSINESS WIRE)-- Embrace Home Loans today announced the addition of Benjamin Giumarra, Esq. as its new Director of Regulatory and Legal Affairs. Giumarra comes to the organization with a strong background in legal, regulatory and enterprise risk mitigation in the consumer finance industry. In this role, Giumarra will work to enable Embrace’s business initiatives in an ever changing regulatory environment.\nBefore coming to Embrace, Giumarra had an impressive stint as director of Spillane Consulting Associates, Inc., where he became a trustworthy source for advice on the rapidly changing regulatory landscape. He served as regulatory advisor and business consultant but also led a team of experts with specialties including mortgage technology, secondary markets, compliance auditing, operational efficiency, strategic development and more. He has authored newsletters and articles providing practical advice to the consumer finance industry on hot button regulatory issues. He is a magna cum laude graduate of Boston University School of Law and admitted to practice law in Florida. He is associated with several trade associations and is frequently asked to speak on regulatory topics.\n“I’m humbled by this opportunity,” said Giumarra. “Embrace’s values closely align with my own and serving in this caring, and professional environment will be extremely fulfilling. The authenticity and depth to which Embrace has adopted its core values make Embrace unlike any other company I’ve ever come across. From a compliance perspective, the people and practices in place have kept Embrace, and their customers, safe for many years, which itself proves it is a tremendous success.\nGiumarra continued, “But Embrace’s existing strength in this area also opens up an exciting opportunity for me to focus more on facilitating business initiatives and improvements. I’ll work with various areas and provide legal and regulatory guidance in a creative and progressive manner. The future at Embrace seems to be bright – as bright as any in this industry. And I believe that attention to customer protections, aligning with effective company practices, will continue to differentiate Embrace for years to come. I’m extremely thankful for this opportunity – the chance to benefit from mentorship like this while also providing real value to such an organization. I can’t possibly think of anything better.”\n“At Embrace, we are committed to bringing in the very best leaders, and Ben is an example of that,” said Peter Microulis, Chief Compliance Officer. “We are extremely optimistic of Embrace’s future and strongly believe that attention to compliance – not as a protector of the gates, but rather as a driver of procedures, and as a conduit for profits – is a key milepost on that highway. With Ben’s expertise in legal, regulatory and enterprise risk mitigation within consumer finance, he will be a true asset to our organization.”\nAbout Embrace Home Loans\nFounded in 1983, Embrace Home Loans has remained a prominent leader in the industry, having helped borrowers and banks with an exceptional mortgage experience. Licensed in 46 states and D.C., Embrace has been recognized seven times as one of the Best Medium-sized Companies to Work for in America by Fortune and four times as one of the Fastest Growing Companies in America by Inc. The company has also been recognized twelve times as one of the Best Places to Work in Rhode Island, as the Most Community Involved Company in Rhode Island, and the Leadership Excellence Award by Providence Business News. please visit www.embracehomeloans.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005393/en/\nFor Embrace Home Loans\nMallory Wilkerson, 678-781-3076\nmwilkerson@williammills.com\nSource: Embrace Home Loans", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.embracehomeloans.com&esheet=51736482&newsitemid=20180102005393&lan=en-US&anchor=www.embracehomeloans.com&index=2&md5=856e32bbfc787379ed6f1852560194df", "http://www.businesswire.com/news/home/20180102005393/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.embracehomeloans.com%2F&esheet=51736482&newsitemid=20180102005393&lan=en-US&anchor=Embrace+Home+Loans&index=1&md5=8d74fe64849573ef0679dd161cce86dd"], "published": "2018-01-02T18:01:00.000+02:00", "crawled": "2018-01-02T19:22:51.003+02:00", "highlightTitle": ""}