{"organizations": [], "uuid": "6481e7ed807fd464887f883bfaec32f89f5d6fd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-cenbank/update-1-bank-of-canada-q4-business-survey-eases-capacity-pressure-up-idUSL1N1P30JL", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Bank of Canada sees capacity pressure, setting up another rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:40:00.000+02:00", "replies_count": 0, "uuid": "6481e7ed807fd464887f883bfaec32f89f5d6fd8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-cenbank/update-1-bank-of-canada-q4-business-survey-eases-capacity-pressure-up-idUSL1N1P30JL", "ord_in_thread": 0, "title": "UPDATE 2-Bank of Canada sees capacity pressure, setting up another rate hike", "locations": [], "entities": {"persons": [{"name": "andrea hopkins", "sentiment": "negative"}, {"name": "avery shenfeld", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "cibc economics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds market, economist reaction)\nBy Andrea Hopkins\nOTTAWA, Jan 8 (Reuters) - Canadian companies remain optimistic about future sales despite some moderation from highs, and signs of capacity pressures and labor shortages have picked up, the Bank of Canada said on Monday, reinforcing expectations for an interest rate hike.\nLittle economic slack remains, with companies expected to expand operations to accommodate demand as the job market tightens and expectations for U.S. demand remain firm, the central bank said in its quarterly Business Outlook Survey.\n“The (survey) was the last key piece of the puzzle for a rate hike this month, with the focus on diminished excess capacity,” CIBC Economics chief economist Avery Shenfeld wrote in a note to clients.\nThe business survey added to evidence of a tightening job market after back-to-back employment reports showed strong hiring, boosting expectations the bank will continue to raise interest rates to head off inflation after two hikes in 2017. The chance of a rate hike on Jan. 17 jumped to 86 percent after the report while the two-year yield pushed to its highest since June 2011 at 1.795 percent. Expectations for a hike hit nearly 80 percent on Friday after data showed the economy added almost 80,000 jobs in December\nPressure on production capacity continued, with the share of firms reporting they would have some or significant difficulty meeting an unanticipated increase in demand hitting its highest level since the 2008-2009 recession, the bank said.\nStill, the survey noted increasing concern about the renegotiation of NAFTA, which U.S. President Donald Trump has threatened to terminate. Negotiations are ongoing.\n“While respondents are increasingly concerned about the renegotiation of the North American Free Trade Agreement and rising protectionism more generally, most see healthy U.S. growth and the low Canadian dollar benefiting their sales over the next 12 months,” the bank said.\nInflation expectations were modest and unchanged from the third quarter, the survey showed, suggesting corporate Canada has not been able to raise prices despite economic strength.\n“One notable feature in the survey is that despite the capacity constraints and growing labor shortages, inflation expectations are still quite muted,” said Doug Porter, chief economist at BMO Capital Markets.\nBank of Canada Governor Stephen Poloz has said the bank needs to tighten monetary policy gradually before inflation bubbles up, rather than slam on the brakes when it appears.\nFirms said competitive pressures dampen their ability to raise output prices despite the acceleration in input prices, the survey showed. (Reporting by Andrea Hopkins and Dale Smith; Editing by Jonathan Oatis and Tom Brown)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T23:40:00.000+02:00", "crawled": "2018-01-09T16:56:27.007+02:00", "highlightTitle": ""}