{"organizations": [], "uuid": "231a38b153bed647e68a068018d6cf793393351b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939134-GettyImages-53228171.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000115/device/rss/rss.html", "section_title": "Real Estate", "url": "https://www.cnbc.com/2018/01/10/trump-sold-35-million-in-real-estate-in-2017-mostly-to-secretive-buyers.html", "country": "US", "domain_rank": 767, "title": "Trump sold $35 million in real estate in 2017, mostly to secretive buyers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T22:57:00.000+02:00", "replies_count": 0, "uuid": "231a38b153bed647e68a068018d6cf793393351b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/trump-sold-35-million-in-real-estate-in-2017-mostly-to-secretive-buyers.html", "ord_in_thread": 0, "title": "Trump sold $35 million in real estate in 2017, mostly to secretive buyers", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Trump's companies sold more than $35 million in real estate in 2017, mostly to secretive shell companies that obscure buyers' identities, continuing a dramatic shift in his customers' behavior that began during the election, a USA TODAY review found.\nIn Las Vegas alone, Trump sold 41 luxury condo units in 2017, a majority of which used limited liability companies – corporate entities that allow people to purchase property without revealing all of the owners' names.\nThe trend toward Trump's real estate buyers obscuring their identities began around the time he won the Republican nomination, midway through 2016, according to USA TODAY's analysis of every domestic real estate sale by one of his companies.\nIn the two years before the nomination, 4% of Trump buyers utilized the tactic. In the year after, the rate skyrocketed to about 70%. USA TODAY's tracking of sales shows the trend held firm through Trump's first year in office.\nProfits from sales of those properties flow through a trust run by Trump's sons. The president is the sole beneficiary of the trust and he can withdraw cash at any time.\nThe opaque sales come at a time when Congress and ethics watchdogs have called on Trump to be more transparent about his domestic and foreign customers and partners, including the buyers of his companies' real estate.\nAt least one of the 2017 sales was to a German couple. His company determined that transaction does not qualify as a \"foreign deal,\" which the president and his lawyers vowed to avoid while he is in office.\nTrump appointed an independent ethics advisor, attorney Bobby Burchfield , to review new deals.\nLast year, when USA TODAY first reported the rapid rise in the share of obscured buyers among Trump's real estate transactions , Burchfield would not reveal the details of his reviews. Now, he says a four-part test is used when evaluating deals: is it at fair market value or in the ordinary course of business; is it an appropriate counterparty; is there any indication the deal is intended to curry favor with the president and is there any likelihood the deal could compromise or diminish the Office of the President.\n\"If someone wants to do business with the Trump entities in the form of an LLC, we look behind the LLC to see who the owner of it is and where the funding is coming from,\" Burchfield told USA TODAY. \"If we can't determine that, we won't sign off on it.\"\nBut those deep-dive identifications and financial disclosures are difficult and easily spoofed, said Ross Delston, a Washington DC attorney specializing in anti-money laundering compliance, who said Burchfield's test is largely subjective.\n\"From what we know of the Trump Organization's past real estate deals is they never see deals they don't like,\" Delston said. \"Having an ethics advisor shut down a deal based on a test not mandated by law strikes me as somewhere between unlikely to unthinkable.\"\nThe company's internal ethics reviews also are not subject to public scrutiny.\nBurchfield wouldn't say if he declined to sign off on any Trump real estate deals in 2017.\nNew buyers last year ranged from real estate investment funds, wealthy individuals seeking an investment and vacation property to some that were unreachable by reporters — largely due to the secrecy associated with their shell company.\nRamsis Ghaly, a neurosurgeon near Chicago purchased a condo in Trump's Vegas property in late December using an LLC. He said he used the LLC to protect his identity and on the advice of a financial consultant.\n\"Was I nervous my name could be associated with him? Sure, you're always concerned with the politics and media, but for me the positives of the property outweighed the negatives,\" Ghaly said. \"A lot of my doctor friends buy in Trump Chicago—I was a little hesitant, but I believe in the guy and it wasn't about politics.\"\nA single condo in Trump's Vegas development sold in October for $1.6 million. That stretched the price per square foot to around $1,000, pushing the limits of the market, said Nicole Tomlinson, a high-rise sales specialist at Shapiro & Sher Group in Las Vegas.\n\"You pay a premium for a high floor, view and penthouse, but that's high for condos and Las Vegas overall,\" Tomlinson said.\nEfforts to reach Lorraine Tan, the name listed on the deed for the 63rd floor penthouse were unsuccessful.\nJason Feldman, a real estate investor in Florida, purchased a Trump condo in Las Vegas in December using an LLC.\nFeldman said he is a member at Trump's Mar-a-Lago club in Palm Beach. He said politics weren't part of his decision to buy the Vegas condo.\n\"The Trump family involvement in the Vegas project played zero role in the purchase decision at all,\" Feldman wrote in an email. \"The deal was purely an economic decision. In my opinion I think these are underpriced given the growth of the Las Vegas market and likely will buy more units.\"\n4114 TIH LLC purchased a condo in Las Vegas in November. The company was formed just days before the purchase in Nevada by Georgia Attorney Robert Goldberg and his son Hayden Goldberg, of Las Vegas. Robert Goldberg said he plans to live in the unit part time and use it for rental income. \"I'll let the public record speak for itself on the sale, I'm not anybody. Using an LLC is standard procedure,\" he said.\nHowever, it wasn't standard procedure for Trump buyers prior to his presidential bid, when fewer than 1 in 20 of Trump companies' real estate buyers was an LLC.\nTrump and billionaire partner Phil Ruffin still own about 350 units in the tower. Ruffin's staff indicated the pair wouldn't own fewer than 300. Maintaining that many units protects their options open for a casino license someday under Nevada law.\nTrump is also sitting on dozens of other real estate properties for sale. That includes his 11-bedroom, 12-bathroom mansion on the Caribbean island of St. Martin .\nTrump reduced his asking price from $28 million to $16.9 million in August, the list price today. Anyone can rent the property that sleeps 20 for roughly $10,000 a night from a third party vendor.", "external_links": [], "published": "2018-01-10T22:57:00.000+02:00", "crawled": "2018-01-10T23:46:19.004+02:00", "highlightTitle": ""}