{"organizations": [], "uuid": "d5d3577bacd84274ab81b4ac7ef98ace6c7dffa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/gettyimages-693008110.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/trump-medicaid-work-requirements/", "country": "US", "domain_rank": 1196, "title": "Trump Administration Medicaid: Critics Slam Work Requirement | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.799, "site_type": "news", "published": "2018-01-11T16:25:00.000+02:00", "replies_count": 0, "uuid": "d5d3577bacd84274ab81b4ac7ef98ace6c7dffa7"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/11/trump-medicaid-work-requirements/", "ord_in_thread": 0, "title": "Trump Administration Medicaid: Critics Slam Work Requirement | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "sy mukherjee", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "medicaid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sy Mukherjee 2:25 PM EST \nThe Trump administration is paving the way for one of the biggest policy changes to U.S. health care in decades. For the first time ever, the administration is giving states the green light to seek waivers that would allow them to impose work or job training requirements on people who rely on Medicaid , the federal-state partnership program which provides largely free health care coverage to more than 70 million children, low-income Americans, the disabled, and the elderly. \nThe new regulations’ supporters argue that it’s a common sense idea. If you’re “able-bodied,” the logic goes, you shouldn’t be able to access a free health care program if you don’t have a job and help pay into the public system that subsidizes such coverage. But critics of the historic shift argue that the issue is far more complicated, and that if states do adopt the work requirements, millions of needy people’s Medicaid coverage will be disrupted. \nOne critical issue that will affect the fallout from the Medicaid work requirements is the makeup of the Medicaid program itself, the critics say. Medicaid is pretty different from even other government health care programs; its beneficiaries are the poorest people in America, kids, and people with disabilities—a coalition of Americans who often have the most difficult health care needs in the country compared with the employer-sponsored private health market. \nStates wouldn’t be able to request work requirements for disabled people and children under the new guidance; however, a number of nonpartisan health care think tanks point out that many Americans who rely on Medicaid cannot work because they are the primary care providers for much sicker family members or live with other socioeconomic realities that make finding work more difficult. In fact, “[a]mong the adult Medicaid enrollees who were not working, most report major impediments to their ability to work including illness or disability or care-giving responsibilities,” according to the independent Kaiser Family Foundation . About 80% of Medicaid enrollees under the age of 65 are already in working families; part of the reason is Obamacare’s optional Medicaid expansion for working poor adults who don’t have children (prior to the expansion, you often had to be poor and have kids in order to qualify for Medicaid). \nAs for the others? “[M]ore than one-third of Medicaid beneficiaries who aren’t working report that illness or a disability is the main reason, 28 percent report that they’re taking care of home or family, and 18 percent are in school,” reports the Center of Budget and Policy Priorities . \nIt’s unclear which states will be the first to pursue a first-of-its-kind Medicaid work requirement waiver. But, if the critics are correct, implementing such a policy could carry some unintended consequences. \nThis essay appears in today’s edition of the Fortune Brainstorm Health Daily. Get it delivered straight to your inbox. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T16:25:00.000+02:00", "crawled": "2018-01-11T22:59:24.000+02:00", "highlightTitle": ""}