{"organizations": [], "uuid": "c0b36bd3a88e565edfe9c3936f10daadb9f42301", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-anokion-announces-appointment-of-dr-john-hohneker-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Anokion Announces Appointment of Dr. John Hohneker as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "c0b36bd3a88e565edfe9c3936f10daadb9f42301"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-anokion-announces-appointment-of-dr-john-hohneker-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Anokion Announces Appointment of Dr. John Hohneker as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "john hohneker", "sentiment": "negative"}, {"name": "tasigna", "sentiment": "none"}, {"name": "hohnek", "sentiment": "none"}, {"name": "hohneker", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "lausanne", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "novartis ag", "sentiment": "none"}, {"name": "dimension therapeutics inc.", "sentiment": "none"}, {"name": "forma therapeutics inc.", "sentiment": "none"}, {"name": "ultragenyx pharmaceutical inc.", "sentiment": "none"}, {"name": "novartis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAUSANNE, Switzerland & CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Anokion, a privately held biopharmaceutical company developing novel tolerance-inducing therapeutics for autoimmune diseases, today announced the appointment of John Hohneker, M.D., as president and chief executive officer, effective January 22.\nDr. Hohneker joins Anokion from FORMA Therapeutics Inc., where he served as president of research and development. While at FORMA, he guided the company’s transition from a discovery-stage biotech to one with programs in clinical trials. Prior to FORMA, he held roles of increasing responsibility at Novartis AG, most recently as senior vice president and global head of development for immunology and dermatology. During his tenure at Novartis, Dr. Hohneker played a key role in the development, approval and commercialization of products including Cosentyx®, Xolair®, Ilaris®, Gleevec®, Tasigna®, Zometa®, Afinitor® and Exjade®. He also previously served on the board of directors of Dimension Therapeutics Inc., which was acquired by Ultragenyx Pharmaceutical Inc. (NASDAQ: RARE).\nDr. Hohneker received a bachelor’s degree in chemistry from Gettysburg College and an M.D. from the University of Medicine and Dentistry of New Jersey at Rutgers Medical School. He completed his internship and residency in internal medicine and his fellowship in medical oncology, all at the University of North Carolina Hospitals.\n“I am excited to become part of the strong Anokion management team and look forward to helping drive the company’s innovative platform approach to the treatment of autoimmune diseases,” said Dr. Hohneker. “I think Anokion can change the treatment paradigm for many patients suffering from these serious and often chronic diseases.”\nAnokion is advancing its antigen-specific immune tolerance platform to develop therapeutics for multiple autoimmune indications. This proprietary and industry-leading platform has diverse applications that include tolerizing the immune system to self-antigens that underlie autoimmune disorders as well as reducing the immunogenicity of therapeutic proteins.\nAnokion is pursuing two approaches to immune tolerance that harness the body’s natural tolerance mechanism of apoptotic or aging cells. One involves engineering antigens, relevant to a broad range of autoimmune disorders, to bind glycophorin A, a surface protein unique to erythrocytes or red blood cells. When these circulating blood cells undergo apoptosis, the immune system recognizes the attached antigens and elicits a tolerogenic immune response against them.\nAdditionally, Anokion is developing a liver-targeted tolerance approach through which engineered antigens attach to liver cells, which trigger a tolerogenic response.\n“John brings tremendous experience in biologics development to Anokion, including in the immunology space. His broad leadership in both preclinical and clinical development will strengthen Anokion’s powerful platforms in immunological tolerance,” said Jeffrey Hubbell, Ph.D., the academic founder, chairman and chief scientific officer of Anokion.\nAbout Anokion\nAnokion, a spin-off from the Ecole Polytechnique Fédérale de Lausanne (EPFL), is focused on applying the company’s antigen-specific immune tolerance technology to treat autoimmune and allergic diseases and reduce the immunogenicity of therapeutic proteins. As a platform technology, Anokion’s approach to antigen-specific immune tolerance can be translated to virtually any protein in numerous clinical indications. Anokion’s investors include Versant Ventures, Novo Ventures, Novartis Venture Fund and a group of individual investors.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005156/en/\nfor Anokion\nSteve Edelson, 415-801-8088\nsedelson@versantventures.com\nSource: Anokion", "external_links": ["http://www.businesswire.com/news/home/20180118005156/en/"], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:30:22.000+02:00", "highlightTitle": ""}