{"organizations": [], "uuid": "d26a1244013f0655cd77d82bea6299ebd478aa0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224890128&w=1200&r=LYNXMPEE0N1VU", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-golf-farmers-donald/golf-outlier-woods-can-win-again-says-donald-idUSKBN1FD2NH", "country": "US", "domain_rank": 408, "title": "Golf: Outlier Woods can win again, says Donald", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:23:00.000+02:00", "replies_count": 0, "uuid": "d26a1244013f0655cd77d82bea6299ebd478aa0f"}, "author": "", "url": "https://www.reuters.com/article/us-golf-farmers-donald/golf-outlier-woods-can-win-again-says-donald-idUSKBN1FD2NH", "ord_in_thread": 0, "title": "Golf: Outlier Woods can win again, says Donald", "locations": [], "entities": {"persons": [{"name": "donald january", "sentiment": "negative"}, {"name": "donald andrew both", "sentiment": "negative"}, {"name": "luke donald", "sentiment": "none"}, {"name": "woods", "sentiment": "none"}, {"name": "tiger woods", "sentiment": "none"}, {"name": "aaron baddeley", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}], "locations": [{"name": "la jolla", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "torrey pines", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LA JOLLA, California (Reuters) - Winning again on the PGA Tour is well within the grasp of a healthy Tiger Woods, two of his peers agreed while warning that expectations should be kept in check.\nFormer world number one Luke Donald and twice Australian Open winner Aaron Baddeley are both bullish about Woods as the 14-times major champion prepares to play his first official tournament since a spinal fusion last April.\nAll eyes are on Woods at the Farmers Insurance Open starting at Torrey Pines on Thursday, and even his fellow professionals are curious to see how he performs after so long out of the competitive arena.\n“There are always outliers in everything in sport, and Tiger’s certainly one of those in our sport,” Donald told Reuters on Tuesday.\n“If he gets back in the winner’s circle after what he’s been through the last few years that would be a really good achievement … It’s certainly a possibility but he has to stay away from injuries.”\nDonald, 40, is only two years Woods’ junior, and understands the limitations of the body as one moves toward middle age.\n“You wake up and you’ve got to warm up a little bit more, stretch a little bit more, because your body doesn’t move quite as well,” said the Englishman, who unlike Woods has not had to deal with a serious back injury and multiple surgeries.\n“He has some past injuries he probably has to be careful with. Other than that, the older you get your nerves probably aren’t quite as good as they were, but when you have so much to fall back on, so many memories as Tiger has, good memories, I think that helps physically and mentally.”\nMORE UPBEAT Baddeley, meanwhile, is even more upbeat about Woods’s prospects.\n“If his body stays healthy I think he’ll win again for sure,” Baddeley said after a long session on the practice green.\n“You can’t be that good of a golfer, and just lose it.\n“It’s hard to expect him to be at the level he was at winning eight, nine times a year but I definitely think he’ll win again. There’s no reason he can’t win once a year. He doesn’t need to be that player (he was in his prime) to win once.\n“Making Tour Championship (the top 30 players who qualify for the season-ending event) would be a pretty good goal, not having played a whole lot the past couple of years. I would call that a successful year.”\nBaddeley observed, almost with a sense of awe, that what for most top players is a career-defining season was just par for the course for Woods, who 10 times was voted by his peers as PGA Tour Player of the Year.\n“His record is ridiculous,” Baddeley said of Woods, whose record of 79 PGA Tour victories is second only to Sam Snead’s 82.\n“Justin Thomas last year was impressive (winning five times) but Tiger had a Justin Thomas-like year every year.\n“He had a career year and backed it up next year, and had another career year and backed it up, and had the same year again and did that for 10 years.”\nEditing by Ed Osmond\n ", "external_links": [], "published": "2018-01-24T20:23:00.000+02:00", "crawled": "2018-01-24T20:40:14.024+02:00", "highlightTitle": ""}