{"organizations": [], "uuid": "10ee4a2d236719b394cb0727d77697d3933fcdfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224817662&w=1200&r=LYNXMPEE0N1AB", "site_section": "http://feeds.reuters.com/reuters/UKRugbyNews", "section_title": "Reuters: Rugby News", "url": "https://uk.reuters.com/article/uk-rugby-union-nations-ire-preview/rugby-union-irelands-schmidt-laughs-off-england-coachs-jibe-idUKKBN1FD1U0", "country": "US", "domain_rank": 408, "title": "Rugby Union-Ireland's Schmidt laughs off England coach's jibe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:14:00.000+02:00", "replies_count": 0, "uuid": "10ee4a2d236719b394cb0727d77697d3933fcdfb"}, "author": "", "url": "https://uk.reuters.com/article/uk-rugby-union-nations-ire-preview/rugby-union-irelands-schmidt-laughs-off-england-coachs-jibe-idUKKBN1FD1U0", "ord_in_thread": 0, "title": "Rugby Union-Ireland's Schmidt laughs off England coach's jibe", "locations": [], "entities": {"persons": [{"name": "schmidt", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "eddie jones", "sentiment": "none"}, {"name": "jack tarrant", "sentiment": "none"}, {"name": "joe schmidt", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "rugby union", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 1:40 PM / Updated 29 minutes ago Rugby Union - Ireland's Schmidt laughs off England coach's jibe Jack Tarrant 3 Min Read \nLONDON (Reuters) - Ireland head coach Joe Schmidt has laughed off counterpart Eddie Jones’ tongue-in-cheek comment that his England team have “no chance” in the Six Nations due to their injury issues. \nIreland beat England in Dublin last year to deny the eventual champions a Grand Slam and will now focus on preventing England winning a record third Six Nations crown in a row. \nThe two countries are expected to battle it out for the Six Nations title once more but Schmidt declined to be drawn on Jones’ comments. \n“It must be on the back of having 12 teams to select from and having so much time in camp,” Schmidt said jokingly at the Six Nations launch on Wednesday. \n“I have known Eddie for a long time and I know he is likely to throw a grenade in. It makes things interesting for people.” \nEvery side coming into the competition have injury issues following a tough winter in club rugby. \nHowever, Schmidt is focused on the players he has as opposed to who is not available. \n“You can always reflect on who you are missing but (it‘s) important to focus on who you have got and that is who we are excited about,” he said. \nIreland are without Garry Ringrose and Sean O‘Brien whilst Munster prop Dave Kilcoyne is also missing. EUROPEAN PROGRESS \nThree of Ireland’s four provincial clubs have reached Euroepan quarter-finals this season, with Leinster and Munster progressing in the Champions Cup and in the Challenge Cup. \nCaptain Rory Best was cautiously optimistic that European form could bring momentum to the Irish in the Six Nations. \n“I think at the top end Ireland have done brilliantly but you have to park that now. The momentum created by that is only useful if you direct it into the national team, so that is what we are focusing on,” he said. \nIreland open their Six Nations campaign on Feb. 3. against France, who they have beaten in four of their last five clashes, but Schmidt is wary of the threat posed by a young French side. \n“How quickly can they gel? That is the challenge. I don’t know how much homework people are doing on their young players but I am really impressed,” he said. \nSchmidt highlighted France’s 19-year-old rookie fly-half Matthieu Jalibert as a player to watch. \nFrance coach Jacques Brunel came to the national team from Bordeaux and therefore knows all about the prodigious talent of the Begles’ teenager. \nIreland last won the championship in 2015. Reporting by Jack Tarrant; Editing by Ken Ferris", "external_links": [], "published": "2018-01-24T15:14:00.000+02:00", "crawled": "2018-01-24T15:48:27.001+02:00", "highlightTitle": ""}