{"organizations": [], "uuid": "3a9ad6f87aa711b2b8c6554fb7a1c9e4e8d3b5b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-sanofi-appoints-dominique-carouge-executive-vice-president-head-of-business-transformation-and-member-of-the-executive.html", "country": "US", "domain_rank": 767, "title": "Sanofi Appoints Dominique Carouge Executive Vice President Head of Business Transformation and Member of the Executive Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:01:00.000+02:00", "replies_count": 0, "uuid": "3a9ad6f87aa711b2b8c6554fb7a1c9e4e8d3b5b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-sanofi-appoints-dominique-carouge-executive-vice-president-head-of-business-transformation-and-member-of-the-executive.html", "ord_in_thread": 0, "title": "Sanofi Appoints Dominique Carouge Executive Vice President Head of Business Transformation and Member of the Executive Committee", "locations": [], "entities": {"persons": [{"name": "dominique carouge executive", "sentiment": "neutral"}, {"name": "dominique carouge", "sentiment": "none"}, {"name": "carouge", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "neutral"}, {"name": "executive committee press", "sentiment": "neutral"}, {"name": "sanofi appoints dominique carouge", "sentiment": "neutral"}, {"name": "finance operations and group controlling", "sentiment": "none"}, {"name": "sanofi pasteur", "sentiment": "none"}, {"name": "executive committee", "sentiment": "none"}, {"name": "ernst & young", "sentiment": "none"}, {"name": "executive committee paris", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Press Release\nSource: Sanofi (EURONEXT: SAN) (NYSE: SNY)\nSanofi Appoints Dominique Carouge Executive Vice President Head of Business Transformation and Member of the Executive Committee\nParis, France - January 19, 2018 - Sanofi has appointed Dominique Carouge as Executive Vice President Head of Business Transformation, effective February 15, 2018. In this role, Mr. Carouge will be in charge of accelerating the transformation of the Company and will be a member of the Executive Committee. He has served as Deputy CFO and Head of Finance Operations and Group Controlling since January 1st, 2016.\nMr. Carouge previously served as Vice-President, Administration & Management for Global R&D since 2011. Prior to that, Mr. Carouge held the role of VP, Chief Strategy and Finance Officer for Sanofi Pasteur since 2009.\nMr. Carouge started his career in 1985 as an external auditor at Ernst & Young (EY) both in France (Paris) and in the US (Philadelphia). He joined Sanofi in 1991. Since then and for the past 27 years, he held various finance positions of increasing responsibility and leadership across Australia, New Zealand, Germany and France.\nA citizen of France, Mr. Carouge graduated from \"Ecole Supérieure de Commerce de Reims\". He also holds a CPA degree in France, as well as a Corporate Governance and Board management certificate from Sciences Po (Certificat d'Administrateur de Sociétés).\nAbout Sanofi\nSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\nSanofi, Empowering Life\nMedia Relations\nLaurence Bollack\nTel. : +33 (0)1 53 77 46 46\nmr@sanofi.com Investor Relations\nGeorge Grofik\nTel. : +33 (0)1 53 77 45 45\nir@sanofi.com Sanofi Forward-Looking Statements\nThis press release contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, as amended. Forward-looking statements are statements that are not historical facts. These statements include projections and estimates regarding the marketing and other potential of the product, or regarding potential future revenues from the product. Forward-looking statements are generally identified by the words \"expects\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"plans\" and similar expressions. Although Sanofi's management believes that the expectations reflected in such forward-looking statements are reasonable, investors are cautioned that forward-looking information and statements are subject to various risks and uncertainties, many of which are difficult to predict and generally beyond the control of Sanofi, that could cause actual results and developments to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. These risks and uncertainties include among other things, unexpected regulatory actions or delays, or government regulation generally, that could affect the availability or commercial potential of the product, the absence of guarantee that the product will be commercially successful, the uncertainties inherent in research and development, including future clinical data and analysis of existing clinical data relating to the product, including post marketing, unexpected safety, quality or manufacturing issues, competition in general, risks associated with intellectual property and any related future litigation and the ultimate outcome of such litigation, and volatile economic conditions, as well as those risks discussed or identified in the public filings with the SEC and the AMF made by Sanofi, including those listed under \"Risk Factors\" and \"Cautionary Statement Regarding Forward-Looking Statements\" in Sanofi's annual report on Form 20-F for the year ended December 31, 2016. Other than as required by applicable law, Sanofi does not undertake any obligation to update or revise any forward-looking information or statements.\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/d74f06c8-e742-4b1c-9e99-a7ebc485a1cd\nSource:Sanofi", "external_links": ["https://www.globenewswire.com/Tracker?data=rINZBKVYxAmJzhm_1qNT0QMxpJAjeYe6JyJuaWkV02NvfZB3KS52vetNqWOslnIl1PqntSi4_lUEjdqzeYlg1A==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/d74f06c8-e742-4b1c-9e99-a7ebc485a1cd", "https://www.globenewswire.com/Tracker?data=znS-t20Knyr0_c6iEDchTVSbL7qL-3x2ETIKhA8hAjEOGsYrx41CV0U3otbx-v_SlYqtYevwKhvh8cMn3PcjfW9yZ5FR2yKg4kKYrY3M3F0N6NBowk1v_1--TX60XxU8ByZhwcCzta7EYzTrtqCT0i3OdhcP9XsBJuIYaHZlgDrqIclcVD5OTc3209tOO6c7SBrGQnhoLFfTL3Shuy3WqenUme84iy5gVeli9UkPSt0goPj3MPOdzgZjvS58AMqlqENB9Ai11no8kp2UCBrr3A=="], "published": "2018-01-19T20:01:00.000+02:00", "crawled": "2018-01-19T22:56:05.002+02:00", "highlightTitle": ""}