{"organizations": [], "uuid": "5149b40a2274c5fb93e68c38ddb91127af4f7319", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-3-transcanada-lines-up-enough-shippers-to-take-keystone-xl-forward.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-TransCanada lines up enough shippers to take Keystone XL forward", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:50:00.000+02:00", "replies_count": 0, "uuid": "5149b40a2274c5fb93e68c38ddb91127af4f7319"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-3-transcanada-lines-up-enough-shippers-to-take-keystone-xl-forward.html", "ord_in_thread": 0, "title": "UPDATE 3-TransCanada lines up enough shippers to take Keystone XL forward", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments from Alberta government)\nJan 18 (Reuters) - TransCanada Corp said on Thursday customers committed to using about two-thirds of the capacity on its planned $8 billion Keystone XL oil pipeline, bringing the company closer to a final decision on when it will begin construction.\nThe controversial pipeline has pitted environmentalists worried about spills and global warming against industry advocates who say the project will shore up discounted Canadian oil prices and attract investment to Alberta's oil sands.\nTransCanada has secured firm, 20-year commitments for about 500,000 barrels per day for the 830,000 bpd project as it concluded its open season that allowed shippers to commit to space on the pipeline.\n\"We are progressing towards final investment decision of this project. Having route approval in Nebraska and the necessary commercial support for KXL brings us closer to a final investment decision,\" TransCanada spokesman Terry Cunha said in an email.\nThe commitments include 50,000 bpd from the Alberta provincial government, which receives some oil and gas royalties from producers in the form of bitumen.\nAlberta had previously committed to ship crude on TransCanada's canceled Energy East project, which would have transported 1.1 million bpd to the Atlantic Coast.\nPremier Rachel Notley told reporters in Calgary the province's oil industry needs more pipeline capacity to avoid crude getting bottlenecked in Alberta, which results in a deep discount on Canadian barrels versus benchmark U.S. crude.\n\"We can see very clearly right now the (price) differential is quite significant and what it means is that Albertans get a lower return,\" Notley said. \"We remain committed to doing everything we can to diversify our market.\"\nCanadian heavy crude is trading at a discount of around $24 a barrel to U.S. crude, eating into producers' revenues even as global oil prices rise.\nWhen completed, Keystone XL will ship from Hardisty, Alberta, to Steele City, Nebraska, linking crude from the oil-rich but landlocked Canadian province with U.S. refineries.\nPrimary construction is expected to begin in 2019 and the company will continue to look for additional long-term contracted volumes, TransCanada said.\nLast year, the Donald Trump administration granted the company a U.S. presidential permit, reversing a decision by former President Barack Obama to reject the project on environmental grounds.\nThe pipeline cleared its final hurdle in November when Nebraska approved a route through the state.\nToronto-listed shares of the company were last trading flat at C$59.84. (Additional reporting by Nia Williams in Calgary; Editing by Saumyadeb Chakrabarty and Cynthia Osterman)", "external_links": [], "published": "2018-01-18T23:50:00.000+02:00", "crawled": "2018-01-19T03:20:03.074+02:00", "highlightTitle": ""}