{"organizations": [], "uuid": "049501ebb72e16a1c442e5ad82b58b0ce9ff26ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-summit-materials-announces-appointment-of-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Summit Materials Announces Appointment of Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T14:15:00.000+02:00", "replies_count": 0, "uuid": "049501ebb72e16a1c442e5ad82b58b0ce9ff26ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-summit-materials-announces-appointment-of-chief-operating-officer.html", "ord_in_thread": 0, "title": "Summit Materials Announces Appointment of Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "douglas c. rauh", "sentiment": "none"}, {"name": "karl", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "tom hill", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "karl h. watson jr.", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "martin marietta materials, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER--(BUSINESS WIRE)-- Summit Materials, Inc. (NYSE: SUM), a leading vertically integrated construction materials company, announced today that, effective January 8, 2018, Karl H. Watson Jr. has been appointed Executive Vice President and Chief Operating Officer, succeeding Douglas C. Rauh.\nTom Hill, CEO of Summit, stated, “We are very pleased to have Karl join Summit. I have known him for years and his depth and breadth of experience in our industry will add impactful leadership to our already strong team. I am confident that Karl will make a great partner as we strengthen Summit for our next phase of growth.”\nMr. Watson said, “I am excited to have the opportunity to work for such a dynamic and successful company. Under Tom’s leadership, Summit has experienced significant transformational growth, and I am looking forward to contributing to its continued success.”\nMr. Watson has more than 25 years of experience in the construction materials industry. In 2017, he served as President, Cement & Southwest Ready Mix at Martin Marietta Materials, Inc., a supplier of construction aggregates and heavy building materials. Prior to joining Martin Marietta, Mr. Watson served in various leadership positions at Cemex, S.A.B. de C.V., a Mexican cement manufacturer, including President, Cemex USA. Prior to Cemex’s acquisition of Rinker Group Ltd., an Australian building materials supplier, Mr. Watson held various executive positions at Rinker in both the United States and Australia.\nMr. Watson is currently on the board of directors of the Texas Aggregates & Concrete Association and on the executive committee of the Portland Cement Association where he served as the vice chairman from 2013 to 2015. He is a past chairman of the National Ready Mix Concrete Association and the Florida Concrete and Products Association and was on the board of directors of the National Stone, Sand and Gravel Association from 2007 to 2011. Mr. Watson has a Bachelor’s of Science degree in Business Administration from Palm Beach Atlantic University.\nAbout Summit Materials\nSummit Materials is a leading vertically integrated materials-based company that supplies aggregates, cement, ready-mix concrete and asphalt in the United States and British Columbia, Canada. Summit is a geographically diverse, materials-based business of scale that offers customers a single-source provider of construction materials and related downstream products in the public infrastructure, residential and nonresidential, and end markets. Summit has a strong track record of successful acquisitions since its founding and continues to pursue growth opportunities in new and existing markets. about Summit Materials, please visit www.summit-materials.com .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains “ ” within the meaning of the federal securities laws, which involve risks and uncertainties. Forward-looking statements include all statements that do not relate solely to historical or current facts, and you can identify because they contain words such as “believes,” “expects,” “may,” “will,” “should,” “seeks,” “intends,” “trends,” “plans,” “estimates,” “projects” or “anticipates” or similar expressions that concern our strategy, plans, expectations or intentions. These subject to risks, uncertainties and other factors that may cause our actual results, performance or achievements to be different from future results, performance or achievements expressed or implied by such . We derive many of our from our operating budgets and forecasts, which are based upon many detailed assumptions. While we believe that our assumptions are reasonable, it is very difficult to predict the effect of known factors, and, of course, it is impossible to anticipate all factors that could affect our actual results.\nIn light of the significant uncertainties inherent in the included herein, the inclusion of such information should not be regarded as a representation by us or any other person that the results or conditions described in such statements or our objectives and plans will be realized. Important factors could affect our results and could cause results to differ materially from those expressed in our , including but not limited to the factors discussed in the section entitled “Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2016. Such factors may be updated from time to time in our periodic filings with the Securities and Exchange Commission (“SEC”), which are accessible on the SEC’s website at www.sec.gov . We undertake no obligation to publicly update or revise any forward-looking statement as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005285/en/\nSummit Materials, Inc.\nMr. Noel Ryan\nVice President, Investor Relations\nnoel.ryan@summit-materials.com\nSource: Summit Materials, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51737579&newsitemid=20180104005285&lan=en-US&anchor=www.sec.gov&index=2&md5=a4cadedf04321c844ccc328343216392", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.summit-materials.com&esheet=51737579&newsitemid=20180104005285&lan=en-US&anchor=www.summit-materials.com&index=1&md5=8e27c12790f67abf632e921d264e8296", "http://www.businesswire.com/news/home/20180104005285/en/"], "published": "2018-01-04T14:15:00.000+02:00", "crawled": "2018-01-04T14:00:55.031+02:00", "highlightTitle": ""}