{"organizations": [], "uuid": "a20b66c56b10982a44862978354c926af3871f79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/venezuela-usa-senate/u-s-senators-want-probe-of-drug-trafficking-tied-to-venezuela-government-idUSL2N1PJ1AL", "country": "US", "domain_rank": 408, "title": "U.S. senators want probe of drug trafficking tied to Venezuela government", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-25T00:54:00.000+02:00", "replies_count": 0, "uuid": "a20b66c56b10982a44862978354c926af3871f79"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/venezuela-usa-senate/u-s-senators-want-probe-of-drug-trafficking-tied-to-venezuela-government-idUSL2N1PJ1AL", "ord_in_thread": 0, "title": "U.S. senators want probe of drug trafficking tied to Venezuela government", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}, {"name": "robert menendez", "sentiment": "none"}, {"name": "rubio", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "menendez", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. department of justice", "sentiment": "negative"}, {"name": "senate foreign relations committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 24 (Reuters) - Two U.S. senators called on the U.S. Department of Justice on Wednesday to investigate allegations of drug trafficking by senior officials in the government of Venezuelan President Nicolas Maduro, as the country struggles with economic crisis.\nIn a letter to U.S. Attorney General Jeff Sessions seen by Reuters, Republican Senator Marco Rubio and Democrat Robert Menendez said they were concerned about possible connections between Maduro’s government and drug trafficking organizations and wanted an investigation “in order to better understand the nexus between criminal actors and members of Maduro’s inner circle.”\nDespite being a major oil producing country, Venezuela is undergoing a severe economic and social crisis, with millions suffering food and medicine shortages, hyperinflation and growing insecurity.\nRubio is chairman of the Senate Foreign Relations Committee’s western hemisphere subcommittee, and Menendez is its ranking Democrat. Both lawmakers are vocal critics of the Venezuelan government.\nIn their letter, they raised concerns that the situation in Venezuela could destabilize the region.\nThe Venezuelan Information Ministry did not immediately respond to a request for comment. In the past, Maduro has dismissed accusations about drug trafficking links as a smear campaign by Washington, adding that the United States is to blame for the drug trade because it is such a large market for illegal narcotics.\nOn Aug. 1, 2016, a U.S. District Court announced the indictment of Nestor Reverol, who is now Venezuela’s interior minister, on charges of participating in an international cocaine trafficking conspiracy. In February 2017, the U.S. Treasury Department imposed sanctions against Venezuelan Vice President Tareck el-Aissami for drug trafficking and other related crimes.\nAnd in December 2017, two nephews of Maduro’s wife, Franqui Francisco Flores de Freitas and Efrain Antonio Campo Flores, were convicted in U.S. federal court for drug smuggling.\nThe European Union announced new sanctions on several senior Venezuelan officials, including Reverol, on Monday, saying this was an expression of the bloc’s concern with the political crisis under Maduro.\nRubio and Menendez also asked Sessions to support efforts by the Organization of American States to address human rights concerns in Venezuela.\nA Justice Department spokeswoman did not immediately respond to a request for comment on the letter, which was sent on Wednesday.\nReporting by Patricia Zengerle; additional reporting by Brian Ellsworth in Caracas; editing by Susan Thomas\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T00:54:00.000+02:00", "crawled": "2018-01-25T13:06:46.107+02:00", "highlightTitle": ""}