{"organizations": [], "uuid": "9a918db16b01bb2dad49180e48b00b56037afe76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-kenya-women-drought/down-to-business-drought-hit-kenyan-women-trade-their-way-out-of-poverty-idUSKBN1F71EX", "country": "US", "domain_rank": 408, "title": "Down to business: Drought-hit Kenyan women trade their way out of poverty", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-18T19:39:00.000+02:00", "replies_count": 0, "uuid": "9a918db16b01bb2dad49180e48b00b56037afe76"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kenya-women-drought/down-to-business-drought-hit-kenyan-women-trade-their-way-out-of-poverty-idUSKBN1F71EX", "ord_in_thread": 0, "title": "Down to business: Drought-hit Kenyan women trade their way out of poverty", "locations": [], "entities": {"persons": [{"name": "ahatho turuga", "sentiment": "negative"}, {"name": "turuga", "sentiment": "none"}], "locations": [{"name": "marsabit", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "marsabit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "loglogo", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "boma project", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARSABIT, Kenya (Thomson Reuters Foundation) - Widow Ahatho Turuga lost 20 of her goats to drought early last year, but the shopkeeper is planning to reinvest in her herd once she has saved enough money.\n“I think I will start with four goats and see how it goes,” she said, rearranging soap on the upper shelf of her shop in Loglogo, a few kilometers from Marsabit town.\nShe recalled how frequent droughts had left her on the edge of desperation, struggling to care for six of her own children and four others she adopted after their mother died.\nBut Turuga is finding it easier to cope since taking part in a rural entrepreneurship program run by The BOMA Project, a non-profit helping women in Kenya’s dry northern areas beat extreme poverty and adapt to climate change.\nThe U.S. and Kenya-based organization provides two years of business and life-skills training, as well as mentorship.\nGroups of three women are each given a start-up grant of 20,000 Kenyan shillings ($194.55) and a progress grant of 10,000 shillings to set up a business.\nAfter graduating, they carry on operating their businesses - mainly small shops selling groceries and household goods - either together or on their own.\nThe women also club together in savings groups of at least 15 people, who put away anything from 400 shillings a month each, and make loans to members at an interest rate of 5 to 10 percent.\nHabibo Osman, a mother of five who was in the same group as Turuga, has been able to support her family even after divorcing her husband.\nThe 1,200 shillings she earns each week from the shop she established as a BOMA business has enabled her to enroll her eldest child, aged five, in nursery school. She is now hoping to save enough to buy her own land.\nNO MORE AID Ahmed “Kura” Omar, BOMA’s co-founder and deputy country director, said his native Marsabit is one of Kenya’s driest counties. It is often hit by prolonged drought, with many families losing livestock in its mainly pastoralist economy, he added.\n“Given that there is no foreseeable end to these drought patterns, we need to stop relying on food distribution and aid money, and create more sustainable, life-long solutions,” Kura told the Thomson Reuters Foundation.\nBOMA CEO Kathleen Colson said the program aimed to help break the cycle of dependency on aid, giving women power over their lives and the means to move out of extreme poverty.\n“People need to be treated with dignity and be empowered to achieve self-sufficiency and effect change on a community level,” she said.\nBOMA asks villagers to help identify the poorest women among them to participate in the training. After completing the program, they help other women, a process that raises income levels across the entire area.\nBakayo Nahiro, a widow and mother of six, belongs to the Namayana women’s saving group in Kargi in Marsabit. She has amassed 25,000 shillings in savings, but said profit margins go down in drought periods as people take shop goods on credit when they have no livestock to sell.\nMONEY IS POWER Jane Naimirdik, a BOMA trainer and mentor, said communities in Marsabit are highly patriarchal, but the program helps women gain a voice in society.\nThe practice of grouping women in threes creates mutual accountability but also offers protection from husbands who may want to take money from them, she added.\n“We once handled a case where the husband tried to take the wife’s savings by force, but we approached (him) and told him the money did not belong to his wife but to the women’s savings group and he understood,” said Naimirdik.\nMoses Galore, Kargi’s village chief, said no such incidents had been reported to him, and men appreciated their wives’ financial contribution to the household.\nMagatho Mifo, a BOMA business owner, said her husband was happy about her commercial activities as she could now provide for her family while he travels for days in search of pasture for his herd.\nHer neighbors’ wives and children buy goods on credit when the men are away looking for grazing, and repay her when they return. This helps the community during lean times and generates more income for her business, she said.\n“My husband sometimes gets angry when I attend the women’s group meetings, because they can last a long time, but once I arrive home with a bag of food or something else, all is forgotten,” said Khobobo Gurleyo, another entrepreneurship program member.\nBUSINESS PARTNERSHIPS BOMA mentor Naimirdik said the women are also trained in conflict management to strengthen their business partnerships.\nIdeally, each group includes women of different ages so as to benefit from the experience of older members and to make the program sustainable as it passes to subsequent generations, she said.\nIn addition, the women receive information about family planning and the importance of having small families, as well as child and maternal health and hygiene, she added.\nThe BOMA Project has reported positive results in the communities where it works in Marsabit County and Samburu East, with about 15,700 women enrolled in its program since 2008.\nData collected during a 2016 exit survey of participants found that after two years, 99 percent of BOMA businesses were still open.\nMembers experienced a 147 percent increase in their income, and a 1,400 percent increase in their savings, alongside a 63 percent drop in children going to bed hungry.\nThe BOMA Project plans to expand its program across East Africa’s drylands by partnering with governments and other development agencies.\nIn Kenya, it is undertaking a pilot program with the government involving 1,600 women in Samburu, in addition to its existing work.\nThe project aims to reach 1 million women and children by 2022, said CEO Colson.\n($1 = 102.8000 Kenyan shillings)\nReporting by Benson Rioba; editing by Megan Rowling. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-18T19:39:00.000+02:00", "crawled": "2018-01-19T12:17:54.000+02:00", "highlightTitle": ""}