{"organizations": [], "uuid": "fe1857b638085cd470ae24e3b4a198f3ce2d5176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/07/104267092-GettyImages-633960240.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/how-much-pro-athletes-earn-in-the-super-bowl-and-world-series.html", "country": "US", "domain_rank": 767, "title": "How much pro athletes earn in the Super Bowl and World Series", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.137, "site_type": "news", "published": "2018-01-14T17:01:00.000+02:00", "replies_count": 0, "uuid": "fe1857b638085cd470ae24e3b4a198f3ce2d5176"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/12/how-much-pro-athletes-earn-in-the-super-bowl-and-world-series.html", "ord_in_thread": 0, "title": "How much pro athletes earn in the Super Bowl and World Series", "locations": [], "entities": {"persons": [{"name": "vince lombardi t", "sentiment": "neutral"}, {"name": "tom brady", "sentiment": "neutral"}], "locations": [{"name": "nrg stadium", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "new england patriots", "sentiment": "neutral"}, {"name": "atlanta falcons", "sentiment": "none"}, {"name": "national football league", "sentiment": "none"}, {"name": "sb national", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With the National Football League playoffs in full swing, fans will spend their weekends rooting for their team to make it to the Super Bowl. For the players, a Super Bowl win doesn't just mean glory. It also comes with a hefty bonus check.\nBut, surprisingly, not one as hefty as the bonus check some other winning athletes can expect.\nSB Nation crunched the numbers to determine approximately how much athletes in every sport would take home after winning their respective championship game, looking at professional football, hockey, baseball and basketball. To compile the data, SB National analyzed major American sports leagues' collective bargaining agreements.\nshow chapters Dallas Cowboys running back Alfred Morris drives a $2 car 9:47 AM ET Thu, 19 Oct 2017 | 00:49 In total, Super Bowl 52's champs will receive around $191,000 each, though the number can fluctuate depending on the team's starting position and schedule. A team that has a bye during the wild card round will earn less than a lower-ranked team that goes on to win all four of their games.\nLast year, every member of the winning New England Patriots took home $107,000 , even if they didn't play a single minute. Even the losing team was compensated: The Atlanta Falcons received $53,000 each.\nIn comparison, baseball players on the Houston Astros who claimed a world series win in 2017 earned around $438,901.57. That's 130 percent more than their NFL counterparts for scoring a victory at the championship game.\nshow chapters This NFL starting quarterback drives a dented van he bought from his grandma for $5,000 11:38 AM ET Fri, 17 Nov 2017 | 00:52 Basketball falls somewhere in the middle — $221,000, as estimated by SB Nation — while hockey is decidedly less at around $163,000 per player.\nAlthough $191,000 is a sizable amount of money by normal standards, it pales in comparison to many NFL players' salaries. Take Drew Brees of the New Orleans Saints, Ben Roethlisberger of the Pittsburgh Steelers, Matt Ryan of the Atlanta Falcons and Tom Brady of the New England Patriots, who all earn more than $20 million per season .\nThere is one thing you can't put a price on, however: a Super Bowl ring. They can be worth anywhere from $5,000 to $37,000 or more, but the prestige that comes with being the best in the league, if only for a season, is priceless.\nDon't miss:\nHere's how much the highest-paid NFL players make now, compared to their first year in the league Why an NFL player who earns millions still drives a 26-year-old car he bought for $2 Why these 5 pro athletes earn millions but still drive super cheap cars Like this story? Like CNBC Make It on Facebook !\nshow chapters Why top MLB players are leaving major bat brands for this upstart company 7:25 AM ET Wed, 18 Oct 2017 | 01:50", "external_links": [], "published": "2018-01-14T17:01:00.000+02:00", "crawled": "2018-01-14T17:01:22.030+02:00", "highlightTitle": ""}