{"organizations": [], "uuid": "36b7ca53b09aa2f629e5ea9015204afe8ddc573b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-wingstop-appoints-larry-kruguer-executive-vice-president-and-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Wingstop Appoints Larry Kruguer Executive Vice President and Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:15:00.000+02:00", "replies_count": 0, "uuid": "36b7ca53b09aa2f629e5ea9015204afe8ddc573b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-wingstop-appoints-larry-kruguer-executive-vice-president-and-chief-operating-officer.html", "ord_in_thread": 0, "title": "Wingstop Appoints Larry Kruguer Executive Vice President and Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "larry kruguer", "sentiment": "negative"}, {"name": "kruguer", "sentiment": "none"}, {"name": "wingstop", "sentiment": "none"}, {"name": "larry", "sentiment": "none"}, {"name": "charlie morrison", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wingstop restaurants inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "wingstop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 05, 2018 (GLOBE NEWSWIRE) -- Wingstop Restaurants Inc. (NASDAQ:WING), the award-winning wing concept with more than 1,000 locations worldwide, today announced that Larry Kruguer has been appointed to the role of Executive Vice President and Chief Operating Officer. In his new role, Mr. Kruguer, who previously served as Wingstop’s President of International since 2015, will be responsible for the Company’s global operations, supply chain and training. He will continue to report directly to Charlie Morrison, Chairman and Chief Executive Officer.\n“Larry is a talented restaurant executive who has done an exceptional job building our international business with development agreements that will put Wingstop on five continents and thirteen countries, including our 100 th international location, opened just last week,” said Charlie Morrison. “This expanded role will leverage his broad business knowledge to integrate our U.S. and international organizations, further scaling them for future growth and becoming a top 10 global restaurant brand.”\n“I’m proud to be a part of Wingstop’s talented team and excited to help drive the continued operational excellence and success of this brand, which is truly in a category of its own,” said Kruguer. “Our growth proves that Wingstop is loved by fans around the world. Through our focused menu and operating model, we will continue to provide them with the high quality food, flavor and experience that they crave.”\nWingstop’s corporate and franchise-owned locations currently operate in nine countries including the U.S., Singapore, the Philippines, Indonesia, the United Arab Emirates, Malaysia, Saudi Arabia and Colombia. As of the end of 2017, the Company had over 1,000 signed commitments for new restaurant development globally.\nAbout Wingstop\nFounded in 1994 and headquartered in Dallas, Texas, Wingstop Inc. (NASDAQ:WING) operates and franchises more than 1,000 locations across the United States, Mexico, Singapore, the Philippines, Indonesia, the United Arab Emirates, Malaysia, Saudi Arabia and Colombia. The Wing Experts’ menu features classic and boneless wings with 11 bold, distinctive flavors including Original Hot, Cajun, Atomic, Mild, Teriyaki, Lemon Pepper, Hawaiian, Garlic Parmesan, Hickory Smoked BBQ, Louisiana Rub, and Mango Habanero. Wingstop’s wings are always cooked to order, hand-sauced and tossed and served with a variety of house-made sides including fresh-cut, seasoned fries. Having grown its domestic same store sales for 13 consecutive years, the Company has been ranked #3 on the “Top 100 Fastest Growing Restaurant Chains” by Nation’s Restaurant News (2016), #7 on the “Top 40 Fast Casual Chains” by Restaurant Business (2016), and was named “Best Franchise Deal in North America” by QSR magazine (2014). Wingstop was ranked #88 on Fortune’s 100 Best Medium Workplaces list in October 2016. Follow us on facebook.com/Wingstop and Twitter @Wingstop.\nMedia Contact\nBrian Bell\n972-707-3956\nbbell@wingstop.com\nInvestor Contact\nRaphael Gross\n203-682-8253\nraphael.gross@icrinc.com\nSource:Wingstop Restaurants, Inc.", "external_links": ["http://facebook.com/Wingstop", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0c46df32-a921-4d86-a9f0-da35ed272bf8"], "published": "2018-01-05T16:15:00.000+02:00", "crawled": "2018-01-05T18:06:14.006+02:00", "highlightTitle": ""}