{"organizations": [], "uuid": "9fee125a5c1ee58ba28befeee6772646af75ab1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221922599&w=1200&r=LYNXMPEE0D0FQ", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-sdf/u-s-led-coalition-helps-build-new-syrian-force-angering-turkey-idUSKBN1F30OA", "country": "US", "domain_rank": 408, "title": "U.S.-led coalition helps build new Syrian force, angering Turkey", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T16:47:00.000+02:00", "replies_count": 0, "uuid": "9fee125a5c1ee58ba28befeee6772646af75ab1f"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-sdf/u-s-led-coalition-helps-build-new-syrian-force-angering-turkey-idUSKBN1F30OA", "ord_in_thread": 0, "title": "U.S.-led coalition helps build new Syrian force, angering Turkey", "locations": [], "entities": {"persons": [], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "turkey reuters", "sentiment": "none"}, {"name": "sdf", "sentiment": "none"}, {"name": "syrian democratic forces", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "public affairs office", "sentiment": "none"}, {"name": "defense post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT/ISTANBUL (Reuters) - The U.S.-led coalition is working with its Syrian militia allies to set up a new border force of 30,000 personnel, the coalition said on Sunday, a move that has added to Turkish anger over U.S. support for Kurdish-dominated forces in Syria.\nA senior Turkish official told Reuters the U.S. training of the new “Border Security Force” was the reason that the U.S. charge d‘affaires was summoned in Ankara last week, and President Tayyip Erdogan’s spokesman said the development was worrying and unacceptable.\nThe force, whose inaugural class is currently being trained, will be deployed at the borders of the area controlled by the Syrian Democratic Forces (SDF) - an alliance of militias in northern and eastern Syria dominated by the Kurdish YPG.\nIn an email to Reuters, the coalition’s Public Affairs Office confirmed details of the new force reported by The Defense Post. About half the force will be SDF veterans, and recruiting for the other half is under way, the Public Affairs Office said.\nThe force will deploy along the border with Turkey to the north, the Iraqi border to the southeast and along the Euphrates River Valley, which broadly acts as the dividing line separating the U.S.-backed SDF and Syrian government forces backed by Iran and Russia.\nU.S. support for the SDF has put enormous strain on ties with NATO ally Turkey, which views the YPG as an extension of the Kurdistan Workers’ Party (PKK) - a group that has waged a three-decade insurgency in Turkey and is considered a terrorist group by the European Union, Turkey and the United States.\nErdogan’s spokesman Ibrahim Kalin said that Washington “is taking worrying steps to legitimise this organisation and make it lasting in the region”.\n“It is absolutely not possible for this to be accepted,” he said, adding that Turkey “will continue its fight against any terrorist organisation regardless of its name and shape within and outside its borders”.\nSyria’s main Kurdish groups have emerged as one of the few winners of the Syrian war and are working to entrench their autonomy over large parts of northern Syria.\nWashington opposes those autonomy plans, even as it has backed the SDF, the main partner for the U.S.-led coalition against Islamic State in Syria.\nThe coalition said the BSF would operate under SDF command and about 230 individuals were currently undergoing training in its inaugural class.\n”Efforts are taken to ensure individuals serve in areas close to their homes. Therefore, the ethnic composition of the force will be relative to the areas in which they serve.\n“More Kurds will serve in the areas in northern Syria. More Arabs will serve in areas along the Euphrates River Valley and along the border with Iraq to the south,” the coalition’s Public Affairs Office said.\n“A NEW MISSION”\n“The base of the new force is essentially a realignment of approximately 15,000 members of the SDF to a new mission in the Border Security Force as their actions against ISIS draw to a close,” it said.\n“They will be providing border security through professionally securing checkpoints and conducting counter-IED operations,” it said, adding that coalition and SDF forces were still engaging Islamic State pockets in Deir al-Zor province.\nIED stands for improvised explosive device.\nThe United States has about 2,000 troops in Syria fighting Islamic State and has said it is prepared to stay in the country until it is certain Islamic State is defeated, that stabilization efforts can be sustained and there is meaningful progress in U.N.-led peace talks on ending the conflict.\nThe Syrian government in Damascus has declared the United States an illegal occupation force and its SDF allies as “traitors”. A top Syrian Kurdish politician told Reuters last week that the United States appeared in no hurry to leave Syria.\nAdditional reporting by Dominic Evans in Istanbul; Editing by Louise Heavens and David Goodman\n ", "external_links": [], "published": "2018-01-14T16:47:00.000+02:00", "crawled": "2018-01-14T16:54:16.025+02:00", "highlightTitle": ""}