{"organizations": [], "uuid": "2d61fe19e9f577049f3b32e73ba74d950c9f13ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226197049&w=1200&r=LYNXMPEE0S0BK", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-precious/gold-edges-higher-on-easier-u-s-dollar-idINKBN1FI0E0", "country": "US", "domain_rank": 408, "title": "Gold edges higher on easier U.S. dollar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:14:00.000+02:00", "replies_count": 0, "uuid": "2d61fe19e9f577049f3b32e73ba74d950c9f13ae"}, "author": "", "url": "https://in.reuters.com/article/global-precious/gold-edges-higher-on-easier-u-s-dollar-idINKBN1FI0E0", "ord_in_thread": 0, "title": "Gold edges higher on easier U.S. dollar", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 5:14 AM / Updated 26 minutes ago Gold slips as U.S. dollar claws back, Treasury yields gain Renita D. Young , Jan Harvey 3 Min Read \nNEW YORK/LONDON (Reuters) - Gold prices fell on Monday as a recovery in the U.S. dollar and rising government bond yields prompted investors to cash in bullion after its sixth weekly price rise in seven weeks. \n“We’re seeing gold under pressure because the global bond yields are up across the board,” said Walter Pehowich, executive vice president of investment services at Dillon Gage Metals. “Germany, Italy, all up.” \nU.S Treasury yields hit multiyear highs on expectations that central banks around the world would reduce stimulus as economies improve. Higher yields on bonds make gold a less attractive investment because it pays no interest. [US/] \nSpot gold was down 0.5 percent at $1,342.56 an ounce by 2:05 p.m. EST (1905 GMT), while U.S. gold futures for February delivery settled down $11.80, or 0.9 percent, at $1,340.30. \nGold has risen more than 3 percent this month, and after a strong end to December touched its highest since August 2016 last week at $1,366.07 an ounce. \n“Asset managers have been increasing their exposure to gold since the beginning of the year,” said TD Securities commodities strategist Daniel Ghali. “With prices above $1,320 (an ounce), you could expect some want to take some profits as well.” \nGold prices have benefited largely from a slide in the dollar index to three-year lows. A rise in the currency on Monday after six straight weeks of losses pulled gold back. \nRising bond yields helped underpin the greenback ahead of a week packed with U.S. data. It remains on track for its biggest monthly decline since March 2016, however. [FRX/] \nThe currency came under pressure last week after Treasury Secretary Steven Mnuchin indicated he was broadly supportive of a weak dollar, although U.S. President Donald Trump later said he wanted to see strength in the greenback. \nTraders now await U.S. employment data and the outcome of a Federal Reserve policy meeting this week and will watch for implications for U.S. interest rates. \nAmong other precious metals, silver dropped 1.2 percent to $17.19 an ounce. It rose 2.3 percent last week, the biggest gain for any of the major precious metals. \nPlatinum, this year’s best-performing precious metal so far, was down 0.2 percent at 1,007.80 an ounce after easing 0.3 percent last week in its first weekly decline in seven. \nPalladium was down 0.4 percent at $1,087.90 an ounce, approaching a 2-1/2-week low. Additional reporting by Nithin Prasad in Bengaluru; Editing by Louise Heavens and Lisa Von Ahn", "external_links": [], "published": "2018-01-29T07:14:00.000+02:00", "crawled": "2018-01-29T07:23:05.061+02:00", "highlightTitle": ""}