{"organizations": [], "uuid": "9a5513624263c8478241954d68962879a7f8db89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-judith-mckenna-named-president-and-ceo-of-walmart-international.html", "country": "US", "domain_rank": 767, "title": "Judith McKenna Named President and CEO of Walmart International", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:04:00.000+02:00", "replies_count": 0, "uuid": "9a5513624263c8478241954d68962879a7f8db89"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-judith-mckenna-named-president-and-ceo-of-walmart-international.html", "ord_in_thread": 0, "title": "Judith McKenna Named President and CEO of Walmart International", "locations": [], "entities": {"persons": [{"name": "judith mckenna", "sentiment": "negative"}, {"name": "judith mc", "sentiment": "negative"}, {"name": "mckenna", "sentiment": "none"}, {"name": "doug mcmillon", "sentiment": "none"}, {"name": "kenna", "sentiment": "none"}, {"name": "david cheesewright", "sentiment": "none"}, {"name": "david", "sentiment": "none"}], "locations": [{"name": "bentonville", "sentiment": "none"}, {"name": "ark.", "sentiment": "none"}, {"name": "walmart u.s.", "sentiment": "none"}], "organizations": [{"name": "walmart international", "sentiment": "negative"}, {"name": "wal-mart stores inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)-- Wal-Mart Stores Inc. (NYSE: WMT) announced today that Judith McKenna will be promoted to President and Chief Executive Officer (CEO) of Walmart International, the company’s second-largest operating segment. She will be succeeding David Cheesewright, who has been in role since 2014 and recently shared his desire to retire from a full-time role.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117005826/en/\nJudith McKenna Named President and CEO of Walmart International (Photo: Business Wire)\nMcKenna, currently serving as Executive Vice President and Chief Operating Officer (COO) for Walmart U.S., will assume her new role on Feb. 1, 2018, and report to Walmart President and CEO, Doug McMillon.\n“During his 19 years with the company, David has served in a number of key leadership roles in our company. He has built a reputation as an insightful strategic thinker with a track record of delivering consistent, profitable growth. He has been instrumental in strengthening our business across the globe. He’s a passionate advocate for our people, culture and purpose around the world,” McMillon said.\nCheesewright will remain with the company full time through March and then serve the company, on a limited basis, with specific projects for a longer period of time.\n“I’ve had the pleasure to work with Judith for many years and have seen first-hand her ability to lead strategic change, build relationships with our associates and strengthen our business. It has been inspiring to see her personal growth and the results she’s driven over the years. Her integrity, high expectations and passion for the business and our associates will ensure our continued success in International,” said McMillon.\n“Being chosen to lead Walmart International truly is an honor, and I can’t think of a more exciting time to be in this part of the business,” said McKenna. “I look forward to building upon our progress to improve the experience for our customers and associates around the world.”\nMcKenna’s career with Walmart began in 1996 at Asda, the company’s U.K. operation, where she served as Chief Operating Officer and Chief Financial Officer. McKenna also served as Executive Vice President of Strategy and International Development for Walmart International. There, she led several areas, including international strategy, real estate, mergers and acquisitions, integration, global format development and purchase leverage.\nUpon moving to the Walmart U.S. division in April 2014, McKenna served as the business unit’s Chief Development Officer, where she led the strategy, development and growth of Walmart’s small format business and the partnership with Walmart.com to integrate digital commerce into the physical store presence. Several months later she was promoted to her expanded role as Executive Vice President and Chief Operating Officer for Walmart U.S. with responsibilities for the company’s U.S. store operations, including more than 4,500 retail locations.\nWalmart’s International division serves more than 100 million customers every week in more than 6,200 retail units, operating outside the United States with 55 banners in 27 countries.\nNOTE: A bio and high resolution photos for download of Judith McKenna are available at: http://corporate.walmart.com .\nAbout Walmart\nWal-Mart Stores, Inc. (NYSE: WMT) helps people around the world save money and live better - anytime and anywhere - in retail stores, online, and through their mobile devices. The company’s legal name will become Walmart Inc., effective on Feb. 1, 2018, to reflect its growing status as an omni-channel retailer. Each week, over 260 million customers and members visit our more than 11,600 stores under nearly 60 banners in 28 countries and eCommerce websites. With fiscal year 2017 revenue of $485.9 billion, Walmart employs approximately 2.3 million associates worldwide. Walmart continues to be a leader in sustainability, corporate philanthropy and employment opportunity. Additional information about Walmart can be found by visiting http://corporate.walmart.com , on Facebook at http://facebook.com/walmart and on Twitter at http://twitter.com/walmart .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005826/en/\nWalmart Media Relations\nMarilee McInnis, 1-800-331-0085\nmarilee.mcinnis@walmart.com\nSource: Wal-Mart Stores Inc.", "external_links": ["http://facebook.com/walmart", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ffacebook.com%2Fwalmart&esheet=51744560&newsitemid=20180117005826&lan=en-US&anchor=http%3A%2F%2Ffacebook.com%2Fwalmart&index=3&md5=f0b0a8da814e4c9143e77a9319aa2075", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftwitter.com%2Fwalmart&esheet=51744560&newsitemid=20180117005826&lan=en-US&anchor=http%3A%2F%2Ftwitter.com%2Fwalmart&index=4&md5=ec7dfdd2b9a60c6f83e51694d6f6bf0c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fcorporate.walmart.com%2F&esheet=51744560&newsitemid=20180117005826&lan=en-US&anchor=http%3A%2F%2Fcorporate.walmart.com&index=1&md5=8786d5e3a2d7bbe0e3ea027b663b496b", "http://www.businesswire.com/news/home/20180117005826/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fcorporate.walmart.com&esheet=51744560&newsitemid=20180117005826&lan=en-US&anchor=http%3A%2F%2Fcorporate.walmart.com&index=2&md5=82c013163e5432ca0ae8cf860987c781", "http://twitter.com/walmart"], "published": "2018-01-17T17:04:00.000+02:00", "crawled": "2018-01-17T19:14:28.002+02:00", "highlightTitle": ""}