{"organizations": [], "uuid": "778d07a56143bc37d10b68c4b1e2aaa3aa46a7e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-holds-near-4-month-high-as-investors-seek-to-hedge-risks-idUSL8N1P639D", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold near 4-month highs after hawkish ECB boosts euro", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.901, "site_type": "news", "published": "2018-01-11T20:20:00.000+02:00", "replies_count": 0, "uuid": "778d07a56143bc37d10b68c4b1e2aaa3aa46a7e4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-holds-near-4-month-high-as-investors-seek-to-hedge-risks-idUSL8N1P639D", "ord_in_thread": 0, "title": "PRECIOUS-Gold near 4-month highs after hawkish ECB boosts euro", "locations": [], "entities": {"persons": [{"name": "peter hobson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* ECB hints at tighter monetary policy * Dollar falls on weak U.S. inflation, more jobless claims * Gold up more than $80 since mid-December * Analysts expect short term price correction (Updates prices) By Peter Hobson LONDON, Jan 11 (Reuters) - Gold prices rose on Thursday to near their highest in four months after a hawkish tone in the minutes of a European Central Bank meeting pushed the euro sharply higher against the dollar. The minutes from the ECB's December meeting said the central bank should revisit its communication stance in early 2018 and gradually adjust its language to reflect improved growth prospects. A change in policy message would likely be taken by investors as a sign that rate-setters may begin to wind down their 2.55 trillion euros bond-buying programme. The stronger euro benefits gold prices by making dollar-denominated bullion cheaper for European investors, potentially boosting demand. The dollar also weakened more broadly after data showed a rise in U.S. jobless claims and a decrease in U.S. producer prices, making gold cheaper for other non-U.S. buyers. Spot gold was up 0.3 percent at $1,321.02 an ounce at 1426 GMT after touching $1,326.56 on Wednesday, the highest since Sept. 15. U.S. gold futures were 0.2 percent higher at $1,321.40 an ounce. Gold has rallied by more than $80 since a low in mid-December, helped by a weaker dollar, but will struggle to rise much further in the short term, said Saxo Bank analyst Ole Hansen. \"We see gold higher this year but it really is in need of a correction to test the strength of this move,\" he said. Several factors were supporting prices, including a dip in global stock markets this week following a spectacular rally. \"A highly-anticipated stock market correction is providing support on dips which continues to support the bullish gold narrative,\" said Oanda trader Stephen Innes. \"Rising oil prices and strong global growth also suggest gold will remain supported as investors look for inflation protection,\" he said. Oil prices were near three-year highs on Thursday and industrial metals such as copper and aluminium were close to multi-year peaks, which will drive up the cost of goods and services. Demand for gold in China would also be strong ahead of the Chinese Lunar New year holiday beginning on Feb. 15, said MKS PAMP trader Alex Thorndike. \"As Chinese seasonal buying picks up, the down-side should remain supported into February. We feel that a $1,300-1,335 range should hold or the short term,\" he said in a note. Among other precious metals, spot silver was up 0.2 percent at $16.97 an ounce from a two week low of $16.86 on Wednesday. Platinum was 1 percent higher at $980.50 an ounce after touching $982.10, the highest since Sept. 15. Palladium was 0.4 percent lower at $1,078.72, down from a record high of $1,111.40 on Tuesday. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Pritha Sarkar and Mark Potter)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T20:20:00.000+02:00", "crawled": "2018-01-11T17:08:22.000+02:00", "highlightTitle": ""}