{"organizations": [], "uuid": "632b450e4c2f49ae120a5fdaaedc45f63c92725c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/auto-flyingcars-degree/self-driving-car-experts-offer-online-degree-in-flying-cars-idUSL2N1PI11W", "country": "US", "domain_rank": 408, "title": "Self-driving car experts offer online degree in 'flying cars'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:00:00.000+02:00", "replies_count": 0, "uuid": "632b450e4c2f49ae120a5fdaaedc45f63c92725c"}, "author": "", "url": "https://www.reuters.com/article/auto-flyingcars-degree/self-driving-car-experts-offer-online-degree-in-flying-cars-idUSL2N1PI11W", "ord_in_thread": 0, "title": "Self-driving car experts offer online degree in 'flying cars'", "locations": [], "entities": {"persons": [{"name": "paul lienert", "sentiment": "negative"}, {"name": "sebastian thrun", "sentiment": "none"}, {"name": "thrun", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "none"}, {"name": "stanford university", "sentiment": "none"}, {"name": "silicon valley online school udacity", "sentiment": "none"}, {"name": "udacity", "sentiment": "none"}, {"name": "aerial robotics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "intelligent air systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Updated 5 minutes ago Self-driving car experts offer online degree in 'flying cars' Paul Lienert 3 Min Read \nJan 23 (Reuters) - Self-driving car pioneer Sebastian Thrun has shifted his gaze to the skies, as his Silicon Valley online school Udacity launches what it calls the first “nanodegree” in flying car engineering. \nWith companies from Airbus and Amazon to Uber throttling up development of their own autonomous aerial vehicles, Thrun believes “in a few years time, this will be the hottest topic on the planet.” \nAs usual, Thrun intends to be on the cutting edge of this emerging technology. \nThe 50-year-old PhD computer scientist and former Stanford University professor, co-founded Udacity in 2012 and says the online school’s self-driving car program has attracted 50,000 applicants since 2016. He expects the new flying car curriculum, which opens in late February and begins taking applications on Tuesday, to draw at least 10,000. \nUdacity is offering two 12-week terms, at $1,200 each, including a course in Aerial Robotics and one in Intelligent Air Systems, that provide an online certification in a fraction of the time of a traditional degree course. \nIn an interview, Thrun said his motivation in creating the flying-car program was similar to what drove the school’s widely publicized self-driving car course. \nThrun said “it’s almost impossible to hire qualified people” to design and engineer future vehicles - both terrestrial and aerial - that employ advanced technology, including robotics, artificial intellience and machine learning. \n“There is a huge shortage of engineers. There are plenty of smart people - the missing link is education,” said Thrun, who headed the team that launched Google’s self-driving car project, since renamed Waymo. \nThrun remains an advisor to Google parent Alphabet Inc and retains close ties to Alphabet CEO and co-founder Larry Page. \nPage is an investor in Kitty Hawk Corp, a two-year-old startup based in Mountain View, California, whose stated mission is “to make the dream of personal flight a reality.” Thrun is chief executive of Kitty Hawk and a co-owner. \nKitty Hawk’s first prototype, dubbed the Flyer, is not exactly a flying car, but more of a one-person drone that is capable of vertical takeoff and landing and does not need wheels. \n“‘Flying car’ might be a bit of a misnomer - more of an attention grabber,” admits Thrun, who said he has been working with Page and others to develop autonomous aerial vehicles. \n“It feels like science fiction now,” Thrun said. “But with Google and Amazon moving in, there is going to be enormous activity around this in the next year or two.” (Reporting by Paul Lienert in Detroit; Editing by Andrew Hay)", "external_links": [], "published": "2018-01-23T20:00:00.000+02:00", "crawled": "2018-01-23T20:11:42.000+02:00", "highlightTitle": ""}