{"organizations": [], "uuid": "35b3b70e781c5ba0b5343f6d50b0ff693ac14268", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-citizens-first-corporation-announces-fourth-quarter-and-year-end-2017-results-declares-quarterly-common-dividend.html", "country": "US", "domain_rank": 767, "title": "Citizens First Corporation Announces Fourth Quarter and Year End 2017 Results, Declares Quarterly Common Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:48:00.000+02:00", "replies_count": 0, "uuid": "35b3b70e781c5ba0b5343f6d50b0ff693ac14268"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-citizens-first-corporation-announces-fourth-quarter-and-year-end-2017-results-declares-quarterly-common-dividend.html", "ord_in_thread": 0, "title": "Citizens First Corporation Announces Fourth Quarter and Year End 2017 Results, Declares Quarterly Common Dividend", "locations": [], "entities": {"persons": [{"name": "todd kanipe", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "ky.", "sentiment": "none"}], "organizations": [{"name": "citizens first corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOWLING GREEN, Ky., Jan. 19, 2018 /PRNewswire/ -- Citizens First Corporation ( NASDAQ: CZFC ) today reported results for the year ended December 31, 2017 which include the following:\nFor the quarter ended December 31, 2017 the Company reported net income of $952,000, or $0.37 per diluted common share (EPS). This represents a decrease of $151,000 from $1.1 million, or $0.43 per diluted common share, for the quarter ended December 31, 2016. For the year ended December 31, 2017, net income totaled $4.09 million, or $1.60 per diluted common share. This represents a decrease of $128,000, or $0.06 per diluted common share, from the net income of $4.22 million for the previous year.\nOn December 22, 2017, President Trump signed \"H.R.1\", which among other items reduces the federal corporate tax rate to 21% effective January 1, 2018. As a result, income tax expense increased $401,000 during the quarter due to the Company's deferred tax assets being revalued. \"Our quarterly and annual EPS was negatively impacted $0.16 by the deferred tax revaluation,\" stated Todd Kanipe, President and CEO. \"However, the Company will benefit from lower tax rates in 2018 and beyond.\"\nIncome before income taxes increased $424,000, or 7.1%, for the year ended December 31, 2017 compared to the previous year. \"The Company reduced operating expenses in 2017, and we have maintained excellent credit quality,\" said Kanipe. \"We have also been able to improve our overall capital with a tangible common equity ratio that now exceeds 9%.\" Shares of CZFC closed at $24.00 as of December 31, 2017, an increase of 33.3% from the closing price of $18.00 at December 31, 2016.\nIncome Statement Fourth Quarter 2017 Compared to Fourth Quarter 2016\nNet interest income increased $127,000, or 3.2%, from the fourth quarter of the prior year. The Company's net interest margin was 3.74% for the quarter ended December 31, 2017, compared to 3.80% for the quarter ended December 31, 2016, a decrease of six basis points. The Company's net interest margin dropped as a result of an increase in the cost of interest-bearing liabilities, which grew by 20 basis points while the yield on earning assets increased by only 10 basis points.\nThere was a $150,000 credit provision for loan losses in the fourth quarter of the current year compared to no credit or provision in the fourth quarter of the prior year.\nNon-interest income decreased $15,000, or 1.7%, from the fourth quarter of the prior year primarily due to a decrease in service charges on deposit accounts of $56,000, partially offset by an increase in other service charges and fees of $43,000.\nNon-interest expense decreased $118,000, or 3.7%, from the fourth quarter of the prior year primarily due to a decrease in data processing services of $64,000 and franchise shares and deposit tax expenses of $44,000, partially offset by an increase in professional fees of $36,000.\nIncome Statement Current Year Compared to Prior Year\nNet interest income decreased $56,000, or 0.4%, as the yield on loans decreased and the cost of funds increased from the prior year. The Company's net interest margin was 3.70% for the year ended December 31, 2017, and 3.87% for the year ended December 31, 2016, a decrease of 17 basis points. The Company's net interest margin was impacted by a decrease in the yield on average earning assets of eight basis points coupled with an increase in the cost of average interest-bearing liabilities of 12 basis points.\nThere was a $150,000 credit provision for loan losses in the current year and an $85,000 credit provision in the prior year.\nNon-interest income decreased $72,000, or 2.0%, primarily due to a decrease in service charges on deposit accounts of $159,000, a reduction in gains on the sale of securities of $78,000 and a decrease in gains on the sales of mortgage loans of $58,000, offset by an increase in other service charges and fees of $143,000 and non-deposit brokerage fees of $50,000.\nNon-interest expense decreased $487,000, or 3.7%, primarily due to reductions in most categories of expenses, including $176,000 in other expenses, $127,000 in data processing services, $123,000 in occupancy expenses, and $73,000 in personnel expenses.\nCredit Quality\nNon-performing assets totaled $1.3 million, or 0.29% of total assets, at December 31, 2017 compared to $23,000, or 0.01% of total assets at December 31, 2016, an increase of $1.3 million. The balance is primarily one agricultural-related credit which was moved to non-accrual status during the first quarter of 2017.\nThe allowance for loan losses at December 31, 2017 was $4.7 million, or 1.26% of total loans, compared to $4.9 million, or 1.35% of total loans as of December 31, 2016. We consider the size, volume and credit quality of the loan portfolio as well as recent economic and other external influences to record the allowance for loan losses and provision for loan losses that is directionally consistent with our loan portfolio.\nBalance Sheet\nTotal assets at December 31, 2017 were $465.4 million, compared to $455.4 million at December 31, 2016, an increase of $10.0 million or 2.2%. Loans increased $14.8 million, or 4.1%, from December 31, 2016 to December 31, 2017, while available-for-sale securities decreased $4.9 million, or 9.2% from December 31, 2016 to December 31, 2017. Deposits increased $1.9 million, or 0.5%, from December 31, 2016 to December 31, 2017. Borrowings from the Federal Home Loan Bank increased $5.0 million, or 14.3%, from December 31, 2016 to December 31, 2017.\nStockholders' equity increased to $45.8 million at December 31, 2017 from $42.4 million at December 31, 2016. The book value per common share and tangible book value per common share ratios were $18.14 and $16.47, respectively, at December 31, 2017 compared to $17.54 and $15.40, respectively, at December 31, 2016.\nQuarterly Common Dividend\nOn January 18, 2018, the Board of Directors declared a quarterly cash dividend of $0.06 per common share payable February 15, 2018 to shareholders of record on February 2, 2018. Dividends paid during 2017 totaled $0.18 per common share. \"Converting from a semiannual dividend to a quarterly dividend will minimize some confusion about the timing of our dividend. We believe this increased common dividend is consistent with our goal of maximizing total shareholder return,\" Kanipe added.\nAbout Citizens First Corporation\nCitizens First Corporation is a bank holding company headquartered in Bowling Green, Kentucky and established in 1999. The Company has branch offices located in Barren, Hart, Simpson and Warren Counties in Kentucky, and a loan production office in Williamson County, Tennessee. Additional information concerning our products and services is available at www.citizensfirstbank.com .\nForward-Looking Statements\nStatements in this press release relating to Citizens First Corporation's plans, objectives, expectations or future performance are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are based upon the Company's current expectations, but are subject to certain risks and uncertainties that may cause actual results to differ materially. Among the risks and uncertainties that could cau", "external_links": ["http://www.prnewswire.com/news-releases/citizens-first-corporation-announces-fourth-quarter-and-year-end-2017-results-declares-quarterly-common-dividend-300585376.html", "http://www.citizensfirstbank.com/"], "published": "2018-01-19T21:48:00.000+02:00", "crawled": "2018-01-19T22:39:30.005+02:00", "highlightTitle": ""}