{"organizations": [], "uuid": "586ea451a376ff44b5a035b938d7350b69ef2616", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221723475&w=1200&r=LYNXMPEE0C0EM", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-france-macron-biography/brigitte-biography-says-young-macron-wrote-steamy-book-about-their-romance-idUSKBN1F20NB", "country": "US", "domain_rank": 408, "title": "Brigitte biography says young Macron wrote steamy book about their romance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.974, "site_type": "news", "published": "2018-01-13T23:53:00.000+02:00", "replies_count": 0, "uuid": "586ea451a376ff44b5a035b938d7350b69ef2616"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-france-macron-biography/brigitte-biography-says-young-macron-wrote-steamy-book-about-their-romance-idUSKBN1F20NB", "ord_in_thread": 0, "title": "Brigitte biography says young Macron wrote steamy book about their romance", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "neutral"}, {"name": "brigitte", "sentiment": "neutral"}, {"name": "brigitte macron", "sentiment": "neutral"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "amiens", "sentiment": "none"}, {"name": "providence", "sentiment": "none"}, {"name": "elysee palace", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - A new biography of French first lady Brigitte Macron says her husband penned a racy novel inspired by their early romance, when he was still a teenager and she his married drama teacher.\nPresident Emmanuel Macron, who turned 40 last month, fell for Brigitte during rehearsals for a school play at the Providence high school in Amiens, and defied his parents’ disapproval to pursue the relationship with a woman 24 years his senior.\nThe book, “Brigitte Macron, The Liberated Woman”, to be published next week, Quote: s a family neighbor from Macron’s home town who says she typed up the 300-page manuscript.\n“It was a daring novel, a little bit smutty. Of course, the names were not the same but I think he needed to express what he was feeling at the time,” the unnamed neighbor is Quote: d as saying in excerpts published by Closer magazine.\nA spokeswoman for Macron’s office declined to comment.\nBrigitte Macron, wife of French President Emmanuel Macron, holds a slice of a traditional epiphany cake during a ceremony at the Elysee Palace in Paris, France, January 12, 2018. REUTERS/Christophe Archambault/Pool In the excerpts, the typist said she had not kept a copy of the novel - perhaps sparing the blushes of a leader who has promised to clean up French politics and says he wants to restore the dignity of the presidency.\nBut Macron would not be the only current French politician to try his hand at adult literature.\nIn 2011, the prime minister, Edouard Philippe, co-authored ‘Dans l‘ombre’ (In the shadows), a political thriller laced with steamy encounters. The finance minister, Bruno Le Maire, has written a novel entitled ‘Le Ministre’ (The Minister), which includes a steamy scene between the minister and his wife in Venice.\nMacron’s literary ambitions as a young man are well known and he wrote at least two unpublished works before authoring a book entitled “Revolution” during his election campaign.\nHe told the weekly magazine Le Point last year that he had not sought a publisher for the earlier works “as I was not happy with them”.\nIn a separate article for the same magazine, asked by French author Philippe Besson if he regretted not becoming a writer himself, Macron replied: “My life isn’t finished yet.”\nAdditional reporting by Jean-Baptiste Vey; Editing by Kevin Liffey\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T23:53:00.000+02:00", "crawled": "2018-01-13T18:04:45.001+02:00", "highlightTitle": ""}