{"organizations": [], "uuid": "65f1a9553873c17386d9d26a5782fdafce8d491d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221193844&w=1200&r=LYNXMPEE0A1HI", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-tivo-comcast-lawsuit/tivo-hits-comcast-with-new-round-of-patent-lawsuits-idUSKBN1F02C2", "country": "US", "domain_rank": 408, "title": "Tivo hits Comcast with new round of patent lawsuits", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:25:00.000+02:00", "replies_count": 0, "uuid": "65f1a9553873c17386d9d26a5782fdafce8d491d"}, "author": "", "url": "https://www.reuters.com/article/us-tivo-comcast-lawsuit/tivo-hits-comcast-with-new-round-of-patent-lawsuits-idUSKBN1F02C2", "ord_in_thread": 0, "title": "Tivo hits Comcast with new round of patent lawsuits", "locations": [], "entities": {"persons": [{"name": "jan wol", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "comcast", "sentiment": "negative"}, {"name": "tivo", "sentiment": "negative"}, {"name": "tivo corp", "sentiment": "none"}, {"name": "u.s. international trade commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "comcast corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Tivo Corp ( TIVO.O ) has again sued cable operator Comcast Corp ( CMCSA.O ) of using its patented interactive programing technology without authorization, the latest salvo in the companies’ long-running royalty dispute.\nTivo filed lawsuits in Boston and Los Angeles on Wednesday, saying Comcast’s X1 video recording system infringed on patents describing functionality like pausing and resuming shows on different devices and restarting live programing in progress.\nA pioneer in digital video recording technology, Tivo said on Thursday that it also planned to sue Comcast at the U.S. International Trade Commission, a government agency that can hear patent disputes and ban infringing products from entering the country.\nComcast said in a statement that it independently created its X1 products and that it would aggressively defend itself against the lawsuits, calling them an attempt by Tivo to make money from an “aging and increasingly obsolete patent portfolio.”\nTivo subsidiary Rovi Corp sued Comcast in federal court in Texas and at the ITC in April 2016 after the cable operator declined to renew a long-standing agreement to license the company’s patents. That deal, reached 13 years ago and valued at $250 million, expired in March 2016, according to a Tivo court filing.\nThe ITC ruled in November that Comcast’s X1 platform infringed on two Tivo patents describing a system for s`1cheduling recordings through a smartphone app. The agency said four other Tivo patents were not infringed.\nComcast said it would remove the scheduling feature, which only a small percentage of customers used, so it could continue to offer X1 to customers while it appealed the ITC’s ruling.\nJPMorgan analyst Sterling Auty said in a November research note that the ruling could prompt Comcast to resolve the lawsuits through a new licensing agreement.\nSan Carlos, California-based Tivo was one of the first DVR makers but in recent years has focused on licensing its patent portfolio.\nThe patents at issue in Wednesday’s lawsuits were originally granted to Rovi, a provider of digital television guides that merged with Tivo in 2016, and its Andover, Massachusetts-based subsidiary Veveo Inc.\nReporting by Jan Wolfe; Editing by Lisa Von Ahn and Richard Chang\n ", "external_links": [], "published": "2018-01-11T19:25:00.000+02:00", "crawled": "2018-01-11T19:30:03.000+02:00", "highlightTitle": ""}