{"organizations": [], "uuid": "9e3d02cd5b67fee973ad973d06c7446404cf9f4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219564213&w=1200&r=LYNXMPEE040IP", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics-scenarios/second-time-lucky-merkel-starts-over-with-coalition-talks-idUKKBN1EU0WJ", "country": "US", "domain_rank": 408, "title": "Second time lucky? Merkel starts over with coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T12:14:00.000+02:00", "replies_count": 0, "uuid": "9e3d02cd5b67fee973ad973d06c7446404cf9f4c"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics-scenarios/second-time-lucky-merkel-starts-over-with-coalition-talks-idUKKBN1EU0WJ", "ord_in_thread": 0, "title": "Second time lucky? Merkel starts over with coalition talks", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "madeline chambers", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 10:15 AM / Updated 5 hours ago Second time lucky? Merkel starts over with coalition talks Madeline Chambers 6 Min Read \nBERLIN (Reuters) - German Chancellor Angela Merkel, weakened by an election setback in September, launches a second bid to build a coalition government on Sunday when she sits down with the Social Democrats (SPD) for exploratory talks. German acting Chancellor Angela Merkel poses for photographs after the television recording of her annual New Year's speech at the Chancellery in Berlin, Germany, December 30, 2017. REUTERS/Hannibal Hanschke \nA re-run of her ‘grand coalition’ with the SPD, in power from 2013 to 2017, appears the best option for conservative Merkel is as it would provide stability in what would be her fourth term. \nBut with success far from guaranteed, there are a range of other possible scenarios. \nAfter her conservatives bled support to the far-right Alternative for Germany (AfD) in the Sept. 24 national election, Merkel saw her authority undermined two months later by the collapse of three-way coalition talks with the pro-business Free Democrats (FDP) and Greens. \nThat shifted her focus back to the SPD, but the centre-left party is wary of another tie-up with Merkel after voters punished it for four years of power-sharing in the September vote, when its support slumped to its lowest level since 1933. \nThe consensus among politicians and commentators is that the talks will last at least until March. \nAlthough the current caretaker government under Merkel is keeping things ticking over, investors fear that protracted talks will delay what they view as necessary reforms in Europe’s biggest economy and the bloc as a whole. \nAfter a flow of leaks, tweets and selfies emanating from last year’s three-way coalition talks undermined trust, this time around participants have agreed to a news blackout during negotiations. \nHere are the main scenarios: GRAND COALITION OF CONSERVATIVES, SPD \nThe most likely outcome, given that the two camps have ruled together for eight of the 12 years Merkel has been chancellor and broadly agree on foreign and security policy. However, with both blocs struggling to stem a fall in support, it is by no means a done deal. \nThey are at odds on a range of issues, from tax to healthcare and Europe. The SPD wants a wholesale reform of health insurance to end what it describes as a two-tier system. Conservatives oppose this idea and are more sceptical than the SPD on plans for deeper EU integration. \nMigrant policy is likely to be one of the trickiest issues as Germany struggles to integrate the more than 1.6 million asylum seekers who have arrived since the start of 2015. \nBavaria’s Christian Social Union (CSU), sister party to Merkel’s Christian Democrats (CDU), has called for benefit cuts for asylum seekers and wants limits on family members joining refugees in Germany - anathema to the SPD. \nOffering the greatest degree of stability, this tie-up is Merkel’s favoured option but many SPD members are wary. The party had promised to go into opposition after its worst election result since 1933. \nThe SPD leadership, worried about internal splits, seems certain to make tough demands and has stressed that the outcome of talks is open. It is offering members a vote on Jan. 21 after ‘exploratory’ talks before leaders start official coalition negotiations. Outgoing Bavarian state premier and leader of the Christian Social Union (CSU) Horst Seehofer, Alexander Dobrindt of the Christian Social Union (CSU) and Hungarian Prime Minister Victor Orban arrive for a statement after a CSU party meeting at 'Kloster Seeon' in Seeon, Germany, January 5, 2018. REUTERS/Michaela Rehle \n‘KOKO’ COOPERATION DEAL BETWEEN CONSERVATIVES, SPD \nMooted by sceptics of a grand coalition in the SPD, the centre-left party would work with Merkel in some areas including the budget and European and foreign affairs but force her to find ad-hoc parliamentary majorities for other policies. \nWhile this is more palatable to many SPD members, many senior conservatives have rejected the idea outright, rendering it unlikely. MINORITY GOVERNMENT UNDER MERKEL \nThis would be a post-war first for a country that craves political stability - a result of the fragmentation in the years that preceded the rise of Hitler’s Nazi party. \nNevertheless, some Social Democrats prefer this option, which would allow them to oppose Merkel’s policies and force her to seek parliamentary majorities on individual laws. It would also be likely to hasten the end of her political career. NEW ELECTIONS \nSome conservatives, including Merkel, have said they would prefer new elections to a minority government. \nThis scenario would also throw Merkel’s future into doubt. She has indicated she could stand again and, while the absence of an obvious successor makes her the most likely candidate, her personal ratings are on the wane. \nAs far as the parties go, opinion polls indicate there have been no big swings since the September election. A GMS survey this week put the conservative bloc on 32 percent, unchanged from the previous week, the SPD was down 1 point at 20 percent and AfD up 1 point at 14 percent. \nGermany’s President Frank-Walter Steinmeier, who would have to get involved if no coalition deal was agreed, has made clear he wants to avoid new elections if possible. \n‘JAMAICA’ COALITION OF CONSERVATIVES, FDP, GREENS \nThere is little appetite for a re-run of talks on this nationally untested three-way alliance, dubbed ‘Jamaica’ because the parties’ colours match those of the Jamaican flag. \nDivergences on policies from Europe to tax and migration were clear during the weeks of talks that descended into acrimony last year before collapsing. \nHowever, some in the FDP - which was responsible for the breakdown of talks in November - have left the door open to another try if all other efforts at forming a government fail. OTHER OPTIONS \nSome experts have pointed to the possibility of an alliance between the conservatives and Greens - easier to agree than a three-way deal with the FDP. This could get a degree of backing on some policies from the SPD. However, this seems an unlikely option and would be unstable. Reporting by Madeline Chambers; editing by John Stonestreet", "external_links": [], "published": "2018-01-05T12:14:00.000+02:00", "crawled": "2018-01-05T12:37:13.003+02:00", "highlightTitle": ""}