{"organizations": [], "uuid": "d3f92740a74571292ce5d8bc52a359fbe89d1225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-4-oil-buckles-as-stronger-dollar-bites-into-risk-linked-assets.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-Oil buckles as stronger dollar bites into risk-linked assets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:16:00.000+02:00", "replies_count": 0, "uuid": "d3f92740a74571292ce5d8bc52a359fbe89d1225"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-4-oil-buckles-as-stronger-dollar-bites-into-risk-linked-assets.html", "ord_in_thread": 0, "title": "UPDATE 4-Oil buckles as stronger dollar bites into risk-linked assets", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. west texas intermediate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Drillers in U.S. added 12 rigs in week to Jan. 26 -Baker Hughes\n* U.S. oil output soon expected to exceed 10 mln bpd\n* Oil prices still on track for fifth straight monthly gain (Updates throughout, adds comment, refreshes prices; changes dateline from TOKYO)\nLONDON, Jan 30 (Reuters) - Oil fell on Tuesday for a second day as a strengthening dollar dented risk-linked assets such as equities and other commodities, together with rising U.S. output, pushing the price below $69 a barrel for the first time in six days.\nBrent crude futures fell 20 cents on the day to $69.26 a barrel by 1000 GMT, having touched a session low of $68.75, while U.S. West Texas Intermediate futures dropped 51 cents to $65.05 a barrel.\nEuropean stock markets were firmly in negative territory after a recovering dollar and a drop in shares of Apple sent Wall Street to its largest one-day fall in five months the previous day.\nWith oil's negative correlation to the dollar reaching its strongest in a month, even ongoing signs of robust demand for crude were not enough to ward off profit-taking following last week's rise to three-year highs.\n\"I do have the feeling that market optimism pushed prices perhaps a little bit too high, but ... as long as (inventories) continue to decline, for me, personally, I'm more and more looking at a 'buy-on-dips' strategy, so I'm looking for a correction lower,\" ABN Amro chief energy economist Hans van Cleef said.\nOil's inverse relationship to the dollar, whereby a stronger currency makes it more expensive for non-U.S. investors to buy dollar-denominated assets, has reasserted itself this week.\n\"Correlations are funny things. Sometimes they work and sometimes they dont. For most of 2017, the relationship between the dollar and the oil price was not obvious,\" PVM Oil Associates strategist Tamas Varga said in a note.\n\"This is the trend that seems to be turning, judging by yesterdays price action and this mornings moves. Rising US bond yields caused dollar shorts cover and as a result oil prices fell.\"\nExpectations for U.S. inventories to rise for the first time in 11 weeks may also be keeping oil under pressure, according to a preliminary poll by Reuters on Monday.\nU.S. production is already on par with that of Saudi Arabia, the biggest producer in the Organization of the Petroleum Exporting Countries (OPEC). Only Russia produces more, averaging 10.98 million barrels per day (bpd) in 2017.\nU.S. output <C-OUT-T-EIA> has jumped more than 17 percent since mid-2016 and is expected to exceed 10 million bpd soon.\nThe rising tide of U.S. oil output comes after prices rose following an agreement by OPEC producers, along with Russia and other countries, on output curbs.\n(Additional reporting by Henning Gloystein; Editing by Louise Heavens)", "external_links": [], "published": "2018-01-30T12:16:00.000+02:00", "crawled": "2018-01-30T15:12:31.013+02:00", "highlightTitle": ""}