{"organizations": [], "uuid": "f02e3d25dff057a1aa99eb87dcd88d9354c714cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-891638948.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/13/bitcoin-ripple-price-star-wars-time-cyber-book/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Ups and Downs, Securing 'Star Wars', TIME's New Cyber Book | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.729, "site_type": "news", "published": "2018-01-13T17:59:00.000+02:00", "replies_count": 0, "uuid": "f02e3d25dff057a1aa99eb87dcd88d9354c714cc"}, "author": "Robert Hackett", "url": "http://fortune.com/2018/01/13/bitcoin-ripple-price-star-wars-time-cyber-book/", "ord_in_thread": 0, "title": "Bitcoin Ups and Downs, Securing 'Star Wars', TIME's New Cyber Book | Fortune", "locations": [], "entities": {"persons": [{"name": "ware", "sentiment": "none"}, {"name": "willis ware", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rand corporation", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3:59 PM EST \nGood afternoon, Cyber Saturday readers. \nI’m kicking off the new year with a first: I wrote the introduction to an upcoming book about “the unseen internet” published by Fortune’s sister TIME . This special edition, which covers hacking, cyberespionage, digital security, and more, goes on sale next week. You can preorder a copy here . \nIn lieu of today’s essay, I’ve produced a brief excerpt of the introduction—abridged for this newsletter—below. \nJust as the foundations for what would become the internet were being laid within his division of the RAND Corporation in 1967, Willis Ware sounded a note of alarm. “Great quantities of private information are being accumulated in computer files,” one of the world’s earliest computing pioneers and an eventual National Security Agency adviser warned in a paper, “and the incentives to penetrate the safeguards to privacy are bound to increase.” \nWare was right. Half a century later, the world faces a dawning realization that its enthusiasm for connection has created complications. Bluntly, it has put us all in danger. Our identities, our finances, our families, our homes—nearly everything anchored in the physical world has some point of entry that opens it up to attack through the electronic ether. \nWe often talk about cybersecurity, but the reality is more accurately described by the phrase’s antithesis: cyber-insecurity. In the pages that follow, we lay out the many invisible forces at work that are shaping this storm. Though the water may look calm on the surface, underneath a riptide is readying to suck your personal information—and then some—out to sea. Staying high and dry isn’t an option unless you plan to live without access to the internet, so you’d better learn to swim. \nThis special edition aims to help you do just that. \nIf you’re interested in learning more about the book, you can read this series of tweets I posted Thursday, or check out its page on Amazon . \nEnjoy the long weekend—and stay safe. \nRobert Hackett \n@rhhackett \nrobert.hackett@fortune.com \nWelcome to the Cyber Saturday edition of Data Sheet, Fortune’ s daily tech newsletter. Fortune reporter Robert Hackett here. You may reach Robert Hackett via Twitter , Cryptocat , Jabber (see OTR fingerprint on my about.me ), PGP encrypted email (see public key on my Keybase.io ), Wickr , Signal , or however you (securely) prefer. Feedback welcome. THREATS \nUber bug bounty or hacker hush-up? When a hacker under the alias “John Doughs” alerted Uber to some sloppy security practices that put the data of 57 million driver and rider accounts at risk in 2016, the ride-hailing firm triaged it as part of its bug bounty program. The New York Times has revealed new details about that controversial move, which critics have described as effectively a ransom payment to keep the hacker quiet. Some of the emails sent by the hacker to Uber could be interpreted as blackmail or extortion, complicating the narrative about whether Uber should have disclosed the incident as a data breach. \nFISA fight. Despite conflicting tweets from President Donald Trump, the U.S. House of Representatives voted to reauthorize Section 702 of the the Foreign Intelligence Surveillance Act , which “allows the government to obtain the communications of foreigners outside the United States, including foreign terrorist threats.” The act, headed now to the Senate, allows intelligence agencies like the NSA to intercept texts and emails of non-Americans abroad in the interest of national security. \nBitcoin ups and downs. This week’s rollercoaster ride: Billionaire investor Warren Buffett dissed Bitcoin. JPMorgan CEO Jamie Dimon reiterated his distaste for digital gold. Kodak got into cryptocurrency mining . South Korea warned it may crack down on cryptocurrency exchanges. North Korea appeared linked to a shady cryptocurrency mining operation. KFC hopped on the Bitcoin bandwagon. Microsoft hopped back on too. Meanwhile, a Miami Bitcoin conference hopped off the Bitcoin bandwagon. \nRipple makes waves. Ripple inked a deal with international money transferrer MoneyGram to try using XRP , Ripple’s cryptocurrency (number three by total market value). The deal represents an opportunity for Ripple to demonstrate to banks and other financial firms that its XRP tokens, designed to facilitate foreign currency exchanges, can help them save costs. Meanwhile, Ripple is counter-suing the distributed ledger technology company R3 over a $12 billion dispute related to XRP options . \nDon’t shoot the messenger. Microsoft is partnering with Signal , the encrypted messaging tech maker, to bring end-to-end encrypted chats to Skype with a snoop-thwarting feature called “private conversations.” The privacy-minded messenger Confide just added the ability to block screenshots of conversations taken on Apple iPhones . In order to comply with new data privacy laws, Apple is handing over its Chinese iCloud data center operations to a local company on February 28th. And Telegram, another private chat app, is reportedly looking to host a cryptocurrency sale . \nUm, can I get a refund on this “smart” safe ? \nShare today’s Data Sheet with a friend: \nLooking for previous Data Sheets? Click here . ACCESS GRANTED “It’s time to get rid of Social Security numbers. While a string of digits on a paper card did the job in the 1930s, and got the government’s stamp of approval for identification purposes in 1972, it’s irresponsible for those nine numbers to continue to be the universal identifier for every part of our lives. We can do better.” \n—In a commentary for Fortune, Frederic Kerrest, cofounder of digital identity manager Okta, evaluates the potential of blockchain technologies to serve as a replacement for Social Security numbers . Kerrest says blockchains offer an “interesting solution,” but he warns that they are “intricate and unwieldy.” FORTUNE RECON ", "external_links": [], "published": "2018-01-13T17:59:00.000+02:00", "crawled": "2018-01-13T23:08:19.003+02:00", "highlightTitle": ""}