{"organizations": [], "uuid": "85a95aeab06288bef204758c86008813a4b29d17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-dpw-holdings-appoints-william-b-horne-cfo-and-executive-vice-president.html", "country": "US", "domain_rank": 767, "title": "DPW Holdings Appoints William B. Horne CFO and Executive Vice President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:45:00.000+02:00", "replies_count": 0, "uuid": "85a95aeab06288bef204758c86008813a4b29d17"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-dpw-holdings-appoints-william-b-horne-cfo-and-executive-vice-president.html", "ord_in_thread": 0, "title": "DPW Holdings Appoints William B. Horne CFO and Executive Vice President", "locations": [], "entities": {"persons": [{"name": "william b. horne", "sentiment": "negative"}, {"name": "bentz", "sentiment": "none"}, {"name": "amos kohn", "sentiment": "none"}, {"name": "jeff bentz", "sentiment": "none"}, {"name": "horne", "sentiment": "none"}, {"name": "kohn", "sentiment": "none"}], "locations": [{"name": "ca.", "sentiment": "none"}, {"name": "fremont", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}], "organizations": [{"name": "dpw holdings", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "dpw holdings, inc.", "sentiment": "neutral"}, {"name": "sec", "sentiment": "none"}, {"name": "north star terminal & stevedore company", "sentiment": "none"}, {"name": "dpw", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FREMONT, CA., Jan. 26, 2018 (GLOBE NEWSWIRE) -- DPW Holdings, Inc. (NYSE American: DPW) (\" DPW \" or the \" Company \"), a diversified holding company, stated today that William B. Horne, a member of the Board of Directors, has been appointed Chief Financial Officer and Executive Vice President for DPW and all its subsidiaries. Mr. Horne will remain a member of the Board of Directors for DPW and replaces Mr. Amos Kohn who served as interim Chief Financial Officer. Mr. Kohn will remain President and a member of the Board of Directors for DPW. The Company filed a report on Form 8-K with the SEC on January 25, 2018 disclosing these changes and other information.\nThe Company was pleased to also report a few changes with its Board of Directors including the addition of its newest independent director, Mr. Jeff Bentz. Mr. Bentz is an experienced businessman who has served since 1994 as President of North Star Terminal & Stevedore Company, a full-service stevedoring company located in Alaska and whose major areas of business include terminal operations and management, stevedore services, and heavy equipment operations. He also has served as a director and advisor to several private companies and agencies. Mr. Bentz said, “I am excited to join the Board of Directors of DPW and look forward to using my many years of varying experience in operating and growing businesses for a company that has opportunities for growth while seeking improvement in its operations as it integrates newly purchased businesses as well as those yet to be acquired. Mr. Bentz replaces Kristine L. Ault who concurrently resigned from the Board of Directors and was thanked by the Company for her service and support for the past year including her leadership in having the company’s largest shareholder provide the necessary funds and other resources so the Company could maintain the standard listing requirement with its national securities exchange, the NYSE American.\n“When Philou Ventures acquired the control position of DPW and replaced the Company’s former Chairman, it became an important task and goal to retain William B. Horne as the CFO for DPW. Although it has taken some time to accomplish, Mr. Horne possesses the skill set, acumen and experience not often seen within the small cap market sector,” said Milton “Todd” Ault, III, the CEO and Chairman of DPW Holdings, Inc. Ault continued, “The Company today continues to acquire multiple subsidiaries and conducts more business than ever before, both domestically and internationally, with complex corporate issues and public financial and segment reporting required. With Mr. Horne’s extensive venture capital background and audit experience with Price Waterhouse LLP, I believe there is no better choice.”\nABOUT DPW HOLDINGS, INC.\nHeadquartered in Fremont, CA, DPW Holdings, Inc., www.DPWHoldings.com , is a diversified holding company that, through its wholly owned subsidiary, Coolisys Technologies, Inc., is dedicated to providing world-class technology-based solutions where innovation is the main driver for mission-critical applications and lifesaving services. Coolisys’ growth strategy targets core markets that are characterized by “high barriers to entry” and include specialized products and services not likely to be commoditized. Coolisys through its portfolio companies develops and manufactures cutting-edge resonant switching power topologies, specialized complex high-frequency radio frequency (RF) and microwave detector-log video amplifiers, very high-frequency filters and naval power conversion and distribution equipment. Coolisys services the defense, aerospace, medical and industrial sectors and manages four entities including Digital Power Corporation, www.DigiPwr.com , a leading manufacturer based in Northern California, 1-877-634-0982; Digital Power Limited dba Gresham Power Ltd., www.GreshamPower.com , a manufacturer based in Salisbury, UK.; Microphase Corporation, www.MicroPhase.com with its headquarters in Shelton, CT 1- 203-866-8000; and Power-Plus Technical Distributors, www.Power-Plus.com , a wholesale distributor based in Sonora, CA 1-800-963-0066. Coolisys operates the branded division, Super Crypto Power, www.SuperCryptoPower.com .\nDigital Power Lending, LLC, www.DigitalPowerLending.com , a wholly owned subsidiary of the Company, is based in Fremont, CA, and is a California private lending company dedicated to strategically providing capital to small and middle size businesses for an equity interest in addition to loan fees and interest. Super Crypto Mining, Inc. www.SuperCryptoMining.com is a wholly-owned subsidiary of the Company, is based in Fremont CA that leverages its engineering expertise and existing locations to create crypto currency mining facilities across the globe. Excelo, LLC, www.Excelo.com , a wholly-owned subsidiary of the Company, is a national search firm specializing in fulfilling strategic executive, professional and hi-tech placements for businesses delivering world-class services. DPW Holdings, Inc.’s headquarters is located at 48430 Lakeview Blvd., Fremont, California, 94538; 1-877-634-0982. For Investor inquiries: IR@DPWHoldings.com or 1-888-753-2235.\nForward-Looking Statements\nThe foregoing release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the acquisition and the ability to consummate the acquisition. These forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as “believes,” “plans,” “anticipates,” “projects,” “estimates,” “expects,” “intends,” “strategy,” “future,” “opportunity,” “may,” “will,” “should,” “could,” “potential,” or similar expressions. Statements that are not historical facts are forward-looking statements. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties. Forward-looking statements speak only as of the date they are made, and the Company undertakes no obligation to update any of them publicly in light of new information or future events. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors. More information, including potential risk factors, that could affect the Company’s business and financial results are included in the Company’s filings with the U.S. Securities and Exchange Commission, including, but not limited to, the Company’s Forms 10-K, 10-Q and 8-K. All filings are available at www.sec.gov and on the Company’s website at www.DPWHoldings.com .\n###\nSource:DPW Holdings, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=ftzwBwRfUlB_k0UdTVCstFK9l0kJ-quA0IfPRidUdk77Xi7SSmegh99IeI3TJ3XKe625I2kMjiwewyccugdtAXNsOo2DC0UA2m92oYEVhqs=", "https://www.globenewswire.com/Tracker?data=WELxLTghGqohovylEyxDtbDRFOtNHrDoItxPu6Tm8jDbCmoCIawdNBqtiENW0gagBowBo-k7Yck6jw5jNN4FnbxnipqVF0HfglYVTpsSTLA=", "https://www.globenewswire.com/Tracker?data=D4GhOnEpcSgm0ffm2jwL-m7Mb1St4Pw7AGgTVB0ft5jg9WGuKrAEHQ_XyHpSeuNnDrz21MMw3QwOLZHvZu4ZaRKtY-ZF6PU3nPJT20sbO50=", "https://www.globenewswire.com/Tracker?data=qStRFpLoeAJ6xzsXPmyx8po4QJuHODxw0TimM_WFkKg3INbs8VakbX-oH1tv07-vgf3bU77FMxfdWL3ORjKRAg==", "https://www.globenewswire.com/Tracker?data=qStRFpLoeAJ6xzsXPmyx8vEfQmMWqfykUQNkY7mWitOusr-GEaOrofkKXZouplj7V-kTiCvjwZSRPzc-nWaYm2IUno-RKCf9TOKHHUsTUM3GfmH-uNfzOYh4jTUWCetW", "https://www.globenewswire.com/Tracker?data=usWY7r7jRVtlcqO0HjyUlcE1h9OCs8zIbSC1YSv2JjHOSf6NYnbibDw_2PkPUX_VRs5ZN8tljKDoNsM-HMiV9IqAGb6EHsCvX29XdVUGMdk=", "https://www.globenewswire.com/Tracker?data=UQlyKjlXck8hMK0Glj_EX_B-BN1AyfH3BkpUdllxDqOR9io19PQr2ezi8oWWrXSprOOuKIChFvZUwiFjLsfdAQ==", "https://www.globenewswire.com/Tracker?data=ftzwBwRfUlB_k0UdTVCstE5FYNo2YI-uXzCPVWw51QDsu8vHFxR6NWy7aS-aB9tPFPc6NHcU_iSSaR3PHzaDPyuMim06Lx3EGKoEYA7n-D8=", "https://www.globenewswire.com/Tracker?data=3HC2toN57g0XcQTAn14Se6OOXlaH3S9FbssT7r8Ae5SnPqUIgQxEcP4wrQEBWV3QWJ_78gKyjPwAVvlCGHHbJw==", "https://www.globenewswire.com/Tracker?data=9OagEAvVlt-Rlyy2tfCaZRFhMG0cLt7eLwf5yRUwixu21mWH4LtBWlmM2791GYgO3NlMuqQ7_E7cVqQFHkeaByK1yTM4sPmvYm5LlYqYAAQ=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c8026e3e-8ca5-4fdd-aa76-2962f9d51ddc", "https://www.globenewswire.com/Tracker?data=WELxLTghGqohovylEyxDtaST8sNfiEpZlneX0hSmxkwyQsiKm6L3VJl2zYH5P8Eaqfh0yRRmfmehNK9lfYbA9JxItzvySLUTp5DyqyDM45s=", "https://www.globenewswire.com/Tracker?data=JiedS04iEjmTqS9Ouboap5ZTRYJqlVu-4UPp0p7-FzHGJmuT8qSs1fKG-Z2YKQ2ZPd2Zpj-503D19ih5tkp0GrWbMBlnhO6xczVrF_Cb8S8="], "published": "2018-01-26T14:45:00.000+02:00", "crawled": "2018-01-26T16:42:32.004+02:00", "highlightTitle": ""}