{"organizations": [], "uuid": "b251a23a0405b9ab55b3ff0df543e2ba93df4ec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224020687&w=1200&r=LYNXMPEE0L04A", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-markets/stocks-dollar-sag-after-u-s-government-shutdown-idINKBN1FB074", "country": "US", "domain_rank": 408, "title": "Stocks, dollar sag after U.S. government shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T04:40:00.000+02:00", "replies_count": 0, "uuid": "b251a23a0405b9ab55b3ff0df543e2ba93df4ec1"}, "author": "", "url": "https://in.reuters.com/article/global-markets/stocks-dollar-sag-after-u-s-government-shutdown-idINKBN1FB074", "ord_in_thread": 0, "title": "Stocks, dollar sag after U.S. government shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "global", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - World stocks and U.S. bond markets on Monday shrugged off a government shutdown in Washington, although the dollar pulled back as the euro continued its strong start to the year.\nU.S. Treasury yields, which fell during previous government shutdowns, rose as investors saw limited economic fallout from the standoff in the U.S. capital and instead focused on a global economy motoring ahead.\nEuropean shares traded with little clear direction as markets focused on a flurry of mergers and acquisitions and progress towards an end to political deadlock in Germany.\nThe pan-European STOXX 600 index was flat. Germany’s DAX was down 0.1 percent, France’s CAC-40 was down 0.2 percent and the UK’s FTSE was unchanged.\nThe MSCI world equity index, which tracks shares in 47 countries, was also flat. U.S. stock futures were down marginally after Wall Street set record highs on Friday.\nInvestors seem confident the conflict between President Donald Trump and Democrats can be resolved swiftly and the U.S. avoid a prolonged shutdown.\n“We’re not worried as we have been here before. Perhaps this is more fractious and may take longer to resolve, but it shouldn’t have a massive economic impact,” said Patrick O‘Donnell, investment manager at Aberdeen Asset Management.\nA plan put forward by a group of senators to extend government funding to Feb. 8 and work on resolving an immigration dispute has helped ease concerns about a more serious deadlock in Washington.\nThe benchmark U.S. 10-year Treasury yield was close to its highest level in more than three years on Monday. in an extension of the sell-off in U.S. bonds since September.\nA trader at the stock exchange reacts in Frankfurt, Germany, November 9, 2016. REUTERS/Kai Pfaffenbach/Files DOLLAR NEAR THREE-YEAR LOW The dollar remained stuck near three-year lows, continuing its weak start to the year.\nThe euro gained 0.2 percent and was trading at $1.2250, although volatility in the euro-dollar exchange rate was more muted than would have been expected, given flare-ups during previous U.S. government shutdowns.\n“The market is accustomed with what is taking place in U.S. politics. It is not reading too far into the shutdown, which is more like a political show,” said Koji Fukaya, president of FPG Securities in Tokyo.\nIn European bond markets, Spain’s borrowing costs dropped to a six-week low and the gap over its German peers fell to its tightest in almost three years after Fitch Ratings gave Spain its first “A” rating since the euro zone debt crisis.\nMost other euro zone bond yields were little changed - analysts said investors were probably moving to the sidelines before the European Central Bank’s first meeting of 2018 this Thursday.\nOil prices climbed higher after comments from Saudi Arabia that cooperation between oil producers who are withholding supplies would continue beyond 2018.\nBrent crude futures were at $68.67 a barrel at 0930 GMT, not far from the $70.37 level hit on Jan. 15. That was oil’s highest level since December 2014.\nFor Reuters Live Markets blog on European and UK stock markets, open a news window on Reuters Eikon by pressing F9 and typing “Live Markets” in the search bar.\nAdditional reporting by Dhara Ranasinghe, editing by Larry King\n ", "external_links": [], "published": "2018-01-22T04:40:00.000+02:00", "crawled": "2018-01-22T05:15:24.001+02:00", "highlightTitle": ""}