{"organizations": [], "uuid": "81c65f557014bcf81afbe4670f7308e59af27990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225389793&w=1200&r=LYNXMPEE0P08Y", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-japan-economy-output/japans-factory-output-growth-seen-accelerating-in-december-idUKKBN1FF0IK", "country": "US", "domain_rank": 408, "title": "Japan's factory output growth seen accelerating in December", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T08:29:00.000+02:00", "replies_count": 0, "uuid": "81c65f557014bcf81afbe4670f7308e59af27990"}, "author": "", "url": "https://uk.reuters.com/article/uk-japan-economy-output/japans-factory-output-growth-seen-accelerating-in-december-idUKKBN1FF0IK", "ord_in_thread": 0, "title": "Japan's factory output growth seen accelerating in December", "locations": [], "entities": {"persons": [{"name": "akihiro morishige", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "mitsubishi research institute", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 6:30 AM / Updated 7 minutes ago Japan's factory output growth seen accelerating in December Reuters Staff 2 Min Read \nTOKYO (Reuters) - Japan’s factory output likely rose for a third straight month in December thanks to solid domestic and foreign demand, a Reuters poll showed, suggesting the economy continued to perform well in the fourth quarter of last year. \nIndustrial production is expected to have risen 1.6 percent in December from the previous month, the poll of 19 economists showed, following a 0.5 percent increase in November. \n“We expect factory output will continue to recover moderately on export growth thanks to the upbeat global economy and a pickup in domestic demand due to the improvement in the labour and wage environment,” said Akihiro Morishige, senior economist at Mitsubishi Research Institute. \n“But if escalating protectionism in the United States becomes a downside risk for its economy, that would affect Japan’s production via trade.” \nThe trade ministry releases factory output data at 8:50 a.m. on Wednesday Japan time (2350 GMT Tuesday). \nThe unemployment rate likely stayed steady at 2.7 percent in December and the jobs-to-applicants ratio is seen improving to 1.57 for the month, the highest since January 1974. \nThe poll also found household spending was up 1.7 percent from a year ago, rising for a second straight month, while retail sales are expected to have increased 1.8 percent after a revised 2.1 percent in November. \n“Consumer sentiment slightly worsened at the year-end and early this year due to rising costs of fresh vegetables but it stayed at high level. And auto demand is recovering, thus consumer spending likely rose,” said Takeshi Minami, chief economist at Norinchukin Research Institute. \nThe internal affairs ministry will announce the jobs data and household spending at 8:30 a.m. on Tuesday (2330 GMT on Monday) and the trade ministry releases retails sales at 8:50 a.m. on the same day. Reporting by Kaori Kaneko; Editing by Sam Holmes", "external_links": [], "published": "2018-01-26T08:29:00.000+02:00", "crawled": "2018-01-26T08:40:39.000+02:00", "highlightTitle": ""}