{"organizations": [], "uuid": "1b8ed54efd6ba217438f26cd1229f1872d40a077", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222316539&w=1200&r=LYNXMPEE0F087", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange/indonesia-bourse-holds-minute-silence-for-injured-after-floor-collapse-idUSKBN1F50B0", "country": "US", "domain_rank": 408, "title": "Indonesia bourse holds minute silence for injured after floor collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T06:19:00.000+02:00", "replies_count": 0, "uuid": "1b8ed54efd6ba217438f26cd1229f1872d40a077"}, "author": "", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange/indonesia-bourse-holds-minute-silence-for-injured-after-floor-collapse-idUSKBN1F50B0", "ord_in_thread": 0, "title": "Indonesia bourse holds minute silence for injured after floor collapse", "locations": [], "entities": {"persons": [{"name": "samsul hidayat", "sentiment": "none"}], "locations": [{"name": "indonesia", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "indonesia stock exchange", "sentiment": "none"}, {"name": "world bank", "sentiment": "none"}, {"name": "tabita diela", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "idx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA, (Reuters) - Indonesia’s stock exchange held a minute silence at the start of trading on Tuesday for more than 70 people injured when a mezzanine floor in the building suddenly collapsed.\nNo deaths have been reported from the collapse on Monday but dozens of people, many university students visiting the Indonesia Stock Exchange (IDX), are being treated in hospitals.\nBourse officials said the rest of the building complex was operating normally.\n“Main structure wise, this building has no problem,” said Samsul Hidayat, a director at the IDX. “We have blocked the mezzanine floor.”\nThe high-rise building, constructed in the late 1990s, is part of a two-tower complex in the heart of Jakarta’s financial district and houses dozens of offices including the World Bank.\nIt was the target of a car bombing by Islamist militants in September 2000. Police have ruled out a bomb as a cause of Monday’s collapse.\nThe second tower was reopened for business on Tuesday, with the parts of the floor that were still intact propped up by makeshift columns.\nPeople gather on the trading floor during the start of trading at the Indonesia Stock Exchange building in Jakarta, Indonesia January 16, 2018. REUTERS/Beawiharta Some employees felt nervous about going to work.\n“I am so wary. I work underneath the bridge,” said Nur Septi Febriananda, a receptionist, referring to another part of the same mezzanine floor that fell.\nSlideshow (5 Images) A police forensics team was combing through the rubble for clues as to why the walkway, which overlooks the main lobby, crumpled without warning, said Jakarta police spokesman Argo Yuwono.\nJakarta governor Anies Baswedan has ordered an “audit” of the building, which was last inspected by authorities in May, 2017.\nA group of nearly 100 university students were on the mezzanine floor when it gave way, and many fell one storey to the lobby. Several students are being treated for broken bones and concussions.\nSafety standards are often loosely enforced in Indonesia. Last year, a fire that ripped through a fireworks factory on the outskirts of Jakarta killed around 50 people in one of the country’s worst industrial accidents. A police investigation found multiple safety violations.\nThe exchange was operating normally on Tuesday, with the year’s first listing going ahead as scheduled. Telecommunication construction company PT LCK Global Kedaton Tbk, debuted its shares, which jumped 50 percent in early trade.\nAdditional reporting by Kanupriya Kapoor and Fransiska Nangoy; Writing by Kanupriya Kapoor; Editing by Ed Davies and Michael Perry\n ", "external_links": [], "published": "2018-01-16T06:19:00.000+02:00", "crawled": "2018-01-16T06:26:19.020+02:00", "highlightTitle": ""}