{"organizations": [], "uuid": "b817dac18b9a43f2901f34852f371836953f9467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/25/103420404-RTX1GZSL.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15839135/device/rss/rss.html", "section_title": "Earnings", "url": "https://www.cnbc.com/2018/01/22/halliburton-posts-wider-fourth-quarter-loss-on-tax-provision.html", "country": "US", "domain_rank": 767, "title": "Halliburton posts wider fourth-quarter loss on tax provision", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:18:00.000+02:00", "replies_count": 0, "uuid": "b817dac18b9a43f2901f34852f371836953f9467"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/halliburton-posts-wider-fourth-quarter-loss-on-tax-provision.html", "ord_in_thread": 0, "title": "Halliburton posts wider fourth-quarter loss on tax provision", "locations": [], "entities": {"persons": [{"name": "jeff miller", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "halliburton", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "schlumberger", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. oilfield services company Halliburton reported a bigger-than-expected fourth-quarter profit after charges and gave an upbeat outlook for 2018, as higher oil prices continue to push U.S. production near record levels.\nHalliburton delivered an optimistic view for its U.S. and international operations as rising oil prices spur demand for oilfield services. Its results, like those of larger rival Schlumberger on Friday, point toward a broadening oil and gas recovery moving from U.S. onshore to international exploration and production markets.\n\"I am very excited about the way 2018 is shaping up,\" said Chief Executive Jeff Miller during the firm's quarterly earnings call. \"North American unconventional activity should be very busy,\" he added, referring to growth in production from U.S. shale.\nHalliburton also reported a fourth-quarter charge of $385 million for its operations in Venezuela, which has been mired in political and economic turmoil. Halliburton said it would continue to \"vigorously pursue\" payments from its primary customer in Venezuela going forward, but also said it expected continuing delays in payments.\nSchlumberger last week disclosed a $938 million write-down on its Venezuelan assets and receivables. Other oilfield services firms also have taken write-downs recently from receivables and promissory notes exchanged for debts from state-run oil company Petroleos de Venezuela.\nHalliburton's share price was up more than 3 percent at $54.64 in morning trading on the New York Stock Exchange on Monday. The company posted a profit of 53 cents a share, beating the average analyst estimate of 46 cents per share, as per Thomson Reuters I/B/E/S.\nThe company was upbeat about the health of the U.S. oil industry given the rise in oil prices and increased drilling. The U.S. rig count is up almost 35 percent from last year to 936, according to data from General Electric's Baker Hughes\n\"Commodity prices are supportive of increasing activity in North America and I am encouraged by the increase in tender activity and the positive discussions we are having with our international customers,\" Miller said in a statement.\nHalliburton, which makes more than half its revenue from North American operations, said total revenue rose to $5.9 billion for the quarter, from $4.02 billion a year earlier. Revenue in North America came in at $3.4 billion, up from $1.8 billion last year.\nThe uptick in drilling activity in the United States drove up cost for sand and trucking during the quarter, the company said on its call. Halliburton said it expected its sand costs to decline in 2018 as local mines come online.\nThe company also reported $882 million in tax charges, largely the result of preliminary tax provisions related to the new U.S. tax law that was passed last month.\nSchlumberger last week beat Wall Street forecasts and gave an upbeat outlook, predicting its international operations would grow in 2018 for the first time in four years.\nA stronger outlook for the international market follows a nearly 24 percent climb in the global Brent futures contract in the past three months.\n\"As for the international market, I'm encouraged for the first time in three years,\" said Miller.", "external_links": [], "published": "2018-01-22T15:18:00.000+02:00", "crawled": "2018-01-22T18:14:57.007+02:00", "highlightTitle": ""}