{"organizations": [], "uuid": "0e0cac2d903e848fc18d76bbbf6c18e129df0369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/01/104439338-GettyImages-675473890.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/trumps-immigration-policies-are-economic-poison-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump's immigration policies are 'economic poison'-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.144, "site_type": "news", "published": "2018-01-30T18:05:00.000+02:00", "replies_count": 0, "uuid": "0e0cac2d903e848fc18d76bbbf6c18e129df0369"}, "author": "James Boland", "url": "https://www.cnbc.com/2018/01/30/trumps-immigration-policies-are-economic-poison-commentary.html", "ord_in_thread": 0, "title": "Trump's immigration policies are 'economic poison'-commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tom perez", "sentiment": "none"}, {"name": "james boland", "sentiment": "none"}, {"name": "marvin flores", "sentiment": "none"}, {"name": "marvin", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "daca", "sentiment": "none"}, {"name": "min ago cnbc.com getty images protesters", "sentiment": "none"}, {"name": "customs enforcement", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As two American citizens – one an immigrant, the other a child of immigrants – who have dedicated our careers to fighting for American workers, we believe President Trump's immigration policies aren't just morally wrong, they're economic poison.\nTake, for example, the story of Marvin Flores. Marvin is a bricklayer who has lived and worked in the United States legally for nearly 20 years. He has three children, all U.S. citizens by birth who don't speak Spanish, the language of his native country, El Salvador. He has a mortgage here and pays taxes, including Social Security taxes, even though he is ineligible to collect those benefits. And he's a union organizer, fighting for better wages and benefits for his brothers and sisters in labor.\nMarvin is also one of over 300,000 migrants from ten countries living in the United States under Temporary Protected Status (TPS).\nSo when Trump began announcing the end of TPS, first for the thousands of Nicaraguans and tens of thousands of Haitians who gained protected status after natural disasters devastated their countries—and most recently for 200,000 Salvadorans—it was more than cruel. He also lit the fuse for an economic catastrophe.\nWhen you add the uncertainty created by Republicans over the DREAM Act, which would protect Dreamers from deportation, the problem gets considerably worse. More than 97 percent of DACA recipients are in school or in the workforce.\nOur construction industry will be especially hard hit. The National Immigration Forum estimates that 23 percent of male TPS holders work in construction , as do about ten percent of DACA recipients . By telling these workers they have to leave the country, Trump is single-handedly threatening 100,000 American construction jobs . These are highly skilled craft-workers, often with decades of training and experience.\nOur construction industry is already in the midst of a labor shortage . Companies can't afford to lose skilled workers. So Trump's policies aren't just inhumane, they're also economically unsound.\nAnd the economic havoc of ending DACA and TPS only gets worse as you consider all the other sectors in which these immigrant families work, such as foodservices, landscaping, transportation, retail, and health services.\nAnd then there's the sheer cost of deportation.\nA report from the Immigrant Legal Resource Center found that deporting all Salvadoran, Honduran and Haitian TPS holders would cost taxpayers $3.1 billion, result in a $6.9 billion reduction to Social Security and Medicare contributions, and lead to a $45.2 billion reduction in GDP over a decade. The CATO Institute – a conservative think tank – estimates that ending DACA would cost our economy another $200 billion.\nIf Republicans follow Trump down this path, they're making a grave mistake. With the uncertain future of DACA and the systematic dismantling of TPS, Trump is both destabilizing the American labor market and exacerbating the humanitarian crises that TPS was intended to mitigate.\nDemocrats are committed to protecting these workers and their families. There's no reason why our lawmakers can't come together to oppose Trump's heartless and misguided policies and find a solution that fixes our broken immigration system. We can do it without hurting our economy and the families who strengthen it every day.\nCommentary by James Boland and Tom Perez. Boland is president of the International Union of Bricklayers & Allied Craftworkers. He immigrated to the U.S. from Ireland in 1970. Perez is chair of the Democratic National Committee (DNC) and served as Secretary of Labor under President Barack Obama. His parents immigrated to the U.S. from the Dominican Republic.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-30T18:05:00.000+02:00", "crawled": "2018-01-30T18:06:54.010+02:00", "highlightTitle": ""}