{"organizations": [], "uuid": "e443cbb82366dd42e5f1fffac43120a7ecd0d7be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-france/syrian-government-defends-idlib-campaign-condemns-france-idUKKBN1F0124", "country": "US", "domain_rank": 408, "title": "Syrian government defends Idlib campaign, condemns France", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:54:00.000+02:00", "replies_count": 0, "uuid": "e443cbb82366dd42e5f1fffac43120a7ecd0d7be"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-france/syrian-government-defends-idlib-campaign-condemns-france-idUKKBN1F0124", "ord_in_thread": 0, "title": "Syrian government defends Idlib campaign, condemns France", "locations": [], "entities": {"persons": [{"name": "idlib", "sentiment": "negative"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "ns france reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:58 AM / Updated 42 minutes ago Syrian government defends Idlib campaign, condemns France Reuters Staff 3 Min Read \nBEIRUT (Reuters) - The Syrian government hit back on Thursday against French criticism of its military campaign in rebel-held Idlib, saying it was targeting terrorist groups that were not party to an agreement to reduce fighting in the rebel-held region. \nFrance said on Wednesday it was extremely concerned by the government offensive in Idlib, the biggest remaining chunk of Syria still held by anti-government rebels, and demanded that commitments made to reduce hostilities there be respected. \nTurkey, which borders Idlib, has also called on Russia and Iran to put pressure on Damascus to halt the offensive in a corner of Syria whose population has been swollen by Syrians fleeing government offensives elsewhere. \nSyrian state media, citing a foreign ministry source, said the French foreign ministry had shown “great ignorance about what was happening in rural Idlib province”, which it said the army was fighting to “liberate from the terrorism of the Nusra Front and the other terrorist organisations that belong to it”. \nThe statement also denied the army had targeted civilians or hospitals, as alleged by France. \nTurkey has accused the Syrian government of using the presence of the Nusra Front, which now fights under the banner of the Tahrir al-Sham alliance, as an excuse to attack civilians and moderate opposition groups. \nSyrian government forces backed by allied militia are targeting an air base in southeastern Idlib province. \nHumanitarian aid organisations, rescuers and activists allege the Syrian and Russian air forces strike hospitals, schools and market places in congested residential areas in rebel-held towns. \nBoth the Syrian army and Moscow deny hitting civilian areas and say intensive raids only strike at militants. \nEarlier this month, jets bombed a maternity hospital in the city of Maarat al Numan in Idlib province, a major hospital serving thousands of people, killing five people including a newborn baby and injuring scores, according to the Syrian American Medical Society (SAMS) and other relief groups. Writing by Tom Perry; Editing by Catherine Evans", "external_links": [], "published": "2018-01-11T11:54:00.000+02:00", "crawled": "2018-01-11T12:36:37.049+02:00", "highlightTitle": ""}