{"organizations": [], "uuid": "d7e0ca1f6b41947782d3a05c9edc5a133d12a97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GC805_cat_01_ZG_20180131144549.jpg", "site_section": "http://www.marketwatch.com/rss/internet", "section_title": "MarketWatch.com - Internet Industry News", "url": "https://www.wsj.com/articles/yes-you-can-train-your-cat-1471016655", "country": "US", "domain_rank": 387, "title": "The latest scourge of progressive neighborhoods: Your pet cat", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T22:10:00.000+02:00", "replies_count": 0, "uuid": "d7e0ca1f6b41947782d3a05c9edc5a133d12a97f"}, "author": "", "url": "https://www.wsj.com/articles/yes-you-can-train-your-cat-1471016655", "ord_in_thread": 0, "title": "The latest scourge of progressive neighborhoods: Your pet cat", "locations": [], "entities": {"persons": [{"name": "hwanseok song", "sentiment": "none"}], "locations": [], "organizations": [{"name": "getty images domestic", "sentiment": "none"}, {"name": "cornell university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 31, 2018 3:10 p.m. ET Share \nThe issue of indoor versus outdoor cats is contentious, especially among bird lovers Getty Images Domestic cats kill millions of birds each year. \nBy Reporter \nYour fluffy friend may be wreaking havoc on your local ecosystem. \nA new report from Cornell University showed many people in the sustainability world think outdoor cats are incompatible with a conservation-friendly mindset. The researchers created two identical profiles of a “green” property with a small lawn, low pesticide usage and solar panels. One version had an icon indicating an indoor cat and the other had one with an outdoor cat. The researchers found that participants who didn’t own cats negatively judged property owners with an outdoor cat and considered them less likely to engage in environmentally-friendly behavior. \n“It usually takes a strong environmental commitment to install a solar panel,” said Hwanseok Song, a fifth-year doctoral student in communication at Cornell University and the paper’s lead author. “These findings say a lot about how we make judgments of others who are either violating or complying with these sometimes-parochial norms.” \nThe Cornell researchers concluded that the biggest investment of your life — your home — can turn sour over the most seemingly inconsequential issues. “This study is a reminder of how easy it can be to jump to conclusions about other people’s behaviors on the basis of very little information,” said Poppy McLeod, professor of communication, who co-authored the paper. \nAlso see: Yard dispute or political revenge? Rand Paul’s assault by a neighbor is a cautionary tale \nMore than 36 million American households take care of 74 million pet cats, according to the American Veterinary Medical Association. “By nature, cats are hunters,” John Bradshaw and Sarah Ellis wrote in The Wall Street Journal in 2016. “ They still feel the urge to prowl because (unlike dogs) they have a host of nutritional needs that can be satisfied only by eating flesh—regularly.” \nAs a result, there’s something of a cottage industry in keeping pet cats from turning into killers. A Cat Bib, which can come with a tie design or a necklace, costs between $12 and $15. A “Birdsbesafe” collar, $10, alerts birds to the cat with a bell and makes it so the cat catches 87% fewer birds. Add that to the $1,545 per year it costs to keep a cat, according to research from vet clinic VIP Petcare. \nBut not everyone believes this is a local not-in-my-backyard issue. Cats are one of the largest sources of bird mortality in the U.S., said Nicolas Gonzalez, spokesman for the National Audubon Society. In Australia, cats have driven a number of species to near extinction. Other major threats to birds globally include climate change, habitat loss, and pollution. “We encourage people to keep their cats indoors which is not only safer for birds but also safer for cats themselves — it’s kind of win-win situation,” Gonzalez said. \nSee also: U.S. pets are responsible for 30% of the environmental impact of meat eating \nThe study is just the latest to measure the effects of cats on birds in the environment, a divisive issue for animal lovers as domestic cats are said to kill 1.4 billion to 3.7 billion birds worldwide each year. \n“No one who cares about animals or the environment should allow cats to roam freely outdoors, where they annually kill billions of native birds, bunnies, chipmunks and other local animals who aren’t equipped to defend themselves against these non-native predators,” PETA Senior Vice President Lisa Lange told MarketWatch. \nIndeed, indoor cats can live more than four times as long as outdoor cats, with the average lifespan of an indoor cat ranging from 12 to 20 years and an outdoor cat from 1 to 5 years. Cats who go outdoors can themselves fall prey to deadly diseases, traffic, and injuries from falls. Elsewhere on MarketWatch", "external_links": [], "published": "2018-01-31T22:10:00.000+02:00", "crawled": "2018-01-31T22:17:00.000+02:00", "highlightTitle": ""}