{"organizations": [], "uuid": "7953af107f5634163ca92c7f0fbfb8263c61f9a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-european-shares-to-rise-after-asian-stocks-hit-10-year-peak-idUSL8N1OZ0HY", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-European shares to rise after Asian stocks hit 10-year peak", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T08:34:00.000+02:00", "replies_count": 0, "uuid": "7953af107f5634163ca92c7f0fbfb8263c61f9a0"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-european-shares-to-rise-after-asian-stocks-hit-10-year-peak-idUSL8N1OZ0HY", "ord_in_thread": 0, "title": "LIVE MARKETS-European shares to rise after Asian stocks hit 10-year peak", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European stocks rise, FTSE touches record * Euro zone services PMIs show growth near best in 7 years * Heavily-shorted Debenhams sinks after profit warning * Autos cruise to two-month peak Jan 4 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Helen Reid. Reach her on Messenger to share your thoughts on market moves: helen.reid.thomsonreuters.com@reuters.net THOUGHT OF THE DAY: IF 2017 WERE A FUND, IT'D BE IN TROUBLE (1316 GMT) From SocGen's Andrew Lapthorne's research piece \"The year-end numbers from the year volatility died\": \"Not only did global equity markets perform well during 2017 (MSCI World delivered a total return of 20.1%), but they did so with such low volatility and consistency that if this were a fund, it would perhaps merit a visit from the authorities to check exactly what you were up to!\" (Julien Ponthus) DON'T WORRY ABOUT THE FLAT U.S. YIELD CURVE (1240 GMT) \"U.S. recessions have usually occurred after the yield curve has been as flat as it is now, but the lags have typically been long and variable, suggesting that it would be unwise to expect a U.S. recession soon\", says Oxford Economics' Ben May. Here's his chart showing we may yet have time ahead of us before a recession given the limited time the U.S. 10-year yield has been less than 50bp higher than the two-year yield: (Julien Ponthus) MIDDAY UPDATE: EURO ZONE STOCKS SHOOT TO 2-WEEK HIGH (1230 GMT) It looks like the optimism spurred by the PMIs is giving Euro zone indexes a kick higher, with Euro stoxx up more than 1 percent at a 2-week high, and Euro zone blue chips at their highest in a week. Unsurprisingly, it's the cyclical sectors which continue to dominate: construction stocks, autos, banks and big oil. Here's your midday snapshot: (Kit Rees) YES TO CYCLICAL EXPOSURE, BUT EUROPEAN BANKS NOT A SIMPLE 'BUY' (1212 GMT) As the PMIs showed, the economic backdrop in Europe is strong and, along with other factors, suggests that now is the time to get some cyclical exposure, says UBS. European banks could be a candidate, given that they look cheap relative to the market. But UBS argues it's not as straightforward as that. \"Top down arguments around European macro recovery and rising rates are persuasive but look played out we think in (banking) stocks most geared to these trends,\" UBS analysts wrote in a note. \"If equity markets don't go higher, owning cheaper stocks will have been the righ call,\" UBS adds. (Kit Rees) LOOKING FOR AN EXCUSE TO CORRECT? (1115 GMT) A December survey of 54 institutional investors conducted by Managing Partners Group showed that slightly over 7 out of 10 expect a global equity correction of over 10 percent within 18 months. \"Equities are looking highly valued on both sides of the Atlantic and it looks as though the market is just looking for an excuse to correct\", Jeremy Leach, CEO of the investment house commented in the press release presenting the study. That being said, IG's Chris Beauchamp noted in his morning comments that investors were quick to buy the dip which emerged during Europe's first trading days: \"Dip buyers clearly know an opportunity when they see one, and with weakness so widespread across the continent's markets there was an opportunity to pick up some bargains, which at least makes a nice change from chasing the bull run on Wall Street\". (Julien Ponthus) EUROBOOM! (déjà vu) (1048 GMT) The strong PMI data realeased this morning seems to confirm that the \"Euroboom\" trade is here to stay in 2018. \"We continue to believe that the outlook for European equities is positive, aided by the potential for close to ten percent earnings growth in 2018\", JPMorgan AM's Mike Bell commented. That's in sharp contrast to the likes of SocGen who don't see much \"meat on the bone\" for the old continent's stocks. Actually, thinking about it, the first trading days of the year are starting with a \"déjà vu\" feeling with regard to the dynamics of the bulls : global synchronised growth anyone? To read how the Euro zone economy's posted its best growth in seven years click And here's a celebratory kiss: (Julien Ponthus) PAY DAY FOR DEBENHAMS SHORTS (1013 GMT) Yesterday's rise in Next and other retailers sure tested the conviction of investors who have shorted the likes of Debenhams for months in the hope of a downfall. With its profit warning triggering a fall of over 16 percent today to its worst price since the peak of the 2008 financial crisis, Debenhams, which is the second most-shorted stock on the FTSE, is delivering for speculators. Note that brokers such as Investec think things could still get worse, with the latter cutting its target price to 28 pence, below its already depressed level of 29.88 pence. According to Reuters calculations, Debenhams’ share price fall netted profits of around 12 million pounds on Thursday for hedge funds which have short positions totalling 14.3 percent of the company's stock. You can see how much Debenhams has fallen here: (Julien Ponthus and Alasdair Pal) EUROPEAN AUTOS CRUISE TO TWO-MONTH PEAK (0930 GMT) The European autos sector has had a strong start to the year, up 1.2 percent this morning at a two-month peak. Today's move is being driven by yesterday's U.S. auto sales data for December. While not stellar, the figures did beat analyst expectations, with the likes of Fiat Chrysler up around 4.1 percent at a record high today. While the autos sector had a tepid first half in 2017, things have really started to pick up over the last six months. Fiat, Porsche and Volkswagen are among the biggest gainers over that period. (Kit Rees) OPENING SNAPSHOT: EUROPEAN SHARES CLIMB, FTSE HITS FRESH RECORD HIGH (0815 GMT) It's a positive start to the trading session for European equities, with almost all sectors higher. Cyclical sectors, such a financials and commodities, are adding the most to gains, and in turn have pushed Britain's FTSE 100 to a new high. Away from the STOXX 600, Debenhams is down 20 percent. Here's your opening snapshot: (Kit Rees) PRE-OPEN ROUNDUP: WHAT'S ON THE RADAR (0746 GMT) Futures are pointing to a stronger open for European stocks on Thursday after investors’ rising risk appetite drove Asian shares to a 10-year peak and oil prices surged further. Germany’s exporter-heavy DAX is likely to benefit from the U.S. dollar’s recovery and continued strength in cyclicals, and services PMIs today which SocGen analysts forecast will confirm the region’s sustained growth. One stock to watch will be UK department store Debenhams, indicated down 25 percent after a profit warning – in stark contrast to Wednesday’s strong update from Next, this will come as a blow to the British retail sector and likely hobble the previous session’s rally. In other company news and potential stock movers: Novartis' Promacta receives FDA breakthrough designation for new indication; British retailer Debenhams warns on profit after disappointing trading; Saga restructures travel business after cutting profit forecasts; Aldi UK's December sal", "external_links": [], "published": "2018-01-04T08:34:00.000+02:00", "crawled": "2018-01-04T08:52:48.001+02:00", "highlightTitle": ""}