{"organizations": [], "uuid": "c9b60dddbb47ac30d000193a45528adea1fb41cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224869709&w=1200&r=LYNXMPEE0N1Q8", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-trade-nafta/canada-to-unveil-proposals-to-head-off-nafta-clash-over-autos-idUSKBN1FD2EV", "country": "US", "domain_rank": 408, "title": "Canada to unveil ideas to head off NAFTA impasse over autos", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:00:00.000+02:00", "replies_count": 0, "uuid": "c9b60dddbb47ac30d000193a45528adea1fb41cb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-trade-nafta/canada-to-unveil-proposals-to-head-off-nafta-clash-over-autos-idUSKBN1FD2EV", "ord_in_thread": 0, "title": "Canada to unveil ideas to head off NAFTA impasse over autos", "locations": [], "entities": {"persons": [{"name": "steve verheul", "sentiment": "none"}], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 5:00 PM / in 16 minutes Canada unveils ideas to save NAFTA, Trudeau lobbies U.S. firms David Ljunggren , Anthony Esposito 5 Min Read \nMONTREAL (Reuters) - Canadian negotiators at the NAFTA talks on Wednesday unveiled ideas to address contentious American demands for revamping the 1994 pact while Prime Minister Justin Trudeau urged top U.S. executives to back free trade. \nThe sixth and penultimate round of negotiations to update the North American Free Trade Agreement (NAFTA) opened in Montreal on Tuesday with time running out for Canada and Mexico to settle big differences with the United States. \nWith financial markets skittish about the possible collapse of a $1.2 trillion global trading bloc, Canada and Mexico say they are prepared to be flexible on U.S. proposals they had initially rejected as unworkable. \nOne thorny issue is Washington’s demand for a sunset clause that would kill NAFTA if it is not renegotiated after five years, an idea critics say would slash business investment. \nCanada’s chief negotiator Steve Verheul told Reuters he had “a constructive conversation” with his U.S. counterpart on Wednesday after presenting Canada’s suggested amendments to the sunset clause. He did not give details. \nA source close to the talks said Canada’s approach mirrored Mexico’s proposal last year for a semi-regular review of the treaty that would not lead to its termination. \nVerheul said he would unveil ideas on how to meet a U.S. demand for higher North American auto content later in the day. \nUnder NAFTA, at least 62.5 percent of the net cost of a passenger car or light truck must originate in the United States, Canada or Mexico to avoid tariffs. U.S. President Donald Trump’s administration wants the threshold raised to 85 percent. \nTrump has described NAFTA as disastrous for the U.S. economy and threatened to pull out of the pact, though on Tuesday he said the talks in Montreal were going well. \nCanada is floating the idea that North American content in autos would be higher if the value of software and other high-tech equipment made on the continent were taken into account, said three well-placed sources, who declined to be identified given the sensitivity of the situation. \nExisting NAFTA regulations for tracing auto parts in a vehicle do not take into account new software-based content produced in Canada and the United States and the fact vehicles are much more technically advanced than they were in 1994. FILE PHOTO: Flags are pictured during the fifth round of NAFTA talks involving the United States, Mexico and Canada, in Mexico City, Mexico, November 19, 2017. REUTERS/Edgard Garrido/File Photo \n“Why don’t we rewrite the NAFTA rules to say ‘Instead of focusing on a number, focus on what the car is going to look like five, 10, 15 years from now’?” Flavio Volpe, president of Canada’s Automotive Parts Manufacturers Association, told reporters. \nCanada and Mexico have made clear from the start they would reject the demand for 50 percent U.S. content in autos on the grounds that it would not work. GENERATE TRACTION \nNAFTA’s future is one of the main challenges for Trudeau, who met executives from companies such as Dow Chemical Co, Blackrock, Cargill Ltd and United Parcel Service Inc at the World Economic Forum in Davos. \nTrudeau said the meeting discussed how to ensure Canadians and Americans understood “the trade back and forth between Canada and the U.S. and Mexico has been tremendously beneficial.” \nVerheul said on Tuesday he did not see much sense in making a formal counter-proposal on autos. \nHis remarks indicated negotiators could struggle to meet the end-of-March deadline for concluding the talks, since Canada’s more relaxed approach would leave precious little time for a formal discussion once it outlined its stance. \nWhether the process has any chance of wrapping up by that deadline is unclear. Negotiators do not want the talks to clash with the Mexican general elections in July. \nU.S. Commerce Secretary Wilbur Ross on Wednesday said “there’s a good chance” the talks would be successful. \nThe Trump administration, however, has sent out so many conflicting messages about NAFTA that Canadian officials say they are taking nothing for granted. \nOntario Farmer magazine on Tuesday quoted Verheul as telling dairy industry officials last week that settling NAFTA in the short term was “probably the least likely” outcome. A spokeswoman at the Dairy Farmers of Canada confirmed Verheul had been accurately quoted. Writing by David Ljunggren; Editing by Paul Simao and Susan Thomas", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T01:00:00.000+02:00", "crawled": "2018-01-24T21:19:23.000+02:00", "highlightTitle": ""}