{"organizations": [], "uuid": "4b7723b9e13be23a58ab3933ba68dd285269ac18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-turnkey-capital-inc-signs-agreement-with-palm-beach-integrative-medicine-leases-medical-facility-and-opens-its-first.html", "country": "US", "domain_rank": 767, "title": "Turnkey Capital Inc. Signs Agreement with Palm Beach Integrative Medicine, Leases Medical Facility and Opens its First Practice that Blends Integrative and Functional Medicine with Medical Cannabis Certification Support and Care", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "4b7723b9e13be23a58ab3933ba68dd285269ac18"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-turnkey-capital-inc-signs-agreement-with-palm-beach-integrative-medicine-leases-medical-facility-and-opens-its-first.html", "ord_in_thread": 0, "title": "Turnkey Capital Inc. Signs Agreement with Palm Beach Integrative Medicine, Leases Medical Facility and Opens its First Practice that Blends Integrative and Functional Medicine with Medical Cannabis Certification Support and Care", "locations": [], "entities": {"persons": [{"name": "deluca", "sentiment": "none"}, {"name": "john deluca", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "fort lauderdale", "sentiment": "none"}, {"name": "hyperbar", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}], "organizations": [{"name": "turnkey capital inc.", "sentiment": "neutral"}, {"name": "palm beach integrative medicine", "sentiment": "neutral"}, {"name": "leases medical facility", "sentiment": "neutral"}, {"name": "turnkey capital inc", "sentiment": "neutral"}, {"name": "national board of chiropractic examiners", "sentiment": "none"}, {"name": "integrative medicine", "sentiment": "none"}, {"name": "internal medicine", "sentiment": "none"}, {"name": "tkci", "sentiment": "none"}, {"name": "sports medicine rehabilitation & exercise", "sentiment": "none"}, {"name": "american board of internal medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ft Lauderdale, FL , Jan. 19, 2018 (GLOBE NEWSWIRE) -- Turnkey Capital Inc. (TKCI), today announced it has signed an agreement to acquire Palm Beach Integrative Medicine and has opened its first Integrative and Functional Medicine facility in Fort Lauderdale, FL. Integrative Medicine combines the best of traditional Western medicine with the best of Alternative/Eastern medicine, emphasizing the whole person, considering and treating all aspects of lifestyle. The clinic specializes in Age Management Medicine, Detoxification and Nutrition, Weight Loss, Sports Medicine Rehabilitation & Exercise, IV nutritional therapy, Internal Medicine and medical cannabis certification support and care.\nPalm Beach Integrative Medicine’s former Medical Director, Dr. John DeLuca, MD, DC, has been appointed Chief Medical Officer of TKCI’s Integrative and Functional Medicine facility, and will oversee the operations of the clinic. Dr. DeLuca is a Medical Doctor, Diplomate of the American Board of Internal Medicine and the National Board of Chiropractic Examiners, and has obtained certifications in Hyperbaric Medicine, Pain Management, Nutrition, Strength and Conditioning, and Manipulation Under Anesthesia. He is a member of the Age Management Medicine Group, the Institute of Functional Medicine, the American College for the Advancement of Medicine, the American College of Physicians, and the American College of Sports Medicine.\nDr. DeLuca is also a Chiropractic Physician, board certified in the areas of Pain Management, Chiropractic Sports Care, and Clinical Nutrition. Dr. DeLuca is a graduate of the Acupuncture For Physicians program from UCLA.\nTurnkey Capital CEO, Neil Swartz, stated, “Our research has shown that the integration of medical cannabis into an integrative and functional medicine treatment program has proven to be remarkably successful in addressing patient needs and eroding the negative stigmas that surround cannabis. Dr. DeLuca’s combined experience as a medical doctor and an integrative medicine physician provides the exact combination of expertise required to direct this medical center.”\n“It is our goal to build a successful and repeatable Integrative and Functional Medicine medical facility and health system model that is distinguished by the ability to combine alternative practices into a patient-centered and data-driven approach that promotes optimal wellness and delivers comprehensive treatment options to our patient community,” added Swartz.\nAbout Turnkey Capital Inc.\nTurnkey Capital Inc. (TKCI) is a business advisory company that aligns with, and builds value in, both private, public, and development-stage companies. TKCI plays an active role in developing the strategic direction of our client companies which include: defining short and long-term strategic goals; identifying and planning for the critical success factors to reach these goals; identifying and addressing the challenges and operational improvements required to achieve the critical success factors and, ultimately, the strategic goals.\nSafe Harbor Statement\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements are based on current plans and expectations of management and are subject to a number of uncertainties and risks that could significantly affect the Company's current plans and expectations, as well as future results of operations and financial condition. Specifically, the Company's ability to raise additional capital, execute its business plan and strategy, sustain or increase gross margins, achieve profitability and build shareholder value are forward looking statements. A more extensive listing of risks and factors that may affect the Company's business prospects and cause actual results to differ materially from those described in the forward-looking statements can be found in the reports and other documents filed by the Company with the Securities and Exchange Commission. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nContact: Sharon Ford VP of Operations Turnkey Capital Inc. 954-440-4678\nSource:TurnKey Capital Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1d305a59-3e02-4f70-9a9a-55884d63411a"], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T18:21:16.019+02:00", "highlightTitle": ""}