{"organizations": [], "uuid": "b7c6332517a10dc9f70f35373a1c9e32a4d630f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sanmina-reports-first-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Sanmina Reports First Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:05:00.000+02:00", "replies_count": 0, "uuid": "b7c6332517a10dc9f70f35373a1c9e32a4d630f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sanmina-reports-first-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Sanmina Reports First Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "sanmina corporation", "sentiment": "negative"}, {"name": "sanmina", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 29, 2018 /PRNewswire/ -- Sanmina Corporation (\"Sanmina\" or the \"Company\") (NASDAQ: SANM), a leading integrated manufacturing solutions company, today reported financial results for the first fiscal quarter ended December 30, 2017.\nFirst Quarter Fiscal 2018 Summary\nRevenue of $1.74 billion GAAP operating margin of 0.8 percent GAAP loss per share of $2.16 Non-GAAP (1) operating margin of 2.7 percent Non-GAAP (1) diluted earnings per share of $0.48\nRevenue for the first quarter was $1.74 billion, compared to $1.76 billion in the prior quarter and $1.72 billion for the same period of fiscal 2017.\nGAAP operating income in the first quarter was $13.8 million or 0.8 percent of revenue, compared to $58.7 million or 3.4 percent of revenue for the first quarter fiscal 2017. GAAP net loss in the first quarter was $154.9 million, compared to GAAP net income of $44.9 million for the same period a year ago. GAAP loss per share was $2.16, compared to GAAP diluted earnings per share of $0.58 in the first quarter of fiscal 2017. (The first quarter of 2018 GAAP loss per share includes a non-cash tax charge of $2.27 per share as a result of the U.S. Tax Cuts & Jobs Act)\nNon-GAAP operating income in the first quarter was $47.5 million or 2.7 percent of revenue, compared to $71.7 million or 4.2 percent of revenue in the first quarter fiscal 2017. Non-GAAP net income in the first quarter was $36.5 million, compared to $57.7 million in the same period a year ago. Non-GAAP diluted earnings per share for the quarter was $0.48, compared to $0.75 for the same period a year ago.\n\"As I mentioned in our preliminary announcement last week, we are disappointed with our actual results for the first quarter and expectations for the first half of fiscal 2018,\" stated Bob Eulau, Chief Executive Officer of Sanmina Corporation. \"Based on new programs moving to volume production, a solid pipeline of new business and the current forecasts from our customers we are confident the second half of fiscal 2018 will be stronger.\"\n\"I am excited about the opportunities ahead and the unique value Sanmina brings to its customers. We have a dedicated and experienced team that is focused on operational excellence, driving improvements and optimizing our cost structure as we continue to execute on our strategy,\" concluded Eulau.\nBalance Sheet Summary\nEnding cash and cash equivalents were $404.9 million Cash flow from operations was $8.4 million Inventory turns were 6.1x Cash cycle days were 46.1 days\nSecond Quarter Fiscal 2018 Outlook\nThe following forecast is for the second fiscal quarter ending March 31, 2018. These statements are forward-looking and actual results may differ materially.\nRevenue between $1.60 billion to $1.70 billion GAAP diluted earnings per share between $0.20 to $0.30, including stock-based compensation expense of $0.17 and amortization of intangible assets and restructuring costs of $0.03 Non-GAAP diluted earnings per share between $0.40 to $0.50\nCompany Conference Call Information\nSanmina will hold a conference call to review its financial results for the first quarter on Monday, January 29, 2018 at 5:00 p.m. ET (2:00 p.m. PT). The access numbers are: domestic 877-273-6760 and international 706-634-6605. The conference will also be webcast live over the Internet. You can log on to the live webcast at www.sanmina.com . Additional information in the form of a slide presentation is available on Sanmina's website at www.sanmina.com . A replay of the conference call will be available for 48-hours. The access numbers are: domestic 855-859-2056 and international 404-537-3406, access code is 5278659.\n(1) In the commentary set forth above and/or in the financial statements included in this earnings release, we present the following non-GAAP financial measures: operating income, operating margin, net income and diluted earnings per share. In computing each of these non-GAAP financial measures, we exclude charges or gains relating to: stock-based compensation expenses, restructuring costs (including employee severance and benefits costs and charges related to excess facilities and assets), acquisition and integration costs (consisting of costs associated with the acquisition and integration of acquired businesses into our operations), impairment charges for goodwill and other assets, amortization expense and charges associated with distressed customers, litigation settlements, gains and losses on sales of assets and redemptions of debt, deferred tax and discrete tax items to the extent material in the applicable period. See Schedule 1 below for more information regarding our use of non-GAAP financial measures, including the economic substance behind each exclusion, the manner in which management uses non-GAAP measures to conduct and evaluate the business, the material limitations associated with using such measures and the manner in which management compensates for such limitations. A reconciliation of the non-GAAP results contained in this release to their most directly comparable GAAP measures is included in the financial statements contained in this release.\nAbout Sanmina\nSanmina Corporation is a leading integrated manufacturing solutions provider serving the fastest growing segments of the global Electronics Manufacturing Services (EMS) market. Recognized as a technology leader, Sanmina provides end-to-end manufacturing solutions, delivering superior quality and support to Original Equipment Manufacturers (OEMs) primarily in the communications networks, storage, industrial, defense, medical, energy and industries that include embedded computing technologies such as point of sale devices, casino gaming and automotive. Sanmina has facilities strategically located in key regions throughout the world. More information about the Company is available at www.sanmina.com .\nSanmina Safe Harbor Statement\nCertain statements contained in this press release, including the Company's outlook for the second quarter of fiscal 2018 and expectations for the second half of fiscal 2018, constitute forward-looking statements within the meaning of the safe harbor provisions of Section 21E of the Securities Exchange Act of 1934. Actual results could differ materially from those projected in these statements as a result of a number of factors, including adverse changes to the key markets we target; risks arising from our international operations; competition that could cause us to lose sales; consolidation among our customers and suppliers that could adversely affect our business; and the other factors set forth in the Company's annual and quarterly reports filed with the Securities Exchange Commission (\"SEC\").\nThe Company is under no obligation to (and expressly disclaims any such obligation to) update or alter any of the forward-looking statements made in this earnings release, the conference call or the Investor Relations section of our website whether as a result of new information, future events or otherwise, unless otherwise required by law.\nSanmina Corporation\nCondensed Consolidated Balance Sheets\n(in thousands)\n(GAAP)\nDecember 30,\nSeptember 30,\n2017\n2017\n(Unaudited)\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 404,914\n$ 406,661\nAccounts receivable, net\n1,121,800\n1,110,334\nInventories\n1,079,638\n1,051,669\nPrepaid expenses and other current assets\n46,345\n47,586\nTotal current assets\n2,652,697\n2,616,250\nProperty, plant and equipment, net\n635,000\n640,275\nDeferred tax assets\n356,660\n476,554\nOther\n114,223\n114,284\nTotal assets\n$ 3,758,580\n$ 3,847,363\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$ 1,260,432\n$ 1,280,106\nAccrued liabilities\n121,001\n116,582\nAccrued payroll and related benefits\n111,806\n130,939\nShort-term debt\n169,416\n88,416\nTotal current liabilities\n1,662,655\n1,616,043\nLong-term liabilities:\nLong-term debt\n392,195\n391,447\nOther\n202,142\n192,189\nTotal long-term liabilities\n594,337\n583,636\nStockholders' equity\n1,501,588\n1,647,684\nTotal liabilities and stockholders' equity\n$ 3,758,580\n$ 3,847,363\nSanmina Corporation\nCondensed Consolidated Statements of Income\n(in thousands, except per share amounts)\n(GAAP)\n(Unaudited)\nThree Months Ended\nDec. 30,\nDec. 31,\n2017\n2016\nNet sales\n$ 1,744,800\n$ 1,719,977\nCost of sales\n1,635,334\n1,587,815\nGross profit\n109,466\n132,162\nOperating expenses:\nSelling, general and administrative\n63,603\n65,140\nResearch and development\n7,615\n8,171\nAmortization of intangible assets\n918\n918\nRestructuring costs\n23,542\n728\nGain on sales of long-lived assets\n-\n(1,451)\nTotal operating expenses\n95,678\n73,506\nOperating income\n13,788\n58,656\nInterest income\n285\n201\nInterest expense\n(6,214)\n(5,267)\nOther income, net\n3,230\n1,257\nInterest and other, net\n(2,699)\n(3,809)\nIncome before income taxes\n11,089\n54,847\nProvision for income taxes\n165,999\n9,983\nNet income (loss)\n$ (154,910)\n$ 44,864\nBasic income per share\n$ (2.16)\n$ 0.61\nDiluted income per share\n$ (2.16)\n$ 0.58\nWeighted-average shares used in computing\nper share amounts:\nBasic\n71,605\n73,554\nDiluted\n71,605\n77,175\nSanmina Corporation\nReconciliation of GAAP to Non-GAAP Measures\n(in thousands, except per share amounts)\n(Unaudited)\nThree Months Ended\nDec. 30,\nDec. 31,\n2017\n2016\nGAAP Operating Income\n$ 13,788\n$ 58,656\nGAAP operating margin\n0.8%\n3.4%\nAdjustments:\nStock compensation expense (1)\n8,642\n11,977\nAmortization of intangible assets\n1,820\n1,820\nDistressed customer charges (2)\n(333)\n-\nRestructuring costs\n23,542\n728\nGain on sales of long-lived assets\n-\n(1,451)\nNon-GAAP Operating Income\n$ 47,459\n$ 71,730\nNon-GAAP operating margin\n2.7%\n4.2%\nGAAP Net Income (Loss)\n$ (154,910)\n$ 44,864\nAdjustments:\nOperating income adjustments (see above), net of tax\n26,480\n8,268\nLitigation settlements, net of tax (3)\n(217)\n-\nAdjustments for deferred tax and discrete tax items\n165,115\n4,601\nNon-GAAP Net Income\n$ 36,468\n$ 57,733\nGAAP Net Income (Loss) Per Share:\nBasic\n$ (2.16)\n$ 0.61\nDiluted\n$ (2.16)\n$ 0.58\nNon-GAAP Net Income Per Share:\nBasic\n$ 0.51\n$ 0.78\nDiluted\n$ 0.48\n$ 0.75\nWeighted-average shares used in computing GAAP per share amounts:\nBasic\n71,605\n73,554\nDiluted\n71,605\n77,175\nWeighted-average shares used in computing non-GAAP per share amounts:\nBasic\n71,605\n73,554\nDiluted\n75,485\n77,175\n(1)\nStock compensation expense was as follows:\nThree Months Ended\nDec. 30,\nDec. 31,\n2017\n2016\nCost of sales\n$ 2,448\n$ 2,863\nSelling, general and administrative\n6,164\n8,840\nResearch and development\n30\n274\nTotal\n$ 8,642\n$ 11,977\n(2)\nRelates to recovery of previously written-off inventory and bad debt associated with distressed customers.\n(3)\nRepresents cash received in connection with certain litigation settlements, net of tax\nSchedule I\nThe commentary and financial information above includes non-GAAP measures of operating income, operating margin, net income and earnings per share. Management excludes from these measures stock-based compensation, restructuring, acquisition and integration expenses, impairment charges, amortization charges and other infrequent items, to the extent material or which we consider to be of a non-operational nature in the applicable period, and as more fully described below.\nManagement excludes these items principally because such charges are not directly related to the Company's ongoing core business operations. We use such non-GAAP measures in order to (1) make more meaningful period-to-period comparisons of Company's operations, both internally and externally, (2) guide management in assessing the performance of the business, internally allocating resources and making decisions in furtherance of Company's strategic plan, (3) provide investors with a better understanding of how management plans and measures the business and (4) provide investors with a better understanding of the ongoing, core business. The material limitations to management's approach include the fact that the charges and expenses excluded are nonetheless charges required to be recognized under GAAP and, in some cases, consume cash which reduces the Company's liquidity. Management compensates for these limitations primarily by reviewing GAAP results to obtain a complete picture of the Company's performance and by including a reconciliation of non-GAAP results back to GAAP in its earnings releases.\nAdditional information regarding the economic substance of each exclusion, management's use of the resultant non-GAAP measures, the material limitations of management's approach and management's methods for compensating for such limitations is provided below.\nStock-based Compensation Expense, which consists of non-cash charges for the estimated fair value of stock options and unvested restricted stock units granted to employees, is excluded in order to permit more meaningful period-to-period comparisons of the Company's results since the Company grants different amounts and value of equity awards in each quarter. In addition, given the fact that competitors grant different amounts and types of equity award and may use different option valuation assumptions, excluding stock-based compensation permits more accurate comparisons of the Company's core results with those of its competitors.\nRestructuring, Acquisition and Integration Expenses, which consist of severance, lease termination, exit costs and other charges primarily related to closing and consolidating manufacturing facilities and those associated with the acquisition and integration of acquired businesses, are excluded because such charges (1) can be driven by the timing of acquisitions which are difficult to predict, (2) are not directly related to ongoing business results and (3) do not reflect expected future operating expenses. In addition, given the fact that the Company's competitors complete acquisitions and adopt restructuring plans at different times and in different amounts than the Company, excluding these charges permits more accurate comparisons of the Company's core results with those of its competitors. Items excluded by the Company may be different from those excluded by the Company's competitors and restructuring and integration expenses include both cash and non-cash expenses. Cash expenses reduce the Company's liquidity. Therefore, management also reviews GAAP results including these amounts.\nImpairment Charges, which consist of non-cash charges, are excluded because such charges are non-recurring and do not reduce the Company's liquidity. In addition, given the fact that the Company's competitors may record impairment charges at different times, excluding these charges permits more accurate comparisons of the Company's core results with those of its competitors.\nAmortization Charges, which consist of non-cash charges impacted by the timing and magnitude of acquisitions of businesses or assets, are also excluded because such charges do not reduce the Company's liquidity. In addition, such charges can be driven by the timing of acquisitions, which is difficult to predict. Excluding these charges permits more accurate comparisons of the Company's core results with those of its competitors because the Company's competitors complete acquisitions at different times and for different amounts than the Company.\nOther Infrequent Items, which consist of other infrequent or unusual items (including charges associated with distressed customers, litigation settlements and gains and losses on sales of assets and redemptions of debt), to the extent material or non-operational in nature, are excluded because such items are typically non-recurring, difficult to predict or not directly related to the Company's ongoing core operations. However, items excluded by the Company may be different from those excluded by the Company's competitors. In addition, these expenses include both cash and non-cash expenses. Cash expenses reduce the Company's liquidity. Management compensates for these limitations by reviewing GAAP results including these amounts.\nAdjustments for Taxes, which consist of the tax effects of the various adjustments that we include in our non-GAAP measures, and adjustments related to deferred tax and discrete tax items. Including these adjustments permits more accurate comparisons of the Company's core results with those of its competitors.\nLogo: http://photos.prnewswire.com/prnh/20110707/SF30965LOGO\nView original content: http://www.prnewswire.com/news-releases/sanmina-reports-first-quarter-fiscal-2018-results-300589732.html\nSOURCE Sanmina Corporation", "external_links": ["http://www.prnewswire.com/news-releases/sanmina-reports-first-quarter-fiscal-2018-results-300589732.html", "http://photos.prnewswire.com/prnh/20110707/SF30965LOGO", "http://www.sanmina.com/"], "published": "2018-01-30T00:05:00.000+02:00", "crawled": "2018-01-30T01:31:55.000+02:00", "highlightTitle": ""}