{"organizations": [], "uuid": "7c1e021933d1c3fe2c558436e1f681340db6630c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218827633&w=1200&r=LYNXMPEE010OU", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-eu-markets-regulations/bankers-to-burn-midnight-oil-ahead-of-mifid-dawn-idUSKBN1ER16Q", "country": "US", "domain_rank": 408, "title": "Bankers to burn midnight oil ahead of \"MiFID\" dawn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:41:00.000+02:00", "replies_count": 0, "uuid": "7c1e021933d1c3fe2c558436e1f681340db6630c"}, "author": "", "url": "https://www.reuters.com/article/us-eu-markets-regulations/bankers-to-burn-midnight-oil-ahead-of-mifid-dawn-idUSKBN1ER16Q", "ord_in_thread": 0, "title": "Bankers to burn midnight oil ahead of \"MiFID\" dawn", "locations": [], "entities": {"persons": [{"name": "huw jone", "sentiment": "negative"}, {"name": "david lawton", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "financial conduct authority", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "alvarez & marsal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:49 PM / in 4 hours Bankers to burn midnight oil ahead of 'MiFID' dawn Huw Jones 6 Min Read \nLONDON (Reuters) - Bankers will work through the night to iron out last minute hitches before Wednesday’s launch of a major reform of European Union financial markets that aims to apply lessons from the financial crisis nearly a decade ago. \nThe new rules are already a year late due to their complexity and regulators have had to issue eleventh-hour guidance to banks and financial firms to avoid trading freezes as well as calming nerves of those not yet fully compliant. \n“For the markets facing processes, there will be a very intensive through-the-night activity,” said David Lawton, a managing director at consultants Alvarez & Marsal and former senior markets regulator at Britain’s Financial Conduct Authority. \nThe new regime shines a spotlight on the innards of stock,bond, commodity and derivatives markets by forcing banks, asset managers and traders to report detailed information on trillions of euros in transactions. \nBanks and trading firms have spent millions of euros getting ready for the big day. A report from Expand, part of the BostonConsulting Group and IHS Markit, has estimated that top global banks and asset managers will have spent $2.1 billion last year to comply with the rules. Lawton expects the new regime to trigger consolidation as the competition it aims to promote proves too much for some. \nCredit rating agency Standard & Poor’s said there would likely be more losers than winners from the profound changes being ushered in. \nThe aim is increase transparency and bolster investor protection to avoid some of the problems of the 2007-2009 financial crisis. Stock, bond, derivatives, commodity and other trades must all be reported to a repository, giving regulators a trove of data to track trades and try to spot bubbles early after failing to see the last crisis coming. \nWhen the rules go live on Wednesday, fund managers and others must for the first time fill in a transaction report with up to 65 bits of data within 15 minutes of a trade - or risk being fined. The rules, known as MiFID II or Markets in Financial Instruments Directive II, represent a revamp of the2007 MiFID law to increase transparency and investor protection and broaden its scope to take in more financial products. MiFID II will be a journey and not a one off event inJanuary, is how one national regulator responded to questions about how trading will unfold on January 3. LIQUIDITY WATCH \nThe European Securities and Markets Authority, which is overseeing the roll out, published a flurry of statements just before Christmas to tackle some remaining road bumps. “ESMA, in close cooperation with the national regulatory authorities across the EU, has carried out a broad range of work ... to ensure that the framework is in place to ensure a smooth transition from MiFID I to MiFID II,” ESMA Chairman Steven Maijoor told Reuters. So far, only 11 of the EU’s 28 member states have written MiFID II fully into national law. But ESMA has said that all firms can carry on even if their home state has not completed the legislative process. \nGermany, France and Britain, home to the EU’s top financial centres, are among the 11 EU states whose national laws are upto speed and big banks are likely to be ready. Royal Bank of Scotland’s ( RBS.L ) NatWest Markets has conducted a “soft launch”. From January 2 to January 4, some of its staff will work through the night. “Day One will hopefully go smoothly and we are as ready as we can be,” Giovanni Mazzocchi, head of macro distribution inEurope for Barclays ( BARC.L ), said. “There are a few overnighters going on to make sure everything will work on the day.” \nIndustry officials predict light trading volumes initially rather than paralysis. \nA European bond strategist said trading glitches could become a “self-fulfilling prophecy” as people feel their way under the new rules. \n“Everyone says I want to be careful for that first month of the year, and if everyone does that, we won’t have liquidity,” the strategist said. \nDISRUPTIVE ESMA will make use of the new data to set curbs on trading positions in commodities and cap off-exchange trading of shares or so-called “dark pools.” MiFID II also gives investors more information about which trading platforms offer the best deals, and asset managers will have to show investors who is paying for stock research. A fundamental aim of the original MiFID was to increase competition in share trading by allowing new platforms to take on centuries-old rivals like the London Stock Exchange ( LSE.L ). Upstarts like Chi-X went on to become among the biggestpan-European share trading platforms and regulators want MiFIDII to bring “disruption” to trading in other assets, forcing companies to become more agile. “There will be interesting times over the next few years with new players entering the market and both clients and banks making full use of the new available data to shape their activities in the market,” Mazzocchi said. Christian Voigt, senior regulatory adviser at Fidessa, a provider of trading software, said MiFID II did not represent a revolution in share trading, but would have a big impact on bonds, commodities and derivatives, where electronic trading will increase. “For fixed income and off-exchange derivatives, the wholemindset needs to change as a lot of trades are still done over the phone,” Voigt said. \n(This version of the story corrects reference to “this year” to “last year”, in the fifth paragraph.) Additional reporting by Fanny Potkin, editing by Jane Merriman", "external_links": [], "published": "2018-01-02T16:41:00.000+02:00", "crawled": "2018-01-02T16:55:48.022+02:00", "highlightTitle": ""}