{"organizations": [], "uuid": "741d442d353ec946d1f62c0251bcc3f8cf8d8eb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225787619&w=1200&r=LYNXMPEE0Q0HM", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-croatia-slovenia-border/croatia-protests-to-slovenia-over-fines-for-fishing-in-disputed-bay-idUSKBN1FG0MP", "country": "US", "domain_rank": 408, "title": "Croatia protests to Slovenia over fines for fishing in disputed bay", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T22:39:00.000+02:00", "replies_count": 0, "uuid": "741d442d353ec946d1f62c0251bcc3f8cf8d8eb0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-croatia-slovenia-border/croatia-protests-to-slovenia-over-fines-for-fishing-in-disputed-bay-idUSKBN1FG0MP", "ord_in_thread": 0, "title": "Croatia protests to Slovenia over fines for fishing in disputed bay", "locations": [], "entities": {"persons": [], "locations": [{"name": "zagreb", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "piran bay", "sentiment": "none"}, {"name": "adriatic", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "permanent court of arbitration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZAGREB (Reuters) - Croatia said on Saturday it had protested to Slovenia over its decision to fine Croatian fishermen who work in disputed Adriatic waters claimed by both countries.\n“Croatia will be forced to respond in the same way in order to protect its territory. We believe that Slovenia’s announcement is contrary to good neighborly relations and European values,” Croatia’s foreign ministry said in a statement.\nSlovenia’s police said on Friday it had forwarded the first 14 fines to Croatian fishermen for “illegally crossing Slovenia’s maritime border”. It said it would continue with the same policy next week and that those who refused to pay may be banned from entering Slovenia.\nLast month the two countries held talks but failed to solve their border dispute after which Slovenia said it would start implementing an international court ruling which Croatia dismisses as invalid.\nThe Permanent Court of Arbitration ruled last June that most of the Piran Bay area in the northern Adriatic, shared between the two neighbors, was Slovenia’s territorial water, and that Slovenia should have a sea corridor through Croatian waters to international waters.\nThe Hague-based court’s six-month deadline for the states to\nimplement the ruling expired on Dec. 29, 2017. Croatia rejects the ruling, saying it withdrew from the process in 2015 because of Slovenia’s violation of the arbitration procedure.\nCroatia withdrew from the process after a leaked tape showed that a Slovenian judge on the arbitration panel had exchanged confidential information with the Ljubljana government. The court acknowledged the arbitration violation but concluded that it was not serious enough to halt the case.\nCroatia said it wanted a bilateral solution with Slovenia and called upon its European Union peer not to undertake any unilateral acts.\nCroatia’s government told the fishermen to ignore the fines from Slovenia, but to forward them to the Croatian police instead. Croatia’s police said on Saturday it would respond with fines for Slovenian fishermen for “illegally crossing the sea border”.\nReporting by Igor Ilic; Editing by Stephen Powell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T22:39:00.000+02:00", "crawled": "2018-01-29T11:49:16.003+02:00", "highlightTitle": ""}