{"organizations": [], "uuid": "1c10a696b19eb696faa702467da9b853d445c5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-toluna-announces-expansion-of-its-panel-reach-and-operations-into-china.html", "country": "US", "domain_rank": 767, "title": "Toluna Announces Expansion of its Panel Reach and Operations into China", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.968, "site_type": "news", "published": "2018-01-16T17:30:00.000+02:00", "replies_count": 0, "uuid": "1c10a696b19eb696faa702467da9b853d445c5af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-toluna-announces-expansion-of-its-panel-reach-and-operations-into-china.html", "ord_in_thread": 0, "title": "Toluna Announces Expansion of its Panel Reach and Operations into China", "locations": [], "entities": {"persons": [{"name": "toluna", "sentiment": "none"}, {"name": "wang changwei", "sentiment": "none"}, {"name": "pan hao", "sentiment": "none"}], "locations": [{"name": "toluna", "sentiment": "none"}, {"name": "china shanghai", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "operations", "sentiment": "negative"}, {"name": "kurundata", "sentiment": "none"}, {"name": "itwp acquisitions limited", "sentiment": "none"}, {"name": "shanghai kurun information technology co., ltd", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan. 16, 2018 /PRNewswire/ -- Toluna , a leading provider of on-demand, digital consumer insights, today announced that its parent company; ITWP Acquisitions Limited has acquired Shanghai KuRun Information Technology Co., Ltd. KuRunData's company founders, Mr. Pan Hao, and Mr. Wang Changwei will remain Chairman and CEO of KuRunData.\nKuRunData has the largest, and most well-profiled online and mobile panels of more than 5 million registered members. Kurun couples this with a robust survey platform to deliver unrivalled access to insight into the Chinese market. The acquisition of KuRunData supports Toluna's growing success in the region by expanding Toluna's operations into mainland China, supports the company's ever-growing APAC presence, and deepens Toluna's already vast respondent reach in APAC. Toluna launched operations in APAC in 2011, and currently has offices in Hong Kong, India, Japan, Malaysia, Singapore, South Korea, and Sydney.\n\"The APAC market is exciting and dynamic, and we've found great success with the suite of real-time, digital survey solutions we offer. Toluna has a unique position in the market, and this is a strategic move that enables us to offer local capabilities in China, servicing international and local clients,\" says Frederic-Charles Petit, Toluna CEO. \"Our expansion into China is testament to our strong growth in the APAC territory over the past 5 years. We look forward to expanding our business into China, with the leadership team at KuRunData.\"\n\"Toluna continues to challenge the traditional method for conducting market research by empowering customers with powerful research methodology tools on an intuitive platform. Our clients have adopted these new methods, and look at Toluna as a leader in the region and we're thrilled to continue to grow within the APAC region,\" says Ludovic Milet, Managing Director, Toluna Asia Pacific. \"The expertise of the KuRun team is unrivaled.\"\nMr. Wang Changwei as Chairman of KuRunData states that \"Toluna is a player that is gaining significant momentum in the region. The capabilities that Toluna can provide together with KuRunData will serve the market well.\" Mr. Hao states \"The strategic partnership between Toluna and KuRunData will be mutually beneficial and enable us not just to separate ourselves apart from the competition in China, but indeed to transform the market.\"\nFrédéric-Charles Petit further comments \"At Toluna, our number one priority is simply to provide our clients with the best technology, respondent access and expertise needed to stay ahead of a rapidly changing digital economy and marketing landscape globally. This announcement comes on the news of continued growth for Toluna overall, and is one of many impending announcements in 2018.\"\nAbout Toluna\nToluna is a leading provider of on-demand consumer insights, empowering companies to brainstorm ideas, uncover new business opportunities and get answers to questions in real time. With its innovative business concept, Insights On Demand™, Toluna is transforming the future of market research, making consumer intent instantly accessible and understandable for companies of all sizes across multiple industries. Toluna's end-to-end automated research platform combines advanced technology and industry-proven methodologies with on-demand access to the world's largest community of 14+ million consumers in 68 countries. The company, with headquarters in Wilton, Connecticut; Paris, and London has over 21 offices across Europe, North America, Asia Pacific, and MENA. For more information, visit www.toluna-group.com .\nAbout KuRunData\nKuRunData is dedicated to providing high quality and efficiency online research services and is the leading panel community in mainland China and devoted to unifying marketing research with technology, to provide first-class online research services.\nView original content with multimedia: http://www.prnewswire.com/news-releases/toluna-announces-expansion-of-its-panel-reach-and-operations-into-china-300582214.html\nSOURCE Toluna", "external_links": ["http://www.prnewswire.com/news-releases/toluna-announces-expansion-of-its-panel-reach-and-operations-into-china-300582214.html", "http://www.toluna-group.com/"], "published": "2018-01-16T17:30:00.000+02:00", "crawled": "2018-01-16T18:32:47.011+02:00", "highlightTitle": ""}