{"organizations": [], "uuid": "db6dd08b6ef5faa72a0312614e16531590b41534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-4584994561.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/ibm-blockchain-maersk-company/", "country": "US", "domain_rank": 1196, "title": "Shipping: IBM, Maersk Are Creating a New Blockchain Company | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.952, "site_type": "news", "published": "2018-01-16T09:15:00.000+02:00", "replies_count": 0, "uuid": "db6dd08b6ef5faa72a0312614e16531590b41534"}, "author": "Robert Hackett", "url": "http://fortune.com/2018/01/16/ibm-blockchain-maersk-company/", "ord_in_thread": 0, "title": "Shipping: IBM, Maersk Are Creating a New Blockchain Company | Fortune", "locations": [], "entities": {"persons": [{"name": "robert hackett", "sentiment": "negative"}, {"name": "tetra pak", "sentiment": "none"}, {"name": "michael j. white", "sentiment": "none"}, {"name": "procter", "sentiment": "none"}], "locations": [{"name": "rotterdam", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "mombasa", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "maersk", "sentiment": "negative"}, {"name": "maersk are creating a new blockchain company", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "dupont", "sentiment": "none"}, {"name": "dow chemical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Robert Hackett 7:15 AM EST \nIBM and Danish shipping giant Maersk are teaming up to form a new company whose aim is to commercialize blockchain technology—the nifty, shared accounting ledgers first made famous by the cryptocurrency Bitcoin. \nThe as-yet unnamed, New York-based venture is set to be owned 51% by Maersk and 49% by IBM (ibm) , the companies said. The concern intends to help shippers, ports, customs offices, banks, and other stakeholders in global supply chains track freight as well as replace related paperwork with tamper-resistant digital records. \nIBM and Maersk first partnered on a blockchain trial in summer 2016. Michael J. White, the new company’s CEO, said this pilot, which traced a container of flowers that sailed from Mombasa, Kenya to Rotterdam in the Netherlands, plus several followups convinced Maersk of the system’s potential. \nSince then, the two companies have partnered with Dupont, Dow Chemical , Swiss food processor Tetra Pak, and various ports and customs offices on tests. Other corporations, such as General Motors (gm) and Procter and Gamble (pg) are exploring ways to use the technology to streamline record-keeping for their supply chains as well. \n“We see an opportunity to increase efficiency and timeliness for cargo movement,” White tells Fortune . Previously, White served as the North American president for Maersk Line, Maersk’s container shipping division. \n“Even small improvements can have a substantial impact on global trade,” says Marie Wieck, general manager of IBM’s blockchain team. \nPresently, many shipping supply chains are bogged down by a morass of paperwork shuffled between a glut of middlemen, Wieck says. Documentation, which when lost or delayed causes perishable goods lying in wait to spoil, can end up costing as much as a fifth of the total expense of physical transportation. Tom Linboe \nAccording to a 2013 study by the World Economic Forum, reducing the friction around information-sharing and border administration when it comes to international trade “could increase GDP by nearly 5% and trade by 15%”—a boost that amounts to trillions of dollars. \nIBM and Maersk see the adoption of blockchains as one way to achieve this improvement. By providing a single view of all transactions taking place among a complex network of parties, blockchains can help eliminate considerable resource waste, they argue. \n“The potential from offering a neutral, open digital platform for safe and easy ways of exchanging information is huge, and all players across the supply chain stand to benefit,” says Vincent Clerc, Maersk’s chief commercial officer who has been tapped to serve as board chairman of the new joint venture, in a statement. \n“Supply chain is a very, very hot topic right now and it is only accelerating from here,” says Bill Fearnley, Jr., research director for blockchain strategies at market research firm IDC. He notes that IBM and Maersk’s new company will have a competitive advantage over smaller blockchain startups angling for the same market due to the pre-established business relationships of the companies behind it. \nGet Data Sheet , Fortune’s technology newsletter. \nIBM and Maersk’s technology is built on Hyperledger Fabric 1.0, a blockchain first developed by IBM that is now maintained by the Linux Foundation’s Hyperledger group. \nIBM has separately partnered with companies such as Walmart (wmt) , Nestle, Unilever (ul) , and others on food safety and supply chain trials using its blockchain technology. The company is also working on pilots in finance, healthcare, and other industries. \nMaersk has also partnered on separate blockchain trials for marine insurance with the like of Microsoft , EY, and others. (You can read more about corporate blockchain efforts in this Fortune cover story from September.) \nWhite says he expects the joint Maersk-IBM venture to get regulatory approval in early spring and to begin selling software subscriptions by the third quarter of this year. In the meantime, the new company is assembling an advisory board of industry and government officials to help guide its product development. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-16T09:15:00.000+02:00", "crawled": "2018-01-16T15:07:01.024+02:00", "highlightTitle": ""}