{"organizations": [], "uuid": "54f6fe3ab9aae55fa696947c4f28ad61f0054e6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-primus-announces-a-voluntary-nationwide-recall-of-all-lots-within-expiry-of-prescription-medical-food-limbrela-due-to-rare-but.html", "country": "US", "domain_rank": 767, "title": "Primus Announces A Voluntary Nationwide Recall Of All Lots Within Expiry Of Prescription Medical Food Limbrel® Due To Rare But Serious And Reversible Adverse Events While Seeking FDA's Cooperation To Restore Access For Patients With Medical Necessity", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.987, "site_type": "news", "published": "2018-01-27T06:00:00.000+02:00", "replies_count": 0, "uuid": "54f6fe3ab9aae55fa696947c4f28ad61f0054e6a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-primus-announces-a-voluntary-nationwide-recall-of-all-lots-within-expiry-of-prescription-medical-food-limbrela-due-to-rare-but.html", "ord_in_thread": 0, "title": "Primus Announces A Voluntary Nationwide Recall Of All Lots Within Expiry Of Prescription Medical Food Limbrel® Due To Rare But Serious And Reversible Adverse Events While Seeking FDA's Cooperation To Restore Access For Patients With Medical Necessity", "locations": [], "entities": {"persons": [{"name": "limbrel", "sentiment": "none"}, {"name": "primus", "sentiment": "none"}], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}, {"name": "scottsdale", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "limbrel", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "neutral"}, {"name": "primus pharmaceuticals, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 26, 2018 /PRNewswire/ -- Primus Pharmaceuticals, Inc. of Scottsdale, Arizona is voluntarily recalling all unexpired lots of Limbrel products to the patient (user/consumer) level at FDA's request. FDA has requested a recall of Limbrel due to rare but serious and reversible side effects associated with Limbrel.\nBetween January 1, 2007, and November 9, 2017, FDA received 30 adverse event reports of elevated liver function tests or acute hypersensitivity pneumonitis associated with the use of Limbrel products. These conditions present in rare cases with varying degrees of severity in patients taking Limbrel for the first time in the initial weeks of exposure, and may go unnoticed by the patient until they consult with their physician or until symptoms develop that require hospitalization. There have been no deaths reported with the use of Limbrel, and in all reported cases adverse effects resolved without residual effects after discontinuing use of the product.\nPrimus retained independent medical and former senior FDA safety experts to conduct a further investigation of these cases and the ingredients in Limbrel. It is the opinion of these experts based on a thorough review of the medical literature, adverse event reports to FDA, and FDA's health hazard evaluation that there is no basis on which to conclude that Limbrel potentially causes life-threatening adverse effects, and that none of the reported adverse events show liver failure or respiratory failure. Nonetheless, in an effort to cooperate with FDA, Primus voluntarily ceased its promotion and distribution of Limbrel on December 21, 2017, and is now recalling Limbrel as FDA has requested.\nAll lots within expiry of the following products are included in this recall:\nLimbrel (flavocoxid) 250 mg capsules, Product Identity Number 68040-601-16 Limbrel250 (250 mg flavocoxid with 50 mg citrated zinc bisglycinate) capsules, Product Identity Number 68040-605-16 Limbrel (flavocoxid) 500 mg capsules, Product Identity Number 68040-602-16 Limbrel500 (500 mg flavocoxid with 50 mg citrated zinc bisglycinate) capsules, Product Identity Number 68040-606-16\nLimbrel has been marketed since 2004 as a medical food available only by prescription for patients under active and ongoing supervision of a physician for the dietary management of osteoarthritis (OA), a degenerative disease of the joints and the most common form of arthritis. Prior to marketing, Primus conducted clinical studies that support the efficacy and safety of Limbrel and compiled an extensive dossier providing an analysis of published data to support the medical food status of Limbrel and to establish how the product meets the distinctive nutritional requirements of OA. Primus stands by the legal status of Limbrel as a medical food. Limbrel products have been distributed nationwide in the USA to wholesalers, pharmacies, and physicians as medical foods without challenge from FDA for over 13 years, with approximately 2 million prescriptions and physician samples dispensed to an estimated 450,000 patients.\nPrimus is notifying its distributors by emailed letter and is arranging for the return of all recalled products. Retail pharmacies that have Limbrel products should return them to the wholesale distributor. FDA has recommended that patients who have the Limbrel products that are being recalled should stop use.\nPatients who wish to return unopened bottles or who have questions regarding this recall should go to Limbrel.com or contact Primus by calling (480-483-1410) on Monday through Friday, 9 AM to 5 PM Mountain Time. Patients should contact their physician or healthcare provider if they have experienced any adverse event that may be related to taking Limbrel.\nPhysicians with extensive experience with Limbrel have provided written testimony to FDA confirming the benefits and safety of Limbrel for managing OA and to establish the medical necessity of Limbrel for elderly patients with comorbidities who cannot use NSAIDs and have a strong desire to avoid opioid use if possible. For these and other patients and their medical professionals who have stated their desire for continued access to Limbrel, Primus will seek to work with FDA to return Limbrel to the market as quickly as possible. For updates about access to Limbrel go to Limbrel.com .\nAdverse reactions or quality problems experienced with the use of these products may be reported to the FDA's MedWatch Adverse Event Reporting program either online, by regular mail or by fax.\nComplete and submit the report Online : www.fda.gov/medwatch/report.htm . Regular Mail or Fax : Download form www.fda.gov/MedWatch/getforms.htm or call 1-800-332-1088 to request a reporting form, then complete and return to the address on the pre-addressed form, or submit by fax to 1-800-FDA-0178.\nThis recall is being conducted with the knowledge of the U.S. Food and Drug Administration.\nView original content with multimedia: http://www.prnewswire.com/news-releases/primus-announces-a-voluntary-nationwide-recall-of-all-lots-within-expiry-of-prescription-medical-food-limbrel-due-to-rare-but-serious-and-reversible-adverse-events-while-seeking-fdas-cooperation-to-restore-access-for-patients-wi-300589204.html\nSOURCE Primus Pharmaceuticals, Inc.", "external_links": ["http://www.limbrel.com/", "http://www.prnewswire.com/news-releases/primus-announces-a-voluntary-nationwide-recall-of-all-lots-within-expiry-of-prescription-medical-food-limbrel-due-to-rare-but-serious-and-reversible-adverse-events-while-seeking-fdas-cooperation-to-restore-access-for-patients-wi-300589204.html", "http://www.fda.gov/medwatch/report.htm", "http://www.fda.gov/MedWatch/getforms.htm"], "published": "2018-01-27T06:00:00.000+02:00", "crawled": "2018-01-27T07:11:16.022+02:00", "highlightTitle": ""}