{"organizations": [], "uuid": "a775d37b6559e0c9f2a8a23dd129946c4123c223", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219803859&w=1200&r=LYNXMPEE0507T", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-iran-rallies/iran-stages-pro-government-rallies-derides-trump-blunder-at-u-n-idUSKBN1EV0AH", "country": "US", "domain_rank": 408, "title": "Iran stages pro-government rallies, derides Trump 'blunder' at U.N.", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T12:30:00.000+02:00", "replies_count": 0, "uuid": "a775d37b6559e0c9f2a8a23dd129946c4123c223"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies/iran-stages-pro-government-rallies-derides-trump-blunder-at-u-n-idUSKBN1EV0AH", "ord_in_thread": 0, "title": "Iran stages pro-government rallies, derides Trump 'blunder' at U.N.", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "semnan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "united nations security council", "sentiment": "none"}, {"name": "u.n. reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - Thousands of government supporters staged rallies in Iran for a fourth day on Saturday, in a backlash against widespread protests that the clerical establishment has blamed on the country’s enemies. \nSaturday’s show of support came a day after Iran’s foreign minister said a United Nations Security Council meeting called by the United States to discuss the protests had proved a “blunder” by the administration of U.S. President Donald Trump. \nState television showed rallies in cities including Amol, Semnan and Shadegan waving Iranian flags and chanting “Death to America”, “Death to Israel” and “Death to Britain”. \nMore than a week of unrest has seen 22 people die and more than 1,000 arrested, according to Iranian officials, in the biggest anti-government protests for nearly a decade. \nUnrest spread to more than 80 cities and rural towns as thousands of young and working class Iranians voiced anger at graft, unemployment and a deepening gap between rich and poor. \nResidents contacted by Reuters in various cities on Friday said the protests had shown sign of abating, after the government intensified a crackdown on protesters by dispatching Revolutionary Guards forces to several provinces. \nThe provincial governor in northeastern Mashhad, where the protests started, was quoted as saying on Saturday that 85 percent of detainees there had been released after signing a pledge not to re-offend. \n“Those with a criminal record, or those charged with sabotage such a setting fire to motorcycles or damaging public buildings have been referred to judicial authorities,” governor Alireza Rashidian told the ISNA news agency. \nTehran University Vice-President Majid Sarsangi said the university had set up a committee to track the fate of students arrested during the unrest. \n“Our efforts at the university are aimed at cooperating with the relevant authorities to create the conditions for the return of the detained students to the university and their families in the shortest possible time,” Sarsangi told ISNA. \nSeparately, a member of parliament said about 90 students were detained, 10 of whom were still not accounted for. \n“It seems that the total number of detainees is around 90. Ten students from universities in Tehran and some other cities are in an uncertain position, and ... it is still unknown which body has detained them,” the labor news agency ILNA quoted reformist politician Mahmoud Sadeghi as saying. \nIran has several parallel security bodies and residents say arrests are often not immediately announced. \nVideos that appeared on social media in recent days showed relatives of detainees gathering outside prisons to seek information about the fate of their loved ones. \nA United Nations Security Council meeting on Friday to discuss the protests turned into criticism of the United States for requesting to meet on what some member states said was an internal issue for Iran. \nForeign Minister Mohammad Javad Zarif tweeted: “The UNSC rebuffed the U.S.’s naked attempt to hijack its mandate ... Another FP (foreign policy) blunder for the Trump administration.” \nIran’s elite Guards and its affiliated Basij militia suppressed the country’s 2009 unrest over alleged election fraud, in which dozens of pro-reform Iranians were killed. \nReporting by Dubai newsroom; Editing by Mark Potter\n ", "external_links": [], "published": "2018-01-06T12:30:00.000+02:00", "crawled": "2018-01-06T12:41:51.022+02:00", "highlightTitle": ""}