{"organizations": [], "uuid": "b3ede5ef362a3216018733bec57c1fc56758d05f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/17/102596422-IMG_5063.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/a-1000-investment-in-mcdonalds-10-years-ago-is-worth-this-much-now.html", "country": "US", "domain_rank": 767, "title": "A $1,000 investment in McDonald's 10 years ago is worth this much now", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:31:00.000+02:00", "replies_count": 0, "uuid": "b3ede5ef362a3216018733bec57c1fc56758d05f"}, "author": "Shawn M. Carter", "url": "https://www.cnbc.com/2018/01/30/a-1000-investment-in-mcdonalds-10-years-ago-is-worth-this-much-now.html", "ord_in_thread": 0, "title": "A $1,000 investment in McDonald's 10 years ago is worth this much now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fast-food conglomerate McDonald's outperformed Wall Street expectations during the fourth quarter, CNBC reports . The company reached a revenue point of $5.34 billion and grew more than 5 percent in global same-store sales.\nAnd if you invested $1,000 in McDonald's in 2008, your investment could have performed well, too. A $1,000 investment in McDonald's on Jan. 30, 2008, would be worth slightly more than $3,400 as of Tuesday morning, according to CNBC calculations.\nThe investment would have seen a lifetime total return of about 300 percent, including price appreciation and dividend gains reinvested. In one month, the stock has grown from $3,381 to its current value and, in one year, its portfolio value has increased by more than 40 percent.\nIn the charts below, all data splits are adjusted and gain-loss figures do not include dividends, interest, distributions or fees except on cash accounts. The portfolio value represents current holdings and the comparison charts represent current and historical prices of individual benchmarks , stocks or exchange-traded funds .\nIn the quarter that ended Dec. 31, 2017, CNBC reports , McDonald's net income fell 41 percent, to $698.7 million, or 87 cents per share, from $1.19 billion, or $1.44 per share the previous year. Earnings in the latest period dropped by 84 cent per share because of U.S. tax law changes.\nStill, McDonald's chief executive officer Steve Easterbrook is optimistic about the future. In a statement, he said, \"2017 was a strong year for McDonald's, as customers responded to the many ways we are making their experience more convenient and enjoyable.\n\"We served more customers more often, achieved our best comparable sales performance in six years, gained share in markets around the world and made tremendous progress with growth platforms such as delivery, mobile order and pay and Experience of the Future.\"\nMcDonald's currently has a delivery partnership with UberEats, and this year it plans to continue its renovation and modernization plans, including touch-screen ordering, as well as open 1,000 new restaurants and invest $2.4 billion in existing locations.\nIf you're interested in investing in McDonald's, or just considering getting into the stock market , experts advise beginning carefully. While McDonald's stock has seen recent increases, any individual stock can over- or under-perform and past returns do not predict future results.\nFamed investors Warren Buffett, Mark Cuban and Tony Robbins all suggest starting with index funds , which hold every stock in an index, offer low turnover rates, attendant fees and tax bills, and fluctuate with the market to eliminate the risk of picking individual stocks.\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Despite his billions, President Trump still enjoys a $22 McDonald's dinner \nVideo by Andrea Kramar \nshow chapters Investing in these stocks would have made you rich by now — here's other ways to invest your money      7:26 AM ET Wed, 29 Nov 2017 | 01:17", "external_links": [], "published": "2018-01-30T19:31:00.000+02:00", "crawled": "2018-01-30T19:31:31.004+02:00", "highlightTitle": ""}