{"organizations": [], "uuid": "889fa04a2e37e8f4d28d028c5a59118407a95b2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/22/104545927-RTSU94J.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/bofa-indicator-has-sent-its-strongest-stock-sell-signal-in-5-years.html", "country": "US", "domain_rank": 767, "title": "BofA indicator has sent its strongest stock 'sell' signal in 5 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:34:00.000+02:00", "replies_count": 0, "uuid": "889fa04a2e37e8f4d28d028c5a59118407a95b2d"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/26/bofa-indicator-has-sent-its-strongest-stock-sell-signal-in-5-years.html", "ord_in_thread": 0, "title": "BofA indicator has sent its strongest stock 'sell' signal in 5 years", "locations": [], "entities": {"persons": [{"name": "bofaml", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bofa", "sentiment": "negative"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "morningstar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 Hours Ago | 02:32 \nThe relentless gush of cash into the stock market is sending a powerful \"sell\" signal, according to a Bank of America Merrill Lynch gauge that has been a reliable indicator in the past. \nInvestors poured $33.2 billion into stock-based funds through the week ended Wednesday, BofAML said in a report. That's a record both for total flows and as well as for active funds, which alone pulled in $12.2 billion. \nBy comparison, equity funds across all classes took in a net $278 billion for all of 2017, according to Morningstar, meaning that last week alone equated to 12 percent of flows for the entire previous year. \nThe week continued a trend that has seen money rush into stocks as major averages climb to new records . The Dow Jones industrial average is up 7 percent year to date. \nWhile the inflows have helped push the market higher, they also can be seen as a contrary indicator when they flash signs of excess. BofAML uses a proprietary \"Bull & Bear\" indicator that gauges when inflows or outflows point to investors moving too far to either side. \nThe current reading on the indicator of 7.9 is the most bullish since a reading above 8 in March 2013 — a sell signal. Michael Hartnett, BofAML's chief investment strategist, said the Bull & Bear indicator has shown 11 previous sell signals since the firm started tracking it in 2002 and has been correct each time. \nIn the near term, around February and March, that suggests a technical pullback for the S&P 500 to 2,686, which would represent a drop of close to 6 percent, Hartnett said. \nThe enthusiasm has not been unique to the U.S., whose equity markets brought in $7 billion of fresh cash. \nEmerging markets attracted $8.1 billion in new flows, Europe brought in $4.6 billion and Japan saw $3.4 billion. That comes as 98 percent of global markets are trading above their 50- and 200-day moving averages, both classic signs of overbought markets. FWIW, the Dow is the most overbought since ... 1904 (not a typo) \nStock-based funds overall have brought in just shy of $77 billion in 2018, with the lion's share of $59.2 billion going to passively focused exchange-traded funds. \nHowever, investors continue to hedge, giving about $32 billion to bonds, while last week's $1.5 billion flow into gold funds was the highest in 50 weeks. \nWATCH: Trump predicts stocks would have fallen 50 percent if Hillary Clinton was elected . show chapters ", "external_links": [], "published": "2018-01-26T17:34:00.000+02:00", "crawled": "2018-01-26T17:34:48.004+02:00", "highlightTitle": ""}