{"organizations": [], "uuid": "113584257e50265dd4084054bda65ab58907af19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-spyryx-biosciences-expands-with-election-of-roger-jeffs-phd-as-independent-director.html", "country": "US", "domain_rank": 767, "title": "Spyryx Biosciences Expands with Election of Roger Jeffs, PhD as Independent Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "113584257e50265dd4084054bda65ab58907af19"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-spyryx-biosciences-expands-with-election-of-roger-jeffs-phd-as-independent-director.html", "ord_in_thread": 0, "title": "Spyryx Biosciences Expands with Election of Roger Jeffs, PhD as Independent Director", "locations": [], "entities": {"persons": [{"name": "roger jeffs", "sentiment": "negative"}, {"name": "roger", "sentiment": "none"}, {"name": "spyryx", "sentiment": "none"}, {"name": "john taylor", "sentiment": "none"}, {"name": "jeffs", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "spyryx biosciences, inc.", "sentiment": "neutral"}, {"name": "spyryx", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "united therapeutics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DURHAM, N.C., Jan. 16, 2018 /PRNewswire/ -- Spyryx Biosciences, Inc. , a clinical-stage biopharmaceutical company developing novel therapeutics for severe pulmonary diseases, announced today the election of Dr. Roger Jeffs as a member of the Company's board of directors. Dr. Jeffs brings over 25 years of biopharmaceutical industry experience, including 18 years at United Therapeutics where he retired in 2016 as President and Co-CEO.\n\"I'm excited to have Roger join our board and to have the opportunity to work with him to advance Spyryx's product and corporate development efforts. He has a successful track record, particularly in rare pulmonary diseases, and I know his insights and experience will be a major positive for Spyryx as we move SPX-101 through Phase 2 for cystic fibrosis, as well as investigate the opportunity for our compounds in additional indications,\" said John Taylor, Spyryx's President and CEO.\nAt United Therapeutics, Dr. Jeffs served on the board of directors from 2001-2016 and led the clinical development, regulatory approval and commercialization of six rare disease products and managed the commercial effort that produced $1.5 billion in annual revenue. Prior to United Therapeutics, he held positions in clinical development at Amgen and Burroughs Wellcome. Dr. Jeffs currently serves as a member of the board of directors of 4 public biopharma companies: Albireo Pharma, Axsome Therapeutics, Dova Pharmaceuticals and Sangamo Therapeutics.\nDr. Jeffs stated, \"I am thrilled to join the Spyryx Board at such an exciting time in the Company's life cycle. The board and management team have done an excellent job of advancing this important therapeutic class into the clinic and developing broad IP with large commercial potential across a number of underserved indications.\"\n\"I'd like to welcome Roger to the Spyryx Board. His experience leading both scientific and strategic operations make him an excellent addition and a further resource for the Spyryx management team,\" said Tim Shannon, MD, general partner at Canaan Partners and Chairman of Spyryx.\nAbout Spyryx Biosciences\nSpyryx Biosciences is a clinical-stage biopharmaceutical company developing innovative therapeutics to address severe pulmonary diseases. Spyryx's lead clinical candidate, SPX-101, is completing a multinational Phase 2 study as a novel treatment for cystic fibrosis. The product has demonstrated a robust ability to restore mucociliary clearance in animal models of the disease and has the potential to improve lung function in people living with cystic fibrosis independent of their genotype. Spyryx is funded by a first-tier syndicate of life science investors, including Canaan Partners, 5AM Ventures and Hatteras Venture Partners. Further information regarding Spyryx Biosciences is available at www.spyryxbio.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/spyryx-biosciences-expands-with-election-of-roger-jeffs-phd-as-independent-director-300582811.html\nSOURCE Spyryx Biosciences, Inc.", "external_links": ["http://www.spyryxbio.com/", "http://www.prnewswire.com/news-releases/spyryx-biosciences-expands-with-election-of-roger-jeffs-phd-as-independent-director-300582811.html"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:26:23.004+02:00", "highlightTitle": ""}