{"organizations": [], "uuid": "ee3e4000f039cb5b8ab4f085ab47a569f7757f44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-kroll-expands-global-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Kroll Expands Global Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:30:00.000+02:00", "replies_count": 0, "uuid": "ee3e4000f039cb5b8ab4f085ab47a569f7757f44"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-kroll-expands-global-leadership-team.html", "ord_in_thread": 0, "title": "Kroll Expands Global Leadership Team", "locations": [], "entities": {"persons": [{"name": "kroll", "sentiment": "negative"}, {"name": "david fontaine", "sentiment": "none"}, {"name": "fernanda barroso", "sentiment": "none"}, {"name": "greg michaels", "sentiment": "none"}, {"name": "katy shanahan", "sentiment": "none"}, {"name": "katy", "sentiment": "none"}, {"name": "cem", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}, {"name": "fernanda", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "new jersey cem ozturk", "sentiment": "none"}, {"name": "são paulo", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "secaucus", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "kroll expands global leadership team", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "corporate risk holdings", "sentiment": "none"}, {"name": "kroll", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Kroll (\"the Company\"), a global leader in risk mitigation, investigations, compliance, cyber resilience, security, and incident response solutions, today announced the appointment of four new Managing Directors, enhancing the Company's leadership team across the globe. Each of the following appointments became effective January 1, 2018.\nFernanda Barroso, São Paulo, Brazil Greg Michaels, Secaucus, New Jersey Cem Ozturk, Singapore Katy Shanahan, Boston, Massachusetts\n\"In their time at Kroll, Fernanda, Greg, Cem, and Katy have consistently demonstrated the values and strengths that make Kroll the leading global provider of risk and investigative services: deep professional knowledge, client service excellence, strong entrepreneurial mindset, a drive to continually improve, and dynamic cross-regional/cross-practice collaboration,\" said David Fontaine, Chief Executive Officer of Kroll and its parent, Corporate Risk Holdings. \"Each excels at successfully meeting the most complex needs of our global clientele, and earning the trust and confidence of clients and colleagues alike. I am very proud to announce their elevation within the Kroll organization and look forward to seeing them continue to grow and succeed in our firm.\"\nFernanda Barroso, São Paulo, Brazil\nMs. Barroso joined Kroll in 2015 and was named Head of the São Paulo office in 2017. With a background in finance and journalism and an advanced degree in economics and quantitative analysis, Ms. Barroso has led engagements that range from large-scale forensic accounting investigations to internal fraud investigations. She frequently consults with law firms and corporations on investigative issues related to financial fraud, such as revenue or expense falsification, corruption, and employee wrongdoing. Ms. Barroso has also coordinated projects relating to entry alternatives in Brazil, business internationalization, and regulatory assessment. She came to Kroll with more than a decade of experience working on a broad array of business transactions, such as domestic and international due diligence and business intelligence assignments. Her previous work history includes service with a Big Four accounting firm, commercial banks, private banks, private equity firms, and government departments. Ms. Barroso is a graduate of the Universidade Federal do Rio de Janeiro and Saint Paul Escola de Negócios, and is a member of the Association of Certified Fraud Examiners. She is fluent in Portuguese and English.\nGreg Michaels, Secaucus, New Jersey\nMr. Michaels, who joined Kroll in 2014, partners with clients at the strategic and operational level to build proactive information security programs, helping them to comply with regulatory requirements and to minimize enterprise risk. He has extensive experience collaborating across functional units and communicating complex technical matters in plain spoken terms to executive stakeholders. Mr. Michaels has particularly deep experience helping healthcare organizations enhance their security, privacy, and compliance programs, enabling them to navigate the complex regulatory landscape and emerging global threats. Prior to joining Kroll, Mr. Michaels worked as Chief Security Officer for BluePrint Healthcare IT, where he led the Security, Privacy, and Compliance practice for more than five years. Earlier in his career, Mr. Michaels worked as an Information Security Analyst for i3 Global (United Health Group) and as a Network & Security Administrator for PXRE Group, Ltd. Mr. Michaels is a graduate of Seton Hall University School of Law, Capitol College, and Rutgers University, and holds the following certifications: Certified Information Systems Security Professional (CISSP); PCI Qualified Security Assessor (QSA); Certified in Risk and Information Systems Control (CRISC); Certified Information Systems Manager (CISM); Certified Information Systems Auditor (CISA); Certified Business Continuity Professional (CBCP); Project Management Professional (PMP); and Systems Security Certified Professional (SSCP).\nCem Ozturk, Singapore\nSince joining Kroll in 2011, Mr. Ozturk has progressively risen in the firm to his current role as Managing Director. Originally from Virginia, he has more than 14 years of in-country Asia Pacific experience and specializes in investigative projects in low-transparency markets with weak rule of law and a high degree of overlap between political and economic issues. With a strong regional network that enables him to efficiently provide intelligence to strategic and legal teams, Mr. Ozturk has experience managing complex investigations into hidden stakeholders, directing research into high-profile partnerships, and providing Kroll's Western and Japanese clients with local insight around challenging regional risk issues. He has conducted substantial fieldwork in over 20 countries, including deep investigative experience in Indonesia and Myanmar. He has also been involved in multiple complex global asset traces across Asia, Europe, Africa, and the West Pacific. Prior to joining Kroll, Mr. Ozturk spent over a decade in political journalism, publishing, and NGO work in six Asia Pacific markets, including India, Thailand, and Korea. Mr. Ozturk is a graduate of the Nanyang Technological University and the University of Virginia. A native English speaker, Mr. Ozturk is also conversant in Japanese.\nKaty Shanahan, Boston, Massachusetts\nMs. Shanahan, who joined Kroll in 2006, has worked on, and currently manages, a variety of complex multi-jurisdictional investigations on behalf of clients across diverse industry sectors. She has led and provided analysis on hundreds of due diligence assignments, both domestic and international, including large-scale due diligence engagements in support of IPOs and other commercial transactions. Ms. Shanahan also has experience conducting investigations involving employee fraud and misconduct, theft of intellectual property, and competitive intelligence matters. Additionally, she has managed and worked on several domestic and international asset search investigations for Fortune 100 companies, individuals, and judgment creditors. Her efforts support her clients' needs in crisis management, litigation support, and corporate contests. Prior to joining Kroll, Ms. Shanahan was an Investigator with the U.S. Department of Labor's Office of Labor-Management Standards (OLMS). There, she helped promote labor union and labor-management transparency through the enforcement of reporting and disclosure requirements for unions and their officials, employers, labor relations consultants, and surety companies. Ms. Shanahan is a graduate of the College of the Holy Cross.\nAbout Kroll:\nKroll is the leading global provider of risk solutions. For more than 40 years, Kroll has helped clients make confident risk management decisions about people, assets, operations, and security through a wide range of investigations, cyber security, due diligence and compliance, physical and operational security, and data and information management services. Headquartered in New York with more than 35 offices in 20 countries, Kroll has a multidisciplinary team of nearly 1,000 employees and serves a global clientele of law firms, financial institutions, corporations, non-profit institutions, government agencies, and individuals. For more information visit www.krol", "external_links": ["http://www.prnewswire.com/news-releases/kroll-expands-global-leadership-team-300581295.html", "http://www.kroll.com/"], "published": "2018-01-11T17:30:00.000+02:00", "crawled": "2018-01-11T19:06:53.003+02:00", "highlightTitle": ""}