{"organizations": [], "uuid": "3d964d76d308d9b9181f5f0d6959ea8bc15137ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX464_0109pa_SOC_20180109144928.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/amd-hits-a-snag-over-patch-for-chip-flaw-1515528197", "country": "US", "domain_rank": 387, "title": "AMD Hits a Snag Over Patch for Chip Flaw", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:29:00.000+02:00", "replies_count": 0, "uuid": "3d964d76d308d9b9181f5f0d6959ea8bc15137ea"}, "author": "Robert McMillan", "url": "https://www.wsj.com/articles/amd-hits-a-snag-over-patch-for-chip-flaw-1515528197", "ord_in_thread": 0, "title": "AMD Hits a Snag Over Patch for Chip Flaw", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "advanced micro devices inc", "sentiment": "negative"}, {"name": "amd", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "none"}, {"name": "intc", "sentiment": "none"}, {"name": "microsoft corp.", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Days after Advanced Micro Devices Inc. AMD -3.75% suggested its chips were largely unaffected by significant vulnerabilities found in a variety of processors, the rival to Intel Corp. INTC -2.50% has run into trouble. \nMicrosoft Corp. on Tuesday said some customers found their AMD-powered computers were unusable after applying the latest security patches for the Windows operating system.\nOn an online support page, Microsoft said it would “temporarily pause ” sending updates to some devices running AMD processors. After investigating, the software giant said it found “some AMD chipsets do not conform to the documentation previously provided to Microsoft.” \nIntel’s shares sank in the two days after the chip vulnerabilities were disclosed last week, while AMD shares are up more than 15% since Jan. 2, the day before news of the security flaws was widely disclosed. An AMD spokesman at the time said the flaws posed a “near-zero risk” to its processors. Its shares were down 3.5% in afternoon trading Tuesday.\nThe patch issue affects “a small subset of older processors that were sold prior to 2009,” an AMD spokesman said Tuesday.\nAMD and security researchers say the company’s chips aren’t vulnerable to the most easily exploitable—but most easily patched—variant of the security flaws, known as Meltdown.\nInstead, the problem that is being patched by Microsoft concerns a variant of another flaw, known as Spectre. It is likely to be an increasingly important security problem in the months to come, as researchers learn more about the issue, said Paul Kocher, an independent security researcher, who was among those who discovered the Spectre vulnerabilities.\n“Once the Meltdown patches are installed, I don’t see any significant security difference between Intel and AMD on these issues,” he said.\nAMD should have done a better job documenting how software makers should develop patches for the chip maker’s hardware and more clearly explained the security issues associated with their products, Mr. Kocher said. Rivals Intel and ARM Holdings have offered much more detailed documentation of these security issues, he said.\n“Microsoft has access to our processor architecture documentation, which is essentially what is needed, and we have been engaged regularly in engineering meetings to assist since this was disclosed,” the AMD spokesman said.\nGlitches are possible any time a software update is deployed. “It wouldn’t be the first time a Windows update had an issue,” said Patrick Moorhead, an analyst with Moor Insights & Strategy. “But it’s obviously not a positive thing.”\nWrite to Robert McMillan at Robert.Mcmillan@wsj.com and Ted Greenwald at Ted.Greenwald@wsj.com", "external_links": [], "published": "2018-01-09T22:29:00.000+02:00", "crawled": "2018-01-09T23:40:45.075+02:00", "highlightTitle": ""}