{"organizations": [], "uuid": "6c9cc51d94a3fa2fdbb9f3cf3fe842f26bf04ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/brainstorm-health-daily-01-19-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Cancer Blood Test, Government Shutdown, Delaware Sues Opioid Makers | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.626, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "6c9cc51d94a3fa2fdbb9f3cf3fe842f26bf04ceb"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/19/brainstorm-health-daily-01-19-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Cancer Blood Test, Government Shutdown, Delaware Sues Opioid Makers | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "delaware", "sentiment": "none"}], "organizations": [{"name": "j.p. morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Clifton Leaf January 19, 2018 \nHappy Friday, all. Every year at the annual and overwhelmingly large J.P. Morgan Healthcare Conference there is one announcement or presentation that stands out from the rest. This year that newsworthy moment, in my view, had nothing to do with the latest Phase III drug trial, pharma merger, or biotech discovery. Indeed, it didn’t have anything do with a drug or insurance company at all. Rather, it was a sparsely attended, early evening panel led by the conference sponsor itself—which, on the face of it, would seem wearying enough. And this one had what may be the most unappetizing title of all: “Deferred Care: How Tax Refunds Enable Healthcare Spending and What To Do About It.” \nBut man, I can’t stop thinking about it. The frightening takeaway for this unfortunately named talk? Americans—of nearly every income bracket—are deferring, and sometimes skipping, the healthcare they need because they can’t afford the out-of-pocket costs. This is true when they’re insured. This is true when they’re employed. This is true for individuals aged 18 to 64—and wherever they reside in the U.S., it seems. It’s true, in other words, across the board. \nThe panel discussion featured some of the smartest folks in the health field—Dr. Toby Cosgrove, the pioneering heart surgeon and former CEO of Cleveland Clinic; Bob Kocher, the Venrock partner who helped shape the Affordable Care Act; Humana CEO Bruce Broussard, who’s very thoughtful on the healthcare value chain; and two JPM folks—Bei Ling, JPMorgan Chase’s global head of compensation and benefit, and moderator Diana Farrell, CEO of the JPMorgan Chase Institute (hereafter, please, JPMCI), the bank’s in-house socially minded think tank. \nAs good and lively as the discussion was, though, it was the underlying study by JPMCI that was so incredibly jarring. From the bank’s universe of 37 million checking account customers, the think tank’s researchers stripped identifiers and grabbed a sample of 2.3 million families across 23 U.S. states for whom they had “a very good window into their financial lives,” said Fiona Greig, JPMCI’s Director of Consumer Research, who presented the study’s key findings prior to the panel discussion. They then examined their bank deposits and balances as well as their debit card, credit card, and electronic payments to healthcare providers and drug stores, allowing the team to get what they called “a cash flow view of healthcare spending.” \nThis was a somewhat conservative estimate of that cash flow because it didn’t reflect every cash outlay or payments for things like health insurance premiums, but the patterns of personal financial liquidity were clear even without them. \nThen, somewhat ingeniously, the research team looked at what happened to that family cash flow in the days and months before and after their annual tax refund from the IRS—and how it affected their healthcare spending. “We focused on tax refunds because this is an important cash flow event for most families in the U.S.,” says Greig. “Seventy-three percent of tax filers receive an average tax refund on the order of $3,000”—and for some 40 percent of families “this is the single largest cash infusion of the entire year.” \nThe maximum number of people on any given day receiving a tax refund is just 4% of the population. “And the uncertainty with which that tax refund arrives is exactly what enables us to pin down the connection between cash flow dynamics and healthcare spending,” says Greig. “So we developed a first-ever look daily view of the healthcare spending in the 100 days prior to and after the arrival of that tax refund.” And the pattern is striking. Healthcare spending is relatively stable in those 100 days—but the day after the tax refund arrives, such spending shoots up by 60 percent. Moreover, it stays high for the next 75 days (to the tune of 20 percent above the baseline). “Now, we know that this is actually the cash that is enabling people to make this payment because when we look at a similar chart by payment channel, we see that healthcare spending on debit cards increased by 83%, and healthcare spending on electronic payments (online bill pay and the like) increases by 56%,” she says. “Credit card spending on healthcare, though, remains pretty flat throughout this time frame. So it is actually precisely the payment channels that require cash in the account to make the payment that are most sensitive to this.” \nFor lower income families, no surprise, the change was more stark. Account holders in the lowest checking account quintile (those with average balances of less than $536) increased their post-refund healthcare spending by a twentyfold factor larger than those with accounts in the highest quintile (balances over $3,577). \nAnd American families are not just deferring payments, they’re putting off care when cash flow is low. The team could tell that because of the large share of in-person payments to healthcare service providers in the wake of the refund. \nIt has long been known that many families don’t have enough cash on hand to cover a medical emergency. “Now we also see that a significant number of Americans put off going to the doctor and other routine health services until they actually have cash in their account, even when they know that it is coming,” said Farrell, in an accompanying press release to the study. \nThe full report is here and there’s a great data visualization with other findings here . Both are well worth the investment of time. Clifton Leaf, Editor in Chief, FORTUNE @CliftonLeaf DIGITAL HEALTH \nNew hopes for a cancer blood test? A new study is fueling optimism about developing a blood test which can detect cancers, according to a new report published in the journal Science . There’s still a long way to go before a “liquid biopsy” becomes reality and nixes the need for intrusive, expensive tests that involve removing actual tissue; but the experimental test can reportedly detect eight common cancers (including lung, breast, colon, pancreas, and liver cancer) and identify where they’re from in the body. ( NPR ) \nUnitedHealthcare, Fitbit team up on diabetes project. America’s largest health insurer, UnitedHealthcare, and Fitbit (via a partnership with glucose monitoring specialist DexCom) are launching a pilot program aimed at type 2 diabetes. The program will allow patients on Medicare Advantage plans supplied by UnitedHealthcare to track their blood sugar levels. “With more than 27 million people nationwide living with Type 2 diabetes there is urgent need to address this epidemic in new ways,” said Brian Thompson, CEO of UnitedHealthcare Medicare & Retirement, in a statement. “Continuous glucose monitoring can be a game changer for people enrolled in our Medicare Advantage plans, as the data can be translated into personalized information that can be acted upon in real time.” INDICATIONS \nDelaware the latest state to sue opioid manufacturers. The state of Delaware is suing drug makers like Purdue Phrama and Endo, as well as drug distributors such as McKesson and AmerisourceBergen, and retailers including CVS and Walgreens, for their alleged roles in fueling the U.S. opioid crisis. The lawsuit alleges that the companies either ignored warning signs, engaged in dangerous marketing campaigns, or otherwise failed to thwart (and even actively fueled) the prescription painkiller epidemic (the various involved parties deny wrongdoing but say they are concerned about the opioid crisis). That makes Delaware at least the 15th state to take legal action against opioid manufacturers and distributors. ( Reuters ) THE BIG PICTURE \nChildren’s health insurance, major agencies in the shutdown crosshairs. Will the federal government actually be funded tonight? We still have no idea; but one big political casualty in the absence of a deal could be the Children’s Health Insurance Program (CHIP), which, as we’ve noted on multiple occasions, provides health coverage to some nine million American children from low-income and middle class families. A government shutdown would also have more widespread effects for health care, including the furlough of about 50% of the Department of Health and Human Services’ staff . ( Fortune ) REQUIRED READING ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-22T03:39:50.046+02:00", "highlightTitle": ""}