{"organizations": [], "uuid": "7be6f0ce54cf39f27dab23f05ea8d3afd9cc294c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-vertiv-to-acquire-geist-expand-global-rack-pdu-portfolio.html", "country": "US", "domain_rank": 767, "title": "Vertiv to Acquire Geist, Expand Global Rack PDU Portfolio", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-24T20:00:00.000+02:00", "replies_count": 0, "uuid": "7be6f0ce54cf39f27dab23f05ea8d3afd9cc294c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-vertiv-to-acquire-geist-expand-global-rack-pdu-portfolio.html", "ord_in_thread": 0, "title": "Vertiv to Acquire Geist, Expand Global Rack PDU Portfolio", "locations": [], "entities": {"persons": [{"name": "geist", "sentiment": "negative"}, {"name": "rob johnson", "sentiment": "none"}, {"name": "vertiv", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}], "locations": [{"name": "olumbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "emerson network power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition will strengthen offerings for cloud, colocation and edge providers, strengthen channel\nCOLUMBUS, Ohio--(BUSINESS WIRE)-- Vertiv, formerly Emerson Network Power, has reached an agreement to purchase Lincoln, Nebraska-based Geist, a privately owned manufacturer of Rack Power Distribution Units (PDUs) and associated data center products.\nGeist is a market leader in Rack PDU products and has a broad portfolio of data center power, cooling, monitoring, and infrastructure management products that complement Vertiv’s own line of intelligent Rack PDUs. The acquisition will add engineering and design capabilities with patented Geist technologies, expand access to the channel, and solidify Vertiv as a global leader in the data center Rack PDU space.\n“This acquisition fits our strategy of adding complementary capabilities to accelerate growth in our key markets – cloud, colocation and edge,” said Vertiv CEO Rob Johnson. “By adding the Geist portfolio, we further strengthen our position in the PDU industry and add power management choices for our customers.”\nGeist is a global company headquartered in Lincoln, Nebraska, and has more than 250 employees. Geist president Brad Wilson will continue as manager of the business, reporting to Pat Johnson, executive vice president of integrated rack systems for Vertiv.\n“This is an important day for Geist, and I am excited to work with Vertiv to grow our businesses together and find creative ways to better serve our customers,” Wilson said. “This is a great fit between two companies, with complementary technology portfolios and a shared vision for a more efficient, more secure data center.”\nThe announcement of the Geist acquisition comes just a week after Vertiv announced the acquisition of Energy Labs, a privately owned, San Diego-based manufacturer of direct and indirect evaporative cooling systems.\n“These acquisitions represent a significant investment in our business and signal our intent to pursue an aggressive strategy for growth,” Johnson said.\n“Like Energy Labs last week, the acquisition of Geist adds to our strengths in technology innovation and customer-focused solutions and accelerates our growth agenda,” said Jacob Kotzubei, partner at Platinum Equity, majority owner of the Vertiv Group. “We look forward to working with our new colleagues at both companies and introducing our customers to an even more diverse, comprehensive set of solutions.”\nAbout Vertiv\nVertiv designs, builds and services critical infrastructure that enables vital applications for data centers, communication networks and commercial and industrial facilities. Formerly Emerson Network Power, Vertiv supports today’s growing mobile and cloud computing markets with a portfolio of power, thermal and infrastructure management solutions including the Chloride ® , Liebert ® , NetSure™ and Trellis™ brands. Sales in fiscal 2016 were $4.4 billion. For more information, visit VertivCo.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005103/en/\nFor Vertiv\nMark Berry, +614-383-1605\nMark.Berry@Fahlgren.com\nSource: Vertiv", "external_links": ["http://www.businesswire.com/news/home/20180124005103/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fvertivco.com%2F&esheet=51747603&newsitemid=20180124005103&lan=en-US&anchor=VertivCo.com&index=1&md5=05583a8bcca849df61e4cd762ffbd22b"], "published": "2018-01-24T20:00:00.000+02:00", "crawled": "2018-01-24T20:59:10.017+02:00", "highlightTitle": ""}