{"organizations": [], "uuid": "eaaf6fe88824f12bcdd5c216fc36b9a054675c43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-latam-politics-disaster-analysis/ballot-box-key-to-bridging-latin-americas-stark-social-divide-idUSKBN1F11XY", "country": "US", "domain_rank": 408, "title": "Ballot box key to bridging Latin America's stark social divide", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-12T23:39:00.000+02:00", "replies_count": 0, "uuid": "eaaf6fe88824f12bcdd5c216fc36b9a054675c43"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-latam-politics-disaster-analysis/ballot-box-key-to-bridging-latin-americas-stark-social-divide-idUSKBN1F11XY", "ord_in_thread": 0, "title": "Ballot box key to bridging Latin America's stark social divide", "locations": [], "entities": {"persons": [{"name": "jason marczak", "sentiment": "none"}], "locations": [{"name": "tepic", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "positive"}, {"name": "atlantic council’s adrienne arsht latin america center", "sentiment": "none"}, {"name": "transparency international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEPIC, Mexico (Thomson Reuters Foundation) - Elections across Latin America could help clean up rampant corruption fuelling the region’s deep social and economic divide as millions vote this year, while Venezuela’s crisis poses the biggest humanitarian threat, analysts and aid workers said.\n“Corruption is the scourge of Latin America. The average person might see corruption as something elites do,” said Jason Marczak, director of the Atlantic Council’s Adrienne Arsht Latin America Center.\n“More dramatically, it affects those who are less well off. Pilfering of state resources for corrupt reasons means less money is available for public schools or for transportation.”\nA report by anti-corruption group Transparency International last October showed roughly one-in-three Latin Americans paid a bribe in the previous year to a public employee, from police officers to teachers and hospital workers.\nDespite a brightening economic picture, many countries need to do more to reduce the huge gap between rich and poor in the world’s most unequal region while ramping up spending on critical infrastructure, health and education, experts said.\nWith poverty levels expected to remain broadly stable, they urged governments to increase longer-term investment in skills development to make sure Latin Americans can maintain their livelihoods and improve living standards.\n“There is a big challenge in terms of human capital formation in Latin America,” said Hugo Nopo, research economist at GRADE, a Lima-based development analysis organization. “The problem now is that every single additional reduction in poverty is going to be harder to get.”\nSIX ELECTIONS This year’s six main polls could see more anti-establishment leaders coming to office, and socio-economic policies in countries including Mexico more targeted at those who have been “left behind”, said the Atlantic Council’s Marczak.\nLeftist front-runner Andres Manuel Lopez Obrador has vowed to tackle corruption and boost social spending in Mexico if he wins the July vote to govern the country, where cartel violence has pushed murder rates to a record high.\nBrazilians will cast their vote in October as unemployment starts to fall and harsh recession ends in the country shaken by the “Car Wash” bribery case that nearly toppled its president and ensnared politicians and elites across Latin America.\nColombians will vote for the first time since a 2016 peace deal with the Marxist Revolutionary Armed Forces of Colombia (FARC), which is fielding a candidate for the May poll. Votes are also scheduled for Costa Rica, Paraguay and Venezuela.\n“It’s kind of 50/50 at this point, some (countries)... are really moving forward - people’s lives are improving greatly - and then you have these other countries that are of real concern,” said Kate Schecter, chief executive of World Neighbors, a non-profit group working with poor communities in Latin America and the Caribbean.\nMany fear the humanitarian crisis in Venezuela could deepen even further this year as sanctions grip and its oil-based economy continues to crumble after years of painful recession.\nThousands have left the country where crippling food shortages, the world’s highest inflation rate and a near-collapse of the health system are compounded by violence, which has made Caracas the world’s most dangerous city.\n“The prognosis for 2018 is further deterioration, humanitarian emergency, and an increased exodus of Venezuelans,” Robert Malley, chief executive of International Crisis Group, said in a report.\n“Sustained domestic and international pressure - as well as guarantees of future immunity - will be required to push the government toward credible presidential elections.”\nRESILIENCE REQUIRED In Central America, the gang violence and migrant crisis plaguing the disaster-prone region, together with the growing impacts of climate change, are making it harder to keep people safe, aid workers said.\nViolence, corruption, hunger and water shortages in the “Northern Triangle” of El Salvador, Honduras and Guatemala are expected to continue forcing people to migrate north, despite increasing deportations from the United States.\nWalter Cotte, Americas director for the International Federation of Red Cross and Red Crescent Societies (IFRC), warned that U.S. President Donald Trump’s decision to end temporary protected status for 200,000 Salvadorans in 2019 could create a “dangerous situation” as remittances dry up and returnees put pressure on El Salvador.\nMore widely, as shown by last year’s string of disasters - from earthquakes, hurricanes and fires to floods and droughts - the majority of Latin American nations still lack effective plans for disaster risk reduction and recovery, he said.\nWhile the Caribbean has vowed to become the world’s first “climate-resilient region” in 2018 after last year’s devastating hurricanes, only about 10 countries in the region have robust disaster prevention and management capacities, said Cotte.\nEcuador is making strides but Peru and Brazil both need more systemic approaches to managing disaster risks, he said.\nSome 15 countries “are really in the nursery”, lacking the resources, systems and experience to cope with a predicted rise in disasters, he added.\n“Resilience isn’t happening if you don’t have better leadership in policies,” said Cotte.\nWith Latin America increasingly “at the end of the queue” for aid and investment dollars, more money for projects to boost resilience needs to come from within the region and be better coordinated to help vulnerable communities, he noted.\nReporting by Sophie Hares; editing by Megan Rowling. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/\n ", "external_links": ["http://news.trust.org/", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T23:39:00.000+02:00", "crawled": "2018-01-13T14:45:01.005+02:00", "highlightTitle": ""}