{"organizations": [], "uuid": "1229a387bd8296573e0ea6c00a8ba13b9f0f3c67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-poland-hungary-hit-record-highs-on-global-stock-rally-idUSL8N1PI2AD", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Poland, Hungary hit record highs on global stock rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:50:00.000+02:00", "replies_count": 0, "uuid": "1229a387bd8296573e0ea6c00a8ba13b9f0f3c67"}, "author": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-poland-hungary-hit-record-highs-on-global-stock-rally-idUSL8N1PI2AD", "ord_in_thread": 0, "title": "CEE MARKETS-Poland, Hungary hit record highs on global stock rally", "locations": [], "entities": {"persons": [{"name": "zoltan varga", "sentiment": "none"}, {"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "central europe", "sentiment": "none"}], "organizations": [{"name": "otp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:51 AM / in 8 minutes CEE MARKETS-Poland, Hungary hit record highs on global stock rally Reuters Staff 7 Min Read * Indices in Budapest, Warsaw reach record high on banks * Tehcnical factors also help Budapest blue chips * Czech markets ignore presidential, PM uncertainty * Hungarian government bond yields retreat after surge By Sandor Peto BUDAPEST, Jan 23 (Reuters) - Polish and Hungarian stocks hit record highs on Tuesday, helped by a positive mood in global equities markets, optimism over local economic fundamentals and some short position closing. The Warsaw stock exchange's main index rose by almost one percent to an all-time high and the blue chip index reached its highest level since mid-2011, driven by financial sector shares. Other regional indices gained less, but Budapest set another record high, driven by a continuing rally of OTP , Central Europe's biggest independent bank, to a record high of 11,520 forints ($45.47). \"In the longer term, the bank stock can even reach 12,000 forints,\" Equilor brokerage analyst Zoltan Varga said in a note. He said technical factors had also helped oil group MOL's stock, and Magyar Telekom Stocks in Asian emerging markets hit record highs after Wall Street was boosted by a deal in the U.S. Senate to end a brief government shutdown. Elsewhere in Central Europe, stocks in Prague rose to their highest level since 2011, disregarding political uncertainty ahead of presidential elections at the end of the week. Independent challenger Jiri Drahos holds a narrow lead over incumbent president Milos Zeman, an opinion poll showed on Monday. Zeman said he will re-appoint Andrej Babis, whose government lost a parliament confidence vote last week, as prime minister regardless of whether he wins a new presidential term. Drahos has said he would advise Babis not to seek the premiership while he defends himself from police allegations of EU subsidy fraud. Amid a global stock rally last year, investors usually ignored political jitters in Central Europe, apart from Romania where concerns over corruption and a reform of the judiciary are coupled with worries that the economy is overheating. Bucharest stocks were flat at 0922 GMT, even though they set a 7-month high in early trade. Central European currencies were mostly slightly weaker as the dollar attracted some buying in international markets. In government bond markets, Hungary's long-term government bonds consolidated after a surge in yields since Thursday when supply and conditions at a new interest rate swap (IRS) facility of the Hungarian central bank disappointed. \"Positions and heads have got cleaner,\" one Budapest-based fixed income trader said. Yields were flat from Monday's close, but 7-8 basis points below their peak in the previous session, the trader said. 10-year benchmark paper traded at a yield of 2.12 percent. CEE SNAPSHOT AT MARKETS 1022 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.4240 25.4090 -0.06% +0.46% crown > Hungary <EURHUF= 310.2000 309.7900 -0.13% +0.23% forint > Polish <EURPLN= 4.1725 4.1687 -0.09% +0.09% zloty > Romanian <EURRON= 4.6655 4.6690 +0.08% +0.30% leu > Croatian <EURHRK= 7.4340 7.4345 +0.01% -0.05% kuna > Serbian <EURRSD= 118.5000 118.7500 +0.21% +0.00% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1134.50 1132.800 +0.15% +5.23% 0 Budapest 41053.62 41002.39 +0.12% +4.26% Warsaw 2646.53 2620.87 +0.98% +7.53% Bucharest 8488.15 8490.52 -0.03% +9.47% Ljubljana <.SBITOP 834.85 836.11 -0.15% +3.53% > Zagreb 1871.03 1869.57 +0.08% +1.53% Belgrade <.BELEX1 775.25 776.31 -0.14% +2.03% 5> Sofia 709.15 708.02 +0.16% +4.68% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.5390 -0.0020 +115bps +0bps R> 5-year <CZ5YT=R 1.0390 -0.0100 +120bps +0bps R> 10-year <CZ10YT= 1.8030 0.0360 +126bps +5bps RR> Poland 2-year <PL2YT=R 1.5490 -0.0080 +216bps -1bps R> 5-year <PL5YT=R 2.6310 -0.0230 +279bps -1bps R> 10-year <PL10YT= 3.3240 0.0040 +278bps +2bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.01 1.19 1.35 0.77 <PRIBOR= > Hungary 0.07 0.12 0.16 0.02 Poland 1.75 1.77 1.86 1.72 Note: FRA are for ask prices quotes", "external_links": [], "published": "2018-01-23T11:50:00.000+02:00", "crawled": "2018-01-23T12:02:33.003+02:00", "highlightTitle": ""}