{"organizations": [], "uuid": "0a5ac633c4c78f75833a2a3b2e6f452ef8a10555", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225228856&w=1200&r=LYNXMPEE0O1G9", "site_section": "http://feeds.reuters.com/reuters/INhollywood\r", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/people-russell-simmons/russell-simmons-denies-latest-womans-claim-that-he-raped-her-idINKBN1FE2OW", "country": "US", "domain_rank": 408, "title": "Russell Simmons denies latest woman's claim that he raped her", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:04:00.000+02:00", "replies_count": 0, "uuid": "0a5ac633c4c78f75833a2a3b2e6f452ef8a10555"}, "author": "", "url": "https://in.reuters.com/article/people-russell-simmons/russell-simmons-denies-latest-womans-claim-that-he-raped-her-idINKBN1FE2OW", "ord_in_thread": 0, "title": "Russell Simmons denies latest woman's claim that he raped her", "locations": [], "entities": {"persons": [{"name": "russell simmons", "sentiment": "negative"}, {"name": "jennifer jasorik", "sentiment": "none"}, {"name": "jasorik", "sentiment": "none"}, {"name": "simmons", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "def jam records", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Hip hop music producer Russell Simmons on Thursday denied an accusation levelled in a civil lawsuit that he raped an aspiring documentary film maker at his Los Angeles home in 2016, the latest of several women to claim they were sexually abused by the music and film producer.\nThe filmmaker, Jennifer Jasorik, filed the suit on Wednesday in Los Angeles federal court, accusing Simmons of forcing her to have sex with him after she had refused his advance.\n“Simmons got aggressive and pushed plaintiff on his bed,” said the complaint Jasorik, 37, filed against Simmons. The lawsuit accused Simmons of violently knocking Jasorik to a bed before sexually assaulting her.\nThe 60-year-old co-founder of Def Jam Records denied the claim, as he has in response to the previous allegations of sexual abuse and rape.\n“I am confident that when all is said and all is done, it will be as clear to others as it is to me that I did not do what this lawsuit accuses me of doing,” Simmons said in a statement emailed a spokesman.\nReuters could not independently confirm the accusation.\nThe suit, which seeks $5 million in punitive damages plus other unspecified damages, says Simmons was co-producing and financing a documentary Jasorik was working on after they met in New York in 2016.\nJasorik said she disclosed the in August 2016 encounter only to a few close friends and has since suffered from “severe and permanent emotional and mental distress and anguish, humiliation, embarrassment, fright, discomfort, anxiety and depression,” which has impaired her ability to work.\nLast month, nine women accused Simmons of sexual misconduct dating back to 1983, including four who said he raped them. New York police said they have opened an investigation.\nMultiple accusations of sexual misconduct against male actors, filmmakers and agents have roiled Hollywood since October 2017, leading to many major players being fired, forced to step down, or dropped from creative projects.\nIn the United States, the scandal has also engulfed men in politics, business and the workplace, inspiring a widespread #MeToo social media movement by victims of sexual harassment or abuse.\nReporting by Peter Szekely in New York; editing by Clive McKeef\n ", "external_links": [], "published": "2018-01-25T20:04:00.000+02:00", "crawled": "2018-01-25T20:35:00.025+02:00", "highlightTitle": ""}