{"organizations": [], "uuid": "983f6122647f86a1de49b5e026cb5c6b643f4b33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 154, "shares": 154, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/26/104916788-RTX3LU4W.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/north-korea-reopens-cross-border-communications-with-south-korea.html", "country": "US", "domain_rank": 767, "title": "North Korea reopens cross-border communications with South Korea", "performance_score": 1, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-03T10:14:00.000+02:00", "replies_count": 0, "uuid": "983f6122647f86a1de49b5e026cb5c6b643f4b33"}, "author": "Kcna", "url": "https://www.cnbc.com/2018/01/03/north-korea-reopens-cross-border-communications-with-south-korea.html", "ord_in_thread": 0, "title": "North Korea reopens cross-border communications with South Korea", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "positive"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "south korea india north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "kcna", "sentiment": "none"}, {"name": "korean central news agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North Korean leader Kim Jong Un reopened a key cross-border communication channel with South Korea for the first time in nearly two years Wednesday as the rivals explored the possibility of sitting down and talking after months of acrimony and fears of war.\nEven among the sudden signs of easing animosity, however, President Donald Trump threatened Kim with nuclear war.\nIn his New Year's address Monday, Kim said he was willing to send a delegation to next month's Winter Olympics in South Korea . But he also said he has a \"nuclear button\" on his desk and that all U.S. territory is within striking distance of his nuclear weapons, comments Trump latched onto Tuesday when he boasted of a bigger and more powerful \"nuclear button\" than Kim's.\nThe two leaders exchanged crude insults last year, after the North received new U.N. sanctions over its sixth and most powerful nuclear test explosion and a series of intercontinental ballistic launches.\nThe recent softening of contact between the rival Koreas may show a shared interest in improved ties, but there's no guarantee tensions will ease. There have been repeated attempts in recent years by the rivals to talk, but even when they do meet, the efforts often end in recriminations and stalemate.\nGetty Images In this handout image provided by the South Korean Unification Ministry, A South Korean government official checks the direct communications hotline to talk with the North Korean side at the border village of Panmunjom on January 3, 2018 in Panmunjom, South Korea. Outside critics say Kim may be trying to use better ties with South Korea as a way to weaken the alliance between Washington and Seoul as the North grapples with toughened international sanctions over its nuclear and missile programs.\nKim's latest announcement, which was read by a senior Pyongyang official on state TV, followed a South Korean offer on Tuesday of high-level talks with North Korea to find ways to cooperate on next month's Winter Olympics in the South and discuss other inter-Korean issues.\nRi Son Gwon, chairman of the state-run Committee for the Peaceful Reunification, cited Kim as welcoming South Korea's overture and ordering officials to reopen a communication channel at the border village of Panmunjom. Ri also Quote: d Kim as ordering officials to promptly take substantial measures with South Korea out of a \"sincere stand and honest attitude,\" according to the North's state TV and news agency.\nSouth Korea quickly welcomed Kim's decision and later confirmed that the two Koreas began preliminary contacts on the channel.\nSince taking office last May, South Korea's liberal President Moon Jae-in has pushed hard to improve ties and resume stalled cooperation projects with North Korea. Pyongyang had not responded to his outreach until Kim's New Year's address.\nRelations between the Koreas soured under Moon's conservative predecessors, who responded to the North's expanding nuclear program with hard-line measures. All major rapprochement projects were put on hold one by one, and the Panmunjom communication channel has been suspended since February 2016.\nMoon has pushed for more pressure and sanctions on North Korea, but he still favors dialogue as a way to resolve the nuclear standoff. The Trump administration says all options are on the table, including military measures against the North. Moon has repeatedly said he opposes any war on the Korean Peninsula.\nSome observers believe these differences in views may have led Kim to think he could drive a wedge between Seoul and Washington as a way to weaken their alliance and international sanctions.\nTalks could provide a temporary thaw in strained inter-Korean ties, but conservative critics worry that they may only earn the North time to perfect its nuclear weapons.\nAfter the Olympics, inter-Korean ties could become frosty again because the North has made it clear it has no intention of accepting international calls for nuclear disarmament and instead wants to bolster its weapons arsenal in the face of what it considers increasing U.S. threats, analysts say.", "external_links": [], "published": "2018-01-03T10:14:00.000+02:00", "crawled": "2018-01-03T10:14:26.026+02:00", "highlightTitle": ""}