{"organizations": [], "uuid": "395beeaa1ee76faba32d5fa0d4a12220b44d6009", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 283, "shares": 283, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224948882&w=1200&r=LYNXMPEE0N298", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-tax-states-legislation-explainer/explainer-more-u-s-states-eye-donations-to-evade-trump-tax-changes-idUSKBN1FD35D", "country": "US", "domain_rank": 408, "title": "Explainer: More U.S. states eye donations to evade Trump tax changes", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:30:00.000+02:00", "replies_count": 0, "uuid": "395beeaa1ee76faba32d5fa0d4a12220b44d6009"}, "author": "", "url": "https://www.reuters.com/article/us-usa-tax-states-legislation-explainer/explainer-more-u-s-states-eye-donations-to-evade-trump-tax-changes-idUSKBN1FD35D", "ord_in_thread": 0, "title": "Explainer: More U.S. states eye donations to evade Trump tax changes", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "de trump", "sentiment": "none"}, {"name": "karen pierog", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "cali", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "nebraska", "sentiment": "none"}], "organizations": [{"name": "national conference of state legislatures", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - Legislation that first surfaced in California to give taxpayers a way to avoid the new cap on state and local tax (SALT) deductions by making charitable donations has popped up in four more states so far, with others reviewing alternative methods.\nChanges to the U.S. tax system signed into law by President Donald Trump in December have sparked a furious search in states with high income and property taxes for loopholes to help residents replicate the benefits taken away by the $10,000 cap on federal SALT deductions.\nBills in Illinois, Nebraska, Virginia and Washington are similar to the California measure, which would allow residents to donate to a new state public-purpose “excellence fund” and receive a dollar-for-dollar tax credit in return, according to the National Conference of State Legislatures.\nTaxpayers would then benefit by deducting their donations to these new state funds from their federal taxes.\nIn California, Democratic Senate President Pro Tempore Kevin de León introduced a bill on Jan. 4, citing about 6 million California taxpayers, a third of the total, who itemized deductions on their tax returns, claiming an average of $18,438 for state and local taxes.\nThe measure has been passed by two committees and is up for a vote by the full Senate.\nAn “excellence fund” would also be created under bills in Illinois, Nebraska and Washington, while Virginia would have a “competitiveness fund.” Contributions by taxpayers to the funds would be earmarked for public purposes within each state.\nJared Walczak, a senior policy analyst at the nonprofit Tax Foundation, predicted that if enacted into law, the measures’ usefulness to taxpayers will be ultimately shot down by the Internal Revenue Service.\n“Just fundamentally, the IRS will see right through this,” he said on Wednesday, pointing out that the federal agency requires charitable contributions to have genuine charitable intent and purpose.\nInstead, the various bills basically recharacterize tax payments without changing the amount of money received by the state, according to Walczak.\n“There has to be an actual benefit to the recipient and the only beneficiary here is the donor,” he said, adding that he expects the IRS will advise taxpayers against pursuing these kinds of options starting with the 2018 tax year.\nIllinois State Representative Jonathan Carroll, a Democrat, said he used the California measure as a starting point for his bill, which in addition to creating a fund and tax credits for state income taxes, would also allow individual counties to create funds and tax credits for local property taxes.\n“My focus is the taxpayers of Illinois and not what the IRS decides to do,” he said.\nWhile Washington does not have a state income tax, a bill filed there would create a sales and use tax exemption that matches donations to the state fund.\nPAYROLL TAX OPTION The state of New York is also looking at ways to respond to effects of the federal tax bill. Governor Andrew Cuomo has proposed using a payroll tax as an alternative to the income tax, and expanding opportunities for charitable deductions.\n“We have the opportunity to amend our executive budget within 30 days and we expect to include legislation within that window,” Morris Peters, a spokesman for New York’s Division of the Budget, said in an email on Tuesday.\nJames Parrott, director of economic and fiscal policies at the Center for New York City Affairs at The New School, said the proposals for the payroll tax and charitable deductions were “inherently problematic” and “shouldn’t be rushed.”\nReporting by Karen Pierog; additional reporting by Stephanie Kelly in New York; Editing by Daniel Bases and Matthew Lewis\n ", "external_links": [], "published": "2018-01-25T00:30:00.000+02:00", "crawled": "2018-01-25T00:34:27.000+02:00", "highlightTitle": ""}