{"organizations": [], "uuid": "1a1bf707e5a380b9b7665321d91f526eff833798", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-israel-cenbank-shekel/bank-of-israel-computer-driven-trading-is-boosting-shekel-idUKKBN1FA0TZ", "country": "US", "domain_rank": 408, "title": "Bank of Israel: Computer driven trading is boosting shekel", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T18:04:00.000+02:00", "replies_count": 0, "uuid": "1a1bf707e5a380b9b7665321d91f526eff833798"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-cenbank-shekel/bank-of-israel-computer-driven-trading-is-boosting-shekel-idUKKBN1FA0TZ", "ord_in_thread": 0, "title": "Bank of Israel: Computer driven trading is boosting shekel", "locations": [], "entities": {"persons": [{"name": "steven scheer", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "bank of israel", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  jerusalem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 4:05 PM / Updated 26 minutes ago Bank of Israel: Computer driven trading is boosting shekel Steven Scheer 3 Min Read \nJERUSALEM (Reuters) - The Bank of Israel on Sunday said currency trading driven by computer models has jumped and is helping to keep the shekel ILS= overvalued, after it appreciated 11 percent against the dollar in 2017. \nThe central bank said it has monitored every conversion transaction between Israeli and foreign currencies, as well as every deal involving the Israeli currency in foreign currency, index, and interest rate derivatives. \nIsraelis and foreigners who carry out a foreign currency derivative transaction have been required to report such deals to the central bank for the past year. \n“In the last month, we have seen a large increase in interest in the shekel by model-driven accounts. This would appear to have been one of the factors behind the shekel’s appreciation,” the Bank of Israel told Reuters in an emailed statement. \nThe shekel rose to a 3-1/2 year high against the dollar in 2017, while it gained 5 percent versus a basket of currencies of Israel’s main trading partners. In 2018, the shekel is up nearly 2 percent against the dollar to 3.41. \nBecause the central bank thinks the gains are not necessarily down to economic issues, such as the current account surplus, it has been buying foreign currency to prevent a more rapid appreciation, given that a strong shekel is harming exports. \n“Notwithstanding the improvement in the state of the economy, which is a basic factor in the strengthening of the shekel, the shekel remains over-valued,” the Bank of Israel said. \nIt said it “will continue to intervene in the market, as it has done recently, as long as there are exchange rate fluctuations that are not in line with economic fundamentals”. \nWhile in the past domestic banks dominated currency trading, offshore players have now boosted activity by about 40 percent, the bank said. \nBank of Israel Governor, Karnit Flug, referred to speculators in a speech earlier this month. \n“We have identified players that are not necessarily connected to real trading activity ... and we have also intervened in this regard,” she said, adding that lingering expansionary monetary policies taken by some countries are also propping up the shekel. Editing by Elaine Hardcastle", "external_links": [], "published": "2018-01-21T18:04:00.000+02:00", "crawled": "2018-01-21T18:22:31.011+02:00", "highlightTitle": ""}