{"organizations": [], "uuid": "cb94484e9bed6f47d496c7b8785bd3c8a9977516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-eclipse-resources-announces-2018-analyst-day-and-completion-of-acquisition-of-aflat-castlea-utica-development-area-in.html", "country": "US", "domain_rank": 767, "title": "Eclipse Resources Announces 2018 Analyst Day and Completion of Acquisition of “Flat Castle” Utica Development Area in Central Pennsylvania", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.495, "site_type": "news", "published": "2018-01-23T00:15:00.000+02:00", "replies_count": 0, "uuid": "cb94484e9bed6f47d496c7b8785bd3c8a9977516"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-eclipse-resources-announces-2018-analyst-day-and-completion-of-acquisition-of-aflat-castlea-utica-development-area-in.html", "ord_in_thread": 0, "title": "Eclipse Resources Announces 2018 Analyst Day and Completion of Acquisition of “Flat Castle” Utica Development Area in Central Pennsylvania", "locations": [], "entities": {"persons": [{"name": "potter", "sentiment": "none"}], "locations": [{"name": "central pennsylvania state college", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "jw marriott hotel", "sentiment": "none"}, {"name": "tioga", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "eclipse resources corporation", "sentiment": "neutral"}, {"name": "utica development area", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "eclipse resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STATE COLLEGE, Pa.--(BUSINESS WIRE)-- Eclipse Resources Corporation (NYSE:ECR) (the “Company” or “Eclipse Resources”) announced today that it will host its 2018 Analyst Day on Wednesday, January 31st at the JW Marriott Hotel in Houston, Texas. A live audio webcast of the event will begin at 9:00 am (Central Time) and can be accessed via the “Investors” section of Eclipse Resources’ website at www.eclipseresources.com . The Company plans to post the Analyst Day Presentation to the “Investors” section of the Company’s website prior to the event.\nAdditionally, Eclipse Resources is pleased to announce that on January 18, 2018 Eclipse Resources-PA, LP, a wholly owned subsidiary of the Company, completed its previously announced acquisition of certain oil and gas leases, wells and other oil and gas rights and interests covering approximately 44,500 net acres located in the counties of Tioga and Potter in the Commonwealth of Pennsylvania (such transaction, the “Flat Castle Acquisition”) from Travis Peak Resources, LLC. The aggregate adjusted purchase price for the Flat Castle Acquisition was $92.2 million, which was paid entirely with approximately 37.8 million shares of Eclipse Resources’ common stock.\nBenjamin W. Hulburt, Chairman, President and CEO of Eclipse Resources, commented on the Company’s acquisition, “The Flat Castle acquisition will create a new, highly contiguous core area that significantly expands our Utica Shale dry gas acreage by almost 104%. The Company intends to utilize innovative drilling and completion techniques and extensive Super-Lateral development to considerably enhance the economics of the area. We anticipate our first well to spud in the Flat Castle project area during the first quarter of 2018.”\nAbout Eclipse Resources\nEclipse Resources is an independent exploration and production company engaged in the acquisition and development of oil and natural gas properties in the Appalachian Basin, including the Utica and Marcellus Shales. For more information, please visit the Company’s website at www.eclipseresources.com .\nForward-Looking Statements\nThis press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”) and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements, other than statements of historical fact included in this press release, regarding Eclipse Resources’ strategy, future operations, financial position, estimated revenues and income/losses, projected costs and capital expenditures, prospects, plans and objectives of management are forward-looking statements. When used in this press release, the words “plan,” “endeavor,” “will,” “would,” “could,” “believe,” “anticipate,” “intend,” “estimate,” “expect,” “project” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain such identifying words. These forward-looking statements are based on Eclipse Resources’ current expectations and assumptions about future events and are based on currently available information as to the outcome and timing of future events. When considering forward-looking statements, you should keep in mind the risk factors and other cautionary statements described under the heading “Risk Factors” in Eclipse Resources’ Annual Report on Form 10-K filed with the Securities Exchange Commission on March 3, 2017 (the “2016 Annual Report”), and in “Item 1A. Risk Factors” of Eclipse Resources’ Quarterly Reports on Form 10-Q.\nForward-looking statements may include, but are not limited to, statements about Eclipse Resources’ business strategy; reserves; the expected benefits of the Flat Castle Acquisition and its impact on the Company’s business, operations and assets; general economic conditions; financial strategy, liquidity and capital required for developing its properties and timing related thereto; realized natural gas, natural gas liquids and oil prices; timing and amount of future production of natural gas, NGLs and oil; its hedging strategy and results; future drilling plans; competition and government regulations, including those related to hydraulic fracturing; the anticipated benefits under its commercial agreements; marketing of natural gas, NGLs and oil; leasehold and business acquisitions; the costs, terms and availability of gathering, processing, fractionation and other midstream services; general economic conditions; credit markets; uncertainty regarding its future operating results, including initial production rates and liquid yields in its type curve areas; and plans, objectives, expectations and intentions contained in this press release that are not historical.\nEclipse Resources cautions you that the forward-look statements pertaining to the Flat Castle Acquisition described herein are subject to risks and uncertainties, including, without limitation, the Company’s failure to realize the expected benefits of such transaction, the Company’s ability to successfully integrate the acquired assets, negative effects of the consummation of such transaction on the market price of the Company’s common stock, and significant transaction costs, unknown liabilities and/or unanticipated expenses such as litigation expenses. In addition, all forward-looking statements are subject to risks and uncertainties, most of which are difficult to predict and many of which are beyond the Company’s control, incident to the exploration for and development, production, gathering and sale of natural gas, NGLs and oil. These risks include, but are not limited to, legal and environmental risks, drilling and other operating risks, regulatory changes, commodity price volatility and the recent significant decline of the price of natural gas, NGLs, and oil, inflation, lack of availability of drilling, production and processing equipment and services, counterparty credit risk, the uncertainty inherent in estimating natural gas, NGLs and oil reserves and in projecting future rates of production, cash flow and access to capital, the timing of development expenditures, and the other risks described under the heading “Risk Factors” in the 2016 Annual Report and in “Item 1A. Risk Factors” of Eclipse Resources’ Quarterly Reports on Form 10-Q.\nAll forward-looking statements, expressed or implied, included in this press release are expressly qualified in their entirety by this cautionary statement. This cautionary statement should also be considered in connection with any subsequent written or oral forward-looking statements that Eclipse Resources or persons acting on the Company’s behalf may issue. Except as otherwise required by applicable law, Eclipse Resources disclaims any duty to update any forward-looking statements to reflect events or circumstances after the date of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006341/en/\nEclipse Resources Corporation\nDouglas Kris, Investor Relations, 814-325-2059\ndkris@eclipseresources.com\nSource: Eclipse Resources Corporation", "external_links": ["http://www.businesswire.com/news/home/20180122006341/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.eclipseresources.com&esheet=51746795&newsitemid=20180122006341&lan=en-US&anchor=www.eclipseresources.com&index=1&md5=39dbcb7c5a5f5476d9ea5bfc4d348811", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.eclipseresources.com&esheet=51746795&newsitemid=20180122006341&lan=en-US&anchor=www.eclipseresources.com&index=2&md5=86adc1dc72a5338211ce97c0447d3b68"], "published": "2018-01-23T00:15:00.000+02:00", "crawled": "2018-01-23T02:16:58.013+02:00", "highlightTitle": ""}