{"organizations": [], "uuid": "9dcb253f821106bf9290702e13e8997e27029814", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-tandem-diabetes-care-announces-preliminary-2017-results-and-provides-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Tandem Diabetes Care Announces Preliminary 2017 Results and Provides 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:15:00.000+02:00", "replies_count": 0, "uuid": "9dcb253f821106bf9290702e13e8997e27029814"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-tandem-diabetes-care-announces-preliminary-2017-results-and-provides-2018-guidance.html", "ord_in_thread": 0, "title": "Tandem Diabetes Care Announces Preliminary 2017 Results and Provides 2018 Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Guidance for 2018 Reflects Expectation of Continued Growth\nSAN DIEGO--(BUSINESS WIRE)-- Tandem Diabetes Care®, Inc. (NASDAQ: TNDM), a medical device company and manufacturer of the only touchscreen insulin pumps available in the United States, today reported select, unaudited and preliminary results for the year and quarter ended December 31, 2017.\nIn comparing the fourth quarter of 2017 to the same period of 2016:\nGAAP sales increased to approximately $39 million to $40 million from $28.9 million Non-GAAP sales increased to approximately $39 million to $40 million from $24.8 million Pump shipments increased to approximately 7,000 pumps from 4,418 pumps\nIn comparing the year ended December 31, 2017 to the year ended December 31, 2016:\nGAAP sales increased to approximately $106 million to $107 million from $84.2 million Non-GAAP sales increased to approximately $101 million to $102 million from $88.5 million Pump shipments increased to approximately 17,100 pumps from 16,938 pumps\n“Our 2017 momentum culminated in the fourth quarter with high demand for the t:slim X2 Insulin Pump. In addition, our infusion set sales doubled in the fourth quarter compared to last year, resulting from a shift in our business model that we expect will not only bolster our revenue growth in 2018, but also accelerate our path to profitability,” said Kim Blickenstaff, President and CEO. “As a reflection of my confidence in our strategies, I volunteered to reduce my 2018 salary to $1.00, with any additional cash compensation contingent on our ability to successfully achieve key financial goals this year.”\nAs of December 31, 2017, the Company had approximately $24.2 million in cash, cash equivalents, short-term investments and restricted cash.\n2018 Preliminary Guidance\nFor the year ending December 31, 2018, GAAP sales are estimated to be in the range of $132 million to $140 million, an estimated year-over-year increase of approximately 23 percent to 32 percent to our preliminary 2017 GAAP sales. When comparing to our preliminary 2017 sales on a non-GAAP basis, the estimated year-over-year increase is approximately 29 percent to 39 percent.\n“With our robust product pipeline and increasing number of customer renewal opportunities, growth remains a top focus, but equally so is closely managing our expenses as we leverage our existing infrastructure in 2018,” said Leigh Vosseller, Senior Vice President and Chief Financial Officer. “We believe our early investments have well-positioned the Company to achieve and support the scale necessary to reach our profitability goals, and we expect to make meaningful progress in reducing our cash use in 2018.”\nFourth Quarter and Full Year 2017 Earnings Conference Call\nThe Company intends to report its fourth quarter and full year 2017 financial and operating results on Thursday, March 1, 2018 after the markets close. Management intends to host a conference call at 4:30PM Eastern Time (1:30PM Pacific Time) on that day. More details will be forthcoming.\nUse of Non-GAAP Financial Measures\nThe Company presents historical non-GAAP financial measures in this press release to provide information that may assist investors in understanding its financial results, assessing its prospects for future performance and allowing for a meaningful comparison of projected to historical results. In July 2016, the Company began offering a Technology Upgrade Program to eligible customers to provide a pathway to ownership of the t:slim X2 TM Insulin Pump, which launched in October 2016. The Technology Upgrade Program created unpredictable GAAP results for its duration. This was principally due to accounting complexities associated with the program that were dependent on a number of future events and variables that were initially difficult to estimate or predict. The program expired on September 30, 2017. Due to these accounting complexities, the Company has provided preliminary results for the year ending December 31, 2017 on a GAAP and non-GAAP basis, which excludes the impact of the Technology Upgrade Program.\nThese non-GAAP financial measures were used internally by the Company to analyze its operating performance for the duration of the Technology Upgrade Program. The non-GAAP financial information is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. To the extent the Company utilizes such non-GAAP financial measures in the future, it expects to calculate them using a consistent method from period to period.\nReconciliation of GAAP versus Non-GAAP Financial Results\nThree Months Ended Twelve Months Ended December 31, December 31, (in millions)\n2017 1 2016 2017 1 2016 GAAP Sales $ 39.0 - $40.0 $ 28.9 $ 106.0 - $107.0 $ 84.2 Impact of Technology Upgrade Program - (4.1) (5.0 ) 4.3 Non-GAAP Sales 2 $ 39.0 - $40.0 $ 24.8 $ 101.0 - $102.0 $ 88.5 Pump Shipments 7,000 4,418 17,100 16,938 (in millions) GAAP Impact of Technology\nUpgrade Program 2\nNon-GAAP 2018 Sales Guidance $132.0 - $140.0 $ - $132.0 - $140.0 2017 Sales 1 $106.0 - $107.0 ($5.0) $101.0 - $102.0 Year-Over-Year Increase 23% - 32% 6% - 7% 29% - 39% 1) Results for the year and quarter ended December 31, 2017 are preliminary and unaudited. 2) GAAP sales are determined in accordance with U.S. Generally Accepted Accounting Principles. In July 2016, the Company began offering a Technology Upgrade Program to eligible customers to provide a pathway to ownership of the t:slim X2 TM Insulin Pump, which launched in October 2016. Due to accounting complexities associated with this Program and the lack of comparability to historical and expected future GAAP results, non-GAAP sales are adjusted for the impact of the Program. See the information under the heading “Use of Non-GAAP Financial Measures” in this press release.\nAbout Tandem Diabetes Care, Inc.\nTandem Diabetes Care, Inc. ( www.tandemdiabetes.com ) is a medical device company dedicated to improving the lives of people with diabetes through relentless innovation and revolutionary customer experience. The Company takes an innovative, user-centric approach to the design, development and commercialization of products for people with diabetes who use insulin. Tandem manufactures and sells the t:slim X2™ Insulin Pump, the only pump capable of remote feature updates using a personal computer, now available with Dexcom G5® Mobile continuous glucose monitoring (CGM) integration, and the t:flex® Insulin Pump, the first pump designed for people with greater insulin requirements. Tandem is based in San Diego, California.\nFollow Tandem Diabetes Care on Twitter @tandemdiabetes; use #tslimX2, #tflex, #tconnect, and $TNDM.\nFollow Tandem Diabetes Care on Facebook at www.facebook.com/TandemDiabetes .\nFollow Tandem Diabetes Care on LinkedIn at https://www.linkedin.com/company/tandemdiabetes .\nt:flex and Tandem Diabetes Care are registered trademarks, and t:slim X2 is a trademark of Tandem Diabetes Care, Inc. Dexcom G5 is a registered trademark of Dexcom, Inc.\nForward Looking Statements\nThis press release contains “ ” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ftandemdiabetes&esheet=51740643&newsitemid=20180109006722&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ftandemdiabetes&index=3&md5=6871de5c2b8d3f94a2e11be4661a7149", "http://www.businesswire.com/news/home/20180109006722/en/", "https://www.linkedin.com/company/tandemdiabetes", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2FTandemDiabetes&esheet=51740643&newsitemid=20180109006722&lan=en-US&anchor=www.facebook.com%2FTandemDiabetes&index=2&md5=e48f5242b28e0c102f34bed5ba1b0f0f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tandemdiabetes.com&esheet=51740643&newsitemid=20180109006722&lan=en-US&anchor=www.tandemdiabetes.com&index=1&md5=3f973ee30ca2bbc66128719384e03129"], "published": "2018-01-10T00:15:00.000+02:00", "crawled": "2018-01-10T02:23:00.014+02:00", "highlightTitle": ""}