{"organizations": [], "uuid": "84747f326d79a6d5f07cc1c23c5b7c1914b2b632", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/brazil-yellowfever/brazils-death-toll-from-yellow-fever-triples-who-idINKBN1FB37N", "country": "US", "domain_rank": 408, "title": "Brazil's death toll from yellow fever triples: WHO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:55:00.000+02:00", "replies_count": 0, "uuid": "84747f326d79a6d5f07cc1c23c5b7c1914b2b632"}, "author": "", "url": "https://in.reuters.com/article/brazil-yellowfever/brazils-death-toll-from-yellow-fever-triples-who-idINKBN1FB37N", "ord_in_thread": 0, "title": "Brazil's death toll from yellow fever triples: WHO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:59 PM / Updated 12 hours ago Brazil's death toll from yellow fever triples - WHO Reuters Staff 2 Min Read \nRIO DE JANEIRO (Reuters) - The number of confirmed cases of yellow fever outbreak in Brazil has tripled in recent weeks, with 20 deaths since July, the World Health Organization (WHO) said on Monday. \nOf 35 confirmed cases, 20 were in Sao Paulo state, which includes South America’s largest city, Sao Paulo. Earlier this month, a case of the disease was confirmed in the Netherlands for a traveller who had recently been in that state. \nThe WHO recommended last week that foreign travellers get vaccinated before visiting. \nBut Brazil’s Health Ministry has said the recommendation, coming just weeks before Carnival, a holiday event in which tens of thousands of tourists descend on Brazil, would not cause it to change its advisory that only travellers going to rural areas be vaccinated. \nLast week, Brazilians lined up for hours to get yellow fever vaccinations in the country’s largest states, alarmed by the increase in the number of fatal cases of infection and a warning from the WHO to tourists visiting parts of the country. \nYellow fever is a viral disease transmitted by mosquitoes in tropical regions and is still a major killer in Africa. It had largely been brought under control in the Americas. \nThe first sign that the fever was back in Brazil was the death last year of hundreds of monkeys in the Atlantic rain forest in the states of Rio de Janeiro, Espirito Santo and Sao Paulo. Reporting by Alexandra Alper; Editing by Sandra Maler", "external_links": [], "published": "2018-01-23T01:55:00.000+02:00", "crawled": "2018-01-23T02:21:41.030+02:00", "highlightTitle": ""}