{"organizations": [], "uuid": "717c38795cc54fca269d95db00185843eaac8ba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-mahendran-jawaharlal-joins-campusworks-as-president-and-ceo.html", "country": "US", "domain_rank": 767, "title": "Mahendran Jawaharlal Joins CampusWorks as President and CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:38:00.000+02:00", "replies_count": 0, "uuid": "717c38795cc54fca269d95db00185843eaac8ba7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-mahendran-jawaharlal-joins-campusworks-as-president-and-ceo.html", "ord_in_thread": 0, "title": "Mahendran Jawaharlal Joins CampusWorks as President and CEO", "locations": [], "entities": {"persons": [{"name": "mahendran jawaharlal joins campusworks", "sentiment": "negative"}, {"name": "mahendran jawaharlal", "sentiment": "none"}, {"name": "eric schoenberg", "sentiment": "none"}, {"name": "jawaharlal", "sentiment": "none"}, {"name": "liz murphy", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "bradenton", "sentiment": "none"}], "organizations": [{"name": "campusworks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Board appoints industry veteran to lead higher education consulting firm\nBRADENTON, Fla.--(BUSINESS WIRE)-- CampusWorks, a strategic higher education consulting firm, announced today that Mahendran Jawaharlal has joined the company as president, effective immediately, and will assume the role of CEO on July 1, 2018. At that time, CampusWorks’ current CEO, Liz Murphy, will transition to chairwoman of the board. Dr. Eric Schoenberg, CampusWorks’ current chairman, will continue on the board as a director.\nThis planned move is intended to further strengthen CampusWorks and position the company for the next phase of growth. By serving as president, and eventually CEO, Jawaharlal will take on the day-to-day responsibilities of running the business, allowing Murphy to focus her efforts and energy on ensuring that CampusWorks remains true to its core vision/mission and partnering closely with Jawaharlal to assist the organization where her experiences will benefit it most.\nJawaharlal has more than 30 years of experience as a strategic leader in the global higher education technology industry, helping companies expand their core competencies and achieve next-level growth. Jawaharlal joins CampusWorks from Macmillan Enterprise Services Group, where he served as president, working on acquisitions, portfolio management, and integration of the acquired businesses. Previously, Jawaharlal spent a decade at Campus Management Corporation, most recently as COO, where he contributed to the company’s rapid growth and was instrumental in the acquisition of Talisma®.\n“Given the unprecedented challenges facing higher education, institutions are increasingly looking for ways to offer more robust services to improve the student experience and increase completion rates while controlling costs,” said CampusWorks Chairman Eric Schoenberg. “CampusWorks’ leadership and team members are passionate about our vision to improve society by making higher education accessible to everyone. We are confident that Mahendran's global perspective and strategic vision will further our ability to deliver the transformative independent perspective and creative solutions we are known for.”\nJawaharlal’s experience includes serving as president and co-founder of PlanIT Group, a firm he founded to provide new technology management and consulting services to higher education executives. He served as president of Jenzabar's Internet Software Division, transforming the organization through the acquisition and integration of four former competitors. He also served as president, CEO, and chairman of the board at CARS Information Systems, where he oversaw its successful growth.\n“I couldn’t have asked for a more qualified person to continue leading our growing organization,” said CampusWorks CEO Liz Murphy. “In addition to Mahendran’s extensive experience and impressive track record, he is known for being a motivational leader and visionary, which will make him a powerful addition to our awesome senior leadership team.”\nJawaharlal holds a BA in Computer Science from Monmouth College in Illinois and an MBA from Florida International University. He currently serves on Monmouth College’s board of trustees.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005712/en/\nCampusWorks, Inc.\nErika Liodice, 484-626-2931\nMarketing Communication Manager\neliodice@campusWorksinc.com\nSource: CampusWorks", "external_links": ["http://www.businesswire.com/news/home/20180102005712/en/"], "published": "2018-01-02T22:38:00.000+02:00", "crawled": "2018-01-03T00:39:12.004+02:00", "highlightTitle": ""}