{"organizations": [], "uuid": "91318ce946009806f08a67027a0896b18cf0801c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-healthcare-conference-pricing-analysi/drugmakers-see-a-pricing-blueprint-in-an-850000-gene-therapy-idUKKBN1F11D2", "country": "US", "domain_rank": 408, "title": "Drugmakers see a pricing blueprint in an $850,000 gene therapy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:27:00.000+02:00", "replies_count": 0, "uuid": "91318ce946009806f08a67027a0896b18cf0801c"}, "author": "", "url": "https://uk.reuters.com/article/us-healthcare-conference-pricing-analysi/drugmakers-see-a-pricing-blueprint-in-an-850000-gene-therapy-idUKKBN1F11D2", "ord_in_thread": 0, "title": "Drugmakers see a pricing blueprint in an $850,000 gene therapy", "locations": [], "entities": {"persons": [{"name": "caroline humer", "sentiment": "none"}], "locations": [{"name": "luxturna", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "drugmakers", "sentiment": "negative"}, {"name": "spark therapeutics inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 12:04 PM / Updated 15 minutes ago Drugmakers see a pricing blueprint in an $850,000 gene therapy Caroline Humer 6 Min Read \nSAN FRANCISCO (Reuters) - Global drugmakers are looking to a tiny biotech’s $850,000 therapy for a rare type of blindness as a model for getting paid for highly expensive – and effective – new medicines. A man receives an eye exam in a file photo. REUTERS/Joshua Roberts \nSpark Therapeutics Inc plans to launch its recently approved Luxturna treatment for an inherited genetic mutation that causes blindness in March. The drug is to be administered only once, by injection, and Spark plans to charge $425,000 per eye, an unprecedented price. \nBut what is grabbing the attention of other drugmakers is not just what might be called an eye-popping price to treat a condition that Spark estimates affects 1,000 to 2,000 people in the United States, but the ways Spark is looking to help payers ranging from the federal government to private insurers absorb the drug’s high cost, including spreading out payments over several years. \n“We’re laying the groundwork for the future of our pipeline and the future of one-time curative gene therapy treatments,” Spark’s chief executive officer, Jeffrey Marrazzo, said in an interview at the JPMorgan Healthcare Conference in San Francisco this week. \nThe high cost of prescription drugs has become an increasingly critical and contentious issue. \nThe independent Institute for Clinical and Economic Review (ICER) issued a report on Friday saying the proposed Luxturna price was far too high in most cases. \nHealthcare spending accounts for 18 percent of the U.S. economy and has been rising faster than the rate of inflation as drugs and medical services costs increase. An influx of very expensive drugs that offer a one-time cure – such as a hepatitis C treatment from Gilead Sciences Inc – has already stretched state and federal budgets. \nThe U.S. Centers for Medicare and Medicaid Services (CMS), which provides coverage for 125 million elderly, poor and disabled Americans, spends hundreds of billions of dollars annually on medicines. \nCMS is trying to tackle the overall high drug costs. It has asked for input from private health insurers and drugmakers on payment models that are expected to influence how medical breakthroughs for millions more patients are covered. \nSpark itself is working with CMS on a legal structure to allow government and private-sector health plans to pay for Luxturna, which restores some vision for most patients with the inherited mutation, over several years, rather than in a single payment, without hurting its profits. \nSpark has also offered refunds if the treatment stops working and ways for payers to buy the drug outside of hospitals, which can significantly mark up the price of a medicine administered in their facilities. \nIn interviews with Reuters, executives from large drugmakers including Eli Lilly & Co, GlaxoSmithKline Plc, Roche Holding AG, Merck & Co Inc and Bristol-Myers Squibb Co said they would pay close attention to the outcome of Spark’s payment discussions. \nThey are also following two revolutionary gene-based therapies for blood cancers from Novartis AG and Gilead Sciences. Novartis’ Kymriah, with a list price of $475,000, is covered by CMS based on outcomes achieved for pediatric and young adult leukemia patients by the end of the first month of treatment. \nSpark is also looking at guaranteeing its product. It is working on a plan with pharmacy benefits manager Express Scripts Holding Co on a long-term payment schedule for privately insured patients. \nSpark plans to sell Luxturna through specialty pharmacies, including one owned by Express Scripts, so that large employers and health plans can avoid hospital markups that could reach hundreds of thousands of dollars. Express Scripts is working with Spark on provisions to refund money to insurers if the drug does not work as promised. \n“Spark is willing to guarantee its product over a period of time and potentially extend that payment over a period of time; it needs someone to be a chassis,” Express Scripts CEO Tim Wentworth said. POTENTIAL ROADBLOCKS \nLarge drugmakers already offer refunds on some drugs, including treatments for diabetes or high cholesterol, if they do not provide a benefit. \nBut it is tougher to create a long-term payment model for a very expensive drug administered only once. The U.S. system is built to cover the whole cost immediately, and CMS needs to determine how smaller payments could be made without triggering bigger-than-intended discounts. \nCMS does not negotiate prices or purchase drugs, but it sets ground rules for the managed care companies and state Medicaid agencies that do. CMS chief Seema Verma told Reuters last year that she was looking at new payment models for high-priced breakthrough treatments. \nAnother road block under discussion: Patients often change insurance, or move between private and government-sponsored health coverage depending on their age or employment status. Under a deferred payment plan, the government could be billed for patients who they no longer cover. \n“The innovation is there, but the financing vehicles need to catch up,” said Jack Bailey, GlaxoSmithKline’s U.S. pharmaceuticals head. \nPaul Biondi, head of business development at Bristol-Myers, said the drugmaker is closely following the payment outcome for gene therapies. “I‘m glad other people are plowing the ground,” he said. \nThe next U.S.-approved gene therapy may come from Bluebird Bio. The small biotech company expects to submit this year a potentially one-time treatment for the inherited blood disorder beta thalassemia, which can cause severe anemia. Bluebird also aims to seek approval for a gene-based cancer therapy in 2019. \n“We’ve been thinking about pricing for years,” Jeffrey Walsh, Bluebird’s chief financial and strategy officer, said. “Now we can bring in the regulators.” \nThe company is talking to the U.S. government, as well as governments in the UK, France, Germany and Italy, about pricing over a period of time and how to prove a drug is working. \n“The system in the U.S. isn’t built for a single intervention,” Walsh said. Reporting by Caroline Humer; additional reporting by Bill Berkrot in New York; editing by Michele Gershberg and Leslie Adler", "external_links": [], "published": "2018-01-12T15:27:00.000+02:00", "crawled": "2018-01-12T21:25:36.010+02:00", "highlightTitle": ""}