{"organizations": [], "uuid": "5f4375b25f658cce9dace53892e1750af46dbc2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-clorox-evp--cfo-steve-robb-to-retire-kevin-jacobsen-named-svp--cfo.html", "country": "US", "domain_rank": 767, "title": "Clorox EVP - CFO Steve Robb to Retire; Kevin Jacobsen Named SVP - CFO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:15:00.000+02:00", "replies_count": 0, "uuid": "5f4375b25f658cce9dace53892e1750af46dbc2d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-clorox-evp--cfo-steve-robb-to-retire-kevin-jacobsen-named-svp--cfo.html", "ord_in_thread": 0, "title": "Clorox EVP - CFO Steve Robb to Retire; Kevin Jacobsen Named SVP - CFO", "locations": [], "entities": {"persons": [{"name": "steve robb", "sentiment": "negative"}, {"name": "kevin jacobsen", "sentiment": "negative"}, {"name": "stephen m. \"steve", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "robb", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "cfo oakland", "sentiment": "none"}, {"name": "bay area", "sentiment": "none"}], "organizations": [{"name": "clorox company", "sentiment": "negative"}, {"name": "clorox evp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "san francisco business times", "sentiment": "none"}, {"name": "clorox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKLAND, Calif., The Clorox Company (NYSE:CLX) today announced the following changes:\nExecutive Vice President – Chief Financial Officer Stephen M. \"Steve\" Robb has announced his decision to retire from the company. Robb, who joined Clorox in 1989, has been the company's chief financial officer since 2011 and a member of the company's executive management committee, with responsibility for leading all aspects of Clorox's financial activities, including accounting, reporting, internal controls, treasury, tax and investor relations. During his career with Clorox, Robb has overseen the company's cost savings efforts, which have produced an average of $100 million in savings annually. During his tenure as CFO, Robb has helped the company deliver a strong track record of financial results and total shareholder returns, in part enabled by these cost savings. In 2017, he was selected by the San Francisco Business Times as the Bay Area CFO of the Year for a large public company.\n\"After 29 years with the company, Steve leaves a tremendous legacy of financial stewardship and discipline that has served the company and investors well and will contribute to the company for years to come,\" said Chairman and CEO Benno Dorer. \"We are grateful for his many years of service to the company and contributing greatly in his years as CFO. We thank him for his integrity, leadership and distinguished service.\n\"Steve will actively serve in his CFO role through March 31, and then continue in an advisory capacity through the end of the fiscal year,\" Dorer continued. \"Steve's leadership, focus on total shareholder return and the timing of this announcement will ensure a smooth and orderly transition that will help us continue our focus on driving growth that is profitable, sustainable and responsible.\"\nEffective April 1, Kevin Jacobsen will succeed Robb and has been appointed senior vice president – chief financial officer and a member of the company's executive management committee, reporting to CEO Dorer. Jacobsen, who joined Clorox in 1995, has served as Clorox's vice president – Financial Planning & Analysis since November 2011. During his tenure at Clorox, he has held senior leadership roles in Finance across the company. In all of these assignments, Jacobsen has focused on developing and implementing business strategies that drive increased shareholder value. As CFO, Jacobsen will oversee all aspects of Clorox's financial activities.\n\"Kevin brings strong leadership, insight and a deep understanding of Clorox's financial model,\" Robb said. \"He is the company's finance lead on our Business Operations Leadership Team and has helped to drive the financial success we've achieved. I couldn't be more pleased to be passing the baton to Kevin.\"\n\"Kevin's appointment as CFO is a great example of our robust succession-planning process,\" said Dorer. \"He is a seasoned and thoughtful executive with more than 20 years of experience across the Clorox finance organization and brings deep experience and strategic continuity to the CFO role.\"\nPhotos of and additional biographical information on Robb and Jacobsen are available at https://www.thecloroxcompany.com/who-we-are/corporate-governance/executive-team/\nThe Clorox Company\nThe Clorox Company (NYSE: CLX ) is a leading multinational manufacturer and marketer of consumer and professional products with approximately 8,100 employees worldwide and fiscal year 2017 sales of $6 billion. Clorox markets some of the most trusted and recognized consumer brand names, including its namesake bleach and cleaning products; Pine-Sol ® cleaners; Liquid Plumr ® clog removers; Poett ® home care products; Fresh Step ® cat litter; Glad ® bags, wraps and containers; Kingsford ® charcoal; Hidden Valley ® dressings and sauces; Brita ® water-filtration products; Burt's Bees ® natural personal care products; and RenewLife ® digestive health products. The company also markets brands for professional services, including Clorox Healthcare® and Clorox Commercial Solutions ® . More than 80 percent of the company's sales are generated from brands that hold the No. 1 or No. 2 market share positions in their categories. For more information, visit TheCloroxCompany.com , including the Good Growth blog, and follow the company on Twitter at @CloroxCo.\nView original content with multimedia: releases/clorox-evp--cfo-steve-robb-to-retire-kevin-jacobsen-named-svp--cfo-300586215.html\nSOURCE The Clorox Company", "external_links": ["http://www.prnewswire.com/news-releases/clorox-evp--cfo-steve-robb-to-retire-kevin-jacobsen-named-svp--cfo-300586215.html", "http://studio-5.financialcontent.com/prnews?Page=Quote&Ticker=CLX", "https://www.thecloroxcompany.com/who-we-are/corporate-governance/executive-team/"], "published": "2018-01-23T00:15:00.000+02:00", "crawled": "2018-01-23T02:14:55.005+02:00", "highlightTitle": ""}