{"organizations": [], "uuid": "cab16c81dd9033899f397f367772535442c5cf98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/31/reuters-america-as-u-s-budget-fight-looms-republicans-flip-their-fiscal-script.html", "country": "US", "domain_rank": 767, "title": "As U.S. budget fight looms, Republicans flip their fiscal script", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T22:54:00.000+02:00", "replies_count": 0, "uuid": "cab16c81dd9033899f397f367772535442c5cf98"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/31/reuters-america-as-u-s-budget-fight-looms-republicans-flip-their-fiscal-script.html", "ord_in_thread": 0, "title": "As U.S. budget fight looms, Republicans flip their fiscal script", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "mark meadows", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "cbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Dec 31 (Reuters) - The head of a conservative Republican faction in the U.S. Congress, who voted this month for a huge expansion of the national debt to pay for tax cuts, called himself a \"fiscal conservative\" on Sunday and urged budget restraint in 2018.\nIn keeping with a sharp pivot under way among Republicans, U.S. Representative Mark Meadows, speaking on CBS' \"Face the Nation,\" drew a hard line on federal spending, which lawmakers are bracing to do battle over in January.\nWhen they return from the holidays on Wednesday, lawmakers will begin trying to pass a federal budget in a fight likely to be linked to other issues, such as immigration policy, even as the November congressional election campaigns approach in which Republicans will seek to keep control of Congress.\nPresident Donald Trump and his Republicans want a big budget increase in military spending, while Democrats also want proportional increases for non-defense \"discretionary\" spending on programs that support education, scientific research, infrastructure, public health and environmental protection.\n\"The (Trump) administration has already been willing to say: 'We're going to increase non-defense discretionary spending ... by about 7 percent,\"' Meadows, chairman of the small but influential House Freedom Caucus, said on the program.\n\"Now, Democrats are saying that's not enough, we need to give the government a pay raise of 10 to 11 percent. For a fiscal conservative, I don't see where the rationale is. ... Eventually you run out of other people's money,\" he said.\nMeadows was among Republicans who voted in late December for their party's debt-financed tax overhaul, which is expected to balloon the federal budget deficit and add about $1.5 trillion over 10 years to the $20 trillion national debt.\n\"It's interesting to hear Mark talk about fiscal responsibility,\" Democratic U.S. Representative Joseph Crowley said on CBS.\nCrowley said the Republican tax bill would require the United States to borrow $1.5 trillion, to be paid off by future generations, to finance tax cuts for corporations and the rich.\n\"This is one of the least ... fiscally responsible bills we've ever seen passed in the history of the House of Representatives. I think we're going to be paying for this for many, many years to come,\" Crowley said.\nRepublicans insist the tax package, the biggest U.S. tax overhaul in more than 30 years, will boost the economy and job growth.\n'ENTITLEMENT REFORM'\nHouse Speaker Paul Ryan, who also supported the tax bill, recently went further than Meadows, making clear in a radio interview that welfare or \"entitlement reform,\" as the party often calls it, would be a top Republican priority in 2018.\nIn Republican parlance, \"entitlement\" programs mean food stamps, housing assistance, Medicare and Medicaid health insurance for the elderly, poor and disabled, as well as other programs created by Washington to assist the needy.\nDemocrats seized on Ryan's early December remarks, saying they showed Republicans would try to pay for their tax overhaul by seeking spending cuts for social programs.\nBut the goals of House Republicans may have to take a back seat to the Senate, where the votes of some Democrats will be needed to approve a budget and prevent a government shutdown.\nDemocrats will use their leverage in the Senate, which Republicans narrowly control, to defend both discretionary non-defense programs and social spending, while tackling the issue of the \"Dreamers,\" people brought illegally to the country as children.\nTrump in September put a March 2018 expiration date on the Deferred Action for Childhood Arrivals, or DACA, program, which protects the young immigrants from deportation and provides them with work permits.\nThe president has said in recent Twitter messages he wants funding for his proposed Mexican border wall and other immigration law changes in exchange for agreeing to help the Dreamers.\nRepresentative Debbie Dingell told CBS she did not favor linking that issue to other policy objectives, such as wall funding. \"We need to do DACA clean,\" she said.\nOn Wednesday, Trump aides will meet with congressional leaders to discuss those issues. That will be followed by a weekend of strategy sessions for Trump and Republican leaders on Jan. 6 and 7, the White House said.\nTrump was also scheduled to meet on Sunday with Florida Republican Governor Rick Scott, who wants more emergency aid. The House has passed an $81 billion aid package after hurricanes in Florida, Texas and Puerto Rico, and wildfires in California. The package far exceeded the $44 billion requested by the Trump administration. The Senate has not yet voted on the aid.\n(Reporting by Kevin Drawbaugh; Additional reporting by Roberta Rampton in Florida; Editing by Peter Cooney)", "external_links": [], "published": "2017-12-31T22:54:00.000+02:00", "crawled": "2018-01-01T08:01:07.017+02:00", "highlightTitle": ""}