{"organizations": [], "uuid": "bb649a4a94a368cd6d02c7f644657797a6951058", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225889742&w=1200&r=LYNXMPEE0R003", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-colombia-peace/colombias-farc-launch-2018-campaign-with-anti-poverty-pledge-idUKKBN1FG0YQ", "country": "US", "domain_rank": 408, "title": "Colombia's FARC launch 2018 campaign with anti-poverty pledge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T02:04:00.000+02:00", "replies_count": 0, "uuid": "bb649a4a94a368cd6d02c7f644657797a6951058"}, "author": "", "url": "https://uk.reuters.com/article/uk-colombia-peace/colombias-farc-launch-2018-campaign-with-anti-poverty-pledge-idUKKBN1FG0YQ", "ord_in_thread": 0, "title": "Colombia's FARC launch 2018 campaign with anti-poverty pledge", "locations": [], "entities": {"persons": [{"name": "rodrigo londono", "sentiment": "none"}, {"name": "juan manuel santos", "sentiment": "none"}, {"name": "timochenko", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}], "organizations": [{"name": "farc", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "revolutionary alternative common force", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 12:05 AM / Updated 7 minutes ago Colombia's FARC launch 2018 campaign with anti-poverty pledge Reuters Staff 2 Min Read \nBOGOTA (Reuters) - Colombia’s FARC political party, made up of former members of the rebel group, on Saturday launched its campaign for this year’s legislative and presidential elections with a promise to fight poverty and corruption. \nThe ballots will mark the party’s electoral debut after thousands of members handed in their weapons under a deal signed with the government of President Juan Manuel Santos in 2016 that ended more than 52 years of war. The group has renamed itself the Revolutionary Alternative Common Force, preserving its FARC initials. \n“I am committed to heading up a transitional government which will create the conditions for the birth of a new Colombia,” said long-time rebel leader and presidential candidate Rodrigo Londono, known by his nom de guerre Timochenko, to cheering supporters in a working-class neighbourhood in southern Bogota. \n“May the voice of those below, those millions and millions of poor who have never counted, may they be listened to, may they decide their future,” Londono added. Slideshow (6 Images) \nThe group’s platform includes free university education, improvements to healthcare paid for by the rich, the construction of roads and electrical lines, and spending on scientific research. \nHundreds of supporters, many wearing shirts with the party’s rose logo, danced to a campaign jingle and waved white flags emblazoned with “Timo President,” referring to Londono’s nickname. \nBesides the May presidential election, the party will field 74 candidates in legislative elections in March, hoping to win more than the 10 seats that it is guaranteed through 2026 under the terms of the peace deal. \nMany Colombians remain angry at the FARC, infamous for kidnappings, bombings and displacements, and believe its members should be in prison, not running for congressional seats. Recent opinion polls have shown little support for the party. Reporting by Julia Symmes Cobb; Editing by Helen Murphy and Daniel Wallis", "external_links": [], "published": "2018-01-28T02:04:00.000+02:00", "crawled": "2018-01-28T02:25:02.002+02:00", "highlightTitle": ""}