{"organizations": [], "uuid": "e4ddac94efc141a750e7483fe06efb268acbc03c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mpd-chemicals-acquires-specialty-chemical-manufacturer-norquay-technology.html", "country": "US", "domain_rank": 767, "title": "MPD Chemicals Acquires Specialty Chemical Manufacturer Norquay Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-11T21:52:00.000+02:00", "replies_count": 0, "uuid": "e4ddac94efc141a750e7483fe06efb268acbc03c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-mpd-chemicals-acquires-specialty-chemical-manufacturer-norquay-technology.html", "ord_in_thread": 0, "title": "MPD Chemicals Acquires Specialty Chemical Manufacturer Norquay Technology", "locations": [], "entities": {"persons": [{"name": "silar", "sentiment": "none"}, {"name": "norquay", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "trevose", "sentiment": "none"}, {"name": "chester pennsylvania", "sentiment": "none"}], "organizations": [{"name": "mpd chemicals", "sentiment": "negative"}, {"name": "mpd chemicals acquires specialty chemical manufacturer norquay technology", "sentiment": "negative"}, {"name": "mpd", "sentiment": "none"}, {"name": "monomer polymer & dajac labs", "sentiment": "none"}, {"name": "norquay technology, inc.", "sentiment": "none"}, {"name": "addison capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TREVOSE, Pa., Jan. 11, 2018 /PRNewswire/ -- MPD Chemicals (MPD), a US-based manufacturer of specialty chemicals and custom synthesis solutions, announced today the expansion of its manufacturing capabilities, product portfolio and customer base with the acquisition of Norquay Technology, Inc. (Norquay). Located in Chester Pennsylvania, Norquay is the fourth acquisition to be integrated into the MPD Holdings platform, an Addison Capital portfolio company; existing MPD businesses include Monomer Polymer & Dajac Labs , Silar , and IsoSciences .\nNorquay is a specialty chemical manufacturer with over 30 years of expertise in providing the scale-up and production of advanced proprietary custom materials, including organometallic, inorganic and organic molecules. Norquay's product line includes chromic, electronic, catalyst, ligand, medical adhesive and UV performance products, with a customer base that ranges from startups to large multi-national corporations.\nMPD focuses on complex organic synthesis, unique monomers, polymer development, organosilicon chemistries and stable isotope labeling. MPD leverages interdisciplinary expertise and manufacturing strength among their business units, with internal capabilities for scaling from milligram to metric ton batches. This alignment will continue with the addition of Norquay, in partnering with customers to develop custom manufacturing processes for a wide range of specialty chemical application solutions from the laboratory to full-scale commercial production, ensuring a continuity in the supply chain to meet customer requirements.\n\"The acquisition of Norquay into the MPD organization will enhance our cross-functional operations and extend our value-added products and solutions to more customers worldwide. Our long history of success has resulted in leadership positions with MPD customers, as we continuously deliver high quality products to the various markets and customers we serve. We look forward to exploring new opportunities with our existing and prospective customers as a result of this expansion,\" stated Carrington Smith, CEO of MPD Chemicals.\n\"Norquay combining with MPD is an extraordinary opportunity to deliver long-term, sustainable value and growth through our highly complementary capabilities, global product portfolios, industry applications, and like business models,\" said Robert Heldt, President and Founder of Norquay.\nAbout MPD Chemicals\nMPD Chemicals is a US-based manufacturer of custom and specialty chemicals with over 75 years of global expertise in multiple technical areas, including complex organic synthesis, unique monomers, polymer development, organosilicon chemistries and stable isotope labeling. The subsidiary companies that comprise MPD Chemicals are Monomer-Polymer and Dajac Labs, Silar, and IsoSciences business units, along with the new addition of Norquay Technology. The combined companies offer over 4,000 catalog products, as well as numerous custom, proprietary, critical, and enabling materials to customers in a wide range of end-use markets.\nMPD Chemicals offers custom synthesis solutions ranging from research and development projects to full-scale production for unique compounds with multi-step synthesis and purification. MPD specializes in custom synthesis while maintaining and expanding focused product catalog offerings. MPD Chemicals industrial applications include: wound care, coatings, adhesives, dental technologies, chromatography, diagnostics standards, specialty chemicals, contact & intraocular lenses, semiconductors, catalysis, dyes, and medical adhesives.\nTo learn more about MPD Chemicals and its subsidiaries, please visit mpdchemicals.com and norquaytech.com .\nEmail : info@mpdchemicals.com\nTel : 215-364-1155 / Fax : 215-364-1583\nAddress : 4667 Somerton Road, Trevose, PA 19053\nView original content: http://www.prnewswire.com/news-releases/mpd-chemicals-acquires-specialty-chemical-manufacturer-norquay-technology-300581493.html\nSOURCE MPD Chemicals", "external_links": ["http://www.isosciences.com/", "http://www.silar.com/", "http://mpdchemicals.com/", "http://www.monomerpolymer.com/", "http://www.mpdchemicals.com/", "http://www.norquaytech.com/", "http://www.addisoncapitalpartners.com/", "http://www.prnewswire.com/news-releases/mpd-chemicals-acquires-specialty-chemical-manufacturer-norquay-technology-300581493.html"], "published": "2018-01-11T21:52:00.000+02:00", "crawled": "2018-01-11T23:44:56.095+02:00", "highlightTitle": ""}