{"organizations": [], "uuid": "70609acb0e9fa9339c7cf7f2f4c3920685a1ac67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-james-nelson-to-join-avison-young-in-new-york-city.html", "country": "US", "domain_rank": 767, "title": "James Nelson to join Avison Young in New York City", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:00:00.000+02:00", "replies_count": 0, "uuid": "70609acb0e9fa9339c7cf7f2f4c3920685a1ac67"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-james-nelson-to-join-avison-young-in-new-york-city.html", "ord_in_thread": 0, "title": "James Nelson to join Avison Young in New York City", "locations": [], "entities": {"persons": [{"name": "james nelson", "sentiment": "negative"}, {"name": "nelson", "sentiment": "none"}, {"name": "mitti liebersohn", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "liebersohn", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new york metro area investment sales", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york metro area", "sentiment": "none"}], "organizations": [{"name": "avison young", "sentiment": "negative"}, {"name": "avison young principal", "sentiment": "none"}, {"name": "cushman & wakefield", "sentiment": "none"}, {"name": "massey knakal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highly regarded industry leader to become\nPrincipal and Head of New York Metro Area Investment Sales\nNEW YORK, Jan. 29, 2018 /PRNewswire/ - Mitti Liebersohn , Avison Young Principal and President of the firm's New York City office, today announced that leading investment real estate sales professional James Nelson will be joining the company on February 5, 2018.\nNelson will become a Principal of Avison Young and Head of New York Metro Area Investment Sales. He will be based in the firm's New York City office and lead the company's investment sales practice in the New York Metro Area.\nNelson brings 20 years of commercial real estate experience to Avison Young, most recently as vice-chairman of Cushman & Wakefield, which acquired his former firm Massey Knakal in 2015. Nelson led an investment sales team at Cushman & Wakefield that brokered more than $1 billion worth of deals in the past two years alone.\n\"We're thrilled that James has decided to join Avison Young and lead our New York Metro Area investment sales practice,\" comments Liebersohn. \"James is consistently a top producer and, unquestionably, one of the leading investment sales professionals in the business. By bringing him on board, we are underscoring our commitment to building a team of top players in this market. He is the ideal choice to oversee our investment sales platform and expand our capital markets footprint throughout the New York City area.\"\nLiebersohn continues: \"For two decades, James has earned a stellar reputation in this market by identifying trends and strategically helping clients solve even the most complex of investment sales issues. We are confident that his exceptional abilities will continue the already substantial growth trajectory of our investment sales service line and will also boost the recruitment of new talent as we expand our team of industry-leading producers.\"\nWhile managing the day-to-day operations of the New York Metro Area investment sales practice, Nelson will work closely with Liebersohn and Arthur Mirante , Avison Young Principal and President of the firm's Tri-State region.\n\"James has played an integral role in the New York City real estate market and is a highly regarded industry leader,\" notes Mirante. \"He brings a depth of knowledge to his new position at Avison Young, where he will lead a team of professionals in a variety of client-service offerings, including asset disposition, asset recapitalization, market research and financial analysis. He has unmatched proficiency and capability in all aspects of the acquisition and disposition of investment-grade real estate, as well as development and redevelopment transactions on behalf of institutional and private-capital clients across all property types.\"\nIn 2016, Nelson was Cushman & Wakefield's top investment sales producer in the U.S. Prior to joining Cushman & Wakefield, he was a partner and top producer for Massey Knakal for six of the organization's last eight years and was named the company's youngest partner in 2004. While at Massey Knakal, he was involved in the sale of approximately 400 properties and loans with an aggregate value of more than $3.8 billion.\n\"I am grateful to Cushman & Wakefield and hold the firm in the highest regard. I am especially thankful to Paul Massey and Bob Knakal for all they have done throughout my career. I look forward to this next great opportunity that lies ahead,\" states Nelson.\nNelson currently sits as chair of the Real Estate Board of New York (REBNY) commercial board of directors and is a panelist and instructor for the organization. He also co-founded The Colgate Real Estate Council and Real Estate Services Alliance (RESA). In addition, Nelson has been a guest lecturer and adjunct professor in New York University's Schack Institute of Real Estate. He also produces the Nelson Report, a Real Estate Weekly video series featuring trends in the market and timely topics.\nHe has been the recipient of numerous awards and recognitions, including being named one of New York's Top Brokers by Real Estate Forum, one of the Top 35 and Under New York City Real Estate Players by The Real Deal, and the No. 1 New York City Deal Maker by LoopNet, an online commercial real estate publication.\nIn the community, Nelson founded Rising Realty Stars, which secures job opportunities for disadvantaged youth. His other volunteer activities include being a past board member of the Catalog For Giving. Nelson is a licensed New York, Connecticut and Massachusetts real estate broker and has a salesperson's license in New Jersey and Pennsylvania. He holds a Bachelor of Arts degree in English from Colgate University.\nAvison Young is the world's fastest-growing commercial real estate services firm. Headquartered in Toronto, Canada, Avison Young is a collaborative, global firm owned and operated by its principals. Founded in 1978, the company comprises 2,600 real estate professionals in 82 offices, providing value-added, client-centric investment sales, leasing, advisory, management, financing and mortgage placement services to owners and occupiers of office, retail, industrial, multi-family and hospitality properties.\nFor further information/comment/photos:\nTom Nolan/Francisco Miranda , Great Ink PR, New York, 212.741.2977 tom@greatink.com ; francisco@greatink.com Sherry Quan , Principal, Global Director of Communications & Media Relations, Avison Young: 604.647.5098; cell: 604.726.0959 sherry.quan@avisonyoung.com Mitti Liebersohn , Principal, President and Managing Director, New York City, Avison Young: 212.729.7734 Arthur Mirante , Principal and Tri-State President, Avison Young: 212.729.1896 James Nelson , Principal, Avison Young: 212.729.6585 Mark Rose, Chair and CEO, Avison Young: 416.673.4028 Earl Webb , President, U.S. Operations, Avison Young: 312.957.7610 Christy Ullo , Senior Director of Marketing, Tri-State Region, Avison Young: 212.230.5990\nwww.avisonyoung.com\nAvison Young was a winner of Canada's Best Managed Companies program in 2011 and requalified in 2017 to maintain its status as a Best Managed Gold Standard company\nFollow Avison Young on Twitter:\nFor industry news, press releases and market reports: www.twitter.com/avisonyoung\nFor Avison Young listings and deals: www.twitter.com/AYListingsDeals\nFollow Avison Young Bloggers : http://blog.avisonyoung.com\nFollow Avison Young on LinkedIn : www.linkedin.com/company/avison-young-commercial-real-estate\nFollow Avison Young on YouTube : www.youtube.com/user/AvisonYoungRE\nFollow Avison Young on Instagram: www.instagram.com/avison_young_global\nEditors/Reporters\n• Please click on link to view and download photo of James Nelson:\nhttp://www.avisonyoung.com/documents/20342/2631393/JamesNelson.jpg\nSOURCE Avison Young Commercial Real Estate (BC)", "external_links": ["http://blog.avisonyoung.com/", "http://www.twitter.com/avisonyoung", "http://www.linkedin.com/company/avison-young-commercial-real-estate", "http://www.avisonyoung.com/", "http://www.youtube.com/user/AvisonYoungRE", "http://www.twitter.com/AYListingsDeals", "http://www.instagram.com/avison_young_global"], "published": "2018-01-29T17:00:00.000+02:00", "crawled": "2018-01-29T19:35:49.023+02:00", "highlightTitle": ""}