{"organizations": [], "uuid": "c4aab78ca427bbe764f0735073e596d6dbfad7ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219636563&w=1200&r=LYNXMPEE040YT", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-france-turkey/frances-macron-urges-respect-of-rule-of-law-in-talks-with-erdogan-idUSKBN1EU1LI", "country": "US", "domain_rank": 408, "title": "France's Macron urges respect of rule of law in talks with Erdogan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:17:00.000+02:00", "replies_count": 0, "uuid": "c4aab78ca427bbe764f0735073e596d6dbfad7ca"}, "author": "", "url": "https://www.reuters.com/article/us-france-turkey/frances-macron-urges-respect-of-rule-of-law-in-talks-with-erdogan-idUSKBN1EU1LI", "ord_in_thread": 0, "title": "France's Macron urges respect of rule of law in talks with Erdogan", "locations": [], "entities": {"persons": [{"name": "leigh thomas", "sentiment": "none"}, {"name": "ingrid melander", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "macron", "sentiment": "negative"}, {"name": "erdogan reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - French President Emmanuel Macron told Turkey’s Tayyip Erdogan on Friday that democratic countries must respect the rule of law in their fight against terrorism as he voiced concerns about the fate of students, teachers and journalists detained by Ankara.\nMacron also said after his talks with the Turkish president at the Elysee presidential palace that they had disagreed about human rights.\n“Our democracies must be strong standing up to terrorism... But at the same time our democracies must completely protect the rule of law,” Macron said in a joint news conference.\nMacron said that recent developments in Turkey did not allow for progress in Ankara’s decades-long push to join the European Union.\nDiscussions should change focus, he said, mentioning the possibility of a “partnership” that would fall short of full membership.\nThe EU has expressed concern over Turkey’s crackdown on suspected supporters of an abortive 2016 coup that has seen some 50,000 people arrested pending trial and 150,000, including teachers, journalists and judges, sacked or suspended from their jobs.\nFrench President Emmanuel Macron (L) meets with Turkish President Recep Tayyip Erdogan at the Elysee Palace in Paris, France, January 5, 2018. REUTERS/Ludovic Marin/Pool Macron said he had raised with Erdogan the cases of specific journalists and members of Galatasaray University who had been detained, but declined to give details.\nErdogan, who has dominated Turkish politics for 15 years, defended the crackdown, saying that some journalists encouraged terrorism with their writing, comparing them to gardeners nurturing plants.\nSlideshow (3 Images) “These gardeners are those people viewed as thinkers. They water ... from their newspaper columns,” Erdogan said. “And one day, you find, these people show up as a terrorist in front of you.”\nEven before the coup and the subsequent crackdown, France has long been skeptical about admitting Turkey, a large, relatively poor and overwhelmingly Muslim nation with a population of around 80 million people, into the EU.\nErdogan was visibly irritated when a French journalist suggested that Turkish intelligence had sent arms to Syria.\nErdogan said the operation had been conducted by supporters of Fethullah Gulen, the U.S.-based Muslim cleric blamed by Turkish authorities for orchestrating the failed coup, and accused the French journalist of speaking like one of them.\nSeveral deals were signed during Erdogan’s visit, including a tentative accord for Turkish Airlines to buy 25 A350-900 aircraft.\nAdditional reporting by Ali Kucukgocmen, Ingrid Melander, Jean-Baptiste Vey; Editing by Dominic Evans and Gareth Jones\n ", "external_links": [], "published": "2018-01-05T18:17:00.000+02:00", "crawled": "2018-01-05T18:30:26.027+02:00", "highlightTitle": ""}