{"organizations": [], "uuid": "8eb425d67d041d31d2e1b14ee516b0ec3ef0d3b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nestla-agrees-to-sell-u-s-confectionery-business-to-ferrero.html", "country": "US", "domain_rank": 767, "title": "Nestlé Agrees to Sell U.S. Confectionery Business to Ferrero", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.077, "site_type": "news", "published": "2018-01-16T20:00:00.000+02:00", "replies_count": 0, "uuid": "8eb425d67d041d31d2e1b14ee516b0ec3ef0d3b6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nestla-agrees-to-sell-u-s-confectionery-business-to-ferrero.html", "ord_in_thread": 0, "title": "Nestlé Agrees to Sell U.S. Confectionery Business to Ferrero", "locations": [], "entities": {"persons": [{"name": "ferrero", "sentiment": "negative"}, {"name": "mark schneider", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arlington", "sentiment": "none"}], "organizations": [{"name": "u.s. nestlé group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Va., Jan. 16, 2018 /PRNewswire/ -- Nestlé today announced that it agreed to sell its U.S. confectionery business to Ferrero for USD 2.8 billion in cash. Nestlé's 2016 U.S. confectionery sales reached about USD 900 million. The transaction is expected to close around the end of the first quarter of 2018 following the completion of customary approvals and closing conditions.\nExperience the interactive Multichannel News Release here: https://www.multivu.com/players/English/8255551-nestle-agrees-to-business-transformation/\nNestlé CEO Mark Schneider commented: \"With Ferrero we have found an exceptional home for our U.S. confectionery business where it will thrive. At the same time, this move allows Nestlé to invest and innovate across a range of categories where we see strong future growth and hold leadership positions, such as pet care, bottled water, coffee, frozen meals and infant nutrition.\"\nNestlé's U.S. confectionery business represents about three percent of U.S. Nestlé Group sales. It includes popular local chocolate brands such as Butterfinger, Crunch, BabyRuth, 100Grand, Raisinets, Chunky, OhHenry! and SnoCaps, as well as local sugar brands such as SweeTarts, LaffyTaffy, Nerds, FunDip, PixyStix, Gobstopper, BottleCaps, Spree and Runts.\nThe transaction covers the U.S.-focused confectionery brands only and does not include Nestlé's iconic Toll House baking products, a strategic growth brand which the company will continue to develop. Nestlé remains fully committed to growing its leading international confectionery activities around the world, particularly its global brand KitKat.\nWith sales of around USD 27 billion in 2016, the U.S. is Nestlé's largest market. Nestlé products can be found in 97 percent of U.S. households under brands such as Purina, Nestlé Pure Life, Coffee-Mate, Gerber and Stouffer's. The company employs 50,000 people in more than 120 locations across the US, including 77 factories and 10 R&D centers.\nAbout Nestlé in the U.S.\nNestlé in the United States is committed to enhancing quality of life and contributing to a healthier future—for individuals and families, for our thriving and resilient communities, and for the planet. Our diverse portfolio of foods and beverages provides nutritious options for every member of the family, and supports both the first 1000 days of life and healthy aging for people and pets.\nNestlé in the U.S. consists of eight main businesses: Nestlé USA, Nestlé Waters North America, Nestlé Nutrition, Nestlé Professional, Nespresso, Nestlé Health Science, Nestlé Skin Health and Nestlé Purina PetCare Company. Together, these companies operate in more than 120 locations in 47 states and employ 50,000 people. In the U.S., Nestle product sales topped $27 billion in 2016, making it the largest Nestle market in the world.\nNestlé has been recognized as a member of the MIT Technology Review's \"Smartest Companies,\" the top food company on Fortune's \"Change the World\" List, and the top food company on the Dow Jones Sustainability Index.\nMedia Contact:\nJosh Morton\nNestlé USA, Inc.\n(818) 551-3997\njoshua.morton@us.nestle.com\nView original content: http://www.prnewswire.com/news-releases/nestle-agrees-to-sell-us-confectionery-business-to-ferrero-300583158.html\nSOURCE Nestle", "external_links": ["https://www.multivu.com/players/English/8255551-nestle-agrees-to-business-transformation/", "http://www.prnewswire.com/news-releases/nestle-agrees-to-sell-us-confectionery-business-to-ferrero-300583158.html"], "published": "2018-01-16T20:00:00.000+02:00", "crawled": "2018-01-16T21:17:14.021+02:00", "highlightTitle": ""}