{"organizations": [], "uuid": "f8bab07cd42a52a1006af13d29a4bb62d7d93d2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-horizon-pharma-plc-increases-peak-net-sales-guidance-for-key-growth-drivers-and-announces-rheumatology-and-orphan-pipeline.html", "country": "US", "domain_rank": 767, "title": "Horizon Pharma plc Increases Peak Net Sales Guidance for Key Growth Drivers and Announces Rheumatology and Orphan Pipeline Developments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:05:00.000+02:00", "replies_count": 0, "uuid": "f8bab07cd42a52a1006af13d29a4bb62d7d93d2a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-horizon-pharma-plc-increases-peak-net-sales-guidance-for-key-growth-drivers-and-announces-rheumatology-and-orphan-pipeline.html", "ord_in_thread": 0, "title": "Horizon Pharma plc Increases Peak Net Sales Guidance for Key Growth Drivers and Announces Rheumatology and Orphan Pipeline Developments", "locations": [], "entities": {"persons": [{"name": "timothy p. walbert", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "horizon pharma", "sentiment": "negative"}, {"name": "krystexxa", "sentiment": "none"}, {"name": "horizon pharma plc.", "sentiment": "none"}, {"name": "medimmune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- Increases KRYSTEXXA ® (pegloticase injection) Estimated Peak Annual Net Sales to more than $750 Million --\n-- Increases Teprotumumab Estimated Peak Annual Net Sales to more than $750 Million --\n-- Confirms Expectation of more than 50 Percent Year-Over-Year Net Sales Growth for KRYSTEXXA in 2018 --\n-- Announces Licensing Agreement with MedImmune for Potential Next-Generation Biologic for Uncontrolled Gout --\nDUBLIN, Ireland, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Horizon Pharma plc (NASDAQ:HZNP), today provided updates on the potential performance of key growth drivers and its research and development (R&D) pipeline.\n“The increase in our sales expectations for our key growth drivers, KRYSTEXXA and teprotumumab, reflect our confidence in the significant potential they have for patients,” said Timothy P. Walbert, chairman, president and chief executive officer, Horizon Pharma plc. “Based on our commercial expansion for KRYSTEXXA and a larger anticipated addressable patient population for both KRYSTEXXA and teprotumumab, we see significant opportunity ahead.\n“We are also announcing several additions to our rheumatology development pipeline, including MEDI4945, a potential next-generation gout biologic to support and sustain our leadership of the uncontrolled gout market,” continued Walbert. “We are expanding the investment now to advance the next phase of our Company’s strategy, which is to build a robust development-stage pipeline to generate long-term value for shareholders.”\nUpdated Peak Net Sales Expectations and Market Opportunities for KRYSTEXXA and Teprotumumab\nFollowing additional analysis of the addressable patient population and market opportunities for both KRYSTEXXA and teprotumumab in the United States, as well as a significant commercial expansion for KRYSTEXXA, the Company is increasing its estimated peak annual net sales expectations for each medicine to more than $750 million. Previously, peak net sales expectations for KRYSTEXXA were more than $400 million and peak net sales expectations for teprotumumab were more than $250 million.\nKRYSTEXXA is the only medicine approved by the U.S. Food and Drug Administration (FDA) for adults living with uncontrolled gout, chronic gout that is refractory (not responsive) to conventional gout therapies. In the fourth quarter of 2017, the Company completed its second expansion of its KRYSTEXXA commercial organization, approximately doubling it in size. In addition, through new outreach efforts to nephrologists, the Company’s estimated addressable patient population for KRYSTEXXA has doubled from 50,000 to 100,000 patients. Nephrologists treat chronic kidney disease (CKD) patients of whom 25 to 50 percent have concurrent gout. Additionally, approximately half of people living with gout also have CKD. The Company continues to expect 2018 net sales growth for KRYSTEXXA of more than 50 percent.\nTeprotumumab is a fully human monoclonal antibody IGF-IR-inhibitor being studied in a confirmatory Phase 3 clinical trial for the treatment of a rare eye disease, thyroid eye disease (TED). If approved, it would be the only FDA-approved medicine available to treat TED. Following additional market research and analysis of the treatable TED patient population, the Company now assumes a larger addressable patient population exists. It estimates that the annual U.S. incidence of moderate-to-severe active TED is between 15,000 and 20,000 patients.\nPipeline Developments: Rheumatology Candidates and Programs\nThe Company announced several developments today to its growing pipeline related to its Rheumatology products, including KRYSTEXXA. KRYSTEXXA is a recombinant protein of uricase, an enzyme not found in humans, and PEGylation, a synthetic technology used to extend the half-life of uricase. As with many biologic medicines, some people treated with KRYSTEXXA may develop antidrug antibodies as part of an immune response to the medicine, a reaction known as immunogenicity, and lose response to therapy.\nHZN-003 (Potential Next-Generation Biologic for Uncontrolled Gout Using Optimized Uricase and Optimized PEGylation Technology)\nEarlier today, the Company announced that has licensed HZN-003 (formerly MEDI4945), a potential next-generation biologic for uncontrolled gout, from MedImmune, the global biologics research and development arm of AstraZeneca. HZN-003 is a pre-clinical, genetically engineered uricase derivative with optimized uricase and optimized PEGylation technology that has the potential to improve the response rate to the biologic as well as the potential for subcutaneous dosing.\nPotential Next-Generation Biologic for Uncontrolled Gout Using PASylation Technology\nThe Company also recently entered into a collaboration agreement with XL-protein GmbH to identify clinical-stage product candidates that could use PASylation technology to construct a next-generation gout biologic. PASylation technology is a biological alternative to synthetic PEGylation and is intended to extend both the half-life of uricase and the duration of treatment for people living with uncontrolled gout, and also has the potential for subcutaneous dosing. If the collaboration agreement identifies clinical-stage candidates, the Company will have the right to license the candidates.\nKRYSTEXXA Investigator-Initiated Trials: RECIPE and TRIPLE\nIn addition to these new programs, two investigator-initiated trials will evaluate the use of immunomodulatory therapies to enhance the response rate for KRYSTEXXA. The studies will use different immunomodulators, both of which rheumatologists are very familiar with and comfortable prescribing.\nThe University of Alabama at Birmingham Division of Clinical Immunology and Rheumatology is expected to begin a clinical trial in the first quarter of 2018 evaluating the use of the immunomodulator mycophenolate mofetil (MMF) along with KRYSTEXXA to improve the response rate to the medicine. RE du C ing I mmunogenicity to P egloticas E (RECIPE) is a double-blind, placebo controlled trial is designed to evaluate if a 12-week course of immunomodulating therapy with daily MMF can safely and meaningfully prevent the incidence of an immune response to KRYSTEXXA. The study will also assess the incidence and types of adverse events and infusion reactions related to the medicine. More detailed information about the RECIPE study is available at ClinicalTrials.gov .\nThe second investigator-initiated trial is the T olerization R educes I ntolerance to P egloticase and Prolongs the Urate L owering E ffect (TRIPLE) study. An exploratory, open-label adaptive trial with multiple patient cohorts, TRIPLE will include a cohort to evaluate the impact of adding the immunomodulator azathioprine for a 2-week run-in period, followed by daily azathioprine and KRYSTEXXA every 2 weeks for a total of 13 doses. The immunomodulation arm of the study is expected to begin in the first quarter of 2018. More detailed information about the TRIPLE study is available at ClinicalTrials.gov .\nHZN-002 (Potential Targeted Novel Dexamethasone Conjugate for Inflammatory Diseases)\nThe Company has licensed an additional pipeline compound to augment its rheumatology portfolio: HZN-002, a preclinical, targeted novel dexamethasone conjugate with ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c408b2d2-8e11-4d2f-8cc4-1af586c1dd06", "https://www.globenewswire.com/Tracker?data=HFUU6poZYiBJoHbjwulu9Xb4qslhcsDdIGDQIyg1q4u4rQBmC4ORk6Z2dm55ZWAIqKmvV_MWMEQvNYeCE5qIKD6VhrJChM3RMOFtFs4Gm74H0ET0qdpfBCVcTFRP3rQjj8tqzOP0n0jvKoD7VJwqIQ==", "https://www.globenewswire.com/Tracker?data=KvM5E365xVFrE7-QcoIs7774vEOtEdLXjuz43gtjoBVe7yUq2WLXOjrS0WLmnYhL8h-a-rOmM4ZyITOgi8yZeqbx_FLa0YopeyjMIhrWrsFVXLWmJwCWmpqDSctpOTTdpg7p7LEkgKP7HjnbJLBpV1ze-yTrw_Q247mKsdO8bZ8=", "https://www.globenewswire.com/Tracker?data=tesRDLyvj0ChJqZidhohTVgJJKSL2XhUSFLIFLqSoY6a5XV6b4wB8hy9_8w0NuxM4a0vrGyZrqv6BqQ8rd_QNg==", "https://www.globenewswire.com/Tracker?data=KvM5E365xVFrE7-QcoIs787kfkGvHKZZEbb-lChcvZRVFjaVS316nQC5DHUMF54sYXXt3CJHPdnh4gen8ockCwIPWLped9oE1C-OAJXh3TobJQHOkv5GkTvPiBMzk2CvFE7GoVpym8q5sKWOEgCODnpwyOnDmnl8gIY4-qo3xAA=", "https://www.globenewswire.com/Tracker?data=VyfzYAHSzYFO9NKf23dxwxhDbb9-frw1-x0bgnFWk8I5O3gNP7G_Nl4kQiXKxVvPKpF-O6HKMMwvQlPQXJKEb68jmK3VIWw0Dfz3uQb2Gg4EawK-9gnpUkhBSMPoSi6jAEfupecYYJ1uXp8c7Bfy6yBp5Pm4sB3LeQU6qj1wdgFiyFCyGwVpmtryQLCw8etGS8q-MRU2NTW4YUwe-2qaftKn_Tnh7TnM9Yofisyk7Bo6p2GCu8YKZtPofY-sl3lrMC8-4JeTETCkd1MjaeaQwjawZlXomvLTb5zq0aRWLrMCO2P_qdaxQtfG7eFDnKqQ2Z_3U9ygTVIN8y6ZxYpuyaK8yqpgqYSqb1rGZmeu1d6eU2ci8BJIw-OPqBqu2LfHbUbNoLSJirkowcwK95TdZniEhv3BoOzFJtTyA1VkAj0kCIA5upaYjJFkU77a5t298yI26IofmZsylMNf4ZZXl3ARZk_4zYHMLcGAudh", "https://www.globenewswire.com/Tracker?data=oJwUp1TV0FG_dmY4SWr-p4_xGb27zSPPLRorxWoBykLZfwAM2YdAfPfRecs6lHrYkT5VlOqFCOaCvPjx1KE-ydK4Winl-TUpbbCvoo7VYlE=", "https://www.globenewswire.com/Tracker?data=HFUU6poZYiBJoHbjwulu9Xb4qslhcsDdIGDQIyg1q4t1bdqIWPcWb83XYQOGn52vg-i8nnNrvEcYTFCQZKQoHjYs4Rha0VRGbqYxbt5cox6xyBCfG548uJwxGdN1IzR9yQNEtGJj8EFT9qXJJxbbSQ==", "https://www.globenewswire.com/Tracker?data=rNAKYtjrdtywRM5RZvszbwMhSy6SWPF10wpLsfyyFz8QXw7lpFnzMFnxH29zdjbdVNIvmwBhZnIN0nyaiv2NJHjaLQd4rY2D5mEbLKCYcHGkWORsFM2zuToVoWjLc64F8YcVckpqZNUGqsGBF34T2CbfNakKXw_GQQRxngHDEd3hXBpJsz-nxKz4T6kEDhsFvmxzjCaD5K-aT5Tb2K1SYQEWV1aN8HFTtP7KlgwcRQ9RekmQQZ6X68bYTROw2LY9UUZjSPul8opcgmBXonZFr2I-0p7IUdODNgVxHQ2EK_2l1mfRR4pBW33_900Rw7a-3gsCFKCneZGfxM9sIIBqw1M3_u2tZGWT3S2knzpTuTpnAc--NhzoHKfybjDKsJ2RwQsEZwcZHKk5yKMJZUX8kQmZX21NdCNlgLb_-cGbRBVvvrOYVnWdlO3xaG4hSrwM-6HKIUeNQs4Rmm3N7k-gVdsXw9FAkeH8kKviJ5p", "https://www.globenewswire.com/Tracker?data=KvM5E365xVFrE7-QcoIs70ouAbcZ14EiCcWCZvk4oa1ZNldRPOzjQ8muq2MVFh7tVBUWasYbjkB-yLZ9F5EM_DwdKb7cMYYGQMVC5xt8fErnN9KBGWnMJhfekpNiO5RoyhOYh7LTSWmoorIdsCl65fVIUGK4sHay9WbRMbg5u2o=", "https://www.globenewswire.com/Tracker?data=OZlESKBXskLpT4ygoYtxAElrL969YYLggaYUDEn1YKVZQ6bdTk2dqQYsLC8tnnqke6VnEIllxEe9lbMX9bDn1aem9FEKvhEMWZxGSxoqTvk_HmhvgRcPRj-aj2-ceG4cFSLUy1MAmQCijR_eo_JSVw==", "https://www.globenewswire.com/Tracker?data=AFCUJ3oAQ-U320tOlMgrX9at5aCO-VxpTLia4b-GlsOzuZ7V-AW-ZUt1IBOhURRwuAxpLKkdLzPlKjGSMcDoqY99_9K8WSbHncoVdi1VDXMWL0xM4nLjdP8VF9aAiNnM1JoATL2GbR3Vj_upvNZVinK6dE8aTBBtlp5lV_TGka5Jt-PsZtEowDeTll6xJEJfB9XoJI2PfVxYZMEK_F_Yy8JT2fpgBdIemg19XvHUGcfPu0a-i8A_hDcnOm_6Vk2SThp0CJUkyNVlYI4t-wohxw==", "https://www.globenewswire.com/Tracker?data=V7qNVNuj4MwimhMu08qDDf0r-sh-hdYgc60nyqVnzK52Vbx3l9oDZ7vG2XAYvjhZjad2UlzWrfv8i17YLCecSqW_5zKUWkjHWfqgjwZy4Wg="], "published": "2018-01-08T15:05:00.000+02:00", "crawled": "2018-01-08T15:20:48.000+02:00", "highlightTitle": ""}