{"organizations": [], "uuid": "fa0fe6836ec1f631e5ecbd3393fd70a25764d5ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218632851&w=1200&r=LYNXMPEE000X6", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/israel-palestinians-teen/israel-indicts-palestinian-teenage-girl-who-punched-soldier-army-idINKBN1EQ143", "country": "US", "domain_rank": 408, "title": "Israel indicts Palestinian teenage girl who punched soldier - army", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T19:15:00.000+02:00", "replies_count": 0, "uuid": "fa0fe6836ec1f631e5ecbd3393fd70a25764d5ed"}, "author": "", "url": "https://in.reuters.com/article/israel-palestinians-teen/israel-indicts-palestinian-teenage-girl-who-punched-soldier-army-idINKBN1EQ143", "ord_in_thread": 0, "title": "Israel indicts Palestinian teenage girl who punched soldier - army", "locations": [], "entities": {"persons": [{"name": "ali sawafta", "sentiment": "none"}, {"name": "ahed tamimi", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "west bank", "sentiment": "none"}, {"name": "ofer prison", "sentiment": "none"}, {"name": "ramallah", "sentiment": "none"}], "organizations": [{"name": "haaretz", "sentiment": "none"}, {"name": "israeli prison service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OFER PRISON, West Bank (Reuters) - Israel indicted a 16-year-old Palestinian girl on Monday on charges including assault for punching an Israeli soldier in the face two weeks ago, an incident which made her into a hero for Palestinians and was seen as humiliating by right-wing Israelis.\nPalestinian teen Ahed Tamimi (R) enters a military courtroom escorted by Israeli Prison Service personnel at Ofer Prison, near the West Bank city of Ramallah, January 1, 2018. REUTERS/Ammar Awad Israel has held Ahed Tamimi since arresting her three days after she was filmed punching the soldier at the entrance to her family home in a village in the occupied West Bank. The confrontation took place after what Israel says was a stone-throwing assault on its troops.\nThe case has made her into such a symbol for Palestinians that a commentator in Israeli left-wing newspaper Haaretz said Israel risked turning her into the “Palestinian Joan of Arc”.\nRight-wing Israelis, meanwhile, have debated whether the soldier had appeared weak by opting not to strike back. The Israeli army said he “acted professionally” by showing restraint.\nThe charge sheet against Tamimi, seen by Reuters, included counts of aggravated assault against a soldier, who the army said was bruised on his brow by her punch, obstructing a soldier in the performance of his duty and throwing stones at troops.\n“Tamimi threw stones at them (the soldiers), threatened them, obstructed them in fulfilling their duty, took part in riots and incited others to take part in them,” the military said on its public affairs Twitter account.\nPalestinian teen Ahed Tamimi (C-R) speaks to her lawyer Gaby Lasky in the military courtroom at Ofer Prison, near the West Bank city of Ramallah, January 1, 2018. REUTERS/Ammar Awad Tamimi’s lawyer, Gaby Lasky, said she was certain some of the charges would eventually be dismissed, but nonetheless prosecutors may seek the maximum penalty for other counts.\n“I am sure they want to keep her as long as possible because they don’t want the voice of resistance outside prison,” Lasky told Reuters at the military courtroom in Ofer prison near the Palestinian city of Ramallah.\nSlideshow (2 Images) Tamimi was not asked to enter a plea at this stage. The military court gave her lawyer more time to study the charges.\nAn adult found guilty of assaulting a soldier could be jailed for up to 10 years, but such an outcome would be unlikely for Tamimi as a minor.\nThe incident occurred at the entrance to Tamimi’s family home in the West Bank village of Nabi Saleh, where weekly protests against Israeli settlement policy have been held for years. Tamimi’s father is a prominent Palestinian activist.\nTamimi made news two years ago when she was pictured biting a soldier who tried to arrest her younger brother. In 2012 she was presented with an award in Turkey and met its president, Tayyip Erdogan, after images of her confronting an Israeli soldier went viral.\nReporting by Ali Sawafta and Maayan Lubell; Writing by Maayan Lubell; Edtitng by Peter Graff\n ", "external_links": [], "published": "2018-01-01T19:15:00.000+02:00", "crawled": "2018-01-01T19:33:52.053+02:00", "highlightTitle": ""}