{"organizations": [], "uuid": "9441614f3b39a9e3109a93f8b61946fc120d3123", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-oakwood-worldwide-bolsters-leadership-team-to-help-drive-global-transformation-strategy.html", "country": "US", "domain_rank": 767, "title": "Oakwood Worldwide Bolsters Leadership Team To Help Drive Global Transformation Strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-17T20:01:00.000+02:00", "replies_count": 0, "uuid": "9441614f3b39a9e3109a93f8b61946fc120d3123"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-oakwood-worldwide-bolsters-leadership-team-to-help-drive-global-transformation-strategy.html", "ord_in_thread": 0, "title": "Oakwood Worldwide Bolsters Leadership Team To Help Drive Global Transformation Strategy", "locations": [], "entities": {"persons": [{"name": "tiffany felix", "sentiment": "none"}, {"name": "christine moore", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "tj spencer", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "oakwood", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}], "organizations": [{"name": "oakwood worldwide", "sentiment": "negative"}, {"name": "emea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 17, 2018 /PRNewswire/ -- Oakwood Worldwide, the global leader in furnished and serviced apartments, today announced the appointment of TJ Spencer as vice president global sales, Christine Moore as vice president global marketing and Tiffany Felix as vice president global corporate services, enterprise risk and compliance. The announcement supports Oakwood's transformation strategy as it looks to accelerate long-term growth for the organization by aligning resources to better serve the changing needs of the market.\nSpencer joined Oakwood in 1991 and has served in a wide variety of sales and operations leadership roles during her tenure. She has an extensive knowledge of the company's global offering having led efforts to expand and subsequently manage both sales and operations in EMEA and Asia Pacific. Spencer has been active in the relocation industry for more than 20 years and was instrumental in establishing Oakwood's global program for third-party relocation customers. In her new role as the company's global head of sales, Spencer will expand her previous responsibilities by developing and leading global sales strategies and activating these regionally.\nJoining Oakwood in 2011, Moore has been responsible for leadership and management of all global marketing functions including strategic planning, brand strategy, b2b and b2c marketing strategies, digital marketing and global communications. During her tenure with Oakwood she has overseen double-digit growth of e-channels revenue, guided the repositioning of the brand portfolio and spearheaded efforts to revamp the organizations digital presence. In her expanded role as the company's head of marketing, Moore will be tasked with bringing greater alignment and integration to the company's global marketing capabilities and driving global growth across an expanded product offering.\nFelix, who joined Oakwood in 2017, is tasked with building and leading a department encompassing several key functional areas including enterprise risk, business continuity, crisis management, insurance, property services, compliance and legal. Felix brings more than 25 years of experience in risk management, having managed global teams across a broad range of industries. Prior to joining Oakwood, she most recently worked for American Apparel, where she led several cross-functional, global teams including environmental health and safety, corporate social responsibility and global compliance, all while minimizing risk and liability across the organization. Prior to her tenure at American Apparel, Felix worked for a variety of companies and industries including NBC Universal/Comcast, ESPN, Ingram Micro and Nissan Motor Corporation.\n\"As we continue to build and strengthen Oakwood Worldwide into a market-centric, integrated company, we are excited to continue to expand our arsenal of talent,\" said Chris Ahearn, Chief Executive Officer, Oakwood Worldwide. \"With their strong skillset, diverse experiences and expertise in the market, Spencer, Moore and Felix will help us execute our strategy while maintaining focus on the evolving needs of our clients and guests, solidifying Oakwood's leadership position in the marketplace.\"\nView all Oakwood Worldwide press releases online.\nAbout Oakwood Worldwide ®\nOakwood Worldwide®, a wholly owned subsidiary of Mapletree Investments, is the premier provider of furnished and serviced apartments through its well-known brands, Oakwood®, ExecuStay® and Insurance Housing Solutions™. With a presence in all 50 United States and more than 95 countries, the award-winning company provides move-in-ready furnished accommodations to meet the needs of global organizations, individual business travelers, insurance clients and leisure travelers alike. Oakwood Worldwide was founded in and continues to base its corporate headquarters in Los Angeles and operates regional headquarters in London, Phoenix and Singapore. For more information, please visit OakwoodWorldwide.com .\nMEDIA Contact:\nLela Randall\nDirect: 1.714.913.9945\nEmail: lelarandall@hkstrategies.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/oakwood-worldwide-bolsters-leadership-team-to-help-drive-global-transformation-strategy-300584010.html\nSOURCE Oakwood Worldwide", "external_links": ["http://www.oakwoodworldwide.com/press-releases/", "http://www.prnewswire.com/news-releases/oakwood-worldwide-bolsters-leadership-team-to-help-drive-global-transformation-strategy-300584010.html", "http://oakwoodworldwide.com/"], "published": "2018-01-17T20:01:00.000+02:00", "crawled": "2018-01-17T21:25:47.009+02:00", "highlightTitle": ""}