{"organizations": [], "uuid": "01b2d4d835ab2067613535b2794abc0fb2a8bff0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225223442&w=1200&r=LYNXMPEE0O1ER", "site_section": "http://feeds.reuters.com/news/wealth?format=xml", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-money-entertainment-pets/soothe-the-financial-bite-of-a-bad-dog-idUSKBN1FE2LQ", "country": "US", "domain_rank": 408, "title": "Soothe the financial bite of a 'bad' dog", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:50:00.000+02:00", "replies_count": 0, "uuid": "01b2d4d835ab2067613535b2794abc0fb2a8bff0"}, "author": "", "url": "https://www.reuters.com/article/us-money-entertainment-pets/soothe-the-financial-bite-of-a-bad-dog-idUSKBN1FE2LQ", "ord_in_thread": 0, "title": "Soothe the financial bite of a 'bad' dog", "locations": [], "entities": {"persons": [{"name": "chris taylor", "sentiment": "negative"}, {"name": "marley", "sentiment": "none"}, {"name": "john grogan", "sentiment": "none"}, {"name": "pietro reviglio", "sentiment": "none"}], "locations": [{"name": "turin", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "aspca", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK(Reuters) - Try to imagine the “world’s worst dog,” and you probably think of the incorrigible Marley, from John Grogan’s bestselling book and big-screen adaptation “Marley & Me.”\nBut virtually everyone knows a pup who leaves a trail of destruction in their wake. Cute? Sometimes. Expensive? Frequently.\nJust owning a dog can be a pricy proposition: first-year costs average $1,471 for a small dog, $1,779 for a medium-sized dog and almost $2,008 for a large dog, according to the ASPCA.\nThrow in mangled Louboutin heels, some chewed-up furniture - and a lawsuit or two - and you are talking serious money.\nExhibit A: Dodo, an 8-year-old mixed terrier with a long record of misdeeds. Over the years living in Turin, Italy, Pietro Reviglio, a 41-year-old artist and filmmaker, has tallied up this bill: chewed up euro bills ($50), computer cables ($90) and various items of clothing ($250).\nThen there are Dodo’s “biggest enemies” - doors - which the dog has assaulted to the tune of $12,500 in damages.\nReviglio has shelled out $750 for dog training and $150 for a behaviorist, who tried prescribing pills to curb Dodo’s aggressive behavior, to no avail. And the trainer ended up with a bloody thumb.\n“A priest even sprinkled him with holy water, but Dodo didn‘t appreciate it and chased him out of the house,” Reviglio said.\nIf you have a mischievous dog, you have to be careful about more than just household items that might get chewed.\n“Dogs that are curious and adventurous can cause a lot of financial distress,” said Rob Jackson, CEO and co-founder of pet insurer Healthy Paws.\nIf you have a dog that tends to love trouble, consider these remedies:\n* Insure the dog\nPet health insurance is one easy way to fend off expenses from indiscriminate chewers. While monthly premiums vary on factors like age, location and breed, Jackson says coverage for a two-year-old mixed breed might run you about $40 a month.\nThis will cover some extremely common mishaps, such as when chewed objects get lodged in their systems. The diagnostics alone can cost $1,000-$1,500, said Jackson. And if surgery is needed to get it out, that is another $3,000 minimum.\nStomach issues, often resulting from unapproved munchies, are the No. 1 condition for both dogs and cats, according to the latest “Cost of Pet Health Care” report from Healthy Paws.\n* Insure yourself\nIf you dog eats your kid’s homework, that can be replaced easily enough. If your dog bites another dog or a person, that is serious business.\nInjuries could run into the tens of thousands of dollars. And it is more common than you might realize. According to the Center for Disease Control and Prevention, around 4.5 million Americans get bitten by dogs every year.\nHomeowners’ insurance policies typically cover such events – and, in fact, dog bites are among the top claims filed under such policies every year. Securing additional umbrella liability - say, another $1 million in coverage that sits atop your other policies, for a few hundred bucks a year - is also an extremely wise idea.\nThat will give you some peace of mind when your yellow lab smashes into an elderly lady and topples her over - as happened to San Francisco writer and editor John Diaz, whose says his dog Paws rivaled Marley for the “world’s worst” designation. While he was not sued, it was easily his “most harrowing moment” of being a dog owner, said Diaz.\n* Get training - for you and the dog. But invest early, while your dog is young.\n“Money spent quickly, up front, can save you a lot of emotional and financial heartaches down the road,” said Jackson. The American Kennel Club estimates an average of $340 for initial training, and an additional $254/year for ongoing training thereafter.\nToronto’s Corey Goldman went this route when his miniature Australian Shepherd Ollie started throwing his tiny weight around.\n“He would nip at people, tear things apart, terrorize the kids. He’s very alpha - and we didn’t know if we could take much more,” said Goldman, a financial-services writer who noted Ollie finally settled down after $1,600 worth of training sessions.\nEditing by Beth Pinsker and G Crosse\n ", "external_links": [], "published": "2018-01-25T19:50:00.000+02:00", "crawled": "2018-01-25T20:05:50.000+02:00", "highlightTitle": ""}