{"organizations": [], "uuid": "965ee7fa2af9601e72ecb1e28cdb36eb4bc724f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218567155&w=1200&r=LYNXMPEE000P6", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pakistan-militants-exclusive/exclusive-pakistan-plans-takeover-of-charities-run-by-islamist-figure-u-s-has-targeted-idUSKBN1EQ0T6", "country": "US", "domain_rank": 408, "title": "Exclusive: Pakistan plans takeover of charities run by Islamist figure U.S. has targeted", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T11:10:00.000+02:00", "replies_count": 0, "uuid": "965ee7fa2af9601e72ecb1e28cdb36eb4bc724f0"}, "author": "", "url": "https://www.reuters.com/article/us-pakistan-militants-exclusive/exclusive-pakistan-plans-takeover-of-charities-run-by-islamist-figure-u-s-has-targeted-idUSKBN1EQ0T6", "ord_in_thread": 0, "title": "Exclusive: Pakistan plans takeover of charities run by Islamist figure U.S. has targeted", "locations": [], "entities": {"persons": [{"name": "asif shahzad", "sentiment": "none"}, {"name": "saeed", "sentiment": "none"}, {"name": "hafiz saeed", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "jamaat-ud-dawa", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "falah-e-insaniat foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 9:11 AM / in 8 hours Exclusive: Pakistan plans takeover of charities run by Islamist figure U.S. has targeted Asif Shahzad 6 Min Read \n(Reuters) - Pakistan’s government plans to seize control of charities and financial assets linked to Islamist leader Hafiz Saeed, who Washington has designated a terrorist, according to officials and documents reviewed by Reuters. \nPakistan’s civilian government detailed its plans in a secret order to various provincial and federal government departments on Dec. 19, three officials who attended one of several high-level meeting discussing the crackdown told Reuters. \nMarked “secret”, a Dec. 19 document from the finance ministry directed law enforcement and governments in Pakistan’s five provinces to submit an action plan by Dec. 28 for a “takeover” of Saeed’s two charities, Jamaat-ud-Dawa (JuD) and the Falah-e-Insaniat Foundation. \nThe United States has labeled JuD and FIF “terrorist fronts” for Lashkar-e-Taiba (“Army of the Pure” or LeT), a group Saeed founded in 1987 and which Washington and India blame for the 2008 attacks in Mumbai that killed 166 people. \nSaeed has repeatedly denied involvement in the Mumbai attacks and a Pakistani court saw insufficient evidence to convict him. The LeT could not be reached for comment. \nThe Dec. 19th document, which refers to “Financial Action Task Force (FATF) issues”, names only Saeed’s two charities and “actions to be taken” against them. \nThe FATF, which is an international body that combats money laundering and terrorist financing, has warned Pakistan it faces inclusion on a watch list for failing to crack down on financing terrorism. \nAsked about a crackdown on JuD and FIF, Interior Minister Ahsan Iqbal, who co-chaired one of the meetings on the plan, responded only generally, saying he has ordered authorities “to choke the fundraising of all proscribed outfits in Pakistan”. \nIn a written reply to Reuters, he also said Pakistan wasn’t taking action under U.S. pressure. “We’re not pleasing anyone. We’re working as a responsible nation to fulfill our obligations to our people and international community.” \nSpokesmen for the JuD and FIF both said they could not comment until they receive official notifications of the government’s plans. “We don’t have any intimation about any crackdown so far,” FIF spokesman Salman Shahid told Reuters. “No one has asked us about our work or assets.” \nSaeed could not be reached for comment. He has frequently denied having ties to militants and says the charitable organizations he founded and controls have no terrorism ties. He says he promotes an Islamic-oriented government through doing good works. FILE PHOTO: Hafiz Saeed (C) reacts to supporters as he walks out of court after a Pakistani court ordered his release from house arrest in Lahore, Pakistan November 22, 2017. REUTERS/Mohsin Raza/File Photo FIRST MAJOR MOVE \nIf the government follows through with the plan, it would mark the first time Pakistan has made a major move against Saeed’s network, which includes 300 seminaries and schools, hospitals, a publishing house and ambulance services. The JuD and FIF alone have about 50,000 volunteers and hundreds of other paid workers, according to two counter-terrorism officials. \nParticipants at the meeting raised the possibility that the government’s failure to act against the charities could lead to U.N. sanctions, one of the three officials said. A U.N. Security Council team is due to visit Pakistan in late January to review progress against U.N.-designated “terrorist” groups. \n“Any adverse comments or action suggested by the team can have far-reaching implications for Pakistan,” the official said. \nThe Dec. 19th document gave few details about how the state would take over Saeed’s charities, pending the plans submitted from the provincial governments. It did say it would involve government entities taking over ambulance services and accounting for other vehicles used by the charities. \nIt says law enforcement agencies will coordinate with Pakistan’s intelligence agencies to identify the assets of the two charities and examine how they raise money. \nThe document also directs that the name of JuD’s 200-acre headquarters, Markaz-e-Taiba, near the eastern city of Lahore be changed to something else ”to make it known that the Government of “Punjab (province) solely manages and operates the Markaz(headquarters)”. \nThe move to seize the charities could spark some concern from the powerful military, which has proposed plans to steer Saeed and the JuD into mainstream politics. The military did not respond to a request for comment. \nIn August, JuD officials formed a new political party, the Milli Muslim League, and backed candidates who fared relatively strongly in two key parliamentary by-elections. \nThe JuD publicly disavows armed militancy inside Pakistan, but offers vocal support for the cause of rebel fighters in Indian-administered Kashmir and has called for Pakistan to retake Kashmir. Nuclear-armed India and Pakistan have fought two wars over the disputed region. \nWashington, which has offered a $10 million reward for information leading to Saeed’s conviction over the Mumbai attacks, warned Islamabad of repercussions after a Pakistani court in late November released him from house arrest. \nPunjab’s provincial government had put Saeed under house arrest for 10 months this year for violating anti-terrorism laws. Additional reporting by Drazen Jorgic; Editing by Bill Tarrant", "external_links": [], "published": "2018-01-01T11:10:00.000+02:00", "crawled": "2018-01-01T11:31:55.019+02:00", "highlightTitle": ""}