{"organizations": [], "uuid": "52a375cd9d4d09f17aa1cec5d343d8bfea1cb1db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/22/103572265-GettyImages-454968352.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/mark-cuban-bill-gates-steve-jobs-why-failure-is-key-to-success.html", "country": "US", "domain_rank": 767, "title": "Mark Cuban, Bill Gates, Steve Jobs: Why failure is key to success", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:52:00.000+02:00", "replies_count": 0, "uuid": "52a375cd9d4d09f17aa1cec5d343d8bfea1cb1db"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/23/mark-cuban-bill-gates-steve-jobs-why-failure-is-key-to-success.html", "ord_in_thread": 0, "title": "Mark Cuban, Bill Gates, Steve Jobs: Why failure is key to success", "locations": [], "entities": {"persons": [{"name": "steve jobs", "sentiment": "negative"}, {"name": "bill gates", "sentiment": "negative"}, {"name": "thomas curran", "sentiment": "none"}, {"name": "indi", "sentiment": "none"}, {"name": "mark cuban failure", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On college campuses, the pressure to be perfect is skyrocketing, according to a new study on perfectionism . \n\"[F]indings suggest that recent generations of college students have higher expectations of themselves and others than previous generations,\" says Thomas Curran, lead author of the study, which surveyed over 41,000 American, British and Canadian college students from the late 1980s to 2016. \"Today's young people are competing with each other in order to meet societal pressures to succeed....\"\nBut striving incessantly for success can be detrimental. Studies have shown that perfectionists are more likely to struggle with depression or anxiety. And in fact, according to some of the most successful people in the world, failing once in awhile is actually important.\nHere's what five self-made billionaires have to say about embracing failure.\nMark Cuban Failure is a learning experience, according to tech entrepreneur Mark Cuban, whose current net worth is $3 billion . Early on, he made plenty of flubs himself.\n\"I had quit or been fired from three straight jobs,\" after graduating Indiana University, says Cuban in an interview on ABC's \"Shark Tank,\" where he is an investor.\n\"I truly believe each and every one of us is really good at something. Right? The hard part is finding out what that is and going through all the different — kissing all the frogs before you find the prince of the job, right?\" Cuban says on The Thrive Global Podcast. \"And I think you have to try and experience as many things as you can, and once you get there then try to be as good as you can at it.\n\"When you're 22, 23, 24, there's no such thing as failure, really,\" Cuban says on the podcast.\nBill Gates While he's now one of the richest men in the world with a net worth of $92 billion , Microsoft founder Bill Gates has dealt with his share of failures, like an attempt at TV-style internet shows that ended up flopping. Gates says that the weight of it all could have made him depressed, but instead he accepted those experiences as challenges and learned from them. \n\"Once you embrace unpleasant news not as a negative but as evidence of a need for change, you aren't defeated by it,\" Gates says in his book \"Business @the Speed of Thought: Succeeding in the Digital Economy.\"\n\"You're learning from it. It's all in how you approach failures.\"\nSara Blakely Sara Blakely survived a slew of early career failures, including tanking the LSAT twice, before launching her shapewear empire. For her, embracing failure allows her to take risks, like starting Spanx out of her apartment. That paid off big — she's now worth $1.9 billion .\nIn fact, failure was actually celebrated in her house as a kid. Blakely says at dinnertime her father would often ask, \"What have you failed at this week?\" \n\"I can vividly remember saying 'Dad, I tried out for this, and I was horrible,' and he would high-five me and say 'Way to go,'\" Blakely tells CNBC's \"Squawk Box .\" \n\"My dad growing up encouraged me and my brother to fail,\" adds Blakely, calling it a \"gift. \"It's really allowed me to be much freer in trying things and spreading my wings in life.\"\nSteve Jobs His own morality helped Apple founder Steve Jobs put failure in perspective. \n\"Remembering that I'll be dead soon is the most important tool I've ever encountered to help me make the big choices in life,\" Jobs said in a 2005 commencement speech at Stanford University. Jobs passed away from cancer in 2011.\n\"All fear of embarrassment or failure — these things just fall away in the face of death, leaving only what is truly important. Remembering that you are going to die is the best way I know to avoid the trap of thinking you have something to lose.\"\nRichard Branson Virgin Group founder and billionaire Richard Branson, whose net worth is $5 billion , says that learning from failure is one of the five skills and abilities that successful entrepreneurs share.\n\"Nobody gets everything right the first time. Business is like a giant game of chess — you have to learn quickly from your mistakes,\" Branson writes in a blog post . \"Successful entrepreneurs don't fear failure; they learn from it and move on.\"\nDon't miss : Warren Buffett says cryptocurrencies won't end well—here's how accurate his past financial predictions have been \nshow chapters How Bill Gates, Serena Williams, Mark Cuban and others spent their first big paychecks      10:14 AM ET Wed, 3 Jan 2018 | 01:35 Like this story? Like CNBC Make It on Facebook ! \nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": ["https://www.forbes.com/profile/richard-branson/", "http://www.health.com/depression/why-perfectionism-could-be-killing-you", "https://www.forbes.com/profile/sara-blakely/", "http://www.apa.org/news/press/releases/2018/01/perfectionism-young-people.aspx", "https://www.forbes.com/profile/mark-cuban/", "https://journal.thriveglobal.com/mark-cuban-on-his-stormy-relationship-with-donald-trump-and-if-hell-ever-run-for-president-b6aadff31af5", "https://www.forbes.com/profile/bill-gates/", "https://www.nytimes.com/2018/01/18/well/family/more-college-students-seem-to-be-majoring-in-perfectionism.html", "https://www.facebook.com/CNBCMakeIt/", "https://news.stanford.edu/2005/06/14/jobs-061505/", "http://abc.go.com/shows/shark-tank/episode-guide/season-08/11-episode-11", "https://www.virgin.com/richard-branson/5-skills-and-abilities-successful-entrepreneurs-share"], "published": "2018-01-23T22:52:00.000+02:00", "crawled": "2018-01-23T22:02:24.079+02:00", "highlightTitle": ""}