{"organizations": [], "uuid": "dc28aa0da440b1826704e842aaca6fae223c1e58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933133-Webp.net-resizeimage.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/oil-tanker-burning-off-china-coast-at-risk-of-exploding.html", "country": "US", "domain_rank": 767, "title": "Oil tanker burning off China’s coast at risk of exploding", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T10:52:00.000+02:00", "replies_count": 0, "uuid": "dc28aa0da440b1826704e842aaca6fae223c1e58"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/oil-tanker-burning-off-china-coast-at-risk-of-exploding.html", "ord_in_thread": 0, "title": "Oil tanker burning off China’s coast at risk of exploding", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "east china sea", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}, {"name": "hong kong-registered", "sentiment": "none"}], "organizations": [{"name": "china central television", "sentiment": "none"}, {"name": "ministry of transport", "sentiment": "none"}, {"name": "u.s. navy", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Renewable Energy Oil tanker burning off China’s coast at risk of exploding State broadcaster China Central Television, citing Chinese officials, said none of the 32 people who have been missing since the collision late Saturday have been found as of 8 am Monday. The Panama-registered tanker Sanchi was sailing from Iran to South Korea when it collided late Saturday with the Hong Kong-registered freighter CF Crystal in the East China Sea. Published 10 Hours Ago SHARES CCTV via AP Video Panama-registered tanker \"Sanchi\" is seen ablaze after a collision with a Hong Kong-registered freighter off China's eastern coast. \nAn Iranian oil tanker that caught fire after colliding with a freighter off China's east coast is at risk of exploding and sinking, Chinese state media reported Monday as authorities from three countries struggled to find its 32 missing crew members and contain oil spewing from the blazing wreck. \nState broadcaster China Central Television, citing Chinese officials, said none of the 30 Iranians and two Bangladeshis who have been missing since the collision late Saturday have been found as of 8 a.m. Monday. Meanwhile, search and cleanup efforts have been hampered by fierce fires and poisonous gases that have completely consumed the tanker and surrounding waters, CCTV reported. \nThe Panama-registered tanker Sanchi was sailing from Iran to South Korea when it collided late Saturday with the Hong Kong-registered freighter CF Crystal in the East China Sea, 257 kilometers (160 miles) off the coast of Shanghai, China's Ministry of Transport said. \nChina, South Korea and the U.S. have sent ships and planes to search for Sanchi's crew, all of whom remain missing. The U.S. Navy, which sent a P-8A aircraft from Okinawa, Japan, to aid the search, said late Sunday that none of the missing crew had been found. \nAll 21 crew members of the Crystal, which was carrying grain from the United States to China, were rescued, the Chinese ministry said. The Crystal's crew members were all Chinese nationals. \nIt wasn't immediately clear what caused the collision. \nState-run China Central Television reported Sunday evening that the tanker was still floating and burning, and that oil was visible in the water. Photos distributed by the South Korean government showed the tanker on fire and shrouded in thick black smoke. \nChinese authorities dispatched three ships to clean the oil spill. The size of the oil slick caused by the accident is not known. \nThe Sanchi was carrying 136,000 metric tons (150,000 tons, or nearly 1 million barrels) of condensate, a type of ultra-light oil, according to Chinese authorities. \nBy comparison, the Exxon Valdez was carrying 1.26 million barrels of crude oil when it spilled 260,000 barrels into Prince William Sound off Alaska in 1989. \nThe Sanchi has operated under five different names since it was built in 2008, according the U.N.-run International Maritime Organization. The IMO listed its registered owner as Hong Kong-based Bright Shipping Ltd., on behalf of the National Iranian Tanker Co., a publicly traded company based in Tehran. The National Iranian Tanker Co. describes itself as operating the largest tanker fleet in the Middle East. \nAn official in Iran's Oil Ministry, who spoke to The Associated Press on condition of anonymity because he was not authorized to speak to reporters, said 30 of the tanker's 32 crew members were Iranians. \n\"We have no information on their fate,\" he said Sunday. \"We cannot say all of them have died, because rescue teams are there and providing services.\" \nThe official said the tanker was owned by the National Iranian Tanker Co. and had been rented by a South Korean company, Hanwha Total Co. He said the tanker was on its way to South Korea. \nHanwa Total is a 50-50 partnership between the Seoul-based Hanwha Group and the French oil giant Total. Total did not immediately respond to a request for comment. \nIt's the second collision for a ship from the National Iranian Tanker Co. in less than a year and a half. In August 2016, one of its tankers collided with a Swiss container ship in the Singapore Strait, damaging both ships but causing no injuries or oil spill.", "external_links": [], "published": "2018-01-08T10:52:00.000+02:00", "crawled": "2018-01-08T11:01:43.015+02:00", "highlightTitle": ""}