{"organizations": [], "uuid": "abe967c445f64c1da9ba583ae7ca305a415b418c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221219821&w=1200&r=LYNXMPEE0A1OL", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-eurozone-greece-strike/greeks-to-strike-over-right-to-strike-bill-idUSKBN1F01LQ", "country": "US", "domain_rank": 408, "title": "Greeks to strike over right-to-strike bill", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.106, "site_type": "news", "published": "2018-01-11T21:02:00.000+02:00", "replies_count": 0, "uuid": "abe967c445f64c1da9ba583ae7ca305a415b418c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eurozone-greece-strike/greeks-to-strike-over-right-to-strike-bill-idUSKBN1F01LQ", "ord_in_thread": 0, "title": "Greeks to strike over right-to-strike bill", "locations": [], "entities": {"persons": [{"name": "dimitris karageorgo", "sentiment": "none"}], "locations": [{"name": "athens", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "oecd", "sentiment": "none"}, {"name": "gsee", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATHENS (Reuters) - Greek subway workers, dockers and state-employed doctors plan to strike on Friday in the country’s first major industrial action of 2018, to protest a new law that will restrict their right to walk off the job.\nParliament is expected on Jan. 15 to vote through the contentious reform, which would tighten rules on declaring work stoppages, a condition set by creditors who have loaned Greece billions since 2010.\nAt present, Greek unions can call strikes with the support of one third of their members. The new law would raise that requirement to 50 percent, which creditors hope would limit the frequency of strikes and improve productivity that lags about 20 percent behind the EU average, according to OECD data.\nStrikes are so common in Greece that there is a website dedicated to them.\nFriday’s stoppage is being backed by several unions, including GSEE, the largest private-sector one.\n“It is essentially scrapping the only weapon workers have left to protect themselves, particularly after collective working agreements were shelved,” said GSEE spokesman Dimitris Karageorgopoulos.\nStavros Kafounis, head of the Commercial Association of Athens, which represents retailers, said strikes amplified the country’s economic problems.\n“Every time there is labour action in public transport it shuts businesses down, adding to already slow business,” he said.\nBITTER PILL A majority of lawmakers are expected to vote in favor of the bill, which will be a bitter pill to swallow for a government dominated by the leftist Syriza movement.\nWith its roots in labor activism, the party swept to power in 2015 promising to end austerity, only to accept another bailout months later.\nHundreds of Greeks marched through Athens on Tuesday and confronted authorities demanding the bill be rescinded. Labour Minister Effie Achtsioglou refused.\nGreece needs to pass the regulation and a raft of other measures for lenders to sign off on a review of progress in its bailout program, which the country hopes to exit this summer.\nMonday’s parliamentary bill also seeks to introduce electronic auctions that could facilitate foreclosures to wrestle down a mountain of toxic debts weighing on the country’s banks, rationalize spending on state benefits, set targets for selling off assets of power utility PPC, and regulations on the operation of casinos.\nOne union leader said that, regardless of new legislation, workers would continue to strike.\n“If they don’t like it let them fire us... or arrest us,” said Spyros Revithis, head of a public transport workers’ union that staged 15 strikes in 2017.\n“This government is a Trojan Horse of neo-liberalism on labor rights.”\nWriting by Michele Kambas; editing by John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T21:02:00.000+02:00", "crawled": "2018-01-11T21:53:41.038+02:00", "highlightTitle": ""}