{"organizations": [], "uuid": "45d6543d2ff46d36049c0c2d787f924494944fd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220871508&w=1200&r=LYNXMPEE0914Q", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-funds-pimco/pimcos-ivascyn-says-pimco-would-consider-adding-treasuries-on-further-weakness-idUSKBN1EZ21L", "country": "US", "domain_rank": 408, "title": "Pimco's Ivascyn says Pimco would consider adding Treasuries on further weakness", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:18:00.000+02:00", "replies_count": 0, "uuid": "45d6543d2ff46d36049c0c2d787f924494944fd1"}, "author": "", "url": "https://www.reuters.com/article/us-funds-pimco/pimcos-ivascyn-says-pimco-would-consider-adding-treasuries-on-further-weakness-idUSKBN1EZ21L", "ord_in_thread": 0, "title": "Pimco's Ivascyn says Pimco would consider adding Treasuries on further weakness", "locations": [], "entities": {"persons": [{"name": "ivascyn", "sentiment": "negative"}, {"name": "jennifer ablan", "sentiment": "none"}, {"name": "dan ivascyn", "sentiment": "none"}, {"name": "richard leong", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "pimco", "sentiment": "negative"}, {"name": "allianz se", "sentiment": "none"}, {"name": "u.s. treasuries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pacific investment management co", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Pimco, one of the world’s biggest money managers, sees this week’s U.S. bond market selloff as a buying opportunity and is not ready to call the spike in 10-year Treasury yield to a nine-month high a bear market precursor. \nDan Ivascyn, the group chief investment officer at Pacific Investment Management Co, told Reuters on Wednesday he would consider adding U.S. Treasuries to the firm’s portfolios if the bond market weakens further. \nThe $14 trillion Treasury market has been roiled in the past 48 hours. On Tuesday, the Bank of Japan said it would trim its purchases of Japanese government bonds, raising speculation it will reduce its monetary stimulus this year. \nOn Wednesday, Bloomberg News reported that officials in China, the largest foreign holder of U.S. government debt, had recommended the country slow down or halt its purchases of the bonds amid a less attractive market for them and rising U.S.-China trade tensions. \nChina had $1.19 trillion in Treasuries as of October 2017, data from the Treasury Department show. \nU.S. yields jumped broadly with the two-year yield hitting 1.985 percent on Wednesday, the highest level since Sept. 2008. The benchmark 10-year yield touched 2.597 percent, its loftiest level since March, according to Reuters data. \nIvascyn said shorter-dated U.S. Treasuries are “looking more interesting at these levels” and that Pimco “prefers (the) front end” of the U.S. Treasury yield curve. \nPimco, a unit of German insurer Allianz SE, oversaw more than $1.69 trillion in assets under management as of Sept. 30, 2017. \n“There’s a lot going on behind the scenes, regarding trade and North Korea,” Ivascyn said. “This is likely a warning shot that can lead to a bit of volatility short term. The U.S. and China trade policy is a legit risk in 2018.” \n“With all that said, and similar to our views from a year or so ago, it remains premature to declare beginnings of bear markets,” he added. \nOthers are not so sure. \nOn Tuesday, Bill Gross, the high-profile fixed-income investor, tweeted: “Bond bear market confirmed today. 25 year long-term trendlines broken in 5yr and 10yr maturity Treasuries.” Gross revealed on Wednesday that his main fund had made a bearish bet on the bond market. \nThe Janus Henderson manager said his $2.2 billion Global Unconstrained Bond Fund had taken a short position on Treasuries, U.K. gilts and German Bunds. In an interview with Bloomberg, he said that there appears to be a “negative type of posture for bonds.” \nFor his part, Jeffrey Gundlach, known on Wall Street as the ‘Bond King’, said on an investor webcast on Tuesday that if the 10-year Treasury yield pushes above 2.63 percent, it will accelerate higher. \nThat 10-year yield level Gundlach referred to was a level last seen a day before the Federal Reserve raised interest rates at its March 14-15 policy meeting. \nReporting By Jennifer Ablan and Richard Leong; Editing by Susan Thomas\n ", "external_links": [], "published": "2018-01-10T18:18:00.000+02:00", "crawled": "2018-01-10T18:27:22.022+02:00", "highlightTitle": ""}