{"organizations": [], "uuid": "e40cc4d8d1adbc736967c5ba6e4e9d423accc6b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-motor-f1-mclaren-brown/revitalized-mclaren-now-need-to-deliver-idUSKBN1F02G1", "country": "US", "domain_rank": 408, "title": "Revitalized McLaren now need to deliver", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:54:00.000+02:00", "replies_count": 0, "uuid": "e40cc4d8d1adbc736967c5ba6e4e9d423accc6b3"}, "author": "", "url": "https://www.reuters.com/article/us-motor-f1-mclaren-brown/revitalized-mclaren-now-need-to-deliver-idUSKBN1F02G1", "ord_in_thread": 0, "title": "Revitalized McLaren now need to deliver", "locations": [], "entities": {"persons": [{"name": "alan bal", "sentiment": "negative"}, {"name": "zak brown", "sentiment": "none"}, {"name": "lewis hamilton", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "mclaren", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "mclaren", "sentiment": "negative"}, {"name": "ferrari", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 5:55 PM / Updated 2 hours ago Revitalized McLaren now need to deliver Alan Baldwin 4 Min Read \nBIRMINGHAM, England (Reuters) - McLaren say their decision to ditch Honda and switch to Renault engines is paying dividends already as the former champions prepare for a new Formula One season after a three-year nightmare. \nExecutive director Zak Brown told Reuters on Thursday that morale had soared and sponsors were once again showing an interest. \n“The change has been a very big motivational boost to staff, drivers, existing partners, future partners,” he said at the Autosport International show. \n”We’ve signed a few (sponsors) that we’re going to start announcing in January. \n“Last year was unsellable, so it’s made a significant difference already. Now we need to deliver.” \nMcLaren are the second most successful team in the sport after Ferrari, in terms of races won, but those glory days are becoming a distant memory. \nThe Woking-based outfit have not won a race since 2012 and last took a driver’s championship with a young Lewis Hamilton in 2008. Hamilton is now 33 and a four times champion, the last three of them with Mercedes. \nMcLaren ended 2017 ninth of 10 teams, their relationship with Honda pushed beyond breaking point and double world champion Fernando Alonso and Belgian Stoffel Vandoorne increasingly frustrated. \nIt should not be hard to improve on that with an engine that won three races in the back of a Red Bull. GOOD CHASSIS \n“We’re very eager to get to Australia,” said Brown, referring to the March 25 season-opener. \n”We’ve obviously had a significant power deficit that we think Renault will fix for us and that should get us back towards the front of the field. What slot I don’t know, but it will be towards the front. \n“We had a really good chassis last year. We know the majority of what we put on the chassis over the year correlated and worked,” added the American. “The improvement that you saw over the year, the most significant part of that was our chassis development.” \nBrown hoped McLaren might finally end their win drought, and were aiming for that to be a possibility, but was under no illusions about the task ahead. \nThe top three teams -- champions Mercedes, Ferrari and Red Bull -- took all but one podium last year. \n“We think we can be on the podium, but it’s tough,” he said. \nHonda have now moved on to partner Toro Rosso, another new chapter starting this season, and Brown said there was no point mulling over what could or should have been. \nThat said, he admitted he would have been more than nervous if they had stayed together. \n“Year one was understandable, year two improved, year three was just too big a setback,” he said of a partnership that saw several major long-term sponsors leave for rivals Mercedes and Red Bull. \n“If you look at McLaren’s history, they’ve kept sponsors longer than anyone. But in the last three years Hugo Boss left to another team, Tag Heuer to another team, ExxonMobil to another team. That was all pretty much performance related.” \nBrown, a marketing expert who joined McLaren after the departure from the helm of long-standing boss Ron Dennis, said two of the team’s three fresh sponsors were new to the sport. \nSecuring significant new sponsorship has been a struggle for most teams in recent seasons, with some would-be backers gravitating to all-electric Formula E instead. \n“Formula E is doing a great job. I’m not seeing many new sponsor announcements in Formula One but hopefully we can win that race as well,” said Brown, playing down any emerging rivalry between the series. \n”Formula E is another form of motorsport, different racing fan,“ he said. ”We’re doing the batteries for it in season five so I’m a fan of Formula E. \n“I think Formula E is becoming very successful but I don’t think that is to the detriment of Formula One.” Reporting by Alan Baldwin, editing by Toby Davis", "external_links": [], "published": "2018-01-11T19:54:00.000+02:00", "crawled": "2018-01-11T20:24:17.000+02:00", "highlightTitle": ""}