{"organizations": [], "uuid": "4858e9fe1d74f7a3089d37db4664fefb7047ac58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews\r", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-ashes/cricket-khawaja-hits-ton-but-smith-falls-before-lunch-in-sydney-idINL4N1P101Q", "country": "US", "domain_rank": 408, "title": "Cricket-Khawaja hits ton but Smith falls before lunch in Sydney", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T03:56:00.000+02:00", "replies_count": 0, "uuid": "4858e9fe1d74f7a3089d37db4664fefb7047ac58"}, "author": "", "url": "https://in.reuters.com/article/cricket-ashes/cricket-khawaja-hits-ton-but-smith-falls-before-lunch-in-sydney-idINL4N1P101Q", "ord_in_thread": 0, "title": "Cricket-Khawaja hits ton but Smith falls before lunch in Sydney", "locations": [], "entities": {"persons": [{"name": "smith", "sentiment": "negative"}, {"name": "cricket-khawaja", "sentiment": "negative"}, {"name": "usman khawaja", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "khawaja", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "moeen ali", "sentiment": "none"}], "locations": [{"name": "sydney", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 2:01 AM / Updated 28 minutes ago Cricket-Khawaja hits ton but Smith falls before lunch in Sydney Nick Mulvenney 3 Min Read \nSYDNEY, Jan 6 (Reuters) - Usman Khawaja hit his first century against England in a 188-run third wicket partnership with Steve Smith as Australia moved to 277 for three at lunch on the third day of the fifth Ashes test on Saturday. \nSmith departed for 83 a few minutes before the break to leave Khawaja unbeaten on 132 after the pair had batted through almost all of the opening session on a glorious sunny day at the Sydney Cricket Ground. \nEngland, already 3-0 down in the series and seeking a consolation victory, still look to be facing a long day in the field on the evidence of a first session in which Australia reduced their first innings lead to 69 runs. \nSmith, who has scored one double century and two unbeaten tons in the series, looked like building another big score until spinner Moeen Ali stunned the crowd by removing him caught and bowled with a nice low catch. \nThe Australia captain left the field to huge applause having amassed 687 runs at an average of 137.4 over the five tests. Shaun Marsh was two not out at lunch. \nAustralia had resumed on 193 for two and Khawaja wasted no time in knocking off the nine runs he needed to secure his sixth test century. \nAfter cutting Moeen for two runs, he pumped his fist in celebration at reaching the milestone before doffing his helmet to receive the ovation of a packed crowd at what was once his home ground. \nKhawaja, a fine stroke-player but considered suspect against spin bowling, made his debut at the SCG in the corresponding Ashes clash eight years ago but has had a stop-start career in the baggy green. \nDebutant England leg-spinner Mason Crane tested the 31-year-old’s skill against the turning ball to its limits in the final over before lunch. \nFirst the 20-year-old came up just short of sending the batsman back to join his captain caught and bowled and, two balls later, emitted a huge shout for lbw. \nThe umpire declined the appeal and England skipper Joe Root called for a review only for the TV pictures to show Crane had overstepped the mark and bowled a no-ball. \nAustralia won back the Ashes with victories in the first three matches in Brisbane, Adelaide and Perth with the fourth test in Melbourne finishing in a draw last week. (Editing by Greg Stutchbury)", "external_links": [], "published": "2018-01-06T03:56:00.000+02:00", "crawled": "2018-01-06T04:37:54.019+02:00", "highlightTitle": ""}