{"organizations": [], "uuid": "ed2f325ecb7df60a2746231f9c1f71ee9fd19897", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-asia-rice-sustainable/resilient-rice-project-to-target-top-two-producers-china-and-india-idUSKBN1FE116", "country": "US", "domain_rank": 408, "title": "Resilient rice project to target top two producers, China and India", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.805, "site_type": "news", "published": "2018-01-25T17:36:00.000+02:00", "replies_count": 0, "uuid": "ed2f325ecb7df60a2746231f9c1f71ee9fd19897"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-rice-sustainable/resilient-rice-project-to-target-top-two-producers-china-and-india-idUSKBN1FE116", "ord_in_thread": 0, "title": "Resilient rice project to target top two producers, China and India", "locations": [], "entities": {"persons": [{"name": "wyn ellis", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "south asia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "srp", "sentiment": "none"}, {"name": "irri", "sentiment": "none"}, {"name": "unep", "sentiment": "none"}, {"name": "united nations environment programme", "sentiment": "none"}, {"name": "international rice research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Representatives of a pilot project that promotes socially and environmentally responsible rice growing said they aim to expand into India and China, the world’s largest rice producers.\nThe United Nations Environment Programme (UNEP) and the Philippines-based International Rice Research Institute (IRRI) worked with more than 80 partners to create the world’s first “global rice sustainability standard”.\nThe standard provides a framework to drive government policy, as well as a working definition to be used by the private sector to monitor their own sustainability goals.\nThe sustainability standard has been tested over the past two years in nine countries, mostly in Southeast and South Asia.\n“This is a fledgling project still - our next task will be to upscale,” said Wyn Ellis, coordinator for the Sustainable Rice Platform (SRP).\nThe SRP is a coalition of more than 80 representatives from non-governmental organizations, and the private and public sectors, which launched the sustainability standard in 2015.\n“We will need to be moving into China and into India quite soon - those are our priorities in future,” he told the Thomson Reuters Foundation.\nThe standard promotes improvements in rice farming using more than 40 requirements and “performance indicators”, which authorities and companies such traders and supermarkets can use as best practice guidance.\nThese include measures against abuses such as child labor. The standard also aims to make rice growing more environmentally friendly by, for example, restricting the use of pesticides.\nMembers of the SRP hope that the standard will also be used in a certification scheme to help consumers choose ethical rice. Governments may also use it to promote sustainable rice farming and meet emissions targets.\nWater management is crucial factor in achieving those targets.\nUp to 40 percent of the world’s irrigation water is used for rice production, while up to 10 percent of global methane emissions come from rice fields, according to the SRP.\nDuring pilot testing, the standards helped reduced the water used in rice farming by 20 percent, cut greenhouse gas emissions by 50 percent and increased farmers’ incomes by 10 percent.\n“It is huge,” said Bruce Tolentino, deputy director general at IRRI, referring to the sustainability standard, which he hoped could be expanded globally.\nThe world produced more than 500 million tonnes of milled rice in 2017, with China, India, Indonesia, Bangladesh, Vietnam and Thailand among the top growers.\nThe grain is the main staple for 3.5 billion people but as the world’s population continues to grow, output will need to rise by about 25 percent over the next quarter century, IRRI estimates.\nReporting by Michael Taylor, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T17:36:00.000+02:00", "crawled": "2018-01-25T23:10:46.000+02:00", "highlightTitle": ""}