{"organizations": [], "uuid": "d764d4fb0eeb2891ffc5230d7de90b518248cea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/that27s-what-she-said2c-cover.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/joanne-lipman-thats-what-she-said/", "country": "US", "domain_rank": 1196, "title": "5 Ways Tips For Talking About #MeToo and Other Gender issues at work | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.401, "site_type": "news", "published": "2018-01-30T09:00:00.000+02:00", "replies_count": 0, "uuid": "d764d4fb0eeb2891ffc5230d7de90b518248cea8"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/30/joanne-lipman-thats-what-she-said/", "ord_in_thread": 0, "title": "5 Ways Tips For Talking About #MeToo and Other Gender issues at work | Fortune", "locations": [], "entities": {"persons": [{"name": "kristen bellstrom", "sentiment": "negative"}, {"name": "joanne lipman", "sentiment": "none"}, {"name": "joanne lipman courtesy of joanne lipman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "gannett", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom 7:00 AM EST \nIn her new book, That’s What She Said: What Men Need to Know (And What Women Need to Tell Them) About Working Together , Joanne Lipman argues that many men are potential allies in the fight for gender equity, but either don’t fully grasp the issues women are facing, or simply aren’t sure what they can do to help. \nThe best way to bring them onboard? Honest communication. In this essay, the former chief content officer of Gannett and Editor-in-Chief of USA Today draws from the lessons of her reporting to provide five straight-forward tips for women who want to have those sometimes difficult—but always important—conversations with the men in their work lives. That's What She Said, by Joanne Lipman Courtesy of Joanne Lipman \nHow do we close the gender gap at work? It starts with a missing ingredient: Men. \nWomen talk with one another all the time about the issues we face in our careers, from the daily frustrations of being overlooked and underpaid, to the extremes of sexual harassment and assault. \nBut women talking amongst ourselves is half a conversation, which can solve at best 50% of the problem. We need men to join us. For the past three years, I’ve searched out men across the country and globe who are trying to reach across the gender divide. In That’s What She Said, I tell their stories, backed by data and research, culminating in real-world actions we can all take to close the gap. \nFor women, here are a few takeaways to help convince men—the good guys, that majority of men who aren’t sexual predators—to join us in the quest for parity: \n1. Marshal the facts . Championing women should be a worthy goal in and of itself. But if that’s not enough, the economic argument is incontrovertible: Adding women makes work groups more creative. Companies with female chief financial officers make fewer, better acquisitions than those with male chief financial officers. Firms with the most female board members outperform those with the least by almost every financial measure. Mixed groups can even solve a murder more accurately than single-sex groups. \nIn short, equality is a business imperative. Want a recipe for success? Simply add women. \n2. Bring a man to your women’s meeting . Many companies now have employee groups for women, or at least the occasional all-hands for women. Why not invite men to your next meeting? \nI’ve spoken at a number of mixed-gender meetings, and the results are revelatory. When women talk about the daily challenges we face—being interrupted, overlooked, our work attributed to a man—there’s a familiar nod of recognition among other women. But for the men in the room, it can be a smack-the-forehead realization, a recognition of a phenomenon that they’ve never noticed before. And once they see it, they can’t unsee it- which means they are positioned to do something about it. \nSubscribe to The Broadsheet , Fortune’s daily newsletter on the world’s most powerful women. \n3. Acknowledge your own biases. At least 20% of companies in the U.S. now offer unconscious-bias training, intended to help us counter those prejudices buried so deeply inside of us that we don’t even realize they exist. That figure is expected to rise to as much as 50%. But plenty of men still feel like the training is another way of beating up on them. The message they take away: It’s all your fault! \nCopping to your own biases can help. I’ll often mention that I took the implicit bias test, and even I came out as “moderately” biased against working women. What’s more, research shows that these biases start early: moms like me routinely overestimate the crawling ability of their sons, while they underestimate that of their daughters. Parents of two-year-olds who ask Google “Is my child a genius?” are more than twice as likely to ask that of a boy than of a girl. \nAcknowledging our own biases helps eliminate the stigma of men admitting theirs – which in turn makes it more likely they will take steps to counteract them. \n4. Keep the conversation positive . “One of the things that doesn’t work is haranguing people,” says McKinsey CEO Dominic Barton. His advice is echoed by Uber executive Frances Frei, who warns against “scolding” or trying to catch men in a “gotcha” moment. \nInstead, acknowledge their good intentions, says Augustus A. White III, a prominent African American surgeon and author of the book Seeing Patients: Unconscious Bias in Healthcare . “One thing that’s appealing is to [acknowledge] the professionalism of the audience,” he says. “Once they understand that we have these hidden biases, they can confront them.” \n5. Make a pact to ensure your voice is heard . You probably know at least one chronic “manterrupter” or “broproriator” who never lets you finish your thoughts. Or, if you do manage to get a word in edgewise, he takes credit for your ideas. \nConsider asking a simpatico male colleague to back you up. Brad Jakeman, former president of PepsiCo’s global beverage group, says that when a female colleague approached him about just such a manterrupter, they “made a pact: I will jump in and call him out.” He adds, “We need to support each other and say: ‘Let her finish.’” \n", "external_links": [], "published": "2018-01-30T09:00:00.000+02:00", "crawled": "2018-01-30T23:41:46.022+02:00", "highlightTitle": ""}