{"organizations": [], "uuid": "fff9ad3dfefe55c0666d6043a258f2eb09e1d9e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-asml-results/chip-tool-maker-asml-posts-year-end-surge-sees-no-let-up-idUSKBN1F622T", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Chip tool maker ASML posts year-end surge, sees no let-up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:57:00.000+02:00", "replies_count": 0, "uuid": "fff9ad3dfefe55c0666d6043a258f2eb09e1d9e2"}, "author": "", "url": "https://www.reuters.com/article/us-asml-results/chip-tool-maker-asml-posts-year-end-surge-sees-no-let-up-idUSKBN1F622T", "ord_in_thread": 0, "title": "UPDATE 2-Chip tool maker ASML posts year-end surge, sees no let-up", "locations": [], "entities": {"persons": [{"name": "eric auchard", "sentiment": "none"}, {"name": "toby sterling", "sentiment": "none"}, {"name": "peter wennink", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "asml", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:02 PM / a few seconds ago Chip tool maker ASML posts year-end surge, sees no let-up Toby Sterling , Eric Auchard 5 Min Read \nAMSTERDAM/FRANKFURT (Reuters) - ASML ( ASML.AS ), a leading supplier of equipment to the world’s biggest chipmakers, reported fourth-quarter net profit that far exceeded expectations after some customers requested early delivery of products to satisfy booming demand. \nThe Dutch maker of lithography systems said on Wednesday its outlook for 2018 had been bolstered by a growing backlog of orders. Its products play a decisive role in shrinking the size of chips so as to cram ever more circuits onto them. \nNet profit for the Oct.-Dec. 2017 period rose to 644 million euros ($788 million) from 524 million euros a year earlier and against 454 million euros seen in an analysts’ poll for Reuters. \n“Due to industry strength, some customers requested earlier shipments of their lithography systems,” Chief Executive Peter Wennink said in a statement. “For 2018 we expect continued solid growth of sales and profitability.” \nShares of ASML, Europe’s second-largest tech stock by market capitalization, rose almost 7 percent following the report, and by 1440 GMT traded 5 percent higher at 161.70 euros. They have tripled in price over the past five years. \nFinancial analysts, even bearish ones, hailed the 2017 results as “way above expectations” in the words of broker Liberum, which has a “sell” rating on ASML. \nWennink said in a phone interview that demand was outpacing its capacity to build and that customers were indicating this would continue, especially in the second half of 2018. This has yet be reflected in ASML’s order book, he added. \nWennink dismissed any risk that security flaws revealed in Intel ( INTC.O ) and other computer chips this month may affect his customers’ upgrade plans, adding he was confident the industry could solve these issues in the short to medium term. \n“I don’t see any impact on ASML either directly or indirectly,” he said. \nASML’s lithography machines, which can cost 100 million euros apiece, help chipmakers, including Samsung ( 005930.KS ), Intel and TSMC ( 2330.TW ), to lay out the circuitry that go into most computers, phones, servers and memory devices. \nASML is increasingly dominating its nearest rival in lithography, Japan’s Nikon ( 7731.T ). WORKING OVERTIME \nSales of 2.56 billion euros were well ahead of the company’s own forecast of 2.1 billion euros, and ASML said it saw net sales of 2.2 billion euros in the first quarter of 2018. \nMemory chip prices rose around 60 percent in 2017 and continue to remain strong, powering capital spending in the sector, analysts said. Fifty-three percent of revenue came from memory chipmakers in the fourth quarter, ASML said. The world’s biggest chipmaker, Samsung, spooked some investors last week with an outlook that suggested the boom in memories used in smartphones could end sooner than expected. However, ASML remains insulated as an estimated three-quarters of its memory sales comes from a different type of memory - so-called DRAM - that remains in hot demand. \nWennink refused to be drawn on whether ASML’s lower than expected first-quarter revenue outlook could be made up once again by pulling in or shipping second-quarter orders earlier. Separately, ASML said it appointed Roger Dassen as new CFO to replace Wolfgang Nickl, who is leaving in April to become CFO of Germany’s Bayer. Dassen is a former head of accountancy firm Deloitte in the Netherlands. \nASML’s order backlog grew to 6.7 billion euros, from 5.7 billion at the end of September. That includes 10 orders of its newest, most expensive machine. \nWennink said ASML would propose an annual dividend of 1.40 euros in 2017 from 1.20 euros in 2016, and a share buyback program of 2.5 billion euros over the 2018-2019 period. ASML only completed 900 million euros of its previous 1.5 billion euro buyback program. \nWennink said the fledgling Chinese chip industry continued to grow rapidly and he expected to ship chip-making tools to five different Chinese companies in 2018. ($1 = 0.8169 euros) Reporting by Toby Sterling and Eric Auchard; Editing by Gopakumar Warrier and Gareth Jones", "external_links": [], "published": "2018-01-17T17:57:00.000+02:00", "crawled": "2018-01-17T18:12:18.001+02:00", "highlightTitle": ""}