{"organizations": [], "uuid": "644d146e1f6cedf4996c21da793601013db841ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cellect-biotechnology-announces-4-million-registered-direct-offering.html", "country": "US", "domain_rank": 767, "title": "Cellect Biotechnology Announces $4 Million Registered Direct Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "644d146e1f6cedf4996c21da793601013db841ac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-cellect-biotechnology-announces-4-million-registered-direct-offering.html", "ord_in_thread": 0, "title": "Cellect Biotechnology Announces $4 Million Registered Direct Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": [{"name": "cellect biotechnology ltd.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "american depository shares", "sentiment": "none"}, {"name": "h.c. wainwright & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEL AVIV, Israel, January 29, 2018 /PRNewswire/ --\nCellect Biotechnology Ltd. (Nasdaq: APOP), a developer of stem cells selection technology, announced that it has entered into securities purchase agreements with certain institutional investors for gross proceeds of approximately $4 million.\nIn connection with the offering, the Company will issue 484,848 registered American Depository Shares (ADSs) at a purchase price of $8.25 per ADS in a registered direct offering. Additionally, for each ADS purchased, the investors will receive an unregistered warrant to purchase 55% of an ADS. The warrants have an exercise price of $12.00 per ADS, shall be exercisable immediately following the issuance date and will expire twelve months from the earlier of the effectiveness date of a registration statement registering the shares underlying the warrants and 6 months from the issuance date of the warrants. The closing of the offering is expected to take place on or about January 31, 2018, subject to the satisfaction of customary closing conditions.\nH.C. Wainwright & Co. is acting as the exclusive placement agent in connection with this offering.\nThe ADSs described above (but not the warrants or the ADSs underlying the warrants) are being offered pursuant to a \"shelf\" registration statement (File No. 333-219614) which became effective on August 17, 2017. Such ADSs may be offered only by means of a prospectus, including a prospectus supplement, forming a part of the effective registration statement. The Company will file a prospectus supplement and the accompanying base prospectus with the SEC relating to such ADSs. When available, copies of the prospectus supplement and the accompanying base prospectus may be obtained at the SEC's website at http://www.sec.gov , or by contacting H.C. Wainwright & Co., LLC, 430 Park Avenue, 3rd Floor, New York, New York 10022, by telephone: (646) 975-6996 or by email at placements@hcwco.com .\nThe warrants described above were offered in a private placement under Section 4(a)(2) of the Securities Act of 1933, as amended (the \"Act\"), and Regulation D promulgated thereunder and/or Regulation S and, along with the ADSs issuable upon their exercise, have not been registered under the Act, and may not be offered or sold in the United States absent registration with the SEC or an applicable exemption from such registration requirements.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the securities described herein. There shall not be any offer, solicitation of an offer to buy, or sale of securities in any state or jurisdiction in which such an offering, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Cellect Biotechnology Ltd.\nCellect Biotechnology (NASDAQ: \"APOP\", \"APOPW\") has developed a breakthrough technology for the selection of stem cells from any given tissue that aims to improve a variety of stem cell applications.\nThe Company's technology is expected to provide research, hospitals and pharma companies with the tools to rapidly isolate stem cells in quantity and quality allowing stem cell-based treatments and procedures in a wide variety of applications in regenerative medicine. The current clinical trial is aimed at bone marrow transplantations in cancer treatment.\nForward Looking Statements\nThis press release contains forward-looking statements about the Company's expectations, beliefs and intentions. Forward-looking statements can be identified by the use of forward-looking words such as \"believe\", \"expect\", \"intend\", \"plan\", \"may\", \"should\", \"could\", \"might\", \"seek\", \"target\", \"will\", \"project\", \"forecast\", \"continue\" or \"anticipate\" or their negatives or variations of these words or other comparable words or by the fact that these statements do not relate strictly to historical matters. For example, forward-looking statements are used in this press release when we discuss our expectation regarding the closing of the offering. These forward-looking statements and their implications are based on the current expectations of the management of the Company only, and are subject to a number of factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. In addition, historical results or conclusions from scientific research and clinical studies do not guarantee that future results would suggest similar conclusions or that historical results referred to herein would be interpreted similarly in light of additional research or otherwise. The following factors, among others, could cause actual results to differ materially from those described in the forward-looking statements: changes in technology and market requirements; we may encounter delays or obstacles in launching and/or successfully completing our clinical trials; our products may not be approved by regulatory agencies, our technology may not be validated as we progress further and our methods may not be accepted by the scientific community; we may be unable to retain or attract key employees whose knowledge is essential to the development of our products; unforeseen scientific difficulties may develop with our process; our products may wind up being more expensive than we anticipate; results in the laboratory may not translate to equally good results in real clinical settings; results of preclinical studies may not correlate with the results of human clinical trials; our patents may not be sufficient; our products may harm recipients; changes in legislation; inability to timely develop and introduce new technologies, products and applications, which could cause the actual results or performance of the Company to differ materially from those contemplated in such forward-looking statements. Any forward-looking statement in this press release speaks only as of the date of this press release. The Company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by any applicable securities laws. More detailed information about the risks and uncertainties affecting the Company is contained under the heading \"Risk Factors\" in Cellect Biotechnology Ltd.'s Annual Report on Form 20-F for the fiscal year ended December 31, 2016 filed with the U.S. Securities and Exchange Commission, or SEC, which is available on the SEC's website, http://www.sec.gov . and in the Company's period filings with the SEC.\nContact\nCellect Biotechnology Ltd.\nEyal Leibovitz, Chief Financial Officer\nhttp://www.cellect.co\n+972-9-974-1444\nSOURCE Cellect Biotechnology Ltd.", "external_links": ["http://www.sec.gov/"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T20:02:00.002+02:00", "highlightTitle": ""}