{"organizations": [], "uuid": "4cec5d912003875192acc2e6773814056ad8fb75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 99}, "facebook": {"likes": 184, "shares": 184, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226195638&w=1200&r=LYNXMPEE0S0B9", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-facebook-privacy-eu/facebook-makes-privacy-push-ahead-of-strict-eu-law-idUSKBN1FI0DO", "country": "US", "domain_rank": 408, "title": "Facebook makes privacy push ahead of strict EU law", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:00:00.000+02:00", "replies_count": 0, "uuid": "4cec5d912003875192acc2e6773814056ad8fb75"}, "author": "", "url": "https://www.reuters.com/article/us-facebook-privacy-eu/facebook-makes-privacy-push-ahead-of-strict-eu-law-idUSKBN1FI0DO", "ord_in_thread": 0, "title": "Facebook makes privacy push ahead of strict EU law", "locations": [], "entities": {"persons": [{"name": "julia fioretti", "sentiment": "negative"}, {"name": "erin egan", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "general data protection regulation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 5:06 AM / in 2 hours Facebook makes privacy push ahead of strict EU law Julia Fioretti 3 Min Read \nBRUSSELS (Reuters) - Facebook said on Monday it was publishing its privacy principles for the first time and rolling out educational videos to help users control who has access to their information, as it prepares for the start of a tough new EU data protection law. \nThe videos will show users how to manage the data that Facebook uses to show them ads, how to delete old posts, and what happens to the data when they delete their account, Erin Egan, chief privacy officer at Facebook, said in a blog post. \nFacebook, which has more than 2 billion users worldwide, said it had never before published the principles, which are its rules on how the company handles users’ information. \nMonday’s announcements are a sign of its efforts to get ready before the European Union’s General Data Protection Regulation (GDPR) enters into force on May 25, marking the biggest overhaul of personal data privacy rules since the birth of the internet. \nUnder GDPR, companies will be required to report data breaches within 72 hours, as well as to allow customers to export their data and delete it. \nFacebook’s privacy principles, which are separate from the user terms and conditions that are agreed when someone opens an account, range from giving users control of their privacy, to building privacy features into Facebook products from the outset, to users owning the information they share. A 3D-printed Facebook logo is seen in front of the logo of the European Union in this picture illustration made in Zenica, Bosnia and Herzegovina on May 15, 2015. REUTERS/Dado Ruvic \n“We recognize that people use Facebook to connect, but not everyone wants to share everything with everyone – including with us. It’s important that you have choices when it comes to how your data is used,” Egan wrote. \nAlso among the company’s privacy principles are helping users understand how their data is used, keeping that information secure, constantly improving new controls, and being accountable to regulators. \n“We put products through rigorous data security testing. We also meet with regulators, legislators and privacy experts around the world to get input on our data practices and policies,” the blog post said. \nThe company’s Chief Operating Officer Sheryl Sandberg announced last week that Facebook would be creating a new privacy center which would put the social network’s key privacy settings in one place. \nThe GDPR drastically increases the level of fines for companies found to be in breach of data protection law, potentially rising as high as 4 percent of global annual turnover or 20 million euros, whichever is higher. \nFacebook has faced probes from EU regulators over its use of user data and tracking of online activities. \nAs of Monday, users will be reminded by their News Feeds to take a “privacy checkup,” Egan wrote in his blog, to ensure they are comfortable about what data they are sharing, and with whom. Reporting by Julia Fioretti; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-29T07:00:00.000+02:00", "crawled": "2018-01-29T07:14:25.014+02:00", "highlightTitle": ""}