{"organizations": [], "uuid": "c35d54050053d0fb1347048fbf59370d4062cf92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226339635&w=1200&r=LYNXMPEE0S172", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-russia-alrosa/russias-alrosa-to-plunder-diamond-inventory-as-output-drops-idUKKBN1FI20H", "country": "US", "domain_rank": 408, "title": "Russia's Alrosa to plunder diamond inventory as output drops", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:54:00.000+02:00", "replies_count": 0, "uuid": "c35d54050053d0fb1347048fbf59370d4062cf92"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-alrosa/russias-alrosa-to-plunder-diamond-inventory-as-output-drops-idUKKBN1FI20H", "ord_in_thread": 0, "title": "Russia's Alrosa to plunder diamond inventory as output drops", "locations": [], "entities": {"persons": [{"name": "polina devitt", "sentiment": "none"}, {"name": "evgeny agureev", "sentiment": "none"}, {"name": "agureev", "sentiment": "none"}, {"name": "diana asonova", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "alrosa", "sentiment": "none"}, {"name": "mir", "sentiment": "none"}, {"name": "siberia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "alrosa", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 3:53 PM / Updated 8 minutes ago Russia's Alrosa to plunder diamond inventory as output drops Polina Devitt , Diana Asonova 3 Min Read \nMOSCOW (Reuters) - Russian diamond miner Alrosa ( ALRS.MM ) will dip into its inventory in 2018 as it fights to keep sales constant despite lower output after an accident shut one of its mines, the head of its sales division told Reuters. \nEvgeny Agureev, who joined the state-controlled company last August, has signed long-term supply contracts with 65 companies, accounting for up to 70 percent of expected sales in 2018-2020. \nThe rest of Alrosa’s output is sold through auction and on the spot market subject to its resource base, which has been dented by the shutdown at its Mir mine in Siberia. Mir had accounted for 9 percent of Alrosa’s annual output before it was partially flooded in August, killing eight miners. \nAs well as the human tragedy, Alrosa has been hit by the loss of diamonds that Agureev says were held in high regard by the market. \n“We are working to compensate for this amount (of production) in other mines,” Agureev said in his first media interview. “Diamonds from the Verkhnyaya Muna deposit (in Siberia) will come to the market in 2019.” \nDespite falling production, Alrosa aims to keep its sales broadly stable at 40 million carats by reducing its inventory to 14 million carats in 2018. Slideshow (4 Images) \nVTB Capital estimated Alrosa’s inventory at 18 million carats at the end of 2017. \nThough Western sanctions over Moscow’s annexation of Crimea from Ukraine in 2014 have cast a shadow over some Russian businesses, Agureev said Alrosa’s long-term clients -- diversified across diamond polishing centres such as Belgium, Israel, India and China -- did not raise the issue during sales meetings. \nWashington could release reports as early as Monday detailing possible expansion of sanctions, but Agureev said Alrosa is prepared for worst-case scenarios. \n“If we have to leave Belgium, we will work in other centres,” Agureev said without providing further details. \nAlrosa and Anglo American’s ( AAL.L ) De Beers produce about half of the world’s rough diamonds. \nAlrosa does not foresee any significant changes in the supply side of the global rough diamond market in 2018-2020 and expects demand and prices to remain broadly flat for the period, Agureev said. \nA January trade session with customers suggested that strong demand is likely to continue in the first quarter of 2018, he added. Reporting by Polina Devitt and Diana Asonova; Editing by David Goodman", "external_links": [], "published": "2018-01-29T17:54:00.000+02:00", "crawled": "2018-01-29T18:06:44.023+02:00", "highlightTitle": ""}