{"organizations": [], "uuid": "1fc1c9cab2b6705d320cfb2698c80b969e86469f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223009690&w=1200&r=LYNXMPEE0H0VQ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain/barca-visit-thrill-seeking-betis-after-ending-unbeaten-run-idUKKBN1F71G6", "country": "US", "domain_rank": 408, "title": "Barca visit thrill-seeking Betis after ending unbeaten run", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T13:46:00.000+02:00", "replies_count": 0, "uuid": "1fc1c9cab2b6705d320cfb2698c80b969e86469f"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain/barca-visit-thrill-seeking-betis-after-ending-unbeaten-run-idUKKBN1F71G6", "ord_in_thread": 0, "title": "Barca visit thrill-seeking Betis after ending unbeaten run", "locations": [], "entities": {"persons": [{"name": "richard ma", "sentiment": "negative"}, {"name": "liga", "sentiment": "none"}, {"name": "betsy", "sentiment": "none"}, {"name": "quique setien", "sentiment": "none"}], "locations": [{"name": "leganes", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}], "organizations": [{"name": "barca", "sentiment": "negative"}, {"name": "betis", "sentiment": "negative"}, {"name": "espanyol", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "deportivo la coruna", "sentiment": "none"}, {"name": "las palmas", "sentiment": "none"}, {"name": "sevilla", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "real betis", "sentiment": "none"}, {"name": "min read  barcelona", "sentiment": "none"}, {"name": "real sociedad", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 49 AM / Updated 4 minutes ago Barca visit thrill-seeking Betis after ending unbeaten run Richard Martin 3 Min Read \nBARCELONA (Reuters) - Barcelona have had their confidence trimmed by Espanyol snapping their 29-game unbeaten run in all competitions with a surprise win in the King’s Cup, and the runaway Liga leaders will be put to the test again on Sunday against thrill seekers Real Betis. \nOnly Barca and high-flying Valencia have scored more goals than Betis, who have garnered a reputation as one of the most exciting teams in the league this season under attacking ideologue Quique Setien. \nThe former Las Palmas coach’s open approach has had dire consequences for his side’s defence, however, which is the third worst in the league, with only basement club Las Palmas and 18th-placed Deportivo La Coruna shipping more goals than them. \nBetsy won a wild local derby at fierce rivals Sevilla 5-3 at the start of the month, while earlier this season their swashbuckling style saw them lose 6-3 to Valencia and draw 4-4 with Real Sociedad. \nTheir last outing was a thrilling 3-2 win over Leganes in which they threw away a two-goal lead before returning hero Ruben Castro came off the bench to strike the winning penalty in his first game back at the club. \nBarca have been accused of uninspiring football on occasion this season but last week turned on the style to come from two goals down to beat Real Sociedad 4-2, ending an 11-year hoodoo away to the Basque club and preserving their nine-point lead at the top of the standings. \nDespite the danger posed by Barca, Setien ruled out a cautious approach from Betis against the Catalans and also said he would not instruct his players to man-mark Lionel Messi. \n“Barcelona are a very difficult team to face, we have some doubts, but we’re going to be brave against them, we’re sure of that,” the coach told radio station Cadena Ser. \n”Our destiny is to play, to press them high and rob the ball off them in their half, and as long as they will permit us, to try and cause them problems in their area. \nBetis captain Joaquin added: “They have every move programmed and they play so perfectly that it’s going to be very difficult, but we’re going to die with our philosophy and we’re going to try and cause them problems.” \nThere was little sign of alarm among Barca players after they lost 1-0 to Espanyol in the first leg of their Cup quarterfinal to an 88th minute winner from Oscar Melendo after Messi had a penalty saved. \n“If you could choose a day to lose, it might have been today,” defender Gerard Pique said after Barca’s first defeat in any competition since August. \nElsewhere in La Liga, second-placed Atletico Madrid host Girona while crisis-hit champions Real Madrid play at home to relegation-fighting Deportivo La Coruna looking for a first win in four league games. Reporting by Richard Martin; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-18T13:46:00.000+02:00", "crawled": "2018-01-18T14:05:41.157+02:00", "highlightTitle": ""}