{"organizations": [], "uuid": "9cb476cf3fbbbabb6faa5b2f557e1f96691b1ddb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/etihad-airways-strategy-restructuring/update-1-etihad-grounds-5-airbus-cargo-planes-amid-strategy-review-idUSL8N1PJ4SN", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Etihad grounds 5 Airbus cargo planes amid strategy review", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:04:00.000+02:00", "replies_count": 0, "uuid": "9cb476cf3fbbbabb6faa5b2f557e1f96691b1ddb"}, "author": "", "url": "https://www.reuters.com/article/etihad-airways-strategy-restructuring/update-1-etihad-grounds-5-airbus-cargo-planes-amid-strategy-review-idUSL8N1PJ4SN", "ord_in_thread": 0, "title": "UPDATE 1-Etihad grounds 5 Airbus cargo planes amid strategy review", "locations": [], "entities": {"persons": [{"name": "alexander cornwell", "sentiment": "none"}, {"name": "reut", "sentiment": "none"}, {"name": "peter baumgartner", "sentiment": "none"}, {"name": "stanley carvalho  dubai/abu dhabi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "reuters st", "sentiment": "negative"}, {"name": "etihad", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "etihad airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 05 PM / in 14 minutes UPDATE 1-Etihad grounds 5 Airbus cargo planes amid strategy review Reuters Staff \n(Adds details, background) \nBy Alexander Cornwell and Stanley Carvalho \nDUBAI/ABU DHABI, Jan 24 (Reuters) - Etihad Airways on Wednesday said it has pulled its five Airbus freighters from service, and sources said the airline is asking pilots to take unpaid leave as it rethinks its strategy. \nThe state-owned Gulf carrier has been reviewing its business since 2016 after billions of dollars spent buying stakes in other airlines failed to deliver substantial returns. This contributed to a $1.87 billion loss in 2016, its first loss since 2010. \nEtihad told Reuters it has removed its Airbus cargo planes, five A330 Freighters, from its fleet schedule for commercial reasons and that it had opted to operate a cargo plane fleet of all-Boeing 777 Freighters. It declined to comment on whether it had offered pilots unpaid leave. \n“This freighter is the right aircraft for our long-term requirements,” Peter Baumgartner, the chief executive of Etihad’s airline operations, said in an email to Reuters. \nEtihad operates five Boeing 777 Freighters. \nThe Abu Dhabi-based airline is considering selling or leasing the Airbus freighters, a source familiar with the matter said. \nEtihad’s cargo operation slowed in 2016 to report flat growth of 596,000 tonnes handled. \nEtihad is encouraging pilots to take unpaid leave for periods as short as one week or as long as 18 months as it reviews its fleet requirements with the intention of retiring some aircraft, according to three sources familiar with the matter. \nPilots are being asked to take leave on a voluntary basis, one of the sources said. \nEtihad employed 2,225 pilots for a fleet of 122 jets as of February 2017, according to the most recent data on its website. \nEtihad has made few comments on its strategy review in which hundreds of positions have been removed and several commercial passenger routes cut since it was launched. \nIt announced last year it was stopping flights to at least five cities, including San Francisco and Dallas Fort Worth. \nEtihad once owned as many as eight minority stakes in other airlines. It has sold two, and another two of the airlines filed for administration last year. \nNew Group Chief Executive Tony Douglas, who joined this month, is likely to have to decide what to do with those investments. (Reporting by Alexander Cornwell in Dubai and Stanley Carvalho in Abu Dhabi. Editing by Jane Merriman)", "external_links": [], "published": "2018-01-24T17:04:00.000+02:00", "crawled": "2018-01-24T17:24:16.014+02:00", "highlightTitle": ""}