{"organizations": [], "uuid": "5ae526ca8bde69be072b575051017c7a56d2e107", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224956614&w=1200&r=LYNXMPEE0N2A2", "site_section": "http://feeds.reuters.com/reuters/INgolf", "section_title": "Reuters: Golf News", "url": "https://in.reuters.com/article/golf-farmers-tiger-woods/golf-woods-gives-health-thumbs-up-on-eve-of-return-to-pga-tour-idINKBN1FD37Q", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Golf-Woods gives health thumbs-up on eve of return to PGA Tour", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:54:00.000+02:00", "replies_count": 0, "uuid": "5ae526ca8bde69be072b575051017c7a56d2e107"}, "author": "", "url": "https://in.reuters.com/article/golf-farmers-tiger-woods/golf-woods-gives-health-thumbs-up-on-eve-of-return-to-pga-tour-idINKBN1FD37Q", "ord_in_thread": 0, "title": "UPDATE 1-Golf-Woods gives health thumbs-up on eve of return to PGA Tour", "locations": [], "entities": {"persons": [{"name": "woods", "sentiment": "none"}, {"name": "tiger woods", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "torrey pines", "sentiment": "none"}], "organizations": [{"name": "la jolla", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:02 PM / Updated 9 hours ago Golf: Woods gives health thumbs-up on eve of return to PGA Tour Andrew Both 4 Min Read \nLA JOLLA, California (Reuters) - A relaxed and happy Tiger Woods gave his body a thumbs-up on Wednesday and said he wanted to play a full schedule leading up to the U.S. Masters in April. \nSpeaking on the eve of his first official tournament in almost a year, the 14-times major champion said he has not “felt this good in years”. \nWoods acknowledged that his apparently successful spinal fusion last April had been a last-ditch attempt to end his crushing pain after he had exhausted every other treatment option. \n”My quality of life is infinitely better than it was last year at this point,“ he told reporters. ”I have no more pain in my back. \n“It feels good not to have a burning sensation going down my leg into my foot, or collapse when I‘m walking, things of that nature.” \nHe beamed his trademark smile multiple times as he spoke to the media for 23 minutes at Torrey Pines, a day before the first round of the Farmers Insurance Open, a tournament he almost owns with seven victories. \nThe former world number one had just played a pre-tournament pro-am at which he delighted a large gallery of fans by finishing eagle, birdie for a final score of two-under 70. \nWoods addressed in detail questions about his swing and spoke at length about the thought process that went into the back surgery he underwent after three failed microdiscectomies. \nAs usual, he said little about his personal life, other than to say his two children were well. He did not address last year’s arrest after he was found asleep at the wheel of his car with multiple prescription drugs in his system. \nBut when it came to his health in general and golf in particular, the 42-year-old could hardly contain his enthusiasm at being pain-free. \n“It’s been so bad for so long, but turning it around and having my back fused, I haven’t felt this good in years, so I‘m excited about it,” he said. Jan 24, 2018; San Diego, CA, USA; Tiger Woods plays his shot from the 17th tee during the ProAm of the Farmers Insurance Open golf tournament at Torrey Pines Municipal Golf Course - North Co. Mandatory Credit: Orlando Ramirez-USA TODAY Sports TEST RUN \nWoods has played one tournament since his surgery, the unofficial Hero World Challenge in the Bahamas in December, where he finished ninth of 18 players in a good test run for 2018, when he hopes to play a full schedule for the first time since 2013. \n“I went through every single procedure that is non-surgical and it just didn’t get better,” he said of his back and his make or break decision to have two vertebrae in his lower spine fused. Jan 24, 2018; San Diego, CA, USA; Tiger Woods walks to the 17th tee during the ProAm of the Farmers Insurance Open golf tournament at Torrey Pines Municipal Golf Course - North Co. Mandatory Credit: Orlando Ramirez-USA TODAY Sports \n“The surgery and the fusion was the only step I had left. I was lucky.” \nOf all Woods’ victories, perhaps his greatest came here at the 2008 U.S. Open. He won despite having, in his own words, “no ACL” (anterior cruciate ligament) and a “broken leg” (two stress fractures in his lower left leg). \nBut that was 10 years ago and he has not won a major championship since. \n”My expectations have tempered a little bit because I haven’t played,“ he said. ”I just want to start playing and getting into a rhythm of playing a schedule again. \n“I haven’t done that in such a long time, so I don’t know what to expect. I‘m going to grind, give it everything I possibly have.” \nThis week will be merely the first step in his build-up for the Masters at Augusta National. \n“I‘m looking forward to playing a full schedule and getting ready for the Masters and I haven’t done that in a very long time,” he said. \n“From ‘96 on it’s been that way and there’s no reason to change.” Reporting by Andrew Both, editing by Ed Osmond", "external_links": [], "published": "2018-01-25T00:54:00.000+02:00", "crawled": "2018-01-25T01:25:37.002+02:00", "highlightTitle": ""}