{"organizations": [], "uuid": "8895ef632d3258288a063f7047c3b45b73f6690a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lets-make-a-deal-mergers-acquisitions-a-key-to-middle-market-growth.html", "country": "US", "domain_rank": 767, "title": "Let's Make a Deal: Mergers & Acquisitions A Key To Middle Market Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:07:00.000+02:00", "replies_count": 0, "uuid": "8895ef632d3258288a063f7047c3b45b73f6690a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lets-make-a-deal-mergers-acquisitions-a-key-to-middle-market-growth.html", "ord_in_thread": 0, "title": "Let's Make a Deal: Mergers & Acquisitions A Key To Middle Market Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "middle market", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio, Jan. 9, 2018 /PRNewswire/ -- New research released today by the National Center for the Middle Market shows that healthy financial conditions are driving increased merger and acquisition activity within middle market companies with 60 percent of survey respondents stating it plays a very important role in their growth strategy.\nThe survey of 400 strategic decision makers from middle market companies that completed a M&A in the past three years or are highly likely to sell all or part of a company in the next three, revealed that there is a lack of M&A experience within this business sector.\nThe middle market is an extremely attractive market especially for M&A. Investment funds having nearly $200 billion in capital to invest regularly look to middle market firms to make their deals. Additionally, executives of middle market companies expect the deals they make to drive more than a quarter of their growth.\nDespite this activity and the importance of M&A, most MM executives come to the deal table with little direct experience of the process. Of those companies that completed a purchase in the past three years nearly one third (29 percent) were doing a deal for the first time and more than 40 percent had limited previous experience. On the selling side, first timers jumped to 46 percent with only one in 10 companies reporting having significant sales experience.\n\"Lack of experience with mergers and acquisitions causes middle market executives to underestimate issues that arise when bringing two companies together,\" said Thomas A. Stewart, Executive Director of the National Center for the Middle Market. \"Without undergoing the rigorous planning associated with these transactions, one can experience unpleasant and costly surprises during or after the deal.\"\nAccording to the data, on the front end of an acquisition or sale more than 40 percent of buyers and 50 percent of sellers find it very to extremely difficult to assess the value of the business they are trying to buy or sell. Post transaction, 44 percent of both buyers and sellers state integration as the major challenge. This includes integration of technology systems, company culture, staff and administrative processes.\nOne of the reasons middle market companies may be struggling with M&A is the fact that many do not fully leverage external advisors when looking for the right acquisition target or buyer. They tend to rely on internal executives or top managers when seeking companies to buy or sell. The research showed that only one third of buyers looked for targets with help from an external law firm and even fewer talked to consultants or investment bankers. Sellers were even less likely to bring in external advisers in their search for buyers.\n\"Bringing the right people to the table early in the deal-making process helps to pave the way to a more successful deal, as well as identify potential costly red flags,\" said NCMM Managing Director Doug Farren. \"Objectivity is extremely important when buying or selling a company. Bringing in external help can help to build the right deal team and make smarter decisions.\"\nEvery year approximately 20 percent of middle market firms acquire a company and about five percent sell or divest a part of their organization. Careful planning and preparation that starts well in advance of M&A execution can bolster the success of these deals which can typically take approximately three to 12 months to complete. However, the planning horizon should ideally be three to five times as long to give companies time to assemble the right deal team, identify and assess targets, conduct thorough research and put a plan in place for integration post-deal.\nWith the middle market M&A environment being as competitive as it is, the findings and recommendations from NCMM's research can help executives gain a better understanding of the M&A landscape; identify those areas that deserve careful consideration well in advance of executing a merger, acquisition or sale; and know when and why to bring in expert help.\nAbout the Survey\nThe Center designed the survey to understand attitudes and perceptions related to M&A, evaluate the importance of mergers and acquisitions to middle market companies, identify drivers of M&A activity in the middle market, and gain insight into the obstacles and challenges involved in deal-making pre-, during, and post-transaction. The learnings and takeaways are intended to inform both middle market executives and their external advisors and consultants in order to facilitate more successful deals in the future. Respondents completed the 20-minute, self-administered survey online between October 16, 2017 and October 24, 2017. This report was designed and prepared by the National Center for the Middle Market in consultation with its sponsors, SunTrust Banks Inc., Grant Thornton LLP, Cisco Systems, and Steven Davidoff Solomon, Deal Professor from the New York Times, and Professor of Law and Faculty Director of the Berkeley Center for Law and Business.\nAbout the National Center for the Middle Market (NCMM)\nThe National Center for the Middle Market is a collaboration between The Ohio State University's Fisher College of Business, SunTrust Banks and Grant Thornton LLP. It exists for a single purpose: to ensure that the vitality and robustness of Middle Market companies are fully realized as fundamental to our nation's economic outlook and prosperity. The Center is the leading source of knowledge, leadership, and innovative research on the middle market economy, providing critical data analysis, insights, and perspectives for companies, policymakers, and other key stakeholders, to help accelerate growth, increase competitiveness and create jobs in this sector.\nHoused at The Ohio State University's Fisher College of Business, the National Center for the Middle Market is the first center of its kind in the nation. The Center enthusiastically serves middle market firms, students, academic researchers, policy makers, the media and other key stakeholders with interests in the health and well-being of the middle market. The Center is fully committed to funding and distributing the most credible open-sourced research, dynamically creating new knowledge, providing programs that drive value for middle market companies, and offering a well-informed outlook on the health and future of the middle market via the Middle Market Indicator.\nFor additional research data and infographics, including in-depth looks at regional variations, hiring/talent acquisition efforts and other business concerns among middle market companies, visit http://www.middlemarketcenter.org .\nView original content with multimedia: http://www.prnewswire.com/news-releases/lets-make-a-deal-mergers--acquisitions-a-key-to-middle-market-growth-300579756.html\nSOURCE National Center for the Middle Market (NCMM)", "external_links": ["http://www.prnewswire.com/news-releases/lets-make-a-deal-mergers--acquisitions-a-key-to-middle-market-growth-300579756.html", "https://coynepr.sharefile.com/d-scad7662ffbe4158b", "http://www.middlemarketcenter.org/"], "published": "2018-01-09T16:07:00.000+02:00", "crawled": "2018-01-09T17:53:21.000+02:00", "highlightTitle": ""}