{"organizations": [], "uuid": "2355e8573c276b45ce06f8ebfce774a8e45b7578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/luxe-energy-ngp/private-equity-firm-boosts-shale-funding-in-hunt-for-permian-deals-idUSL1N1OY1UU", "country": "US", "domain_rank": 408, "title": "Private equity firm boosts shale funding in hunt for Permian deals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:19:00.000+02:00", "replies_count": 0, "uuid": "2355e8573c276b45ce06f8ebfce774a8e45b7578"}, "author": "", "url": "https://www.reuters.com/article/luxe-energy-ngp/private-equity-firm-boosts-shale-funding-in-hunt-for-permian-deals-idUSL1N1OY1UU", "ord_in_thread": 0, "title": "Private equity firm boosts shale funding in hunt for Permian deals", "locations": [], "entities": {"persons": [{"name": "ernest scheyder", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "permian", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "permian basin", "sentiment": "none"}], "organizations": [{"name": "diamondback energy inc", "sentiment": "none"}, {"name": "reuters) - luxe energy llc", "sentiment": "none"}, {"name": "ngp energy capital management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 3:19 PM / in 42 minutes Private equity firm boosts shale funding in hunt for Permian deals Ernest Scheyder 3 Min Read \nHOUSTON, Jan 4 (Reuters) - Luxe Energy LLC said on Thursday it had received an additional $296 million from its private equity backers to buy and develop acreage in the Permian Basin, the largest U.S. oilfield stretching across Texas and New Mexico. \nNGP Energy Capital Management is increasing its funding for Luxe and a related company to $820 million, up from a previous commitment of $524 million. \nThis latest private equity investment in the U.S. shale industry is as much a bet on consolidation opportunities in the Permian as it is a vote of confidence in Luxe, which used a prior round of NGP funding two years ago to buy 18,000 acres and then within months sold it for a double-digit profit to Diamondback Energy Inc. \nLuxe plans to use the cash to buy as much as 60,000 across the Permian that it would at some point in the future sell or list as a publicly traded company. \n“We think there is a great opportunity for consolidation now” in the Permian, Lance Langford, Luxe’s chief executive, said in an interview. “We want to build something big.” \nLuxe, formed in 2015 by Langford and other former Statoil executives, is betting that as publicly-traded oil producers focus more on cutting costs, they’ll shed acreage that might be considered non-core. \n“We can see what’s hitting the market right now, and we’re excited,” said Langford. He declined to discuss potential or pending deals. \nLuxe’s operations team, staffed with some of Statoil’s former Bakken Shale engineers, has yet to actually drill any wells together because the company quickly sold its initial acreage to Diamondback. That does not seem to bother Irving, Texas-based NGP. \n“We have an extremely high degree of confidence in the technical and operational skill set of this team,” NGP’s Tony Weber said in a statement. \nIdeally, Langford said, Luxe would quickly begin drilling any acreage it acquires with the fresh NGP funds. \nThe company will have to contend with spiking land costs in the Permian, considered one of the most-active oilfields in the world and one expected to grow more active with oil prices now trading about $60 per barrel. Oasis Petroleum Inc , for example, paid $946 million last month for 20,300 acres, or roughly $46,000 per acre. \nThe rising land costs could dent Luxe’s plans to amass land holdings of as much as three times what Oasis acquired, though Langford said he was not dissuaded. \n“I have a team of roughly 30 that is always looking around at potential deals,” he said. “When the economics are right, they’ll know.” (Reporting by Ernest Scheyder; Editing by David Gregorio)", "external_links": [], "published": "2018-01-04T17:19:00.000+02:00", "crawled": "2018-01-04T17:32:35.014+02:00", "highlightTitle": ""}