{"organizations": [], "uuid": "fc07cbf1ecde51892d25fd5ba981a9cad7a9beea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227017945&w=1200&r=LYNXMPEE0U1DV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-valverde/valverde-lauds-coutinhos-versatility-idUKKBN1FK2LT", "country": "US", "domain_rank": 408, "title": "Valverde lauds Coutinho’s versatility", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:38:00.000+02:00", "replies_count": 0, "uuid": "fc07cbf1ecde51892d25fd5ba981a9cad7a9beea"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-valverde/valverde-lauds-coutinhos-versatility-idUKKBN1FK2LT", "ord_in_thread": 0, "title": "Valverde lauds Coutinho’s versatility", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:42 PM / Updated 24 minutes ago Valverde lauds Coutinho’s versatility Reuters Staff 2 Min Read \nMADRID (Reuters) - Barcelona coach Ernesto Valverde has hailed record signing nL8N1PQ6ZO’s versatility, saying he sees the Brazilian playing a variety of roles for the Catalan side. \nMany wondered where Coutinho, who joined from Liverpool for 142 million pounds this month, would be deployed by Valverde. \nThere was a theory that he was signed as the natural heir to central midfielder Andres Iniesta, who will turn 34 this year, but that may not be the case with Barca often deploying a 4-4-2 system this season. \n“What’s his ideal position? He’s a player who acquits himself well to various positions on the pitch: be it as a central midfielder or on the left or right of a frontline,” Valverde told a news conference on Wednesday. Soccer Football - Spanish King's Cup - Quarters Final Second Leg - FC Barcelona vs Espanyol - Camp Nou, Barcelona, Spain - January 25, 2018 Barcelona coach Ernesto Valverde speaks with Philippe Coutinho before sending him on as a substitute REUTERS/Albert Gea \n“He’ll help us in attack and is versatile enough to play in a few different positions. At Liverpool he often played on the left, while with Brazil he’s deployed on the right. We’ve seen that it’s gone well for both of those sides.” \nCoutinho could be handed his second start for his new club when they host Valencia in the King’s Cup semi-finals on Thursday. \nThe 25-year-old’s arrival meant Gerard Deulofeu was allowed to leave the Nou Camp, joining Watford on loan for the rest of the season. \n“These things happen. He had his chances to show what he can do but things didn’t go as he’d have liked,” Valverde said of the winger’s departure. \n“We spoke with him and he needs minutes, especially when you consider there’s a World Cup on the horizon.” Reporting by Joseph Cassinelli, editing by Ed Osmond", "external_links": [], "published": "2018-01-31T19:38:00.000+02:00", "crawled": "2018-01-31T20:31:34.735+02:00", "highlightTitle": ""}