{"organizations": [], "uuid": "16102011d1c47ffb0d26eae0bc0e03a11d51905b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA406_Hairpi_TOP_20180116175555.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/facing-advertising-headwinds-the-awl-and-the-hairpin-are-closing-down-1516144514", "country": "US", "domain_rank": 387, "title": "Facing Advertising Headwinds, The Awl and The Hairpin Are Closing Down", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-17T02:15:00.000+02:00", "replies_count": 0, "uuid": "16102011d1c47ffb0d26eae0bc0e03a11d51905b"}, "author": "Benjamin Mullin", "url": "https://www.wsj.com/articles/facing-advertising-headwinds-the-awl-and-the-hairpin-are-closing-down-1516144514", "ord_in_thread": 0, "title": "Facing Advertising Headwinds, The Awl and The Hairpin Are Closing Down", "locations": [], "entities": {"persons": [{"name": "choire sicha", "sentiment": "none"}, {"name": "david cho", "sentiment": "none"}, {"name": "michael macher", "sentiment": "none"}, {"name": "macher", "sentiment": "none"}, {"name": "alex balk", "sentiment": "none"}], "locations": [], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "the awl network", "sentiment": "none"}, {"name": "cmo today", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS The Awl and The Hairpin announced Tuesday that they plan to shut down at the end of the month, the latest niche sites to get squeezed out in an ultra-competitive digital ad market dominated by Facebook and Google.\nMichael Macher, publisher of The Awl Network, said the company decided to close the sites in part because it was getting harder to secure big advertising deals without increasing the size of its audience.\n“In general, in an increasingly inhospitable environment for small publishers, we got together and took a look at the business and decided that we would have less resources to continue on on our own terms,” Mr. Macher said in an interview.\nThe Awl and The Hairpin notified readers of their impending closures with messages on their websites Tuesday, with the Awl citing “a mixture of disappointment and relief” in announcing the site had come to “a natural end.”\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nThe Awl, founded in 2009 by the journalists Choire Sicha, Alex Balk and David Cho, covered “news, ideas and obscure Internet minutiae of the day.” The Hairpin, which was founded by journalist Edith Zimmerman in 2010, describes itself as “a general-interest site aimed at women.”\nThree full-time employees will lose their jobs as a result of the closures, Mr. Macher said.\nThe Billfold and Splitsider, two other websites in The Awl Network, will remain operational. Mr. Macher said that each site weighed its business prospects individually and declined to provide specific financial details.\nBetween 40% and 80% of The Awl Network’s monthly revenue comes from programmatic advertising, with the rest coming from directly sold advertisements, Mr. Macher said. The company’s revenue, which is “in low seven-figure territory” annually, has fluctuated in recent months as the company has struggled to land large advertising deals, Mr. Macher said.\n“We would see months where we did a lot of deals and other months where we didn’t see a lot of deals,” he said.\nWhile programmatic advertising technology that allows for automated ad transactions became more sophisticated, it wasn’t an “adequate replacement” for direct advertising deals, Mr. Macher said.\n“We’ve always been somewhat intentionally small, and scale has become increasingly important for securing large ad deals,” he wrote in an email. “It’s a structural shift with the way media buyers and agencies relate to publishers—and for better or worse less of those dollars are falling to indie publishers.”", "external_links": [], "published": "2018-01-17T02:15:00.000+02:00", "crawled": "2018-01-17T04:36:24.111+02:00", "highlightTitle": ""}