{"organizations": [], "uuid": "386d4f9177a0018be4c53e732a3bd9b1f836c156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/oklahoma-drilling-blast/update-1-five-missing-workers-in-oklahoma-well-fire-presumed-dead-idUSL2N1PI1AK", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Five missing workers in Oklahoma well fire presumed dead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:08:00.000+02:00", "replies_count": 0, "uuid": "386d4f9177a0018be4c53e732a3bd9b1f836c156"}, "author": "", "url": "https://www.reuters.com/article/oklahoma-drilling-blast/update-1-five-missing-workers-in-oklahoma-well-fire-presumed-dead-idUSL2N1PI1AK", "ord_in_thread": 0, "title": "UPDATE 1-Five missing workers in Oklahoma well fire presumed dead", "locations": [], "entities": {"persons": [{"name": "andy hendricks", "sentiment": "none"}, {"name": "tony say", "sentiment": "none"}], "locations": [{"name": "oklahoma", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. occupational safety and health administration", "sentiment": "none"}, {"name": "red mountain energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:12 PM / in 6 minutes UPDATE 1-Five missing workers in Oklahoma well fire presumed dead Reuters Staff 3 Min Read \n(Adds detail from briefing, names of victims) \nHOUSTON, Jan 23 (Reuters) - Officials on Tuesday called off the search for five missing workers and declared it “a recovery mission,” a day after a fiery explosion at an oil and gas drilling site in eastern Oklahoma. \nThree men from Oklahoma, one from Texas and one from Colorado were presumed dead, officials said. If confirmed, the accident would be the deadliest U.S. drilling mishap since the 2010 Deepwater Horizon offshore rig explosion that claimed 11 lives. \n“We’re focused on difficult days ahead of us,” Tony Say, chief executive of Red Mountain Energy, the operator of the well site, said at a briefing. He said the cause of the explosion had not been determined. \nThe U.S. Occupational Safety and Health Administration is investigating the blast, said Andy Hendricks, president and chief executive of drilling contractor Patterson-UTI. Three of the company’s employees were among those missing. \nThere were 22 workers at the site outside of Quinton, Oklahoma, about 146 miles (235 km) from Oklahoma City, involved in drilling Monday morning when the explosion occurred. Officials said 16 workers got away safely while one was treated for burns and released. \nThe fire was extinguished late Monday. Investigators have been combing the scene for clues to what caused the blast, said Kevin Enloe, director of the Pittsburg County Emergency Management Department. \nRed Mountain Energy is a privately-held oil and gas exploration company based in Oklahoma City. The company shares management with natural gas marketing and investment firm Clearwater Enterprises LLC. Red Mountain officials did not respond to requests for further comment. \nThe explosion is the latest in a series of accidents at oil and gas fields in the state. A gas explosion occurred at a Trinity Resources well in the same area in February 2017, injuring a worker. \nAccidents during oil and gas drilling claim about 100 lives a year in the United States, according to the U.S. Centers for Disease Control (CDC). Using data from the Bureau of Labor Statistics, the CDC reported 1,189 workers were killed in the 11 years ended 2013, a period of intensive drilling. \nThe men missing and feared dead were identified as Josh Ray, 35, from Fort Worth, Texas; Cody Risk, 26, of Wellington, Colorado; Parker Waldridge, 60, of Crescent, Oklahoma; Roger Cunningham, 55, of Seminole, Oklahoma; and Matt Smith, 29, of McAlester, Oklahoma. (Reporting by Bryan Sims; Additional reporting by Liz Hampton; Editing by Susan Thomas and Tom Brown)", "external_links": [], "published": "2018-01-23T20:08:00.000+02:00", "crawled": "2018-01-23T20:25:52.016+02:00", "highlightTitle": ""}