{"organizations": [], "uuid": "40d2469cc4d3f14e9295b7920e3e91bf1c05ab92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224500828&w=1200&r=LYNXMPEE0M17V", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-afrin/kurdish-led-authorities-in-northeast-syria-urge-mobilization-idUSKBN1FC1C3", "country": "US", "domain_rank": 408, "title": "Syrian Kurdish-led authorities urge mobilization against Turkish forces", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-23T19:25:00.000+02:00", "replies_count": 0, "uuid": "40d2469cc4d3f14e9295b7920e3e91bf1c05ab92"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-afrin/kurdish-led-authorities-in-northeast-syria-urge-mobilization-idUSKBN1FC1C3", "ord_in_thread": 0, "title": "Syrian Kurdish-led authorities urge mobilization against Turkish forces", "locations": [], "entities": {"persons": [{"name": "siyamand walat", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "afrin", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "afrin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HASAKA, Syria/BEIRUT (Reuters) - The Kurdish-led authorities of northeast Syria called on Tuesday for mass mobilization in defense of Syria’s Afrin region against a Turkish military offensive.\nTurkey’s air and ground offensive, now into its fourth day, is targeting U.S.-backed Kurdish YPG fighters in Afrin, near the Turkish border. It has opened a new front in Syria’s multi-sided civil war.\nAnkara sees the YPG as an extension of a separatist Kurdish group within its own borders which has waged a decades-long insurgency against the Turkish state.\n“The will of the people cannot be vanquished,” the civilian administration said in a statement. “We call on all our noble people to defend Afrin and its pride, and to contribute in all related activities.”\nSyrian Kurdish forces and their allies have set up three autonomous cantons in the north, including Afrin in the northwest, since the start of the Syrian conflict. They lie outside the control of Syrian President Bashar al-Assad.\nSiyamand Walat, the general commander of self-defence forces of the Kurdish-led north poses for a picture in Hasaka, northeastern Syria, January 23, 2018. REUTERS/Rodi Said “The Turkish state has been trying to enter north Syria for days, but it will not be able to,” said Siyamand Walat, the general commander of the self-defense forces in the north.\n“We have forces in Afrin, thousands... They are protecting the border and the people. Afrin is trained to endure,” Walat told Reuters.\nSlideshow (4 Images) “(If necessary) all the soldiers here will go to Afrin... We are ready at any moment,” he said, on the sidelines of a rally in Hasaka city, some 350 km (215 miles) east of Afrin.\nThousands of fighters chanted and raised their weapons in solidarity with Afrin.\nSyrian Kurds and allied forces have seized large swathes of territory by helping the United States and its allies to drive Islamic State jihadists from the area. The YPG are a key ally of the United States in Syria, much to Turkey’s fury.\nDeploying any reinforcements to Afrin from the east could be a complicated journey and would appear to require passing through territory under the control of the Assad government.\nReporting by Rodi Said in Hasaka, and Ellen Francis in Beirut; Editing by Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:25:00.000+02:00", "crawled": "2018-01-23T20:44:38.011+02:00", "highlightTitle": ""}