{"organizations": [], "uuid": "72b50c39d6fe0d88638936de07bf89055d65d39d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-t-mobile-closes-layer3-tv-acquisition-prepares-to-take-on-cable-satellite-tv.html", "country": "US", "domain_rank": 767, "title": "T-Mobile Closes Layer3 TV Acquisition, Prepares to Take On Cable & Satellite TV", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.079, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "72b50c39d6fe0d88638936de07bf89055d65d39d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-t-mobile-closes-layer3-tv-acquisition-prepares-to-take-on-cable-satellite-tv.html", "ord_in_thread": 0, "title": "T-Mobile Closes Layer3 TV Acquisition, Prepares to Take On Cable & Satellite TV", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "bellevue", "sentiment": "none"}], "organizations": [{"name": "t-mobile closes layer3 tv acquisition", "sentiment": "negative"}, {"name": "take on cable & satellite tv", "sentiment": "negative"}, {"name": "t-mobile us, inc.", "sentiment": "none"}, {"name": "t-mobile", "sentiment": "none"}, {"name": "big cable and satellite tv", "sentiment": "none"}, {"name": "layer3 tv, inc", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With the acquisition of Layer3 TV now complete, the Un-carrier goes to work on disrupting the $100+ billion pay TV market\nBELLEVUE, Wash.--(BUSINESS WIRE)-- Today, T-Mobile US, Inc. (NASDAQ: TMUS)(“T-Mobile”) announced the completion of its acquisition of Denver-based television innovator Layer3 TV, Inc. The talented Layer3 TV team has joined T-Mobile and will drive the Un-carrier’s initiative to launch a disruptive new TV service in 2018. To be the first to know about T-Mobile’s new TV service when it launches, consumers – even AT&T and Verizon customers – can sign up at www.t-mobile.com/tv , and they’ll also get an exclusive offer when the new solution launches in their area.\nOn December 13, 2017, T-Mobile unveiled its plans to Un-carrier your TV, fueled by the talent and technology from Layer3 TV. The reaction was overwhelming. Fans shared the news so much on social media that it was seen more than half a billion times – coinciding with a drop in Charter and Comcast stock on the day. Consumers are clearly fed up with Big Cable and Satellite TV, America’s #1 most hated industry.\n“We know people love their TV, but hate their TV providers. But, the reaction to our announcement last month took even me by surprise. People are ready for choice and change! Well, good news ‘cause that’s exactly what we’re gonna bring!” said John Legere, President and CEO of T-Mobile. “I can’t wait to take the fight to Big Cable and Satellite TV on behalf of consumers everywhere!”\nThe mobile Internet is the Internet now, and that’s causing a huge wave of tech convergence, where wireless, wireline and cable technologies and capabilities are all coming together. With the introduction of 5G, that’s all going to massively accelerate, which makes now the right time for T-Mobile to disrupt the entertainment space. T-Mobile is creating TV for people who love TV and that will work over any Internet connection – landline or mobile, even those slower ones from AT&T and Verizon.\nT-Mobile’s new TV team will be led by Jeff Binder, CEO of Layer3 TV, who has joined T-Mobile as an Executive Vice President and part of the Senior Leadership Team, reporting to T-Mobile’s Chief Operating Officer, Mike Sievert. Jeff is joined by nearly 200 Layer3 TV employees including his executive leadership team including Lindsay Gardner, former President of Distribution at Fox; Dave Fellows, former CTO of Comcast and AT&T Broadband; Amos Smith, former SVP and CFO of Time Warner Cable Residential Services; and Gregg Grigaitis, former SVP Products of Suddenlink.\nFor more information and to sign up to be the first to know about T-Mobile’s new TV service and get an exclusive launch discount, visit www.t-mobile.com/tv . While the Un-carrier develops its new TV service, the existing Layer3 TV product will be available to demo or purchase in select T-Mobile stores in Chicago, Dallas, Denver, Los Angeles and Washington, D.C. starting in the coming weeks.\nOther Information\nThe acquisition is not expected to impact previously announced company guidance or expectations.\nAbout T-Mobile US, Inc.\nAs America's Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services and video through leading product and service innovation. Our advanced nationwide 4G LTE network delivers outstanding wireless experiences to 72.6 million customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and MetroPCS. For more information, please visit http://www.t-mobile.com .\nForward-Looking Statements\nThis news release includes \"forward-looking statements\" within the meaning of the U.S. federal securities laws. Any statements made herein that are not statements of historical fact, including statements about T-Mobile US, Inc.'s plans, outlook, beliefs, opinions, projections, strategy, and market and distribution expansion are forward-looking statements. Generally, forward-looking statements may be identified by words such as \"anticipate,\" \"expect,\" \"suggests,\" \"plan,\" “project,” \"believe,\" \"intend,\" \"estimates,\" \"targets,\" \"views,\" \"may,\" \"will,\" \"forecast,\" and other similar expressions. The forward-looking statements speak only as of the date made, are based on current assumptions and expectations, and involve a number of risks and uncertainties. Important factors that could affect future results and cause those results to differ materially from those expressed in the forward-looking statements include, among others, the following: adverse economic or political conditions in the U.S. and international markets; competition in the wireless services and pay TV markets, including new competitors entering the industry as technologies converge; the effects any future merger or acquisition involving us, as well as the effects of mergers or acquisitions in the technology, media and telecommunications industry; challenges in implementing our business strategies or funding our wireless operations; any disruption or failure of our third parties’ or key suppliers’ provisioning of products or services; material adverse changes in labor matters, including labor campaigns, negotiations or additional organizing activity, and any resulting financial, operational and/or reputational impact; the ability to make payments on our debt or to repay our existing indebtedness when due; adverse change in the ratings of our debt securities or adverse conditions in the credit markets; and other risks described in our filings with the Securities and Exchange Commission, including those described in our most recently filed Annual Report on Form 10-K. You should not place undue reliance on these forward-looking statements. We do not undertake to update forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005924/en/\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nor\nInvestor Relations\n877-281-TMUS OR 212-358-3210\ninvestor.relations@t-mobile.com\nSource: T-Mobile US, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.t-mobile.com%2Ftv&esheet=51747295&newsitemid=20180123005924&lan=en-US&anchor=www.t-mobile.com%2Ftv&index=1&md5=12f4fa6a3ebe7d2ccaa6676c22954b0a", "http://www.businesswire.com/news/home/20180123005924/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.t-mobile.com%2Ftv&esheet=51747295&newsitemid=20180123005924&lan=en-US&anchor=www.t-mobile.com%2Ftv&index=2&md5=34f9ad98337a0001307e7a9cb44185b4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.t-mobile.com&esheet=51747295&newsitemid=20180123005924&lan=en-US&anchor=http%3A%2F%2Fwww.t-mobile.com&index=3&md5=6fd2a907ab06ebd0bff42f3435cc186c"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:51:05.024+02:00", "highlightTitle": ""}