{"organizations": [], "uuid": "a9a7cca22e53926d5e1596de6ad196b021bab48d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/14/reuters-america-rpt-u-s-socially-screened-funds-draw-second-biggest-inflows-ever.html", "country": "US", "domain_rank": 767, "title": "RPT-U.S. 'socially screened' funds draw second-biggest inflows ever", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T14:00:00.000+02:00", "replies_count": 0, "uuid": "a9a7cca22e53926d5e1596de6ad196b021bab48d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/14/reuters-america-rpt-u-s-socially-screened-funds-draw-second-biggest-inflows-ever.html", "ord_in_thread": 0, "title": "RPT-U.S. 'socially screened' funds draw second-biggest inflows ever", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "william vaughn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "investment company institute", "sentiment": "none"}, {"name": "brandywine global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan. 12 story with no change to text)\nNEW YORK, Jan 12 (Reuters) - U.S. investors poured $4.7 billion into so-called socially responsible mutual funds and exchange-traded funds in 2017, the category's second-biggest annual inflow ever, with managers pointing to Trump administration policies as a reason for the move.\nThe industry remains relatively small, with an estimated $2.6 trillion in funds that screen investments based on companies' social and environmental impact, compared with $16.3 trillion in all funds, according to the Investment Company Institute trade group.\nFund managers and advisors said interest in socially conscious investing was boosted by President Donald Trump in June announcing his intention to pull out of the Paris Climate Accord, arguing it would undermine the U.S. economy.\n\"Trump saying he would withdraw the U.S. from the Paris Accord was the biggest single driver and served as a call to arms for pension funds and other investors to step up,\" said William Vaughn, a research analyst at Philadelphia-based Brandywine Global, which manages approximately $74 billion in assets.\nInflows into socially screened funds typically do not track those of the broader market, due in part to a smaller investor base that tends to keep their money invested regardless of year-by-year performance.\nIndeed, inflows into such funds and ETFs grew by 22 percent in 2017, compared with a 232 percent increase into mutual funds and ETFs overall.\nBut the 2017 inflows into socially screened funds marked a 340 percent jump from 2013, when investors directed just $1 billion into the category, according to Lipper data. By comparison, inflows into all funds grew 154 percent from 2013.\nJoe Sinha, the head of sales and marketing at San Francisco-based Parnassus Investments, said inflows were roughly split between retail investors and institutions such as university endowment funds and religious organizations over the last year.\nThe previous record amount of inflows into socially responsible funds came in 2001, when investors directed $11.6 billion into the category. That coincided with the launch of 13 funds by Dallas-based GuideStone Funds, which brought in $10.2 billion in assets, according to Lipper data.\nThe $5.5 billion Parnassus Endeavor fund had the largest inflows among socially screened funds in 2017, bringing in some $1.6 billion in cash, followed by the $2.8 billion Parnassus Mid-Cap fund, which received net positive inflows of approximately $689 million, according to Morningstar data.\nThe Parnassus Endeavor fund, which has its largest positions in Qualcomm Inc, Gilead Sciences Inc, and Mattel Inc, has gained an average of 16.1 percent over each of the last three years, putting it in the top 1 percent of 1,197 other large-blend funds in its Morningstar category.\nThe inflows will likely prompt the launch of similar funds, which have been a bright spot for active managers that have been losing ground to cheaper, passive index funds and exchange-traded funds.\nAnd while a host of ETFs have emerged that track indexes screening by similar criteria, some active managers hope that their funds will retain an edge by offering products such as Christian or Islamic-screened products that may not translate well to an ETF format.\nJoe Keefe, chief executive of Pax World Investments, based in Portsmouth, New Hampshire, said that there is a strong possibility of the firm launching new funds in 2018.\nInvestors in socially responsible funds may be less sensitive to underperformance because they are also taking the social attributes into consideration, said Todd Rosenbluth, director of mutual fund research at New York-based CFRA Research.\n\"These investors chose the fund more for its investment approach than its track record,\" he said.\n(Reporting by David Randall; Editing by Jennifer Ablan and Meredith Mazzilli)", "external_links": [], "published": "2018-01-14T14:00:00.000+02:00", "crawled": "2018-01-14T20:06:09.015+02:00", "highlightTitle": ""}