{"organizations": [], "uuid": "cd451751b6b6dc0c650862358731ebebb476eae7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/bomb-cyclone.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/bomb-cyclone-grayson-blizzard-winter-snow-storm-2018/", "country": "US", "domain_rank": 1196, "title": "Commentary: The Bomb Cyclone Could Bomb This Region’s Economy | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "cd451751b6b6dc0c650862358731ebebb476eae7"}, "author": "Luis Ballesteros", "url": "http://fortune.com/2018/01/04/bomb-cyclone-grayson-blizzard-winter-snow-storm-2018/", "ord_in_thread": 0, "title": "Commentary: The Bomb Cyclone Could Bomb This Region’s Economy | Fortune", "locations": [], "entities": {"persons": [{"name": "luis ballesteros", "sentiment": "negative"}], "locations": [{"name": "gulf coast", "sentiment": "none"}, {"name": "northeast u.s.", "sentiment": "none"}, {"name": "carolinas", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "sunshine state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Luis Ballesteros January 4, 2018 \nThe 2018 “bomb cyclone” won’t necessarily have the strongest impact on the Northeast U.S., as has been suggested in the media. Instead, the deepest consequences will be felt down map, where wearing heavy gloves and snow boots is not business as usual. \nThe first days of 2018 brought the first snowfall to Louisiana’s Gulf Coast and areas of Florida in 30 years. Of course, children in the Sunshine State deserve a winter wonderland not limited to the inflatable snowman on the lawn. The problem is that the infrequency of these weather conditions heightens the probability of an economic crisis. \nSouthern local governments have little experience with this kind of emergency preparedness and many lack essential resources for recovery. In addition, most homes lack heating systems and public infrastructure is highly vulnerable to freezing conditions. A cold front last month, for instance, left thousands of customers without energy in the Carolinas for several days. Long highway stretches had to close this week in Florida. \nThe underprepared or inefficient management of extreme weather conditions is associated with a mortality rate of 40% among local businesses in the immediate aftermath, and 70% within two years. This derives from two causes. First, behavioral factors affect the way business managers prepare for low-probability, high-consequence events. Decision makers tend to estimate the likelihood of an a rare event by the ease with which instances of its occurrence can be brought to mind. Recent personal experience can thus lead to an underestimation of the risk prior to an adverse event, and overestimation following its occurrence. Only after experiencing a severe disaster do most firms take steps to reduce the potential losses from another adverse shock to their operations. \nRisk underestimation results in neglecting weather risks whose probability is drastically lower than that of events such as factory accidents. The lack of attention to flood risk in the Houston area, for instance, led firms of all sizes to suffer costly financial setbacks from Hurricane Harvey. Harvey is now projected to be the costliest natural disaster in American history , potentially exceeding Hurricane Katrina’s cost of $108 billion. \nSecond, formal risk-management strategies for handling winter storms are comparatively underdeveloped in the South. The Walt Disney Company can easily hedge its operations in its Florida parks against torrential rainfall using weather insurance. Conversely, the company would have a difficult time finding winter storm insurance. This can generate significant financial consequences. In 2006, record cold caused computer glitches in several Disney attractions that led the company to stop operations in all of its parks. \nIt’s worth asking whether the frequency of extremely cold winters justifies investing in risk-management systems where they remain rare. The federal government has historically served as an important driver of individual businesses’ decisions to invest in weather shock preparation, though now the Trump administration is reducing investment in weather risk management. It remains to be seen whether this will spur or dampen businesses’ incentives to prepare for future cold winters. \nThe jury is still out on whether severe winter conditions significantly affect economic activity . Of course, establishing causality is as challenging as imagining a child making snow angels in Tallahassee, Fla . Regardless of how sizable such effects are, it’s easy to understand that the lower the frequency of a phenomenon is, the higher its likelihood to become a significant disruption for the local economy. If Bomb Cyclone Grayson and the 2017–18 winter season prove to be an economic bomb, arguably it will be because of their consequences on areas less accustomed to frigid conditions, from the mid-Atlantic to southern Florida. \nLuis Ballesteros is an assistant professor at the George Washington University. Follow him on Twitter . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-05T03:24:59.013+02:00", "highlightTitle": ""}