{"organizations": [], "uuid": "6125dc5c6fd1e8379c00d8871e53ad9122b325d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-dialogtech-acquires-swydo-to-bring-omni-channel-visualizations-to-call-analytics.html", "country": "US", "domain_rank": 767, "title": "DialogTech Acquires Swydo to Bring Omni-Channel Visualizations to Call Analytics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.423, "site_type": "news", "published": "2018-01-02T17:45:00.000+02:00", "replies_count": 0, "uuid": "6125dc5c6fd1e8379c00d8871e53ad9122b325d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-dialogtech-acquires-swydo-to-bring-omni-channel-visualizations-to-call-analytics.html", "ord_in_thread": 0, "title": "DialogTech Acquires Swydo to Bring Omni-Channel Visualizations to Call Analytics", "locations": [], "entities": {"persons": [{"name": "irv shapiro", "sentiment": "none"}], "locations": [{"name": "swydo", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 2, 2018 /PRNewswire/ -- DialogTech , the world leader in actionable marketing analytics for businesses that value inbound calls, today announced the acquisition of Swydo , provider of industry-leading digital marketing dashboards, reports and visualizations. The acquisition enables DialogTech customers to view their call analytics data alongside their martech and adtech performance data within the DialogTech platform in Swydo-powered reports and dashboards, making it easy to measure KPIs and uncover insights to optimize their marketing across channels.\n\"DialogTech captures the most insightful marketing data on inbound calls and conversations, and we are excited to enable our customers to visualize their omni-channel data within DialogTech via Swydo-powered reports and dashboards,\" said Irv Shapiro, CEO of DialogTech. \"The addition of Swydo visualizations is another example of how DialogTech leads the way in helping marketers connect calls to the increasingly complex customer journey.\"\nDialogTech provides businesses and agencies with insights and analytics data on inbound calls that marketers use to optimize lead generation, grow revenue and personalize caller experiences in real time. With the addition of Swydo, DialogTech customers now have three powerful options to analyze their call data:\nDialogTech Reports: Powered by Swydo, marketers can use a drop-and-drag editor to create stunning omni-channel marketing reports and dashboards in minutes. In addition to DialogTech call data, users can include their Google Analytics, AdWords, Bing, Facebook, Instagram, Twitter and MailChimp data to gain a holistic view of their customers' journeys. AI-Driven Insights: DialogTech provides industry-leading AI and machine-learning technology that analyzes the entire context of calls to uncover hidden insights marketers use to drive growth. Seamless Integrations: DialogTech has built-in integrations with leading CRM, bid management, web analytics and digital advertising platforms, so marketers can use the same tools to measure and optimize inbound calls that they use for online conversions.\nDialogTech customers can access Swydo-powered reports today within the DialogTech platform as part of its Dashboard Insights tool, which the company is offering for a limited time as a free 30-day trial .\nThe acquisition also benefits Swydo customers, who can add call analytics data from DialogTech to their reports and dashboards inside Swydo for a holistic view of marketing performance, both online and over the phone.\n\"We are thrilled to join the DialogTech team and combine our technologies and engineering resources to provide exceptional value to both our customer bases,\" said Jeroen Maljers, CEO of Swydo. \"DialogTech is the undisputed leader in call analytics, and our team was very impressed by DialogTech's vision and commitment to providing businesses and agencies with the actionable marketing analytics they need to succeed.\"\nAdditional Resources:\nRead the DialogTech blog on the announcement Register for a free 30-day trial of Dashboard Insights Learn about the data DialogTech captures for inbound calls\nAbout DialogTech\nDialogTech provides actionable marketing analytics for businesses that value inbound calls. Consistently recognized as the leader and pioneer in call analytics and optimization, DialogTech is the trusted voice management platform for Fortune 500 brands, agencies and fast-growing companies. From call attribution to conversation analytics to caller experience optimization, only DialogTech has everything marketers need to drive the conversations that drive revenue. visit dialogtech.com .\nAbout Swydo\nSwydo's industry-proven, award-winning reporting, monitoring and workflow platform retrieves data from multiple sources to create professional, customizable reports marketers use to measure KPIs and drive growth. Swydo was awarded Best Search Software Tool in 2016 and Best Reporting & Analytics Software in 2017 by the Dutch Search Awards, and is a Google Technology Partner.\nMedia Contact\nBlair Symes\nDialogTech\nbsymes@dialogtech.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/dialogtech-acquires-swydo-to-bring-omni-channel-visualizations-to-call-analytics-300576413.html\nSOURCE DialogTech", "external_links": ["https://www.dialogtech.com/dashboard-insights-30-day-trial", "https://www.dialogtech.com/blog/news-and-trends/swydo-acquisition", "https://www.dialogtech.com/products/call-attribution", "https://www.swydo.com/", "http://www.prnewswire.com/news-releases/dialogtech-acquires-swydo-to-bring-omni-channel-visualizations-to-call-analytics-300576413.html", "http://www.dialogtech.com/", "https://www.dialogtech.com/"], "published": "2018-01-02T17:45:00.000+02:00", "crawled": "2018-01-02T19:21:18.000+02:00", "highlightTitle": ""}