{"organizations": [], "uuid": "b18bcb56d6ae80696c7edf24036d03e6252a3cc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/20/104853410-GettyImages-515106948.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/20/manson-follower-leslie-van-houten-denied-parole-by-governor.html", "country": "US", "domain_rank": 767, "title": "Manson follower Leslie Van Houten denied parole by governor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T13:17:00.000+02:00", "replies_count": 0, "uuid": "b18bcb56d6ae80696c7edf24036d03e6252a3cc6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/manson-follower-leslie-van-houten-denied-parole-by-governor.html", "ord_in_thread": 0, "title": "Manson follower Leslie Van Houten denied parole by governor", "locations": [], "entities": {"persons": [{"name": "leslie van houten", "sentiment": "negative"}, {"name": "manson", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}, {"name": "charles manson", "sentiment": "none"}, {"name": "rosemary", "sentiment": "none"}, {"name": "sharon tate", "sentiment": "none"}, {"name": "leno labianca", "sentiment": "none"}, {"name": "jerry brown", "sentiment": "none"}, {"name": "van houten", "sentiment": "none"}, {"name": "rich pfeiffer", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The governor of California once again denied parole Friday for Leslie Van Houten, the youngest follower of murderous cult leader Charles Manson who blamed herself at her parole hearing for letting him control her life.\nGov. Jerry Brown said in his decision that Van Houten still lays too much of the blame on Manson, who died two months ago at 83.\nBrown acknowledged that Van Houten's youth at the time of the crime, her more than four decades as a model prisoner and her abuse at the hands of Manson make it worth considering her release.\n\"However,\" he wrote in his decision \"these factors are outweighed by negative factors that demonstrate she remains unsuitable for parole.\"\nThe 68-year-old Van Houten is serving life for the murders of wealthy grocer Leno LaBianca and his wife, Rosemary, when Van Houten was 19. They were stabbed a day after other Manson followers killed pregnant actress Sharon Tate and four other people in Los Angeles.\nVan Houten's attorney, Rich Pfeiffer, said Brown's decision shows an unprecedented and unlawful reliance to deny parole based on the circumstances of the crime, rather than the inmate's fitness.\n\"We're going to challenge this in court,\" Pfeiffer said. \"I expect the courts to uphold the law and allow her to be released.\"\nPfeiffer added that he has \"dozens of clients who have done much worse deeds than Leslie has done and they're out leading productive lives.\"\nVan Houten has long been considered among the most likely candidates among Manson \"family\" members to be paroled, But Brown, like Gov. Arnold Schwarzenegger before him, has steadfastly refused to let anyone associated with Manson's killings go free.\nIt's the second time Brown has blocked parole for Van Houten after a state parole panel recommended that she be freed.\nBrown wrote Friday that Van Houten \"played a vital part in the LaBianca murders, one of the most notorious of the Manson family crimes. The devastation and loss experienced by the LaBianca family and all the victims' families continues today.\"\nshow chapters Charles Manson, whose cult slayings horrified world, dies 10:49 AM ET Mon, 20 Nov 2017 | 00:44 Although she said at her September parole hearing that she accepts full responsibility for her role, Van Houten \"still shifted blame for her own actions onto Manson to some extent.\"\nBrown recalled Van Houten saying that she takes responsibility for \"Manson being able to do what he did to all of us. I allowed it. I accept responsibility that I allowed him to conduct my life in that way.\"\nShe appeared frail at the parole hearing with her silver hair pulled back in a bun, almost unrecognizable from the young woman who pledged her allegiance to Manson.\nShe said at the hearing that she was devastated when her parents divorced when she was 14. Soon after, she said, she began hanging out with her school's outcast crowd and using drugs in the Los Angeles suburb of Monrovia. When she was 17, she and her boyfriend ran away to San Francisco's Haight-Ashbury District during the city' summer of love.\nShe was traveling up and down the California coast when acquaintances led her to Manson, who was holed up at an abandoned movie ranch on the outskirts of Los Angeles where he had recruited what he called a \"family\" to survive what he insisted would be a race war he would launch by committing a series of random, horrifying murders.\nAt her hearing, Van Houten candidly described how she joined several other members of the group in killing the LaBiancas, carving up Leno LaBianca's body and smearing the couple's blood on the walls.\nNo one who took part in the Tate-LaBianca murders has been released from prison.\nManson died of natural causes on Nov. 20 at a California hospital while serving a life sentence. A man who befriended him through letters and another who purports to be his grandson are fighting in court over his body and possessions.", "external_links": [], "published": "2018-01-20T13:17:00.000+02:00", "crawled": "2018-01-20T14:30:45.005+02:00", "highlightTitle": ""}