{"organizations": [], "uuid": "8a73a920afb450c43dc971aad55a8f213b2b2ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-extraction-oil-gas-inc-announces-pricing-and-upsize-of-private-offering-of-senior-unsecured-notes.html", "country": "US", "domain_rank": 767, "title": "Extraction Oil & Gas, Inc. Announces Pricing And Upsize Of Private Offering Of Senior Unsecured Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:00:00.000+02:00", "replies_count": 0, "uuid": "8a73a920afb450c43dc971aad55a8f213b2b2ee9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-extraction-oil-gas-inc-announces-pricing-and-upsize-of-private-offering-of-senior-unsecured-notes.html", "ord_in_thread": 0, "title": "Extraction Oil & Gas, Inc. Announces Pricing And Upsize Of Private Offering Of Senior Unsecured Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "extraction oil & gas, inc.", "sentiment": "neutral"}, {"name": "extraction oil & gas, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Extraction Oil & Gas, Inc. (NASDAQ:XOG) (“Extraction”) priced its previously announced private offering of senior unsecured notes due in 2026 (the “Notes Offering”). The senior unsecured notes (the “Notes”) will bear interest at 5.625% per annum. Extraction upsized the offering amount from $600 million to $750 million in aggregate principal amount. Extraction intends to use a portion of the net proceeds from this private placement to fund the tender offer (the “Tender Offer”) to purchase any and all of its outstanding 7.875% Senior Notes due 2021 (the “2021 Notes”), to pay any fees and expenses thereof, to redeem any 2021 Notes that remain outstanding after consummation of the Tender Offer, and the remaining net proceeds for general corporate purposes.\nThe closing of the Notes Offering, which is subject to customary conditions, is expected to occur on January 25, 2018. The Notes being offered by Extraction will not be registered under the U.S. Securities Act of 1933, as amended (the “Securities Act”), and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements of the Securities Act and applicable state securities laws. The Notes are being offered and sold only to qualified institutional buyers in the United States pursuant to Rule 144A under the Securities Act and outside the United States in compliance with Regulation S under the Securities Act. In Canada, the Notes are to be offered and sold on a private placement basis in certain provinces of Canada.\nThis press release does not constitute an offer to sell, or a solicitation of an offer to buy, any security and shall not constitute an offer, solicitation or sale in any jurisdiction in which such an offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\nForward-Looking Statements\nCertain statements in this press release are forward-looking statements. All statements, other than statements of historical fact, included in this press release that address activities, events or developments that Extraction expects, believes or anticipates will or may occur in the future are forward-looking statements. These statements are based on certain assumptions made by Extraction based on its experience and perception of historical trends, current conditions, expected future developments and other factors it believes are appropriate in the circumstances. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. All forward-looking statements are qualified in their entirety by this cautionary statement. Extraction undertakes no obligation and does not intend to update these forward-looking statements to reflect events or circumstances occurring after this press release.\nAbout Extraction Oil & Gas, Inc.\nDenver-based Extraction Oil & Gas, Inc. is an independent energy exploration and development company focused on exploring, developing and producing crude oil, natural gas and NGLs primarily in the Wattenberg Field in the Denver-Julesburg Basin of Colorado.\nInvestor Contact: Louis Baltimore, ir@extractionog.com , 720-974-7773\nSource:Extraction Oil & Gas, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=KoRWd0TzjF6XLkcCrwo_uKxNmN-w4HsF47WFJdRl2lJIFGESLae3lj6hTsicL3maYmX9Ri9XLpvzxjoAOA3u5OeL5Ikk8KZUqp7zb2-5OUo=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9ab382d9-6610-43c9-aa76-f6500483eff1"], "published": "2018-01-19T01:00:00.000+02:00", "crawled": "2018-01-19T02:37:14.010+02:00", "highlightTitle": ""}