{"organizations": [], "uuid": "7281868c122e28d281ad83f04502ef5add50515a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-t2-biosystems-announces-preliminary-fourth-quarter-2017-financial-results-and-provides-update-on-t2bacteria-panel.html", "country": "US", "domain_rank": 767, "title": "T2 Biosystems Announces Preliminary Fourth Quarter 2017 Financial Results and Provides Update on T2Bacteria Panel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:05:00.000+02:00", "replies_count": 0, "uuid": "7281868c122e28d281ad83f04502ef5add50515a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-t2-biosystems-announces-preliminary-fourth-quarter-2017-financial-results-and-provides-update-on-t2bacteria-panel.html", "ord_in_thread": 0, "title": "T2 Biosystems Announces Preliminary Fourth Quarter 2017 Financial Results and Provides Update on T2Bacteria Panel", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "lexington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "t2bacteria research use only panel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FDA Clearance of T2Bacteria® Panel remains on track for first quarter 2018\nTotal revenue expected to exceed the high end of guidance\nLEXINGTON, Mass., T2 Biosystems, Inc. (NASDAQ:TTOO), a leader in the development of innovative medical diagnostic products for critical unmet needs in healthcare, today announced preliminary revenue and business results for the three months ended December 31, 2017 and provided an update on its 510(k) filing with the U.S. Food and Drug Administration (FDA) for market clearance of the T2Bacteria Panel.\nThe company closed 7 contracts with new customers in the fourth quarter including 3 new contracts for the T2Bacteria Research Use Only Panel in the United States. There are an estimated 45,000 high risk patients associated with the closed contracts, exceeding the fourth quarter guidance of 30,000 high risk patients.\nTotal revenue in the fourth quarter is expected to exceed the previously guided range of $1.1 to $1.3 million. The strength in the quarter is due to an increase in product revenue driven by demand for the T2Dx® Instrument and the T2Candida® Panel.\n“Our sales pipeline is building and sales cycles are accelerating, we believe primarily due to the anticipated FDA clearance of the T2Bacteria Panel, and the market need addressed by the product and the excellent clinical performance demonstrated in the pivotal trial,” said John McDonough, president and chief executive officer of T2 Biosystems. “We are pleased with the growth in the customer base in Q4 and in particular, the growth in product revenue, consisting of the sales of the T2Dx Instrument and the T2Candida Panel, which were strong in the quarter. This growth in product revenue is indicative of an increase in the testing of patients with T2Candida and an increase in demand for our rapid diagnostic solution both within and outside of the United States.”\nIn addition, the company remains in positive and productive discussions with the FDA regarding market clearance of its T2Bacteria Panel and is reiterating the anticipated timing for FDA clearance in the first quarter of 2018.\nComplete 2017 fourth quarter and full year financial results will be announced during the company’s fourth quarter earnings call. At that time, the company also anticipates providing 2018 financial guidance.\nAbout T2 Biosystems\nT2 Biosystems, a leader in the field of innovative medical diagnostics that solves critical unmet needs in healthcare, improves patient care and reduces the cost of healthcare by helping clinicians effectively treat patients faster than ever before. For more information, please visit www.t2biosystems.com .\nAbout the T2Sepsis Solution\nSepsis, one of the deadliest and most expensive conditions in hospitals today, is the focus of the T2Sepsis Solution™, a unique approach that combines the standard of care for the management of sepsis patients with T2 Biosystems’ products, including the T2Dx Instrument and T2Candida Panel, and the T2Bacteria Panel. Powered by the proprietary T2 Magnetic Resonance technology, or T2MR®, the T2Sepsis Solution is proven to deliver better patient care and greater cost savings. It has demonstrated faster time to effective treatment, shortened ICU and hospital lengths of stay, reduced use of unnecessary antifungals, and millions of dollars in savings. T2Bacteria Panel is commercially available in Europe and other countries that accept the CE Mark and is available for research use only in the U.S.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements contained in this press release that do not relate to matters of historical fact should be considered forward-looking statements, including, without limitation, statements regarding , product pipeline, anticipated product benefits, goals and strategic priorities, product expansion or opportunities, growth expectations or targets and FDA clearance, as well as statements that include the words “expect,” “intend,” “plan,” “believe,” “project,” “forecast,” “estimate,” “may,” “should,” “anticipate” and similar statements of a future or forward-looking nature. These forward-looking statements are based on management's current expectations. These statements are neither promises nor guarantees, but involve known and unknown risks, uncertainties and other important factors that may cause actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to, (i) any inability to (a) realize anticipated benefits from commitments, contracts or products; (b) successfully execute strategic priorities; (c) bring products to market; (d) expand product usage or adoption; (e) obtain customer testimonials; (f) accurately predict growth assumptions; (g) realize anticipated revenues; (h) incur expected levels of operating expenses; or (i) increase the number of high-risk patients at customer facilities; (ii) failure of early data to predict eventual outcomes; (iii) failure to make or obtain anticipated FDA filings or clearances within expected time frames or at all; or (iv) the factors discussed under Item 1A. \"Risk Factors\" in the company's Annual Report on Form 10-K for the year ended December 31, 2016, filed with the U.S. Securities and Exchange Commission, or SEC, on March 15, 2017, and other filings the company makes with the SEC from time to time. These and other important factors could cause actual results to differ materially from those indicated by the forward-looking statements made in this press release. Any such forward-looking statements represent management's estimates as of the date of this press release. While the company may elect to update such forward-looking statements at some point in the future, unless required by law, it disclaims any obligation to do so, even if subsequent events cause its views to change. Thus, one should not assume that the Company’s silence over time means that actual events are bearing out as expressed or implied in such forward-looking statements. These forward-looking statements should not be relied upon as representing the company's views as of any date subsequent to the date of this press release.\nCompany Contact:\nDarlene Deptula-Hicks, T2 Biosystems\nSVP & Chief Financial Officer\nddeptula@t2biosystems.com\n603-553-5803\nMedia Contact:\nAmy Phillips, Feinstein Kean Healthcare\namy.phillips@fkhealth.com\n412-327-9499\nInvestor Contact:\nChris Brinzey, Westwicke Partners\nchris.brinzey@westwicke.com\n339-970-2843\nSource:T2 Biosystems, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/21ce43b1-81a5-42af-8c47-c2df2e179d21", "https://www.globenewswire.com/Tracker?data=Tt3giihxlWWbRDbWnDkVerZBiqz12YmZ2ppF7rA8ohQSYlHLCzqzUqpuujbrroYjJn_RIrZCyb-jacZXqQKW1f5Dt6HR_cLA9mMj1MHiZH4=", "https://www.globenewswire.com/Tracker?data=7muQ7lyVyMfnD7atGF-vBo9T4-vrGmzXoiXi-x3-kyUOcf6gDaddA0vkQQUUa7LnspuzuCU-JUyyCLUdfaOBqwaw8CQn0cWPCe8iPZfGq39PYZX5ljGNb9ZTfTeyrSO3", "https://www.globenewswire.com/Tracker?data=96xEXTag9RpxI94qwnPUVSpZ4x2z5oVNdoQQ90i9NFUlQDhDmA1BnuOknKbI2iNkFuK5t_l_z2BRp2CDBEvG5QHpgzzzwhshtK4T3Jni8W0=", "https://www.globenewswire.com/Tracker?data=KE2bz9Xf8jvhI2icCO5oKewJg2egL0xLjD4Qs9WRwH2b8J0OLHOX-w1RJHNpuSQyz3jfYXP8QeUQQyTa1qb8q_EjpeYX8z1ACxPq1Lic4bM="], "published": "2018-01-05T00:05:00.000+02:00", "crawled": "2018-01-05T01:33:13.011+02:00", "highlightTitle": ""}