{"organizations": [], "uuid": "56c3499f598de5b177e8d0a9a4dae26670c280e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/30/104681431-RTX369XG.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/us-stocks-set-to-open-sharply-higher-after-3-day-government-shutdown-ends.html", "country": "US", "domain_rank": 767, "title": "US stocks set to open mixed after 3-day government shutdown ends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-23T14:37:00.000+02:00", "replies_count": 0, "uuid": "56c3499f598de5b177e8d0a9a4dae26670c280e1"}, "author": "Berkeley Lovelace Jr.", "url": "https://www.cnbc.com/2018/01/23/us-stocks-set-to-open-sharply-higher-after-3-day-government-shutdown-ends.html", "ord_in_thread": 0, "title": "US stocks set to open mixed after 3-day government shutdown ends", "locations": [], "entities": {"persons": [{"name": "dara khosrowshahi", "sentiment": "negative"}, {"name": "kalanick", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ray dalio", "sentiment": "none"}, {"name": "travis kalanick", "sentiment": "none"}, {"name": "marc benioff", "sentiment": "none"}, {"name": "salesforce", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "bridgewater associates", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS ECONOMIC FORUM Dara Khosrowshahi, the new CEO of Uber, said on CNBC from Davos the \"moral compass of the company\" was not pointing in the right direction under his predecessor, co-founder Travis Kalanick, who was ousted as chief executive last year after a series of scandals.\nSalesforce 's Marc Benioff at Davos slammed the leadership styles of Silicon Valley bosses , citing Uber as a company that he claimed, under previous CEO Kalanick, had forgotten to value trust among its customers. (CNBC)\nEuropean leaders will be out in force at the World Economic Forum in Davos this week to defend multilateralism before President Donald Trump arrives to deliver his \"America First\" message. Trump is due to the address the forum on Friday. (Reuters)\n* Trump promised to 'Make America Great Again.' World doesn't think so (USA Today)\nAs international business and political leaders gather today at the World Economic Forum in Davos, Switzerland , a number of pioneers will join CNBC at the forum, including hedge fund billionaire and chairman of Bridgewater Associates Ray Dalio at 8 a.m. ET.\nIN THE NEWS TODAY An earthquake of magnitude 8.2 hit southeast of Chiniak, Alaska this morning , the U.S. Geological Survey said, prompting a tsunami warning for parts of Alaska and Canada. The U.S. west coast is also on tsunami watch. (Reuters)\nHundreds of thousands of federal employees are expected to return to work this morning after President Donald Trump signed into law a bill that ends the government shutdown. It funds the government for 17 days, and it funds the popular children's insurance program. (CNBC)\n* Here's how your senators voted on the measure to reopen the government (CNBC)\n* The shutdown is over. So what happens now? (USA Today)\nPresident Trump approved tariffs on imports of solar panels and washing machines , a move some suggest is bad for the U.S. economy. Billionaire Mike Bloomberg said the move will \"destroy U.S. jobs\" and \"raise Americans' electric bills.\" (CNBC)\nA copy of the yet-to-be-released White House's U.S. infrastructure plan leaked Monday , Axios reports. The leaked document is six pages long and contains no specific dollar amounts for any of the initiatives introduced.\nFBI Director Christopher Wray reportedly threatened to resign amid pressure from Attorney General Jeff Sessions to fire deputy director Andrew McCabe. Trump has repeatedly targeted McCabe, suggesting partisan bias in favor of Hillary Clinton. (Axios)\nPop music craftsman Neil Diamond announced he is retiring from concert touring because of Parkinson's disease. Diamond began his career as a writer in the 1960s, writing some of The Monkees' biggest hits, including \"I'm a Believer.\" (NBC News)\nSTOCKS TO WATCH Adobe Systems (ADBE) raised its profit forecast for the current quarter and the full year, thanks to what it calls a substantial decline in its tax rate. The software company also announced the pending retirement of Chief Financial Officer Mark Garrett, who will stay until a replacement is found.\nTD Ameritrade (AMTD) reported quarterly profit of 52 cents per share, beating estimates by two cents, while the discount brokerage firm's revenue was slightly above Street forecasts. The company also lifted its outlook for the full year based on gains stemming from the new tax law.\nClorox (CLX) Chief Financial Officer Steve Robb will retire on March 31. He'll be replaced by Kevin Jacobsen, who is currently vice president for financial planning and analysis at the consumer products company, and has been with Clorox since 1995.\n21st Century Fox (FOXA) is running into a snag in its attempt to buy the 61 percent of British broadcaster Sky that it does not already own. British competition officials say the $15 billion deal is not in the public interest and would be blocked without a variety of remedies.\nWATERCOOLER After finishing up filming of the final season of \"Game of Thrones,\" star Maisie Williams revealed she will be a bridesmaid for her co-star and best friend Sophie Turner. The stars appear as sisters Arya and Sansa Stark in the HBO fantasy drama. (Daily Mail)", "external_links": ["http://www.dailymail.co.uk/tvshowbiz/article-5300581/Maisie-Williams-bridesmaid-Sophie-Turner-wedding.html", "https://www.nbcnews.com/pop-culture/music/neil-diamond-retires-touring-after-parkinson-s-diagnosis-n840086", "https://www.usatoday.com/story/news/politics/2018/01/22/congress-solved-shutdown-but-deep-spending-and-immigration-disputes-remain-what-now/1055330001/", "https://www.usatoday.com/story/news/world/2018/01/22/trump-us-news-world-report-best-countries-united-states-survey/1055835001/", "https://www.reuters.com/article/us-davos-meeting/europe-readies-riposte-to-trumps-america-first-push-in-davos-idUSKBN1FA098?il=0"], "published": "2018-01-23T14:37:00.000+02:00", "crawled": "2018-01-23T14:09:55.000+02:00", "highlightTitle": ""}