{"organizations": [], "uuid": "4bb85ad529613c324efb3c47365c21d82ce6fa98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-grand-canyon-university-submits-application-to-return-to-non-profit-status.html", "country": "US", "domain_rank": 767, "title": "Grand Canyon University Submits Application To Return To Non-Profit Status", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:00:00.000+02:00", "replies_count": 0, "uuid": "4bb85ad529613c324efb3c47365c21d82ce6fa98"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-grand-canyon-university-submits-application-to-return-to-non-profit-status.html", "ord_in_thread": 0, "title": "Grand Canyon University Submits Application To Return To Non-Profit Status", "locations": [], "entities": {"persons": [{"name": "brian mueller", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "grand canyon university", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "board of trustees of gcu", "sentiment": "none"}, {"name": "higher learning commission", "sentiment": "none"}, {"name": "gce", "sentiment": "none"}, {"name": "grand canyon education, inc.", "sentiment": "none"}, {"name": "hlc", "sentiment": "none"}, {"name": "hlc board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHOENIX, Jan. 5, 2018 /PRNewswire/ -- Grand Canyon University, a comprehensive regionally accredited university owned and operated by Grand Canyon Education, Inc. (GCE), has submitted an updated application to the Higher Learning Commission to re-establish the institution as a non-profit university upon its purchase of certain academic-related assets from GCE. Following the sale, GCE would operate as a for-profit third-party provider of educational and related services to GCU and potentially, in the future, to other universities. GCE filed an 8-K with the Securities and Exchange Commission to this effect today and is meeting with all employees to discuss the proposed transaction. The HLC could act on this application as soon as the next HLC Board meeting in February.\nBrian Mueller, president and CEO of GCU, issued the following statement regarding that decision:\n\"The Board of Directors of GCE, together with the Board of Trustees of GCU, are again considering the possibility of returning the university to its historical non-profit status, which it held from 1949-2004. We believe this development would be in the best long-term interests of our students, faculty and staff, the community and our investors, in that it would:\nProvide faculty and students equitable opportunities to participate in academic and co-curricular opportunities with our peer institutions without being segregated based on tax status. Open up the world of non-profit philanthropic giving, grant writing and research opportunities. Better enable the University to continue to hold the line on tuition – which has been frozen on the ground campus for 10 years – and keep higher education affordable for all socioeconomic classes of Americans. Allow the university to continue to invest in infrastructure and maximize opportunities for faculty/staff growth. Maximize opportunities for continued investments in the community. Provide the opportunity for the University to become a full voting member of the NCAA. Allow GCE to continue as a publicly traded educational services company that has the potential to provide services to other institutions in addition to GCU.\n\"In short, this return to our historical non-profit status would convey an accurate reflection of who GCU is today and will be in the future, and brings the University full circle as it continues its transition into one of the driving forces in higher education today.\n\"GCU was a small non-profit private university for 55 years, but in 2004 found itself $20 million in debt and about to close its doors. Without a large donor base to turn to or the ability to rely on tax dollars, the University remained afloat by becoming a for-profit institution, securing investor funding and adding an online component to its academic offerings. In 2008, in order to develop a state-of-the-art online learning system, grow out the ground campus and ensure long-term stability, GCU went to the public markets for an infusion of capital to invest into the university. As a result of those investments, GCU today has a strong hybrid campus model that has enabled it to grow enrollment on the ground campus from less than 1,000 in 2004 to approximately 19,000 today, and create an online campus that now has more than 70,000 students, with more than half of those studying at the graduate level.\n\"That growth has also had a huge impact on our community. A 2015 study performed by Elliott Pollack & Company found that, from 2010-2019, GCU will:\nGenerate an estimated $450 million in city, county and state tax revenue, in addition to an estimated $650 million in federal income taxes. Generate an average of 10,490 jobs on an annual basis, with wages totaling $487.7 million. Provide an economic impact of $11.1 billion to the Phoenix area.\n\"GCU has further distinguished its innovative approach to higher education in that it has never paid a dividend to its shareholders since becoming a publicly traded institution in 2008. Those shareholders have received a return on their investment via increases in the value of the stock price that are a result of the University's continued success. Further, GCU has invested more into its campus infrastructure and technology -- $1 billion over a 10-year period – than it has made in after-tax profits during that time. No other university has used a publicly traded for-profit business model to develop a hybrid university with both ground and online campuses. In addition to investing in its outstanding academic programs, the University has developed all of the trappings of a traditional university, including music, dance, theater, debate, intramural and club sports, and a Division I athletic program.\n\"Today, GCU has a very strong financial model and there is no need to go back to the public markets for further capital. The current proposal to the HLC provides the best of both worlds by re-establishing a non-profit regionally accredited university that can continue to grow and meet the demand of families interested in affordable, private Christian education, while allowing GCE to continue as a tax-paying, multi-billion dollar market cap, publicly traded company in the fast-growing educational service market industry, with its headquarters in Phoenix.\nDetails of the HLC proposal\n\"These FAQs ( https://news.gcu.edu/2018/01/faqs-proposal-re-establish-gcu-non-profit-institution/ ) go into greater detail about the structure of the proposed transactions and its implications. It is important to note that the proposal is NOT being done to escape current regulations that are imposed only on the for-profit sector. For example, because GCU maintains affordable tuition, none of its programs failed the gainful employment regulations. GCU's loan default rate will be an estimated 6.5% for the most recent cohort – well below federal guidelines. For the 90/10 rule, GCU sits at 72.3% (and dropping). The University supports measures that ensure educational institutions are meeting recognized standards -- particularly as it relates to student support services, academic integrity and financial transparency – and believes those measures should apply to all institutions (for-profit and non-profit).\n\"GCU also has an exemplary record of regulatory compliance, including visits from six major accrediting bodies within the past two years. GCU met those comprehensive reviews with 100 percent compliance, including a visit from HLC in which the University's accreditation was reaffirmed for an additional 10 years, which is the maximum extension of accreditation the HLC offers. In addition to the HLC accreditation, GCU recently received the maximum 10-year accreditation from the Commission on Collegiate Nursing Education; completed the four-year transition to NCAA Division I athletics; completed a Veterans Administration audit with no findings; received a 10-year reaccreditation from the Accreditation Council for Business Schools and Programs; and has been granted associate membership of the Association of Theological Schools as it completes the process for full accreditation.\nWhy now?\n\"GCU initially explored reverting to its nonprofit status in 2015-16. That application was denied by the HLC, in part, based on its view that it did not have the necessary guidelines in place to evaluate the type of shared services agreement that GCU proposed. In May 2017, GCU became aware that the HLC was considering adopting new", "external_links": ["https://news.gcu.edu/2018/01/faqs-proposal-re-establish-gcu-non-profit-institution/", "http://www.prnewswire.com/news-releases/grand-canyon-university-submits-application-to-return-to-non-profit-status-300578228.html"], "published": "2018-01-05T19:00:00.000+02:00", "crawled": "2018-01-05T20:22:41.019+02:00", "highlightTitle": ""}