{"organizations": [], "uuid": "e91b800b5e5b04ab750c90fc90851366596baa84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226663995&w=1200&r=LYNXMPEE0T1AA", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-women-s-forum/nfl-forum-offers-women-opportunity-for-career-in-football-idUSKBN1FJ2GF", "country": "US", "domain_rank": 408, "title": "NFL: Forum offers women opportunity for career in football", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:22:00.000+02:00", "replies_count": 0, "uuid": "e91b800b5e5b04ab750c90fc90851366596baa84"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-women-s-forum/nfl-forum-offers-women-opportunity-for-career-in-football-idUSKBN1FJ2GF", "ord_in_thread": 0, "title": "NFL: Forum offers women opportunity for career in football", "locations": [], "entities": {"persons": [{"name": "larry fine", "sentiment": "none"}, {"name": "rapoport", "sentiment": "none"}, {"name": "connecticu", "sentiment": "none"}, {"name": "schecter", "sentiment": "none"}, {"name": "phoebe schecter", "sentiment": "none"}, {"name": "sam rapoport", "sentiment": "none"}], "locations": [{"name": "rhode island", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "buffalo bills", "sentiment": "none"}, {"name": "nfl uk", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bryant university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Florida (Reuters) - Phoebe Schecter struck gold at the Women’s Careers in Football Forum last year as one of 22 women who found jobs or internships in tackle football, which is often viewed as a notoriously macho world of tackle football.\nNow, she returns to Florida for the second edition of the two-day event, set up by former Canadian women’s quarterback Sam Rapoport, with visions of a fairytale career finish with an NFL franchise in England.\nThe forum was created by Rapoport to level the playing field and open doors for qualified women to enter the workforce of the most popular U.S. professional sport.\nSchecter, who coaches men’s and women’s tackle football in Britain, works with youth programs and captains the national team, emerged from last year’s inaugural forum with a training camp coaching internship with the Buffalo Bills that led to a season coaching at Bryant University in Rhode Island.\nNow working to grow the game for NFL UK, Connecticut native Schecter wants to continue to advance in coaching and dreams of an NFL franchise in London with British players and a home-grown female coach working on the sidelines.\n“That would be incredible. Shall we just slide in the resume now? We can all dream,” Schecter told Reuters at the NFL-sponsored forum on Friday, just days ahead of the Super Bowl.\n“A lot going on in American football over there, especially the huge deal with Tottenham (Hotspur) having the three (NFL) games consecutively there. The sport is about to explode.”\nRapoport, now NFL director of football development, has spent much of her career dedicated to getting more women involved in the game.\n“We wanted to create a bridge between females who have a strong passion for football but don’t have the same connections to football that men have,” Rapoport told Reuters.\n“Have them interact with executives that strongly believe in the power of diversity and who believe that if you can help me win, I don’t care what you look like or who you are.”\nENCOURAGING DREAMS For a league challenged by falling TV ratings, concerns over players’ health, safety and behavior, and backlash over those kneeling during the U.S. national anthem, encouraging women to pursue their football dreams sounds a positive note.\nThis year’s event included high profile speakers such as NFL Human Resources chief Tara Wood, NFL senior vice president of football operations Dave Gardi, Carolina Panthers head coach Ron Rivera, Atlanta Falcons assistant general manager Scott Pioli and Minnesota Vikings chief operating officer Kevin Warren.\nCanadian Football League commissioner Randy Ambrosie and Toronto Argonauts director of football operations Catherine Raiche also participated, along with Stanford University head coach David Shaw and Bryant University’s James Perry.\nNine candidates had international connections including two from Britain, four Canadians and one each from Germany, Panama and Australia.\nAny worries over entering an inhospitable macho world were dispelled by the natural meritocracy of the gridiron, the women said.\n“I was expecting it to be overwhelming but it wasn‘t,” Ohio’s Stephanie Balochko, a defensive coordinator and player for the U.S. women’s national team, told Reuters about her coaching internship with the Pittsburgh Steelers.\n”I worked with the defensive line and eventually I ran some film sessions... football is football. If you know football you should be fine.\n“All the players have been wonderful. I didn’t run into any attitudes.”\nMISCONCEPTION Rapoport disputed the notion that the NFL is a bastion of male chauvinists.\n“There is a misconception about the attitudes of people on our clubs,” she said. “Executives believe in the best person for the job. Forty-five percent of our fan base are female. Women love the sport in this country. Why in the world would they not work in it?”\nWhile numerous women have thrived in business positions with clubs, women have been under-represented on the sidelines, Rapoport said.\n“There are so many women in this country who know football. We’re opening the door a little wider.”\nOther professional sports leagues have taken notice of the forum program.\n“We’ve had many conversations with Major League Baseball, the Canadian Football League and off-the-cuff conversations with all the major sports leagues,” Rapoport said.\n“We’re working very closely with MLB to combine efforts to start to change the culture in sports in America.”\nBy this time next year, there may be many more Phoebe Schecters chasing their dreams in American sport.\nEditing by Christian Radnedge\n ", "external_links": [], "published": "2018-01-30T19:22:00.000+02:00", "crawled": "2018-01-30T19:55:16.062+02:00", "highlightTitle": ""}