{"organizations": [], "uuid": "9cb9c0ed485fe758061d14aaa66afb4aa82096c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-the-escape-pod-promotes-celia-jones-to-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "The Escape Pod Promotes Celia Jones to Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:26:00.000+02:00", "replies_count": 0, "uuid": "9cb9c0ed485fe758061d14aaa66afb4aa82096c9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-the-escape-pod-promotes-celia-jones-to-chief-executive-officer.html", "ord_in_thread": 0, "title": "The Escape Pod Promotes Celia Jones to Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "celia jones", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "norm bilow", "sentiment": "none"}, {"name": "lia jones", "sentiment": "none"}, {"name": "celia", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "ora interactive", "sentiment": "none"}, {"name": "escape pod group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Independent agency The Escape Pod announced today that it has promoted Celia Jones to Chief Executive Officer. In this role, Jones will be charged with stewarding The Escape Pod’s next phase of growth, elevating its integrated capabilities, identifying new revenue streams, and attracting top talent to build on the agency’s unique culture of creativity and independence. Jones will report to Norm Bilow, Co-founder and Managing Director of The Escape Pod Group, which also encompasses digital agency ORA Interactive, experiential agency OutCold, Gravity Well editorial and creative staffing service GoShortlist.com .\n“As soon as Celia joined The Escape Pod, she made an immediate impact on our brand and business. Her insights and diverse expertise, blending corporate strategy, branding, and two decades of experience at both traditional and digital agencies, helped us crystallize our story. Over the last decade, we have evolved from an idea-driven boutique to a full-service agency with a full suite of capabilities—all within a nimble operating model. While so many companies today are struggling and looking to the future with trepidation, our agency and clients are growing. We occupy a very advantageous position in the marketplace as a strategic partner to fast-growing challenger brands, and no one is better at telling our story, articulating why we’re different, and setting the vision for our future than Celia,” said Norm Bilow, Co-founder and Managing Director of The Escape Pod Group.\nIn the past year under Jones’ leadership, The Escape Pod earned recognition as Ad Age’s Midwest Small Agency of the Year and Chicago Inno’s 50 on Fire, recognizing the city’s most innovative companies. The agency has achieved significant year-over-year growth and several new business wins during her tenure. She has also been instrumental in deepening The Escape Pod’s digital and social offering, and driving end-to-end integration across its advertising, experiential and digital capabilities.\n“Both clients and employees are hungry for an alternative. What we stand for as an agency is an escape—from ineffective advertising that fails to stand out, and from the waste, layers and politics of the bigger shops. Our leadership team brings gravitas, with proven success at the world’s largest agencies. Our young talent is full of ideas and hungry to make their mark. Our digital and experiential partners are experts at what they do, but also incredibly collaborative, which makes our work that much better. Most importantly, we are all united in the belief that we can create innovative, inspiring work for clients, which is why we all got into this business in the first place. I’m excited to shape the future of The Escape Pod—there is no place I’d rather be,” said Celia Jones, Chief Executive Officer, The Escape Pod.\nPrior to The Escape Pod, Celia held leadership positions at several Chicago agencies. As Group Brand Director at Havas Chicago, she positioned the agency as a creative force and culture catalyst. Before that, she served as Global Marketing Director at Critical Mass, helping transform the company from a niche digital player into a leading global experience design agency with a relentless focus on the customer. She also served as Director of Content and Lead Copywriter at Designkitchen. She holds a Bachelor of Arts in English from the University of Notre Dame and a Juris Doctor from Loyola University School of Law.\n“Celia is dynamic, talented, and the ideal person to spearhead our future growth by helping us win new clients, expand our capabilities and attract the best talent in the industry,” Bilow added.\nAbout The Escape Pod\nNamed Ad Age’s 2017 Small Agency of the Year for the Midwest, The Escape Pod is an independent, Chicago-based creative powerhouse known for category-changing work that drives results for clients such as Southeastern Grocers (Winn-Dixie, BI-LO & Harveys), SKIL, SKILSAW, a2 Milk Company, and EGO Power+. In 2017, The Escape Pod formed The Escape Pod Group in partnership with digital production studio, ORA Interactive , and experiential agency, OutCold . The Escape Pod Group is a collective of specialty advertising agencies, purpose-built to deliver breakthrough ideas with speed, agility and cost-savings for clients. We combine creative firepower with full-service capabilities across creative, digital, social and experiential marketing. Our mission: to bring our clients’ brand propositions to life in the most dramatic manner possible. Learn more at www.theescapepodgroup.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005630/en/\nNorm Bilow\nManaging Director\nThe Escape Pod Group\nnormbilow@theescapepodagency.com\nSource: The Escape Pod", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fgoshortlist.com%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=GoShortlist.com&index=2&md5=deb21974e8b1353d610013c3b6069c24", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fadage.com%2Farticle%2Fspecial-report-small-agency-conference-and-awards%2Fmidwest-gold-escape-pod%2F309874%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=Ad+Age%27s+2017+Small+Agency+of+the+Year&index=3&md5=28ecd6a77f7321d3c743085576f1dd6d", "http://www.businesswire.com/news/home/20180119005630/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.outcold.com%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=OutCold&index=6&md5=4e829c81ac6bea4f50d345060010c35d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.theescapepod.com&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=The+Escape+Pod&index=1&md5=035e1b0d26c1da9768b9c67e752d882f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftheescapepod.com%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=The+Escape+Pod&index=4&md5=ab92048789036f6912427d92c1501541", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Forainteractive.com%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=ORA+Interactive&index=5&md5=67e43c78fac75ce35149b8c77616b666", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.theescapepodgroup.com%2F&esheet=51746135&newsitemid=20180119005630&lan=en-US&anchor=www.theescapepodgroup.com&index=7&md5=f250773b9539f308301b6e8656a0b009"], "published": "2018-01-19T21:26:00.000+02:00", "crawled": "2018-01-19T22:38:18.040+02:00", "highlightTitle": ""}