{"organizations": [], "uuid": "02cdbb3fb9acf353ea52cb1e0036bc7f77211282", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-alder-biopharmaceuticals-inc-announces-pricing-of-250-million-of-2-point-50-percent-convertible-senior-notes-due-2025.html", "country": "US", "domain_rank": 767, "title": "Alder BioPharmaceuticals, Inc. Announces Pricing of $250 Million of 2.50% Convertible Senior Notes Due 2025", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:25:00.000+02:00", "replies_count": 0, "uuid": "02cdbb3fb9acf353ea52cb1e0036bc7f77211282"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-alder-biopharmaceuticals-inc-announces-pricing-of-250-million-of-2-point-50-percent-convertible-senior-notes-due-2025.html", "ord_in_thread": 0, "title": "Alder BioPharmaceuticals, Inc. Announces Pricing of $250 Million of 2.50% Convertible Senior Notes Due 2025", "locations": [], "entities": {"persons": [], "locations": [{"name": "wash.", "sentiment": "none"}, {"name": "bothell", "sentiment": "none"}], "organizations": [{"name": "alder biopharmaceuticals", "sentiment": "negative"}, {"name": "alder biopharmaceuticals, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOTHELL, Wash., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Alder BioPharmaceuticals, Inc. (NASDAQ:ALDR), a biopharmaceutical company focused on developing novel therapeutic antibodies for the treatment of migraine, announced today an underwritten offering of $250 million aggregate principal amount of 2.50% convertible senior notes due 2025 (the “Notes”). The size of the offering was increased from the previously announced $200 million offering size. Alder has also granted the underwriters a 30-day option to purchase up to an additional $37.5 million aggregate principal amount of Notes, solely to cover over-allotments. The sale of the Notes is expected to close on February 1, 2018, subject to the satisfaction of customary closing conditions.\nThe Notes will be unsecured senior obligations of Alder and interest on the Notes of 2.50% per year will be payable semiannually in arrears on February 1 and August 1 of each year, commencing on August 1, 2018. The Notes will mature on February 1, 2025, unless earlier repurchased, redeemed or converted in accordance with their terms. The Notes will be convertible into cash, shares of Alder's common stock (the “common stock”) or a combination of cash and shares, at Alder's election. The initial conversion rate for the Notes will be 49.3827 shares of common stock per $1,000 principal amount of Notes (equivalent to an initial conversion price of approximately $20.25 per share of common stock, which represents an approximately 35% premium over today’s closing stock price of $15.00). Prior to the close of business on the business day immediately preceding November 1, 2024, the Notes will be convertible at the option of holders only upon the satisfaction of certain conditions. Thereafter, holders of the Notes may convert their Notes at their option at any time prior to the close of business on the business day immediately preceding maturity on February 1, 2025.\nAlder intends to use net proceeds from the offering to fund the development and commercialization of eptinezumab, and in particular, activities in support of achieving approval by the U.S. Food and Drug Administration for, and executing the commercial launch of, the infusion formulation of eptinezumab.\nGoldman Sachs & Co. LLC, Leerink Partners LLC and Wells Fargo Securities, LLC are acting as book-running managers for the offering.\nA shelf registration statement relating to the offering was filed with the Securities and Exchange Commission (the “SEC”), and was effective on filing on February 23, 2017. A preliminary prospectus supplement and the accompanying prospectus related to the offering have been filed with the SEC and are available on the SEC's website, located at www.sec.gov . Copies of the final prospectus supplement and the accompanying prospectus relating to this offering, when available, may be obtained from Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, by telephone toll-free at 1-866-471-2526 or by email at prospectus-ny@ny.email.gs.com ; from Leerink Partners LLC, Attention: Syndicate Department, One Federal Street, 37th Floor, Boston, MA 02110, by telephone at (800) 808-7525, ext. 6132 or by email at syndicate@leerink.com ; or from Wells Fargo Securities, LLC, Attention: Equity Syndicate, 375 Park Avenue, New York, New York 10152, by telephone toll-free at 800-326-5897 or by email at cmclientsupport@wellsfargo.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy these securities nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nForward-Looking Statements\nCertain of the statements made in this press release are forward looking, such as those, among others, relating to Alder's expectations regarding the closing of the public offering, its anticipated use of net proceeds from the offering, and the continued development and commercialization of eptinezumab. Actual results or developments may differ materially from those projected or implied in these forward-looking statements. More information about the risks and uncertainties faced by Alder is contained in the section captioned \"Risk Factors\" in the preliminary prospectus supplement related to the public offering filed with the SEC and other filings with the SEC from time to time. Alder disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nMedia Contact:\nAshley Cadle\nTogoRun\n310-463-0143\na.cadle@togorun.com Investor Relations Contact:\nMichael Schaffzin\nStern Investor Relations, Inc.\n212-362-1200\nmichael@sternir.com\nSource:Alder BioPharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/93b03fec-8beb-4c24-8955-41e98ae915de"], "published": "2018-01-30T06:25:00.000+02:00", "crawled": "2018-01-30T08:22:10.022+02:00", "highlightTitle": ""}