{"organizations": [], "uuid": "b3f021882920ac15696148c8cfa3585a71179f58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sandstorm-gold-announces-record-production-completes-sale-of-us18-million-of-equinox-securities-and-provides-asset-updates.html", "country": "US", "domain_rank": 767, "title": "Sandstorm Gold Announces Record Production, Completes Sale of US$18 Million of Equinox Securities and Provides Asset Updates", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-04T00:39:00.000+02:00", "replies_count": 0, "uuid": "b3f021882920ac15696148c8cfa3585a71179f58"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sandstorm-gold-announces-record-production-completes-sale-of-us18-million-of-equinox-securities-and-provides-asset-updates.html", "ord_in_thread": 0, "title": "Sandstorm Gold Announces Record Production, Completes Sale of US$18 Million of Equinox Securities and Provides Asset Updates", "locations": [], "entities": {"persons": [{"name": "ross beaty", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "equinox securities", "sentiment": "neutral"}, {"name": "sandstorm gold ltd.", "sentiment": "neutral"}, {"name": "equinox gold completed sandstorm", "sentiment": "none"}, {"name": "equinox", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "sandstorm sells securities of equinox", "sentiment": "none"}, {"name": "business combination", "sentiment": "none"}, {"name": "equinox gold corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 3, 2018 /PRNewswire/ - Sandstorm Gold Ltd. (\"Sandstorm\" or the \"Company\") (NYSEAMERICAN: SAND, TSX: SSL) is pleased to announce record gold equivalent production in 2017, the sale of US$18 million of securities of Equinox Gold Corp. (\"Equinox\"), as well as recent updates from the Company's royalty properties.\n— Sandstorm Sells Record Number of Gold Equivalent Ounces in 2017\nDuring the 2017 year, Sandstorm sold approximately 54,600 attributable gold equivalent ounces 1 (FY 2016 – 49,731 ounces), the highest yearly total in Company history. The attributable gold equivalent ounces were generated from 20 streams and royalties, with approximately 80% of the ounces coming from operations run by major and mid-tier mining companies.\n— Sandstorm Sells Securities of Equinox for Proceeds of US$18 Million; Business Combination to form Equinox Gold Completed\nSandstorm has completed the sale of US$15 million worth of Equinox convertible debentures and US$3.2 million of Equinox common shares to Ross Beaty. The sale was previously announced on October 25, 2017 and was subject to the closing of the business combination between Trek Mining, NewCastle Gold Ltd. and Anfield Gold Corp., which was completed on December 22, 2017. The new entity, Equinox, has approximately C$98 million in cash and marketable securities and a US$85 million credit facility. With the available capital, the Aurizona project in Brazil is fully funded to production.\nThe final key permit for restarting construction and mining at Aurizona was received in November, allowing Equinox to complete construction activities and expand the mill throughput to 8,000 tonnes per day. Early works construction is underway and Equinox is on track to pour gold at Aurizona in late 2018. The operation is expected to produce an average of 136,000 ounces of gold per year.\nFor more information, visit the Equinox website at www.equinoxgold.com and see the press releases dated November 16, 2017 and December 22, 2017.\nSandstorm has a 3% - 5% sliding scale net smelter returns (\"NSR\") royalty on the Aurizona project. At gold prices less than or equal to US$1,500 per ounce, the royalty is a 3% NSR. In addition, Sandstorm holds a 2% NSR royalty on the Aurizona Greenfields property, a 190,073 hectare package of exploration ground adjacent to the Aurizona project. An exploration agreement with AngloGold Ashanti Limited (\"AngloGold\") was announced in 2016, whereby AngloGold may invest US$14 million in exploration to earn a 70% interest in Aurizona Greenfields.\n— Development Continues at Hot Maden\nLidya Madencilik San. ve Tic. A.Ŕ. (\"Lidya Madencilik\") is continuing to advance the Hot Maden project located in northeast Turkey. Recent work has included mine design, metallurgical test work, geotechnical analysis, environmental studies and exploration drilling. This work is culminating in a Pre-Feasibility study which is on track to be released in the first half of 2018.\nApproximately 25,000 metres of infill and exploration drilling has been completed at Hot Maden during 2017. Recent drill highlights include:\nHTD-157 : 28.0 metres of 47.5 g/t gold and 1.65% copper from 287.0 metres including, 7.0 metres of 97.6 g/t gold and 3.86% copper from 308.0 metres; HTD-159 : 3.5 metres of 32.3 g/t gold and 0.87% copper from 165.5 metres and 4.0 metres of 7.4 g/t gold and 1.74% copper from 210.0 metres.\nFor QA/QC information see the appendix of this news release. Sandstorm has a 30% profits interest and a 2% NSR royalty on the Hot Maden project.\n— Columbus Gold and Nordgold Announce Decision to Proceed with Construction on Montagne d'Or\nColumbus Gold Corp. (\"Columbus Gold\") and Nord Gold SE (\"Nordgold\") announced the decision to proceed with construction of the Montagne d'Or gold mine in French Guiana. Commencement of construction is subject to additional requirements including a public consultation and the receipt of required permits and authorizations. The Environmental and Social Impact Study is expected to be submitted during the first quarter of 2018 and the mine permit application is expected to be completed in the third quarter of 2018.\nFor more information, visit the Columbus Gold website at www.columbusgoldcorp.com and see the press release dated December 18, 2017.\nSandstorm has a 1.0% NSR royalty on the Montagne d'Or project.\n— Antofagasta Earning into Ball Creek Property\nEvrim Resources Corp. (\"Evrim\") announced that they have signed a definitive agreement with Antofagasta plc (\"Antofagasta\") to earn into the Ball Creek property in northwestern British Columbia. Under the terms of the agreement, Antofagasta can earn an initial 51% by spending US$6 million over a six year period. Antofagasta has committed to spending US$300,000 as a firm commitment, during the first year of the agreement. If Antofagasta chooses to earn their initial interest, they may elect to earn an additional 19% interest by spending either US$25 million or completing a Pre-Feasibility study.\nFor more information, visit the Evrim website at www.evrimresources.com and see the press release dated May 15, 2017.\nSandstorm holds a 2% NSR royalty on the Ball Creek property.\n— Sandstorm Completes Disposition of Cote d'Ivoire Assets and Files Early Warning Report\nAwalé Resources Limited (\"Awalé\") has completed the acquisition of several Cote d'Ivoire assets that were previously controlled by Mariana Resources Ltd., which was acquired by Sandstorm in July 2017. As consideration for the transaction, Sandstorm received a 2% NSR royalty over the Bondoukou, Abengourou and Odienné projects areas and will receive C$400,000 in cash or shares of Awalé on each anniversary of the acquisition until commercial production is achieved.\nThe land package Awalé holds is currently 1,589 km 2 , with application for an additional 2,393 km 2 . In 2018, the planned work at Bondoukou includes geochemistry followed up by 5,000 to 7,500 metres of RC drilling to test targets. A regional survey is expected to commence at Odienné and reconnaissance mapping and sampling is planned at Abengourou.\nPursuant to National Instrument 62-103 - The Early Warning System and Related Take Over Bid and Insider Reporting Issues, Sandstorm is announcing the acquisition of an aggregate of 3,137,200 common shares (\"Awalé Shares\") and 500,000 share purchase warrants (\"Awalé Warrants\") of Awalé. Sandstorm acquired 1,000,000 shares and 500,000 warrants pursuant to a private placement conducted by Awalé. The remaining 2,137,200 shares were acquired by Sandstorm upon the conversion of certain debt owed by Awalé to Sandstorm in connection with the Cote d'Ivoire transaction.\nWith the acquisition of Awalé Shares, Sandstorm now holds an approximately 10.9% of the outstanding common shares. If Sandstorm exercises the Awalé Warrants, it would then hold 12.4% of the then issued and outstanding Awalé shares (on a partially diluted basis).\nThe acquisition of the Awalé Shares by Sandstorm was effected for investment purposes. Sandstorm may from time to t", "external_links": ["http://www.gowestgold.com/", "http://www.azx.ca/", "http://www.evrimresources.com/s/home.asp", "http://www.metanor.ca/", "http://www.awaleresources.com/", "http://www.sandstormgold.com/", "http://www.equinoxgold.com/", "http://www.mcewenmining.com/home/default.aspx", "http://www.sedar.com/", "http://www.columbusgoldcorp.com/s/Home.asp"], "published": "2018-01-04T00:39:00.000+02:00", "crawled": "2018-01-04T00:24:37.008+02:00", "highlightTitle": ""}