{"organizations": [], "uuid": "b42c4a28a17bb839967d269bc198937ea8d64ff8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928694-RTX44IF0.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/hundreds-more-flights-canceled-in-winter-storms-wake.html", "country": "US", "domain_rank": 767, "title": "Hundreds more flights canceled in winter storm's wake", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.986, "site_type": "news", "published": "2018-01-05T03:22:00.000+02:00", "replies_count": 0, "uuid": "b42c4a28a17bb839967d269bc198937ea8d64ff8"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/04/hundreds-more-flights-canceled-in-winter-storms-wake.html", "ord_in_thread": 0, "title": "Hundreds more flights canceled in winter storm's wake", "locations": [], "entities": {"persons": [{"name": "brian snyder", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "laguardia", "sentiment": "none"}, {"name": "logan international airport", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "airlines", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The \" bomb cyclone \" has departed the U.S. but air travel is still a mess.\nAirlines canceled more than 1,100 flights scheduled for Friday due to the massive storm, according to FlightAware, a flight data site. New York airports ground to a halt in winter storm, which brought high winds and snow, snarling air travel from Maine to Florida.\nMore than 3,000 flights were grounded on Thursday because of the storm, stranding thousands of passengers, while low visibility and strong winds diverted dozens of other flights.\nJohn F. Kennedy International Airport said it had resumed operations at 7 a.m. Friday, and New York's LaGuardia lifted a suspension on flights late Thursday.\nBut air travel is far from back to normal. Travelers booked on Friday should check airline websites and apps for updates on schedules. While several airlines are scrambling to get operations back to normal, a bone-chilling cold followed the storm, so airlines must ensure their planes are de-iced before flying, a process that can cause delays. Also, poor road conditions could make it difficult for flight crews to reach airports.\nAll major U.S. airlines, including United , American , Delta , JetBlue and Spirit , waived date-change fees for passengers booked Thursday and Friday and said they could re-book flights for as late as late as Jan. 12. Passengers won't have to pay a change fee if they travel later than that, but a difference in fare could apply.\nAmerican said it expected to have resumed operations at the three major New York City-area airports and in Boston by 10 a.m.\nIt was unclear how much the storm will cost airlines. Last year, a string of strong hurricanes that hit airlines' hubs cost those companies hundreds of millions of dollars in lost revenue, but clearing runways from a snowstorm is a much faster process than recovering from the floods, power outages, structural damage to airports and other infrastructure damage that 2017's storms caused.", "external_links": [], "published": "2018-01-05T03:22:00.000+02:00", "crawled": "2018-01-05T03:22:12.030+02:00", "highlightTitle": ""}