{"organizations": [], "uuid": "b76661764acc92a24d6b8c70f47729f4d4d12a40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-regeneron-pharms-genetics/regeneron-forms-consortium-to-accelerate-gene-sequencing-project-idUKKBN1EX118", "country": "US", "domain_rank": 408, "title": "Regeneron forms consortium to accelerate gene sequencing project", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:03:00.000+02:00", "replies_count": 0, "uuid": "b76661764acc92a24d6b8c70f47729f4d4d12a40"}, "author": "", "url": "https://uk.reuters.com/article/us-regeneron-pharms-genetics/regeneron-forms-consortium-to-accelerate-gene-sequencing-project-idUKKBN1EX118", "ord_in_thread": 0, "title": "Regeneron forms consortium to accelerate gene sequencing project", "locations": [], "entities": {"persons": [{"name": "george yancopoulos", "sentiment": "none"}, {"name": "bill berkrot", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "regeneron", "sentiment": "negative"}, {"name": "abbvie inc", "sentiment": "none"}, {"name": "astrazeneca plc", "sentiment": "none"}, {"name": "alnylam pharmaceuticals inc", "sentiment": "none"}, {"name": "pfizer inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "regeneron pharmaceuticals inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:04 PM / Updated 33 minutes ago Regeneron forms consortium to accelerate gene sequencing project Bill Berkrot 3 Min Read \n(Reuters) - Regeneron Pharmaceuticals Inc on Monday announced a collaboration with rival drugmakers that will speed its effort to collect genetic information on 500,000 people in the UK Biobank database, a project it believes could help accelerate new drug discovery and improve approval success rates. \nThe data will be made available to health researchers anywhere in the world following a 6-to-12-month period of exclusive access by consortium members, Regeneron said. \n“This is the first case where there will be large-scale human sequencing linked to large-scale human medical records that will also be publicly available,” Regeneron President and Chief Scientific Officer George Yancopoulos said in a telephone interview. \nPfizer Inc, AbbVie Inc, AstraZeneca Plc and Alnylam Pharmaceuticals Inc each agreed to put $10 million toward the effort, funding that will make it possible to complete exome sequencing of 500,000 participants by the end of 2019, rather than Regeneron’s original timeline of 2022. \nThe exome is the small percentage of the human genome containing all coding genes for proteins, which are used as targets for many medicines. \n“This is great example of the lifesciences industry stepping up and giving back something that is going to help society while also accelerating our own efforts to come up with new drug targets and new medicines,” Yancopoulos said. \n“Historically, (industry) failure rates have been too high and that’s one of the reasons healthcare costs are so high,” he said. “Genetically validated targets have a much higher success rate.” \nThe data linking human genetic variations to human biology and disease could also help the U.S. National Institutes of Health and academic researchers make their own discoveries, Yancopoulos said. \nIn addition to new funding, rapidly improving technology will hasten the project. “We have been more than doubling our sequencing capacity every year,” he said. \nThe UK Biobank is an exceptional partner for the effort, he said, because of the enormous amount of medical data it has compiled, including whole-body imaging and periodic MRI scans of the brain, chest and abdomen in addition to primary care information. \nYancopoulos acknowledged likely limits to genetic variations and diversity with all subjects coming from the UK and hopes this will spur similar large-scale efforts with other populations. \n“We are looking for other big projects to do. We think this a great model.” Reporting by Bill Berkrot in New York; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-08T14:03:00.000+02:00", "crawled": "2018-01-08T14:39:19.018+02:00", "highlightTitle": ""}