{"organizations": [], "uuid": "a60ddaf608543fa49a83b7f59363f4e0e24db253", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-530455510.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/compass-ceo-crash-sydney-seaplane-investigation-richard-cousins/", "country": "US", "domain_rank": 1196, "title": "Investigators to Raise Seaplane That Killed Compass Group CEO | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-02T04:15:00.000+02:00", "replies_count": 0, "uuid": "a60ddaf608543fa49a83b7f59363f4e0e24db253"}, "author": "Reuters", "url": "http://fortune.com/2018/01/02/compass-ceo-crash-sydney-seaplane-investigation-richard-cousins/", "ord_in_thread": 0, "title": "Investigators to Raise Seaplane That Killed Compass Group CEO | Fortune", "locations": [], "entities": {"persons": [{"name": "richard", "sentiment": "negative"}, {"name": "richard c", "sentiment": "negative"}, {"name": "nagy", "sentiment": "none"}, {"name": "nat nagy", "sentiment": "none"}, {"name": "simon dawson/bloomberg", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "cowan", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "fortune australia investigators plan", "sentiment": "negative"}, {"name": "compass group plc", "sentiment": "none"}, {"name": "getty images by reuters", "sentiment": "none"}, {"name": "australian transport safety bureau", "sentiment": "none"}, {"name": "bloomberg television", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Australia Investigators Plan to Raise the Seaplane That Killed Compass CEO Richard Cousins Richard Cousins, chief executive officer of Compass Group Plc, speaks during a Bloomberg Television interview in London, U.K., on Wednesday, May 11, 2016. Simon Dawson/Bloomberg via Getty Images By Reuters 2:15 AM EST \nAustralia’s transport safety investigation agency said on Tuesday it plans to raise a seaplane that crashed into a Sydney river on New Year’s Eve, killing six people, including the chief executive of British catering giant Compass Group Plc. \nAustralian Transport Safety Bureau Executive Director Nat Nagy said investigators would probe several lines of inquiry to piece together what happened, including a close look at the plane’s avionics and maintenance record and the pilot’s background and experience. \nIt was hoped the plane would be raised by the end of the week, Nagy said. A crane, airbags, or a combination of the two, would be used to raise the plane from the riverbed as gently as possible. \nThe plane is submerged in 13 metres of water near Cowan, about 40 km (25 miles) north of Sydney. \nNagy said investigators would also look for any other electronic devices, including iPads or iPhones, that may have been on board when the plane crashed on Sunday, killing Compass chief executive Richard Cousins, 58, and four members of his family. The pilot, Gareth Morgan, 44, was also killed. \nA preliminary report into the crash will be made public in about a month, although authorities have warned it may take up to a year to find out what happened. \n“If we do identify any critical safety issues throughout the course of the investigation, we will immediately notify the relevant authorities … to remedy any issues,” Nagy said. \n“This particular aircraft, I understand was manufactured in 1963, it’s not unusual to have aircraft of that sort of age flying around … we haven’t seen any systemic issues around this aircraft,” he added. \nAustralian police have identified those killed with Cousins as Emma Bowden, 48, Heather Bowden, 11, Edward Cousins, 23, and William Cousins, 25. \nFamily members and media reports identified four of the victims Cousins’ two sons, his fiancée and her daughter. \nCousins, who led Compass over the past 11 years, was due to step down in March after being widely credited with turning the company’s business around and making it into one of the Financial Times Stock Exchange’s best-performing firms. \nThe seaplane was part of the Sydney Seaplanes business that has operated since 2005 with no previous record of mishap. Seaplane flights have been cancelled until further notice. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T04:15:00.000+02:00", "crawled": "2018-01-02T09:38:10.018+02:00", "highlightTitle": ""}