{"organizations": [], "uuid": "a35cbee60959e1e7e7a03d21bd7ad452a734819c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226688311&w=1200&r=LYNXMPEE0T1E8", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-qatar-airlines/qatar-airways-agrees-to-financial-disclosures-in-row-with-u-s-carriers-idUSKBN1FJ2NT", "country": "US", "domain_rank": 408, "title": "Qatar Airways agrees to financial disclosures in row with U.S. carriers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:58:00.000+02:00", "replies_count": 0, "uuid": "a35cbee60959e1e7e7a03d21bd7ad452a734819c"}, "author": "", "url": "https://www.reuters.com/article/us-usa-qatar-airlines/qatar-airways-agrees-to-financial-disclosures-in-row-with-u-s-carriers-idUSKBN1FJ2NT", "ord_in_thread": 0, "title": "Qatar Airways agrees to financial disclosures in row with U.S. carriers", "locations": [], "entities": {"persons": [{"name": "tillerson", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "alana wise", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "qatar airways", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:59 PM / in 3 hours Qatar Airways agrees to financial disclosures in row with U.S. carriers Alana Wise 3 Min Read \n(Reuters) - State-owned Qatar Airways has agreed to release detailed financial statements, the U.S. government said on Tuesday, as part of a response to accusations by U.S. airlines that the carrier had been illegally subsidized by its government. \nU.S. Secretary of State Rex Tillerson said that Qatar and the United States had opened a “strategic dialogue” to address domestic airlines’ concerns that the three major Gulf carriers had been unfairly propped up by their governments, putting U.S. carriers at a competitive disadvantage. \n“The outcome we achieve will ensure a level playing field in the global aviation market,” Tillerson said at a briefing in Washington, alongside Qatari officials. \nQatar is expected to begin publishing its annual financial statements, audited by an outside party, with the first one due over the next year. Within two years, the U.S. State Department said Qatar is expected to also disclose significant new transactions with other state-owned enterprises. \nQatar Airways was not immediately available for comment. \nThe largest U.S. carriers - American Airlines Group Inc ( AAL.O ), Delta Air Lines Inc ( DAL.N ) and United Continental Holdings Inc ( UAL.N ) - hailed the move as a victory for the domestic industry, following years of lobbying the federal government to take a tougher stance against the three Gulf carriers for what they say have been illegal state subsidies. \nThe three Middle Eastern carriers - Qatar Airways, plus United Arab Emirates-based Etihad Airways and Emirates - have denied those accusations. \n“Today’s agreement by the State of Qatar is a strong first step in a process for commercial transparency and accountability, and we remain committed to working with the administration to address the harmful trade violations by the United Arab Emirates as well,” Delta Chief Executive Officer Ed Bastian said in a statement. \nThe U.S. carriers have been pushing the administration of President Donald Trump to take the significant step of challenging the three Gulf carriers’ conduct under its bilateral “Open Skies” agreements, but the administration has said its goal is to maintain the framework of the flight pacts. \nThe U.S. Airlines for Open Skies Coalition, which includes smaller airlines that campaign against protectionist policies in the industry and has sided with the Gulf carriers in the dispute, also claimed Tuesday’s announcement as a success. \n“We appreciate the administration’s strong support for maintaining the global framework of U.S. Open Skies Agreements, which will continue American aviation leadership and economic growth,” said the coalition, which includes FedEx ( FDX.N ) , Atlas Air AAWWAT.UL, JetBlue Airways ( JBLU.O ), and Hawaiian Airlines, in a statement. Reporting by Alana Wise in New York, Additional reporting by David Shepardson in Washington, Editing by Rosalba O'Brien", "external_links": [], "published": "2018-01-30T20:58:00.000+02:00", "crawled": "2018-01-30T21:28:14.004+02:00", "highlightTitle": ""}