{"organizations": [], "uuid": "46897f91be2cf2dc63d811d3d57ea8e2fcdb76af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-transcript-jpmorgan-chase-chairman-ceo-jamie-dimon-speaks-with-squawk-box-from-davos-today.html", "country": "US", "domain_rank": 767, "title": "CNBC TRANSCRIPT: JPMORGAN CHASE CHAIRMAN & CEO JAMIE DIMON SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:35:00.000+02:00", "replies_count": 0, "uuid": "46897f91be2cf2dc63d811d3d57ea8e2fcdb76af"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-transcript-jpmorgan-chase-chairman-ceo-jamie-dimon-speaks-with-squawk-box-from-davos-today.html", "ord_in_thread": 0, "title": "CNBC TRANSCRIPT: JPMORGAN CHASE CHAIRMAN & CEO JAMIE DIMON SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "locations": [], "entities": {"persons": [{"name": "jamie dimon", "sentiment": "negative"}, {"name": "joe kernen", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "andrew ross sorkin", "sentiment": "none"}, {"name": "sorkin", "sentiment": "none"}, {"name": "becky quick", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Wednesday, January 24, 2018\nWHERE: CNBC's \"Squawk Box\" – Live from the World Economic Forum in Davos, Switzerland\nFollowing is the unofficial transcript of a CNBC interview with JPMorgan Chase Chairman & CEO Jamie Dimon on CNBC's \"Squawk Box\" (M-F 6AM-9AM) live from the World Economic Forum in Davos, Switzerland today, Wednesday, January 24th. Following is a link to the full video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/24/jp-morgan-ceo-capital-investment-in-america-drives-wages.html?play=1 .\nAll references must be sourced to CNBC.\nANDREW ROSS SORKIN: JP MORGAN CITING THE NEW TAX REFORM LAW AND WHAT IT CALLS A MORE CONSTRUCTIVE REGULATORY ENVIRONMENT IN AN ANNOUNCEMENT THIS WEEK THAT IT PLANS TO RAISE EMPLOYEES WAGES AND OPEN SOME NEW BANK BRANCHES. JOINING US NOW FOR AN EXTENDED INTERVIEW, JP MORGAN'S CHAIRMAN AND CEO JAMIE DIMON. GOOD MORNING.\nJAMIE DIMON: HAPPY TO BE HERE. AND HOW ARE YOU – BECKY, JOE?\nBECKY QUICK: GREAT TO SEE YOU, JAMIE.\nJOE KERNEN: JAMIE.\nSORKIN: GOOD TO SEE YOU. HELP US UNDERSTAND THE THINKING THAT GOT YOU TO THE POINT OF MAKING THIS ANNOUNCEMENT THIS WEEK.\nDIMON: YEAH. SO WE WENT OUT TO OUR FOLKS AND SAID WE'RE GOING TO HAVE TAX REFORM, WHICH IS GOOD. OBVIOUSLY IT IMPROVES THE PROFITS AT J.PMORGAN. WHAT CAN WE DO TO DO TO ACCELERATE INVESTMENTS, TO DO MORE, TO HELP LOWER-MIDDLE INCOME HOUSEHOLDS, TO DO MORE PHILANTHROPICALLY? WE WANTED TO DO IT THOUGHTFULLY, BECAUSE, YOU KNOW, YOU CAN'T JUST AUTOMATICALLY DO THOSE THINGS. SO WE'RE ADDING SALESPEOPLE, OPENING MORE BRANCHES – IT WILL BE ABOUT 4 OR 5,000 JOBS. AND WE THINK IT'S GOOD FOR JPMORGAN AND WE THINK IT'S GOING TO BE VERY GOOD FOR THE ECONOMY.\nKERNEN: YOU'VE GOT JAMIE HERE.\nDIMON: YEP.\nKERNEN: ASK HIM IF HE'S DOING THIS IN A CYNICAL WAY TO CURRY FAVOR THE CURRENT ADMINISTRATION.\nSORKIN: -- WELL, NO – JOE –\nKERNEN: YOU FINALLY GOT SOMEONE YOU CAN ASK. THAT'S WHAT YOU'VE BEEN IMPLYING ABOUT ALL THIS.\nSORKIN: SO WHAT DO YOU THINK HAS DRIVEN -- IMMEDIATELY WITHIN THE DAY -- A DAY AFTER THE ANNOUNCEMENT WAS MADE, A NUMBER OF COMPANYS, INCLUDING, BY THE WAY, THE PARENT COMPANY OF THIS NETWORK, COMCAST, ANNOUNCED ONE-TIME BONUSES. BY THE WAY, WHAT YOUR'E DOING IS NOT A ONE-TIME BONUS FROM WHAT I UNDERSTAND,\nDIMON: NO, WE ALREADY DO ONE EVERY YEAR, $750 INTO PEOPLE MAKING $60,000 A YEAR INTO THEIR 401K. SO WE ALREADY DO STUFF LIKE THAT. AND WE ALSO REDUCED THE MEDICAL DEDUCTIBLE FOR PEOPLE MAKING UNDER $60,000 TO REDUCE THE BURDEN OF WHEN YOU HAVE LARGE MEDICAL EXPENSES.\nSORKIN: WHAT DO YOU MAKE OF THE DECISION, THE ECONOMIC DECISION THAT COMPANIES HAVE MADE OVER THE PAST MONTH?\nDIMON: SO THE WAY YOU SHOULD LOOK AT IT – FIRST OF ALL, THERE'S TWO THINGS. WE -- OUR TAX SYSTEM 20 YEARS AGO WAS THE SAME AS EVERYBODY ELSE. OVER 20 YEARS IT'S COME DOWN HERE. WE'VE ALL KNOWN THAT IS A HUGE COMPETITIVE DISADVANTAGE DRIVING CAPITAL, BRAINS, COMPANIES, HEADQUARTERS OVERSEAS. STUDIES HAVE SHOWN 5,000 COMPANIES NET ARE OWNED BY FOREIGN COMPANIES TODAY. I'M NOT AGAINST FOREIGN OWNERSHIP, I'M AGAINST UNCOMP UNCOMPETITIVE. SO ONCE YOU BECOME COMPETITIVE, ONE IMMEDIATE BENEFIT THAT PEOPLE ARE DOING TODAY – WHICH IS GOOD – I TOTALLY APPLAUD WHAT COMPANIES ARE DOING, IS TO SAY WE'RE GOING TO USE SOME OF THIS HELP OUR PEOPLE AND STUFF LIKE THAT. BUT THE REAL BENEFIT COMES OVER TIME. COMPETITIVE TAXES WILL HAVE MORE CAPITAL, MORE JOBS, MORE COMPANIES INVESTING HERE, MORE FOREIGN COMPANIES INVESTING HERE. THAT WILL RAISE JOBS, IT WILL RAISE WAGES AND INCREASE JOBS AND IT'S BETTER THAN IT WILL ALWAYS BE. I HATE THIS ARGUMENT, WE DIDN'T NEED STIMULUS. YOU SHOULD HAVE A COMPETITIVE TAX SYSTEM IN GOOD TIMES AND BAD TIMES. IT IS A – I CAN'T BELIEVE PEOPLE THINK THAT HAVING AN UNCOMPETITIVE TAX SYSTEM IS A GOOD THING FOR AMERICA. IT SHOCKS ME THAT PEOPLE EVEN ARGUE THAT POINT.\nSORKIN: BY THE WAY, SHOULD WE LOOK AT SOME OF THESE BONUSES AND THINGS AS A TEMPORARY STIMULUS?\nDIMON: YEAH. LIKE I SAID, I THINK PEOPLE WILL DO CERTAIN THINGS NOW TO SHOW THAT THEYRE GOING TO HAVE MORE TO GIVE TO HELP EMPLOYEES, BUT THE IMPORTANT THING –\nSORKIN: IS THAT A TIGHTER LABOR MARKET? OR IS THAT A FUNCTION OF WE THINK THAT EMPLOYEES ARE GOING TO SEE THAT OUR PROFITS ARE SO MUCH HIGHER –\nQUICK: THAT'S WHAT LARRY FINK THINKS HE THINKS PEOPLE WILL BE DOING THIS IN TERMS OF PAY RAISES.\nDIMON: I THINK PEOPLE WILL DO THIS AND THEN THEY'LL BE MORE AGGRESSIVE WHEN THEY INVEST OVERTIME. THEY MIGHT BE MORE AGGRESSIVE HOW THEY PAY PEOPLE OVER TIME. YOU'RE GONNA HAVE A MORE COMPETITIVE JOB MARKET. THAT'S A GOOD THING. WAGES ARE GOING TO GO UP. AND I PROMISE YOU WE'LL BE SITTING HERE IN A YEAR AND YOULL ALL BE WORRIED ABOUT INFLATION AND WAGES GOING UP TOO HIGH. THAT'S WHAT'S GOING TO HAPPEN—\nKERNEN: JAMIE, YOU ALREADY SAID BARELY A DEMOCRAT— THAT WAS LIKE FIVE YEARS AGO OR SO, MAYBE MORE AT THIS POINT. SO YOU SAW THE RHETORIC FROM NANCY PELOSI, CHUCK SCHUMER AND ACROSS THE BOARD THE WORD \"PATHETIC\" FOR THIS THING. IT'S A TAX SCAM. HUGE GIVE AWAY FOR THE RICH. ARE YOU STILL A DEMOCRAT WHEN YOU SEE THAT?\nDIMON: I'M NOT -- I'M NOT GETTING INTO POLITICS. WE NEED A COMPETITIVE TAX SYSTEM FOR THE SAKE OF AMERICA.\nKERNEN: SO WHEN YOU SAY IT WAS THE WAY IT WAS DEMAGOGUED, WHEN YOU SAW THE WAY THEY TALK ABOUT IT, IS THAT PRODUCTIVE?\nDIMON: IT SHOCKS ME THAT THEY DON'T UNDERSTAND THE IMPORTANCE OF THIS FOR THE SAKE OF AMERICA. I UNDERSTAND THE INDIVIDUAL SIDE. I MIGHT HAVE DONE THINGS DIFFERENTLY. YOU KNOW, WE WERE FOCUSING ON THE CORPORATE SIDE. THERE ARE THINGS I MIGHT HAVE DONE DIFFERENTLY ON THE INDIVIDUAL SIDE.\nKERNEN: WHAT WOULD YOU HAVE DONE DIFFERENTLY?\nDIMON: I'M NOT GOING TO GO THERE. BUT MY POINT IS, IF YOU WANT AMERICA TO BE VERY COMPETITIVE YOU NEED A COMPETITIVE TAX SYSTEM. IF YOU DON'T, IT WILL HURT BUSINESS IN AMERICA WHICH HURTS JOBS AND WAGES. AND THAT IS DEFINITELY TRUE OVER TIME. AND WHAT YOU DO ON THE INDIVIDUAL SIDE, YOU CAN HAVE A HUGE MORAL ARGUMENT ABOUT HOW YOU DO IT, WHY YOU GO ABOUT IT AND STUFF LIKE THAT. SO—\nKERNEN: DO YOU THINK THE PUBLIC OPINION ON THE TAX PLAN IS EVOLVING AND IS IT -- WHEN IT WAS ONLY 17% FOR, WAS THAT MISGUIDED? I MEAN, WHAT SHOULD THE PUBLIC -- SHOULD THE PUBLIC EMBRACE THIS?\nDIMON: YOU MAKE IT SOUND LIKE WE'RE GIVING MONEY TO RICH CORPORATIONS.\nKERNEN: WHO MADE IT SOUND LIKE THAT?\nDIMON: A LOT OF PEOPLE. AND YES, THEY'RE MOSTLY FROM THE OTHER PARTY. THE FACT IS, THAT IS SOMEWHAT TRUE, BUT MY ARGUMENT IS THAT CAPITAL INVESTMENT IN AMERICA DRIVING AMERICA DRIVES WAGES. REMEMBER, FOR EVERY BIG COMPANY WE'RE SUPPORTED BY 40,000 VENDORS. WHEN WE OPEN THOSE 400 BRANCHES, THERE COULD BE HUNDREDS OF JOBS SUPPORTING THOSE BRANCHES. THERE ARE GOING TO BE PEOPLE BUILDING THOSE BRANCHES, PEOPLE PUTTING INTERNET INTO THE BRANCHES, STUFF LIKE THAT. CAPITAL INVESTMENT AS PART OF A LARGE COMPANY USUALLY LEADS TO THREE OR FOUR TIMES MORE JOBS PER PERSON IN THE PLANT ITSELF. AND YOU KNOW, PEOPLE DON'T UNDERSTAND, THAT'S HOW THE ECONOMY WORKS.\nKERNEN: THEY'RE STILL GONNA SAY, \"HERE'S JAMIE DIMON, FAT CAT CEO, OF COURSE HE LIKES THE TAX BENEFIT.\" BUT YOU'VE MADE THE POINT TO TIE – OR TO COMPLETELY BIFURCATE WHAT'S GOOD FOR THE COMMON MAN AND WHAT'S GOOD FOR CORPORATIONS, COMPLETELY SAY THAT THEY'RE ANTITHETICAL IS NOT REALLY ACCURATE.\nDIMON: IT'S GOOD FOR BUSINESS.\nKERNEN: IF IT'S GOOD FOR BUSINESS.\nDIMON: AND IF I REMEMBER CORRECTLY, 150 MILLION PEOPLE WORK IN AMERICA, 125 MILLION WORK FOR PRIVATE ENTERPRISE. AT THE END OF THE DAY, THE 125 MILLION IS AN ECOSYSTEM LIKE THIS, BIG AND LARGE. WE SUPPORT LARGE COMPANIES AND SMALL COMPANIES. THEY SUPPORT EACH OTHER. IF THAT GROWS, EVERYTHING ELSE CAN TAKE CARE OF ITSELF. AND MATTER OF FACT, PEOPLE WOULD GENERALLY SAY IT'S PART OF NATIONAL SECURITY. HAVING A WEAK ECONOMY IS BAD FOR NATIONAL SECURITY IN THE LONG RUN. SEVERAL MILITARY PEOPLE TOLD ME THAT. LET'S MAKE SURE WE HAVE A STRONG ECONOMY. SO.\nSORKIN: PRESIDENT TRUMP'S GOING TO BE HERE ON FRIDAY. WHAT DO YOU WANT TO HEAR HIM SAY?\nDIMON: YOU KNOW, I SAW STEVE SCHWARTZMAN ON THE SHOW TALKING ABOUT THIS. THEY'RE DOING – ON THE POLICY SIDE THE'YRE DOING A LOT OF PRO GROWTH. I'M NOT GOING TO SAY RETRO-REFORM. HAVING REGULATIONS THAT MAKE SENSE, GOING TO CREATE PROPER CONTROL ON COMPANIES DOING BAD THINGS BUT ALSO, YOU KNOW, ENHANCE GROWTH AND STUFF LIKE THAT. WE'RE PRO IMMIGRATION SO I'D LIKE TO SEE HIM DESCRIBE PRO IMMIGRATION. HE'S PRO DACA. I'VE HEARD HIM SPEAK ABOUT IT MANY TIMES. AND YOU KNOW, THEY HAVE TO NEGOTIATE AN IMMIGRATION BILL. AND TRADE. YOU KNOW, I'M A BIG PERSON IN TRADE. I THINK IT'S A VERY GOOD THING. I THINK THERE ARE LEGITIMATE ISSUES BEING RAISED BY THE ADMINISTRATION IN TRADE. MUCH MORE IN CHINA THAN AROUND MEXICO.\nQUICK: INTELLECTUAL PROPERTY, YOU MEAN?\nDIMON: INTELLECTUAL PROPERTY, TARIFFS, NONTARIFF BARRIERS. WHEN AMERICANS SPEAK AND THEY TALK ABOUT FAIR THEY MEAN RECIPROCAL, THAT'S NOT WHAT THE CHINESE MEAN BY FAIR. AND YOU DON'T HAVE TO HAVE A RECIPROCAL SYSTEM TO BE COMPLIANT ON THE WTO. AND SO THERE ARE ISSUES THAT NEED TO BE RESOLVED, AND THEY NEED TO BE DONE STRATEGICALLY, REALLY LONG-TERM, THINK IT THROUGH, DO IT RIGHT. YOU CAN HEAR THAT. GARY COHEN WAS ON YOUR SHOW OR SOMETHING TALKING ABOUT AMERICA FIRST MEANS -- DOESN'T MEAN AMERICA ALONE.\nSORKIN: STEVE MNUCHIN THOUGH THIS MORNING TALKED ABOUT HOW A WEAK DOLLAR MAY BE A GOOD THING. DO YOU AGREE WITH THAT AND DO YOU LIKE THAT IDEA, THE TREASURY SECRETARY SAYING THAT PUBLICLY?\nDIMON: YOU KNOW, USUALLY TREASURY SECRETARIES DON'T COMMENT ON THE DOLLAR. AND USUALLY, A STRONG DOLLAR MEANS A STRONG ECONOMY. BUT WHAT YOU HAVE TODAY IS A STRONG U.S. ECONOMY. EVEN STRONGER THAN PEOPLE EXPECTED, JAPAN, EUROPE AND CHINA. AND VERY OFTEN THE DOLLAR RELATES TO THE RELATIVE STRENGTH VERSUS WHAT PEOPLE EXPECT, SO I THINK IT'S FINE IT'S WEAK IN THE SHORT TERM. IT DOESN'T MATTER THAT MUCH SO.\nSORKIN: THINKING ABOUT THE STOCK MARKET, RIGHT? WE HAD RAY DALIO ON YESTERDAY. HE SAID IF YOU'RE IN CASH, YOU'RE STUPID. BUT HE ALSO SAID WE COULD HAVE A RECESSION BEFORE THE NEXT ELECTION.\nDIMON: I DON'T GUESS ABOUT THE STOCK MARKET. AT JPMORGAN – THE COMPANY – PEOPLE, SALES, OFFICES, BRANCES, MARKETS GO UP, MARKETS GO DOWN, AND IF YOU POSTULATE THAT WE'RE GOING TO HAVE A VERY GOOD ECONOMY GLOBALLY –\nSORKIN: YOU'RE A PRIVATE BANKER. YOU HAVE HUGE CLIENTS WHO TRYING TO MAKE BETS.\nDIMON: THEY DON'T ALLOW ME TO GIVE ADVICE ABOUT THE MARKET FOR A VERY GOOD REASON.\nKERNEN: HOW DO YOU GET TO 4% WHEN YOUVE HEARD THE RHETORIC FROM EVERY PERSON AND, JAMIE, THERE ARE SOME PEOPLE, GOD, I CAN'T BELIEVE THEY WOULD ACTUALLY NOT WANT TO GET TO 3%, BUT I THINK THEY'VE GOT A VESTED INTEREST IN IT NOT BEING POSSIBLE BECAUSE THEIR POLICIES RESULT IN –\nDIMON: I'VE ALWAYS –\nKERNEN: BUT WITH IMMIGRATION AND PRODUCTIVITY, THOSE ARE THE TWO THINGS, THE AGING POPULATION, THEY SAY 3% IS BASICALLY IMPOSSIBLE LONG TERM. HOW CAN YOU GET TO 4%?\nDIMON: IT'S NOT TRUE. WE'VE HAMPERED -- I'VE SAID THIS FOR YEARS. WE'VE HAD 2% GROWTH, WHICH IS KIND OF BELOW NORM -- IT'S LONG BUT IT'S HALF OF A NORMAL RECOVERY. WE'VE HAD 16%, IT SHOULD HAVE BEEN LIKE 32, AND THE REASON FOR THAT IS UNCOMPETITIVE TAXES, EXCESS REGULATION, LACK OF INFRASTRUCTURE BUILDING, OUR INNER-CITY EDUCATION DOESN'T WORK. AND THAT'S WHY IT'S GROWING SLOWER.\nKERNEN: LARRY SOMERS WOULD WANT TO GO LIKE THAT TO YOU RIGHT NOW. IT'D BE SOME AD HOMINEM –\nDIMON: I THINK LARRY MIGHT AGREE THAT WE DID ALL OF THESE THINGS RIGHT WE'D BE GROWING FASTER.\nKERNEN: NOT WITHOUT POPULATION GROWTH.\nDIMON: IMMIGRATION WOULD BE A PLUS, TOO.\nKERNEN: OKAY, HOW DO YOU GET PRODUCTIVITY THAT'S ALREADY AT HIGH LEVEL. HOW DO YOU GET THAT BACK?\nDIMON: CAPITAL. ALL OF PRODUCTIVITY COMES FROM–\nKERNEN: TECHNOLOGY AND –\nDIMON: ALL OF PRODUCTIVITY COMES –\nKERNEN: I THINK IT'S POSSIBLE— I LIVED THROUGH DAYS WHERE WE –\nDIMON: YOU'RE GOING TO SEE IT. PEOPLE WILL SAY, MY GOD, IT WAS BECAUSE OF WHAT WE DID, IT DIDN'T HAVE TO BE THAT WAY.\nKERNEN: WILL THERE BE EGG ON THE FACE ON ALL THE ECONOMISTS AND PEOPLE WHO SAY WE CAN'T DO IT?\nDIMON: I HOPE THERE IS ON PEOPLE WHO SAY WE'RE STRUCTURALLY STUCK ON 2% FOREVER, YES.\nKERNEN: THERE AREN'T ENOUGH EGGS. I'M LOOKING AT YOU.\nDIMON: WHAT IS POSSIBLE AND WHAT MAKES IT POSSIBLE?\nKERNEN: SO LONG TERM WE CAN GROW TO 3 THEN?\nDIMON: I THINK IT'S POSSIBLE, YEAH. I THINK IT'S POSSIBLE WE'LL HIT 4%. THE PEOPLE LOOK AT THE PAST AND THEY THINK SOMEHOW IT HAS TO REPEAT. IT DOESN'T I MADE A LIST IN MY CHAIRMANS LETTER OF THINGS HOLDING US BACK, AND THEY ARE EXTENSIVE. AND THEY DIDN'T HAVE TO BE THAT WAY. IT WAS US MAKING DECISIONS OVER A LONG PERIOD OF TIME.\nQUICK: INFRASTRUCTURE IS ONE OF THOSE THINGS ON THE LIST?\nDIMON: YEAH.\nQUICK: WE'VE GOT ALL OF THIS TALK AROUND INFRASTRUCTURE. IT SOUNDS LIKE THE TWO SIDES ARE PRETTY FAR APART YET AGAIN.\nDIMON: INFRASTRUCTURE AGAIN. YOU LOOK AT THE UNITED STATES, WE'RE AN UNBELIEVABLE COUNTRY, WE'RE BLESSED WITH EVERYTHING AND YET IT TAKES 12 YEARS TO BUILD A BRIDGE. THE BAYONNE BRIDGE IN NEW JERSEY, IT TOOK 12 YEARS TO BUILD BECAUSE YOU HAVE TO GET THE PERMITS AND MULTIPLE THINGS. SHAME ON US. THAT'S CALLED BUREAUCRACY AND CORRUPTION AND SINECURE. YOU SEE IT ALL AROUND THE NATION. WE CAN'T BUILD AIRPORTS, WE CAN'T BUILD HIGHWAYS, WE CAN'T BUILD BRIDGES, WE CAN'T BUILD TUNNELS, WE CAN'T BUILD – AND THAT SHOULD BE FIXED. THIS ADMINISTRATION, THE PRIOR ADMINISTRATION ALL TRIED TO FIX THAT. THAT'S DOABLE. AND OF COURSE, THAT COSTS US GDP, IT COSTS US JOBS. AND IT CAN BE DONE. HERE DEMOCRATS AND REPUBLICANS HAVE A COMMON OBJECTIVE. BOTH PARTIES WANT THAT. AND THE ONLY QUESTION IS HOW YOU DO IT. AND AGAIN, I'M THE NOT AN EXPERT OR A POLITICIAN. THEY SHOULD FIGURE IT OUT. IN ANY EVENT, EVERYONE HAS INTEREST IN REDUCING THE TIME TO BUILD A BRIDGE FROM 12 YEARS TO 2. GERMANY -- I THINK IT'S GERMANY AND CANADA, TWO YEARS TO GET THE PERMITS. CHINA'S PROBABLY ONE YEAR.\nQUICK: IF THAT.\nDIMON: YOU THINK WE COULD ASPIRE TO SOMETHING LIKE THAT. AND BY THE WAY THAT MEANS THIS WHOLE PIPELINE OF PROJECTS THAT ARE IN THE WORKS THAT ARE TAKING YEAR AFTER TO BE APPROVED. SO THAT'S KIND OF THAT SHOVEL READY CONCEPT OF JUST BEAT THEM UP, YOU HAVE A LOT OF PROJECTS OUT THERE.\nSORKIN: WE'VE HAD A LOT OF CONVERSATIONS RECENTLY ABOUT CRYPTOCURRENCY. WE HAD A CONVERSATION IN THE FALL ABOUT BITCOIN. YOU'VE SWITCHED YOUR VIEW A LITTLE BIT ON THIS?\nDIMON: I THINK YOU ALL HAVE SAID ENOUGH. I'M NOT GOING TO SAY ANYMORE. YOU GUYS ARE THE ONES POPPING THIS WHOLE THING. YOU TALK ABOUT IT TOO MUCH. YOU SHOULD STOP TALKING ABOUT IT AND GO BACK TO SOMETHING RELEVANT.\nQUICK: SO CRYPTOCURRENCY, TAKE IT OFF –\nDIMON: IT'S NOT MY INTEREST. I DON'T WANT TO BE A SPOKESMAN FOR OR AGAINST.\nKERNEN: YOU WERE SORT OF LOOKING IN MY – YOU DIDN'T MEAN TO LOOK IN MY DIRECTION?\nDIMON: NO, I DIDN'T MEAN TO LOOK IN YOUR DIRECTION.\nKERNEN: OKAY. BITCOIN – I'M CLUELESS ABOUT A LOT OF THINGS.\nDIMON: OKAY.\nSORKIN: DIFFERENT BUT RELATED, MIKE CORBAT WHO WAS HERE BEFORE, FROM CITI, HE SAID CREDIT CARDS HE THINKS ARE ON THEIR WAY TO EXTINCTION, DO YOU THINK THAT'S TRUE?\nDIMON: IT DEPENDS WHAT HE MEANS BY THAT.\nQUICK: HE SAID OVER THE LONG TERM.\nDIMON: YEAH, BUT THEN THE LONG TERM IS GOING TO BE ON A CHIP IN YOUR FINGER.\nQUICK: YES.\nDIMON: IT'S GONNA BE ON YOUR PHONE. BUT SOMETHING –\nSORKIN: BUT THE OTHER PIECE IS DO THE BANKS GET DISINTERMEDIATED? MEANING, DO WE GET TO SOME BLOCKCHAIN LIKE SYSTEM WHERE THE THIRD PARTY ARE PEERLESS BUT THEN THERE'S NO MARGIN FOR YOU?\nQUICK: BUT YES, THAT IS WHAT CORBAT MEANT, A DIFFERENT VERSION.\nDIMON: THAT WE'RE GOING TO LOSE THE BUSINESS ALL TOGETHER?\nQUICK: NO, NO. A DIFFERENT VERSION.\nDIMON: HE MEANT A DIFFERENT VERSION. LOOK, WE'RE WORKING ON THAT, TOO. WEVRE NOT STUPID. WE'RE WORKING ON TECHNOLOGIES TO MAKE IT EASIER, SEAMLESS, AND PAINLESS. GENERALLY IN ALL COMPETITIVE BUSINESSES, MARGINS COME DOWN. THAT'S CALLED CAPITALISM. SO WE CAN ALWAYS PREPARE FOR THAT. LIKE, DON'T COMPLAIN ABOUT IT, JUST DEAL WITH IT. SO YOU'LL SEE IT, YOU HAVE TO DO THINGS BETTER, FASTER, QUICKER, CHEAPER IN EVERY BUSINESS. WE'VE GOT, AS YOU KNOW, HAVE SOME GREAT CREDIT CARD PRODUCTS, WE'VE GOT SOME GREAT PRODUCTS COMING THIS YEAR. NOT JUST THESE 400 BRANCHES AND NEW MARKETS BUT WE HAVE INVESTING PRODUCTS COMING THIS YEAR, AND CREDIT CARD PRODUCTS COMING THIS YEAR, AND MORE STUFF THAT YOU CAN DO ON THE PHONE, DIGITAL WITH MORTGAGE, WITH CREDIT CARD, WITH YOUR BASIC BANKING ACCOUNT. SOME OF THOSE THINGS WILL BE LINKED UP. SO WE'RE NOT SITTING STILL.\nSORKIN: WHAT ARE THE OTHER BIG BANKS THAT YOU THINK ARE DOING WELL WITH FINTECH? WE'LL HAVE LLOYD BLANKFEIN ON. THEY'VE INVESTED IN SOME FINTECH STUFF. BUT HOW DO YOU – WHEN YOU LOOK AT YOUR TRADITIONAL COMPETITORS—\nDIMON: WE'VE INVESTED IN –\nSORKIN: PROBABLY MORE THAN ANYBODY ELSE.\nDIMON: HUNDRED DIFFERENT COMPANIES. AGAIN, TECHNOLOGY, THIS IS NOT NEW. YOU USE TECHNOLOGY TO DO A BETTER JOB FOR YOUR CUSTOMERS. IF YOU DON'T, YOU LOSE. THAT WAS TRUE 30 YEARS AGO, 20 YEARS AGO, 10 YEARS AGO. I THINK IT'S FASTER TODAY. THERE'S MORE COMPETITORS TODAY. I DO THINK IN THE PAYMENT SYSTEM IS ONE PLACE SOMEONE MAY COME AND DISRUPT SOMETHING. SO WE TRY TO BE CONSCIOUS BOTH FROM A CONSUMER SIDE AND WHAT WE CALL THE WHOLESALE SIDE. BUT AGAIN, WE'RE USING IT TOO. WE'RE BUILDING BLOCKCHAIN TYPE STUFF. WE'RE GETTING FASTER, QUICKER. THESE BIG NEW COMPUTERS THAT GINNI WAS TALKING ABOUT HELP KEEP THINGS QUICKER.\nKERNEN: OH YEAH. Z 14. I'M GOING TO GET ONE.\nDIMON: WE HAVE A WHOLE BUNCH OF Z 14s.\nKERNEN: SHE SAID YOU BOUGHT THEM ALL. WHAT COLOR ARE THEY? DO THEY COME IN BLUE?\nDIMON: I THINK THEY COME JUST IN BLACK, BUT I DON'T KNOW.\nKERNEN: I WANT A BLUE ONE. SO DALIO WAS ON. HE SAID JUST TO PARAPHRASE, I THINK HE KINDA SAID THAT 4% IS THE NEW 8% IN TERMS OF WHERE WE NEED TO WORRY ABOUT DISLOCATION AND ACTUALLY --\nQUICK: INTEREST RATES.\nKERNEN: NOT BEING ABLE TO SERVICE THE DEBT THAT WE'VE BUILT UP. I GUESS MY QUESTION IS WE KIND OF THINK THAT IT'S CLEAR SAILING FOR THE FED. THEY ORCHESTRATED, YOU KNOW, THE RECOVERY FROM THE FINANCIAL CRISIS. THEY BLEW OUT THE BALANCE SHEET. BUT WE'RE GOING TO BE FINE IN SORT OF REVERSING IT. IS EVERYTHING GOING TO BE OKAY?\nDIMON: I THINK IT'S HARD TO SAY THE FED MADE IT FINE, BENIGN. OR THAT IT WAS BENIGN AND EASY FOR THE FED TO DEAL WITH. SO, YOU KNOW, THE NEXT CHAIRMAN MAY NOT HAVE A BENIGN ENVIRONMENT TO DEAL WITH. THE MOST IMPORTANT IS GROWTH. IT'S NOT JUST WHETHER THE RATES ARE GOING UP, YOU HAVE GROWTH. IF YOU HAVE HEALTHY GROWTH THE RATES ARE GOING UP, THE ECONOMY WILL PROBABLY BE FINE.\nKERNEN: SO IT WOULDN'T SCARE YOU IN TERMS OF --\nDIMON: NO.\nKERNEN: WHAT ABOUT FIVE?\nDIMON: THE WORLD SHOULD EXPECT 4%, MAYBE 5%. SOME – IF YOU WERE A BORROWER, YOU SHOULD BE VERY CAREFUL YOU HAVE TOO MUCH INTEREST RATE EXPOSURE, INTEREST RATE MISMATCH OR CURRENCY MISMATCH ALL THAT KIND OF STUFF, OR TOO MUCH LEVERAGE WHICH I THINK THERE'S LESS THAN PEOPLE THINK IN THE SYSTEM RELATIVE TO YEARS AGO. IF YOU COMPARE EVERYTHING – OTHER THAN GOVERNMENTS BY THE WAY. GOVERNMENTS CAN DEAL WITH IT EASIER THAN GOVERNMENTS.\nKERNEN: THAT DOESN'T SOUND NEARLY AS -- I THINK DALIO WAS --\nQUICK: DALIO WAS VERY CONCERNED.\nKERNEN: KIND OF A WARNING.\nQUICK: BECAUSE IF INTEREST RATES GO UP 25, 50, 75%, EVEN IF THAT'S A LITTLE OFFBASE, HE THINKS THAT'S A BIT JOLTING. THAT WAS HIS –\nDIMON: IT IS BUT, AGAIN, CONSUMERS ARE IN VERY GOOD SHAPE. AND YOU KNOW, CREDIT CARD BALANCES ARE STILL NOT UNBELIEVABLY HIGH. ALL CREDIT EXTENDED IN THE UNITED STATES HAS BEEN ALMOST SUPER PRIME, MORTGAGES, CREDIT CARD, SUBPRIME COMPONENT IS MUCH LESS, MIDDLE MARKET COMPANIES ARE IN VERY GOOD SHAPE, SMALL BUSINESS COMPANIES IN EVERY GOOD SHAPE. LARGE CORPORATIONS GENERALLY IF YOU LOOK AT THEIR BALANCE SHEETS ARE PRETTY GOOD. MOST OF THEM HEDGE THEIR INTEREST RATE EXPOSURES. THEY'RE BETTING ON INTEREST RATES. BUT IF YOU HAVE – EVENTUALLY YOU MIGHT HAVE GROWTH SLOWING DOWN, INFLATION GOING UP, RATES GOING UP – YEAH, SOMEONE IS GOING TO GET HURT. AND THAT HAPPENS IN LIFE. AND AGAIN, MY JOB AT JPMORGAN, BUILD A COMPANY, SERVE THE CLIENTS. I COMPLETELY UNDERSTAND THE WEATHER MAY CHANGE. I DON'T SPEND A LOT OF TIME GUESSING ABOUT WHAT'S GOING TO HAPPEN TO THE WEATHER. I JUST DON'T KNOW. BUT WE TRY TO ANALYZE ALL THAT KIND OF STUFF.\nQUICK: WE'RE SITTING HERE AND JUST ABOUT EVERYBODY YOU TALK TO, EVERYTHING IS GOING GANGBUSTERS. THINGS LOOK GREAT ON JUST ABOUT EVERY LEVEL ON EVERY COUNTRY AROUND THE WORLD, AND THAT'S WHERE SURPRISES CAN SNEAK UP. IF THERE'S SOMETHING YOU HAVE TO WORRY ABOUT, WHAT WOULD IT BE?\nDIMON: SO FIRST OF ALL, WE CAN'T BELIEVE THINGS ARE DOING SO WELL. WE SHOULD BE HAPPY FOR THAT.\nQUICK: IT'S BEEN A LONG TEN YEARS.\nDIMON: IT'S BEEN A LONG TEN YEARS. AND THIS IS GOING TO HELP CITIZENS AROUND THE WORLD AND REMIND PEOPLE WE COULD HAVE GOOD GROWTH. REMIND PEOPLE GOOD POLICY WILL LEAD TO GOOD GROWTH. AND OF COURSE THERE WILL BE THINGS TO DISRUPT IT.\nQUICK: NOTHING AROUND THE CORNER?\nDIMON: I DON'T SEE ANY POTHOLE. I CAN'T SEE— I ACKNOWLEDGE THAT I MAY NOT BE ABLE TO SEE THE POTHOLE BUT I CAN'T SEE ANY POTHOLE THAT YOU HAD IN 2016. HUGE LEVERAGE IN FUNDS, CDOs, MORTGAGES, SUBPRIME, IN -- NOTHING LIKE THAT IS TAKING PLACE. YOU DON'T HAVE THAT KIND OF LEVERAGE OR EXPOSURE IN THE SYSTEM, BUT IT DOESN'T MEAN THAT RATES CAN'T GO UP, THAT RECESSION CAN'T GO UP, INFLATION CAN'T GO UP, SURPRISE PEOPLE. IF IT HAPPENS AM I GOING TO BE SURPRISED? NOT REALLY. BECAUSE I'M TELLING YOU IT CAN HAPPEN. IT MIGHT HAPPEN.\nDIMON: HERE'S THE SMART GUY. IT'S MADE A LOT OF MONEY, ONE OF THE BEST INVESTORS AROUND. HE SAYS YOU, ONLY DEMOCRAT NOT GRITTING ITS TEETH. IF YOU RUN IN 2020 HE'LL VOTE FOR YOU. THAT'S WHAT THIS GUY SAYS.\nDIMON: I DON'T PLAN TO.\nKERNEN: WHAT DO YOU MEAN, YOU DON'T PLAN TO? OKAY, SO ABSOLUTELY NOT?\nDIMON: NO.\nKERNEN: HUH?\nDIMON: I DON'T PLAN TO.\nSORKIN: YOU KNOW YOU'RE GOING TO GET THIS QUESTION FOR THE NEXT 18 MONTHS.\nDIMON: THAT'S FINE. I DONT MAKE PROMISES TO ANYONE.\nKERNEN: YOU'RE NOT RUNNING FROM CONGRESS, SENATE?\nDIMON: I DON'T THINK I'M A POLITICAL TYPE.\nSORKIN: I WOULD SAY OVER THE LAST SIX MONTHS MANY OF YOUR FRIENDS OFF THE RECORD AND WHAT NOT HAVE BEEN WHISPERING MUCH MORE THAN EVER BEFORE THAT THEY SAY WHAT'S GOING ON WITH JAMIE? IS HE PLANNING ON RUNNING?\nDIMON: JAMIE'S DOING QUITE FINE, THANK YOU. I APPRECIATE YOUR CONCERN.\nSORKIN: AND ALSO BEFORE I LET YOU GO, WE WANTED TO GET A LITTLE INSIDE TAKE ON WHATS NOW BEING CALLED THIS PRE-DAVOS PARTY THAT TOOK PLACE ON MONDAY IN PARIS.\nDIMON: YEAH. IN VERSAILLES.\nSORKIN: IN VERSAILLES.\nDIMON: PARIS AND VERSAILLES.\nSORKIN: SO WHAT HAPPENED?\nDIMON: BEFORE DAVOS.\nSORKIN: RIGHT.\nDIMON: WELL, YOU KNOW, PRESIDENT MACRON, HE WAS WISE, HE KNOWS PEOPLE ARE COMING TO DAVOS SO HE HAD A FUNCTION WHICH HE SAID HE'S GOING TO DO EVERY YEAR, STUFF LIKE THAT. AND HE SPOKE FOR TWO HOURS OR 2 1/2 HOURS, MOSTLY ABOUT POLICY. YOU KNOW, HE'S PRO BUSINESS, PRO CAPITAL, LABOR REFORM. KNOWING THAT ALL THESE THINGS WILL HELP THE AVERAGE FRENCH CITIZEN. HE TALKED ABOUT TRADE. HE TALKED ABOUT CHINA. YOU KNOW, HE'S – HE'S DONE A LOT OF THINGS IN EIGHT MONTHS AND SO, YOU KNOW, AFTER BREXIT WE WERE ALL AFRAID ABOUT WHAT MIGHT HAPPEN TO EUROPE. AND AFTER BREXIT INSTEAD OF HALAD YOU GET MACRON.\nKERNEN: AND THAT WAS THE FIRST STATE DINNER, RIGHT?\nDIMON: YEAH.\nKERNEN: INTERESTING COMMENTS ABOUT IT, IF HE PULLED A CAMERON, HE THINKS THAT FRANCE MIGHT SAY, FREXIT.\nDIMON: I DON'T THINK THERE'S ANY CHANCE.\nKERNEN: THERE WON'T BE A –\nDIMON: HE IS VERY, VERY PRO EUROPE.\nKERNEN: YEAH.\nDIMON: BUT HE ACKNOWLEDGES THAT SOME OF THE FLAWS THAT CREATED SOME OF THE CONCERNS IN BREXIT NEED TO BE FIXED, WHICH IS EXACTLY THE RIGHT THING TO DO. AND THEN PULL IT TOGETHER, FIX THE FLAWS, MAKE THE COMMON MARKET STRONGER, YOU KNOW, MAKE THE REGULATIONS BETTER. THEY DO NEED SOME PAN EUROPEAN ENTITIES TO MANAGE THE BANKS AND STUFF LIKE THAT. HE'S DOING ALL THE RIGHT STUFF.\nKERNEN: SO YOU WON'T RUN – YOU'RE NOT RUNNING IN FRANCE EITHER?\nDIMON: I'M NOT RUNNING IN FRANCE, BUT THEY HAVE MADE FRANCE – YOU TALK ABOUT A BANK -- THEIR TAX RATES ARE GOING TO 25%. THEY'RE NOT GOING TO HAVE A WEALTH TAX ON PEOPLE. THEY WANT PEOPLE TO MOVE THERE.\nKERNEN: IT'S UNBELIEVABLE. BETTER THAN US.\nDIMON: IT IS UNBELIEVABLE. AND THEY'RE GOING TO MAKE IT A VERY ATTRACTIVE PLACE, AND PARIS IS ATTRACTIVE TO START WITH, INCLUDING EDUCATION. AND THE INFRASTRUCTURE, AND UNIVERSITIES ALL OF THESE GREAT THINGS.\nSORKIN: JAMIE DIMON, THANK YOU. THIS IS A GREAT CONVERSATION.\nDIMON: GREAT TIME.\nKERNEN: WE COULD GO UNTIL 9:00 WITH YOU.\nSORKIN: YES.\nDIMON: SEE YA FOLKS.\nFor more information contact:\nJennifer Dauble\nCNBC\nt: 201.735.4721\nm: 201.615.2787\ne: jennifer.dauble@nbcuni.com\nEmma Martin\nCNBC\nt: 201.735.4713\ne: emma.martin@nbcuni.com\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["https://wpyadmin.ne.cision.com/l/ghflrggy/wpyadmin.ne.cision.com/l/ifqfoiiz/wpyadmin.ne.cision.com/l/ekzlkfiz/wpyadmin.ne.cision.com/l/kvqakfgz/www.cnbc.com/squawk-box-us", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-25T01:35:00.000+02:00", "crawled": "2018-01-25T01:40:32.023+02:00", "highlightTitle": ""}