{"organizations": [], "uuid": "6295d3a8e9bc74c441efc22e648c20914d752b39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/20/104416005-RTR1OAPC.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19206666/device/rss/rss.html", "section_title": "Warren Buffett Watch", "url": "https://www.cnbc.com/2018/01/10/us-futures-tank-after-more-records-on-wall-street.html", "country": "US", "domain_rank": 767, "title": "US futures tank after more records on Wall Street", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.064, "site_type": "news", "published": "2018-01-10T15:32:00.000+02:00", "replies_count": 0, "uuid": "6295d3a8e9bc74c441efc22e648c20914d752b39"}, "author": "Berkeley Lovelace Jr.", "url": "https://www.cnbc.com/2018/01/10/us-futures-tank-after-more-records-on-wall-street.html", "ord_in_thread": 0, "title": "US futures tank after more records on Wall Street", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "ny times", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IN THE NEWS TODAY A federal judge issued a nationwide injunction ordering the Trump administration to start back up the Obama-era Deferred Action for Childhood Arrivals, know as DACA. About 800,000 immigrants faced deportation when the program ended in March. (NY Times)\nThe Environmental Protection Agency will replace Obama-era carbon and clean water regulations and open up a national debate on climate change in 2018. Environmentalists argue these rules are critical to human health. (Reuters)\nThe White House said President Trump is planning on attending the World Economic Forum in Davos, Switzerland later this month. Trump, who employed anti-globalization rhetoric on the campaign, did not attend the event last year. Davos is seen at the ultimate den of globalization (CNBC)\nTrump's former White House chief strategist Steve Bannon is stepping down from Breitbart News , where he was executive chairman. It came after Bannon's comments in a tell-all book about the Trump family sparked a backlash. (CNBC)\n* Republicans still have to contend with Trump's unpopularity (CNBC)\n* 2018 is shaping up to be a very different year for Trump (CNBC)\nSenate Democrats released a full testimony on the Trump-Russia dossier. The testimony touched on a wide array of topics in the 312-page transcript, including President Trump's business ties and his tax history. (CNBC)\nSouth Korea's president credited Trump today for helping to spark the first talks with North Korea in more than two years. Moon Jae-in also warned that Pyongyang would face stronger sanctions if provocations continued. (Reuters)\nThere were no early reports of casualties after one of the strongest earthquakes to hit the Caribbean in modern times struck off the coast of Honduras last night. The quake set off tsunami warnings that were canceled about an hour later. (USA Today)\n* Powerful storm kills at least 13 people, mudslides destroy homes in Southern California (CNBC)\nToyota Motor and Mazda Motor is expected to announce today plans for a $1.6 billion assembly plant in Huntsville, Alabama , sources tell CNBC. The plant is a huge win for President Donald Trump, who has made a point of stressing he would add manufacturing jobs.\n* Toyota will add Amazon Alexa to select cars in 2018 (CNBC)\n* Renault-Nissan-Mitsubishi wants to spend up to $1 billion on start-ups over next 5 years (CNBC)\nA slew of celebrities, including basketball star LeBron James and rapper Diddy, scolded H&M for using a black child to model a sweatshirt sporting the phrase \"coolest monkey in the jungle.\" The image of the child first appeared over the weekend and was removed. (CNBC)\nSTOCKS TO WATCH Apple (AAPL) is facing new questions from government officials in both the U.S. and France about its handling of battery-related performance issues on iPhones, according to the Wall Street Journal.\nMicrosoft (MSFT) has provided new details on the performance impact of updates to protect against recently disclosed security vulnerabilities. Windows 7 and Windows 8 users relying on older chips will notice a performance impact.\nAllergan (AGN) released fiscal 2018 outlook that projected continued cost cuts and a 84-cent loss per share. Chairman and CEO Brent Saunders attributed the weak data to \"loss of exclusivity revenue headwinds in 2018.\"\nNordstrom (JWN) said same-store sale rose a better-than-expected 1.2 percent during the holidays. The high-end retailer was boosted by strong sales at its off-price Nordstrom Rack stores. The company is adjusting its full-year earnings outlook slightly higher.\nDomino's Pizza (DPZ) said CEO Patrick Doyle will step down in June. He'll be replaced by the head of the company's international business. Doyle has been CEO since 2010, and oversaw Domino's turnaround, including the move into online ordering and promotions.\nWATERCOOLER A romantic comedy crushed Disney's (DIS) \"Star Wars: The Last Jedi\" at the Chinese box office. \"The Last Jedi\" racked up just over $28 million in its opening weekend, putting the film at number two against locally produced \"The Ex-File: The Return of the Exes.\" (CNBC)", "external_links": ["https://www.usatoday.com/story/news/world/2018/01/09/honduras-caribbean-sea-earthquake/1019476001/", "https://www.nytimes.com/2018/01/09/us/trump-daca-improper.html?_r=0&mtrref=news.url.google.com"], "published": "2018-01-10T15:32:00.000+02:00", "crawled": "2018-01-10T17:51:32.000+02:00", "highlightTitle": ""}