{"organizations": [], "uuid": "df779de19dfebb3dcf021f794f40dabaac5eb4c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224078552&w=1200&r=LYNXMPEE0L0HZ", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ocado-group-sobeys-deals/ocado-to-tap-into-canadas-online-grocery-market-with-sobeys-tie-up-idUKKBN1FB0PR", "country": "US", "domain_rank": 408, "title": "Ocado to tap into Canada's online grocery market with Sobeys tie-up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:35:00.000+02:00", "replies_count": 0, "uuid": "df779de19dfebb3dcf021f794f40dabaac5eb4c9"}, "author": "", "url": "https://uk.reuters.com/article/uk-ocado-group-sobeys-deals/ocado-to-tap-into-canadas-online-grocery-market-with-sobeys-tie-up-idUKKBN1FB0PR", "ord_in_thread": 0, "title": "Ocado to tap into Canada's online grocery market with Sobeys tie-up", "locations": [], "entities": {"persons": [{"name": "ocado", "sentiment": "negative"}, {"name": "rahul b", "sentiment": "none"}, {"name": "kate holton", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "sobeys", "sentiment": "none"}, {"name": "sobeys inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:36 AM   Ocado seals new international tie-up with Sobeys in Canada Kate Holton , Nichola Saminather 5 Min Read \nLONDON/TORONTO (Reuters) - Britain’s Ocado ( OCDO.L ) has sealed a deal to allow Canada’s second largest food supermarket group Sobeys to use its e-commerce platform, sending the British online retailer’s shares up 28 percent on its latest international tie-up. \nOcado, which has helped to drive online shopping in Britain, one of the world’s most advanced e-commerce markets, has been trying to sell its proprietary technology to international supermarkets in the past few years, with new deals seen as key to the company’s valuation. \nAnalysts says Ocado is entering Canada at a time when Amazon.com Inc’s ( AMZN.O ) purchase of Whole Foods Inc has lit a fire under complacent Canadian grocers to step up their e-commerce platforms or cede already falling market share further. \n“Canada is behind the rest of the world in terms of online grocery purchases,” said Sally Seston, managing director of Retail Category Consultants in Burlington, Ontario. But, “ever since Amazon purchased Whole Foods, the grocery industry has been scrambling to improve online offerings.” \nThe deal with Sobeys, which operates more than 1,500 stores across Canada, helped Ocado’s shares build on gains recorded in November when it announced a deal with French supermarket Group Casino ( CASP.PA ). \nOcado and Sobeys will develop an automated warehouse in Toronto using Ocado’s grid and robots network and also consider developing more centres in dense urban areas. The warehouse is set to open by end April, 2020, Sobeys spokeswoman said. \nThe agreement, which will allow Sobeys to begin offering online ordering, automated fulfilment, and delivery in Toronto follows a move by rival Loblaw Co ( L.TO ), Canada’s biggest grocery chain, to begin grocery deliveries through a partnership with Instacart in December. \nShares of Sobeys parent Empire Company ( EMPa.TO ) rose 0.6 percent to C$25.66, compared with a 0.2 percent decline in the Toronto stock benchmark .GSPTSE . \nFamily-owned grocer Longo‘s, as well as Metro Inc ( MRU.TO ) and Wal-Mart Store’s Canada ( WMT.N ) unit offer some online shopping but the offerings are limited to some urban areas or stores, or only as click-and-collect services. Workers pack bags as a conveyer belt transports goods inside the Ocado Customer Fulfilment Centre in Hatfield on the outskirts of London, Britain, April 6, 2016 . REUTERS/Dylan Martinez \n“Channel shift to online in North America is gaining pace as consumers increasingly seek the benefits of grocery shopping from the comforts of their own homes, and as retailers attempt to offer services to meet this growing customer trend,” said Luke Jensen, chief executive of Ocado Solutions. LOFTY VALUATIONS \nFounded in 2000 by three Goldman Sachs ( GS.N ) brokers, Ocado has divided investors over its prospects after it took 15 years to make a profit. Its argument that it should be valued as a technology provider rather than a retailer has proved controversial. \nSome view its door-step deliveries from giant automated distribution centres as the future of grocery shopping while others see it as an over-valued and over-hyped retailer struggling to grow market share in a tough market. \nAccording to market data, around 10 percent of the company’s shares are held by short sellers. They will have taken a hit after its stock jumped by 122 percent from the day before it agreed its French deal in November. \nThe rise on Monday gave it a market value of around 3.3 billion pounds ($4.6 billion) \n“Investors have been tempted to bet against Ocado because of its eye-watering valuation,” said Laith Khalaf, senior analyst at Hargreaves Lansdown. At 140 times earnings, the online retailer looks like an extremely pricey bit of kit, he said. \n“However its share price is looking forward to future earnings based on licensing out its online delivery technology, rather than the revenues it’s currently making from food retail. In this respect, Ocado is more Amazon than Asda,” he said, referring to the British arm of Walmart. \nOcado said the deal would be earnings neutral in the 2017-18 year, while additional capital expenditure of 15 million pounds would be incurred. For 2018-19 and beyond, Ocado said profits would grow as the fees from Sobeys increased, and as other partnership deals were signed, though more capital expenditure would also be required. \nSobeys recorded sales of C$23.8 billion last year. Related Coverage", "external_links": [], "published": "2018-01-22T09:35:00.000+02:00", "crawled": "2018-01-22T10:01:45.000+02:00", "highlightTitle": ""}