{"organizations": [], "uuid": "d8ba112aa141ceb9248cd9f4e40cde0d01f45b97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104905634-rsz_hackkett.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/from-ford-to-intuit-design-skills-leading-to-a-new-wave-of-success.html", "country": "US", "domain_rank": 767, "title": "From Ford to Intuit, design skills leading to a new wave of success", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2018-01-11T16:34:00.000+02:00", "replies_count": 0, "uuid": "d8ba112aa141ceb9248cd9f4e40cde0d01f45b97"}, "author": "Jessica Mathews", "url": "https://www.cnbc.com/2018/01/11/from-ford-to-intuit-design-skills-leading-to-a-new-wave-of-success.html", "ord_in_thread": 0, "title": "From Ford to Intuit, design skills leading to a new wave of success", "locations": [], "entities": {"persons": [{"name": "jim hackett", "sentiment": "neutral"}, {"name": "kelley", "sentiment": "none"}, {"name": "david kelley", "sentiment": "none"}, {"name": "hackett", "sentiment": "none"}, {"name": "ernesto", "sentiment": "none"}], "locations": [], "organizations": [{"name": "intuit", "sentiment": "neutral"}, {"name": "ford", "sentiment": "neutral"}, {"name": "ideo", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com SHARES \nWhen Jim Hackett stepped into the position of CEO at Ford , he became the first designer to lead a car company. But Hackett is part of a wave of promotions and corporate success stories that have resulted from design thinking — the creative strategies designers use to come up with innovative solutions. \nWith technological innovation comes constantly changing expectations, so it is getting harder than ever to provide consumers with new and improved experiences. The upshot: Executives with design backgrounds are rising to the top and, in some cases, delivering billions in new revenue. \nHackett is close with the founder of IDEO , David Kelley — so close they watch each other's desks throughout the day on camera. Kelley is known for popularizing the design-thinking philosophy, and Hackett plans to integrate it into Ford's operations. \n\"The old way was about disciplines,\" Hackett told Fortune in September . \"The new way will be about projects and understanding what people want.\" \nThe term \"chief design officer\" was coined when Ernesto Quinteros was hired at Johnson & Johnson in 2014. Later PepsiCo and Philips Electronics NV would develop that role in their own companies. \nNike's designer, Mark Parker, became CEO in 2006, and since then revenue has nearly doubled, growing from nearly $15 billion to $32.4 billion over the past decade. \n\"I think what makes designers most successful is not just being able to visualize the product from a customer's point of view but being able to leverage the expertise of the people that work within the company they are in and bringing that to the customer,\" said David Sherwin, author of Success by Design: The Essential Business Reference for Designers. \nThat approach is paying off in performance of company shares. The Design Management Institute found that companies employing a \"design-centric\" operations performed 211 percent better than the S&P 500 over a 10-year period through 2015. \n\"Having design in an organization as part of the culture just rings something different,\" said Carole Bilson, president of the Design Management Institute. \"It helps improve innovation and helps change the way people think and can help speed up the way people innovate.\" \n\"A good indicator I look for in a company that has integrated design thinking is their time frame in identifying a customer problem and the time they take to test it,\" Sherwin said. In a design mindset, you are trying to test problems as quickly as possible. \nBilson said designers are problem-solvers, and they are constantly taking in their surroundings. \"There's a lot of observation, listening and research as you are developing products and solutions. … They are more likely to be supportive of innovative efforts, no matter where they come from or who they come from,\" she said. Design gets its own seat \n\"We had a very strong culture based around factories, where trade partners would say, 'This is what we want you to do. Go do it,'\" said Whirlpool 's vice president of design, Pat Schiavone. \"We are moving from that factory-based mindset to a truly global development culture. … Within that culture change, design became a seat at the table. I always talk about a three-legged stool. It's marketing, engineering and design working together to develop a product.\" \nSchiavone said he had to prove that design deserved that seat when he arrived in 2010. When his design team had decided to try a charcoal black interior in their Jenn-Air refrigerator model, the marketing and engineering departments originally said it would be a waste of money — no one would want black. \n\"The mistake I made was telling people what we were doing,\" he said. \"Sometimes design just needs to do something we believe in, build it, then bring in people to see it.\" \nAfter the design team built a prototype, the engineering and marketing teams approved it and the product sold well. \n\"That started to help us have a little bit of momentum as a design organization, and people began to believe in us a little bit,\" said Schiavone. \"The next time we came up with something we wanted to show, it was a little easier. … As things started to sell better, we earned that right to be at the table.\" When Schiavone's design team first suggested a Jenn-Air refrigerator with a charcoal black interior, the marketing and engineering teams said it wouldn't sell. After building it, the model was approved. \nSince Schiavone was hired, Whirlpool revenue growth has increased by more than $2.3 billion by the end of 2016. \nDesign is even overtaking companies where it may not seem as natural a fit. \nKurt Walecki came onto the team at financial-planning software firm Intuit in 2012 as vice president of design to create the vision for all TurboTax products and services. At the time, Intuit was outsourcing a lot of its consumer research. \n\"The kind of tenet of design thinking is, you cannot outsource empathy,\" Walecki said. \"Really what this is about is not paying a research firm or just having designers go gain empathy, but having everyone in the projects team get out of their four walls and understand people on their turf.\" \nSoon after being hired, Walecki put 500 people from the TurboTax team onto buses to go across different segments of San Diego and talk to people. They gave out Starbucks gift cards and asked people what was important to them. The very last question was about how people were paying their taxes. Intuit discovered it had \"fallen in love with [its] own solution\" more than consumers, who expressed a preference for software different from the one the company had been making. \nLong before design thinking became a buzzword, Intuit co-founder Scott Cook would wait for people to purchase the software off the shelf in a store. Then he asked customers if he could go home with them as they installed it so he could learn which parts of the process were too complicated and needed correction. \nBut it didn't get disseminated widely enough until Intuit started placing design leaders throughout the company in 2012. Last month Intuit hired Diego Rodriguez as executive vice president and chief product and design officer, directly reporting to CEO Brad Smith. \n\"We can design all day, but if engineers and product managers don't deliver, it's not going to get delivered into the hands of our customers,\" Walecki said. Design thinking is not one-size-fits all \nThe Design Management noted in its report that there are \"design-centric\" companies that have seen revenue fall. Coca-Cola started incorporating design strategy in 2012, but its annual revenue has fallen by more than $6 billion through the end of 2016 . IBM was one of the first companies to have a corporate-wide design program, as far back as 1956. But recent years have not been kind to IBM, with revenue falling every year since 2011 . Earlier this year, it announced plans to invest $100 million to make the company more design-focused. \n\"I think design has become this box that people just want to check off,\" said Natasha Jen, an award-winning designer and a partner at Pentagram, in a talk with Adobe's design-focused content and conference affiliate 99U . \nJen argues that design thinking is too often made to fit into a step-by-step diagram for fields outside of design. There is ", "external_links": [], "published": "2018-01-11T16:34:00.000+02:00", "crawled": "2018-01-11T16:34:15.010+02:00", "highlightTitle": ""}