{"organizations": [], "uuid": "afcd6a5dd5a727d9624e23c963497174ed8fb185", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223438223&w=1200&r=LYNXMPEE0I1MS", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-results-dollar/weaker-dollar-adds-to-optimism-over-u-s-earnings-idUSKBN1F82KX", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Weaker dollar adds to optimism over U.S. earnings", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:16:00.000+02:00", "replies_count": 0, "uuid": "afcd6a5dd5a727d9624e23c963497174ed8fb185"}, "author": "", "url": "https://www.reuters.com/article/us-usa-results-dollar/weaker-dollar-adds-to-optimism-over-u-s-earnings-idUSKBN1F82KX", "ord_in_thread": 0, "title": "UPDATE 1-Weaker dollar adds to optimism over U.S. earnings", "locations": [], "entities": {"persons": [{"name": "caroline", "sentiment": "negative"}, {"name": "valetkevitch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "min read  new york", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The dollar’s drop to three-year lows this week after prolonged weakness in 2017 is expected to further boost profits at big U.S. companies when investor optimism is already high over corporate tax cuts.\nInvestors are keeping an eye out for signs of the dollar's impact on company earnings as fourth quarter reporting ramps up next week. (GRAPHIC-World FX rates in 2018: tmsnrt.rs/2egbfVh )\nU.S. multinationals, especially energy and technology companies that have a significant portion of their sales overseas, could benefit the most from the currency effect, while other sectors like telecommunications benefit less.\n(GRAPHIC-Overseas sales by sector: reut.rs/2DhadR2 )\nThe greenback was headed for its fifth week of losses on Friday. The U.S. dollar index’s =USD average in the fourth quarter fell about 6 percent from its average in the year-ago quarter.\nIts nearly 10 percent fall in 2017 was its worst annual performance since 2003.\nThe dollar has fallen on expectations central banks besides the Federal Reserve are seeking to end their policy of ultra-low, even negative, rates adopted to combat the 2008 global financial crisis. Analysts said that if U.S. inflation remains below the Fed’s target, while overseas central banks raise rates and reduce bond purchases, the dollar could fall further.\nThough it is still early days in the fourth-quarter earnings season, there are examples of how the weak dollar is affecting companies’ bottom lines.\nInternational Business Machines ( IBM.N ) late Thursday cited a currency boost in its results. IBM’s sales rise of 3.5 percent last quarter would have been only 1 percent if currency impact were excluded. American Express ( AXP.N ), also on Thursday, said fees and commissions grew 17 percent and 12 percent on a currency-adjusted basis, noting that “the weaker dollar had a larger impact on this line.”\nThe effects may not be as headline grabbing as those from the changes to the U.S. tax law that were enacted last month by U.S. Congress and President Donald Trump.\nChanges to the law, which are prompting many companies to take one-time charges in fourth-quarter reports, include a cut in the corporate income tax rate to 21 percent from 35 percent. The expected boon to earnings has helped stocks rally so far this year, while the weak dollar has added to the enthusiasm.\n“You look at the big-cap stocks and with that weakening dollar, that just makes everything so much better for them as far as overseas,” said Peter Costa, president at Empire Executions Inc in New York.\nA weaker dollar likely added about 50 basis points to fourth-quarter earnings growth, Credit Suisse strategists wrote in a note. Analysts are forecasting earnings for all S&P 500 companies of 12.4 percent in the fourth quarter from a year ago, according to Thomson Reuters data.\n(GRAPHIC-Dollar Stuck on Worst Losing Streak since 2015: reut.rs/2DP4e71 )\nThe dollar’s weakness had also helped third-quarter results. Among other companies that have cited currency benefits in reports since the start of December are John Wiley & Sons ( JWa.N ), Progress Software ( PRGS.O ) and Actuant ( ATU.N ).\n“If you couple global demand with a weaker U.S. dollar, it’s a positive underpinning for the industrials in particular,” said Quincy Krosby, chief market strategist at Prudential Financial in Newark, New Jersey.\nU.S.-based multinationals can benefit the most from declines in the dollar, which makes overseas sales more valuable when translated back into U.S. currency. Global economic demand continues to pick up and was one of the biggest boosts to earnings in 2017, strategists said.\nS&P 500 companies with 50 percent or more of sales coming from outside the United States have estimated profit growth of 15.2 percent for the fourth quarter, compared with 12.3 percent for companies with less than 50 percent of non-U.S. sales, according to Thomson Reuters data.\nRelated Coverage The U.S. dollar's slide and what lies ahead Reporting by Caroline Valetkevitch; additional reporting by Chuck Mikolajczak; Editing by Alden Bentley and Nick Zieminski\n ", "external_links": [], "published": "2018-01-20T01:16:00.000+02:00", "crawled": "2018-01-20T02:02:27.010+02:00", "highlightTitle": ""}