{"organizations": [], "uuid": "9970582f42ff586e824dd041606af2e1f6d9c3b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 728, "shares": 728, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/diet-coke-portfolio-2-rendition-932-636.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/dietcoke-relaunch/", "country": "US", "domain_rank": 1196, "title": "Diet Coke Is Getting a Major Overhaul With New Flavors as Sales Fall | Fortune", "performance_score": 7, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.661, "site_type": "news", "published": "2018-01-11T15:25:00.000+02:00", "replies_count": 0, "uuid": "9970582f42ff586e824dd041606af2e1f6d9c3b3"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/10/dietcoke-relaunch/", "ord_in_thread": 0, "title": "Diet Coke Is Getting a Major Overhaul With New Flavors as Sales Fall | Fortune", "locations": [], "entities": {"persons": [{"name": "phil wahba", "sentiment": "negative"}, {"name": "rafael acevedo", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coca-cola", "sentiment": "none"}, {"name": "diet coke", "sentiment": "none"}, {"name": "coca-cola north america", "sentiment": "none"}, {"name": "coke zero", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Phil Wahba 1:25 PM EST \nDiet Coke is getting a radically new look and some new flavors as Coca-Cola (ko) tries to stop long sales declines stemming from customers’ move away from artificially sweetened sodas. \nIn the biggest change to Diet Coke since its launch in 1982, Coca-Cola said on Wednesday that the new flavors—ginger lime, feisty cherry, twisted mango and zesty blood orange—and thinner, taller 12-ounce cans would start appearing on shelves in mid-January. And the company clearly remembers its hard lesson from the 1980’s when it reformulated its flagship product and renamed it New Coke before reversing itself: Coca-Cola is not changing the flavor of regular Diet Coke. \n“We’re contemporizing the Diet Coke brand and portfolio with sleek packaging and new flavors that are appealing to new audiences,” said Rafael Acevedo, Coca-Cola North America’s group director for Diet Coke. \nThe new Diet Coke products are sweetened with a new mix of aspartame and acesulfame potassium (ace-k), the same two sweeteners used in Coke Zero Sugar. Last summer, the company stopped selling Coke Zero in the United States, amid fears of sales cannibalization, and replaced it with a product with a different recipe, look and name, Coke Zero Sugar. \nThe moves come as Diet Coke, the third largest carbonated drink brand in the U.S. after regular Coke and regular Pepsi , continues to struggle- in its most recent quarter, Diet Coke sales fell by a mid-single digit percentage . Industry publication Beverage Digest estimates that Diet Coke’s sales as measured by volume not dollar fell about 4.3% in 2017, sharp but less pronounced than that of PepsiCo’s (pep) Diet Pepsi 7.7% drop. The industry’s problems aren’t limited to diet drinks: in 2016, bottled water toppled carbonated soft drinks as the most consumed beverages for the first time. \nAccording to a Beverage Digest report, Coke executives told employees at a town hall that Diet Coke’s want to go after millennials, who number about 79 million, hence the new look and products. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T15:25:00.000+02:00", "crawled": "2018-01-11T00:02:39.017+02:00", "highlightTitle": ""}