{"organizations": [], "uuid": "a36494316063941626a1e30eba011ac389866978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221840824&w=1200&r=LYNXMPEE0D037", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-autoshow-detroit-volkswagen/after-emissions-scandal-volkswagen-on-u-s-comeback-trail-with-all-new-jetta-idUKKBN1F304X", "country": "US", "domain_rank": 408, "title": "After emissions scandal, Volkswagen on U.S. comeback trail with all-new Jetta", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T07:09:00.000+02:00", "replies_count": 0, "uuid": "a36494316063941626a1e30eba011ac389866978"}, "author": "", "url": "https://uk.reuters.com/article/uk-autoshow-detroit-volkswagen/after-emissions-scandal-volkswagen-on-u-s-comeback-trail-with-all-new-jetta-idUKKBN1F304X", "ord_in_thread": 0, "title": "After emissions scandal, Volkswagen on U.S. comeback trail with all-new Jetta", "locations": [], "entities": {"persons": [{"name": "jetta andreas cremer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "detroit auto show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 5:09 AM / Updated 12 hours ago After emissions scandal, Volkswagen on U.S. comeback trail with all-new Jetta Andreas Cremer 5 Min Read \nDETROIT (Reuters) - Volkswagen ( VOWG_p.DE ) will launch an all-new Jetta compact car, its biggest seller in America, at the Detroit Auto Show on Sunday as the German carmaker looks to revive sales in the world’s second-largest auto market and move on from the emissions scandal that has tarnished its reputation over the past few years. FILE PHOTO: A Volkswagen logo is pictured at the International Auto Show in Mexico City, Mexico November 23, 2017. REUTERS/Henry Romero \nThe world’s largest automaker is still grappling with investigations and lawsuits around the world related to revelations that it cheated government emissions tests for diesel-powered vehicles and has already paid $30 billion in fines and costs for the fraud. \nBut there are signs the company is repairing the damage with consumers. Volkswagen brand sales worldwide rose to a record of more than 6 million cars in 2017, two company sources told Reuters ahead of publication of the data on Sunday at the North American International Auto Show in Detroit. \n“Some of our critics thought the diesel crisis would block our view. Instead we have, undeterred by the crisis or rather fired by it, developed our digitisation and electrification strategy,” Audi CEO Rupert Stadler, a member of VW’s executive board, told reporters on Dec. 11. \nIn the United States, VW brand sales rose 5.2 percent in 2017, even as U.S. consumers turned away from smaller cars that are still the brand’s mainstay. \n“We’re back,” Hinrich Woebcken, the new head of the Volkswagen brand in North America, told reporters on the sidelines of the Los Angeles auto show in November. \nSpurred by a perception that the authoritarian culture at VW had been a factor in the cheating, top management has also loosened the reins on the VW empire and decentralized power from its Wolfsburg, Germany headquarters. \nFor example, German native Woebcken said U.S. managers concluded that the original name for an SUV the company planned to launch in America would not work. \nThe original name “started with a T, and then it broke your tongue,” Woebcken said. U.S. Volkswagen executives proposed a simpler name for the U.S. market - Atlas. Wolfsburg management went along. The Atlas, launched from VW’s Tennessee factory last year, accounted for nearly 8 percent of VW brand sales in the U.S. last year. \n“It’s unusual to give a regional name to a product,” Woebcken said. “In terms of VW, it is a pretty big thing.” ELECTRIC VEHICLES, MICROBUS AHEAD \nVW Group CEO Matthias Mueller will stay away from the Detroit auto show next week to let the carmaker’s U.S. leaders present the redesigned Jetta, which represented a third of the brand’s 340,000 U.S. sales in 2017. \nWith a lowered roofline and a new 8-speed automatic transmission, the model is tailored to U.S. design and fuel-economy needs and drew more input from North American engineers than its predecessor, the sources said ahead of the Sunday launch. \nVW’s historical underperformance in the United States was a problem for the company long before “dieselgate” and the failure by top managers to tap the SUV boom and other market trends in 2014 caused labour boss Bernd Osterloh to denounce VW’s U.S. business as a “catastrophe.” \nVW now hopes to reshape its image, in part by persuading environmentally conscious, younger consumers and regulators in its major markets that it is serious about electric vehicles (EVs). VW has raised its planned spending on EVs, self-driving technology and digital mobility businesses across the group to 34 billion euros ($41 billion) through 2022. \nVolkswagen is now betting that a new modular platform dubbed MEB, designed to underpin more than 20 purely battery-powered brand models, will allow it to turn profits on EVs when they launch from 2019, in part because they share parts with other cars built from MEB. \nWoebcken said VW is working now on a decision about where to build future EVs for the United States, including a new VW Microbus promised for 2022. \nVW has been teasing U.S. consumers with Microbus concepts for years, trying to rekindle the warm feelings for the vehicle synonymous with the free-wheeling 1960s. \n“We did not have a clue how to get it industrialized,” Woebcken said. “Now, we have, with the MEB platform. It’s decided. It’s industrialized. It will come.” Reporting by Andreas Cremer; Additional reporting by Joseph White; Editing by Bill Rigby", "external_links": [], "published": "2018-01-14T07:09:00.000+02:00", "crawled": "2018-01-14T07:49:54.026+02:00", "highlightTitle": ""}