{"organizations": [], "uuid": "ea4e02578a285b21e9459fb2d22b019021c2af4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-627161266.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/spectre-safari-chrome-firefox-internet-explorer/", "country": "US", "domain_rank": 1196, "title": "Spectre Chip Attack Works Against Web Browsers Like Safari and Chrome | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-05T15:36:00.000+02:00", "replies_count": 0, "uuid": "ea4e02578a285b21e9459fb2d22b019021c2af4a"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/05/spectre-safari-chrome-firefox-internet-explorer/", "ord_in_thread": 0, "title": "Spectre Chip Attack Works Against Web Browsers Like Safari and Chrome | Fortune", "locations": [], "entities": {"persons": [{"name": "aaron pressman", "sentiment": "negative"}, {"name": "meltdo", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "spectre chip attack works against web browsers like safari", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "advanced micro devices", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "firefox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 1:36 PM EST \nSecurity researchers this week revealed details of Spectre and Meltdown, massive security vulnerabilities found in microprocessors made by Intel , Advanced Micro Devices and others. \nThe attacks take advantage of a features built into modern chips and could allow hackers to craft malware using Spectre that could steal passwords or other confidential data through popular web browsers like Chrome, Internet Explorer, Firefox, and Safari for Macs or iOS. That’s prompted quick action from Microsoft , Google , Apple , and Firefox. What is Spectre? \nSpectre is the name given to two of the three kinds of newly discovered attacks that hackers could use to steal confidential data from computers and mobile devices. While the third attack, known as Meltdown, only runs on Intel chips, Spectre attacks can affect devices with virtually any modern processor. \nThe processors often handle data, like a password or encryption key, that is supposed to be kept from other apps. But to speed up calculations, chips use a technique known as speculative execution to try to guess at some answers that may be needed if a chain of calculations came out a certain way. Because of a predictable delay in the timing of the technique and a chip’s security checks, the researchers found that a rogue app could guess where confidential data was located in a chip’s memory and steal it. \nGet Data Sheet , Fortune’s technology newsletter. Why are web browsers vulnerable to Spectre? \nAn attacker would need to get a nefarious app running on a victim’s computer or phone to steal data using Spectre. The researchers who uncovered the security problems said they developed a successful model attack using one of the two Spectre variations via a Javascript program. So one way hackers could actually get their attack app to run on a victim’s computer is by writing a data stealing Javascript program and posting it on a web site. The victim’s browser app would automatically run the rogue code, assuming it just was an ordinary part of the site’s features. Have any hackers used the attack yet? \nThe researchers who uncovered Spectre say they developed methods to use the vulnerabilities to steal user data (sometimes after being given confidential details of chip design by the chip makers). But no one has yet discovered any actual exploits “in the wild” yet. How can I protect my web browser from Spectre? \nEach browser maker is releasing updates that add new security features and, in some cases, turn off existing features that would make a Spectre attack easier. \nGoogle says Chrome users should turn on a feature called “site isolation” that limits the ability of a rogue Javascript program to get access to sensitive data. The company also said it will release an update on or about Jan. 23 to Chrome’s Javascript feature that will protect better against Spectre attacks, though browser performance may suffer. \nMicrosoft (msft) says it has already issued a Windows security update for its Internet Explorer and Edge browser apps dubbed “KB4056890” to help protect against Spectre. The update changed browser features to make accessing confidential information in a device’s CPU via the timing delays much more difficult, the company said. \nMozilla, the company behind Firefox, said the newest releases of its apps changed several features to make Spectre attacks more difficult. Firefox version 57.0.4, released on Jan. 4, includes the mitigation techniques. But the company said it is studying additional ways to protect even more strongly against the attacks. “In the longer term, we have started experimenting with techniques to remove the information leak closer to the source, instead of just hiding the leak by disabling timers,” Mozilla said in a blog post . “This project requires time to understand, implement and test.” \nApple said it planned to release an update to Safari in “coming days” to protect against Spectre. Apple said early tests of the changes needed showed a minimal impact on browser performance. What about protection from Meltdown attacks? \nThe third kind of attack, known as Meltdown, relies not on the delayed timing of speculative execution but on how chip software may not check if an app has permission to access some data used in speculative execution as a way to speed up performance. So far, Meltdown has only been demonstrated against chips made by Intel , not AMD (amd) . Apple says the attack “has the most potential to be exploited.” \nTo protect against Meltdown, chipmakers and operating system vendors are already issuing patches and updates. Intel (intc) , Google (googl) , and Apple (aapl) , among others, say they have already released recent patches to help protect against the attack. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-05T15:36:00.000+02:00", "crawled": "2018-01-05T20:48:36.005+02:00", "highlightTitle": ""}