{"organizations": [], "uuid": "add4ff735d1e53148775f2ad86a8c5bf471627a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-bulgaria-environment-wwf/wwf-urges-action-against-ski-area-expansion-in-bulgarian-park-idUKKBN1FI1SB", "country": "US", "domain_rank": 408, "title": "WWF urges action against ski area expansion in Bulgarian park", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:24:00.000+02:00", "replies_count": 0, "uuid": "add4ff735d1e53148775f2ad86a8c5bf471627a0"}, "author": "", "url": "https://uk.reuters.com/article/us-bulgaria-environment-wwf/wwf-urges-action-against-ski-area-expansion-in-bulgarian-park-idUKKBN1FI1SB", "ord_in_thread": 0, "title": "WWF urges action against ski area expansion in Bulgarian park", "locations": [], "entities": {"persons": [{"name": "pirin", "sentiment": "none"}, {"name": "veselina kavrakova", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "pirin national park", "sentiment": "none"}], "organizations": [{"name": "wwf", "sentiment": "negative"}, {"name": "wwf bulgaria", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 PM / Updated 17 minutes ago WWF urges action against ski area expansion in Bulgarian park   \nSOFIA (Reuters) - Conservation group WWF stepped up pressure on Bulgaria on Monday to withdraw a decision to allow more construction of ski runs and lifts in a mountainous area home to bears and wolves, saying the UNESCO World Heritage Site should be preserved. \nThousands of environmentalists have staged repeated protests in Sofia and other cities against a government decision to allow further construction in the 400 sq km Pirin National Park in the southwest. \nProtesters say the cabinet’s decision to expand Pirin’s ski area breaches a number of nature protection laws and would lead to the destruction of centuries-old pine trees endangering wildlife at the park - one of Europe’s best preserved homes for large mammals such as brown bears and wolves. \n“Bulgaria’s government cannot simply press on with plans to allow the ski area to increase 12-fold,” said WWF Bulgaria Manager Veselina Kavrakova, after presenting a report by WWF and U.S.-based consultancy Dalberg Global Development Advisors on the sustainable development of the region. \n“It must instead listen to its citizens who are calling for Pirin to be protected. Ski development in pursuit of short-term gains has already taken a shocking toll on Pirin,” she said. \nBulgaria’s environment ministry argues that the changes will allow construction in only two percent of the territory of the park, with the aim of boosting winter tourism. \nThe government says it has also allowed the building of facilities to collect drinking water in 48 percent of the park’s territory. Opponents say this could be used as a loophole to allow bigger construction projects. \nWWF has urged members of the UNESCO World Heritage Committee to include Pirin on UNESCO’s world natural heritage in danger list if the current management plan is approved. \nThe conservation group called on the International Ski Federation (FIS) to exclude the resort of Bansko from its calendar if the construction of ski infrastructure continues. \n“We’re not opposing development, we’re opposing badly planned development,” Katerina Rakovska, a WWF expert said. “We want to keep the balance between the conservation of nature and tourism development.” Reporting by Angel Krasimirov, Editing by William Maclean", "external_links": [], "published": "2018-01-29T16:24:00.000+02:00", "crawled": "2018-01-29T16:55:31.006+02:00", "highlightTitle": ""}