{"organizations": [], "uuid": "5d4bf0cbf9487257354df6b784af2c2b9770ca28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-usa-debt/reports-on-china-slowing-u-s-debt-buying-could-be-based-on-wrong-information-source-idUKKBN1F00BT", "country": "US", "domain_rank": 408, "title": "Reports on China slowing U.S. debt buying could be based on wrong information - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T09:47:00.000+02:00", "replies_count": 0, "uuid": "5d4bf0cbf9487257354df6b784af2c2b9770ca28"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-usa-debt/reports-on-china-slowing-u-s-debt-buying-could-be-based-on-wrong-information-source-idUKKBN1F00BT", "ord_in_thread": 0, "title": "Reports on China slowing U.S. debt buying could be based on wrong information - source", "locations": [], "entities": {"persons": [{"name": "sam holmes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "beijing news room", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:55 AM / Updated 2 minutes ago China says diversifying FX reserves, warns report on U.S. bonds may be 'fake' Kevin Yao 5 Min Read \nBEIJING (Reuters) - China is diversifying its foreign exchange reserves in order to safeguard their value, the country’s currency regulator said on Thursday, while dismissing a media report the government is halting or reducing its purchases of U.S. debt. U.S. Dollar and China Yuan notes are seen in this picture illustration June 2, 2017. REUTERS/Thomas White/Illustration \nBloomberg News reported on Wednesday that Chinese officials reviewing the country’s vast foreign exchange holdings had recommended slowing or halting purchases of U.S. Treasury bonds amid a less attractive market for them and rising U.S.-China trade tensions. \nThat spooked investors worried that sharp swings in China’s massive holdings of U.S. Treasuries would trigger a selloff in bond and equity markets globally. The report sent U.S. Treasury yields to 10-month highs and the dollar lower. \n“The news could quote the wrong source of information, or may be fake news,” the State Administration of Foreign Exchange (SAFE) said in a statement published on its website. \nBloomberg News did not immediately comment on the foreign exchange regulator’s statement. \nThe U.S. 10-year Treasury yield edged down to 2.5366 percent from Wednesday’s close of 2.549 percent, while the dollar gained 0.3 percent to 111.72 yen after the regulator’s comment. \nChina has been diversifying its foreign currency reserves investments to help “safeguard the overall safety of foreign exchange assets and preserve and increase their value”, the SAFE said. \nThe forex reserves investment in U.S. Treasury bonds is a market activity, with investment professionally managed according to market conditions and investment needs, it said. \nThe regulator added that forex reserves management agencies are responsible investors in international financial markets. RISKY MOVE \nEconomists say they expect China to continue to adjust its holdings of U.S. government debt, considered to be the most liquid dollar assets, but few believe dumping U.S. Treasuries is among policy choices to be considered by top leaders. \nTrade tensions between China and the United States are expected to rise as President Donald Trump weighs potential trade actions against Beijing, including broad tariffs or quotas on steel and aluminium and an investigation into Chinese intellectual property misappropriation. \nChinese firms’ business deals with U.S. companies - one involving Alibaba Group Holding Ltd and another involving Huawei Technologies Co - have also recently hit stumbling blocks over national security concerns. \n“We’ve noticed recently that protectionist voices have been rising in the U.S.,” China’s Ministry of Commerce spokesman Gao Feng said at a regular news briefing. \nDumping U.S. debt holdings could roil financial markets and force the United States to scramble for funds, but analysts believe such a move by Beijing would risk starting a fire sale in which the value of its own portfolio would burn. \n“Given our big Treasury holdings, sometimes we sell some and sometimes we buy some, changes will not be very big and there won’t be big impact on markets,” said Xu Hongcai, deputy chief economist at the China Centre for International Economic Exchanges, a Beijing think tank. \n“We should have full confidence in the U.S. Treasury debt market, its depth and capacity are very big,” he said. \nThe exact composition of China’s reserves is a state secret and the subject of intense scrutiny by global investors. \nChina’s foreign exchange reserves, the world’s largest, rose $129.4 billion in 2017 to $3.14 trillion, as tight regulations and a strong yuan continued to discourage capital outflows, data from China’s central bank showed. \nThat marked a turnaround after China burnt through nearly $320 billion in 2016 to defend the yuan, which fell 6.5 percent against the surging dollar. The yuan gained around 6.8 percent versus the dollar last year. \nChina’s holding of U.S. government debt - the world’s largest, climbed $131 billion in the first 10 months of 2017 to $1.19 trillion (881 billion pounds), data from the Treasury Department showed. \nThe debt holdings accounted for 38 percent of China’s total reserves, up from 35 percent at the end of 2016. \nIn 2016, China’s treasury holding tumbled $187.7 billion when the country was briefly dethroned by Japan as the top holder of U.S. government debt, as China’s central bank dipped into its reserve to defend the ailing yuan. Reporting by Beijing Monitoring Desk and Kevin Yao; Additional reporting by Ryan Woo; Editing by Vidya Ranganathan and Jacqueline Wong", "external_links": [], "published": "2018-01-11T09:47:00.000+02:00", "crawled": "2018-01-11T10:00:09.046+02:00", "highlightTitle": ""}