{"organizations": [], "uuid": "ed31e1d5735f9102122bf9bcc2180a592351a17f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-silicon-legal-strategy-welcomes-former-cox-castle-and-wsgr-associate-rebecca-tseng.html", "country": "US", "domain_rank": 767, "title": "Silicon Legal Strategy Welcomes Former Cox Castle and WSGR Associate Rebecca Tseng", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "ed31e1d5735f9102122bf9bcc2180a592351a17f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-silicon-legal-strategy-welcomes-former-cox-castle-and-wsgr-associate-rebecca-tseng.html", "ord_in_thread": 0, "title": "Silicon Legal Strategy Welcomes Former Cox Castle and WSGR Associate Rebecca Tseng", "locations": [], "entities": {"persons": [{"name": "rebecca tseng", "sentiment": "negative"}, {"name": "rebecca", "sentiment": "negative"}, {"name": "tseng", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}], "organizations": [{"name": "silicon legal strategy welcomes former cox castle", "sentiment": "negative"}, {"name": "duke university", "sentiment": "none"}, {"name": "cox castle", "sentiment": "none"}, {"name": "wilson sonsini goodrich & rosati", "sentiment": "none"}, {"name": "castle & nicholson", "sentiment": "none"}, {"name": "silicon legal", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Silicon Legal Strategy today announced that Rebecca Tseng has joined the firm as an associate in its San Francisco office.\nRebecca has extensive experience advising early stage and emerging growth companies as well as venture capital and angel investors on a variety of legal matters. She brings a deep knowledge of day-to-day corporate transactions as well as experience with mergers and acquisitions, debt financings and entity formations.\nPrior to joining Silicon Legal, Rebecca was an associate in the San Francisco office of Cox, Castle & Nicholson, where she worked with real estate developers in the acquisition and financing of affordable housing projects. Prior to Cox Castle, Rebecca was an associate in the Palo Alto office of Wilson Sonsini Goodrich & Rosati, where she worked with private and public companies on corporate governance and transactional matters, including entity formations, venture capital financings, public offerings, and mergers and acquisitions.\nRebecca received her J.D. from Duke University and her undergraduate degrees from the University of California, Berkeley.\n“Silicon Legal is dedicated to its clients and understands their needs because it is a firm that embodies the entrepreneurial spirit. I look forward to advising entrepreneurs, whether it is their first business or their fifth venture, alongside talented colleagues who are business-minded and dedicated to client service,” said Tseng.\n“We are thrilled to have Rebecca join our team” said Andre Gharakhanian, partner at Silicon Legal Strategy. “Rebecca brings a well-rounded approach and great depth of knowledge to our expanding team. We’re excited to kick off 2018 with such a stellar hire and are looking to continue our growth into 2018.”\nAbout Silicon Legal Strategy\nSilicon Legal Strategy is the premier boutique law firm providing targeted, bottom-line-oriented advice to technology startups, innovative entrepreneurs and seasoned investors. Trained at the top firms in Silicon Valley, our attorneys and staff are incredibly passionate about technology and have extensive experience representing early stage companies and investors. We are a known quantity in Silicon Valley, and work with or sit across the table from every major law firm in the area. Perhaps most importantly, we ourselves are entrepreneurs. We truly understand the challenges of a startup -- like building and motivating a team, creating repeatable processes to ensure continued customer satisfaction at scale and dealing with infrastructure issues. We don’t merely observe these challenges as lawyers on the sidelines -- we face them every day -- and as a result, are able to deliver more relevant, bottom-line-oriented advice. Put simply, we actually \"get\" what entrepreneurs are going through.\nContact:\nJaime Madden\nSilicon Legal Strategy\ninfo@siliconlegal.com\n(415) 230-0870\nSource: Silicon Legal Strategy", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/aa8af890-e854-4440-928a-c2ad0dccc973"], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:11:21.002+02:00", "highlightTitle": ""}