{"organizations": [], "uuid": "fa1c6dd0b5156c8501fbaabe05b88f15a457e000", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kingsbury/canadas-kingsbury-awaits-pyeongchang-coronation-idUKKBN1EY1JN", "country": "US", "domain_rank": 408, "title": "Canada's Kingsbury awaits Pyeongchang coronation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:35:00.000+02:00", "replies_count": 0, "uuid": "fa1c6dd0b5156c8501fbaabe05b88f15a457e000"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kingsbury/canadas-kingsbury-awaits-pyeongchang-coronation-idUKKBN1EY1JN", "ord_in_thread": 0, "title": "Canada's Kingsbury awaits Pyeongchang coronation", "locations": [], "entities": {"persons": [{"name": "kingsbury", "sentiment": "negative"}, {"name": "alexandre bilodeau", "sentiment": "none"}, {"name": "jean-luc brassard", "sentiment": "none"}, {"name": "mikael kingsbury", "sentiment": "none"}, {"name": "bilodeau", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 36 PM / Updated 7 minutes ago Canada's Kingsbury awaits Pyeongchang coronation 4 Min Read \nLONDON(Reuters) - It is fair to say Quebec has a proud tradition of producing winning mogul skiers. \nStarting with Jean-Luc Brassard, seen by many as the godfather of modern moguls and the winner of Olympic gold in 1994, through to reigning champion Alexandre Bilodeau, the French-speaking region of Canada has an illustrious history in the discipline. \nNow there is another Quebecois skier ready to take the Olympic crown. \nFour years ago, Mikael Kingsbury had to make do with a silver medal in Sochi as compatriot Bilodeau claimed his second consecutive gold in the men’s moguls. \nSince then Bilodeau has retired, leaving the door open for Kingsbury take over his mantel. It would be an understatement to say Kingsbury has taken advantage of his chance. \nThe 25-year-old has dominated the discipline for four years. \nIn February 2017, Kingsbury claimed his sixth consecutive overall FIS World Cup gold medal. He has also won two Ski World Championship golds and holds the all-time record for the number of World Cup wins and podium finishes. \nIn last year’s World Cup, Kingsbury had almost double the number of points of the man in second place, Benjamin Cavet of France. \nHis supremacy was only challenged last season by Japanese upstart Ikuma Horishima, who claimed double moguls gold at the 2017 World Championships in Sierra Nevada in a surprising result. Kingsbury could only manage bronze. \nKingsbury knows his relentless winning form means he is the man to beat in Pyeongchang. \n“I feel I have a target on my back, like most of the people want to beat me,” Kingsbury told Reuters from his home in Quebec. \n“I won nine out of 11 World Cup races last year so I for sure put myself as the favourite for the games and I know everyone is training hard and wants to be on top for this season.” HIGH EXPECTATIONS \nCanada’s success in the moguls down the years has understandably led to high expectations that Kingsbury will bring home another gold medal from Pyeongchang. \nBilodeau’s back-to-back success at Vancouver and Sochi, as well as gold and silver for the Dufour-Lapointe sisters in the women’s event four years ago, means gold medals in the moguls are demanded at every Olympics by expectant Canadian fans. \nKingsbury is aware of this pressure but knows that if he can replicate his form of the past four years then nobody should be able to touch him in Pyeongchang. \n“Now I have been ranked first in the world since Sochi so there is a bit more pressure to perform well,” admitted Kingsbury. “I would say that people back home and the people that follow me have got used to a high standard of results so I want to show them I can do it at the Olympics.” \n“If I stick to my game plan then I know I put myself in a very good position to be on the podium again and win my first gold medal.” \nKingsbury believes his main rivals at Pyeongchang are likely to come from within his own team. \nCanada had four men in the 2017 World Cup top 10 last season and it would be a shock if the country had no representation on the podium in South Korea. All four of those men come from Quebec. \nKingsbury attributes this success to the unique snow conditions in the region. \n“We have very small mountains there and it is hand-made snow,” said Kingsbury. \n“It is super icing and we don’t have the distraction of powder and big mountains so we stick to moguls and have the great examples like Jean-Luc Brassard and Alex Bilodeau, so growing up watching them we always had someone to look up to.” \nKingsbury admits he is very close to the other members of his team and enjoys training, travelling and competing with them. \nHowever, by the time the Olympics roll around there will only be one thing on Kingsbury’s mind; the final jewel in his crown, an Olympic gold medal. \n“When we are in the start gate it doesn’t matter. You need to forget it is your friend and just do your thing.” \n“Hope they are doing well, just not as good as you. They can have second and third!” Reporting by Jack Tarrant; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-09T15:35:00.000+02:00", "crawled": "2018-01-09T15:45:08.001+02:00", "highlightTitle": ""}