{"organizations": [], "uuid": "bb70e51179e0023895e157cf646ea72166a6ab52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-bonds/treasuries-u-s-curve-flattens-as-two-year-yields-hit-nine-year-high-idUSL1N1PC0O6", "country": "US", "domain_rank": 408, "title": "TREASURIES-U.S. curve flattens as two-year yields hit nine-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-17T23:33:00.000+02:00", "replies_count": 0, "uuid": "bb70e51179e0023895e157cf646ea72166a6ab52"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-bonds/treasuries-u-s-curve-flattens-as-two-year-yields-hit-nine-year-high-idUSL1N1PC0O6", "ord_in_thread": 0, "title": "TREASURIES-U.S. curve flattens as two-year yields hit nine-year high", "locations": [], "entities": {"persons": [{"name": "kate duguid", "sentiment": "none"}, {"name": "ian lyngen", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "bmo capital markets", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Five-year, 30-year spread hits lowest point in over a decade * Two-year yields highest since 2008 By Kate Duguid NEW YORK, Jan 17 - The U.S. yield curve flattened to a decade-low spread between 5-year and 30-year yields and two-year Treasury yields hit a nine-year high on Wednesday on expectations the Federal Reserve will continue to tighten monetary policy this year. This is \"a classic tale of two markets. The front end of the curve is responding to the Fed’s insistence on continuing to hike rates while the longer end of the curve is responding to a more benign global inflation environment,\" said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets in New York. At 44.8 basis points, the spread between 5-year and 30-year yields hit its lowest level since August 2007. The margin between yields of short- and long-dated maturities has compressed as investors price in the expectation that the Fed will continue to raise U.S. overnight interest rates, even as long-term inflation expectations have remained low. Two-year yields, which are the maturity most sensitive to Fed interest rate hikes, have been rising as robust economic data has affirmed the FOMC's hawkish sentiment. Last Friday's stronger-than-expected core CPI report increased the odds of a March rate hike, with the rate futures market pricing in a more than 70 percent chance, according to the CME's FedWatch. The Fed's narrative is \"that as long as financial conditions are easy enough, they’re going to continue to push forward with the process of normalization,\" said Lyngen. As the continuing resolution, or stopgap funding bill, is due to expire Friday, investors will be watching Congress to see if it can put together a funding bill in time to avoid a U.S. government shutdown. If a bill is passed, traders' focus will move to the Treasury's refunding plans, and the first estimate of fourth-quarter gross domestic product on Jan. 26. Also in focus on Wednesday will be a speeches from Fed officials. FOMC voter Cleveland Fed President Loretta Mester is expected to deliver a hawkish message, while non-voter Chicago Fed President Charles Evans is expected to be dovish. Dallas Fed President Robert Kaplan, also a non-voter, will be watched to see if he updates his expectation that three rates hikes in 2018 is the \"base case.\" The Fed is also scheduled to deliver its Beige Book report on Wednesday, which offers an overview of the current economic landscape from each of the Fed's districts. At 9:39 a.m. (1439 GMT), 10-year Treasury yields were 2.556 percent, above Tuesday's close at 2.544 percent. Two-year yields were 2.039 percent, after hitting 2.047 percent earlier in the day, its highest since September 2008. January 17 Wednesday 9:43AM New York / 1443 GMT Price US T BONDS MAR8 150-29/32 0-3/32 10YR TNotes MAR8 122-224/256 -0-28/25 6 Price Current Net Yield % Change (bps) Three-month bills 1.4225 1.4475 0.002 Six-month bills 1.6 1.6355 0.002 Two-year note 99-178/256 2.0349 0.017 Three-year note 99-150/256 2.1436 0.017 Five-year note 98-216/256 2.3738 0.019 Seven-year note 98-120/256 2.4912 0.015 10-year note 97-100/256 2.5518 0.008 30-year bond 98-128/256 2.8246 -0.010 DOLLAR SWAP SPREADS Last (bps) Net Change (bps) U.S. 2-year dollar swap 19.75 -0.25 spread U.S. 3-year dollar swap 19.00 0.25 spread U.S. 5-year dollar swap 5.50 -0.25 spread U.S. 10-year dollar swap 0.75 0.25 spread U.S. 30-year dollar swap -16.50 1.50 spread (Reporting by Kate Duguid; Editing by Phil Berlowitz)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T23:33:00.000+02:00", "crawled": "2018-01-18T16:08:24.000+02:00", "highlightTitle": ""}