{"organizations": [], "uuid": "ebdf4a26f61f9c8436a36cafc70ab86b4ce256be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/03/104196554-Bach_Headshot_2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/self-made-millionaire-tells-millennials-buy-dont-rent-a-home.html", "country": "US", "domain_rank": 767, "title": "Self made millionaire tells millennials buy, don't rent, a home", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-04T18:09:00.000+02:00", "replies_count": 0, "uuid": "ebdf4a26f61f9c8436a36cafc70ab86b4ce256be"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/04/self-made-millionaire-tells-millennials-buy-dont-rent-a-home.html", "ord_in_thread": 0, "title": "Self made millionaire tells millennials buy, don't rent, a home", "locations": [], "entities": {"persons": [{"name": "david bach", "sentiment": "none"}, {"name": "bach", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you're not prioritizing home ownership, you're making a costly mistake, says co-founder of AE Wealth Management and self-made millionaire David Bach. \nIn fact, not buying a home is the single biggest mistake millennials are making, he tells CNBC Make It : \"The most important advice I can tell you right now if you're young is: Don't listen to these people that tell you should rent versus buy.\"\nEven with the tax law changes , he notes, \"buying a home is the escalator to wealth in America. Homeowners are worth forty times more than renters .\"\nCourtesy of David Bach Self-made millionaire and bestselling author David Bach You have to live somewhere for the rest of your life, Bach points out, so you might as well invest in a home that you could own permanently.\nHe crunches the numbers in his bestselling book, \" The Automatic Millionaire \": \"As a renter, you can easily spend half a million dollars or more on rent over the years ($1,500 a month for 30 years comes to $540,000), and in the end wind up just where you started — owning nothing.\n\"Or you can buy a house and spend the same amount paying down a mortgage, and in the end wind up owning your own home free and clear!\"\nshow chapters Real estate mogul: Here's a trick first-time homeowners could use to live for free      9:15 AM ET Tue, 14 March 2017 | 00:53 \"Let's be honest: Renters make landlords rich,\" Bach tells CNBC Make It. \"I want you to make yourself rich, so start by saving money for a down payment now.\"\nHe recommends having a down payment of at least 10 percent, though 20 percent is ideal. The easiest way to reach that amount is to have money automatically taken out of your paycheck or checking account on a regular basis and moved directly into a savings account earmarked specifically for your first home.\nBuying that first home probably means you're not buying your dream home, Bach says, but the way you reach that goal eventually is by prioritizing homeownership now.\n\"The way you build financial security is through real estate, and it starts by buying your first home,\" he tells CNBC Make It.\nReady to buy? Check out:\nHere's how much home you can afford depending on what you earn 8 things to give up if you want to buy your first home 8 steps to take before buying your first home Like this story? Like CNBC Make It on Facebook ! \nVideo by Andrea Kramar \nshow chapters Real estate moguls Sean Conlon and Sidney Torres agree: There is a right amount for a down payment      1:16 PM ET Tue, 27 June 2017 | 01:03", "external_links": [], "published": "2018-01-04T18:09:00.000+02:00", "crawled": "2018-01-04T18:10:38.012+02:00", "highlightTitle": ""}