{"organizations": [], "uuid": "1cb00b8f23a4d4eb743cb2aa0f5658afd6882f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-portage-completes-distribution-of-stock-dividend-of-biohaven-shares.html", "country": "US", "domain_rank": 767, "title": "Portage completes distribution of stock dividend of Biohaven shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:44:00.000+02:00", "replies_count": 0, "uuid": "1cb00b8f23a4d4eb743cb2aa0f5658afd6882f24"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-portage-completes-distribution-of-stock-dividend-of-biohaven-shares.html", "ord_in_thread": 0, "title": "Portage completes distribution of stock dividend of Biohaven shares", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "portage", "sentiment": "none"}], "organizations": [{"name": "portage biotech inc.", "sentiment": "negative"}, {"name": "biohaven pharmaceutical holding company ltd", "sentiment": "none"}, {"name": "american stock transfer & trust company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "ontario securities commission", "sentiment": "none"}, {"name": "stock exchange", "sentiment": "none"}, {"name": "osc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 19, 2018 /PRNewswire/ - Portage Biotech Inc. (\"Portage\" or the \"Company\") ( OTCQB: PTGEF, Canadian Stock Exchange: PBT.U ) is pleased to announce that it has completed the distribution of shares of Biohaven Pharmaceutical Holding Company Ltd (BHVN:NYSE) to all eligible Portage shareholders.\nAll regulatory notices and approvals were filed or obtained for the dividend including an exemption order from the Ontario Securities Commission (the \"OSC\") which permits the distribution to Canadian shareholders. A copy of the OSC order may be viewed at Portage's website: www.portagebiotech.com . The order is also expected to be posted shortly on the OSC website at www.osc.gov.on.ca .\nAmerican Stock Transfer & Trust Company, LLC (\"AST\"), the agent responsible for the dividend distribution has advised the Company that the distribution was initiated on January 16, 2018, the first business day on American markets after the Martin Luther King Jr. holiday.\nRegistered Portage shareholders will receive a DRS (Direct Registration System) statement by mail as evidence that the shares were issued in his/her name. All holders will need to certify either their domestic or foreign status before they can transfer their shares to their brokerage account via DRS. To complete this request, the holders are advised to contact AST Customer Service Dept., at 800-937-5449 or 718-921-8300 upon receipt of their DRS statements from AST.\nAST will credit beneficial shareholders (i.e. those shareholders holding shares through a broker or other financial intermediary) through an electronic book deposit at DTC (Depository Trust Company). The Company has been advised by AST that the deposit process may require several business days to complete.\nAs disclosed in the Company's Information Statement dated January 5, 2018, those Portage shareholders who are entitled to the stock dividend should direct their inquiries to AST or their brokers. Portage does not have any control or involvement in the distribution process.\nAbout Portage\nPortage is engaged in the discovery and development of pharmaceutical and biotech products through clinical \"proof of concept\" with a focus on areas of unmet clinical need. Following proof of concept, Portage will seek to sell or license these products to large pharmaceutical or biotechnology companies for further development and commercialization. Portage has an interest in novel targeted therapies, stem cell therapies, and new indications for older marketed products that have been found to have novel patentable characteristics that bring new value to patients.\nFor further information, contact Kam Shah, Chief Financial Officer, by telephone at (416) 929-1806, by email at ks@portagebiotech.com or through our website, www.portagebiotech.com .\nForward-Looking Statements\nThis news release includes forward-looking statements within the meaning of the U.S. federal and Canadian securities laws. These forward-looking statements involve substantial risks and uncertainties, including statements that are based on the current expectations and assumptions of the Company's management. All statements, other than statements of historical facts, included in this press release, are forward-looking statements. The use of certain words, including the \"believe\", \"could\", \"expect\" and \"will\" and similar expressions are intended to identify forward-looking statements. The Company may not actually achieve the plans and objectives disclosed in the forward-looking statements and you should not place undue reliance on the Company's forward-looking statements. Various important factors could cause actual results or events to differ materially from those that may be expressed or implied by our forward-looking statements. Additional important factors to be considered in connection with forward-looking statements are described in the \"Risk Factors\" section of the Company's quarterly financials and Management Discussion and Analysis and annual Report in Form 20-F filed on SEDAR and EDGAR. The forward-looking statements are made as of this date and the Company does not undertake any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nSOURCE Portage Biotech Inc.", "external_links": ["http://www.portagebiotech.com/", "http://www.osc.gov.on.ca/"], "published": "2018-01-20T00:44:00.000+02:00", "crawled": "2018-01-20T00:44:51.001+02:00", "highlightTitle": ""}