{"organizations": [], "uuid": "b0a6c617b9bcabeddce061cf2aa3aa3d593c2730", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-france-security/french-jail-guards-protest-over-attack-by-convict-facing-9-11-extradition-idUSKBN1F11MM", "country": "US", "domain_rank": 408, "title": "French jail guards protest over attack by convict facing 9/11 extradition", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:31:00.000+02:00", "replies_count": 0, "uuid": "b0a6c617b9bcabeddce061cf2aa3aa3d593c2730"}, "author": "", "url": "https://www.reuters.com/article/us-france-security/french-jail-guards-protest-over-attack-by-convict-facing-9-11-extradition-idUSKBN1F11MM", "ord_in_thread": 0, "title": "French jail guards protest over attack by convict facing 9/11 extradition", "locations": [], "entities": {"persons": [{"name": "ganczarski", "sentiment": "none"}, {"name": "osama bin laden", "sentiment": "none"}, {"name": "christian ganczarski", "sentiment": "none"}], "locations": [{"name": "vendin-le-vieil", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "djerba", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 32 PM / in 4 minutes French jail guards protest over attack by convict facing 9/11 extradition Reuters Staff 3 Min Read \nPARIS (Reuters) - Guards at several French prisons protested on Friday after a scissors-attack on several colleagues by an Islamist militant facing extradition to the United States over the 2001 attacks once he completes a jail term for al Qaeda killings in Tunisia. \nThe guards demanded the resignation of the prison chief at Vendin-le-Vieil in northern France, where Christian Ganczarski hurt three guards with a pair of scissors late on Thursday. The guards also complained about what they see as insufficient staff and resources to handle dangerous inmates. \nGanczarski, a convert to Islam who visited the late al Qaeda leader Osama bin Laden in Afghanistan, is nearing the end of a sentence handed down in 2009 over an attack in which militants killed 21 people at a synagogue on the Tunisian resort island of Djerba. \nA senior prison service official said a significant number of prisons had been affected by the walkouts, which lasted 15-20 minutes. \n“There is hate, they’re fed up, they’re bitter. Our colleagues go to work feeling sick with worry (about being attacked),” said Jean-Francois Forget, a member of the Ufap-Unsa prison union. \nPrison guard sources say Ganczarski was informed a few days ago of plans to extradite him to the United States, where he is wanted over the airliner attacks that killed 3,000 people on Sept. 11, 2001 -- attacks that prompted the U.S. invasion of Afghanistan and the killing of bin Laden by U.S. special forces. \nThe Vendin-le-Vieil prison, which is about 200 km (125 miles) north of Paris, is also where France plans to temporarily rehouse the main surviving suspect of an Islamist group that killed 130 people in Paris in November 2015 - Salah Abdeslam. \nFrance is part of a U.S.-led coalition whose warplanes are bombing the Syrian and Iraqi bases of Islamic State, the militant group which has risen to dominance in al Qaeda’s place since the killing of bin Laden in 2011. \nFootage aired at his 2009 trial in France showed Ganczarski in 2000 alongside bin Laden and Mohamed Atta, one of the leaders of the 9/11 attacks on New York. \nPolice files seen by Reuters describe Ganczarski, who is of Polish descent but has German nationality, as the man who was in charge of al Qaeda’s short-wave communications network. Reporting By Brian Love and Simon Carraud; Editing by Richard Lough and Gareth Jones", "external_links": [], "published": "2018-01-12T15:31:00.000+02:00", "crawled": "2018-01-12T15:45:03.003+02:00", "highlightTitle": ""}