{"organizations": [], "uuid": "e56bd6140538e83ff968ff8c85fde69c2f236083", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-ppd-names-colin-hill-ceo-of-gns-healthcare-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "PPD Names Colin Hill, CEO of GNS Healthcare, to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-03T17:10:00.000+02:00", "replies_count": 0, "uuid": "e56bd6140538e83ff968ff8c85fde69c2f236083"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-ppd-names-colin-hill-ceo-of-gns-healthcare-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "PPD Names Colin Hill, CEO of GNS Healthcare, to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "colin hill", "sentiment": "negative"}, {"name": "hill", "sentiment": "none"}, {"name": "david simmons", "sentiment": "none"}], "locations": [{"name": "wilmington", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "ppd", "sentiment": "negative"}, {"name": "gns healthcare", "sentiment": "negative"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, N.C.--(BUSINESS WIRE)-- Pharmaceutical Product Development, LLC ( PPD ) today announced that Colin Hill has been named to the company’s board of directors . Hill is the chairman, chief executive officer and co-founder of GNS Healthcare , a leading precision medicine company.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180103005666/en/\nPPD has named Colin Hill to the company’s board of directors. Hill is the chairman, chief executive officer and co-founder of GNS Healthcare, a leading precision medicine company. (Photo: Business Wire)\n“Colin Hill is a renowned voice in health care technology and pioneer in precision medicine, and he brings to our company impressive leadership experience in commercializing machine learning technologies in the biopharmaceutical and managed care industries,” said David Simmons, chairman and chief executive officer of PPD. “He is an excellent addition to our board because, like PPD, he has a keen focus on using technological innovations, real-world evidence and patient-centric solutions to improve patient health.”\nHill co-founded GNS Healthcare in 2000 out of Cornell University, and GNS remains committed to leveraging the latest innovations in machine learning, computing and mathematics to transform biomedical and health care data into solutions and treatments that dramatically reduce the burden of human disease.\n“I am honored to join the PPD board and look forward to collaborating with such a leading-edge organization,” Hill said. “PPD’s commitment to transforming the drug development process by leveraging data and innovative technology is resulting in the accelerated launching of new drugs to market, which translates into improved health outcomes for patients.”\nIn addition to PPD, Hill serves on the board of mobile health information company Biotelemetry Inc. (NASDAQ: BEAT). He is also a founding board member of TMed (Transforming Medicine: The Elizabeth Kauffman Institute), a non-profit foundation dedicated to the advancement of personalized medicine. In 2016, he was appointed by Massachusetts Gov. Charlie Baker to the Massachusetts Digital Health Council.\nHill was a founding member of the board of directors of AesRx, a biopharmaceutical company devoted to the development of new treatments for sickle cell disease. He also was the founding chairman of O’Reilly Media’s Strata Rx in 2012, the industry’s first health care big data conference. In 2004, Hill was named to MIT Technology Review’s TR100 list of the top 100 innovators in the world under the age of 35.\nHe is a frequent speaker at national and international scientific and industry conferences, and has appeared in numerous publications and television programs, including The Wall Street Journal, CNBC’s Morning Call and SquawkBox, Nature, The Boston Globe, Politico, Forbes, Wired and The Economist.\nHill earned a bachelor’s degree in physics from Virginia Tech, as well as master’s degrees in physics from both McGill University and Cornell University.\nAbout PPD\nPPD is a leading global contract research organization providing comprehensive, integrated drug development, laboratory and lifecycle management services. Our clients and partners include pharmaceutical, biotechnology, medical device, academic and government organizations. With offices in 47 countries and approximately 20,000 professionals worldwide, PPD applies innovative technologies, therapeutic expertise and a firm commitment to quality to help clients and partners bend the cost and time curve of drug development to deliver life-changing therapies that improve health. For more information, visit www.ppdi.com .\nAbout GNS Healthcare\nGNS Healthcare solves health care’s matching problem for leading health plans, biopharma companies, and health systems. We transform massive and diverse data streams to precisely match therapeutics, procedures and care management interventions to individuals, improving health outcomes and saving billions of dollars. Our causal learning and simulation platform, REFS, accelerates the discovery of what works for whom and why. To learn more, visit www.gnshealthcare.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005666/en/\nPPD\nMedia:\nRandy Buckwalter, +1-919-456-4425\nrandy.buckwalter@ppdi.com\nor\nInvestors:\nNate Speicher, +1-910-558-6783\nnate.speicher@ppdi.com\nSource: Pharmaceutical Product Development, LLC (PPD)", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ppdi.com%2F&esheet=51737115&newsitemid=20180103005666&lan=en-US&anchor=PPD&index=1&md5=c23c3263000fb85a2fae01551989616c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ppdi.com&esheet=51737115&newsitemid=20180103005666&lan=en-US&anchor=www.ppdi.com&index=4&md5=a0370411c72b43efab43316cfd678846", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gnshealthcare.com%2F&esheet=51737115&newsitemid=20180103005666&lan=en-US&anchor=GNS+Healthcare&index=3&md5=cf36a637cc30736f55e8a7bc685906c8", "http://www.businesswire.com/news/home/20180103005666/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gnshealthcare.com&esheet=51737115&newsitemid=20180103005666&lan=en-US&anchor=www.gnshealthcare.com&index=5&md5=43c024b2d06cb953d80a76ea667c6ca6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ppdi.com%2Fabout%2Fboard-of-directors&esheet=51737115&newsitemid=20180103005666&lan=en-US&anchor=board+of+directors&index=2&md5=4c1b08efe2f951043e7c098fff02590c"], "published": "2018-01-03T17:10:00.000+02:00", "crawled": "2018-01-03T18:44:07.030+02:00", "highlightTitle": ""}