{"organizations": [], "uuid": "e0eb34228e178e7c46669cd69a2e86c88678c3f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/lifestyle\r", "section_title": "Reuters: Lifestyle", "url": "https://www.reuters.com/article/us-britain-france-tapestry/after-950-years-france-to-lend-bayeux-tapestry-to-britain-idUSKBN1F60T7", "country": "US", "domain_rank": 408, "title": "After 950 years, France to lend Bayeux Tapestry to Britain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:48:00.000+02:00", "replies_count": 0, "uuid": "e0eb34228e178e7c46669cd69a2e86c88678c3f5"}, "author": "", "url": "https://www.reuters.com/article/us-britain-france-tapestry/after-950-years-france-to-lend-bayeux-tapestry-to-britain-idUSKBN1F60T7", "ord_in_thread": 0, "title": "After 950 years, France to lend Bayeux Tapestry to Britain", "locations": [], "entities": {"persons": [{"name": "tom tugendhat", "sentiment": "none"}, {"name": "michel rose", "sentiment": "none"}, {"name": "william the conqueror", "sentiment": "none"}, {"name": "estelle shirbon", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "elysee palace", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "bayeux tapestry", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS/LONDON (Reuters) - France will lend Britain the Bayeux Tapestry, an 11th century treasure that tells the tale of how William the Conqueror came to invade England in 1066, an official at the presidential Elysee Palace in Paris said on Wednesday.\nThe announcement, a day before French President Emmanuel Macron is due to visit Britain for talks with Prime Minister Theresa May, was greeted with enthusiasm in Britain where the tapestry has powerful historical resonance.\n“This is huge. This is an extraordinary diplomatic outreach by the president of France and a fantastic gesture of goodwill from one of our nearest and closest allies,” said lawmaker Tom Tugendhat, chair of parliament’s foreign affairs committee.\n“It’s a fantastic opportunity for the British people to see one of the seminal works in our national history,” he said during an interview on BBC radio.\nThe 70-metre long tapestry, whose precise origins are obscure and which has not left France in its nearly 950-year known history, is currently on display in the town of Bayeux, in the northwestern French region of Normandy.\nThe Elysee official said the loan was agreed in principle but would not take place for several years because work needed to be done on the tapestry to ensure it was safe to move it.\n“It’s very symbolic for France and maybe even more for the UK,” he said.\nThe invasion of England by Duke William of Normandy, better known as William the Conqueror, and his victory over the Anglo-Saxon King Harold at the Battle of Hastings, changed the course of English history.\nThe Norman conquest transformed England’s language, laws, customs and architecture, and Queen Elizabeth is the 40th monarch in a royal line that traces its origin back to William the Conqueror.\n“EMMANUEL THE CONQUEROR”\nThere is no consensus on where the tapestry was made. Some researchers believe it was made in Kent, southern England, but many others have pointed to locations in France.\nMay is likely to hail the loan as a sign of the strong friendship between Paris and London, which like Britain’s relations with other European nations is under strain because of the United Kingdom’s looming exit from the European Union.\nThe Elysee official said the loan fitted into Macron’s strategy for the revival of European sovereignty and democracy, detailed in a speech in Athens in September last year during which he spoke about the importance of cultural and historic ties between European nations.\n“The president had insisted during his speech in Athens on a Europe of culture and the arts, and it’s important to put this in practice with our British neighbors to symbolize the strength of our historical relationship,” said the official.\nThe Times newspaper’s cartoonist Peter Brookes linked Bayeux and Brexit in his offering in Wednesday’s edition, which was drawn in the style of the tapestry.\nIt depicted Macron as “Emmanuel the Conqueror” riding forth with a confident smile as May, brandishing a Brexit banner, received an arrow in the eye -- the fate that befell King Harold according to the tapestry.\nBritain’s foreign minister Boris Johnson was depicted slumped forward on a horse with two arrows in his bottom.\nAdditional reporting by Jean-Baptiste Vey in Paris, writing by Estelle Shirbon; editing by Guy Faulconbridge\n ", "external_links": [], "published": "2018-01-17T19:48:00.000+02:00", "crawled": "2018-01-17T20:19:14.016+02:00", "highlightTitle": ""}