{"organizations": [], "uuid": "35218989db0ad2ea9da5a4d284c67e15f41ed7cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220820265&w=1200&r=LYNXMPEE090QW", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-election-polls/berlusconis-coalition-rises-in-polls-ahead-of-italian-vote-idUSKBN1EZ1F4", "country": "US", "domain_rank": 408, "title": "Berlusconi's coalition rises in polls ahead of Italian vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:48:00.000+02:00", "replies_count": 0, "uuid": "35218989db0ad2ea9da5a4d284c67e15f41ed7cd"}, "author": "", "url": "https://www.reuters.com/article/us-italy-election-polls/berlusconis-coalition-rises-in-polls-ahead-of-italian-vote-idUSKBN1EZ1F4", "ord_in_thread": 0, "title": "Berlusconi's coalition rises in polls ahead of Italian vote", "locations": [], "entities": {"persons": [{"name": "berlusconi", "sentiment": "negative"}, {"name": "silvio berlusconi", "sentiment": "none"}, {"name": "carlo buttaroni", "sentiment": "none"}, {"name": "tecne", "sentiment": "none"}, {"name": "isla binnie", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "min read  rome", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "ipr", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 12:50 PM / Updated 6 minutes ago Berlusconi's coalition rises in polls ahead of Italian vote Isla Binnie 4 Min Read \nROME (Reuters) - A center-right coalition around former prime minister Silvio Berlusconi’s party is steadily climbing in opinion polls as a campaign heats up for Italy’s elections on March 4. \nSurveys conducted by Tecne and IPR showed the centre-right far outstripping both a center-left coalition led by the ruling Democratic Party (PD), and Italy’s single most popular party, the anti-establishment 5-Star Movement. \nItaly’s complex electoral mix of proportional representation and first-past-the-post makes a hung parliament likely, stoking fears political instability could stunt a modest recovery in the euro zone’s third-largest economy. \nBut Berlusconi’s group looks “very close” to being able to obtain a parliamentary majority, said Tecne chairman Carlo Buttaroni. \nThe four-time prime minister cannot personally stand for office because of a 2013 conviction for tax fraud. \nSupport from 39.2 percent of voters in the Tecne poll takes it toward the 40 percent which is considered the necessary base for a bloc to have a realistic chance of governing alone. The IPR poll gave it 38 percent. \nAs well as clearing this threshold, a party or coalition must beat the second-placed hopefuls by more than 12 percentage points, Buttaroni said. Both Tecne and IPR showed the second-placed 5-Star lagging by 10 percentage points or more. \nAs support for the PD erodes, 5-Star now comfortably beats it as the most popular party, with a lead of six points according to IPR and more than seven according to Tecne. \nParties across the spectrum have pledged to change or scrap European Union budget rules, cut taxes and spend more. \nBerlusconi’s Forza Italia (Go Italy!) and its main ally, the anti-immigration Northern League, have also pledged to change or abolish reforms of pensions and the labor market which have been welcomed by the European Union. \nFollowing a joint pledge over the weekend to halt planned increases in the retirement age, Berlusconi was asked on Wednesday by state radio RAI whether he would scrap the “Jobs Act” that was the flagship reform of former prime minister Matteo Renzi. \nBerlusconi said, “Yes, because it was an injection that gave a temporary boost, but only to fixed-term contracts.” All of the jobs created in the three months to November last year were temporary contracts, data showed on Tuesday. \nSupport for the PD has slumped to 22.0 percent according to IPR and 20.7 percent according to Tecne. Adding in their allies, the whole center-left coalition scores 27.5 percent and 25 percent in the respective polls. \nRenzi is leading the PD into the election a little more than a year after resigning when Italians voted against a constitutional reform he proposed in a referendum. \n“For the PD (and voters), it’s like two people who were once in love,” Buttaroni said. “The referendum was like a break-up, then every attempt to rebuild that relationship is irritating.” \nDespite being set to get more votes than any other party, 5-Star’s opposition to coalition-building means it is considered unlikely to get the first chance to try to form a government. Additional reporting by Francesca Piscioneri and Gavin Jones; editing by Andrew Roche", "external_links": [], "published": "2018-01-10T14:48:00.000+02:00", "crawled": "2018-01-10T15:00:43.007+02:00", "highlightTitle": ""}