{"organizations": [], "uuid": "d5ec271f6ad6ab18f29a5211ba6d12edc1f68994", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/she-02-18-appomatic-platform.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/royal-dutch-shell-lower-oil-prices/", "country": "US", "domain_rank": 1196, "title": "Shell: How It's Remaking Itself for a World of Low Oil Prices | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.662, "site_type": "news", "published": "2018-01-25T08:30:00.000+02:00", "replies_count": 0, "uuid": "d5ec271f6ad6ab18f29a5211ba6d12edc1f68994"}, "author": "Jeffrey Ball", "url": "http://fortune.com/2018/01/24/royal-dutch-shell-lower-oil-prices/", "ord_in_thread": 0, "title": "Shell: How It's Remaking Itself for a World of Low Oil Prices | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeffrey Ball January 24, 2018 \nLast March, Royal Dutch Shell said it was selling most of its stake in Canada’s oil sands, a vast project that has extracted millions of barrels of sticky, gooey hydrocarbons from the ground in a process that resembles mining more than drilling. The oil and gas giant announced that it was unloading its oil-sands assets, for $7.25 billion, so that it could double down on businesses “where we have global scale and a competitive advantage.” \nLeft unsaid was a deeper reason for the divestiture. Months of deliberations behind closed doors at Shell headquarters in The Hague, Netherlands, had led the top brass at the world’s largest non-state-owned oil company by sales to conclude that the energy industry was changing fundamentally—in a way that could turn the profitable oil-sands operation into a liability. \nInternal studies by a group of analysts within Shell known as the “scenarios” team had concluded that global demand for oil might peak in as little as a decade—essentially tomorrow in an industry that plans in quarter-century increments. Hastening the peak was an onslaught of increasingly competitive fossil-fuel alternatives, from solar and wind power to electric cars, whose prices were dropping far faster than Shell executives had expected. When the oil-demand peak came, Shell believed, petroleum prices might begin a slow slide, dipping too low to cover the costs of oil-sands production. Part of Shell’s Athabasca oil sands project in Alberta, Canada. Shell agreed last year to sell most of its stake in the oil sands to Canadian Natural for $7.25 billion. John Ulan—Shell \nThis wouldn’t be just another oil-price cycle, a familiar roller coaster in which every down is followed by an up. It would be the start of a decades-long decline of the Oil Age itself—an uncharted world in which, in a phrase gaining currency at Shell, oil prices might be “lower forever.” \nIf that scenario materialized, and you were stuck holding the oil sands, Jeremy Bentham, the head of Shell’s scenarios team, tells me, reprising in his British lilt the gist of a memo he wrote to his boss not long before the company decided on the sale, “you were—gosh, forgive me—fucked.” \nShell—a cash machine that racked up $9 billion in profit in the first nine months of 2017; a colossus that employs 90,000 people in more than 70 countries; a corporation that, were it a nation, would have the world’s seventh-largest carbon footprint, behind Germany; and the No. 7 company on Fortune ’s Global 500 list last year, with $240 billion in sales—is in an existential squeeze. It has concluded that oil demand is likely to peak sometime between the late 2020s and the late 2040s because of an epic shift underway in the energy industry: a transition from petroleum to electricity. \nFueling this shift are newly affordable alternatives to oil and gas—notably solar power, wind power, and batteries. Adding to it are ever tougher government constraints on greenhouse-gas emissions: Europe, China, and much of the rest of the developing world are moving to curb carbon even as President Trump pulls the U.S. out of the Paris climate accord. \nIf Shell failed to prepare for this new energy landscape, it could wind up saddled with massive stranded assets: buried oil and gas that its shareholders paid billions to find, but that, because of softening demand, the company found itself unable to profitably drill and sell. \nBen van Beurden, Shell’s CEO, vows that won’t happen. “We won’t be sitting ducks,” the 59-year-old Dutchman tells me in an interview in his corner office at The Hague. “We are going to adapt.” \nThe problem is that the right path forward for the oil majors is less clear than ever before. In the past, “there was a funnel of outcomes that we had to navigate in, where a conservative approach could still work,” says van Beurden. “What is a challenge at the moment,” he says, “is that we don’t know anymore where the future will go.” \nSo the oilman is making some big strategic bets. If they work, he’ll remake Shell for an era in which petroleum no longer is the chief lubricant of the global economy. He’ll transform Big Oil into Big Energy. \nHis first move is to slash the costs of his operation in an attempt to position Shell better than its competitors to profitably ride Oil Age’s tail. Shell expects global demand for natural gas to keep rising for several decades. But van Beurden has been slimming down his portfolio of oil projects with the intent of keeping only those lean enough to make good returns in a world in which oil prices average no more than $40 a barrel, well below the average price over the past decade. \nShell has been selling off billions of dollars worth of projects, including the oil sands, that it believes can’t meet its new low-cost bar. It is redesigning its deepwater oil platforms and onshore shale-gas projects to simplify them, a major cultural change at a firm that has long prided itself more for engineering prowess than for economic discipline. And, over the past two years, the company has laid off about 12% of its workforce, or 12,500 employees, many of whom joined Shell figuring they’d have a job for life. That cutting isn’t over yet. \nVan Beurden’s second gambit is harder. He is pushing to position Shell as a major force—the first truly global player, he hopes—in the Age of Power. He is moving Shell, which tried and failed in earlier renewable-energy forays, into a deeper round of them, part of a broader push into selling electricity. Shell is building an offshore wind farm in the North Sea; it’s part of consortia installing solar farms in Oman and California; and it has bought one of Europe’s biggest electric-car-charging firms and a major British electricity provider. The hull of the Shell deepwater oil platform Appomattox arriving in Ingleside, Texas, in October for final assembly. It will operate in the Gulf of Mexico and has been pared down to be profitable with oil at $50 per barrel. Courtesy of Shell \nSo far, these are tiny moves in the context of the Shell behemoth. The company says it plans by 2020 to raise annual spending on what it calls “new energies” to between $1 billion and $2 billion—a sum that, assuming it materialized, would account for between 4% and 8% of the $25 billion that Shell has estimated as its total capital spending in 2017. Van Beurden vows the renewable-energy investment will increase significantly over time as he moves toward his endgame: pumping vastly more renewables through the global network that Shell uses to produce, trade, and sell energy. \nShell said in late November that it aspires to cut the carbon intensity of its energy operations and of the energy products it sells by 20% by 2035 and “around half” by 2050. Investors concerned about corporate climate risk had urged Shell to take more action to quantify and mitigate its exposure, though the company says its move was already in the works. Shell’s move is part of van Beurden’s bid to preserve Shell’s ability to do in the post-oil era what it has done for the past century: mold and exploit energy markets to pick off maximum profit at every stage. The difference is that, in the future, Shell will need to run its network less on dirty molecules and more on clean electrons. \n“This is a matter of, How do you actually build a whole new industrial complex where electricity is the main way of doing things?” says van Beurden. “We are not going to play in this space in an experimental way. We’re going to play in this space with conviction to win.” \nShell’s scramble underscores unprecedented pressures across the oil industry. “The energy market is changing more rapidly than we could have imagined, and it’s changing because the costs of competitive fuels are coming down,” says Simon Flowers, chief analyst at Wood Mackenzie, who predicts global demand for gasoline and diesel fuel will peak as early as a decade from now and “certainly” by 2030. “If you’re faced with eventually displacing your core product of oil and gas production with something new, it’s an enormous task, and it will take a long time. You’ve just got to put yourself in a position to do so when you can—and without blowing too much shareholder value now.” \nOther major oil companies are attempting this shift and finding it tough. Total, the French oil firm, spent $1.37 billion to buy a 60% stake in SunPower, a major California-based solar-panel maker, in 2011, and another $1.1 billion to buy Saft, a French battery maker, in 2016. SunPower’s stock price has fallen by more than half from the deal price, largely because of intensifying competition in the solar sector, and the battery business too is growing more cutthroat. Norway’s Statoil is investing in offshore wind farms, leveraging its expertise building offshore oil rigs, and investing in research into capturing and storing carbon dioxide. \nThe surge in energy alternatives is upending established industries all across the global economy. Major electricity producers have been forced to restructure in a bid to stanch losses as material numbers of customers put solar panels on their roofs and thus buy less power from the grid. And leading automakers that not long ago laughed off electric cars as a pipe dream are now scrambling to boost production of them. \nThose firms didn’t see the revolution coming, at least not soon enough. It’s the job of Bentham, the ­scenarios chief, to make sure Shell doesn’t make the same mistake. \nThe 59-year-old Oxford graduate is known within Shell as Professor Bentham. The moniker suits, because Bentham looks more don than exec. On the afternoon I walk into his office, he is sitting alone at an oval table, dressed in a baggy gray suit and running shoes, jotting notes on an electronic tablet. \nOne wall of his red-carpeted office is lined with several hundred books. Another is covered with papers and artifacts. One framed plaque contains a drawing of a dodo. Dutch sailors discovered the bird on the island of Mauritius in the 17th century. But as the dodo’s habitat was destroyed, the bird died out. The dodo, “a once powerful bird,” was hit with a change in its environment and “was unable to respond,” warns the plaque, which has been handed down from one Shell scenarios head to another for the past four decades. “The dodo is now EXTINCT.” \n“I am tasked,” Bentham tells me, “with making sure that Shell isn’t a dodo.” “I am tasked,” says the oil major’s top futurist about the existential challenge ahead, “with making sure that shell isn’t a dodo.”-Jeremy Bentham, Shell scenarios leader Jeffrey Ball \nMore than five years ago, Bentham says, he and his team began to flag to Shell executives changes afoot in the economy that, they believed, might dramatically affect the oil business. Among them: the rise of electric cars. With oil selling for around $100 a barrel and gasoline prices high, sales of cars that plugged in rather than filled up were beginning to climb. But times were flush in the oil industry, and such concerns struck some at Shell as overblown. \nThen, in October 2012, van Beurden was promoted from head of Shell’s chemicals business to downstream director, running the part of the business that, among other things, sells gasoline. Bentham recalls that van Beurden soon asked Bentham and his team a question: “Pushed to the extreme, how quickly could electric vehicles come?” \nOn Jan. 1, 2014, van Beurden became Shell’s CEO. For the first nine months of his tenure, oil prices hovered comfortably between $90 and $100. Then, in the fall, they began to dive. It wasn’t until February 2016 that they bottomed out, at $29 a barrel. Shell CEO Ben van Beurden at the company’s offices in London in September 2017. Ed Robinson—Shell \nBut something strange happened as oil prices fell: Electric-vehicle sales nevertheless kept climbing. Between 2014 and 2016, they more than doubled, from 323,000 to 753,000, according to the International Energy Agency. Similarly, IEA figures show, between 2015 and 2016, the percentage of global electricity produced by wind and solar rose from 4.5% to 5.2%—a major jump in a single year. Alternative technologies were getting more affordable. \nBetween 2010 and 2016, according to the U.S. National Renewable Energy Laboratory, the average costs of electricity from a residential solar system and from a wind farm fell about 60% in the U.S. During the same period, according to Bloomberg New Energy Finance, the price of lithium-ion batteries, a type commonly used in electric cars, dropped 73%. \nIn late 2016, Bentham and his team sensed a structural change was afoot in the energy market—something more profound than just another ephemeral oil downturn. Nicolas Rapp \nBentham, who appreciates the power of a pithy phrase to move his multinational’s mindset, began referring within Shell to a new era for the global oil industry, one of “radical uncertainty.” The phrase had been popularized earlier that year in a book by Mervyn King, a former governor of the Bank of England. It also borrowed from the thinking of famed 20th-century economist John Maynard Keynes. \nBetween late 2016 and early 2017, Bentham’s team put together four scenarios to try to help make sense of how Shell might navigate the radical uncertainty. The company calls them the “Four Worlds.” \nDiagrammed, the scenarios form a quadrant. One axis is global demand for energy of all sorts. The other axis is the penetration of technologies—solar, wind, electric vehicles, and others—that reduce demand for fossil fuels. Nicolas Rapp \nIf the quadrant with high energy demand and low technology is the world that materializes, Shell’s modeling suggests, global oil demand won’t peak until perhaps the late 2040s. Under this scenario, by 2040 global energy demand will be significantly larger than it is now; oil, coal, and natural gas each will account for about one-quarter of total demand, and solar and wind together will account for roughly 5%. Shell calls this scenario “Live Now.” \nBut if the quadrant with low energy demand and high technology is the future that comes to pass, global oil demand might peak as early as the mid-2020s. By 2040, global energy demand will have grown far less; oil and gas each will account for about one-quarter of the total, coal for about a fifth, and wind and solar for roughly 15%. And the total energy pie will be smaller, because humanity will have become far more energy-efficient. It’s this scenario that could most rock Shell’s business. Shell’s name for it: “Brave New World.” \nShell doesn’t have a clue which of the Four Worlds will come true. And that is its dilemma. \nThe acceptance of the notion that global oil demand will peak within a generation is mind-blowing given that, just a decade ago, the chatter in the energy world was about a coming peak in oil supply. But the fact that the brightest minds in the oil business must concede they don’t know whether the inflection point will come in the 2020s or the 2040s—or exactly what might take oil’s place—is even more discombobulating for them. \nIn the analysis of Guy Outen, 57, an Australian with close-cropped hair and a serious motorcycle habit who, as Shell’s executive vice president for strategy, is paid to help Shell clarify this future, the energy landscape has shifted from “complicated to complex.” “I am tasked,” says the oil major’s top futurist about the existential challenge ahead, “with making sure that Shell isn’t a dodo.” - Jeremy Bentham, Shell scenarios leader \nSince 1971, though the size of the global energy pie has more than doubled, the relative size of the fossil-fuel slice has remained fairly constant, at between 80% and 85%. It has, Outen says, been a “complicated” world—one where the variables are clear and the answer “is something that with good maths and a good brain you can solve for.” \nBut a “complex” world is a different and darker place. In it, the most basic contours of tomorrow’s energy landscape are opaque. “There are multiple future paths to a general direction which itself isn’t even set in stone,” says Outen. \nAs Shell picks a path forward, it’s trying to hedge its billion-dollar bets. Or, as Bentham likes to say, borrowing another phrase from academic economic theory, Shell’s challenge is to “minimize the maximum regret.” \nThat starts with whipping into shape Shell’s oil and gas business, an empire that is mind-bogglingly big, hard to wrangle, and risky. \nIt features wells in the Gulf of Mexico off Texas and in the Atlantic Ocean off Brazil that Shell drills two miles beneath the sea floor with an accuracy of inches. It includes monster liquefied-natural-gas plants — among them one off the coast of Australia that Andy Brown, Shell’s director of “upstream,” or exploration-and-production, activities, describes to me as “the largest thing man has built that floats.” It encompasses aging projects in the North Sea, factory-like shale fields from Texas to Pennsylvania, and, oh, by the way, 43,000 gas stations ringing the planet—a larger retail network than that of either McDonald’s (mcd) or Starbucks (sbux) x. \nSome green optimists portray this fossil-fuel infrastructure as itself a fossil—a relic that renewables are about to render unnecessary. Van Beurden calls that “fundamental economic nonsense,” and most energy analysts agree with him. The International Energy Agency, which says that global oil demand could peak around 2020 if governments adopted particularly green policies, predicts that even if it happened, oil still would account for 23% of total global energy in 2040, down from 32% in 2016. In other words, even after oil demand peaks, the Oil Age is likely to have a decades-long tail. But riding it profitably requires radical action today. “What is a challenge at the moment,” says the Shell CEO, “is that we don’t know anymore where the future will go.” \nA big Shell energy project can require investing $10 billion on the front end—with the understanding that profits, assuming they materialize as planned, probably won’t come for a decade or more. Recently, in a move that is wonky but has massive repercussions, Shell enlarged the accounting toolbox it uses to decide which oil projects to invest in. \nTraditionally, Shell has weighed prospects on their “net present value,” essentially how much money a project will spit out now. That’s a sensible metric under a worldview in which tomorrow will look pretty much like today. But because Shell has come to believe that tomorrow will look fundamentally different—that it must adjust to the possibility that oil prices will be “lower forever”—it has begun using an additional accounting method. Called the “value-investment ratio,” it assesses the minimum oil price a project will need in order to throw off, far into the future, Shell’s desired level of return. \n“In other words, how resilient is this project against a low-price world?” says Brown, Shell’s upstream director. “That’s a very different mindset.” \nThe Hague is where Shell’s top executives sit, but Houston is the soul of Shell, the place where the company’s engineering swagger runs free. Along a stretch of 12-lane highway on the west side of Houston, a strip of blacktop straddled by so many oil and gas firms that it’s known locally as the “energy corridor,” sits the sprawling campus that’s home to Shell’s deepwater operations. \nBuilding D houses most of the Gulf of Mexico teams. The building’s inside walls are covered with what amounts to petroleum porn: floor-to-ceiling glamour shots of offshore rigs. A counter atop a file cabinet is strewn with drillers’ toys: an assortment of underwater valves and fittings. \nNow Shell is cutting this culture with a sharp accounting knife. One of the first patients: a prospective Gulf of Mexico oil project called Vito. \nVito was first designed in early 2014, when oil was trading around $100 a barrel. Shell engineers gave it maximal bulk, sparing little expense to ensure it could pull oil out of the seabed fast and hard. But by 2015, with oil prices having cratered, the technological wonder that was Vito appeared a poster child for an overconfident industry—an expensive relic. LOWER PROFILE: Shell’s Appomattox oil platform, capable of reaching 175,000 barrels of oil per day, will soon be active in the Gulf of Mexico. An even more slimmed-down plan for the proposed Vito platform shows how Shell is right-sizing its capital investments. \nThat fall, with oil prices continuing to fall, Wael Sawan, who grew up in Dubai, graduated from Harvard Business School, and did a stint as an investment banker at Goldman Sachs , was named Shell’s executive vice president for deepwater. He was all of 41. \nVito had been designed with a rough assumption of a long-term oil price around $80 a barrel. In early 2016, the new young boss told the team Vito was dead unless they could slim it down to be profitable at no more than $40. “I could not stand in front of an executive committee with oil prices where they were” and ask Shell’s leaders to invest in Vito as it was, says Sawan, considered a rising star at Shell. \nOver the next year or so, the team radically overhauled the plan for Vito. They slashed its “topside weight”—the platform’s bulk—from 40,000 tons to 8,900 tons. They removed from the plans a backup tube along the sea floor that would ensure the platform could keep pumping oil even if the main tube got clogged. (A clog would hurt only production, not safety, Shell stresses.) The new Vito is right-sized, the Shell team hopes, for a world of peaking oil demand. Wael Sawan, grew up in Dubai, graduated from Harvard Business School, and did a stint as an investment banker at Goldman Sachs, was named Shell’s executive vice president for deepwater in 2015 at the age of 41. Bruno Kelly—Reuters \nThe effort to save Vito illustrates why, for all the industry’s difficulties, deepwater oil isn’t dead. A deepwater project requires massive investment at the front end, but it spins off massive cash over its lifetime. Even at a time of slowing oil-demand growth, “that’s an oil position I don’t mind having,” says van Beurden. \nShell’s executive committee is to decide early this year whether to move forward with Vito in its svelte incarnation. “Fingers crossed,” says Sawan. \nIn a company that loves bromides, there’s one that has become infamous at Shell: “pots on the fire.” The phrase was used by a former Shell CEO to describe the company’s experimental strategy in an earlier round of investments in renewable energy. Shell reached into these technologies when they got hot, and it got burned. \nShell invested in making solar panels, only to abandon that investment after concluding it couldn’t make decent margins in what Shell discovered too late was a cutthroat manufacturing game. It invested in developing wind farms, only to pull back from the sector after deciding wind was a waste because the average wind farm delivered lower margins than the average deepwater oil well. It zoomed into hydrogen, only to put on the brakes in the mid-2000s after regulators found that Shell vastly overbooked oil reserves, a scandal that prompted Shell to refocus on what it saw as the part of its business that really counted. \n“We’ve tried these things before,” and “we have still very significant scars as a result of it,” van Beurden tells me. “Nothing so far has really worked, and the things that did work we abandoned because we thought they were not going to work. So we don’t have a fantastic track record.” \nVan Beurden takes one basic lesson from this sordid history: Shell failed in renewable energy before because it didn’t regard it as strategic. As a result, it behaved timidly and sloppily. It invested too much in the wrong things. It invested too little in the right things. \nToday, van Beurden says, the stakes are too high for Shell to make the same mistake again. “We believe, if you look into the second half of this century, maybe half of the energy system may be renewables,” he says. “The bulk of it is going to be solar, with wind being in very important niche markets here and there. So if you want to play in the non-oil-and-gas part of the energy system—which may be the biggest part of the energy system—you have to have competencies in these value chains.” \nSo, this time Shell is venturing into electricity, including renewables, with the grand goal of ­building the dominant global clean-energy machine. \nThe strategy still looks from the outside like a series of disjointed, though quickening, steps. For example, Shell is part of consortia building large solar farms in Oman and California. Their purpose: to maximize oil production. The solar fields are being built beside aging oilfields—fields so depleted they now need steam injected into them to push their remaining oil to the surface. Historically, making that steam has required burning natural gas. Now the Shell consortium will produce it with solar power. \nA bolder bet is Shell’s effort to build solar farms near gas-fired power plants, constructing hybrid generating systems that allow Shell to do what amounts to new-energy arbitrage: tap different energy sources at different times and in different amounts to maximize profits. It has started doing this in Australia, and it plans to expand the approach. \nMeanwhile Shell is leveraging its experience building giant things in the ocean to develop offshore wind farms, widely seen as wind power’s next big thing. It invested in a massive offshore development in the Dutch North Sea called Borssele. Now Shell is selling its stake there and planning to invest in the early, most-profitable stages of other offshore-wind projects. Among the spots it’s eyeing: the waters off other parts of Holland, off other European countries, off Taiwan, and off the U.S. East Coast. Beyond developing the wind farms, Shell intends to buy and sell the power they produce. That will let its traders squeeze out more profit, and it will count toward curbing Shell’s carbon footprint. \nShell also is focusing again on hydrogen. It’s part of a German experiment to install some 400 hydrogen-fueling stations across the country, a government-subsidized effort Shell sees as helping seed what ultimately could be a huge market for a new kind of juice. Long-term, Shell sees a future for hydrogen as a backbone of a worldwide clean-energy network. Hydrogen isn’t an energy source; it’s an energy carrier. The idea is to produce wind and solar power where it’s cheap, use it to split water into oxygen and hydrogen, liquefy the hydrogen, and then—much as with today’s liquefied-natural-gas trade—ship the hydrogen to markets that are short of energy, where the hydrogen could be turned, by devices called fuel cells, into electricity. With its traders and tankers, Shell figures, it would be well positioned to sell that hydrogen wherever in the world the need was greatest—and the price was highest. \nShell also is entering the business of battery-powered electric cars. In October, it bought NewMotion, a Dutch company that operates more than 30,000 electric-car charging installations in Europe and that gives electric-car owners who sign up for its service access to about 50,000 other charging points. Shell won’t disclose what it paid for NewMotion, but the deal clearly was tiny by Shell standards. In 2016, according to filings, NewMotion lost $4.1 million on revenue of $13.5 million. \nIn December, Shell inked a bigger deal to buy First Utility, a U.K.-based merchant power and natural-gas utility. The companies didn’t disclose the details of the transaction. \nSeveral large pension funds and money-management firms have criticized Shell for failing to take into sufficient account the potential that, when oil demand peaks and carbon constraints bite, Shell may find itself laden with stranded assets: untapped black gold it can’t profitably sell. \nWhen I ask van Beurden about that argument, he calls it “a red herring,” saying Shell would decarbonize its portfolio to avoid any chance of stranded assets. But he also says he has ordered his internal analysts to compute the risk Shell would face if he failed. His question to them: “If I’m completely stupid in a world that is changing beyond recognition, in ways that we cannot imagine at this point in time, and we do not take account of it in our decision-making, what is the likelihood that I will end up with value at risk?” The study, Shell says, is due out in April. \nThat afternoon, as I leave Shell’s headquarters, I pass in the lobby a door-sized rectangular chunk of rock containing the fossilized remains of dozens of pecten, bivalve mollusks related to the scallop. The pecten shell is Shell’s logo. It was favored by one of the company’s forebears, whose family business in London had traded decorative seashells earlier in the 1800s. That was before the dawn of the Oil Age, the energy transition that would fuel the company’s real rise. \nIf its leaders can navigate today’s energy shift, Shell may well be operating a century hence, having moved from seashells to petroleum to … who knows? Solar? Wind? Something else? \nIf they don’t, the name Shell may come to evoke a different species: the dodo. \nA version of this article appears in the Feb. 1, 2018 issue of Fortune with the headline “Shell Faces ‘Lower Forever’.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T08:30:00.000+02:00", "crawled": "2018-01-25T00:08:20.005+02:00", "highlightTitle": ""}