{"organizations": [], "uuid": "255e29d5a1ca93ee31cdbb54b00924fbed9d389e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/10/104890072-GettyImages-887657576.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/nasdaq-looking-into-bitcoin-futures-different-to-rivals-ceo.html", "country": "US", "domain_rank": 767, "title": "Nasdaq looking into bitcoin futures different to rivals: CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-23T14:47:00.000+02:00", "replies_count": 0, "uuid": "255e29d5a1ca93ee31cdbb54b00924fbed9d389e"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/23/nasdaq-looking-into-bitcoin-futures-different-to-rivals-ceo.html", "ord_in_thread": 0, "title": "Nasdaq looking into bitcoin futures different to rivals: CEO", "locations": [], "entities": {"persons": [{"name": "david paul morris", "sentiment": "negative"}, {"name": "adena friedman", "sentiment": "none"}, {"name": "friedman", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "cme group", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cboe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Nasdaq is assessing how to offer cryptocurrency futures in a way that none of its competitors have so far managed, the CEO of the stock exchange told CNBC Tuesday.\nAdena Friedman confirmed earlier reports that the Nasdaq is looking into bitcoin futures , but did not give a timeline for a launch or if it will definitely happen. Though her comments suggest that the development of a product is indeed happening.\n\"We are continuing to investigate the idea of a cryptocurrency futures (contract) with a partner and we continue to look at the risk management around that, making sure we are putting the right protocols in place, making sure there's proper demand, and that the contract is different from what's already out there,\" Friedman told CNBC.\nDavid Paul Morris | Bloomberg | Getty Images Adena Friedman Rivals the Cboe and CME Group have both launched bitcoin futures contracts in the past few months. But speaking during an interview at The Sanctuary in Davos , Switzerland, Friedman said that the Nasdaq will offer a different type of contract.\nThe Nasdaq CEO explained the Cboe and CME offerings operate by tracking the price of bitcoin and operate in reference to its future price. But, the Nasdaq wants to offer a contract different from what Cboe and CME Group have.\n\"What we might look at is more of a total return futures, so it's a little bit of a different construct,\" she said, adding that it meant it was \"more of an investment than a tracking stock.\" This suggests the product might track a spot rate rather than any future price.\nshow chapters Should you invest in a cryptocurrency? 9:27 AM ET Thu, 26 Oct 2017 | 05:22 \"We will have to see whether it makes sense at the end of the day, proper client demand, and on a risk-management side 'do we feel confident?,' in which case we would look to go to the CFTC (Commodity Futures Trading Commission),\" she said.\nBitcoin had a huge rally in 2017 but has so far got off to a tepid start this year. Cryptocurrencies across the board recently suffered a huge sell-off.\nMany have also poured cold water over cryptocurrencies in the past year. J.P. Morgan CEO Jamie Dimon famously called bitcoin a \"fraud\" while legendary investor Warren Buffett told CNBC that digital currencies will come to a \"bad ending .\"\nStill, many have also talked up the potential of cryptocurrencies in 2018. Julian Hosp, co-founder of TenX, a firm that wants to make it easier for people to spend virtual currencies, told CNBC in December that bitcoin could hit $60,000 in 2018, but could crash first. And Dave Chapman, managing director of cryptocurrency trading firm Octagon Strategy, said that bitcoin could hit $100,000 in 2018 .\nWATCH: Bitcoin skeptics say digital currency has no real value — Here's why they're wrong show chapters Bitcoin skeptics say digital currency has no real value — Here's why they're wrong 3:53 PM ET Mon, 22 Jan 2018 | 05:51", "external_links": [], "published": "2018-01-23T14:47:00.000+02:00", "crawled": "2018-01-23T14:54:31.012+02:00", "highlightTitle": ""}