{"organizations": [], "uuid": "cb51e6388fc6987a03a7e74bc8ffb61e56d8ad12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-american-energy-subsidiary-completes-acquisition-of-additional-wells.html", "country": "US", "domain_rank": 767, "title": "American Energy Subsidiary Completes Acquisition of Additional Wells", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.174, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "cb51e6388fc6987a03a7e74bc8ffb61e56d8ad12"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-american-energy-subsidiary-completes-acquisition-of-additional-wells.html", "ord_in_thread": 0, "title": "American Energy Subsidiary Completes Acquisition of Additional Wells", "locations": [], "entities": {"persons": [{"name": "hickman", "sentiment": "none"}, {"name": "josh hickman", "sentiment": "none"}], "locations": [{"name": "additional wells allentown", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "american energy subsidiary", "sentiment": "negative"}, {"name": "american energy partners, inc", "sentiment": "neutral"}, {"name": "american energy", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "gilbert o&g company", "sentiment": "none"}, {"name": "aept", "sentiment": "none"}, {"name": "american energy partners , inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALLENTOWN, Pa., Jan. 26, 2018 (GLOBE NEWSWIRE) -- via OTC PR WIRE -- American Energy Partners, Inc. (OTC:AEPT) (the “Company”, “American Energy” or “AEPT”), a diversified energy company, today announces that its wholly owned subsidiary, Gilbert O&G Company, LLC has completed the acquisition of a small package of conventional oil and gas wells from an unnamed seller.\nAmerican Energy’s COO, Mr. Josh Hickman states, “The acquisition is synergistic with our previous purchase and continues our goal of consolidating oil and gas holdings of wells, leases and mineral rights in the prolific Appalachian Basin.” Mr. Hickman went on to reiterate that the wells are of good quality and expected to be a source of positive cash flow to the company for years to come.\nMr. Hickman also notes that since the acquisition of the original set of wells, an aggressive optimization program has resulted in an increase in production which he believes will drive revenues higher than expected for the Company.\nAmerican Energy Partners , Inc. (AEPT)\nAEPT and its group of companies focus on providing solutions in markets where energy production and water meet technology. Collectively, the subsidiaries are engaged in the energy sector as well as the design, construction and operation of regional water treatment facilities that serve the industrial, energy and government sectors.\nFor additional information, visit: American Energy Partners, Inc.\nSafe Harbor\nThis press release contains forward-looking statements, particularly as related to, among other things, the business plans of AEPT, statements relating to goals, plans and projections regarding AEPT’s financial position and business strategy. The words or phrases “would be,” “will allow,” “intends to,” “may result,” “are expected to,” “will continue,” “anticipates,” “expects,” “estimate,” “project,” “indicate,” “could,” “potentially,” “should,” “believe,” “think”, “considers” or similar expressions are intended to identify “forward-looking statements.” These forward-looking statements fall within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Act of 1934 and are subject to the safe harbor created by these sections. Actual results could differ materially from those projected in the forward-looking statements as a result of a number of risks and uncertainties. Such forward-looking statements are based on current expectations, involve known and unknown risks, a reliance on third parties for information, transactions or orders that may be cancelled, and other factors that may cause our actual results, performance or achievements, or developments in our industry, to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking statements. Factors that could cause actual results to differ materially from anticipated results include risks and uncertainties related to the fluctuation of global economic conditions, the performance of management and our employees, our ability to obtain financing, competition, general economic conditions and other factors that are detailed in our periodic reports and on documents we file from time to time with the Securities and Exchange Commission. Statements made herein are as of the date of this press release and should not be relied upon as of any subsequent date. AEPT cautions readers not to place undue reliance on such statements. AEPT does not undertake, and AEPT specifically disclaims any obligation, to update any forward-looking statements to reflect occurrences, developments, unanticipated events or circumstances after the date of such statement. Actual results may differ materially from AEPT’s expectations and estimates.\nCompany Contact:\ncontact@americanenergy-inc.com\nSource:American Energy Partners, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/94fcd2dd-93e6-4727-a50c-0cb863a2918f", "https://www.globenewswire.com/Tracker?data=YsRwfx4e1GTTQHykWXtuAlrK9aYOiGHKf4GmgZEjObuE2XPE_fvc-y8b1l6prYaT2HIrZ69idcNc4S3VboFUAYAthGY1U4TTp_2mkaPcxC-0Dq9yxpdl01_5vZGUFHdY", "https://www.globenewswire.com/Tracker?data=QDrSgKKBzt3-xhFHd5g99BWbbyFcUR1SPYcGcb1Ectv77ItI-7ZbRzY-pZfMMO6BckpEiMcFa5raRjRSQvyqn7NTM29MYHQHeRXhvog5gvK9_H922k3gwITzpOfggJ_e"], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T17:57:48.017+02:00", "highlightTitle": ""}