{"organizations": [], "uuid": "144b7b21c1a75a860e28b56b8affcaaa0b31c1b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221493038&w=1200&r=LYNXMPEE0B18X", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pope-peru/pope-francis-to-visit-peru-as-fujimori-pardon-roils-country-idUSKBN1F122J", "country": "US", "domain_rank": 408, "title": "Pope Francis to visit Peru as Fujimori pardon roils country", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:35:00.000+02:00", "replies_count": 0, "uuid": "144b7b21c1a75a860e28b56b8affcaaa0b31c1b1"}, "author": "", "url": "https://www.reuters.com/article/us-pope-peru/pope-francis-to-visit-peru-as-fujimori-pardon-roils-country-idUSKBN1F122J", "ord_in_thread": 0, "title": "Pope Francis to visit Peru as Fujimori pardon roils country", "locations": [], "entities": {"persons": [{"name": "fujimori", "sentiment": "negative"}, {"name": "francis", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "negative"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "alberto fujimori", "sentiment": "none"}, {"name": "mitra taj", "sentiment": "none"}, {"name": "pedro pablo kuczynski", "sentiment": "none"}, {"name": "opponen", "sentiment": "none"}], "locations": [{"name": "peru", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "min read  lima/vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 4:36 PM / Updated 10 minutes ago Pope Francis to visit Peru as Fujimori pardon roils country Mitra Taj , Philip Pullella 5 Min Read \nLIMA/VATICAN CITY (Reuters) - Pope Francis next week visits Peru, a country divided over former autocrat leader Alberto Fujimori, whose pardon from prison by the current president has reopened wounds from one of the country’s darkest periods. \nPeruvians will watch closely to see if the Argentine pope signals any concern over the pardon after he arrives on Thursday from Chile on the second leg of a South America trip, where corruption and the plight of indigenous people will likely come up. \nPresident Pedro Pablo Kuczynski, a former Wall Street banker, last month narrowly survived an impeachment bid over a graft scandal with the help of Fujimori’s loyalists in Congress, and pardoned Fujimori three days later. \nFujimori, 79, had served less than half of a 25-year sentence for corruption and human rights crimes for commanding death squads to combat a Maoist-inspired insurgency during his 1990-2000 right-wing populist government. \nOpponents of both Fujimori and Kuczynski will be seeking a papal condemnation, even if only in general terms, of human rights abuses and corruption. \n“Hopefully the Pope will show solidarity with the victims,” said human rights activist Gisela Ortiz, whose brother was one of nine university students killed in a massacre of civilians that Fujimori was found guilty of ordering. \nShe called on Francis to meet with her and other family members of Fujimori’s victims. “We want to express how worried we are about the injustice we’re living in,” she said. \nKuczynski, 79, cited medical reasons for granting Fujimori the pardon and has said it was fundamentally about forgiveness. He denies it was part of a backroom deal. \nRosa Rojas, who is also seeking a meeting with the pope, said she still struggles with the loss of her husband and eight-year-old son, who were killed in Fujimori’s battle against the Shining Path rebels. \nCombat between state security forces and the Shining Path and other guerrillas left an estimated 69,000 dead in Peru between 1980 and 2000, with 75 percent of victims comprised of indigenous people, according to Peru’s truth commission. \n“With the pardon, wounds that were healing have reopened,” Rojas said. A presentation of the popemobile that will be used to transport Pope Francis during his next visit to Peru, in Lima, Peru January 10, 2018. REUTERS/Guadalupe Pardo \n‘CORRUPTION IS THE PLAGUE’ \nCardinal Pietro Parolin, the Vatican secretary of state, hinted strongly that the pope would address corruption during the trip. \nParolin, who ranks only second to the pope in the Church’s hierarchy, told Vatican media that the pope feels fighting corruption is important because “it blocks development and the overcoming of poverty”. \nDuring a previous trip to Latin American Francis said: “Corruption is the plague, it’s the gangrene of society”. People walk near Lima Cathedral with a banner of Pope Francis prior to his visit to Peru from January 18 to 21, in Lima, Peru, January 3, 2018. REUTERS/Mariana Bazo \nBut Vatican spokesman Greg Burke said there were no plans for the pope to meet the family members of Fujimori’s victims. \nDespite his downfall, many Peruvians admire Fujimori, crediting him with pacifying Peru, fixing a broken economy and tending to the needs of the poor. Recent polls show that a majority of Peruvians support the pardon. \nHis populist following, led by daughter Keiko and son Kenji, remains one of the country’s most potent political forces. \nFujimori’s supporters are also seeking a gesture of papal understanding for the pardon, but Church sources say that is unlikely. \nHuman rights is expected to come up when Francis visits the Amazonian town of Puerto Maldonado to address increasing risks to the region’s indigenous people - including reclusive tribes that shun contact with outsiders - from rampant wildcat gold mining, illegal logging and drug trafficking. \n“Their territory is increasingly being invaded, their space is becoming smaller and smaller; the livelihoods with which they have survived for so many centuries are being destroyed,” said Father Manuel Jesus Romero. \n“Fishing, hunting, trees and rivers are more and more in danger. Therefore their lives are in danger,” he told the newsletter of REPAM, a Pan-Amazonian Church Network. \nThe South America trip will be 22nd overseas trip of Francis’ pontificate and the sixth to the continent of his birth. Reporting By Mitra Taj in Lima and Philip Pullela in Vatican City; Editing by Alistair Bell", "external_links": [], "published": "2018-01-12T18:35:00.000+02:00", "crawled": "2018-01-12T18:47:36.008+02:00", "highlightTitle": ""}