{"organizations": [], "uuid": "9ffc2761c140140a6045634a6b796545cdc7d527", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223900228&w=1200&r=LYNXMPEE0K0ML", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-tourists/new-york-governor-vows-to-reopen-statue-of-liberty-as-shutdown-enters-day-2-idUSKBN1FA0T8", "country": "US", "domain_rank": 408, "title": "New York governor vows to reopen Statue of Liberty as shutdown enters Day 2", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:59:00.000+02:00", "replies_count": 0, "uuid": "9ffc2761c140140a6045634a6b796545cdc7d527"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-tourists/new-york-governor-vows-to-reopen-statue-of-liberty-as-shutdown-enters-day-2-idUSKBN1FA0T8", "ord_in_thread": 0, "title": "New York governor vows to reopen Statue of Liberty as shutdown enters Day 2", "locations": [], "entities": {"persons": [{"name": "ryan zinke", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "u.s. interior", "sentiment": "none"}, {"name": "joseph ax", "sentiment": "none"}, {"name": "national zoo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "smithsonian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The Statue of Liberty will reopen on Monday even if the U.S. government shutdown extends into the work week, New York Governor Andrew Cuomo said on Sunday, vowing to use state funds to keep the landmark monument in operation.\nDozens of other national parks and monuments were expected to remain partially or entirely closed after Congress failed to agree on a spending plan to keep the government running past a Friday midnight deadline.\nIn the hours leading up to the shutdown, the Trump administration worked on ways to keep hundreds of parks open without staff in an effort to avoid public anger, although it was unclear which ones would close.\n“Not all parks are fully open but we are all working hard to make as many areas as accessible to the public as possible,” U.S. Interior Secretary Ryan Zinke said on Twitter on Saturday.\nThe hit-or-miss closures forced tourists and residents alike to alter their plans. In lower Manhattan, where ferries normally embark for the Statue of Liberty in New York Harbor, out-of-town visitors expressed frustration that the site was closed.\nAnd San Diego Police Chief Shelley Zimmerman posted a photo of a “closed” sign outside Cabrillo National Monument on Twitter.\n“I had planned to do some tide pool repeats to get some hill work in on my bicycle ride this morning,” she wrote, referring to a local bike route. “Change of plans.”\nThe National Parks Conservation Association, an advocacy group, estimated that one-third of the 417 national park sites were shuttered, “including places like the Statue of Liberty, presidential homes, and other historic and cultural sites primarily made up of buildings that can be locked.”\nA sign announcing the closure of the Statue of Liberty, due to the U.S. government shutdown, sits near the ferry dock to the Statue of Liberty at Battery Park in Manhattan, New York, U.S. January 21, 2018. REUTERS/Shannon Stapleton Yellowstone National Park, a 3,500-square-mile (9,065 square km) wilderness located mostly in Montana, remained open but offered limited services, with visitor centers closed and park rangers absent. The association warned that the lack of staff could pose dangers to visitors.\nXanterra Parks & Resorts, a private company that manages lodges, concessions and restaurants in numerous national parks including Yellowstone, Grand Canyon, Mount Rushmore, Rocky Mountain and Zion, said they will remain open during the shutdown.\nIn Washington, the Smithsonian museums and the National Zoo will remain open through Monday, using prior-year funds. In a tweet, the Smithsonian said it will update its status beyond Monday “as soon as we know.” But in Philadelphia, visitors were turned away at the Liberty Bell.\nSlideshow (3 Images) During the last shutdown in 2013, a number of governors used state funds to keep parks open, including the Statue of Liberty, which at the time cost $61,600 per day to reopen.\nAt a news conference at the Statue of Liberty, Cuomo said the site generates tourism revenue, adding that the monument serves as a welcoming beacon to immigrants arriving in the United States.\n“We don’t want to lose the income,” he said. “And symbolically, you can shut down the government, but you can’t shut down the Statue of Liberty.”\nIn Arizona, Republican Governor Doug Ducey committed state funds to keep the Grand Canyon open, including trash removal, snow plowing and public restrooms, according to Ducey spokesman Patrick Ptak.\n“We recognize it’s a huge economic attractor and has a big impact not just on rural areas around the Grand Canyon but the state as a whole,” Ptak said, adding that the expected cost is around $100,000 per week.\nBut in South Dakota, home of Mount Rushmore, Republican Governor Dennis Daugaard has said he would not take any action to keep the monument open during a shutdown.\nReporting by Joseph Ax; Editing by Frank McGurty and Jeffrey Benkoe\n ", "external_links": [], "published": "2018-01-21T17:59:00.000+02:00", "crawled": "2018-01-21T18:42:09.019+02:00", "highlightTitle": ""}