{"organizations": [], "uuid": "a69c06e4a6c94e4e43ab3f92cef1a3916f5334cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-univar-closes-kemetyl-industrial-chemicals-acquisition.html", "country": "US", "domain_rank": 767, "title": "Univar Closes Kemetyl Industrial Chemicals Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-04T15:30:00.000+02:00", "replies_count": 0, "uuid": "a69c06e4a6c94e4e43ab3f92cef1a3916f5334cc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-univar-closes-kemetyl-industrial-chemicals-acquisition.html", "ord_in_thread": 0, "title": "Univar Closes Kemetyl Industrial Chemicals Acquisition", "locations": [], "entities": {"persons": [{"name": "steve newlin", "sentiment": "none"}, {"name": "kemetyl", "sentiment": "none"}], "locations": [{"name": "malmo", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "downers grove", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}], "organizations": [{"name": "univar inc.", "sentiment": "negative"}, {"name": "univar closes kemetyl industrial chemicals acquisition", "sentiment": "negative"}, {"name": "kemetyl industrial chemicals", "sentiment": "none"}, {"name": "univar ab", "sentiment": "none"}, {"name": "kemetyl group", "sentiment": "none"}, {"name": "kemetyl", "sentiment": "none"}, {"name": "univar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DOWNERS GROVE, Ill. and MALMO, Sweden, Jan. 4, 2018 /PRNewswire/ -- Univar Inc. (\"Univar\") announced today that its wholly-owned subsidiaries Univar AB in Sweden and Univar AS in Norway have successfully completed the acquisition of Kemetyl Industrial Chemicals (\"Company\"), a division of the Kemetyl Group. The Company generates approximately $30 million in annual sales.\n\"With the successful closing of this acquisition, Univar will enhance its brand, expand its leading position in the pharmaceutical market, and strengthen its expertise in water treatment in the Nordic region,\" said Steve Newlin, Univar's chairman and chief executive officer. \"Both our companies have deep experience and key competencies in the life sciences market, and we are excited to offer Kemetyl's portfolio of sustainable products to enhance our value to our customers.\"\nKemetyl's offices in Sweden and Norway will continue to operate as usual while the integration process is completed. A total of 15 Kemetyl employees from both locations will immediately join the Univar family.\n\"Kemetyl Industrial Chemicals is a natural extension of Univar's existing strong market presence in EMEA,\" stated Ketil Stave, Kemetyl Group's chairman of the board. \"Our industrial customers will see tremendous benefit from Univar's outstanding service, market intelligence and distribution network.\"\nAbout Univar\nFounded in 1924, Univar (NYSE: UNVR) is a global chemical and ingredients distributor and provider of value-added services, working with leading suppliers worldwide. Supported by a comprehensive team of sales and technical professionals with deep specialty and market expertise, Univar operates hundreds of distribution facilities throughout North America, Western Europe, Asia-Pacific and Latin America. Univar delivers tailored customer solutions through a broad product and services portfolio sustained by one of the most extensive industry distribution networks in the world. For more information, visit www.univar.com .\nAbout Kemetyl Group\nThe Kemetyl Group has rapidly become one of the largest companies in its fields in Europe, with 250 employees across Europe producing a turnover of some €140 million to 45 countries. Following a number of acquisitions, we have grown to be a truly complete, integrated and Pan-European partner within the industry. Present in eight European countries, with four owned production sites and several contractor sites, we have a unique presence. We are where our customers are. And with staff that speaks 24 different languages we can live up to the slogan - \"we speak your language.\"\nForward-Looking Statements\nThis press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements are subject to known and unknown risks and uncertainties, many of which may be beyond our control. We caution you that the forward-looking information presented in this press release is not a guarantee of future events, and that actual events may differ materially from those made in or suggested by the forward-looking information contained in this press release. In addition, forward-looking statements generally can be identified by the use of forward-looking terminology such as \"may,\" \"plan,\" \"seek,\" \"comfortable with,\" \"will,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe\" or \"continue\" or the negative thereof or variations thereon or similar terminology. Any forward-looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/univar-closes-kemetyl-industrial-chemicals-acquisition-300577575.html\nSOURCE Univar Inc.", "external_links": ["http://www.prnewswire.com/news-releases/univar-closes-kemetyl-industrial-chemicals-acquisition-300577575.html", "http://www.univar.com/"], "published": "2018-01-04T15:30:00.000+02:00", "crawled": "2018-01-04T19:34:31.009+02:00", "highlightTitle": ""}