{"organizations": [], "uuid": "3dc55d8e4f09f31c9788b6a39729308b254f00c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-fda-approves-addition-of-overall-survival-data-to-kyprolisa-carfilzomib-label.html", "country": "US", "domain_rank": 767, "title": "FDA Approves Addition Of Overall Survival Data To KYPROLIS® (carfilzomib) Label", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.227, "site_type": "news", "published": "2018-01-18T00:15:00.000+02:00", "replies_count": 0, "uuid": "3dc55d8e4f09f31c9788b6a39729308b254f00c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-fda-approves-addition-of-overall-survival-data-to-kyprolisa-carfilzomib-label.html", "ord_in_thread": 0, "title": "FDA Approves Addition Of Overall Survival Data To KYPROLIS® (carfilzomib) Label", "locations": [], "entities": {"persons": [{"name": "david m. reese", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "m.d.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "amgen", "sentiment": "negative"}, {"name": "s. food and drug administration", "sentiment": "none"}, {"name": "kyprolis", "sentiment": "none"}, {"name": "translational sciences and oncology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "THOUSAND OAKS, Calif., Jan. 17, 2018 /PRNewswire/ -- Amgen (NASDAQ:AMGN) today announced that the U.S. Food and Drug Administration (FDA) has approved the supplemental New Drug Application (sNDA) to add overall survival (OS) data from the Phase 3 head-to-head ENDEAVOR trial to the Prescribing Information for KYPROLIS ® (carfilzomib). Data added to the label demonstrated that KYPROLIS and dexamethasone (Kd) reduced the risk of death by 21 percent and increased OS by 7.6 months versus Velcade ® (bortezomib) and dexamethasone (Vd) in patients with relapsed or refractory multiple myeloma (median OS 47.6 months for Kd versus 40.0 months for Vd, HR=0.79; p=0.01).\n\"Overall survival is generally considered to be the gold standard of endpoints because it clearly demonstrates a drug's value in extending a patient's life, 1,2 \" said David M. Reese, M.D., senior vice president of Translational Sciences and Oncology at Amgen. \"Blood cancer therapies approved by the FDA between 2003 and 2013 only improved overall survival by an average of 2.61 months. 3 KYPROLIS and dexamethasone improved overall survival by 7.6 months, underscoring that this regimen is a significant advancement and should be considered a standard of care for patients with relapsed or refractory multiple myeloma.\"\nThe National Comprehensive Cancer Network Clinical Practice Guidelines in Oncology (NCCN Guidelines ® ) list Kd as the only preferred doublet regimen at relapse for multiple myeloma. Full OS results from the ENDEAVOR trial were published earlier this year in The Lancet Oncology.\nAdverse events observed in this updated analysis were consistent with those previously reported for ENDEAVOR. The most common adverse events (greater than or equal to 20 percent) in the KYPROLIS arm were anemia, diarrhea, pyrexia, dyspnea, fatigue, hypertension, cough, insomnia, upper respiratory tract infection, peripheral edema, nausea, bronchitis, asthenia, back pain, thrombocytopenia and headache.\nSince its approval in 2012, more than 50,000 patients worldwide have received KYPROLIS. The KYPROLIS clinical program continues to focus on providing treatment options for physicians and patients for this frequently relapsing and difficult-to-treat cancer. KYPROLIS is available for patients whose myeloma has relapsed or become resistant to another treatment and continues to be studied in a range of combinations and patient populations.\nAbout ENDEAVOR\nThe randomized ENDEAVOR (Randomiz E d, Ope N Label, Phase 3 Study of Carfilzomib Plus DE xameth A sone V s Bortezomib Plus Dexamethas O ne in Patients With R elapsed Multiple Myeloma) trial of 929 patients evaluated KYPROLIS in combination with low-dose dexamethasone, versus Velcade with low-dose dexamethasone in relapsed or refractory patients who previously received at least one, but not more than three, prior therapeutic regimens. The primary endpoint of the trial was progression-free survival, defined as the time from treatment initiation to disease progression or death. The primary analysis was published in The Lancet Oncology and is described in the Prescribing Information.\nPatients received treatment until progression with KYPROLIS as a 30-minute infusion on days 1, 2, 8, 9, 15 and 16 of 28 day treatment cycles, along with low-dose dexamethasone (20 mg). For cycle one only, KYPROLIS was administered at 20 mg/m 2 on days 1 and 2, and if tolerated was escalated to 56 mg/m 2 from day 8 of cycle one onwards. Patients who received Velcade (1.3 mg/m 2 ) with low-dose dexamethasone (20 mg) were treated with Velcade administered subcutaneously or intravenously at the discretion of the investigator and in accordance with regional regulatory approval of Velcade. More than 75 percent of the patients in the control arm received Velcade subcutaneously. This study was conducted at 235 sites worldwide. For information about this trial, please visit www.clinicaltrials.gov under trial identification number NCT01568866.\nAbout Multiple Myeloma\nMultiple myeloma is an incurable blood cancer, characterized by a recurring pattern of remission and relapse. 4 It is a rare and life-threatening disease that accounts for approximately one percent of all cancers. 5,6 In the U.S., there are more than 118,000 people living with, or in remission from, multiple myeloma. 7 Approximately 30,280 Americans are diagnosed with multiple myeloma each year and 12,590 patient deaths are reported on an annual basis. 7\nAbout KYPROLIS ® (carfilzomib)\nProteasomes play an important role in cell function and growth by breaking down proteins that are damaged or no longer needed. 8 KYPROLIS has been shown to block proteasomes, leading to an excessive build-up of proteins within cells. 8 In some cells, KYPROLIS can cause cell death, especially in myeloma cells because they are more likely to contain a higher amount of abnormal proteins. 8,9\nKYPROLIS is approved in the U.S. for the following:\nIn combination with dexamethasone or with lenalidomide plus dexamethasone for the treatment of patients with relapsed or refractory multiple myeloma who have received one to three lines of therapy. As a single agent for the treatment of patients with relapsed or refractory multiple myeloma who have received one or more lines of therapy.\nKYPROLIS is also approved in Argentina, Australia, Bahrain, Canada, Hong Kong, Israel, Japan, Kuwait, Lebanon, Macao, Mexico, Thailand, Colombia, S. Korea, Canada, Qatar, Switzerland, United Arab Emirates, Turkey, Russia, Brazil, India, Oman and the European Union. Additional regulatory applications for KYPROLIS are underway and have been submitted to health authorities worldwide.\nIMPORTANT SAFETY INFORMATION\nCardiac Toxicities\nNew onset or worsening of pre-existing cardiac failure (e.g., congestive heart failure, pulmonary edema, decreased ejection fraction), restrictive cardiomyopathy, myocardial ischemia, and myocardial infarction including fatalities have occurred following administration of KYPROLIS. Some events occurred in patients with normal baseline ventricular function. Death due to cardiac arrest has occurred within one day of KYPROLIS administration. Monitor patients for clinical signs or symptoms of cardiac failure or cardiac ischemia. Evaluate promptly if cardiac toxicity is suspected. Withhold KYPROLIS for Grade 3 or 4 cardiac adverse events until recovery, and consider whether to restart KYPROLIS at 1 dose level reduction based on a benefit/risk assessment. While adequate hydration is required prior to each dose in Cycle 1, monitor all patients for evidence of volume overload, especially patients at risk for cardiac failure. Adjust total fluid intake as clinically appropriate in patients with baseline cardiac failure or who are at risk for cardiac failure. Patients ≥ 75 years, the risk of cardiac failure is increased. Patients with New York Heart Association Class III and IV heart failure, recent myocardial infarction, conduction abnormalities, angina, or arrhythmias may be at greater risk for cardiac complications and should have a comprehensive medical assessment (including blood pressure and fluid management) prior to starting treatment with KYPROLIS and remain under close follow-up.\nAcute Renal Failure\nCases of acute renal failure and renal insufficiency adverse events (including renal failure) have occurred in patients receiving KYPROLIS. Acute renal failure was reported more frequently in patients", "external_links": ["http://seer.cancer.gov/statfacts/html/mulmy.html", "http://www.clinicaltrials.gov/", "http://globocan.iarc.fr/old/summary_table_pop_prev.asp?selection=224900&title=World&sex=0&window=1&sort=0&submit=%C2%A0Execute%C2%A0", "https://www.cancer.org/content/dam/CRC/PDF/Public/8738.00.pdf", "http://www.twitter.com/amgen", "http://www.amgen.com/", "http://www.prnewswire.com/news-releases/fda-approves-addition-of-overall-survival-data-to-kyprolis-carfilzomib-label-300584206.html", "http://www.kyprolis.com/", "https://blogs.fda.gov/fdavoice/index.php/2017/06/in-cancer-treatment-theres-more-than-one-way-to-measure-patient-benefit"], "published": "2018-01-18T00:15:00.000+02:00", "crawled": "2018-01-18T00:37:58.002+02:00", "highlightTitle": ""}