{"organizations": [], "uuid": "f4e2a4f79a2a1a48a3eaf4d8760e04f451c80723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-inseego-corp-appoints-telematics-industry-veteran-mark-licht-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Inseego Corp. Appoints Telematics Industry Veteran Mark Licht to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T17:05:00.000+02:00", "replies_count": 0, "uuid": "f4e2a4f79a2a1a48a3eaf4d8760e04f451c80723"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-inseego-corp-appoints-telematics-industry-veteran-mark-licht-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Inseego Corp. Appoints Telematics Industry Veteran Mark Licht to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "phil falcone", "sentiment": "none"}, {"name": "dan mondor", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "mark licht", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "inseego", "sentiment": "none"}], "organizations": [{"name": "appoints telematics industry veteran mark licht", "sentiment": "negative"}, {"name": "inseego corp", "sentiment": "negative"}, {"name": "insg", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO--(BUSINESS WIRE)-- Inseego Corp . (Nasdaq: INSG), a global leader in software-as-a-service (SaaS) business intelligence solutions, Internet of Things (IoT) and mobile technology, today announced the appointment of Mark Licht to its Board of Directors, effective January 5, 2018.\n“We’re thrilled to have a high-profile industry expert such as Mark join our Board of Directors,” said Dan Mondor, President and CEO of Inseego. “Mark’s extensive experience in both domestic and international telematics markets will be an extremely important asset to the Company as we look to strengthen the Ctrack brand and expand into exciting new verticals. Mark’s entrepreneurial background and deep industry relationships bring fresh insights to Inseego which will help accelerate our transformation.”\n“Mark’s decades of experience as a founder and senior operating executive in the telematics industry will be invaluable to us as we continue on our path to establish Inseego as a leading provider of mobility solutions for the Internet of Things and connected asset tracking market,” said Phil Falcone, Chairman of the Board of Directors of Inseego.\nMr. Licht has an extensive background in the telematics industry with over 25 years of experience in the formation, financing, and operation of wireless location services and technology companies. He has founded several high-profile companies in the telematics and IoT markets, including Teletrac, Ituran, and Sigma One Communications. Mr. Licht currently serves on the Boards or Advisory Boards of a number of fleet management, insurance telematics, data analytics, autonomous vehicle, predictive maintenance and OEM telematics companies in the United States and Latin America. He holds a Bachelor of Arts degree from the University of California, Los Angeles (UCLA) and a Master of Science degree from the London School of Economics.\n“I look forward to joining Inseego’s Board to assist the Company in continuing to grow its telematics and IoT and mobile solutions businesses as it pursues exciting new global opportunities. Inseego’s strong market position along with a highly innovative Ctrack solution are compelling, and I am excited to join such a great team,” said Mr. Licht.\nAbout Inseego Corp.\nInseego Corp. (Nasdaq: INSG), a global leader in software-as-a-service (SaaS) business intelligence solutions, Internet of Things (IoT) and mobile technology, is transforming business mobility through its broad portfolio of solutions. We enable a wide array of applications for worldwide service provider, enterprise and SMB markets with our asset tracking and carrier activation solutions. Inseego’s high-performance Skyus modems and gateways, and MiFi branded intelligent mobile devices power a wide array of consumer, service provider, SMB and mission critical enterprise applications with a “zero unscheduled downtime” mandate - including industrial IoT, SD WAN failover management and broadband mobile WiFi hotspots. Inseego is headquartered in San Diego, California with offices worldwide. www.inseego.com Twitter @inseego\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis release may contain forward-looking statements, which are made pursuant to the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995, as amended to date. These forward-looking statements involve risks and uncertainties. A number of important factors could cause actual results to differ materially from those in the forward-looking statements contained herein. These factors include risks relating to the growth of the business, the timing of such growth and future opportunities, technological changes, new product introductions, continued acceptance of Inseego’s products and dependence on intellectual property rights. These factors, as well as other factors that could cause actual results to differ materially, are discussed in more detail in Inseego’s filings with the United States Securities and Exchange Commission (available at www.sec.gov ) and other regulatory agencies.\n©2018. Inseego Corp. All rights reserved. The Inseego name and logo are trademarks of Inseego Corp. Other Company, product or service names mentioned herein are the trademarks of their respective owners.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006014/en/\nInseego Corp.\nMedia Contact:\nAnette Gaven, +1 (619) 993-3058\nAnette.Gaven@inseego.com\nor\nInvestor Relations Contact:\nStephen Smith, +1 (858) 247-2149\nStephen.Smith@inseego.com\nwww.inseego.com\nSource: Inseego Corp.", "external_links": ["http://www.businesswire.com/news/home/20180108006014/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.inseego.com%2F&esheet=51739074&lan=en-US&anchor=www.inseego.com&index=4&md5=b3b2a4e5666114088f5da00dd29cc2fb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51739074&newsitemid=20180108006014&lan=en-US&anchor=www.sec.gov&index=3&md5=b1f225f1e008dc20926bb601d5e79f85", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.inseego.com&esheet=51739074&newsitemid=20180108006014&lan=en-US&anchor=www.inseego.com&index=2&md5=67feae93ed1bdfd5d63663b30ffa8f32", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.inseego.com%2F&esheet=51739074&newsitemid=20180108006014&lan=en-US&anchor=Inseego+Corp&index=1&md5=176642e3307830e8bcb56c8f63e6e8c9"], "published": "2018-01-08T17:05:00.000+02:00", "crawled": "2018-01-08T19:07:23.004+02:00", "highlightTitle": ""}