{"organizations": [], "uuid": "df3b1e3eb43dc9eb479ad849cf55173d3092bd9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/18/104780591-IMG_7704.1910x1000.JPG", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/01/marketing-strategies-from-the-worlds-top-ceos-and-entrepreneurs.html", "country": "US", "domain_rank": 767, "title": "Marketing strategies from the world’s top CEOs and entrepreneurs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-01T13:06:00.000+02:00", "replies_count": 0, "uuid": "df3b1e3eb43dc9eb479ad849cf55173d3092bd9a"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/01/marketing-strategies-from-the-worlds-top-ceos-and-entrepreneurs.html", "ord_in_thread": 0, "title": "Marketing strategies from the world’s top CEOs and entrepreneurs", "locations": [], "entities": {"persons": [{"name": "john legere", "sentiment": "none"}, {"name": "rene obermann", "sentiment": "none"}, {"name": "patrick t. fallon", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "deutsche telekom", "sentiment": "none"}, {"name": "t-mobile", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "virgin group", "sentiment": "none"}, {"name": "t-mobile us", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "From listening into customer care calls to starring in their own commercials, here are some top marketing tips from the world's most successful CEOs and entrepreneurs.\nLive the brand When T-Mobile U.S. was looking for a new CEO in 2011, it knew marketing would be an important part of its revival. \"We were in a very difficult situation in the U.S. We needed nothing less but a marketing genius in order to turn the company around,\" Rene Obermann, the former CEO of T-Mobile parent company Deutsche Telekom told CNBC show \"The Brave Ones.\" Enter AT&T veteran John Legere , who soon started wearing the magenta-and-black uniform of store staff, and now has a whole closet dedicated to the brand's bright pink apparel.\nPatrick T. Fallon | Bloomberg | Getty Images John Legere, T-Mobile US. \"Magenta's cool. I mean, it scales. People like it. It's not like yellow, you know. And then we just overdid it. We took it to its extremes. And I think we've created a whole new brand around magenta,\" he told \"The Brave Ones.\"\nFind the right name Richard Branson 's Virgin Group got its name when he was hanging out with friends as a teenager. \"One of the girls said: 'We're all virgins. Why don't you call it Virgin?'\" Branson told \" The Brave Ones .\" The name worked for every industry the company went into, because it was new to each. Nik Powell, Virgin's co-founder, said it was \"Very risqué and an immediate attention-grabber … It was just a great name.\"\nGet out of failing industries early Will Whitehorn, who worked as Virgin's brand development and corporate affairs director for more than two decades, told \"The Brave Ones\" that it's much better to cull a new project quickly if it's not working. \"An awful lot of organizations will, when they do plunge into a new development for a very, very big organization, they will keep going when it's clearly not working, for far too long,\" he said. Virgin, for example, sold its music retail business in 2007. \"We were the first people to get out of music retailing, to see the writing on the wall,\" Whitehorn added.\nJames Leynse | Getty Images Richard Branson at the opening of a Virgin Megastore in Times Square, New York City, in 1996 Focus on customers Many companies claim to be \"customer centric,\" prioritizing people who use their products over all others, but not that many do so in reality. When Legere took over at T-Mobile , he headed straight for the call centers.\n\"I got this resounding kind of feedback that people hated wireless … They would go to a store to buy a phone and they would come out with, like, all this stuff that they hated,\" he told CNBC's \"The Brave Ones.\"\n\"Nobody calls to say: 'I love you.' They call when they're so frustrated. And I heard the way that they were taking care of them. And it was a big part of me thinking that if I could get the whole company to behave that way and care about that customer so much, that we really could be different.\"\nLegere now gives out his email address to customers via his Facebook page, and his strategy has seen a turnaround to the tune of a $3.8 billion profit in 2016, up from a loss of $4.3 billion in 2011.\nUse your personality When Michael Dubin founded subscription razor business Dollar Shave Club (DSC), he launched it on a shoestring. He spent $4,500 on a YouTube ad that took a month to write and a day to shoot — and he decided to star in it himself. He'd done night classes in comedy improvisation, and his approach struck a chord with Unilever , which ended up buying the business for $1 billion in 2016.\nshow chapters Razor Sharp: A Conversation with Michael Dubin      4:34 PM ET Wed, 27 Sept 2017 | 34:05 \"DSC has built a cult-like following not just because of the products and their member-based offering, but frankly because of Michael's extraordinary approach to marketing, his great sense of humor, and also his vision. He is the fun guy you see in the commercials, but he is also a shrewd and committed business leader,\" Unilever President of Personal Care Alan Jope told CNBC via email.\nScrutinize your product When a business creates an expensive product, it must consistently stick to the highest standards. After 20 years in real estate, SOHO China CEO and billionaire Zhang Xin still scrutinizes her construction sites.\nBloomberg Zhang Xin, chief executive officer of SOHO China. \"The architects will tell you it's a pain to work with me. And all my staff will tell you: 'It's a pain for her to go to the construction site.' I always see problems, right? But I see this is my role: I'm the one who's safeguarding the standard, and I really should be the one who goes for the best.\"\nBeat the big guy Even if you're small fry in business, larger rivals can be beaten, according to Bill McDermott, CEO of SAP . As a teenager, he bought a Long Island delicatessen for $7,000, putting in video games to compete with the 7-Eleven down the street, which only let high school kids in four at a time.\nCNBC Bill McDermott, chief executive of SAP The business was successful enough to pay for his college education. \"What the little one has to do is figure out what the big one either is structurally unable to do because the rule book says you can't, or they're unwilling to do because they don't have that entrepreneurial spirit,\" he told \"The Brave Ones .\"", "external_links": [], "published": "2018-01-01T13:06:00.000+02:00", "crawled": "2018-01-01T12:25:04.021+02:00", "highlightTitle": ""}