{"organizations": [], "uuid": "01fe872856a18f11681f941244facfd7324af5e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/16/104220810-GettyImages-631794998.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/global-leaders-at-davos-need-to-listen-says-wef-exec.html", "country": "US", "domain_rank": 767, "title": "Global leaders at Davos need to listen, says WEF exec", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-21T12:24:00.000+02:00", "replies_count": 0, "uuid": "01fe872856a18f11681f941244facfd7324af5e2"}, "author": "Simon Dawson", "url": "https://www.cnbc.com/2018/01/15/global-leaders-at-davos-need-to-listen-says-wef-exec.html", "ord_in_thread": 0, "title": "Global leaders at Davos need to listen, says WEF exec", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "klaus schwab", "sentiment": "none"}, {"name": "simon dawson", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "wef", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "hotel davos", "sentiment": "none"}, {"name": "swiss police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Since the first incarnation of what is now the World Economic Forum (WEF) in 1971, the list of high-profile attendants, scope and ambitions at the event in Davos, Switzerland has grown considerably.\nWhen Klaus Schwab founded the forum, he invited around 400 business executives as he sought to introduce European companies to U.S. business practices.\nToday, Davos attracts several thousand attendees, ranging from heads of state and business executives to policy makers and celebrities, for almost a week's worth of workshops, speeches and discussions that focus on a central theme, 2018's being \"creating a shared future in a fractured world.\"\nAs it turns out, gathering world leaders in Davos is the easy part, while getting them to agree on the solutions to the world's most pressing problems such as climate change, sustainable industrial development, global inequality and poverty is far harder.\nThis is something that the event's organizers concede. Lee Howell, WEF's global head of programming, told CNBC that the event could always improve.\n\"What I think Davos could do better is to take that sense of community and actually catalyze much more change in those areas (of discussion),\" Howell said. \"So in a way it's able to create a space of trust and community, and then look at how it can help that community really work together.\n\"Having that shared interest (in resolving problems) is great but it's not sufficient. We need to get to a shared vision of that future and take action on it and I think if we can compel more of the community members to do that in whatever domain, then that alone would improve the state of the world.\"\n'Listening mode' Howell is a member of WEF's management board and is in charge of delivering the annual Davos event, as well as the forum's other meetings in China and in the United Arab Emirates (UAE). He said the Forum had created a space for leaders to collaborate, but attendees needed to ensure they were in \"listening mode\" as well as \"speaking\" mode.\n\"People expect that you can scale and find these solutions, but the underlying thing is that there are many great ideas,\" he said. \"But to mobilize individuals and institutions you have to create a trusted space for them to build that trust and want to work together.\" He added that leaders \"may all agree on the issue but their approach to it might differ quite a bit and you need to create a space to sort that out.\"\n\"People come to the annual meeting and they have their institutional mandate and goals they seek,\" Howell said. \"But they need to be less in speaking mode and more in listening mode. It's really an exercise in active listening — to understand what the Chinese might be saying on 'X' topic, or what the French feel about 'Y' topic… The chance of a more resilient and robust solution stems from that.\"\nStill, Howell said that Davos had achieved a lot to become as well-known and widespread in terms of its influence.\n\"This will be the 48th year and obviously it creates a sense of community. Whether it's a business or government or civil society or the media, they feel like they're part of something,\" he told CNBC.\n\"The real commitment (of everyone attending) is to come every year to a really cold and faraway place and spend the week together — and I'm really impressed when I meet people there who have been there 10, 15 or 20 years. So what it does best is create that sense of community.\"\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-21T12:24:00.000+02:00", "crawled": "2018-01-21T12:25:04.013+02:00", "highlightTitle": ""}