{"organizations": [], "uuid": "cd1fbc466937e6048c0a346f247c34b03aedc2ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928490-GettyImages-901226552.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/06/trump-says-on-twitter-he-is-a-very-stable-genius.html", "country": "US", "domain_rank": 767, "title": "Trump says on Twitter he is a 'very stable genius'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-06T14:43:00.000+02:00", "replies_count": 0, "uuid": "cd1fbc466937e6048c0a346f247c34b03aedc2ea"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/06/trump-says-on-twitter-he-is-a-very-stable-genius.html", "ord_in_thread": 0, "title": "Trump says on Twitter he is a 'very stable genius'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "show chapters Michael Wolff, author of tell-all Trump book, defends 'Fire and Fury'      1:41 PM ET Fri, 5 Jan 2018 | 01:06 U.S. President Donald Trump defended his intellect and mental capacity on Saturday, in the wake of the publication of a book taking aim at his fitness for office.\nSince excerpts were published earlier this week, author Michael Wolff's book, \"Fire and Fury: Inside the Trump White House,\" has sent shockwaves through the political world. The tome triggered an acrimonious and highly public split between Trump and Steve Bannon , who was ousted last year from the White House from his perch as one of the president's most trusted lieutenants.\nAmong other claims, Wolff described Trump's behavior in his book as childlike, and questioned his fitness for office. Via Twitter on Saturday, Trump hit back at those characterizations, and described himself as a \"very stable genius.\"\n\"Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart,\" Trump said.\n\"I went from VERY successful businessman, to top T.V. Star ... to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!\"\n\nTweet 1 \nTweet 2 \nTweet 3 \nThe claims made in \"Fire and Fury\" have attacked relentlessly by Trump and his allies. The book depicts a White House in a state of perpetual chaos, and a president who was ill-prepared to win the office in 2016. Wolff also wrote that many of Trump's own aides have scorned his intellectual capacity.\nYet the author himself, a celebrated media columnist, has acknowledged that he's uncertain how many of the accounts depicted in his book are actually true. \"Fire and Fury\" relies heavily on anecdotes and private conversations that Wolff wrote he believes are true — but in many instances are either contradictory or unverified.\n--Reuters contributed to this article.", "external_links": [], "published": "2018-01-06T14:43:00.000+02:00", "crawled": "2018-01-06T14:44:25.011+02:00", "highlightTitle": ""}