{"organizations": [], "uuid": "5b77f4cee07b04d05e9500176b8e9c864db8417e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219592461&w=1200&r=LYNXMPEE040PF", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-iran-rallies/iran-stages-pro-government-rallies-cleric-urges-firm-punishment-for-protest-leaders-idUSKBN1EU16G", "country": "US", "domain_rank": 408, "title": "Iran stages pro-government rallies, cleric urges firm punishment for protest leaders", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:40:00.000+02:00", "replies_count": 0, "uuid": "5b77f4cee07b04d05e9500176b8e9c864db8417e"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies/iran-stages-pro-government-rallies-cleric-urges-firm-punishment-for-protest-leaders-idUSKBN1EU16G", "ord_in_thread": 0, "title": "Iran stages pro-government rallies, cleric urges firm punishment for protest leaders", "locations": [], "entities": {"persons": [{"name": "khatami", "sentiment": "none"}, {"name": "ahmad khatami", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mashhad", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "parisa hafezi", "sentiment": "none"}, {"name": "min read  ankara", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:41 PM / Updated 31 minutes ago Iran stages pro-government rallies, cleric urges firm punishment for protest leaders Parisa Hafezi 5 Min Read \nANKARA (Reuters) - Tens of thousands of government supporters rallied across Iran on Friday, swearing allegiance to the clerical establishment and accusing arch-enemy the United States of instigating the biggest anti-government protests for nearly a decade, state TV reported. \nTehran’s Friday prayer leader called on authorities to deal “firmly” with those responsible for igniting over a week of demonstrations, in which 22 people were killed and more than 1,000 people were arrested, according to Iranian officials. \n“But those ordinary Iranians who were deceived by these American-backed rioters should be dealt with based on Islamic clemency,” cleric Ahmad Khatami told worshippers at Tehran university, TV reported. \nKhatami also called on the government to “pay more attention to people’s economic problems.” \nFor a graphic on Iranian protests, click tmsnrt.rs/2CXDYXZ \nProtests erupted on December 28 in the holy Shi‘ite city of Mashhad after the government announced plans to raise fuel prices and dismantle monthly cash handouts to lower-income Iranians. \nUnrest spread to more than 80 cities and rural towns as thousands of young and working class Iranians voiced anger at graft, unemployment and a deepening gap between rich and poor. \nSome 42,000 people took part in the unrest across the country, Interior Minister Abdolreza Rahmani Fazli was quoted as saying by state TV. \nTo try to allay tensions, the government suspended its planned fuel price hikes and cash handout cuts. Ali Rabiei, Iran’s minister of cooperatives, labor and social welfare, said the government had plans to create over 900,000 jobs by March 2019, the state news agency IRNA reported on Friday. \nThe authorities have produced no evidence of a U.S. role in the demonstrations, which have lacked a unifying leader. GUARDS QUELLED UNREST \nBut in Moscow, Russian Deputy Foreign Minister Sergei Ryabkov said Iran’s statements that external influences fomented the unrest were not groundless and that Washington used any possible method to destabilize governments it disliked. \nHe added that U.S. calls for an extraordinary meeting of the U.N. Security Council to discuss the turmoil in Iran interfered with the country’s sovereignty, news agency Interfax said. The Council will meet on Friday at 3 p.m. (2000 GMT) to discuss Iran, Council president Kazakhstan has said. \nResidents contacted by Reuters in various cities said the protests had shown sign of abating since Thursday, after the establishment intensified a crackdown on the protesters by dispatching Revolutionary Guards forces to several provinces. \nIran’s elite Guards and its affiliated Basij militia suppressed the country’s 2009 unrest over alleged election fraud, in which dozens of pro-reform Iranians were killed. \nIranian officials said the protests were the result of foreign instigation and mocked U.S. President Donald Trump’s support of protesters against what he called a “brutal and corrupt” establishment. \n“Eternal bedfellows #KSA (Saudi Arabia) and #ISIS (Islamic State) - following Trump’s lead - all endorse violence, death and destruction in Iran. Why are we not surprised?” Iranian Foreign Minister Mohammad Javad Zarif tweeted on Friday. \nLast year Islamic State (IS) militants carried out their first attack in Tehran, killing 18 people in a country that backed offensives against the group in Syria and Iraq. \nOn Friday rallies, protesters chanted “Death to America” and “Death to Israel”, carrying pictures of Iran’s top authority Supreme Leader Ayatollah Ali Khamenei, and waved Iranian flags. \nTelevision footage of rallies in several cities showed people chanting “We support Imam Khamenei ... We will not leave him alone in his fight against enemies”. \n“Demonstrators demand the punishment of those behind foreign-linked riots which insulted religion and our authorities,” state television reported, referring to unrest in which social media footage showed protesters tearing down pictures of Khamenei. UNITED FRONT \nHardline Khatami said the government should take more notice of Iranians’ economic problems. \n“There are workers who say they have not received their salaries for months ... These problems should be resolved,” Khatami said, according to state TV. \nFearing that further unrest could undermine the Islamic republic altogether, Iran’s faction-ridden political elite has displayed a united front. \nBut Khamenei and his hardline allies have criticized Rouhani for failing to revive the economy after most sanctions on Iran were lifted in 2016 under a deal reached between Tehran and major powers aimed at curbing the country’s nuclear program. \nRouhani secured the deal in 2015, raising hopes of better economic times among many Iranians, but discontent has since risen over the lack of broad improvement in living standards. Writing by Parisa Hafezi, Editing by William Maclean", "external_links": [], "published": "2018-01-05T14:40:00.000+02:00", "crawled": "2018-01-05T14:53:16.002+02:00", "highlightTitle": ""}