{"organizations": [], "uuid": "64d7e459ec5d9e0d118dede0814c1406b652b7e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223167989&w=1200&r=LYNXMPEE0H25U", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-australia-airlines-pilots/outback-australians-grounded-as-pilot-crisis-worsens-idUSKBN1F73AM", "country": "US", "domain_rank": 408, "title": "Outback Australians grounded as pilot crisis worsens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:00:00.000+02:00", "replies_count": 0, "uuid": "64d7e459ec5d9e0d118dede0814c1406b652b7e6"}, "author": "", "url": "https://www.reuters.com/article/us-australia-airlines-pilots/outback-australians-grounded-as-pilot-crisis-worsens-idUSKBN1F73AM", "ord_in_thread": 0, "title": "Outback Australians grounded as pilot crisis worsens", "locations": [], "entities": {"persons": [{"name": "jamie", "sentiment": "negative"}, {"name": "mcphee", "sentiment": "none"}, {"name": "ewen mcphee", "sentiment": "none"}], "locations": [{"name": "brisbane", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "outback", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "emerald", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "qantas airways ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A recruitment drive by Australia’s Qantas Airways Ltd ( QAN.AX ) after a seven-year hiatus is exacerbating shortages of pilots at regional air services that provide a lifeline to remote communities in the country’s sparsely populated Outback.\nAs airlines from Asia, Europe and North America vie for pilots amid a global shortage, there is growing concern among people in Australia’s vast interior who rely on flights to major cities for medical treatment.\nEwen McPhee, a doctor in the remote mining town of Emerald, said that when he referred patients for specialist care they often needed to travel nearly 1,000 km (621 miles) to the nearest big city, Brisbane.\n“Then they have to fly,” he said. “It is an 11-hour drive otherwise for an ill patient with quite a significant problem.”\nOver the last four months the 80-minute flights have not been as reliable as usual, McPhee said, with last-minute cancellations for lack of pilots.\nRegional Australia’s predicament illustrates the broader risks the aviation industry faces from a lack of pilots as the number of annual air passengers globally is expected to nearly double to 7.8 billion over the next 20 years.\nAround the world, airlines will be forced to review the wages, training and conditions they offer younger pilots as they open new routes and pursue ambitious expansion plans.\nAustralia’s pilot shortage closely parallels one in the United States, where major airlines are on a hiring spree and regional carriers like Seattle-based Horizon Air have canceled hundreds of flights because of a lack of aviators.\nBoth countries have a culture of pilots paying up to $100,000 of their own money for training and flying for years at regional carriers on low pay to gain experience to be hired by major airlines.\nTo help fill in the gaps, the Australian government has reopened two-year visas for foreign pilots. Regional airlines however say longer visas are required to attract pilots from overseas.\nQantas began hiring again in 2016 after years of financial strife, during which it offered pilots leave without pay to work for other airlines. By mid-2018, it says it will have employed 300 new pilots, many from regional airlines.\nVirgin Australia Holdings Ltd ( VAH.AX ) hired roughly another 120 pilots over the past year to fly major domestic and international routes.\nHIGH COSTS, LOW PAY While the Australian government offers loans of up to A$75,000 for students at select flying schools, trainee flyers still need tens of thousands of dollars from other sources to get their stripes.\nSuch costs are a major reason the number of student pilot licenses issued annually has fallen 23 percent since 2006, according to official figures.\nOnce out of flight school, young first officers at relatively large regional carriers only earn about A$60,000 ($48,000) a year, while being based in high-cost cities like Sydney where the average house price is about $1 million.\n“There is not a lot of incentive for smart young men and women to get into aviation,” said Shane Loney, a Qantas pilot and vice president of the Australian and International Pilot Association.\n“They have got a significant up-front cost to get qualified and then there isn’t good pay unless they’re fortunate enough to land a career with a big airline like Qantas or Virgin.”\nUnlike major Asian and European carriers such as Singapore Airlines Ltd ( SIAL.SI ) and easyJet plc ( EZJ.L ), Qantas does not offer a cadet program, although it partners with universities for its regional arm. Virgin, meanwhile, had 2,500 applications for 12 cadet spots last year.\nAustralia does not have a formal requirement for airline pilots to have 1,500 hours of flying experience like in the United States, but informally airlines want pilots with at least that number of hours for jets.\nEven junior turboprop pilots in Australia usually have hundreds of hours, said Kirsty Ferguson, the founder of Sydney-based airline interview coaching firm Pinstripe Solutions.\n“Australia is having the same gaps in regional flying as in the U.S.,” she said.\nGLOBAL CHURN U.S. regional carriers like Mesa Airlines Inc and Skywest Inc ( SKYW.O ) are so short of pilots they are raising salaries, offering sign-on bonuses worth up to $50,000 and aggressively recruiting Australians and other foreigners eligible for visas. The U.S. Airline Pilots Association has said regional salaries are moving in the right direction.\nIn Australia, airlines with tight profit margins have not raised pay significantly despite pressure from unions, even as profits have recovered due to heavy cost-cutting.\nAt Regional Express Holdings Ltd (Rex) ( REX.AX ), which operates 33-seat turboprops, former cadets are paying agreed penalties of more than A$25,000 to escape a seven-year contract to advance to better-paid jobs at bigger airlines.\nRex has seen a spike in turnover as bigger airlines recruit. It wants the government to open up four-year visas for pilots with a path to permanent residency, said Chris Hine, a senior Rex executive and chairman of its flying school.\nHigh turnover is not limited to Rex. Qantas’s regional arm QantasLink, which employs 400 pilots, hired more than 80 last year and expects to hire another 100 this year as pilots leave for bigger airlines, including Qantas.\nOthers are heading overseas to carriers such as Dubai’s Emirates and Hong Kong’s Cathay Pacific Airways Ltd ( 0293.HK ) while the opportunities are available.\n“It just follows the trend of cycles in aviation,” Australian Federation of Air Pilots President David Booth, a Virgin pilot, said of the hiring rush.\n“This one is a little bit worse than normal, but I don’t think it is going to last forever.”\nReporting by Jamie Freed in Singapore; Editing by Stephen Coates\n ", "external_links": [], "published": "2018-01-19T01:00:00.000+02:00", "crawled": "2018-01-19T01:17:05.025+02:00", "highlightTitle": ""}