{"organizations": [], "uuid": "400f00b65da9e7c1424d3033900ececa226b782b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221151743&w=1200&r=LYNXMPEE0A16B", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-turkey/turkey-to-end-extraditions-to-u-s-unless-cleric-is-turned-over-erdogan-says-idUKKBN1F01WO", "country": "US", "domain_rank": 408, "title": "Turkey to end extraditions to U.S. unless cleric is turned over, Erdogan says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:23:00.000+02:00", "replies_count": 0, "uuid": "400f00b65da9e7c1424d3033900ececa226b782b"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-turkey/turkey-to-end-extraditions-to-u-s-unless-cleric-is-turned-over-erdogan-says-idUKKBN1F01WO", "ord_in_thread": 0, "title": "Turkey to end extraditions to U.S. unless cleric is turned over, Erdogan says", "locations": [], "entities": {"persons": [{"name": "erdogan", "sentiment": "negative"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "fethullah gulen", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "bektas  ankara", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ak party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:28 PM / Updated an hour ago Turkey to end extraditions to U.S. unless cleric is turned over, Erdogan says Reuters Staff 3 Min Read \nANKARA (Reuters) - Turkey will not extradite any suspects to the United States if Washington does not hand over the cleric Ankara blames for orchestrating a failed 2016 military coup, President Tayyip Erdogan said on Thursday. FILE PHOTO - Turkish President Tayyip Erdogan addresses members of parliament from his ruling AK Party (AKP) during a meeting at the Turkish parliament in Ankara, Turkey, January 9, 2018. REUTERS/Umit Bektas \nAnkara accuses U.S.-based Turkish cleric Fethullah Gulen of masterminding the putsch and has repeatedly asked Washington for his extradition. U.S. officials have said courts require sufficient evidence to extradite the elderly cleric who has denied any involvement in the coup. \n“We have given the United States 12 terrorists so far, but they have not given us back the one we want. They made up excuses from thin air,” Erdogan told local administrators at a conference in his presidential palace in Ankara. \n“If you’re not giving him (Gulen) to us, then excuse us, but from now on whenever you ask us for another terrorist, as long as I am in office, you will not get them,” he said. \nTurkey is the biggest Muslim country in NATO and an important U.S. ally in the Middle East. \nBut Ankara and Washington have been at loggerheads over a wide range of issues in recent months, including a U.S. alliance with Kurdish fighters in Syria and the conviction of a Turkish bank executive in a U.S. sanctions-busting case that included testimony of corruption by senior Turkish officials. \nOn Wednesday, Foreign Minister Mevlut Cavusoglu said ties were harmed by Washington’s failure to extradite Gulen and U.S. support for Syria’s Kurdish YPG militia and its PYD political arm. He said relations could deteriorate further. \n“The United States does not listen to us, but it listens to the PYD/YPG. Can there be such a strategic partnership?... Turkey is not a country that will be tripped up by the United States’ inconsistent policies in the region,” Erdogan said. \nLast week, a U.S. jury convicted an executive of Turkey’s majority state-owned Halkbank of evading U.S. sanctions on Iran, in a case which Erdogan has condemned as a “political coup attempt” and a joint effort by the CIA, FBI and Gulen’s network to undermine Turkey. \nThe two countries also suspended issuing visas for months last year over a dispute following the detention of two locally employed U.S. consulate workers in Turkey on suspicion of links to the failed 2016 coup. Reporting by Tuvan Gumrukcu; Editing by Dominic Evans and Peter Graff", "external_links": [], "published": "2018-01-11T16:23:00.000+02:00", "crawled": "2018-01-11T16:52:17.020+02:00", "highlightTitle": ""}