{"organizations": [], "uuid": "07035fadec38189487190d84f4ee02c85603f410", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/07/03/100862477-93179630.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/22/davos-2018-elite-not-relevant-to-younger-generation-says-guy-hands.html", "country": "US", "domain_rank": 767, "title": "Davos 2018: Elite not relevant to younger generation says Guy Hands", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:26:00.000+02:00", "replies_count": 0, "uuid": "07035fadec38189487190d84f4ee02c85603f410"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/22/davos-2018-elite-not-relevant-to-younger-generation-says-guy-hands.html", "ord_in_thread": 0, "title": "Davos 2018: Elite not relevant to younger generation says Guy Hands", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "guy hands", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "terra firma capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.K. private equity investor Guy Hands said Monday that the Davos elite have become \"less relevant\" to the younger generation.\nThe world's leading politicians and business leaders are gathering this week in the Swiss resort to discuss the world's most pressing environmental, social and economic challenges. U.S. President Donald Trump has indicated that he may travel to Europe for the forum, although his attendance has yet to be confirmed.\nHands, who is the founder and chairman of Terra Firma Capital Partners, said Monday that the most difficult topic for people in Davos to ask themselves was why is there such a disconnect between society and the world elite?\n\"When I meet the sort of people that attend Davos, I look at them and look at myself, and think are we actually toads being boiled slowly in hot water?\n\"We seem to be becoming less relevant. We make more and more noise but actually, most people under 40 aren't very interested in what we have to say or are taking any notice of us,\" Hands said.\nThe investor said inequality is only partially about wealth and that areas such as academic achievement, housing and even access to water were all basic elements that many didn't feel they had a connection with.\nThe common enemy show chapters Europe is beginning to question the way economies work, investor says 8 Hours Ago | 01:35 On Brexit, Hands said he felt Europe had come together and that the U.K. was \"unfortunately now the common enemy.\"\nHe said he hoped the U.K. could have another referendum or parliament could use its power to reject any unsatisfactory agreement.\nHands expressed optimism for the European economy but said the U.K.was likely to lag in the coming years.\n\"The U.K. is in a difficult place. It is in a difficult place socially and politically and economics will eventually follow,\" he said.\nHands added that higher interest rates could bring short-term pain to some existing private equity deals but would overall indicate a healthier environment for deal-making.", "external_links": [], "published": "2018-01-22T15:26:00.000+02:00", "crawled": "2018-01-22T15:46:01.013+02:00", "highlightTitle": ""}