{"organizations": [], "uuid": "2eb5ce87d293956980483491cfde673a4fbf213a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 350, "shares": 350, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226800669&w=1200&r=LYNXMPEE0U05B", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-guantanamo/trump-signs-order-to-keep-guantanamo-detention-center-open-idUSKBN1FK0BT", "country": "US", "domain_rank": 408, "title": "Trump signs order to keep Guantanamo detention center open", "performance_score": 3, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T05:29:00.000+02:00", "replies_count": 0, "uuid": "2eb5ce87d293956980483491cfde673a4fbf213a"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-guantanamo/trump-signs-order-to-keep-guantanamo-detention-center-open-idUSKBN1FK0BT", "ord_in_thread": 0, "title": "Trump signs order to keep Guantanamo detention center open", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "steve holland", "sentiment": "none"}, {"name": "mary milliken", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "makini brice", "sentiment": "none"}, {"name": "peter cooney", "sentiment": "none"}, {"name": "mattis", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "guantanamo", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "guantanamo bay", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " U.S. President Donald Trump signed an order on Tuesday to keep open the military detention center at Guantanamo Bay after his Democratic predecessor, Barack Obama, tried unsuccessfully to close the prison that has drawn international condemnation.\nIn his first State of the Union address to Congress, Trump made clear he was fulfilling a campaign promise to keep operating the prison for foreign terrorism suspects at the U.S. military base at Guantanamo, Cuba.\n“I just signed, prior to walking in, an order directing (Defense) Secretary (Jim) Mattis ... to re-examine our military detention policy and to keep open the detention facilities in Guantanamo Bay,” Trump said.\nThe executive order authorized the U.S. military to add detainees and suggested the possibility that captured Islamic State militants could be sent there for the first time.\nObama signed an order on his first full day in office in 2009 ordering efforts to shutter Guantanamo within a year, but his plan was thwarted by mostly Republican opposition in Congress. Instead, his administration reduced the inmate population to 41 from 242 during his eight years in office.\nChain link fence and concertina wire surrounds a deserted guard tower within Joint Task Force Guantanamo's Camp Delta at the U.S. Naval Base in Guantanamo Bay, Cuba March 21, 2016. REUTERS/Lucas Jackson/File Photo The prison, which was opened by President George W. Bush to hold suspected militants captured overseas after the Sept. 11, 2001, attacks, came to symbolize harsh detention practices that opened the United States to accusations of torture.\nAs a presidential candidate, Trump vowed “to load it up with some bad dudes.” Since he became president a year ago, there is no indication any new prisoners have arrived.\nSlideshow (2 Images) “In the past, we have foolishly released hundreds and hundreds of dangerous terrorists, only to meet them again on the battlefield - including the ISIS leader, (Abu Bakr) al-Baghdadi, who we captured, who we had, who we released,” Trump said in the speech, referring to the Islamic State militant group.\nThe Syrian Observatory for Human Rights said in July that Baghdadi had been killed. Americans captured him in the beginning of the war in Iraq, and released him a year later, thinking he was a civilian agitator rather than a military threat.\nCivil liberties groups immediately denounced the executive order, and the Center for Constitutional Rights said it would file a legal challenge.\n“In trying to give new life to a prison that symbolizes America’s descent into torture and unlawful indefinite detention, Trump will not make this country any safer,” said Hina Shamsi, a director at the American Civil Liberties Union.\nAdditional reporting by Matt Spetalnick; Editing by Mary Milliken and Peter Cooney\n ", "external_links": [], "published": "2018-01-31T05:29:00.000+02:00", "crawled": "2018-01-31T05:41:45.001+02:00", "highlightTitle": ""}