{"organizations": [], "uuid": "3551098027bc39e42830291eeed907719c5c2c37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223090248&w=1200&r=LYNXMPEE0H1J8", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-figureskating-europe-medvedeva/zagitova-spoils-medvedevas-comeback-to-take-lead-at-europeans-idUKKBN1F72IE", "country": "US", "domain_rank": 408, "title": "Zagitova spoils Medvedeva's comeback to take lead at Europeans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:33:00.000+02:00", "replies_count": 0, "uuid": "3551098027bc39e42830291eeed907719c5c2c37"}, "author": "", "url": "https://uk.reuters.com/article/uk-figureskating-europe-medvedeva/zagitova-spoils-medvedevas-comeback-to-take-lead-at-europeans-idUKKBN1F72IE", "ord_in_thread": 0, "title": "Zagitova spoils Medvedeva's comeback to take lead at Europeans", "locations": [], "entities": {"persons": [{"name": "zagitova", "sentiment": "negative"}, {"name": "medvedeva", "sentiment": "negative"}, {"name": "axel", "sentiment": "none"}, {"name": "evgenia medvedeva", "sentiment": "none"}, {"name": "alina zagitova", "sentiment": "none"}], "locations": [{"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "europeans reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:35 PM / Updated 14 minutes ago Zagitova leads, Russian pairs sweep podium at Europeans Gabrielle Tetrault-Farber 3 Min Read \nMOSCOW (Reuters) - Twice world champion Evgenia Medvedeva was upstaged by Russian compatriot Alina Zagitova in the short programme at the European championships on Thursday as Russians pairs swept the podium on home ice. \nThe 15-year-old Zagitova, who won the Grand Prix Final last month while her training partner Medvedeva was sidelined with a fractured foot, was rewarded with a score of 80.27 points for her short programme which featured a cleanly-executed triple Lutz-triple loop combination. \nMedvedeva, who has not lost a competition for more than two years, finished second with 78.57 points after stepping out of her double Axel. \n“I‘m not pleased with my performance today but I still have time to make adjustments,” said Medvedeva, who grimaced at the end of her skate. \n“My foot recovered very quickly. I never thought I would say this but I am glad that I have felt that this is my sport. I missed the competitions and training. It was a difficult period.” \nTrailing Zagitova by only 1.7 points, the 18-year-old Medvedeva is still in the running to secure a third consecutive European title following Saturday’s free skate. \nMedvedeva topped the podium at last year’s Grand Prix events in Moscow and Osaka but missed the Grand Prix Final because of a cracked bone in her right foot, raising questions about her readiness to compete at next month’s Pyeongchang Olympics. \nThe injury also prevented her from competing at last month’s Russian national championships. \nItaly’s Carolina Kostner, a five-times European champion, finished third with 78.30 points despite a slight error on her triple toeloop. Figure Skating - ISU European Championships 2018 - Ladies Short Program - Moscow, Russia - January 18, 2018 - Evgenia Medvedeva of Russia competes. REUTERS/Grigory Dukor \n“I am very happy with my performance,” Kostner told a news conference. “I felt grounded and serene.” RUSSIAN PAIRS SWEEP \nRussian pairs swept the podium after a free skate in which the French duo who had finished first in the short programme on Wednesday missed the top three by a hundredth of a point. Slideshow (4 Images) \nAfter sliding into fifth after an error-filled short programme, defending European champions Evgenia Tarasova and Vladimir Morozov bounced back with a cleaner but still imperfect free skate to win gold with 221.60 points overall. \n“We were really upset after the short programme,” Morozov told reporters. “We were angry at ourselves, at our opponents, at the situation, at everything. But today we skated our best. We skated boldly.” \nKsenia Stolbova and Fedor Klimov finished more than 10 points behind Tarasova and Morozov to take silver despite struggling on their jumps. Natalia Zabiiako and Alexander Enbert took bronze with 210.18 points. \n“We had trouble on five jumps in a row and had issues that maybe were not visible to the eye but that I didn’t like,” Klimov told reporters. \nFrance’s Vanessa James and Morgan Cipres, bronze medallists at last year’s European championships, finished fourth with 210.17 points. \n“We’re disappointed,” James said. “We knew we had a shot at the podium, but we weren’t there today. We made too many mistakes.” Reporting by Gabrielle Tétrault-Farber, editing by Pritha Sarkar and Ed Osmond", "external_links": [], "published": "2018-01-18T19:33:00.000+02:00", "crawled": "2018-01-18T21:00:33.026+02:00", "highlightTitle": ""}