{"organizations": [], "uuid": "7b9381bba99ab4adccf9f0b32a942e9dad6c7812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 285}, "facebook": {"likes": 1986, "shares": 1986, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/19/104783896-GettyImages-821591784-jetblue.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/jetblue-to-give-crew-members-1000-bonuses-after-tax-bill.html", "country": "US", "domain_rank": 767, "title": "JetBlue to give crew members $1,000 bonuses after tax bill", "performance_score": 10, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-05T01:03:00.000+02:00", "replies_count": 0, "uuid": "7b9381bba99ab4adccf9f0b32a942e9dad6c7812"}, "author": "Christine Wang", "url": "https://www.cnbc.com/2018/01/04/jetblue-to-give-crew-members-1000-bonuses-after-tax-bill.html", "ord_in_thread": 0, "title": "JetBlue to give crew members $1,000 bonuses after tax bill", "locations": [], "entities": {"persons": [{"name": "mark kauzlarich", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "john f. kennedy international airport", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "jetblue", "sentiment": "negative"}, {"name": "american and southwest", "sentiment": "none"}, {"name": "customers", "sentiment": "none"}, {"name": "jetblue airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JetBlue Airways said Thursday that it will give bonuses of $1,000 to each of its 21,000 crew members.\nThe company said that its CEO and executive vice presidents would not receive this bonus.\nIn December, President Donald Trump signed a bill that overhauls the U.S. tax code. One of the biggest changes it makes is slashing the corporate tax rate to 21 percent from 35 percent.\nJetBlue said in its letter to employees that it believes \"these tax changes will be positive for our company, and provide us the opportunity to do good things for our Crewmembers, Customers and shareholders.\"\nOther airlines have made similar announcements following the passage of the bill.\nOn Tuesday, American and Southwest both said they would give their employees bonuses of $1,000 each. Here's a scorecard of the announcements from the largest U.S. companies.\nRead JetBlue's full statement below:\nDear Crewmembers,\nYou've likely seen the news about U.S. tax reform. We believe these tax changes will be positive for our company, and provide us the opportunity to do good things for our Crewmembers, Customers and shareholders.\nWhen tax reform looked like a real possibility late last year, we formed a team to think through what it could mean for each of these important groups. Many ideas are on the table but we believe our Crewmembers should be the first to benefit. With that in mind, we are excited to announce we will be paying every Crewmember employed as of December 31, 2017, a $1,000 bonus by the end of February!\nCrewmembers like you are the heart of JetBlue and the reason we have become one of the most awarded airlines (and brands) in the world. We're delighted we're able to offer this extra thank you for your incredible efforts. In the months ahead, we look forward to working with our Values Committees and directly with you on other ideas for how we can use tax reform benefits to make JetBlue even stronger.\nAs a smaller airline competing against four very large competitors it is vital we continue to run a sustainable and profitable company. With over 50% of Crewmembers also being shareholders, we understand the importance of retaining investors' confidence in our company better than anyone else.\nUltimately, we will continue to succeed because we have the best Crewmembers in the business. All 21,217 of us are continuing to do something that is truly unique in our industry by genuinely caring for each other, our Customers and our shareholders.\nFinally, the new year has barely begun and we are already in our first winter irregular operation. We know today's weather presents demanding operating conditions. As we manage through the storm, let's remind ourselves of our #1 value – Safety. Every Crewmember is empowered to call a safety time-out if needed. This is ultimately the most important responsibility any of us have.\nWe're looking forward to a great 2018 here at JetBlue. Thanks for being part of it.\nBest wishes.\n—CNBC's Fred Imbert contributed to this report.\nWATCH: JetBlue partners with Gladly to upgrade customer service tech show chapters JetBlue partners with Gladly to upgrade customer service tech 2:22 PM ET Tue, 8 Aug 2017 | 03:27", "external_links": [], "published": "2018-01-05T01:03:00.000+02:00", "crawled": "2018-01-05T01:03:07.002+02:00", "highlightTitle": ""}