{"organizations": [], "uuid": "83daa5c3dda7f4a3e7e8fd253e7c84595af44587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-pioneer-in-taking-immunotherapies-through-the-clinic-joins-dragonfly-therapeutics-as-chief-medical-officer.html", "country": "US", "domain_rank": 767, "title": "Pioneer in Taking Immunotherapies Through the Clinic Joins Dragonfly Therapeutics as Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T18:02:00.000+02:00", "replies_count": 0, "uuid": "83daa5c3dda7f4a3e7e8fd253e7c84595af44587"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-pioneer-in-taking-immunotherapies-through-the-clinic-joins-dragonfly-therapeutics-as-chief-medical-officer.html", "ord_in_thread": 0, "title": "Pioneer in Taking Immunotherapies Through the Clinic Joins Dragonfly Therapeutics as Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "jean-marie cuillerot", "sentiment": "negative"}, {"name": "cuillerot", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "ipilimumab life cycle management", "sentiment": "none"}, {"name": "bristol-myers squibb", "sentiment": "none"}, {"name": "dragonfly therapeutics, inc.", "sentiment": "none"}, {"name": "bms", "sentiment": "none"}, {"name": "merck serono", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dr. Jean-Marie Cuillerot brings to the company his unique experience as a clinician who took two of the first cancer immunotherapies successfully through the clinic.\nWALTHAM, Mass., Jan. 29, 2018 /PRNewswire/ -- Dragonfly Therapeutics, Inc. (\"Dragonfly\"), today announced Dr. Jean-Marie Cuillerot, M.D., has joined the company as its Chief Medical Officer (\"CMO\"). Dr. Cuillerot will head clinical development of Dragonfly's novel Natural Killer (NK) cell-based immunotherapies.\nDr. Cuillerot joins Dragonfly with 20 years' experience in drug development and 15 years of unique experience in immunotherapy as one of the first clinicians to bring early immunotherapy drugs successfully through the clinic, initially while at Bristol-Myers Squibb (\"BMS\") and then again at Merck Serono.\nAt BMS, Dr. Cuillerot was the Medical Lead for Ipilimumab Life Cycle Management, developing the company's anti-CTLA-4 antibody as a treatment for lung cancer, castrate resistant prostate cancer, ovarian cancer, gastric cancer and adjuvant melanoma, and leading the execution of many of its critical clinical studies. In this role, he supported the filing activities of Iipilimumab, the world's first immune checkpoint therapy for cancer.\nFollowing his work at BMS, Dr. Cuillerot served as Global Head of Clinical Development, Immuno-Oncology, and Vice President of Clinical Immunotherapy/Immuno-Oncology at EMD Serono, an affiliate of Merck Serono. At EMD Serano, he oversaw the company's immuno-oncology portfolio, which included two checkpoint inhibitors and two immuno-cytokines. In this role, Dr. Cuillerot advanced Avelumab from pre-IND though international approvals in record time, including as the first drug approved to treat Merkel cell carcinoma and second line bladder cancer.\n\"We are delighted to welcome Jean-Marie, a gifted oncologist with deep clinical expertise in immunotherapy, to a leading role at Dragonfly,\" said Bill Haney, co-founder and CEO of Dragonfly Therapeutics. \"As a pioneering clinician who helped drive the first immunotherapries to patients, his talent will be invaluable in achieving our shared goal of rapidly providing cancer-curing therapies for the millions of patients that are still not served by immunotherapy.\"\n\"I am interested in game-changing innovation in immunotherapy,\" said Dr. Cuillerot, \"and Dragonfly's TrinKET platform offers extraordinary therapeutic performance with a unique safety profile. This powerful and novel approach combined with a world-class team is what makes me so enthusiastic about joining the company.\"\n\"Dragonfly plans to file its first IND in 2019,\" said Dr. Tyler Jacks, co-founder of Dragonfly and Director of MIT's Koch Institute of Intergrative Cancer Research, \"while simultaneously providing drug candidates to our pharma partners on a similar trajectory. Jean-Marie's experience leading first in class candidates successfully and rapidly through the clinic speaks to his deep understanding of both the needs of patients and those of the regulatory agencies. I'm very excited to be working together with him on Dragonfly's team.\"\nDr. Cuillerot received his B.S. in biochemistry, M.Sc. in cellular and molecular biology and M.D., at the University Louis Pasteur (Strasbourg, France).\nAbout Dragonfly\nDragonfly Therapeutics is committed to discovering, developing and commercializing therapies that use its novel TriNKET™ technology to harness the body's innate immune system to bring breakthrough cancer treatments to patients.\nFor more information visit: www.dragonflytx.com , https://www.facebook.com/dragonflytherapeutics/ , https://twitter.com/dragonflytx\nMedia Contact:\nMaura McCarthy\n617-588-0086 x702\nmaura@dragonflytx.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/pioneer-in-taking-immunotherapies-through-the-clinic-joins-dragonfly-therapeutics-as-chief-medical-officer-300589498.html\nSOURCE Dragonfly Therapeutics, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/pioneer-in-taking-immunotherapies-through-the-clinic-joins-dragonfly-therapeutics-as-chief-medical-officer-300589498.html", "http://www.dragonflytx.com/", "https://www.facebook.com/dragonflytherapeutics/", "https://twitter.com/dragonflytx"], "published": "2018-01-29T18:02:00.000+02:00", "crawled": "2018-01-29T19:27:53.021+02:00", "highlightTitle": ""}