{"organizations": [], "uuid": "55b28e56efc7a065de6456e422f444705be8323d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-euro-jumps-after-ecb-minutes-stocks-gain-with-energy-idUSL8N1P64YG", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Euro jumps after ECB minutes; stocks gain with energy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:10:00.000+02:00", "replies_count": 0, "uuid": "55b28e56efc7a065de6456e422f444705be8323d"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-euro-jumps-after-ecb-minutes-stocks-gain-with-energy-idUSL8N1P64YG", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Euro jumps after ECB minutes; stocks gain with energy", "locations": [], "entities": {"persons": [{"name": "caroline valetkevitch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 5:10 PM / Updated 6 minutes ago GLOBAL MARKETS-Euro jumps after ECB minutes; stocks gain with energy Reuters Staff \n* Wall St higher on gains in energy, industrial stocks \n* U.S. Treasury yields fall after China disputes report \n* Oil highest since 2014 as global stocks tighten (Updates with early U.S. market trading, changes dateline from LONDON) \nBy Caroline Valetkevitch \nNEW YORK, Jan 11 (Reuters) - The euro jumped against the dollar on Thursday as the European Central Bank signalled it could begin to wind down its 2.5-trillion euro stimulus program this year, while oil prices hit their highest since 2014 on tightening crude stocks, lifting energy shares. \nU.S. Treasury yields fell after China disputed a report that its government officials had recommended the country slow or halt its purchases of the U.S. bonds. The Bloomberg News report had lifted yields on the 10-year government bond to a 10-month high on Wednesday. \nThe European Central Bank should revisit its communication stance in early 2018, accounts of its December meeting showed, suggesting that policymakers could soon start preparing markets for the end of the bank’s massive stimulus. \n“The expectation that the ECB is moving toward removal of stimulus is helping lift interest rate yields further. This has been long expected, but there was more formality in the minutes around how the bank will manage the forward guidance process as they exit unconventional policy,” said Karl Schamotta, director of global product and market strategy at Cambridge Global Payments in Toronto. \nThe dollar index fell 0.46 percent, with the euro up 0.74 percent to $1.2033. \nThe Canadian dollar steadied against the greenback after hitting a nearly two-week low as investors weighed chances of a Bank of Canada interest rate hike next week and worried about the possibility of a U.S. withdrawal from the North American Free Trade Agreement. \nU.S. stocks were higher in early trading after the S&P 500 suffered its first down day of the year on Wednesday. The S&P energy index was up 2 percent. \nThe Dow Jones Industrial Average rose 106.63 points, or 0.42 percent, to 25,475.76, the S&P 500 gained 9.1 points, or 0.33 percent, to 2,757.33 and the Nasdaq Composite added 26.87 points, or 0.38 percent, to 7,180.44. \nThe pan-European FTSEurofirst 300 index lost 0.23 percent and MSCI’s gauge of stocks across the globe gained 0.19 percent. \nIn the U.S. bond market, benchmark 10-year notes last fell 3/32 in price to yield 2.5605 percent, from 2.549 percent late on Wednesday. \nU.S. crude rose 1.48 percent to $64.51 per barrel and Brent was last at $69.75, up 0.79 percent on the day. \nBitcoin was 4.8-percent lower at $14,168.95 on the Luxembourg-based Bitstamp exchange after South Korea’s government said it plans to ban cryptocurrency trading. Additional reporting by Marc Jones in London and Saqib Iqbal Ahmed in New York; Editing by William Maclean and Nick Zieminski", "external_links": [], "published": "2018-01-11T19:10:00.000+02:00", "crawled": "2018-01-11T19:18:58.011+02:00", "highlightTitle": ""}