{"organizations": [], "uuid": "594dd2d6a2c3859cd472a65e17798255133d8693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219254723&w=1200&r=LYNXMPEE030DP", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-aldi-uk-outlook/aldi-uks-december-sales-up-over-15-percent-idUKKBN1ET0NB", "country": "US", "domain_rank": 408, "title": "Aldi UK's December sales up over 15 percent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T09:35:00.000+02:00", "replies_count": 0, "uuid": "594dd2d6a2c3859cd472a65e17798255133d8693"}, "author": "", "url": "https://uk.reuters.com/article/uk-aldi-uk-outlook/aldi-uks-december-sales-up-over-15-percent-idUKKBN1ET0NB", "ord_in_thread": 0, "title": "Aldi UK's December sales up over 15 percent", "locations": [], "entities": {"persons": [{"name": "tesco", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "james davey", "sentiment": "none"}, {"name": "susan fenton", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "aldi uk", "sentiment": "negative"}, {"name": "asda", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 7:22 AM / Updated 25 minutes ago Aldi pursues UK expansion after record Christmas James Davey 3 Min Read \nLONDON (Reuters) - Aldi UK, the British arm of the German discount supermarket, said it would press ahead with its aggressive expansion in 2018 after a record Christmas sales performance, boosted by demand for its premium ranges. \nThe rise of privately-owned discounters Aldi and Lidl has transformed UK food retailing over the last decade, driving down the returns of Britain’s big four players -- market leader Tesco ( TSCO.L ), Sainsbury’s ( SBRY.L ), Asda ( WMT.N ) and Morrisons ( MRW.L ). \nWhile the established big four have fought back by cutting prices and improving service they are still losing market share to Aldi and Lidl, which are opening new stores at a rapid pace. \nAldi added 76 stores in 2017, bringing the total to 762 and is targeting 1,000 stores across the UK by 2022. A further 70 store openings are planned for this year. \n“We see significant capacity for further growth as there are still more than 400 towns and cities across the UK without an Aldi store,” Aldi UK & Ireland CEO Matthew Barnes said on Thursday. \n“Shoppers in these areas consistently tell us they would shop at Aldi if they could, and we are committed to meeting this demand for new Aldi stores,” he added. \nAldi’s expansion plans have not been slowed by three straight years of falling profit. It says its German parent, Aldi Sud, is investing in the UK for the long term. \nIndustry data published last month put Aldi’s UK grocery market share at 6.9 percent, up 0.7 percentage points on the year. Last year it overtook the Co-operative Group to become Britain’s fifth largest grocer. \nWith its expansion plans it now has Morrisons, which currently has a market share of 10.6 percent, in its sights. Slideshow (3 Images) PREMIUM DEMAND \nAldi said its sales rose over 15 percent in December year-on-year, taking the annual figure for the UK and Ireland over 10 billion pounds for the first time. Sales in 2016 were 8.74 billion pounds. \nAldi did not provide a like-for-like sales number. \nBernstein analyst Bruno Monteyne said the 15 percent number was largely driven by additional space and inflation. He estimated volume like-for-like growth of 2.5 percent, which he said implied a slowdown from last year. \nAldi UK said it saw a surge in demand for its premium “Specially Selected” products, with sales increasing by over 30 percent during December. \nIt said top-selling premium products included Aberdeen Angus beef roasting joints and Irish cream liqueur. \n“Although we saw strong growth across all categories, the performance of our premium Specially Selected range in particular surpassed all expectations,” said Barnes. \nAldi UK also said on Thursday it would pay its store assistants a minimum of 8.85 pounds an hour from Feb. 1 - matching the rate recommended by campaigning group Living Wage Foundation. \nTesco, Sainsbury’s and Morrisons are all scheduled to update on Christmas trading next week. Editing by Keith Weir", "external_links": [], "published": "2018-01-04T09:35:00.000+02:00", "crawled": "2018-01-04T09:48:50.010+02:00", "highlightTitle": ""}