{"organizations": [], "uuid": "faba031d9cd3ca771de116ce0a4e2c6485768b5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/06/gop-2016-koch-brother_moun.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/trust-ventures-koch-brothers/", "country": "US", "domain_rank": 1196, "title": "How A New VC Firm Wants to Take on Government Regulations | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.59, "site_type": "news", "published": "2018-01-31T14:56:00.000+02:00", "replies_count": 0, "uuid": "faba031d9cd3ca771de116ce0a4e2c6485768b5b"}, "author": "Alana Abramson", "url": "http://fortune.com/2018/01/31/trust-ventures-koch-brothers/", "ord_in_thread": 0, "title": "How A New VC Firm Wants to Take on Government Regulations | Fortune", "locations": [], "entities": {"persons": [{"name": "charles", "sentiment": "none"}, {"name": "david koch", "sentiment": "none"}, {"name": "alana abramson", "sentiment": "none"}, {"name": "tochman", "sentiment": "none"}, {"name": "churi", "sentiment": "none"}, {"name": "salen churi", "sentiment": "none"}, {"name": "charles koch", "sentiment": "none"}, {"name": "koch", "sentiment": "none"}, {"name": "brian tochman", "sentiment": "none"}], "locations": [{"name": "wichita", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}], "organizations": [{"name": "fortune venture capital deals", "sentiment": "neutral"}, {"name": "trust ventures", "sentiment": "none"}, {"name": "innovation clinic at university of chicago law school", "sentiment": "none"}, {"name": "koch industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital Deals A New VC Firm Tied to the Koch Brothers Plans to Take on Government Regulations In this photo May 22, 2012 file photo, Charles Koch speaks in his office at Koch Industries in Wichita, Kansas. Photograph by Bo Rader/AP By Alana Abramson 12:56 PM EST \nA new venture capital firm that has launched with the support of the Koch brothers is looking for startups that will challenge government corruption and regulations. \nTrust Ventures, is designed to “find, fund, and assist companies whose groundbreaking products, services, and innovations would otherwise be locked out of the marketplace by burdensome public policy barriers,” according to a release announcing the launch. \nIt was founded by Salen Churi, a professor and founder of the Innovation Clinic at University of Chicago Law School, and Brian Tochman. The fund will work with the public sector portion of Koch Industries, run by billionaire and Republican mega-donors Charles and David Koch , to help navigate public policy and regulatory law. \nChuri and Tochman are both members of the new leadership organization of the Koch Seminar network, where 550 of the Koch network’s largest donors convened in Indian Wells, California for their annual winter meeting. They announced their new venture at the event this week. \n“Incredible advancements in life-changing technology are sitting just out of sight and out of reach because of barriers put in place by well-connected interests that try to limit competition and disruption,” Tochman said in the release. “How many millions of lives could be transformed by the unknown products or services these companies could offer if it weren’t for politically connected special interests blocking them out? Our mission is to help identify these life-changing innovations, remove the barriers standing in their way, and bring them to market.” \nTochman and Churi told Fortune that they plan to focus their investments on highly regulated industries – but they aren’t confining themselves to one field. \n“This is areas where there is a barrier—and that can be cronyism, that can be regulation, that we can effect change through,” the founders explained. “We’re a for-profit venture fund but we have this social mission as well where we’re trying to break down these barriers because we think thats the greatest way to add value for people.” \nThey cited the start-up company Zipline, which uses drones to deliver medicines and blood in Rwanda — Quartz called it “Uber for blood” — as the ideal company to invest in. They said disruptive companies like AirBnB and Uber are ideal models for their firm to invest in. \n“The reason this is happening in Rwanda and not the United States is because current FAA policies lock them out,” Tochman and Churi said in a statement. \nThe vision for the fund is consistent with the Koch brothers’ ideology of limited government and regulations, which is why Churi and Tochman said they chose the seminar as their launching grounds. \n“We think there are great opportunities to work with Koch. Koch has been great in pressure testing and helping us to think through this and obviously the seminar here represents a lot of people who could be really great allies and great supporters. So this was kind of an obvious place for us to launch this,” they said. \nKoch Industries has not announced an investment in Trust Ventures at this time. \n(Disclosure: Time Inc., TIME’s parent company, has been acquired by Meredith Corp. in a deal partially financed by Koch Equity Development, a subsidiary of Koch Industries Inc.) SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T14:56:00.000+02:00", "crawled": "2018-01-31T21:15:15.028+02:00", "highlightTitle": ""}