{"organizations": [], "uuid": "4266da8d0d1ecc0570fd575d914350b07f3ca4e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sullivancotter-expands-physician-workforce-consulting-services.html", "country": "US", "domain_rank": 767, "title": "SullivanCotter Expands Physician Workforce Consulting Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-16T16:35:00.000+02:00", "replies_count": 0, "uuid": "4266da8d0d1ecc0570fd575d914350b07f3ca4e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sullivancotter-expands-physician-workforce-consulting-services.html", "ord_in_thread": 0, "title": "SullivanCotter Expands Physician Workforce Consulting Services", "locations": [], "entities": {"persons": [{"name": "sullivan", "sentiment": "negative"}, {"name": "ron", "sentiment": "none"}, {"name": "ron vance", "sentiment": "none"}, {"name": "ted chien", "sentiment": "none"}, {"name": "patty bohney", "sentiment": "none"}, {"name": "patty", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "cotter and associates, inc.", "sentiment": "neutral"}, {"name": "healthcare practice", "sentiment": "none"}, {"name": "navigant", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 16, 2018 /PRNewswire-USNewswire/ -- Sullivan, Cotter and Associates, Inc., the leading independent consulting firm in the assessment and development of performance-based total rewards programs and workforce solutions for the health care industry and not-for-profit sector, announces the expansion of the firm's physician workforce services with the hiring of industry leaders Ron Vance, Patty Bohney and an additional team of five talented consultants. All associates were previously with Navigant's Healthcare Practice, and bring specialized expertise in physician compensation and workforce performance.\n\"In the rapidly changing health care environment, we continue to scale our services and broaden our expertise in ways that help our clients address an increasingly diverse set of strategic challenges. With extensive experience in physician alignment and compensation design, Ron and Patty's team will be a tremendous asset in delivering long-term, sustainable value to the organizations we advise,\" said Ted Chien, President and CEO, SullivanCotter.\nRon Vance joins SullivanCotter as a Managing Principal and will help to lead the firm's client engagements in enterprise workforce alignment alongside newly-appointed Chief Medical Officer, Dr. Mark Rumans. As an attorney, consultant and certified valuation analyst with more than 30 years of experience in strategic planning, physician-hospital alignment and the development of progressive physician compensation arrangements, Ron has advised a wide variety of health care organizations — including community health systems, private physician practices and academic medical centers — through periods of transformative change.\nPatty Bohney joins the firm as a Principal in the Physician Workforce Practice. She has nearly 30 years of combined industry experience as a registered nurse, in addition to a variety of operational, management and consulting roles. Leveraging this unique breadth of expertise and a deep working knowledge of the evolving provider landscape, Patty will work closely with clients on the design, implementation and management of strategic, performance-driven physician compensation programs. She is also a certified valuation analyst and will assist a growing team of consultants in determining fair market value and commercial reasonableness.\nIn addition to Ron and Patty, SullivanCotter welcomes Kevin Hendrickson, Jaclyn Zurawski, Tony Francis, Kaizad Daruwala and Benjamin Shamis to the firm's Physician Workforce Practice.\nAbout SullivanCotter\nSullivanCotter is the leading independent consulting firm in the assessment and development of performance-based total rewards programs and workforce solutions for the health care industry and not-for-profit sector. For 25 years, the firm has provided unbiased advice to executives and boards to help attract, retain and motivate executives, physicians, advanced practice clinicians and employees at all levels. Through the Center for Information, Analytics and Insights, SullivanCotter has developed the most widely recognized compensation surveys in the United States. Combining data-driven intelligence with national insights, we act with integrity to help organizations fulfill their missions, business objectives and regulatory requirements.\nContact: Becky Lorentz\nSullivan, Cotter and Associates, Inc.\nbeckylorentz@sullivancotter.com\n314.414.3719\nView original content: http://www.prnewswire.com/news-releases/sullivancotter-expands-physician-workforce-consulting-services-300582653.html\nSOURCE Sullivan, Cotter and Associates, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/sullivancotter-expands-physician-workforce-consulting-services-300582653.html"], "published": "2018-01-16T16:35:00.000+02:00", "crawled": "2018-01-16T19:37:40.001+02:00", "highlightTitle": ""}