{"organizations": [], "uuid": "760a41fc31d21bbebdc8b368ba5650e0b603718e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226785603&w=1200&r=LYNXMPEE0U02Y", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-thomsonreuters-f-r-blackstone-trust/factbox-thomson-reuters-the-history-and-purpose-of-the-trust-principles-idUSKBN1FK08R", "country": "US", "domain_rank": 408, "title": "Factbox - Thomson Reuters: the history and purpose of the 'Trust Principles'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.462, "site_type": "news", "published": "2018-01-31T10:25:00.000+02:00", "replies_count": 0, "uuid": "760a41fc31d21bbebdc8b368ba5650e0b603718e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-thomsonreuters-f-r-blackstone-trust/factbox-thomson-reuters-the-history-and-purpose-of-the-trust-principles-idUSKBN1FK08R", "ord_in_thread": 0, "title": "Factbox - Thomson Reuters: the history and purpose of the 'Trust Principles'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trust principles", "sentiment": "negative"}, {"name": "factbox - thomson reuters", "sentiment": "negative"}, {"name": "thomson reuters corp", "sentiment": "negative"}, {"name": "reuters group plc", "sentiment": "none"}, {"name": "reuters founders share co ltd", "sentiment": "none"}, {"name": "reuters group", "sentiment": "none"}, {"name": "thomson corp", "sentiment": "none"}, {"name": "uk newspaper publishers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Thomson Reuters Corp has operated under the Trust Principles established by Reuters since the Thomson Corp purchase of Reuters Group in 2008. This is a guide to the history and purpose of the Trust Principles\nQ: When were the Trust Principles established?\nA: The five Trust Principles were set in 1941, in the midst of World War Two and at a time when there were threats of censorship and “propaganda” around the world. They were formed under an agreement between the UK Newspaper Publishers Association and the shareholders of Reuters at the time. The core principle is that “Reuters is dedicated to preserving its independence, integrity and freedom from bias in the gathering and dissemination of news and information.”\nQ: What are the five Trust Principles?\nA: The five principles are available online at: ( here )\nQ: How have the principles been preserved in the decades since they were established ?\nA: When the Reuters Group Plc became a publicly listed company in 1984, a new company was formed called Reuters Founders Share Co Ltd whose sole purpose was to hold a “Founders Share” in Reuters. If the directors of Reuters Founders Share Co believed that any party was seeking to obtain or had obtained control of Reuters, they could exercise voting rights attached to the Founders Share, allowing them the right to cast sufficient votes at any general meeting of Reuters Group Plc to pass any resolution or defeat any resolution.\nQ: So when Thomson and Reuters entered into their merger agreement in 2008, did that violate the principle that Reuters Group “shall at no time pass into the hands of any one interest, group, or faction?”\nA: The Reuters Founders Share Co backed the deal. The directors were given assurances by Thomson and Woodbridge, the Thomson family’s private investment company and controlling shareholder of Thomson Co, that they would uphold the principles. Woodbridge was granted an exemption to the 15 percent shareholding limit set by the Trust Principles.\nQ: Now there is another change coming to Thomson Reuters, with Blackstone Group LP buying a majority stake in the company’s Financial & Risk business. What will happen to the Trust Principles?\nA: In announcing the agreement with Blackstone, Jim Smith, the chief executive officer of Thomson Reuters, was very clear about maintaining the Trust Principles.\n“Reuters News will maintain complete editorial freedom, and continue to operate under the Trust Principles,” Smith said in a statement. “There has never been a more important time for providing trusted news, and that is what Reuters will continue to deliver on with accuracy and integrity,” he added.\nReporting by Leslie Adler\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T10:25:00.000+02:00", "crawled": "2018-01-31T04:30:44.008+02:00", "highlightTitle": ""}