{"organizations": [], "uuid": "8bf9fb51431575c458155a217f6bf6cf06b3137d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223409939&w=1200&r=LYNXMPEE0I1F7", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-usa-abortion/trump-decries-permissive-u-s-abortion-laws-at-rally-idUKKBN1F814H", "country": "US", "domain_rank": 408, "title": "Trump decries 'permissive' U.S. abortion laws at rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:30:00.000+02:00", "replies_count": 0, "uuid": "8bf9fb51431575c458155a217f6bf6cf06b3137d"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-abortion/trump-decries-permissive-u-s-abortion-laws-at-rally-idUKKBN1F814H", "ord_in_thread": 0, "title": "Trump decries 'permissive' U.S. abortion laws at rally", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ian simpson", "sentiment": "negative"}, {"name": "wade", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "roe", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "national mall", "sentiment": "none"}, {"name": "white house rose garden", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 31 PM / a minute ago Trump decries 'permissive' U.S. abortion laws at rally Ian Simpson 5 Min Read \nWASHINGTON (Reuters) - President Donald Trump criticized U.S. abortion laws as among the most permissive in the world in a speech to anti-abortion activists at the annual March for Life on Friday, and pledged his administration would always defend “the right to life.” \nThe Republican president’s speech, relayed via video link from the White House Rose Garden to thousands gathered on Washington’s National Mall, highlighted his shift in recent years from a supporter of women’s access to abortion to a powerful opponent. \n“As you all know, Roe v. Wade has resulted in some of the most permissive abortion laws anywhere in the world,” he said, criticizing the 1973 Supreme Court decision that affirmed a woman’s right to an abortion at most stages of a pregnancy. \nTrump said the United States “is one of only seven countries to allow elective late-term abortions,” mentioning China and North Korea. “It is wrong. It has to change.” \nThe other countries that allow elective abortions after 20 weeks are Canada, the Netherlands, Singapore and Vietnam, according to the Charlotte Lozier Institute, an anti-abortion research group. \nTrump listed some anti-abortion measures his administration had taken, including an announcement earlier in the day by the U.S. Department of Health and Human Services. The agency said it was revoking Obama administration legal guidance that had sought to discourage states from trying to defund organizations that provide abortion services, such as Planned Parenthood. \nRoe v. Wade effectively legalized abortion nationwide. In the 45 years since the decision was issued on Jan. 22, 1973, the March for Life has been staged near the ruling’s anniversary in protest. \n“Because of you, tens of thousands of Americans have been born and reached their full, God-given potential,” Trump, a Christian, told the marchers, who included many groups of students from Roman Catholic schools. \nTrump has pledged to appoint more federal judges who oppose abortion with the hope that the ruling might eventually be overturned. Participants attend the annual March for Life anti-abortion rally in front of the Washington Monument in Washington, U.S. January 19, 2017. REUTERS/Eric Thayer \nTrump is the third sitting president to address the march: Ronald Reagan and George W. Bush both made supportive remarks to the march at least twice each during their presidencies, speaking via telephone broadcast by loudspeakers. \nTrump sent Vice President Mike Pence, a vocal abortion opponent, to speak at last year’s march, a few days after the presidential inauguration. This year, Pence introduced Trump, saying the president would “restore the sanctity of life to the center of American law.” \nMany marchers, carrying signs with slogans such as “Pray to end abortion,” said they were excited to hear from a president they see as an ally, but hesitated to point to any specific advancements in their agenda from Trump’s first year in office. Slideshow (5 Images) \n“It’s so refreshing to have a standing president who supports pro-life,” Tim Curran, a 66-year-old grocer who had traveled to the march from Kentucky, said before the remarks and the march to the steps of the Supreme Court for a rally. “He seems to be moving us back in the direction of traditional families and morality.” \nThe event came a day before the first anniversary of Trump’s inauguration, a milestone to be marked by the second Women’s March in cities across the United States, including Washington. Organizers hope to recreate last year’s huge anti-Trump protests by hundreds of thousands of people who saw Trump as a foe of women’s rights and reproductive freedom. \nTrump previously supported women’s access to abortion, saying in an interview in 1999, when he was still a celebrity real-estate tycoon in New York City, that while he “hated the concept of abortion,” he was “very pro-choice.” \nAs a candidate for the presidency in 2016, Trump said his position had “evolved,” describing himself as “pro-life with exceptions,” such as in cases of rape or incest. \nTrump has said he hopes Roe v. Wade will eventually be overturned and that each state will instead be allowed to decide whether to ban it. \nAmericans tend to split roughly down the middle on abortion access, with 49 percent saying they supported it and 46 percent saying they opposed it in a 2017 Gallup poll. Reporting by Ian Simpson in Washington and Jonathan Allen in New York; Writing by Jonathan Allen; Editing by Steve Orlofsky and Jonathan Oatis", "external_links": [], "published": "2018-01-19T20:30:00.000+02:00", "crawled": "2018-01-19T20:49:23.035+02:00", "highlightTitle": ""}