{"organizations": [], "uuid": "f6b2915f9817778ec18f99d7449cee94c35ef267", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-fastenal-company-reports-2017-annual-and-fourth-quarter-earnings.html", "country": "US", "domain_rank": 767, "title": "Fastenal Company Reports 2017 Annual and Fourth Quarter Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:50:00.000+02:00", "replies_count": 0, "uuid": "f6b2915f9817778ec18f99d7449cee94c35ef267"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-fastenal-company-reports-2017-annual-and-fourth-quarter-earnings.html", "ord_in_thread": 0, "title": "Fastenal Company Reports 2017 Annual and Fourth Quarter Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "minn.", "sentiment": "none"}, {"name": "fourth quarter earnings winona", "sentiment": "none"}], "organizations": [{"name": "fastenal company", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINONA, Minn., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Fastenal Company (Nasdaq:FAST), a leader in the wholesale distribution of industrial and construction supplies, today announced its financial results for the quarter and year ended December 31, 2017. Except for share and per share information, or as otherwise noted below, dollar amounts are stated in millions. Throughout this document, percentage and dollar calculations, which are based on non-rounded dollar values, may not be able to be recalculated using the dollar values included in this document, due to the rounding of those dollar values.\nPERFORMANCE SUMMARY\nTwelve-month Period Three-month Period 2017 2016 Change 2017 2016 Change Net sales $ 4,390.5 3,962.0 10.8 % $ 1,088.5 947.9 14.8 % Business days 254 255 63 63 Daily sales $ 17.3 15.5 11.3 % $ 17.3 15.0 14.8 % Gross profit $ 2,163.6 1,964.8 10.1 % $ 531.2 471.9 12.6 % % of sales 49.3 % 49.6 % 48.8 % 49.8 % Operating income $ 881.8 795.8 10.8 % $ 203.3 182.5 11.4 % % of sales 20.1 % 20.1 % 18.7 % 19.3 % Earnings before income taxes $ 873.1 789.7 10.6 % $ 200.8 180.8 11.1 % % of sales 19.9 % 19.9 % 18.5 % 19.1 % Net earnings $ 578.6 499.4 15.8 % $ 152.4 114.8 32.8 % Diluted net earnings per share $ 2.01 1.73 16.2 % $ 0.53 0.40 33.5 % \"A return to double-digit sales and pre-tax earnings growth in 2017 was a great way to celebrate our 50 th year in business,\" said Dan Florness, President and Chief Executive Officer. \"Our customers' demand improved, this demand lifted our business. Also encouraging was how the hard work of Fastenal employees generated accelerating signings and sales growth in our growth drivers. This momentum, our ability to leverage operating expenses, and the benefits of tax reform have set up 2018 to be another strong year for Fastenal.\"\nQuarterly Results of Operations\nNet sales increased $140.5, or 14.8%, from the fourth quarter of 2016 to the fourth quarter of 2017. Our March 31, 2017 acquisition of Manufacturers Supply Company ('Mansco') increased our sales growth by 1.4 percentage points. The remaining portion of the increase was driven primarily by higher unit sales. The higher unit sales resulted primarily from improvement in underlying market demand and contribution from our growth drivers, most notably industrial vending and Onsite locations. Fastener products represented 35.0% of sales in the fourth quarter of 2017. Daily sales of fastener products grew 13.4% in total, of which 3.9 percentage points were attributable to the recently acquired Mansco business. Our sales of non-fastener products represented 65.0% of sales in the fourth quarter of 2017 and grew 16.1% on a daily basis.\nOur gross profit, as a percentage of net sales, declined 97 basis points to 48.8% in the fourth quarter of 2017 from 49.8% in the fourth quarter of 2016. Gross profit in the fourth quarter of 2016 was unusually strong, creating a difficult comparison to the current period. Specific components that adversely affected our gross profit percentage included changes in product and customer mix, the inclusion of Mansco (which has a lower gross profit product mix than the company), higher freight expenses from higher payments to third party shippers and investments in hub assets, and, to a lesser degree, commodity inflation.\nOur operating income, as a percentage of net sales, declined 57 basis points to 18.7% in the fourth quarter of 2017 from 19.3% in the fourth quarter of 2016. This was the result of a 40 basis point improvement in our operating and administrative expenses (including a gain on the sale of property and equipment), which was offset by the 97 basis point decline in gross profit. Our operating and administrative expenses, as a percentage of net sales, were 30.1% in the fourth quarter of 2017 compared to 30.6% in the fourth quarter of 2016. The primary reason for this improvement was our ability to leverage occupancy expenses.\nEmployee-related expenses, which represent 65% to 70% of operating and administrative expenses, increased 15.5% in the fourth quarter of 2017 when compared to the fourth quarter of 2016. The increase in employee-related expenses was mainly related to: (1) an increase in our full-time equivalent ('FTE') headcount, (2) higher expenses related to the improving growth of our business, including bonuses, commissions, and profit sharing, as well as regulatory-driven incremental compensation, and (3) the inclusion of Mansco personnel. Occupancy-related expenses, which represent 15% to 20% of operating and administrative expenses, decreased 1.0% primarily due to a decline in our number of public branches. Selling transportation expenses, which represent approximately 5% of operating and administrative expenses, increased 7.4% due to higher average fuel expenses and investments in hub fleet capabilities to support our growth.\nThe table below summarizes our FTE headcount at the end of the periods presented and changes in such headcount from the end of the prior periods to the end of the most recent period:\nQ4 Q4 2017 2016 % Change Branch and Onsite based FTE headcount 11,549 10,797 7.0 % Total FTE headcount 17,519 16,265 7.7 % Note - Full-time equivalent is based on 40 hours per week. Our net interest expense was $2.5 in the fourth quarter of 2017 compared to $1.7 in the fourth quarter of 2016. This increase was mainly caused by higher average interest rates and a slightly higher average debt balance during the period.\nWe have recorded a provisional income tax expense of $48.4 in the fourth quarter of 2017, or 24.1% of earnings before income taxes. This amount reflects an estimated reduction in our deferred income tax liabilities of $30.8 as a result of the rate decrease included in the new tax legislation commonly referred to as the Tax Cuts and Jobs Act (the 'Act'). This amount was partially offset by an estimated increase in income tax payable in the amount of $6.5 as a result of the transition tax on cash and cash equivalent balances related to accumulated earnings associated with our international operations. Absent the impact of the Act, our income tax expense in the fourth quarter of 2017 would have been approximately $72.8, or 36.2% of earnings before income taxes. Income tax expense was $66.0 in the fourth quarter of 2016, or 36.5% of earnings before income taxes.\nWe are evaluating the impacts of the Act on our 2018 provisional income tax expense booking rate. We currently estimate this rate will be in the range of 24% to 26% of earnings before income taxes.\nOur net earnings during the fourth quarter of 2017 were $152.4, an increase of 32.8% when compared to the fourth quarter of 2016. Our diluted net earnings per share were $0.53 during the fourth quarter of 2017 compared to $0.40 during the fourth quarter of 2016. If we excluded the discrete items that benefited our tax rate in the fourth quarter of 2017 (primarily related to the impact of the Act), our net earnings in the period would have been approximately $128.1, an increase of 11.5% when compared to the fourth quarter of 2016 and our diluted net earnings per share would have been $0.45.\nGrowth Driver Performance\nWe signed 4,266 industrial vending machines during the fourth quarter of 2017, an increase of 13.5% co", "external_links": ["https://www.globenewswire.com/Tracker?data=MrJMTqCBwbctwPfFgA47Loy4vBAmSq0zMTh6X1cGEgYEnIfOGWQ81lfAD3uaGjE2uvcb54XD1m6GMXdx6LRsUwcrZjusI-vfNf5PqVOZiNJ2lY20vqaKRhMTwFoFsy5DkJsUgBpJMj4cCp9t8Efztg==", "https://www.globenewswire.com/Tracker?data=th0rN3oBFbtyrcNMbCnYIo6sgQiGF08p5pBtsTZTeW0cALcXi9M3Ge4z2nNy62p_P006E8gDbLHPZQ3QRpj9eA==", "http://investor.fastenal.com/events.cfm", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2b7c31bf-758d-4f8a-80c3-f653ab1e1969"], "published": "2018-01-17T14:50:00.000+02:00", "crawled": "2018-01-17T15:47:28.002+02:00", "highlightTitle": ""}