{"organizations": [], "uuid": "41e7c0151916c7b95c80aaffb1e00b0ebcb1fc79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/30/104872274-GettyImages-883237098.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/05/dow-25000-investors-should-be-terrified-about-dow-25000-analyst-says.html", "country": "US", "domain_rank": 767, "title": "Dow 25,000: Investors should be 'terrified' about Dow 25,000, analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:31:00.000+02:00", "replies_count": 0, "uuid": "41e7c0151916c7b95c80aaffb1e00b0ebcb1fc79"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/05/dow-25000-investors-should-be-terrified-about-dow-25000-analyst-says.html", "ord_in_thread": 0, "title": "Dow 25,000: Investors should be 'terrified' about Dow 25,000, analyst says", "locations": [], "entities": {"persons": [{"name": "goldilocks", "sentiment": "none"}, {"name": "gambles", "sentiment": "none"}, {"name": "paul gambles", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "mbmg group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wall Street's eye-popping gains should be of great concern to global investors, an analyst told CNBC on Friday.\nThe Dow Jones industrial average broke above 25,000 on Thursday for the first time, following the release of stronger-than-expected jobs data. In terms of trading days, it was the fastest 1,000-point gain to a round number in the Dow's history. The 30-stock index broke above 24,000 on Nov. 30, 23 trading days earlier. It took the Dow 24 trading days to go from 20,000 to 21,000 last year.\n\"We're really terrified,\" Paul Gambles, managing partner at MBMG Group, told CNBC.\nWhen asked why he believed traders should avoid investing in stocks given the \"Goldilocks\" global growth conditions, Gambles said: \"In the first three versions of the Goldilocks story, Goldilocks actually died horribly, and we think that could well happen again [to stocks].\"\nGambles said that collective global growth at the level seen through 2017 was the GDP equivalent to a \"blow-off top.\" He added that similar levels of concerted worldwide growth were seen during previous financial crises and therefore the current risk to investors is \"exponential.\"\nTrump: 'New number is 30,000' The Dow gained 152 points on Thursday to 25,075, while the broader S&P 500 and tech-heavy Nasdaq also hit milestones.\nEarlier Thursday, ADP and Moody's Analytics reported that the U.S. private sector added 250,000 jobs in December, well above the expected 190,000.\nIn 2017, prices were supported by a rebound in global economic growth and renewed investor optimism that looming corporate tax cuts would result in bigger dividends and share buybacks. A low interest rate environment was also believed to make stocks a relatively attractive investment.\nCarlos Barria | Reuters President Donald Trump celebrates with Congressional Republicans after the U.S. Congress passed sweeping tax overhaul legislation, on the South Lawn of the White House in Washington, December 20, 2017. President Donald Trump sought to take credit for the Dow's record-breaking rise above 25,000 on Thursday. He told reporters : \"I guess our new number is 30,000. … There were those that said we wouldn't break 25,000 by the end of the eighth year (of my administration), and we're in the 11th month.\"\nTrump has touted the market's surge throughout his presidency, unlike his predecessors. Since his inauguration on Jan. 20, Trump has tweeted about the stock market more than 50 times.\nOn Thursday, he tweeted: \"Dow just crashes through 25,000. Congrats! Big cuts in unnecessary regulations continuing.\"\nTweet 1\n— CNBC's Fred Imbert contributed to this report.", "external_links": ["https://twitter.com/realDonaldTrump/status/948944124132167680"], "published": "2018-01-05T13:31:00.000+02:00", "crawled": "2018-01-05T13:11:23.021+02:00", "highlightTitle": ""}