{"organizations": [], "uuid": "ef8f38268b4ca1c55e8d3e6c3761e5ea31545459", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-spreadbetters/rpt-bark-worse-than-bite-spreadbetter-stocks-defy-regulatory-threat-idUSL8N1PO1ER", "country": "US", "domain_rank": 408, "title": "RPT-Bark worse than bite? Spreadbetter stocks defy regulatory threat", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.086, "site_type": "news", "published": "2018-01-29T16:18:00.000+02:00", "replies_count": 0, "uuid": "ef8f38268b4ca1c55e8d3e6c3761e5ea31545459"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-spreadbetters/rpt-bark-worse-than-bite-spreadbetter-stocks-defy-regulatory-threat-idUSL8N1PO1ER", "ord_in_thread": 0, "title": "RPT-Bark worse than bite? Spreadbetter stocks defy regulatory threat", "locations": [], "entities": {"persons": [{"name": "alasdair pal", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "esma", "sentiment": "none"}, {"name": "ig group", "sentiment": "none"}, {"name": "european securities and markets authority", "sentiment": "none"}, {"name": "cmc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats JAN 26 story, no change to text)\nBy Alasdair Pal\nLONDON, Jan 26 (Reuters) - British online trading platforms signed up record numbers of customers last year, partly on the back of the bitcoin boom, even though regulators issued repeated demands for the industry to do more to warn customers of the risks.\nFor now, few investors seem ready to bet that regulators will turn words into the kind of actions that would endanger the industry’s stellar growth.\nThe platforms, known as spreadbetters, offer products called contracts For difference (CFDs) that allow clients, in some cases, to speculate on minute swings in stocks and cryptocurrencies such as bitcoin – a practice likened by one fund manager to betting on horseracing.\nIG Group, CMC Markets and Plus500 , Britain’s three largest operators, have all reported strong revenue growth in January, but they face a two-pronged regulatory assault.\nThe European Securities and Markets Authority (ESMA) is consulting on proposals that would reduce the maximum leverage available to clients to thirty times their deposit, down from as much as 300 times currently offered by Plus500 on some products. It could also impose restrictions on offering CFDs to investors with no professional experience in financial markets.\nBritain’s Financial Conduct Authority (FCA), meanwhile, has written to CEOs of spreadbetting firms several times, most recently on Jan. 10, warning that providers were failing to inform clients of the risks in trading the products. Shares in all three companies fell after the announcement, but remain well up over the last year.\n“ESMA has indicated its discomfort with complex financial products being offered to retail investors. But it is really hard to predict what is going to happen. The regulatory wheels move pretty slowly,” said Jacob Ma-Weaver, founder of hedge fund Cable Car Capital.\nInvestors are optimistic the largest players could actually benefit from increased regulation, as they focus on high-value clients less likely to be hit by regulation.\n“Some are looking to do it (spreadbetting) on a short-term basis: it is a bit like horseracing, you just take a view,” said Gervais Williams, a fund manager at Miton and one of the largest shareholders in CMC Markets.\n“Others use it in a more professional way – they feel like they have insight into the market. CMC in particular caters for that kind of customer.”\nIG CEO Peter Hetherington told investors on Wednesday that half its revenue is generated by just 2 percent of its clients – a sophisticated group that includes fund managers trading their own money in their spare time, he said.\nIndustries facing the threat of increased regulation are often targets for short-sellers, who bet on falling share prices by borrowing shares and selling them back into the market, with the aim of repurchasing them at a lower price.\nBut frustrated by the length of time it has taken for regulators to act, these funds have largely stayed away, according to short position disclosures to Britain’s FCA.\n“A lot of people have come to the conclusion that regulation is outside their investment horizon,” Ma-Weaver said on attempts to bet against the sector.\nIn May 2015, Plus 500’s shares were suspended after falling nearly 50 percent in a single day after Cable Car published a critical report on the company, arguing regulators would soon clamp down on high levels of leverage and a business model that means the company benefits when its clients lose money. Since then, its shares are up 460 percent.\nShort positions on Plus 500 have fallen to zero, according to the most recent FCA data.\nReporting by Alasdair Pal; Editing by Tom Pfeiffer and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T16:18:00.000+02:00", "crawled": "2018-01-30T19:01:21.002+02:00", "highlightTitle": ""}