{"organizations": [], "uuid": "bbbfdde5d9c8daacf5a82c55198b00d5869df49d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-nacho/psg-wont-be-relishing-facing-real-nacho-idUKKBN1FG0VG", "country": "US", "domain_rank": 408, "title": "PSG won't be relishing facing Real - Nacho", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T21:23:00.000+02:00", "replies_count": 0, "uuid": "bbbfdde5d9c8daacf5a82c55198b00d5869df49d"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-nacho/psg-wont-be-relishing-facing-real-nacho-idUKKBN1FG0VG", "ord_in_thread": 0, "title": "PSG won't be relishing facing Real - Nacho", "locations": [], "entities": {"persons": [{"name": "karim benzema", "sentiment": "none"}, {"name": "gareth bale", "sentiment": "none"}, {"name": "cristiano ronaldo", "sentiment": "none"}, {"name": "nacho", "sentiment": "none"}], "locations": [{"name": "paris st germain", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "leganes", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}], "organizations": [{"name": "nacho reute", "sentiment": "negative"}, {"name": "psg", "sentiment": "negative"}, {"name": "liga", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "ligue", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 7:25 PM / Updated 24 minutes ago PSG won't be relishing facing Real - Nacho Reuters Staff 3 Min Read \nMADRID (Reuters) - Paris St Germain will not be looking forward to facing Real Madrid in the Champions League after the Spanish side’s 4-1 win at Valencia on Saturday, Real defender Nacho said. \nWith their first-choice attacking trident of Gareth Bale, Karim Benzema and Cristiano Ronaldo starting together for the first time in 280 days, Real shook off the bad memories of their King’s Cup elimination by lowly Leganes to produce a determined display against third-placed Valencia. \nWith Real 16 points behind Liga pace-setters Barcelona and out of the Cup, their season now hinges on the blockbuster Champions League last-16 tie against PSG, and Nacho said his side have nothing to fear from the runaway Ligue 1 leaders, who they host in the first leg on Feb. 14. \n“They are having a great year, but we are Real Madrid and we don’t fear anyone and you can bet that they won’t want to play against us,” Nacho told reporters. \n“We have a very important challenge in front of us and we are perfectly capable of winning the Champions League.” \nTwo penalties from Cristiano Ronaldo gave Real the advantage before halftime and after Santi Mina’s header had put Valencia back in the game the visitors wrapped up victory with two superbly crafted team goals by Marcelo and Toni Kroos. \n“You have to know how to suffer in games like this one,” Nacho added. \n“These three points are very important to us but above all they will be very valuable on a psychological level.” \nReal coach Zinedine Zidane has come in for serious criticism for his side’s dramatic fall from grace after sweeping to the Liga title last season and winning back-to-back Champions Leagues and he said his spirits had been lifted. \n“Seeing them play like that makes me very happy, Valencia are doing fantastic things in the league and this wasn’t an easy game at all,” the French coach told reporters. \n“It’s a very important result, we played very well and I‘m very happy. The good thing about football is you have a lot of games. This was a huge occasion for us and we played with a lot of character. We’re going to keep fighting because there’s a lot left to play for.” Reporting by Richard Martin, editing by Ed Osmond", "external_links": [], "published": "2018-01-27T21:23:00.000+02:00", "crawled": "2018-01-27T21:53:52.099+02:00", "highlightTitle": ""}