{"organizations": [], "uuid": "8731db309d28d86e6ea8660412f4e7be4d646896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-facebook-ceos-2018-challenge-fix-facebook.html", "country": "US", "domain_rank": 767, "title": "Facebook CEO's 2018 challenge: Fix Facebook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:45:00.000+02:00", "replies_count": 0, "uuid": "8731db309d28d86e6ea8660412f4e7be4d646896"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-facebook-ceos-2018-challenge-fix-facebook.html", "ord_in_thread": 0, "title": "Facebook CEO's 2018 challenge: Fix Facebook", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "faceb", "sentiment": "negative"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "facebook ceo", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — Mark Zuckerberg says his \"personal challenge\" for 2018 is to fix Facebook.\nThe Facebook CEO has declared a goal each year since 2009. Past challenges have included wearing a tie every day, learning to speak Mandarin and eating meat only from animals he killed himself. Last year, he visited every U.S. state he hadn't been to yet.\nThis year, though, his challenge is directed at his company rather than personal ambitions. Zuckerberg wrote Thursday that he wants to focus this year on protecting Facebook users from abuse, defending against interference by nation-states and \"making sure that time spent on Facebook is time well spent.\"\nIn other words, he wants to do his job as Facebook's CEO.\n\"This may not seem like a personal challenge on its face, but I think I'll learn more by focusing intensely on these issues than I would by doing something completely separate,\" Zuckerberg wrote.\nHe added that while Facebook won't prevent all mistakes or abuse, \"we currently make too many errors.\"\nFacebook had a tough 2017. It testified before Congress about Russian election meddling using its platform and drew harsh criticism from early employees and investors about its role in the world.\nBut Zuckerberg also has little choice but to fix Facebook's problems. Regulators in Washington, Europe and elsewhere are expecting concrete results. And while the platform has more than 2 billion users, there is nothing to guarantee they will stay and keep using Facebook as much as they do now if they feel depressed, lied to with fake news and hoaxes and manipulated by foreign powers.\nZuckerberg compared this year's challenge to the first one he did nine years ago. It wasn't so much about him back then either, but about the social platform he created.\n\"That first year the economy was in a deep recession and Facebook was not yet profitable. We needed to get serious about making sure Facebook had a sustainable business model. It was a serious year, and I wore a tie every day as a reminder,\" he wrote. \"Today feels a lot like that first year.\"\nBut fixing deep-rooted, existential problems is a taller order than turning a profit.\nMany of Facebook's problems are deeply rooted in how it's set up and why it's been so successful, financially and otherwise. Its secret formulas give users the content they are most likely to interact with and what's most likely to keep them coming back for more. Sometimes, that's heartfelt posts by their friends but other times it's viral fake news stories or inflammatory comments about political candidates.", "external_links": [], "published": "2018-01-04T20:45:00.000+02:00", "crawled": "2018-01-05T22:51:58.016+02:00", "highlightTitle": ""}