{"organizations": [], "uuid": "b413d1d35e1adb2a9ada81a54b476e66c923181d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-cubic-announces-nomination-of-distinguished-aerospace-and-defense-executive-david-f-melcher-for-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Cubic Announces Nomination of Distinguished Aerospace and Defense Executive David F. Melcher for Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-20T00:45:00.000+02:00", "replies_count": 0, "uuid": "b413d1d35e1adb2a9ada81a54b476e66c923181d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-cubic-announces-nomination-of-distinguished-aerospace-and-defense-executive-david-f-melcher-for-board-of-directors.html", "ord_in_thread": 0, "title": "Cubic Announces Nomination of Distinguished Aerospace and Defense Executive David F. Melcher for Board of Directors", "locations": [], "entities": {"persons": [{"name": "david f. melcher", "sentiment": "negative"}, {"name": "bradley h. feldmann", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "melcher", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "cubic corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "cubic mission solutions", "sentiment": "none"}, {"name": "exelis inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Cubic Corporation (NYSE:CUB) today announced the nomination of seasoned aerospace and defense business executive, David F. Melcher to the company's board of directors. Melcher brings to Cubic an extensive background in program management, strategy development and finance, in addition to experience working closely with key military and government leaders. Melcher will be presented for election at the company's annual shareholders meeting on February 19.\n\"Dave will be a strong asset to our board with his exceptional leadership and industry expertise. In particular, his experience and knowledge in C4ISR from leading Exelis Inc. will be beneficial as we continue to strengthen our Cubic Mission Solutions business division,\" said Bradley H. Feldmann, president and chief executive officer, Cubic Corporation. \"Dave's accomplished corporate and military background will provide Cubic with guidance and insight to further strengthen our growth strategies and we look forward to welcoming Dave as a member of our board.\"\nMelcher is the former president and chief executive officer of the Aerospace Industries Association (AIA), an education and advocacy organization that represents over 350 companies in the aerospace and defense industry. Prior to his role at AIA, Melcher was the president and chief executive officer of Exelis Inc. and held leadership roles at ITT Corporation. In addition to his corporate achievements, Melcher completed a distinguished 32-year career in the U.S. Army and retired as Lieutenant General.\nMelcher is a registered professional engineer in New Hampshire and a former White House Fellow who served as the Executive Assistant for the Director, Office of Management and Budget in the White House. He holds a bachelor's degree in civil engineering from the U.S. Military Academy at West Point and two masters' degrees from Harvard University and Shippensburg University. Melcher is a recipient of the Army's Distinguished Service Medal and received the Association of the U.S. Army John W. Dixon award for his contributions to the defense industry.\nIn addition, Walter C. Zable, Cubic's current chairman of the board, is leaving the board effective at the conclusion of the annual shareholders meeting, following the election of the nominees to the board. Zable departs after a 54-year career with the company, including 42 years serving on the board.\n\"Walt has provided significant guidance to our organization during his remarkable tenure and we sincerely thank him for his many years of service, leadership and dedication,\" added Feldmann.\nAbout Cubic Corporation\nCubic is a market-leading, technology provider of integrated solutions that increase situational understanding for transportation, defense C4ISR and training customers worldwide to decrease urban congestion and improve the militaries' effectiveness and operational readiness. Cubic Transportation Systems is a leading integrator of payment and information technology and services to create intelligent travel solutions for transportation authorities and operators. Cubic Mission Solutions provides networked Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities for defense, intelligence, security and commercial missions. Cubic Global Defense is a leading provider of live, virtual, constructive and game-based training solutions, special operations and intelligence for the U.S. and allied forces. For more information about Cubic, please visit the company's website at www.cubic.com or on Twitter @CubicCorp.\n with multimedia: releases/cubic-announces-nomination-of-distinguished-aerospace-and-defense-executive-david-f-melcher-for-board-of-directors-300585431.html\nSOURCE Cubic Corporation", "external_links": ["http://www.prnewswire.com/news-releases/cubic-announces-nomination-of-distinguished-aerospace-and-defense-executive-david-f-melcher-for-board-of-directors-300585431.html", "http://www.cubic.com/"], "published": "2018-01-20T00:45:00.000+02:00", "crawled": "2018-01-20T00:44:26.019+02:00", "highlightTitle": ""}