{"organizations": [], "uuid": "b4a97ae95b45ae5402bb0dd88c7197e2027faf64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-egypt-crash/one-tourist-killed-12-injured-in-air-balloon-crash-in-egypt-idUSKBN1EU0PO", "country": "US", "domain_rank": 408, "title": "Tourist killed, several injured in Egypt hot air balloon crash", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-05T16:36:00.000+02:00", "replies_count": 0, "uuid": "b4a97ae95b45ae5402bb0dd88c7197e2027faf64"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-egypt-crash/one-tourist-killed-12-injured-in-air-balloon-crash-in-egypt-idUSKBN1EU0PO", "ord_in_thread": 0, "title": "Tourist killed, several injured in Egypt hot air balloon crash", "locations": [], "entities": {"persons": [], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "luxor", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}, {"name": "luxor international hospital", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "civil aviation authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAIRO (Reuters) - A hot air balloon crashed near the southern Egyptian city of Luxor, killing a South African tourist on board and injuring several others on Friday, officials said.\nState media blamed the crash on poor weather conditions without elaborating. High winds and sandstorms hit regions across the country, clouding the skies at Cairo’s main airport and forcing the closure of a number of Red Sea ports.\nA South African man died and an Argentinian and two French tourists were being treated in hospital, a health ministry spokesman said. Health officials and state media had earlier said a woman died.\nA number of other tourists were also taken to Luxor International Hospital but released after a few hours, the ministry said.\nLuxor, a city surrounded by ancient tombs and other historic sites, is one of the main focuses of Egypt’s tourism industry - a key revenue-earner that the government has been trying to revive after years of political turmoil.\nThe balloon had deviated from its allotted path and crashed with 20 tourists on board, the Civil Aviation Authority said in a statement.\nTwenty-one other balloon trips carrying more than 400 tourists had all landed safely on Friday, it added.\nSandstorms lashed wide parts of the country, including Cairo, Sinai and coastal areas overlooking the Red sea, the national weather forecasting agency said.\nLuxor governor Mohamed Badr ordered the closure of all highways linking to other provinces due to poor visibility.\nStaff at Cairo International Airport said they were on high alert because of the strong winds and storms, though no trips were canceled or rescheduled.\nNineteen people, most of them Asian and European tourists, died near Luxor in 2013 when a hot air balloon caught fire and crashed after a mid-air gas explosion.\nReporting by Ali Abdelaty; Editing by Robin Pomeroy and Andrew Heavens\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T16:36:00.000+02:00", "crawled": "2018-01-05T22:28:14.007+02:00", "highlightTitle": ""}