{"organizations": [], "uuid": "f5afd079250f15dbc79ecc03c4b73fd60cb240ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-children-letterboxes/secret-notes-from-students-help-indian-police-nab-traffickers-idUSKBN1ER116", "country": "US", "domain_rank": 408, "title": "Secret notes from students help Indian police nab traffickers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T21:19:00.000+02:00", "replies_count": 0, "uuid": "f5afd079250f15dbc79ecc03c4b73fd60cb240ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-children-letterboxes/secret-notes-from-students-help-indian-police-nab-traffickers-idUSKBN1ER116", "ord_in_thread": 0, "title": "Secret notes from students help Indian police nab traffickers", "locations": [], "entities": {"persons": [{"name": "rajkumar kotal", "sentiment": "negative"}, {"name": "kotal", "sentiment": "none"}], "locations": [{"name": "chennai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "west bengal", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "ramgarhat high school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHENNAI, India (Thomson Reuters Foundation) - High school teacher Rajkumar Kotal had run out of ideas.\nNews about his students being pushed into early marriage and lured by traffickers reached him, but often too late to stop it.\nBut when police officials put a letter box in a discreet corner of the Ramgarhat High School in east Indian state of West Bengal, the problem was suddenly solved.\n“The anonymity of that box gave students the confidence to ask questions, alert authorities and slowly we built a campaign around it to stop child marriages and prevent trafficking,” Kotal, who teaches English, told the Thomson Reuters Foundation.\nWest Bengal accounted for 44 percent of human trafficking cases reported in India in 2016 and also had the most missing children reports, according to government data.\nYoung girls from poor families are lured with promises of marriage or jobs and trafficked to cities where they are sold to brothels or into domestic slavery, campaigners said.\nThe state government and charities working to prevent human trafficking have initiated a host of measures, including efforts to create a database of known traffickers.\nThe letter box scheme is part of a larger initiative by the West Bengal police which has proved so successful that now more than 20,000 students across 200 schools in the most vulnerable districts of the state have “shared secrets” and sought help.\nRecognising the impact of the initiative, the U.N. children’s agency UNICEF has now partnered with the police to expand the scope of the program across the state.\n“Girls from the state were being trafficked and then dumped on the streets of Delhi to die,” said police officer Ajey Ranade, who is heading the initiative that is largely targeting school girls in vulnerable districts.\nPolice officers in plain clothes first started visiting schools in South 24 and North 24 Parganas districts - identified as trafficking hotspots - in 2016 to talk to students.\nMany policemen had been on rescue missions and had been “emotionally moved” by the plight of trafficking survivors as they saw the impact it was having on young girls, Ranade said.\nIn schools, adolescents were at first reluctant to engage.\n“We started playing a game called share your secret and suddenly information was flowing,” said Suravi Sarkar of non-profit banglanatak.com which helped the police reach students.\nUnder the program, the police set up committees in schools to educate students about trafficking traps.\n“Girls appear to be more alert now and information has started flowing in,” Ranade said.\n“Students are telling us if a classmate has missed school for a few days, strangers hanging around the school route are being reported and some of this information has even led to arrests.”\nKotal, who has been a teacher for 10 years, said he found courage to confront his students’ problems with police backing.\n“Earlier some students would ask for help but we couldn’t do much. This initiative has brought students, law enforcement, parents and teachers on the same platform,” he said.\nReporting by Anuradha Nagaraj, Editing by Belinda Goldsmith; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T21:19:00.000+02:00", "crawled": "2018-01-02T18:19:08.010+02:00", "highlightTitle": ""}