{"organizations": [], "uuid": "79187f778ea2d1d11e5a72a86ed9a7f24814c771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224516409&w=1200&r=LYNXMPEE0M1BQ", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-czech-election-president/pro-eu-academic-battles-euroskepticism-in-push-to-unseat-czech-president-idUSKBN1FC25A", "country": "US", "domain_rank": 408, "title": "Pro-EU academic battles euroskepticism in push to unseat Czech president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:56:00.000+02:00", "replies_count": 0, "uuid": "79187f778ea2d1d11e5a72a86ed9a7f24814c771"}, "author": "", "url": "https://www.reuters.com/article/us-czech-election-president/pro-eu-academic-battles-euroskepticism-in-push-to-unseat-czech-president-idUSKBN1FC25A", "ord_in_thread": 0, "title": "Pro-EU academic battles euroskepticism in push to unseat Czech president", "locations": [], "entities": {"persons": [{"name": "drahos", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "klatovy", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 3:57 PM / a minute ago Pro-EU academic battles euroskepticism in push to unseat Czech president Robert Muller 7 Min Read \nKLATOVY, Czech Republic (Reuters) - Jiri Drahos is a staunch pro-European in one of the EU’s most eurosceptic member states, and yet he is in a neck-and-neck race to win the Czech presidency this weekend. \nA softly-spoken chemistry professor, Drahos has to overcome voters’ suspicions that he is soft on immigration, and raise a relatively low profile - one third of the country did not even know who he was two months ago. \nBut the 68-year-old independent is uniting liberal voters with others generally disillusioned by incumbent President Milos Zeman, a heavy-weight of post-communist politics in the Czech Republic. \nOpinion polls show that in the election run-off on Friday and Saturday, Drahos has a good chance of unseating Zeman - a man fond of alcohol, sniping at the elite and using foul language in public, as well as being a champion of friendlier relations with the power that dominated central Europe throughout the Cold War: Russia. \nFor some Czechs, Drahos offers a change of style they believe the country badly needs. “It is about time the people understood that he is an educated, decent man, in a contrast to the current president,” pensioner Frantisek Rendl told Reuters at a Drahos rally in Klatovy, a historic town about 130 km (80 miles) southwest of Prague. \nCzech presidents hold relatively limited executive powers but they do appoint prime ministers, judges and central bankers. On top of this, they can exercise strong authority in forming public opinion which in turn helps to shape government policies. \nBoth 73-year-old Zeman and his predecessor Vaclav Klaus used the presidency to accuse the European Union repeatedly of imposing bureaucratic rules on the Czech Republic. \nHere the tall, white-haired former head of the Academy of Sciences is likely to offer a significant change of tone, should he occupy the presidential office in Prague Castle. \nFor Drahos, the country needs to be at the heart of the EU project as Germany and France push for reform. “I would very much like to see the Czech Republic at the table where Europe’s future is decided,” he told Reuters in an interview last month. \nDrahos faces broad public scepticism. The EU’s Eurobarometer survey last year found that 63 percent of Czechs distrust the EU, second only to Greeks who have endured eight years of austerity dictated by Brussels under their country’s bailouts. \nZeman, a former Social Democrat prime minister and now also an independent, was once strongly pro-EU but has moved steadily to the right and to euroskepticism during his five years as president. \n“STOP IMMIGRANTS AND DRAHOS” \nThe battle for the Czech presidency is similar to elections in neighboring Slovakia, where pro-European liberal Andrej Kiska beat the then more skeptical Robert Fico, and Austria where economics professor Alexander Van der Bellen defeated a far-right opponent last year. \nDrahos is vulnerable on immigration, with public opinion strongly against EU attempts to impose compulsory quotas for each member state to accept refugees. The Eurobarometer also showed 56 percent of Czechs opposed a common EU immigration policy, the highest among the 28 member states. \nLike Zeman, Drahos opposes the quota scheme and the country has a tiny Muslim minority, accepting just 12 refugees last year under a one-off EU program. Yet he often has to field questions on refugees from Muslim countries, one of the main election issues even though immigration policy rests with the government and parliament, not the president. \nZeman’s campaign portrays Drahos as someone who would open the borders, using the slogan: “Stop the immigrants and Drahos. This country is ours.” \nDrahos, who signed a call by scientists in 2015 for a sober and calm reaction to the European migration crisis, says the question of refugees needs a rational solution. “We have to solve this as Europe. We can’t wall-off our borders with concrete and wait till they start to climb over,” he told the crowd in Klatovy. \nDespite launching his presidential bid in March last year, an opinion poll in November showed 32 percent of voters still did not know Drahos. Nevertheless, he came second to Zeman in the first round earlier this month with 26.6 percent of the vote. \nA poll on Monday put his support at 47 percent, narrowly ahead of Zeman with 43 percent, with the remaining 10 percent undecided. \nMany undecideds don’t like his pro-European views in a country that has yet to adopt the euro, even though it joined the EU 14 years ago. But neither do they like Zeman’s calls for closer ties with Russia and his criticism of Western sanctions imposed on Moscow over the Ukraine crisis. \n“I know Zeman, he has been in politics for a long time, I don’t know Drahos. Zeman has experience in politics, Drahos has not been in politics,” said one of the undecideds, 61-year-old Prague receptionist Petra Kubickova. “About Drahos, I don’t like that he wants the euro, about Zeman, that he sides with Russia,” she told Reuters. COMMON SENSE \nA father of two daughters, Drahos plays the piano and was once in a rock band, as well as singing in a chamber choir for four decades. His latest campaign video shows him jogging through a forest and he is also a keen cross-country skier. \nThis contrasts with Zeman, a heavy smoker who has based his folksy appeal on a liking for drinking and fatty pork dishes. Photographs released last year of Zeman standing on skis provoked a skeptical response on social media due to his diabetes and difficulty in walking. \nDrahos joined the Academy of Sciences as a researcher in 1976 and declined several offers to join the Communist Party, an option that many professionals took to advance their careers. \nOnly after the fall of the communism in 1989 did he climb to top positions, chairing the Academy from 2009-2017. \n“Jiri Drahos is absolutely reliable,” said Jan Palous, an astrophysicist who sat on the Academy board with him. While outside conventional politics, Drahos still had to navigate the academic “jungle of opinions” behind the scenes. “He is not indecisive,” Palous told Reuters. \nNews websites sympathetic to Zeman and Russia have targeted Drahos, accusing him of being an informant for the StB communist secret police or even a pedophile. \nDrahos, who says he refused an StB request to inform on his colleagues, brushes this off. \n“I can assure you that you will hear many things, even nasty things about this Drahos,” he told a rally in the town of Horsovsky Tyn. “Please don’t trust them. I can only appeal to your common sense.” Additional reporting by Petra Vodstrcilova; Editing Jan Lopatka and David Stamp", "external_links": [], "published": "2018-01-23T17:56:00.000+02:00", "crawled": "2018-01-23T18:07:35.062+02:00", "highlightTitle": ""}