{"organizations": [], "uuid": "fb0d12da574e9ffec25ec7593b079e19612f0e34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219654895&w=1200&r=LYNXMPEE0412S", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-markets-themes/take-five-world-markets-themes-for-the-week-ahead-idUKKBN1EU1S6", "country": "US", "domain_rank": 408, "title": "Take Five - World markets themes for the week ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:43:00.000+02:00", "replies_count": 0, "uuid": "fb0d12da574e9ffec25ec7593b079e19612f0e34"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets-themes/take-five-world-markets-themes-for-the-week-ahead-idUKKBN1EU1S6", "ord_in_thread": 0, "title": "Take Five - World markets themes for the week ahead", "locations": [], "entities": {"persons": [{"name": "reuters/andrew kelly", "sentiment": "none"}, {"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "party on  world", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 5:51 PM / Updated 17 hours ago Take Five - World markets themes for the week ahead Marc Jones 11 Min Read \nLONDON (Reuters) - Following are five big themes likely to dominate thinking of investors and traders in the coming week and the Reuters stories related to them. The trading floor is seen on the final day of trading for the year at the New York Stock Exchange (NYSE) in Manhattan, New York, U.S., December 29, 2017. REUTERS/Andrew Kelly 1/ PARTY ON \nWorld stocks started the year with their best week in over a year and while it’s tempting to say “same old, same old” as markets smash another host of milestones and records, you still have to take a step back and assess what’s happening. \nThere are some who will dismiss this as another bout of mindless bubble blowing and insist it will all end in tears. Perhaps it will. But the more sober assessment is that we are going through the first boom in the world economy in over a decade. \nGlobal industrial output raced higher at more than a 5 percent annualised rate last month and more than 4 percent for the fourth quarter as a whole. The G10 economic surprise index – which nets positive over negative hits and misses on incoming data – continues to hover close to its most positive readings in almost 8 years. \nThere will be harder data on industrial output for Q4 next week, as well as trade data readings from China and tech soundings in Asia from the likes of Samsung. Inflation-focused central banks that have fuelled all this with their record cheap money will be looking at the rising price of oil meanwhile. 2/ YEARNING FOR EARNINGS \nPerhaps one reason for the latest run up in stocks, the Q4 earnings season, comes back onto the radar, with the big U.S. financials kicking off at the end of the week. \nJPMorgan Chase ( JPM.N ) and rival Wells Fargo ( WFC.N ) launch the earnings season with reports before the opening bell on Friday. Even despite the record low financial market volatility that’s crimping trading revenues, deal making has been super brisk over recent months and overall fee income from banks around the world rose some 16 percent last year to a record level of more than $100 billion, according to Thomson Reuters data. The numbers should be good. Blended year-on-year Q4 earnings growth for the S&P 500 overall is expected to be 11.9 percent, according to Thomson Reuters I/B/E/S estimates, up from 8.5 percent in Q3. Excluding the energy sector, which benefits from weak year-earlier comparisons, it is seen at 9.5 percent. Data which runs since 1994 shows that in a typical quarter 64 percent of companies beat estimates and 21 percent miss estimates. Over the past four quarters, however, 72 percent have beaten the Street estimates and only 19 percent have missed them. 3/ SOLVING A PROBLEM LIKE KOREA? \nOfficials from North and South Korea will meet on Tuesday for their first official talks in more than two years. \nAgreeing to the meeting represents a turnaround by Kim Jong Un’s regime, which has focussed in the past 12 months on developing its nuclear arsenal amid bellicose exchanges with U.S. President Donald Trump, raising alarm across the world. \nThe meeting is expected to focus on the North potentially sending athletes to the Winter Olympics to be held in the South in February as well as on some other inter-Korean relations, according to Seoul. \nEvery word and gesture will be scrutinised by geopolitical analysts as they try to judge if this really is a re-emerging detente between the two nations, not to mention the reaction from Trump’s twitter account. 4/BOOM BOOM, AND? \nA blizzard of data is expected to show China’s economy ended a strong 2017 on a slightly softer note. However, activity has remained more resilient than expected despite a crackdown on industrial pollution, overzealous lending and a cooling property market. \nThe week kicks off with forex reserves data and a bunch of inflation numbers, before the focus will switch to trade figures out on Friday. Exports are expected to have jumped more than 9 percent in December after soaring unexpectedly 12.3 percent in November thanks to sustained strength in global demand. \nA slight pullback in December industrial growth, producer inflation and investment would all reinforce consensus views that the world’s second-largest economy will slow only marginally in 2018. A more marked loss of momentum may put fears of a sharper slowdown back on the table, unsettle the yuan and possibly stall the government’s push to reduce rising debt. 5/HELLAS ANGEL \nIt may be the depths of winter with storms tearing across the euro zone, but the political and economic skies are almost cloudless all of a sudden. \nOn Sunday, Angela Merkel will begin trying to re-form a ‘grand coalition’, an effort that could rumble on for a few months, and campaigning for Italy’s uncertain election in March is also getting underway, but the rest of the bloc looks buoyant. \nPerhaps the most eye-catching thing is that crisis posterchild Greece’s borrowing costs hit their lowest in 12 years on Friday on expectations that the country could conclude its euro zone/IMF bailout package later this year. \nThat would cap a slowly strengthening recovery eight years after Greece lurched on the brink of defaulting on its debt and risked being kicked out of the single currency bloc. Additional reporting by Karin Strohecker in London, Dan Burns in New York and Vidya Ranganathan in Singapore", "external_links": [], "published": "2018-01-05T21:43:00.000+02:00", "crawled": "2018-01-06T03:47:39.004+02:00", "highlightTitle": ""}