{"organizations": [], "uuid": "81bf546399d0000c54918b4f8bb66b28e37efc0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-blockchain-technology-disrupting-growing-list-of-major-industries.html", "country": "US", "domain_rank": 767, "title": "Blockchain Technology Disrupting Growing List of Major Industries", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:50:00.000+02:00", "replies_count": 0, "uuid": "81bf546399d0000c54918b4f8bb66b28e37efc0c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-blockchain-technology-disrupting-growing-list-of-major-industries.html", "ord_in_thread": 0, "title": "Blockchain Technology Disrupting Growing List of Major Industries", "locations": [], "entities": {"persons": [], "locations": [{"name": "florida", "sentiment": "none"}], "organizations": [{"name": "u.s. department of energy", "sentiment": "none"}, {"name": "gartner inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH, Florida, January 4, 2018 /PRNewswire/ --\nWhile a growing list of industries are swept up in influence of disruption unleashed by blockchain technology, the energy industry in particular has been slow to embrace the latest technology. However, the latest infusion of blockchain promises to speed things up and radically transform the industry's processes and operations. A new consortium of blockchain firms and major energy companies have begun to launch with the aim of developing use cases for blockchain tech in the green power sector. As research firm Gartner Inc., pointed out in a 2017 report, \"blockchain technologies are extremely hyped, evolving at different trajectories, but should not be ignored. They offer the potential for substantial change in technology development and delivery as well as in how the economy, business and society operates.\" A research lab within the U.S. Department of Energy has revealed it recently began exploring the application of blockchain technology in managing next-generation power grids. Active Companies in the markets this week include: Sun Pacific Holding Corp. (OTC: SNPW), Pareteum Corporation (NYSE: TEUM), Marathon Patent Group (NASDAQ: MARA), BP (NYSE: BP), SunPower Corporation (NASDAQ: SPWR),\nSun Pacific Holding Corp. (OTCQB: SNPW) is pleased to announce that it has signed a binding Letter of Intent (\"LOI\") to acquire a 60-acre parcel of land. This acquisition will be acquired in the wholly owned subsidiary, National Mechanical Group. Sun Pacific is executing on its plan to own, build and manage its alternative energy business segment.\nNational Mechanical Group will build the facility on the 60 acre parcel. Combining both solar power and wind turbines will optimize the alternative energy output of the land. In addition Sun Pacific Holding will utilize the same Blockchain Technology used in cryptocurrency transactions to increase the levels of efficiency. The alternative energy project can provide power to over thousands of homes. Using photovoltaic solar panels and high efficiency wind turbines and the added benefit of management by Blockchain Technology, the energy distribution will be streamlined to the benefit of both the consumer and the company. While crypto Blockchain Technology is relatively new to the energy industry it is already being utilized to streamline the process by matching energy distribution and pricing with demand in real time saving both time and costs. Read this and more news for Sun Pacific at: http://www.marketnewsupdates.com/news/snpw.html\n\"We are pleased to have this agreement to acquire this prime parcel of land to develop solar and wind power,\" says Mr. Nicholas B Campanella CEO and Chairman. \"This acquisition will be an all-stock equity acquisition and adds to our expanding geographic footprint and overall strategy in the state of Rhode Island. With the recent energy initiative by National Grid and the state of Rhode Island green energy initiative, an effort which significantly broadens Rhode Island's program, we want to be firmly established in the state and solidify our advantage in one of the largest markets in the United States.\"\nRenewable Energy Growth Program (REG Program)\nThe Renewable Energy Growth Program (REG Program) will support the development of 160 MW of distributed generation projects in Rhode Island between 2015 and 2019. Eligible technologies include wind, solar, hydropower, and anaerobic digestion.\nIn other industry developments from around the markets:\nPareteum Corporation (NYSE: TEUM) closed up over 11% on Wednesday at $2.98 trading over 44.9 Million shares by the market close. Paretum recently announced that it has executed agreements that represent a 36 Month Contractual Revenue Backlog of a record $147,000,000, as of December 31, 2017. Bolstered by 28 newly signed customer agreements in 2017, totaling $117,000,000 in 36 Month Contractual Revenue Backlog, the fourth quarter of 2017 represents an increased 58% over the third quarter of 2017 contract agreement executions. The Compounded Annual Growth Rate (CAGR) of Pareteum's 36 Month Contractual Revenue Backlog is 389% since January 1, 2017.\nAnother company making a move into the blockchain arena is Marathon Patent Group (NASDAQ: MARA). Marathon is an IP licensing and management company that recently purchased Global Bit Ventures, a digital asset technology company engaged in the mining of cryptocurrencies. The company believes that this acquisition will help it enhance shareholder value by participating in the revolution in digital transactions made possible by the development of the blockchain. The company believes that blockchain protocols will increasingly be adopted in our day-to-day lives.\nEnergy industry heavyweight BP p.l.c. (NYSE: BP) has been following the blockchain technology's development closely. In its corporate magazine , a focus on next generation technologies included an article on the blockchain. The article credits the innovative technology with possessing the potential to disrupt entire industries. BP sees the blockchain as presenting the opportunity to create new business models for trading, supply chain management and retail in the energy industry. As an example of its potential, the article mentions that the company could use the blockchain to process payments directly from the blockchain \"wallet\" of an automobile driver to a business such as a retail store without involving a bank.\nIn other energy news of note:\nIn partnership with leading architect Dan Brunn, SunPower Corporation (NASDAQ: SPWR) recently announced the installation of a 10-kilowatt (KW) solar power system for the Los Angeles-based, award-winning architect's personal residence, Bridge House. A showcase for green building possibilities, the home is being built to be net-zero energy compliant, in advance of the California Residential Zero Net Energy Target of 2020, resulting in the amount of energy provided by the rooftop solar system to be equal to the amount of energy consumed by the building on an annual basis. In 2017, more than one-third of homebuilders said green building was a significant share of their overall activity. By 2022, this number is expected to increase to one-half, proving that trends of green construction and building are here to stay.\nDISCLAIMER: MarketNewsUpdates.com (MNU) is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. MNU is NOT affiliated in any manner with any company mentioned herein. MNU and its affiliated companies are a news dissemination solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. MNU's market updates, news alerts and corporate profiles are NOT a solicitation or recommendation to buy, sell or hold securities. The material in this release is intended to be strictly informational and is NEVER to be construed or interpreted as research material. All readers are strongly urged to perform research and due diligence on their own and consult a licensed financial professional before considering any level of investing in stocks. All material included herein is republished content and details which were previously di", "external_links": ["http://www.marketnewsupdates.com/news/snpw.html", "https://www.bp.com/en/global/corporate/bp-magazine/innovations/next-generation-technologies-that-matter-for-energy-industry.html"], "published": "2018-01-04T16:50:00.000+02:00", "crawled": "2018-01-04T16:44:48.000+02:00", "highlightTitle": ""}