{"organizations": [], "uuid": "b02348b6bb0b94051fa6b5070698deec12872cc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-tiger-cool-express-appoints-leslie-baird-as-chief-commercial-officer-and-don-aiken-as-executive-vice-president-operations.html", "country": "US", "domain_rank": 767, "title": "Tiger Cool Express Appoints Leslie Baird As Chief Commercial Officer And Don Aiken As Executive Vice President Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:47:00.000+02:00", "replies_count": 0, "uuid": "b02348b6bb0b94051fa6b5070698deec12872cc4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-tiger-cool-express-appoints-leslie-baird-as-chief-commercial-officer-and-don-aiken-as-executive-vice-president-operations.html", "ord_in_thread": 0, "title": "Tiger Cool Express Appoints Leslie Baird As Chief Commercial Officer And Don Aiken As Executive Vice President Operations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERLAND PARK, Kan., Jan. 25, 2018 /PRNewswire/ -- Tiger Cool Express announced today two additions to their leadership team. Leslie Baird was named as Chief Commercial Officer and Don Aiken as Executive Vice President Operations.\nCEO Steve Van Kirk stated \"We are excited to have two industry veterans join our team. Leslie will provide the commercial leadership to help us grow our business, and Don will help us to continue to improve our dray operations. We feel the transportation market is short of capacity, and values a reliable time definite temperature controlled container intermodal service. Tiger Cool's goal is to provide great service and consistent intermodal capacity to our customers.\"\nPrior to joining Tiger Cool Express, Mrs. Baird served as Vice President of Sales for Interstate Distributor Company for five years. While at Interstate, she was responsible for leading the commercial strategy for the Regional Dry Van, Team Expedited, Temperature Control, and Asset Lite business units. Prior to that she held a series of commercial and sales leadership roles with increasing accountabilities at several trucking companies including Arnold Transportation, Roehl Transport, Celadon, and CFI. Baird noted \"I am very excited to join the team at Tiger Cool. I look forward to leading our commercial efforts and to providing superior service to our temperature controlled intermodal customers.\"\nPrior to joining the Tiger Cool Express team, Mr. Aiken served in a series of intermodal operations and leadership roles at JB Hunt, Schneider National and NFI. He has a passion for operational excellence and will help us provide exceptional service to our customers. Aiken stated, \"I want to help Tiger Cool become the largest and best temperature controlled intermodal company. I'm excited to be part of the team.\"\nAbout Tiger Cool Express LLC\nFormed in 2013, Tiger Cool Express provides temperature-controlled transport in 53 foot intermodal containers equipped with telematics. The Tiger Cool Express intermodal product provides reliable truck-like service at competitive rates. Tiger Cool is growing its fleet to 2,000 containers to better serve our customers as the temperature controlled intermodal market in the U.S. continues to expand.\nView original content with multimedia: http://www.prnewswire.com/news-releases/tiger-cool-express-appoints-leslie-baird-as-chief-commercial-officer-and-don-aiken-as-executive-vice-president-operations-300588472.html\nSOURCE Tiger Cool Express", "external_links": ["http://www.prnewswire.com/news-releases/tiger-cool-express-appoints-leslie-baird-as-chief-commercial-officer-and-don-aiken-as-executive-vice-president-operations-300588472.html"], "published": "2018-01-25T22:47:00.000+02:00", "crawled": "2018-01-26T00:06:46.003+02:00", "highlightTitle": ""}