{"organizations": [], "uuid": "5aaf5a9761608a00588ccebbe0f99ca05a572bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-psychiatrys-brave-new-world-fda-approves-digital-sensor-in-antipsychotic-drug-to-enforce-prescription-compliance.html", "country": "US", "domain_rank": 767, "title": "Psychiatry's Brave New World--FDA Approves Digital Sensor in Antipsychotic Drug to Enforce Prescription Compliance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.174, "site_type": "news", "published": "2018-01-11T21:00:00.000+02:00", "replies_count": 0, "uuid": "5aaf5a9761608a00588ccebbe0f99ca05a572bba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-psychiatrys-brave-new-world-fda-approves-digital-sensor-in-antipsychotic-drug-to-enforce-prescription-compliance.html", "ord_in_thread": 0, "title": "Psychiatry's Brave New World--FDA Approves Digital Sensor in Antipsychotic Drug to Enforce Prescription Compliance", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "cchr", "sentiment": "none"}, {"name": "citizens commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 11, 2018 /PRNewswire/ -- The U.S. Food and Drug Administration has approved an antipsychotic , aripiprazole, as the first drug to contain a \"digital ingestion tracking system\" that can tell whether the drug has been taken—a technology that even a leading U.S. psychiatrist likened to \"a biomedical Big Brother.\"[1] The Citizens Commission on Human Rights (CCHR) , an international mental health industry watchdog, says Congress should investigate how the FDA could approve such technology to be used on the very same antipsychotic drug that the Agency already warned can cause damaging compulsive behavior, requiring a Black Box warning.[2] Despite the agency's most severe warning, it is allowing the antipsychotic to be the first to utilize the digital tracking that could be used to enforce patients to take the drug, CCHR says.\nThe new tracking system works by sending a message from the pill's sensor to a wearable patch. The patch transmits the information to a mobile application so that patients can track the ingestion of the drug on their smart phone. Caregivers and physicians may also access the information through a web-based portal.[3]\nThe New York Times has cited concerns about the technology, headlining their article in November, \"First Digital Pill Approved to Worries about Biomedical 'Big Brother'.\"[4] Other media said it sparked worries about granting \"Big Brother\" the ability to know if you're \"properly medicated.\" The New York Times also pointed out that insurers may push medical practitioners to prescribe digital pills so they make certain drugs are being used. A digital script might also become a condition for parole or releasing patients from psychiatric facilities.[5]\nWhile the patient is supposed to consent to the digital pill, the technology also carries risks for patient privacy if there are breaches of medical data or unauthorized use as a surveillance tool, said James Giordano, a professor of neurology at Georgetown University Medical Center. \"Could this type of device be used for real-time surveillance? The answer is of course it could,\" said Giordano.[6]\nCCHR says approving an antipsychotic for this technology is egregious, given aripiprazole's already known serious adverse effects that include increased risk of death in elderly patients.[7] And while not approved for use in dementia patients, the drug can be prescribed off-label. Aripiprazole has already become one of the hottest off-label scripts in the country, looping in large groups of new patients, according to a 2015 exposé in the Milwaukee Magazine.[8]\nLast year's FDA Black Box warning on the antipsychotic was based on approximately 200 reported cases of compulsive gambling, eating, shopping, or sexual behaviors by patients taking aripiprazole, according to Consumer Safety. The drug can also cause some patients to gain as much as a pound per week while taking it and can cause hyperglycemia (an increase in blood sugar). Both hyperglycemia and rapid weight gain are risk factors for type 2 diabetes.[9]\nA Lucrative Drug Business\nIn 2007, the FDA also approved aripiprazole as an \"add-on\" drug to antidepressants for treatment of depression.[10] It helped make the antipsychotic America's highest-grossing drug. Between April 2013 and March 2014, it racked up about $6.9 billion in U.S. sales, more than any other prescription drug.[11] Antidepressants , with which aripiprazole is combined, are one of the three most commonly used drug classes in the U.S., according to the Centers for Disease Control and Prevention (CDC).[12]\nNow, with the approval of the digestion tracking system, CCHR says millions of people prescribed the drug could be tracked to ensure they stay on it. At more than $450 a bottle even without the digital tracker, the powerful antipsychotic was prescribed to nearly 9 million Americans in 2014.[13]\nPsychiatry Creates Brave New World in Mental Health\nToday, research is also in the pipeline to replace drugs with a medical implant that is attached to the nerve to block or alter signals in the nerve.[14] It is called bioelectronic medicines or as GlaxoSmithKline coined, \"electroceuticals.\"[15] In March 2016, The Wall Street Daily reported, \"A number of pharmaceutical companies will eventually transform into bioelectronics companies…Welcome to the brave new world of neuromodulation and electroceuticals.\"[16]\nIn 2015, a Forbes report said that investors had poured $3.3 billion into firms that are developing drugs for brain-destroying or psychiatric illnesses, more than in any of the last ten years, quoting NeuroPerspective.[17] Whether nerve-trapping devices or drugs, the bottom line is that the 79 million Americans taking psychotropic drugs are now at risk of serious effects, yet the FDA—buoyed by psychiatric research—keeps approving these drugs and other technology to treat and control some of our most vulnerable, while the adverse effects are ignored, CCHR asserts. The group says the digital tracking pill is but the tip of the iceberg.\nA Genetic Literacy Project article discussed \"optogenetics\" (from Greek optikós, meaning 'seen, visible') being used—creating neurons that can be stimulated by flashes of light. A benign virus is inserted into a \"light activated gene\" in a mouse so that a light flashes into its brain to purportedly activate targeted neurons.[18] Researchers at the University of Texas Health Science Center recommended \"cell transplants\" to treat \"schizophrenia.\" From biopsying tissue from rat fetuses, isolating cells from the tissue and injecting the cells into the brain center, the theory is that cells not \"functioning properly\" could be \"replaced,\" according to senior author Daniel Lodge, Ph.D., assistant professor of pharmacology. \"…We want to reprogram a patient's own cells and use them,\" he stated.[19] In a study conducted from the University of California-San Diego, researchers said they could erase specific memories from the brains of rats and then later \"reactivate\" them. \"We can cause an animal to have fear and then not have fear and then to have fear again by stimulating the nerves…,\" lead author Sadegh Nabavi said.[20] Researchers have developed an \"implantable device that can record brain activity and deliver electric current to the brain at the same time.\" Implant makers forecast a day when neural implants would treat a wide variety of \"psychiatric problems.\"[21] A study conducted by University of Utah doctors used a surgical anesthetic drug to turn off electroactivity of the brain for about 15 minutes before the patient wakes up, a \"treatment\" predicted could be administered to mental health patients daily.[22]\nCCHR says greater oversight is needed on psychiatric research that historically has been used to develop techniques to control behavior, not to cure. The recently released Netflix documentary series Wormwood is evidence of this and the disastrous results. And why \"digital sensors,\" electroshock treatment and electronic implants should never be allowed in the field of mental health. With the FDA complicit in this, CCHR says Congress should have ", "external_links": ["http://www.eurekalert.org/pub_releases/2013-09/uoth-ctm090913.php", "https://www.milwaukeemag.com/the-selling-of-abilify/", "https://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/ucm584933.htm", "https://www.sciencedaily.com/releases/2014/06/140601150633.htm", "http://www.meddeviceonline.com/doc/gsk-sets-trials-for-electroceuticals-for-chronic-diseases-0001", "https://www.nytimes.com/2017/11/13/health/digital-pill-fda.html?_r=0", "http://www.gmanetwork.com/news/scitech/technology/322351/implant-can-scan-stimulate-brain/story/", "http://www.ksl.com/?sid=26214243&nid=148", "http://blogs.discovermagazine.com/d-brief/2017/11/15/digital-pill/#.WlWJC3k9LIU.", "http://www.nbcnews.com/tech/innovation/wireless-medical-implant-smaller-grain-rice-n109431", "https://www.cchrint.org/psychiatric-drugs/", "http://www.prnewswire.com/news-releases/psychiatrys-brave-new-world--fda-approves-digital-sensor-in-antipsychotic-drug-to-enforce-prescription-compliance-300581439.html", "http://www.sfgate.com/business/article/First-digital-pill-approved-despite-worries-about-12357627.php", "https://www.consumersafety.org/legal/abilify-lawsuit/", "https://www.cchrint.org/", "http://www.wallstreetdaily.com/2016/03/10/electroceuticals-glaxosmithkline-gsk/", "https://www.cchrint.org/cchrint-donate/", "http://www.motherjones.com/politics/2005/11/who-holds-clicker/", "https://www.webmd.com/depression/news/20071120/fda-oks-abilify-for-depression", "https://www.cchrint.org/psychiatric-drugs/antipsychoticsideeffects/", "https://www.cchrint.org/psychiatric-drugs/antidepressantsideeffects/", "https://www.minnpost.com/second-opinion/2015/05/has-overprescribing-antipsychotics-become-new-norma", "https://sciencealert.com/fda-approved-first-digital-pill-embedded-tracking-system-abilify-mycite", "http://www.cdc.gov/nchs/data/databriefs/db283.pdf", "https://www.psychiatry.org/news-room/apa-blogs/apa-blog/2017/09/antidepressant-use-on-the-rise", "http://www.naturalnews.com/045690_memory_implants_induced_loss_medical_ethics.html", "http://www.forbes.com/sites/matthewherper/2015/02/11/brain-boom-the-drug-companies-bringing-neuroscience-back-from-the-brink/#7d3ea7b52a22."], "published": "2018-01-11T21:00:00.000+02:00", "crawled": "2018-01-11T21:32:07.011+02:00", "highlightTitle": ""}