{"organizations": [], "uuid": "21f481200d694b2fd6398a248f7a25361619fd67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-lgbt-research/indian-police-extort-transgender-sex-workers-increasing-hiv-risk-study-idUSKBN1FC16G", "country": "US", "domain_rank": 408, "title": "Indian police extort transgender sex workers, increasing HIV risk - study", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.914, "site_type": "news", "published": "2018-01-23T18:38:00.000+02:00", "replies_count": 0, "uuid": "21f481200d694b2fd6398a248f7a25361619fd67"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-lgbt-research/indian-police-extort-transgender-sex-workers-increasing-hiv-risk-study-idUSKBN1FC16G", "ord_in_thread": 0, "title": "Indian police extort transgender sex workers, increasing HIV risk - study", "locations": [], "entities": {"persons": [{"name": "venkatesan chakrapani", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "chennai-based centre", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "humsafar trust", "sentiment": "none"}, {"name": "health research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - Police in India routinely extort female transgender sex workers, which pressures them to earn more by engaging in unsafe sex that increases the risk of disease, researchers say.\nGender minorities need more protection and police need sensitivity training, said a report by the Chennai-based Centre for Sexuality and Health Research and Policy (C-SHaRP) and the Mumbai-based Humsafar Trust.\n“We found that transgender women have poor earnings and they have to share that too with the police and ruffians who exploit them,” said Venkatesan Chakrapani, a doctor who chairs C-SHaRP and has researched the transgender community for years.\n“Because of this extortion, they try to earn more and do not insist their customers use condoms,” he told the Thomson Reuters Foundation on Tuesday.\nThe study, published in late 2017, was based on interviews with 300 transgender women working in the sex industry in major Indian cities. The results showed that they face a high risk of abuse and sexually transmitted diseases, including HIV.\nThe HIV prevalence among India’s transgender community is estimated at 7.5 percent, much higher than the country’s average of 0.3 percent, government data shows.\nTransgender women fear police action under a British colonial-era law that prohibits “carnal intercourse against the order of nature with any man, woman or animal”, which is widely interpreted to refer to homosexual sex.\n“Biologically, most transgender women are born as males, so it is not clear whether they could be penalized for having sex with a man,” Chakrapani said.\nIndia’s 2011 census recorded half a million transgender people, but campaigners estimate the number at about 2 million. Less than half are literate and even fewer have traditional jobs, according to the census.\nIn a landmark 2014 judgment, the Supreme Court granted legal status to transgender people and made them eligible for quotas in employment and educational institutions.\nHowever, social bias continues and they are denied education and jobs, forcing many of them into the sex industry, campaigners say.\n“If they are begging or are engaged in sex work, they face more abuse from the police,” said Shubha Chacko, executive director of the Solidarity Foundation, which helps transgender people find jobs.\nDoley Barman, director of the National Police Academy, said police training includes “sensitization modules on dealing with the transgender community”, as well as visits to areas where trainees can interact with transgender people.\nReporting by Roli Srivastava @Rolionaroll; Editing by Jared Ferrie. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T18:38:00.000+02:00", "crawled": "2018-01-23T20:41:22.000+02:00", "highlightTitle": ""}