{"organizations": [], "uuid": "ced59334b3f4b902f50c3c11a67e85ebe6f5e2b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-neopost-governance-evolves-to-accelerate-the-groups-transformation.html", "country": "US", "domain_rank": 767, "title": "Neopost Governance Evolves to Accelerate the Group's Transformation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:31:00.000+02:00", "replies_count": 0, "uuid": "ced59334b3f4b902f50c3c11a67e85ebe6f5e2b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-neopost-governance-evolves-to-accelerate-the-groups-transformation.html", "ord_in_thread": 0, "title": "Neopost Governance Evolves to Accelerate the Group's Transformation", "locations": [], "entities": {"persons": [{"name": "geoffrey godet", "sentiment": "negative"}, {"name": "denis thiery", "sentiment": "negative"}, {"name": "vincent mercier", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}], "organizations": [{"name": "neopost governance evolves", "sentiment": "negative"}, {"name": "group", "sentiment": "negative"}, {"name": "group’s board of directors", "sentiment": "none"}, {"name": "general assembly", "sentiment": "none"}, {"name": "neopost", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Geoffrey Godet named Group Chief Executive Officer Denis Thiery is Chairman of the Board of Directors\nPARIS--(BUSINESS WIRE)-- The Board of Directors of Neopost, a global leader in digital communications, shipping and mail solutions, decided at its meeting on 12 January 2018 to implement the separation of the functions of Chairman of the Group’s Board of Directors and the Chief Executive Officer.\nThis separation of functions is in line with the commitment undertaken for the General Assembly held on 1 July 2016, and will be effective from 1 February 2018.\nGeoffrey Godet is named Chief Executive Officer of Neopost. His principal mission will be to accelerate the Group’s transformation. Denis Thiery is Chairman of the Board of Directors. He will ensure the implementation of the new governance by bringing his in-depth knowledge of the sector and the company.\nDenis Thiery, Chairman and Vincent Mercier, Lead Director at Neopost, declared: “The Board of Directors was looking for a candidate with a strong international culture and a broad experience of the new technologies needed for Neopost’s evolution. We found these qualities in Geoffrey Godet who demonstrated his capacity to create innovative solutions to meet companies’ digital transformation needs. His 15-year experience in the USA in the area of software and digital solutions, his leadership and his client focus will enable him to bring a new perspective and a new momentum to transform Neopost.”\nGeoffrey Godet added: “I am delighted to join Neopost, a strong international group whose numerous assets, namely its 6,000 employees, its 500,000 customers, its international distribution network and its solid financials, give it great potential. I look forward to meeting the challenges that lie ahead together with the teams in place, so that we can return to sustainable organic growth in the long term.”\nGeoffrey Godet will be based at Neopost’s headquarters in Bagneux, in the Paris region. His nomination to the Neopost Board of Directors will be proposed to the shareholder General Assembly which will take place on 29 June 2018.\n---\nGeoffrey Godet, 40, a dual French and American citizen and a graduate of HEC, has spent his entire career with the Flatirons and Jouve Group, a leader in digital solutions for banking, insurance, healthcare, manufacturing, aeronautics, publishing, media and education. The Flatirons and Jouve Group is present in the United States, France, the United Kingdom, Germany, the Nordic countries, China and India. Since 2004, Geoffrey has been Chief Executive Officer of Flatirons Solutions, based in California, and most recently was Chairman and Chief Executive Officer of Jouve, based in Paris. Prior to that, he was successively Marketing and Communications Director, Head of the Cultural Heritage Digitization Division and Managing Director of Jouve Aviation Solutions.\nDenis Thiery , 62, a graduate of HEC, joined Neopost in 1998 as Group Chief Financial Officer and was responsible for the Group’s successful stock market introduction. He became Chief Executive Officer from 19 June 2007 to 12 January 2010, at which time he became Group Chairman and Chief Executive Officer. Denis Thiery started his career at Coopers and Lybrand before holding a series of positions at Wang France, including Finance Director. Previously he was Finance Director and then Managing Director of the Moorings group in Florida.\nABOUT NEOPOST\nNEOPOST is a global leader in digital communications, shipping and mail solutions. Its mission is to help companies improve the way they manage interactions with their clients and partners. Neopost provides the most advanced solutions for physical mail processing (mailing systems and folders-inserters), digital communications management (Customer Communications Management and Data Quality applications), and supply chain and e-commerce process optimization (from point of sale to delivery, including associated tracking services).\nWith a direct presence in 29 countries and close to 6,000 employees, Neopost reported annual sales of €1.2 billion in 2016. Its products and services are sold in more than 90 countries.\nNeopost is listed in compartment A of Euronext Paris and belongs to the SBF 120 index.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005309/en/\nFor more information, please contact:\nNeopost, Gaële Le Men\nFinancial & External\nCommunications Director\nTel: +33 (0)1 45 36 31 39\nEmail: g.le-men@neopost.com\nor\nFTI Consulting\nCaroline Guilhaume\nChristina Zinck\nTel: +33 (0)1 47 03 68 17\nEmail: neopost@fticonsulting.com\nOr visit our website: www.neopost-group.com\nSource: Neopost", "external_links": ["http://www.businesswire.com/news/home/20180119005309/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.neopost-group.com&esheet=51745821&lan=en-US&anchor=www.neopost-group.com&index=1&md5=902526462ce76f503d09a9b429dcc02f"], "published": "2018-01-19T15:31:00.000+02:00", "crawled": "2018-01-19T16:26:02.006+02:00", "highlightTitle": ""}