{"organizations": [], "uuid": "a665302b3e669c91c8551386a2f66604617d4e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/29/reuters-america-update-1-ramen-price-fixing-class-action-headed-for-u-s-trial.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Ramen price-fixing class action headed for U.S. trial", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-29T21:08:00.000+02:00", "replies_count": 0, "uuid": "a665302b3e669c91c8551386a2f66604617d4e65"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/29/reuters-america-update-1-ramen-price-fixing-class-action-headed-for-u-s-trial.html", "ord_in_thread": 0, "title": "UPDATE 1-Ramen price-fixing class action headed for U.S. trial", "locations": [], "entities": {"persons": [{"name": "mark kindall", "sentiment": "none"}, {"name": "william orrick", "sentiment": "none"}, {"name": "ottogi", "sentiment": "none"}, {"name": "orrick", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francis", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "renaissance seoul hotel", "sentiment": "none"}, {"name": "ottogi corp", "sentiment": "none"}, {"name": "nongshim co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comment from lawyer for consumer plaintiffs)\nDec 29 (Reuters) - A federal judge in San Francisco has refused to dismiss antitrust class action litigation accusing two big South Korean ramen producers of conspiring to fix prices in the United States, clearing the way for a trial.\nU.S. District Judge William Orrick on Thursday rejected efforts by market leader Nongshim Co and Ottogi Corp to dismiss claims brought by food retailers and distributors, and by consumers in 23 U.S. states and Washington, D.C.\nLawyers in the United States for Nongshim and Ottogi did not immediately respond on Friday to requests for comment. Mark Kindall, a lawyer for the consumers, said he was \"obviously very pleased with the resolution and the judge's determination that this case is ready to go to a jury.\"\nThe plaintiffs accused ramen makers of coordinating six price increases from 2001 to 2008 in a scheme hatched at a meeting at the Renaissance Seoul Hotel, causing them to overpay for their noodles from early 2003 through January 2010.\nIn a 59-page decision, Orrick said there was \"ample (although hotly disputed) evidence\" that the defendants conspired to fix ramen prices in South Korea.\nAlthough calling it a \"much closer question,\" Orrick found sufficient evidence that this alleged conspiracy affected ramen prices in the United States, including ramen made there.\n\"That there may have been minor differences (according to plaintiffs) between the products destined for the U.S. market and destined elsewhere does not, on this record, make the products so fundamentally different that the differences undermine plaintiffs' ability to sue,\" Orrick wrote.\nA trial is scheduled for Feb. 23. The litigation began in 2013.\nRamen noodles are typically sold in packages, cups or bowls, with seasoning and dehydrated vegetables, to which consumers add boiling water.\nIn court papers, Nongshim and Ottogi have said they acted independently when setting prices.\nThey also accused the plaintiffs of improperly piggybacking off since-abandoned findings by the Korea Fair Trade Commission of a price-fixing conspiracy in South Korea.\nAnother Korean ramen maker, Samyang Foods Co, reached $1.5 million of settlements with the plaintiffs in 2016.\n\"We are pleased to have cleared the last hurdle before trial, and our clients look forward to presenting their case to a jury,\" Christopher Lebsock, a lawyer for the retailers and distributors, said in an email.\nThe case is In re: Korean Ramen Antitrust Litigation, U.S. District Court, Northern District of California, No. 13-04115. (Reporting by Jonathan Stempel in New York; Editing by Steve Orlofsky and Bill Trott)", "external_links": [], "published": "2017-12-29T21:08:00.000+02:00", "crawled": "2018-01-01T08:01:07.109+02:00", "highlightTitle": ""}