{"organizations": [], "uuid": "5ca32890775050e99d8bf70d1366987f0c9ebc9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-oceanfirst-financial-corp-announces-quarterly-and-annual-financial-results.html", "country": "US", "domain_rank": 767, "title": "OceanFirst Financial Corp. Announces Quarterly and Annual Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:30:00.000+02:00", "replies_count": 0, "uuid": "5ca32890775050e99d8bf70d1366987f0c9ebc9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-oceanfirst-financial-corp-announces-quarterly-and-annual-financial-results.html", "ord_in_thread": 0, "title": "OceanFirst Financial Corp. Announces Quarterly and Annual Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "oceanfirst financial corp", "sentiment": "negative"}, {"name": "oceanfirst financial corp.", "sentiment": "negative"}, {"name": "oceanfirst bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOMS RIVER, N.J., Jan. 25, 2018 (GLOBE NEWSWIRE) -- OceanFirst Financial Corp. (NASDAQ:OCFC), (the “Company”), the holding company for OceanFirst Bank (the “Bank”), today announced that diluted earnings per share were $0.30 for the quarter ended December 31, 2017, as compared to $0.22 for the corresponding prior year quarter. For the year ended December 31, 2017, diluted earnings per share were $1.28, as compared to $0.98 for the corresponding prior year period.\nThe results of operations for the quarter and year ended December 31, 2017 included merger related expenses, branch consolidation expenses, and additional income tax expense from the revaluation of deferred tax assets as a result of the reduction in the corporate income tax rate related to the recently enacted Tax Cuts and Jobs Act (“Tax Reform”), and for the year ended December 31, 2017, also included the acceleration of stock award expense due to the retirement of a director. These items decreased net income, net of tax benefit, for the quarter and year ended December 31, 2017 by $4.9 million and $13.7 million, respectively. Excluding these items, core earnings for the quarter and year ended December 31, 2017 were $14.9 million, or $0.45 per diluted share, and $56.2 million, or $1.70 per diluted share, respectively. (Please refer to the Non-GAAP Reconciliation table at the end of this document for details on the earnings impact of merger related expenses, branch consolidation expenses, additional income tax expense related to the recently enacted Tax Reform, and certain other incurred expenses and quantification of core earnings).\nHighlights are described below:\nDeposits increased $155.0 million for the year, while the cost of deposits increased only four basis points, to 0.29%. The loan to deposit ratio at December 31, 2017 was 91.3%. Total loans increased $160.9 million for the year, with $123.1 million of the growth relating to commercial lending. As a result of the tax rate reduction associated with the recently enacted Tax Reform, the Company will reinvest part of the anticipated benefit in its workforce by raising the minimum hourly pay rate to $15.00 and increasing the number of shares available in the employee stock ownership program by 300,000 shares.\nChairman and Chief Executive Officer Christopher D. Maher said, “We are pleased to report 2017 results which included record core earnings of $56.2 million and core diluted earnings per share of $1.70. Core expenses decreased again in the fourth quarter, further benefiting from the branch consolidations completed earlier in the year, and lowering our efficiency ratio to 53.7%.” Mr. Maher added, “The merger with Sun Bancorp, Inc. remains on target to close on January 31, 2018 and we look forward to welcoming their stockholders, customers and employees into our OceanFirst family.”\nOn June 30, 2017, the Company announced a definitive agreement and plan of merger with Sun Bancorp, Inc. (“Sun”) (NASDAQ:SNBC) (the “merger”). On October 24 and 25, 2017, Sun and the Company received their respective requisite stockholder approvals for the merger. Regulatory approval of the merger was received from the Federal Reserve Bank of Philadelphia on October 17, 2017. The regulatory approval for the transaction by the Office of the Comptroller of the Currency was received on December 4, 2017 and included approval to convert the Bank to a national bank charter. Subject to other customary closing conditions, the Company expects to close the transaction on January 31, 2018, and anticipates full integration of Sun’s branches and core operating systems in the second quarter of 2018. The Company expects to consolidate 17 branches in the second quarter, primarily as a result of the merger. These initiatives will allow the Company to continue to invest in commercial banking and electronic delivery channels while meeting the efficiency targets established in connection with the recent acquisitions.\nThe Company also announced that the Company’s Board of Directors declared its eighty-fourth consecutive quarterly cash dividend on common stock. The dividend, for the quarter ended December 31, 2017, of $0.15 per share will be paid on February 16, 2018 to stockholders of record on February 5, 2018.\nBoard of Directors Appointments\nOn January 24, 2018, the Company’s Board of Directors announced the appointment of John K. Lloyd to its Board of Directors effective immediately and to the OceanFirst Bank Board of Directors effective at the time of the Sun Merger. Mr. Lloyd is the Co-CEO of Hackensack Meridian Health, the largest most comprehensive and integrated health network in New Jersey. Prior to the merger of Meridian Health and Hackensack University Health Network in July 2016, Mr. Lloyd was President and CEO of Meridian Health since 1997. In addition to his significant experience in healthcare and leadership skills from more than 35 years as a CEO, Mr. Lloyd has served on the boards for other companies and charitable organizations. The Company also announced that Dorothy F. McCrosson will retire from the Board of Directors of the Company and OceanFirst Bank upon the expiration of her term at the 2018 Annual Meeting of Stockholders in order to devote more time to her law practice, personal business and family. On December 20, 2017, the Company’s Board of Directors approved the appointment of Anthony Coscia and Grace Torres, each being a member of the Board of Directors of Sun, to the Company’s and Bank’s Boards of Directors upon the closing of the Sun Merger, as previously disclosed.\nResults of Operations\nOn May 2, 2016, the Company completed its acquisition of Cape Bancorp, Inc. (“Cape”) and its results of operations are included in the consolidated results for the quarter and year ended December 31, 2017, but are excluded from the results for the period from January 1, 2016 to May 1, 2016.\nOn November 30, 2016, the Company completed its acquisition of Ocean Shore Holding Company (“Ocean Shore”) and its results of operations are included in the consolidated results for the quarter and year ended December 31, 2017, but are excluded from the results of operations for the period from January 1, 2016 to November 30, 2016.\nNet income for the quarter ended December 31, 2017, was $10.0 million, or $0.30 per diluted share, as compared to $6.1 million, or $0.22 per diluted share, for the corresponding prior year period. Net income for the year ended December 31, 2017, was $42.5 million, or $1.28 per diluted share, as compared to $23.0 million, or $0.98 per diluted share, for the corresponding prior year period. Net income for the quarter and year ended December 31, 2017 included merger related expenses, branch consolidation expenses, and additional income tax expense related to the recently enacted Tax Reform, and for the year ended December 31, 2017, also included the acceleration of stock award expense due to the retirement of a director. These items decreased net income, net of tax benefit, for the quarter and year ended December 31, 2017, by $4.9 million and $13.7 million, respectively. Net income for the quarter and year ended December 31, 2016 included merger related expenses of $4.5 million and $11.8 million, respectively. Excluding these items, net income for the quarter and year ended December 31, 2017 increased over the prior year periods primarily due to the acquisitions of Cape and Ocean Shore (“Acquisition Transactions”). In addition, in the first quarter of 2017 the Company adopted Accounting Standards Update (“ASU”) 2016-09 “Compensation - Stock Compensation” which resulted in decreases in income tax expense for the quarter and year ended December 31, 2017, of $125,000 and $1.8 million, respectively.\nNet interest income for the quarter and year ended December 31, 2017 increased to $42.5 million and $169.2 million, respectively, as compared to $35.8 million and $120.3 million for the same prior year periods, reflecting an increase in interest-earning assets and a higher net interest margin. Average interest-earning assets increased $741.1 million and $1.370 billion, respectively, for the quarter and year ended December 31, 2017, as compared to the same prior year periods, and were favorably impacted by the interest-earning assets acquired in the Acquisition Transactions. The net interest margin for the quarter and year ended December 31, 2017 increased to 3.42% and 3.50%, respectively, from 3.40% and 3.47%, respectively, for the same prior year periods. The yields on average interest-earning assets increased to 3.86% and 3.91%, respectively, for the quarter and year ended December 31, 2017, from 3.79% and 3.85%, respectively, for the same prior year periods. For the quarter and the year ended December 31, 2017, the cost of average interest-bearing liabilities increased to 0.54% and 0.50%, respectively, from 0.48% and 0.47%, respectively, in the corresponding prior year periods. The total cost of deposits (including non-interest bearing deposits) was 0.32% and 0.29%, respectively, for the quarter and year ended December 31, 2017, as compared to 0.26% and 0.25%, respectively, for the corresponding prior year periods.\nNet interest income for the quarter ended December 31, 2017, decreased $551,000, as compared to the prior linked quarter, as net interest margin decreased to 3.42% for the quarter ended December 31, 2017, from 3.50% for the prior linked quarter, partly due to the decrease in accretion of purchase accounting adjustments. Total loans increased $94.1 million for the quarter ended December 31, 2017 with a significant amount of this growth occurring late in the quarter. The growth was primarily funded from cash and short-term investments. The improved asset mix will benefit net interest income in the first quarter of 2018.\nFor the quarter and year ended December 31, 2017, the provision for loan losses was $1.4 million and $4.4 million, respectively, as compared to $510,000 and $2.6 million, respectively, for the corresponding prior year periods, and $1.2 million in the prior linked quarter. Net loan charge-offs were $2.3 million and $3.9 million, respectively, for the quarter and year ended December 31, 2017, as compared to net loan charge-offs of $944,000 and $4.2 million, respectively, in the corresponding prior year periods, and $1.1 million in the prior linked quarter. Net charge-offs for the quarter ended December 31, 2017 included $880,000 of specific reserves established in prior periods on non-performing loans, which were separately identified in the allowance for loan losses. Non-performing loans totaled $20.9 million at December 31, 2017, as compared to $15.1 million at September 30, 2017, and $13.6 million at December 31, 2016. The increase was primarily attributable to one commercial loan relationship, which entered non-performing status in the fourth quarter of 2017. Subsequent to December 31, 2017, the Bank received a significant payment from this borrower.\nFor the quarter and year ended December 31, 2017, other income increased to $6.7 million and $27.1 million, respectively, as compared to $6.3 million and $20.4 million, respectively, for the corresponding prior year periods. The increases were primarily due to the Acquisition Transactions, which added $1.2 million and $6.1 million, respectively, to other income for the quarter and year ended December 31, 2017, as compared to the same prior year periods. Excluding the Acquisition Transactions, other income decreased for the quarter ended December 31, 2017, primarily due to an increase in the net loss from other real estate operations of $676,000, of which $500,000 related to a write-down attributable to the operations of a hotel, golf and banquet facility, a decrease in bank card related fees of $238,000, and a decrease in the net gain on the sale of loans available for sale (included in other income) of $215,000, as compared to the same prior year period. The decrease was partially offset by rental income of $460,000 for November and December 2017 on the Company’s newly acquired corporate headquarters. The building will continue to be occupied by the former owner through February 2018. For the year ended December 31, 2017, excluding the Acquisition Transactions, the increase in other income was primarily due to higher deposit fees of $1.3 million and the rental income of $460,000, partially offset by a decrease of $912,000 in the net gain on the sale of loans available for sale (included in other income), as compared to the same prior year period.\nFor the quarter ended December 31, 2017, other income decreased $614,000, as compared to the prior linked quarter. The decrease was primarily due to an increase in the net loss from other real estate operations of $1.1 million including $500,000 related to a write-down attributable to the operations of a hotel, golf and banquet facility. The Bank is currently engaged in a sales process with qualified buyers for this property. The decrease in other real estate operations was partially offset by the rental income of $460,000.\nOperating expenses decreased to $27.7 million for the quarter ended December 31, 2017, as compared to $32.5 million in the same prior year period. Operating expenses for the quarter ended December 31, 2017 include $1.3 million in merger related and branch consolidation expenses, as compared to $6.6 million in the prior year period. Excluding the impact of merger and branch consolidation expenses, operating expenses increased over the prior year period, primarily due to increases in compensation and employee benefits expense, occupancy expense and equipment expense.\nOperating expenses increased to $126.5 million, for the year ended December 31, 2017, as compared to $102.9 million, in the same prior year period. Operating expenses for the year ended December 31, 2017 included $14.5 million in merger related and branch consolidation expenses, as compared to $16.5 million in the prior year period. Excluding the impact of merger and branch consolidation expenses, the increase in operating expenses over the prior year was primarily due to the Acquisition Transactions, which added $16.0 million for the year ended December 31, 2017. Excluding the Acquisition Transactions, the increase in operating expense was primarily due to increases in compensation and employee benefits expense, equipment expense, marketing expense, data processing expense and professional fees.\nFor the quarter ended December 31, 2017, operating expenses, excluding merger and branch consolidation expenses, decreased $1.1 million, as compared to the prior linked quarter. The decrease was primarily due to lower compensation and employee benefits expense, marketing expense and data processing expense, partially offset by the increase in occupancy and equipment expense due to the purchase of the new corporate headquarters on November 1, 2017.\nThe provision for income taxes was $10.2 million and $22.9 million, respectively, for the quarter and year ended December 31, 2017, as compared to $3.0 million and $12.2 million, respectively, for the same prior year periods. The effective tax rate was 50.6% and 35.0%, respectively, for the quarter and year ended December 31, 2017, as compared to 33.0% and 34.5%, respectively, for the same prior year periods and 30.8% in the prior linked quarter. During the fourth quarter of 2017, Tax Reform was enacted which reduced the statutory tax rate for corporations from 35% to 21% effective in 2018. Excluding non-deductible merger related expenses, the Company anticipates its effective tax rate to be approximately 19% in 2018. Authoritative accounting guidance required the Company to revalue its deferred tax assets and liabilities at December 31, 2017, resulting in additional income tax expense of $3.6 million, which increased the effective tax rate by 18.1% and 5.6%, respectively, for the quarter and year ended December 31, 2017. Effective January 1, 2017, the Company adopted ASU 2016-09 “Compensation - Stock Compensation,” which decreased income tax expense by $125,000 and $1.8 million, for the quarter and year ended December 31, 2017, respectively, as compared to the prior year periods. Under the ASU, the tax benefits of exercised stock options and vested stock awards are recognized as a benefit to income tax expense in the reporting period in which they occur. The tax benefit relating to the Company’s stock plans was $62,000 for the year ended December 31, 2016, which was recorded directly into stockholders equity. The elevated tax benefit for the quarter and year ended December 31, 2017, was related to the exercise of options assumed in the Acquisition Transactions and the increase in the Company’s stock price. Excluding the impact of Tax Reform and ASU 2016-09, the effective tax rate was 33.1% and 32.2%, respectively, for the quarter and year ended December 31, 2017. The lower effective tax rate for the year ended December 31, 2017, as compared to the same prior year period, was primarily due to the deductibility of merger related expenses and an increase in tax exempt income.\nFinancial Condition\nTotal assets increased by $249.1 million to $5.416 billion at December 31, 2017, from $5.167 billion at December 31, 2016. Cash and due from banks decreased by $191.8 million, to $109.6 million at December 31, 2017, from $301.4 million at December 31, 2016, as these funds were deployed into higher-yielding securities and to fund loan growth. Loans receivable, net, increased by $162.3 million, to $3.966 billion at December 31, 2017, from $3.803 billion at December 31, 2016. Premises and equipment, net, increased by $30.4 million at December 31, 2017, as compared to December 31, 2016, due to the acquisition of an office building in Red Bank, New Jersey for $42.5 million, partially offset by the consolidation of 15 branches during the year ended December 31, 2017. The premises and equipment at these locations were written down to their net realizable value and the remaining balance was reclassified to assets held for sale. Deferred tax assets decreased by $37.0 million to $1.9 million at December 31, 2017, from $38.9 million at December 31, 2016, and other assets increased by $31.9 million to $41.9 million at December 31, 2017, from $10.0 million at December 31, 2016. In response to Tax Reform, the Company implemented certain tax strategies prior to year end which reduced the deferred tax asset and increased income taxes receivable.\nDeposits increased by $155.0 million, to $4.343 billion at December 31, 2017, from $4.188 billion at December 31, 2016. The loan-to-deposit ratio at December 31, 2017 was 91.3%, as compared to 90.8% at December 31, 2016. Deposits per branch averaged $94.4 million at December 31, 2017, as compared to $68.7 million at December 31, 2016.\nStockholders’ equity increased to $601.9 million at December 31, 2017, as compared to $571.9 million at December 31, 2016. At December 31, 2017, there were 1.8 million shares available for repurchase under the Company’s stock repurchase programs. During the year ended December 31, 2017, the Company did not repurchase any shares under these repurchase programs. Tangible stockholders’ equity per common share increased to $13.58 at December 31, 2017, as compared to $12.94 at December 31, 2016.\nAsset Quality\nThe Company’s non-performing loans increased to $20.9 million at December 31, 2017, as compared to $13.6 million at December 31, 2016. The increase was primarily due to the addition of three commercial loan relationships totaling $12.6 million, including one large relationship in the fourth quarter of 2017. Although this loan was performing prior to the fourth quarter of 2017, the Bank has included this loan relationship in classified assets since 2011. An increase in non-performing residential mortgage loans in the first quarter of 2017 was offset by bulk sales of non-performing residential loans in the second, third and fourth quarters of 2017, totaling $8.5 million. Non-performing loans do not include $1.7 million of purchased credit-impaired (“PCI”) loans acquired in the Acquisition Transactions. The Company’s other real estate owned totaled $8.2 million at December 31, 2017, as compared to $9.8 million at December 31, 2016. At both December 31, 2017 and December 31, 2016, the Company’s allowance for loan losses was 0.40% of total loans. These ratios exclude existing fair value credit marks of $17.5 million and $26.0 million at December 31, 2017 and December 31, 2016, respectively, on the Ocean Shore, Cape and Colonial American Bank loans. These loans were acquired at fair value with no related allowance for loan losses. The allowance for loan losses as a percent of total non-performing loans was 75.35% at December 31, 2017 as compared to 111.92% at December 31, 2016. The decrease was due to the addition of one large loan relationship in the fourth quarter of 2017 with no related loss allocation included in the allowance for loan losses.\nExplanation of Non-GAAP Financial Measures\nReported amounts are presented in accordance with generally accepted accounting principles in the United States (“GAAP”). The Company’s management believes that the supplemental non-GAAP information, which consists of reported net income excluding merger related expenses, branch consolidation expenses, additional income tax expense related to the recently enacted Tax Reform and accelerated stock award expense relating to a director retirement, which can vary from period to period, provides a better comparison of period to period operating performance. Additionally, the Company believes this information is utilized by regulators and market analysts to evaluate a company’s financial condition and therefore, such information is useful to investors. These disclosures should not be viewed as a substitute for financial results in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures which may be presented by other companies. Please refer to Non-GAAP Reconciliation table at the end of this document for details on the earnings impact of these items.\nImmaterial Correction of an Error\nDuring the fourth quarter of 2017, management identified an immaterial correction of an error related to the classification of certain equity securities with no stated maturities that were acquired in a previous business combination that were inappropriately classified as held to maturity in the 2016 consolidated financial statements. In order to correct this immaterial error, management has revised the 2016 consolidated financial statements and footnotes to report these securities as available for sale.\nAnnual Meeting\nThe Company also announced today that its Annual Meeting of Stockholders will be held on Thursday, May 31, 2018 at 6:00 p.m. Eastern time, at the OceanFirst Bank Administrative Offices located at 110 West Front Street, Red Bank, New Jersey. The record date for stockholders to vote at the Annual Meeting is April 10, 2018.\nConference Call\nAs previously announced, the Company will host an earnings conference call on Friday, January 26, 2018 at 11 a.m. Eastern time. The direct dial number for the call is (888) 338-7143. For those unable to participate in the conference call, a replay will be available. To access the replay, dial (877) 344-7529, Replay Conference Number 10115166 from one hour after the end of the call until April 26, 2018. The conference call, as well as the replay, are also available (listen-only) by Internet webcast at www.oceanfirst.com in the Investor Relations section.\nOceanFirst Financial Corp.’s subsidiary, OceanFirst Bank, founded in 1902, is a $5.4 billion community bank with branches located throughout central and southern New Jersey. OceanFirst Bank delivers commercial and residential financing solutions, wealth management and deposit services and is one of the largest and oldest community-based financial institutions headquartered in New Jersey.\nOceanFirst Financial Corp.’s press releases are available by visiting us at www.oceanfirst.com .\nForward-Looking Statements\nIn addition to historical information, this news release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 which are based on certain assumptions and describe future plans, strategies and expectations of the Company. These forward-looking statements are generally identified by use of the words “believe,” “expect,” “intend,” “anticipate,” “estimate,” “project,” “will,” “should,” “may,” “view,” “opportunity,” “potential,” or similar expressions or expressions of confidence. The Company’s ability to predict results or the actual effect of future plans or strategies is inherently uncertain. Factors which could have a material adverse effect on the operations of the Company and its subsidiaries include, but are not limited to: changes in interest rates, general economic conditions, levels of unemployment in the Bank’s lending area, real estate market values in the Bank’s lending area, future natural disasters and increases to flood insurance premiums, the level of prepayments on loans and mortgage-backed securities, legislative/regulatory changes, monetary and fiscal policies of the U.S. Government including policies of the U.S. Treasury and the Board of Governors of the Federal Reserve System, the quality or composition of the loan or investment portfolios, demand for loan products, deposit flows, competition, demand for financial services in the Company’s market area, accounting principles and guidelines and the Bank’s ability to successfully integrate acquired operations. These risks and uncertainties are further discussed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, under Item 1A - Risk Factors and elsewhere, and subsequent securities filings and should be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements. The Company does not undertake, and specifically disclaims any obligation, to publicly release the result of any revisions which may be made to any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nOceanFirst Financial Corp. CONSOLIDATED STATEMENTS OF FINANCIAL CONDITION (dollars in thousands) December 31, 2017 September 30, 2017 December 31, 2016 (unaudited) (unaudited) Assets Cash and due from banks $ 109,613 $ 255,258 $ 301,373 Securities available-for-sale, at estimated fair value 90,281 75,847 20,775 Securities held-to-maturity, net (estimated fair value of $761,660 at December 31, 2017, $737,783 at September 30, 2017, and $589,568 at December 31, 2016) 764,062 733,983 589,912 Federal Home Loan Bank of New York stock, at cost 19,724 18,472 19,313 Loans receivable, net 3,965,773 3,870,109 3,803,443 Loans held-for-sale 241 338 1,551 Interest and dividends receivable 14,254 13,627 11,989 Other real estate owned 8,186 9,334 9,803 Premises and equipment, net 101,776 64,350 71,385 Bank Owned Life Insurance 134,847 134,298 132,172 Deferred tax asset 1,922 29,795 38,880 Assets held for sale 4,046 5,241 360 Other assets 41,895 15,634 9,973 Core deposit intangible 8,885 9,380 10,924 Goodwill 150,501 148,134 145,064 Total assets $ 5,416,006 $ 5,383,800 $ 5,166,917 Liabilities and Stockholders’ Equity Deposits $ 4,342,798 $ 4,350,259 $ 4,187,750 Securities sold under agreements to repurchase with retail customers 79,668 75,326 69,935 Federal Home Loan Bank advances 288,691 259,186 250,498 Other borrowings 56,519 56,466 56,559 Advances by borrowers for taxes and insurance 11,156 14,371 14,030 Other liabilities 35,233 32,052 16,242 Total liabilities 4,814,065 4,787,660 4,595,014 Total stockholders’ equity 601,941 596,140 571,903 Total liabilities and stockholders’ equity $ 5,416,006 $ 5,383,800 $ 5,166,917\nOceanFirst Financial Corp . CONSOLIDATED STATEMENTS OF INCOME (dollars in thousands, except per share amounts) For the Three Months Ended, For the Year Ended December 31, September 30, December 31, December 31, 2017 2017 2016 2017 2016 | (unaudited)", "external_links": ["https://www.globenewswire.com/Tracker?data=pl-J82LxivmR-PbFcqM44Fkiqm8xhOkidyjchrEta0dk8P99ovELfLhu-F5RNv_IAGhuQ_WND47ljvfdp_2X9AfUKKNwl7oynJ3GdMA-6RI=", "https://www.globenewswire.com/Tracker?data=pl-J82LxivmR-PbFcqM44DAHmoAWWWcjP5pLjSAJyc8DMhshCDBCcB-9c7nXqmz7scr42wln0OPPF2v1FJ2hOgeBtxUC8H-wWwkl1vLAUAo="], "published": "2018-01-26T00:30:00.000+02:00", "crawled": "2018-01-26T01:39:49.009+02:00", "highlightTitle": ""}