{"organizations": [], "uuid": "a9946eccded6d9ccf0ad2493644d5302dd25b264", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-american-energy-revises-loi-and-provides-guidance-on-proposed-acquisition.html", "country": "US", "domain_rank": 767, "title": "American Energy Revises LOI and Provides Guidance on Proposed Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "a9946eccded6d9ccf0ad2493644d5302dd25b264"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-american-energy-revises-loi-and-provides-guidance-on-proposed-acquisition.html", "ord_in_thread": 0, "title": "American Energy Revises LOI and Provides Guidance on Proposed Acquisition", "locations": [], "entities": {"persons": [{"name": "brad domitrovitsch", "sentiment": "none"}], "locations": [{"name": "allentown", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "american energy revises loi", "sentiment": "negative"}, {"name": "american energy partners, inc.", "sentiment": "neutral"}, {"name": "american energy", "sentiment": "none"}, {"name": "service company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALLENTOWN, Pennsylvania, January 23, 2018 /PRNewswire/ --\nAmerican Energy Partners, Inc. (OTC: AEPT) (the \"Company\", \"American Energy\" or \"AEPT\"), a diversified energy company, today announces that it has agreed to proceed directly to a 45-day due diligence period with the growing industrial painting, pressure testing and roustabout company that it had previously entered into a letter of intent with at the end of 2017.\nThe letter of intent has been revised as of January 17 th and remains in full force and effect. American Energy anticipates the acquisition to be completed by March 30, 2018 and includes the purchase of real estate, subject to satisfactory due diligence findings.\nThe Company presently expects to close this transaction subject to the satisfaction or waiver of customary closing conditions. The transaction is not subject to any financing condition.\n\"We are actively engaged with the Service Company and remain dedicated to American Energy's proposed acquisition of them,\" said Mr. Brad Domitrovitsch, Chairman & CEO of American Energy. \"We continue to work diligently and cooperatively with the Service Company to close the transaction as soon as possible. We are fully committed to the acquisition and are working closely with the Service Company to complete this transaction.\nAmerican Energy Partners , Inc. ( AEPT )\nAEPT and its group of companies focus on providing solutions in markets where energy production and water meet technology. Collectively, the subsidiaries are engaged in the energy sector as well as the design, construction and operation of regional water treatment facilities that serve the industrial, energy and government sectors.\nFor additional information, visit: American Energy Partners, Inc.\nSafe Harbor\nThis press release contains forward-looking statements, particularly as related to, among other things, the business plans of AEPT, statements relating to goals, plans and projections regarding AEPT's financial position and business strategy. The words or phrases \"would be,\" \"will allow,\" \"intends to,\" \"may result,\" \"are expected to,\" \"will continue,\" \"anticipates,\" \"expects,\" \"estimate,\" \"project,\" \"indicate,\" \"could,\" \"potentially,\" \"should,\" \"believe,\" \"think\", \"considers\" or similar expressions are intended to identify \"forward-looking statements.\" These forward-looking statements fall within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Act of 1934 and are subject to the safe harbor created by these sections. Actual results could differ materially from those projected in the forward-looking statements as a result of a number of risks and uncertainties. Such forward-looking statements are based on current expectations, involve known and unknown risks, a reliance on third parties for information, transactions or orders that may be cancelled, and other factors that may cause our actual results, performance or achievements, or developments in our industry, to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking statements. Factors that could cause actual results to differ materially from anticipated results include risks and uncertainties related to the fluctuation of global economic conditions, the performance of management and our employees, our ability to obtain financing, competition, general economic conditions and other factors that are detailed in our periodic reports and on documents we file from time to time with the Securities and Exchange Commission. Statements made herein are as of the date of this press release and should not be relied upon as of any subsequent date. AEPT cautions readers not to place undue reliance on such statements. AEPT does not undertake, and AEPT specifically disclaims any obligation, to update any forward-looking statements to reflect occurrences, developments, unanticipated events or circumstances after the date of such statement. Actual results may differ materially from AEPT's expectations and estimates.\nCompany Contact:\ncontact@americanenergy-inc.com\n+1-610-217-3275\nSOURCE American Energy Partners, Inc.", "external_links": ["http://americanenergy-inc.com/"], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T17:34:39.006+02:00", "highlightTitle": ""}