{"organizations": [], "uuid": "7775b57de2ea45a3d81d19722b81b6f180fc9e82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-terraform-global-commences-change-of-control-tender-offer-for-its-outstanding-senior-notes-due-2022.html", "country": "US", "domain_rank": 767, "title": "TerraForm Global Commences Change of Control Tender Offer for Its Outstanding Senior Notes Due 2022", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T23:13:00.000+02:00", "replies_count": 0, "uuid": "7775b57de2ea45a3d81d19722b81b6f180fc9e82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-terraform-global-commences-change-of-control-tender-offer-for-its-outstanding-senior-notes-due-2022.html", "ord_in_thread": 0, "title": "TerraForm Global Commences Change of Control Tender Offer for Its Outstanding Senior Notes Due 2022", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "global, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 26, 2018 (GLOBE NEWSWIRE) -- TerraForm Global, Inc., a Delaware corporation, announced today that its wholly-owned subsidiary, TerraForm Global Operating, LLC (the “Issuer”) has commenced a cash tender offer (the “Offer”) for any and all of its outstanding U.S. dollar denominated 9.75% Senior Notes due 2022 (CUSIP Nos./ISINs 88104UAA1/US88104UAA16 and U8812UAA9/USU8812UAA98) (the “Notes”), upon the terms and subject to the conditions set forth in the Offer to Purchase, dated January 26, 2018 (as it may be amended or supplemented from time to time, the “Statement”), and in the related Letter of Transmittal (as it may be amended or supplemented from time to time, the “Letter of Transmittal” and, collectively with the Statement, the “Offer Documents”).\nThe Offer will expire at 11:59 p.m., New York City time, on February 26, 2018 (such time and date, as it may be extended, the “Expiration Time”), in each case, unless earlier terminated by the Issuer. Notes validly tendered may be validly withdrawn at any time at or before the Expiration Time, but not thereafter.\nThe Offer is being made pursuant to the indenture dated as of August 5, 2015 (the “Indenture”) among the Issuer, the guarantors party thereto and U.S. Bank National Association, as trustee, under which the Notes were issued. The Indenture and the Notes provide that the Issuer must make an offer to repurchase Notes from holders in connection with the occurrence of a “Change of Control” (as defined in the Indenture). Upon completion of TerraForm Global, Inc.’s previously announced merger with an affiliate of Brookfield Asset Management Inc., a Change of Control occurred with respect to the Issuer. Accordingly, the Issuer is offering to purchase any and all of the Notes at a purchase price of 101% of the principal amount thereof, plus accrued and unpaid interest, if any, on the Notes repurchased to the Payment Date (as defined below), subject to the rights of Holders on the relevant record date to receive interest due on the relevant interest payment date.\nThe table below summarizes certain payment terms of the Offer:\nCUSIP Nos. /ISINs Outstanding\nPrincipal Amount\nof Notes Description of\nNotes Tender Offer\nConsideration* CUSIP: 88104UAA1, U8812UAA9\nISIN: US88104UAA16, USU8812UAA98 $521,424,000 9.75% Senior\nNotes due 2022 $1,010 * Per $1,000 principal amount of Notes.\nSubject to the terms and conditions of the Offer, the Issuer will, promptly after the Expiration Time, and not earlier than 30 days after the date of the Offer to Purchase, accept for purchase all Notes validly tendered and not validly withdrawn at or before the Expiration Time. The Issuer will pay the Tender Offer Consideration for Notes accepted for purchase promptly following the acceptance of such Notes for purchase (the date of such payment being referred to as the “Payment Date”).\nThis news release is for informational purposes only and does not constitute an offer to buy or the solicitation of an offer to sell the Notes. The Offer is being made only pursuant to the Offer Documents that the Issuer will be distributing to holders promptly. Holders and investors should read carefully the Offer Documents because they contain important information, including the various terms of and condition to the Offer. None of the Issuer, the tender agent, the information agent or their respective affiliates is making any recommendation as to whether or not holders should tender all or any portion of their Notes in the Offer.\nCautionary Statement on Forward-Looking Statements\nThis communication contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. These statements involve estimates, expectations, projections, goals, assumptions, known and unknown risks, and uncertainties and typically include words or variations of words such as “expect,” “anticipate,” “believe,” “intend,” “plan,” “seek,” “estimate,” “predict,” “project,” “goal,” “guidance,” “outlook,” “objective,” “forecast,” “target,” “potential,” “continue,” “would,” “will,” “should,” “could,” or “may” or other comparable terms and phrases.\nInformation Agent\nD.F. King & Co., Inc.\n(877) 297-1744 (toll-free)\n(212) 269-5550 (collect)\nEmail: terraform@dfking.com\nSource:TerraForm Global, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f69d8916-ce57-45ee-b59b-d7a2faa01e92"], "published": "2018-01-26T23:13:00.000+02:00", "crawled": "2018-01-26T23:35:07.024+02:00", "highlightTitle": ""}