{"organizations": [], "uuid": "02c03ef80507951b3f45f43602dc9c3e6a790d8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/24/104728415-RTS1DKDN-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/europe-markets-stocks-set-for-mixed-open-german-talks-move-forward.html", "country": "US", "domain_rank": 767, "title": "Europe markets: Stocks set for mixed open as German talks move forward", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-22T08:18:00.000+02:00", "replies_count": 0, "uuid": "02c03ef80507951b3f45f43602dc9c3e6a790d8d"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/22/europe-markets-stocks-set-for-mixed-open-german-talks-move-forward.html", "ord_in_thread": 0, "title": "Europe markets: Stocks set for mixed open as German talks move forward", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "mario centeno", "sentiment": "none"}, {"name": "christine lagarde", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ibex", "sentiment": "negative"}, {"name": "ac", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European shares closed mostly in the black by the end of Monday's trade, as investors tried to shake off concerns surrounding the government shutdown in the U.S.\nThe pan-European Stoxx 600 finished trade up 0.31 percent provisionally, while sectors pointed in different directions by the close.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- Looking to European markets, the majority of indexes finished higher, with France's CAC 40 up 0.28 percent and Germany's DAX up 0.22 percent. The U.K.'s FTSE 100 , however, ended trade down 0.2 percent, as individual stock news weighed.\nMarkets were lifted somewhat by Europe's close, as Wall Street shrugged off the first U.S. government shutdown since 2013. U.S. markets were mostly higher at Europe's close.\nUK in focus: Ocado pops 27.5%, as William Hill tanks 11.6% On the sector front, travel and leisure stocks led the losses Monday, finishing down 0.75 percent provisionally, amid reports of a fixed-odds betting limit in Britain. London-listed gambling companies such as William Hill and Ladbrokes Coral slumped to the bottom of the benchmark.\nThe stake on gambling machines in British betting shops could be cut to £2 ($2.78) in an effort to tackle the risks associated with problem gamblers, The Sunday Times reported, citing an ally of Culture Secretary Matt Hancock. Shares of Ladbrokes Coral fell 7.9 percent, while William Hill tumbled 11.63 percent.\nOn the opposite end, telecoms and banks both closed above 1 percent each as a sector. Deutsche Telekom and Orange both finished more than 2 percent higher, after a report by France's Le Monde said that the two telecom companies had held merger discussions during the course of 2017, Reuters reported.\nLooking to Europe's banks, Barclays rose 4.33 percent after the Financial Times reported over the weekend that hedge fund Tiger Global Management had invested over $1 billion in the U.K. lender.\nshow chapters UK set to remain an underperforming economy, strategist says 10 Hours Ago | 03:48 On the earnings front, UBS reversed losses by the close, ending slightly higher. On Monday, the Swiss bank reported a net profit of 1.165 billion Swiss francs ($1.25 billion) for the whole of 2017, weighed down by a write-down in the fourth quarter which related to the new U.S. tax overhaul.\nMeanwhile, online grocer Ocado said it had signed an agreement with Sobeys to develop an online business at Canada's second-largest food retailer. The British firm was the STOXX 600's top performer, skyrocketing 27.5 percent by the close.\nElsewhere, pharmaceutical firm Sanofi announced that it would be acquiring U.S. hemophilia specialist Bioverativ for $11.6 billion, with Sanofi saying it would help push the company's presence in the rare diseases and specialty care space. Shares of the French drug-maker however fell almost 3 percent.\nGovernment shutdown In Germany, progress has been made toward forming the next coalition government. On Sunday, Chancellor Angela Merkel welcomed news that the opposing Social Democratic Party will enter into talks with her Christian Democrats.\nStateside, the U.S. government looks set to remain closed during Monday, the third day of a shutdown over a disputed spending bill. Democrats are demanding for legislation to protect so-called \"Dreamers,\" people brought illegally into the U.S. as children. A Senate vote is set for 12 p.m. ET on measures that would provide temporary funding through to February 8, thereby allowing thousands of government employees to get back to work.\nOil stocks in Europe finished higher, on the back of a rise in oil prices. Crude futures rose following comments from Saudi Arabia that producers would continue to cooperate over cuts after 2018.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-22T08:18:00.000+02:00", "crawled": "2018-01-22T08:18:31.010+02:00", "highlightTitle": ""}