{"organizations": [], "uuid": "64e50796ac09b1877e322ee1649e220cfe635dd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-equinox-gold-announces-full-scale-construction-of-the-aurizona-gold-mine.html", "country": "US", "domain_rank": 767, "title": "Equinox Gold Announces Full-Scale Construction of the Aurizona Gold Mine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-08T14:57:00.000+02:00", "replies_count": 0, "uuid": "64e50796ac09b1877e322ee1649e220cfe635dd3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-equinox-gold-announces-full-scale-construction-of-the-aurizona-gold-mine.html", "ord_in_thread": 0, "title": "Equinox Gold Announces Full-Scale Construction of the Aurizona Gold Mine", "locations": [], "entities": {"persons": [{"name": "date mills", "sentiment": "none"}, {"name": "deta", "sentiment": "none"}], "locations": [{"name": "aurizona gold mine vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "aurizona", "sentiment": "none"}], "organizations": [{"name": "equinox gold", "sentiment": "negative"}, {"name": "equinox gold corp.", "sentiment": "negative"}, {"name": "aurizona gold mine", "sentiment": "none"}, {"name": "company’s board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Equinox Gold Corp. (TSX-V:EQX) (OTC:LWLCF) (“Equinox Gold” or the “Company”) is pleased to announce that the Company’s Board of Directors has approved the start of full-scale construction at the Aurizona Gold Mine (“Aurizona”) in Brazil. All dollar amounts shown are in United States dollars.\nEarly works construction has been underway at Aurizona since the third quarter of 2017. The project is advancing well and remains on track to pour gold by late 2018. Activities to date have focused on detailed engineering work, raising the existing tailings facility, refurbishment of existing plant infrastructure, civil earthworks and pouring foundations to prepare for installation of new plant infrastructure, installation of new administrative buildings and ordering long-lead items.\nEquinox Gold’s new website at www.equinoxgold.com includes a photo gallery that documents construction progress with periodic photo and video updates.\nConstruction Milestones Achieved to Date\nMills ordered with delivery expected in the second quarter Detailed engineering underway in Belo Horizonte, Brazil Civil works (concrete) contract awarded Owner’s team in place Significant refurbishment completed on existing plant infrastructure Electrical substation upgrades commenced with parts ordered and a contractor selected Completion of the first tailings storage facility raise nearly complete Mill foundations underway Completion of the thickener underway\n“With expansion permits, full construction funding and the new Equinox Gold Board of Directors in place, we have received approval for full-scale construction at the Aurizona Gold Mine in Brazil,” said Christian Milau, CEO of Equinox Gold. “This will be a milestone year for Equinox Gold as we advance Aurizona and transition the company from a developer to a meaningful producer, with more than 135,000 ounces of annual gold production expected from Aurizona.”\n“The Aurizona project has been significantly advanced and de-risked over the past few months with early works construction and critical path activities,” said David Laing, COO of Equinox Gold. “The tailings dam raise is nearly complete, the mills are ordered and significant civil earthworks has been completed in preparation for installation of the mills and other new plant infrastructure. We look forward to reporting on construction milestones as we advance toward our target of pouring gold in late 2018.”\nEquinox Gold’s Board of Directors has approved a total project budget of $146 million for full-scale construction, which includes all working capital and a 12% contingency. Approximately $25 million of this budget was spent in 2017 during early works activities and the project remains on schedule and on budget. Aurizona construction is fully funded with Equinox Gold’s existing treasury and an $85 million secured project credit facility, from which the Company has drawn $15 million to date.\nTailings Facility Raise\nThe existing tailings facility is being raised to support expanded throughput to 8,000 tonnes per day (“tpd”). The raise is being executed by the Engeterra-Nazaré consortium under the supervision of the structure designers BVP Engenharia. The tailings facility capacity will be expanded in three lifts, with the first expansion scheduled for completion in January 2018 and two additional lifts to be completed approximately every two years thereafter.\nProcess Plant Equipment Procurement and Refurbishment\nAurizona is a brownfields project endowed with considerable existing infrastructure including access roads, a dedicated and reliable powerline, significant process plant equipment, offices, warehouses, laboratories, communications and a camp.\nThe plant design is based on a process plant capable of treating 8,000 tpd of ore through a combination of conventional gravity concentration and cyanide leach/CIP (carbon in pulp) processes. The design includes a new comminution circuit which comprises a primary jaw crusher, SAG (semi-autogenous grinding) mill, ball mill and pebble crusher. The jaw crusher and the mills have been ordered and delivery of the mills to site is expected during the second quarter.\nRepairing, refurbishing and improving the existing process plant equipment resulted in cost efficiencies and a reduced construction timeline. There is also a large inventory of equipment on site that was either never commissioned or installed. Completing the installation and upgrades to existing equipment includes cyclones, the intensive leach reactor, three leach tanks, the high-rate thickener, and a new 12.5 MW (megawatt) main transformer as well as a new pressurized elution circuit and commissioning the carbon regeneration kiln. Refurbishing includes the CIP circuits, and additional improvements to the existing process plant includes upgrades to the cyanide destruction and tailings deposition system, gravity recovery circuit, electrical supply and distribution system, and instrumentation and controls.\nDetailed Engineering Activities\nThe project EPCM (engineering, procurement and construction management) work was awarded to Ausenco Engineering Canada Inc. (“Ausenco”) a diversified engineering, construction and project management company with extensive experience in the “fit-for-purpose” design and cost-effective construction of gold plants and mining projects globally, including a number of recent projects in Brazil. Basic engineering has been substantially completed in Ausenco’s Vancouver office and detailed engineering work is being completed in Ausenco’s Belo Horizonte office.\nPowerline\nAurizona has a dedicated and reliable powerline that connects to the Brazil electrical grid via the Maranhão power distribution utility, which provides access to low-cost power. Upgrades to two substations are required to support the increased power draw for the 8,000 tpd expansion. The substations are located at Manaus do Maranhão (46 km from Aurizona) and at the Aurizona plant site.\nEquinox Gold Contacts\nChristian Milau, CEO\nRhylin Bailie, Vice President Investor Relations\nTel: +1 604-558-0560\nEmail: ir@equinoxgold.com\nAbout Equinox Gold\nEquinox Gold is a Canadian mining company with a multi-million-ounce gold resource base, near-term and growing gold production from two past-producing mines in Brazil and California, and a long-term growth platform with a diverse portfolio of gold and copper assets in North and South America. Early works construction is underway at the Company’s Aurizona project in Brazil with the objective of pouring gold by year-end 2018, and a prefeasibility study is underway at the Company’s Castle Mountain project in California with the objective of restarting production. Further information about Equinox Gold’s current portfolio of assets and long-term growth strategy is available at www.equinoxgold.com or by email at ir@equinoxgold.com .\nCautionary Notes and Forward-Looking Statements\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as such term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nThis document contains certain forward-looking information and forward-looking statements within the meaning of applicable securities legislation (coll", "external_links": ["http://www.bmcms1.com/staging/equinoxgold.com/projects/aurizona-gold-mine/gallery/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9bc97c7f-1627-4f7a-b120-cdda412fadcb"], "published": "2018-01-08T14:57:00.000+02:00", "crawled": "2018-01-08T15:33:13.035+02:00", "highlightTitle": ""}