{"organizations": [], "uuid": "823c3b9eeebfb16c3abe383ac59e4f1926f8dcfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/06/gettyimages-539297982.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/elton-john-farewell-tour-tickets/", "country": "US", "domain_rank": 1196, "title": "Elton John Farewell Tour: How to Get Tickets | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-25T12:43:00.000+02:00", "replies_count": 0, "uuid": "823c3b9eeebfb16c3abe383ac59e4f1926f8dcfc"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/25/elton-john-farewell-tour-tickets/", "ord_in_thread": 0, "title": "Elton John Farewell Tour: How to Get Tickets | Fortune", "locations": [], "entities": {"persons": [{"name": "elton john farewell tour", "sentiment": "negative"}, {"name": "chris morris", "sentiment": "negative"}, {"name": "elton john", "sentiment": "none"}], "locations": [{"name": "brick road", "sentiment": "none"}], "organizations": [{"name": "american express", "sentiment": "none"}, {"name": "ticketmaster", "sentiment": "none"}, {"name": "rocket club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 10:43 AM EST \nThe Rocket Man is blasting off for the last time—and demand for seats is likely going to be out of this world. \nElton John announced plans to retire Wednesday, with his final tour, called Farewell Yellow Brick Road , kicking off in September. The good news for fans is it’s a long one—with over 300 dates scheduled over several years. \nThat gives fans plenty of opportunities to see the performer, but there are a few steps to take if you want a good seat, rather than sitting in the nosebleeds. Join the Elton John fan club \nMembers of Elton John’s official fan club— Rocket Club —always have a first shot at tickets. For early dates in the tour, they can buy seats more than a week before the general public gets a chance. Get an American Express card \nPeople who have an American Express credit card also have access to a pre-sale period for tickets. Generally, that begins at the same time as the Rocket Club pre-sale. Join Ticketmaster’s Verified Fan program \nAfter the Rocket Club and American Express holders get their shot, Ticketmaster ’s own program members are given an opportunity. (The first tickets for the tour are on pre-sale now for members of this program.) The general public draws the short straw. The first round of tickets, for example, aren’t available to them until Feb. 2. The Verified Fan program is meant to combat scalpers, but it hasn’t been entirely successful, judging by its launch with Bruce Springsteen’s Broadway run . \nOther artists, like Taylor Swift, have gamed the system to boost merchandise sales. The Caesar’s alternative \nThe “Farewell Yellow Brick Road” tour is the official final tour, but it won’t be the only shows John plays before calling it quits. He’s still a featured performer at Caesar’s Palace in Las Vegas—and will play his next set of shows beginning February 9. Tickets for the set are already in high demand, though, so you’ll want to act soon. Tickets sold through the venue range in price from $55-$750, depending on date and seat location. \nFor now, John is slated to play Vegas through May 19. There’s no word if he’ll continue to perform at the venue beyond that as part of his farewell tour. Scalpers \nFor now, your odds of getting a ticket through typical channels aren’t terrible, but as the tour nears its end, you’re going to find it a lot harder to do so. Ticket reselling services will, as always, be an option. But if you’re planning on attending one of the final shows, we suggest you start putting money aside now. Tickets are likely to go for several thousand dollars at that point. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T12:43:00.000+02:00", "crawled": "2018-01-25T20:30:25.012+02:00", "highlightTitle": ""}