{"organizations": [], "uuid": "140c66eda3df4fac1919753b18d6d39c67dbf5f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-cancer-hormones/hot-flashes-caused-by-cancer-therapy-can-be-prevented-treated-idUKKBN1EX1KR", "country": "US", "domain_rank": 408, "title": "Hot flashes caused by cancer therapy can be prevented, treated", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:09:00.000+02:00", "replies_count": 0, "uuid": "140c66eda3df4fac1919753b18d6d39c67dbf5f7"}, "author": "", "url": "https://uk.reuters.com/article/us-health-cancer-hormones/hot-flashes-caused-by-cancer-therapy-can-be-prevented-treated-idUKKBN1EX1KR", "ord_in_thread": 0, "title": "Hot flashes caused by cancer therapy can be prevented, treated", "locations": [], "entities": {"persons": [{"name": "carol", "sentiment": "negative"}, {"name": "gupta", "sentiment": "none"}, {"name": "arjun gupta", "sentiment": "none"}, {"name": "crist", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "university of texas southwestern medical center", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:09 PM / Updated an hour ago Hot flashes caused by cancer therapy can be prevented, treated Carolyn Crist 4 Min Read \n(Reuters Health) - Cancer patients with hot flashes related to hormone therapy should know that these uncomfortable symptoms can be managed, according to a recently published resource for patients. \n“The goal of any therapy is to help patients feel better, and we don’t want them to needlessly suffer and think there are no treatments available,” said Dr. Arjun Gupta of the University of Texas Southwestern Medical Center in Dallas, the author of a one-page patient-information sheet available for free online in JAMA Oncology. \nHot flashes are unpleasant episodes of heat that start in the upper body and spread, causing sweating and anxiety. They can occur infrequently, daily or several times a day. At night, they can cause sleep disturbances. \n“It’s important to let your physician know so we can talk about it and what’s really causing these troubling symptoms,” Gupta said in a phone interview. “They affect quality of life, and we want to help patients if this is really bothering them.” \nSome cancers, particularly some types of breast and prostate cancer, depend on sex hormones for growth. Whereas in menopause, the goal of hormone therapy is to boost hormone levels, the goal of hormone therapy for cancer is to reduce hormone levels. And when levels drop, hot flashes can result. \nFor cancer patients, hot flashes could be related to the cancer itself, infection, hormone therapy or other medications such as steroids, so it’s important to report them to a doctor, Gupta writes. His recommendations are drawn from the American Society of Clinical Oncology’s patient information resource, Cancer.net. \nManagement of hot flashes includes both prevention and treatment. Nonmedication-based techniques are usually tried first. \nGupta recommends documenting the number, intensity and duration of hot flashes, which can help identify triggers to avoid. Taking a hot bath or eating spicy food may spark a hot flash, for example. \nHe also recommends lifestyle changes such as avoiding excessive caffeine and alcohol, and quitting smoking. A cool environment during the day and while sleeping, with cotton clothing and sheets and cool showers, can help. Relaxation activities such as yoga, meditation and breathing exercises may help as well. \nDr. Charles Loprinzi of the Mayo Clinic in Rochester, Minnesota, who has researched cancer symptoms for more than 25 years, told Reuters Health by phone, “One patient told me that in the winter, she’d get in her car, put on her seat belt and then put her coat on backwards so she could easily pull the coat off if she had a hot flash while driving.” \nIn gold-standard trials, Loprinzi’s team has found that for both men and women, hot flashes can be managed with low doses of certain antidepressants, such as venlafaxine, citalopram, clonidine, gabapentin and oxybutynin. \n“In our studies, we’ve found that the treatment of hot flashes in women who have breast cancer is largely unrelated to the fact that they have breast cancer,” Loprinzi told Reuters Health by phone. “The nonhormonal treatments seem to have the same efficacy for everyone.” \nRarely, hot flashes related to cancer treatment may require a change in the dose or discontinuation of hormone therapy, Gupta said. \nAlternative therapies like herbal products, soy and acupuncture haven’t been extensively studied for treating hot flashes in cancer patients. Patients who are interested in these options should talk to their doctor, Gupta advises. \nSOURCE: bit.ly/2ADluJp JAMA Oncology, online December 28, 2017.", "external_links": [], "published": "2018-01-08T17:09:00.000+02:00", "crawled": "2018-01-08T17:34:29.018+02:00", "highlightTitle": ""}