{"organizations": [], "uuid": "4994f1d3b0ec610c1b425795f12209802dbe9a28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/kering-puma-de-spin-off/kering-to-spin-off-puma-to-its-own-shareholders-idUSL8N1P6569", "country": "US", "domain_rank": 408, "title": "Kering to spin off Puma to its own shareholders", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T01:30:00.000+02:00", "replies_count": 0, "uuid": "4994f1d3b0ec610c1b425795f12209802dbe9a28"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/kering-puma-de-spin-off/kering-to-spin-off-puma-to-its-own-shareholders-idUSL8N1P6569", "ord_in_thread": 0, "title": "Kering to spin off Puma to its own shareholders", "locations": [], "entities": {"persons": [{"name": "arno schuetze", "sentiment": "negative"}, {"name": "pamela barbaglia", "sentiment": "negative"}, {"name": "kering", "sentiment": "none"}, {"name": "pinault", "sentiment": "none"}, {"name": "kerin", "sentiment": "none"}, {"name": "francois-henri pinault", "sentiment": "none"}], "locations": [], "organizations": [{"name": "puma", "sentiment": "negative"}, {"name": "lvmh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Kering confirmation, detail, background, share price)\nBy Arno Schuetze and Pamela Barbaglia\nFRANKFURT/LONDON, Jan 11 (Reuters) - Gucci-owner Kering plans to spin off German sports brand Puma to the French conglomerate’s shareholders as it sharpens the group’s focus squarely on its luxury brands.\nKering said it planned to distribute 70 percent of Puma shares in kind to its investors, leaving it with only a 16 percent stake in the sportwear group, confirming an exclusive Reuters report.\nPuma shares were down 4.4 percent at the close, with Kerin down almost 1 percent.\nKering is a little more than 40 percent controlled by the French Pinault family, who would receive about 29 percent of the sporting goods company, while Puma’s free float would stand at about 55 percent.\nShedding Puma, meanwhile, would turn Kering into a pure player in the high-margin luxury business, where it rivals larger peers such as French conglomerate LVMH.\n“Kering would dedicate itself entirely to the development of its luxury houses,” Kering Chairman and CEO Francois-Henri Pinault said in a statement.\nPuma said it welcomed the transaction because it increases the company’s free float, adding that the move will not affect its current strategy.\nPuma struggled for years after it was bought by Kering for 5.3 billion euros ($6.4 billion) in 2007, but recent improved performance has raised expectations that the French group would sell its stake this year.\nThe sports goods company is due to report full-year results on Feb. 12, having increased its profit outlook three times last year on the popularity of collections designed by singer Rihanna and shoes worn by Jamaican sprinter Usain Bolt.\nLike German rival Adidas, Puma has enjoyed a revival in the United States as shoppers snap up its retro styles instead of basketball shoes, hurting Nike and Under Armour.\nPuma’s shares rose by 45 percent over the past year, bringing its market capitalisation to 5.3 billion euros, back at the level at which Kering bought.\nKering emerged as one of the big winners in a luxury goods revival last year as Chinese demand picked up, with a stellar turn at brand-of-the-moment Gucci helping earnings and other labels such as Yves Saint Laurent and Balenciaga. ($1 = 0.8303 euros) (Additional reporting by Emma Thomasson, Alexander Hübner and Sarah White; Editing by David Goodman)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T01:30:00.000+02:00", "crawled": "2018-01-12T18:50:05.020+02:00", "highlightTitle": ""}