{"organizations": [], "uuid": "8d226726bf60505ed459775dab47938d55cf45ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222179603&w=1200&r=LYNXMPEE0E14T", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-turkey-canal/turkey-reveals-route-for-new-canal-to-ease-bosphorus-shipping-idUSKBN1F422I", "country": "US", "domain_rank": 408, "title": "Turkey reveals route for new canal to ease Bosphorus shipping", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:03:00.000+02:00", "replies_count": 0, "uuid": "8d226726bf60505ed459775dab47938d55cf45ae"}, "author": "", "url": "https://www.reuters.com/article/us-turkey-canal/turkey-reveals-route-for-new-canal-to-ease-bosphorus-shipping-idUSKBN1F422I", "ord_in_thread": 0, "title": "Turkey reveals route for new canal to ease Bosphorus shipping", "locations": [], "entities": {"persons": [{"name": "bospho", "sentiment": "negative"}, {"name": "arslan", "sentiment": "none"}, {"name": "ali kucukgocmen", "sentiment": "none"}, {"name": "ahmet arslan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "bosphorus", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "suez canal", "sentiment": "none"}, {"name": "black sea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "bosphorus strait", "sentiment": "none"}, {"name": "kanal istanbul", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "marmara", "sentiment": "none"}], "organizations": [{"name": "min read  istanbul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - Turkey announced on Monday the route for a planned canal that would reduce shipping traffic on the busy Bosphorus Strait and transform the European half of Istanbul into an island.\nWork on the 45-km (28-mile) Kanal Istanbul, linking the Black Sea and the Sea of Marmara west of the Bosphorus, will begin this year, Transport Minister Ahmet Arslan said, adding it formed part of Turkey’s most expensive construction project.\nThe Bosphorus is one of the world’s busiest waterways with 42,000 vessels passing through in 2016 - compared with 16,800 that transited the Suez Canal in the same year.\nIt is the only maritime outlet to the oceans for Bulgaria, Romania, Ukraine and Georgia, and for Russia’s Black Sea ports.\nWith urban projects on the canal’s banks and logistical centers to be built in the Black Sea, Kanal Istanbul will be Turkey’s most expensive project yet, Arslan said.\nWithout specifying the exact cost, he added that the project would be funded through public and private partnerships.\nThe new canal would not be subject to the Montreux Conventions Regarding the Use of Straits which guarantees free passage to civilian vessels during peacetime, he said, meaning Turkey could charge vessels using it.\nIt will run from the Durusu region on Istanbul’s Black Sea coast to Kucukcekmece Lake on the Sea of Marmara. Documents from Turkey’s Environment Ministry showed the canal will be 25 meters (82 feet) deep and 250-1,000 meters (825-3,300 feet) wide, depending on where the docks are located.\n“CRAZY PROJECT”\nKanal Istanbul will also be located near a number of projects in northern Istanbul spearheaded by President Tayyip Erdogan’s AK Party government, including the third bridge over the Bosphorus, which opened in 2016, and the city’s third airport which is under construction.\nThe soil to be dug out for the canal project will be used for agriculture as well as for artificial islands and ports to be built in the Sea of Marmara, Arslan said.\nThe plan has many critics and Erdogan himself light-heartedly called it a “crazy project” when he first raised it in 2011. Environmentalists say it would pave the way for further development in the city’s north, advancing the destruction of forests there.\nA report evaluating the project’s environmental impact, which is required by the government before construction commences, is currently being compiled, the Environment Ministry said.\nIstanbul’s Chamber of Geology Engineers said the initial filing for the environmental impact report did not take into account several factors that make the project unviable.\nThe project has the potential to severely impact the climate and balance of minerals and nutrients in the Black Sea and surrounding areas, and would deplete oxygen levels in the Sea of Marmara, it said.\nConstruction has been a key driver of the economy under the AK Party. The government’s critics say the legal framework surrounding the construction sector has been repeatedly watered down, creating loopholes that developers can exploit for profit.\nAdditional reporting by Can Sezer; Editing by Dominic Evans/Mark Heinrich\n ", "external_links": [], "published": "2018-01-15T18:03:00.000+02:00", "crawled": "2018-01-15T18:16:46.003+02:00", "highlightTitle": ""}