{"organizations": [], "uuid": "6a7669a407caf233b09b8f6fffef5bffad0e42fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/09/12/101028710-165547518.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/tina-brown-facebook-and-googles-influence-on-media-is-appalling.html", "country": "US", "domain_rank": 767, "title": "Tina Brown: Facebook and Google's influence on media is \"appalling\"", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.1, "site_type": "news", "published": "2018-01-11T19:33:00.000+02:00", "replies_count": 0, "uuid": "6a7669a407caf233b09b8f6fffef5bffad0e42fa"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/11/tina-brown-facebook-and-googles-influence-on-media-is-appalling.html", "ord_in_thread": 0, "title": "Tina Brown: Facebook and Google's influence on media is \"appalling\"", "locations": [], "entities": {"persons": [{"name": "tina brown", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "vanity fair", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES show chapters 5 Hours Ago | 04:35 \nSocial media platforms and search engines like Facebook and Google have had an \"appalling\" influence on the media landscape, said former magazine editor Tina Brown. \nThe media mogul spoke on CNBC's \"Squawk on the Street\" on Thursday and said she is in favor of an \"industry-wide pressure\" for the companies to \"give back something\" and \"fund real journalism.\" \n\"One of the great big scams of digital platforms is that they're able to kind of pretend that they care about the human good, while at the same time taking all the profits and all the revenue from people who are actually doing the work,\" said Brown, who is also the former editor of publications like Vanity Fair, The Daily Beast and The New Yorker. \n\"They use all that great work on their platforms and don't give anything back,\" she said. \"It's been a great scam. I'm glad they made out like bandits, but I think it's time they're viewed in the manner they should be.\" \nSites like Facebook and Google wreaked havoc on the media industry when they abruptly changed the business model by no longer requiring consumers to pay for content. Revenue made through advertising, once the main source of income for newspapers, quickly declined. \nAcross all media, the two companies account for as much as 73 percent of all digital advertising . \nLast fall, Facebook wrote in a blog post that it is working with media outlets like The Washington Post, The Boston Globe and Economist to insert a paywall on Facebook and limit the number of free articles each month. The New York Times and Wall Street Journal already have similar models in place. \n\"They have undermined the whole profession of journalism,\" Brown said on CNBC. Meanwhile, \"real journalist enterprises are struggling to get any advertising,\" she said. Kellie Ell News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-11T19:33:00.000+02:00", "crawled": "2018-01-11T19:43:16.027+02:00", "highlightTitle": ""}