{"organizations": [], "uuid": "5659057f5c144b9eb80e600a1cedcc403eab8111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XA264_3jQKV_TOP_20180116154300.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/cfpb-to-reconsider-obama-era-payday-lending-rule-1516137329", "country": "US", "domain_rank": 387, "title": "CFPB to Reconsider Obama-Era Payday-Lending Rule", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.284, "site_type": "news", "published": "2018-01-17T01:55:00.000+02:00", "replies_count": 0, "uuid": "5659057f5c144b9eb80e600a1cedcc403eab8111"}, "author": "Yuka Hayashi", "url": "https://www.wsj.com/articles/cfpb-to-reconsider-obama-era-payday-lending-rule-1516137329", "ord_in_thread": 0, "title": "CFPB to Reconsider Obama-Era Payday-Lending Rule", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cfpb", "sentiment": "negative"}, {"name": "consumer financial protection bureau", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nPayday lenders may have just been cut some major slack . \nThe Consumer Financial Protection Bureau, under new leadership, is now reconsidering an Obama-era rule designed to keep payday lenders from preying on vulnerable consumers. \nThe rule — implemented under former CFPB director Richard Cordray in November 2017 — set stricter conditions for short-term loan companies, requiring them to assess the creditworthiness of the borrowers and restrict loans that can have interest rates as high as 400% . The rule covers payday loans, auto-title loans and “deposit advance” products, which typically take the repayment amount out of the borrower’s next paycheck. \nPayday lenders often offer loans to low-income borrowers who don’t have a good enough credit rating to use a traditional bank. Although some consumers say the short-term loans allow them to pay bills, others find it nearly impossible to pay back the loans, especially because the loans often have high interest rates. \nThe payday rule became effective Jan. 16. But many of the rule’s provisions don’t require compliance until Aug. 19, 2019. All that could change, however. On Tuesday, the CFPB said it “may reconsider the payday rule.” \nPresident Trump’s administration appointed Mick Mulvaney, the director of the Office of Management and Budget, as acting director of the CFPB in November 2017 . He replaced former CFPB director Richard Cordray , who was appointed by former President Barack Obama to head the watchdog agency and who helped design the rule. \nWhat’s at stake if this payday rule is overturned? \nConsumer advocates say overturning the payday rule could be treacherous for vulnerable consumers. Mulvaney is “sabotaging these important protections that would have guarded against predatory lenders and protected struggling consumers from falling into the cycles of debt with sky-high interest rates,” said Karl Frisch, the executive director of Allied Progress, a left-leaning consumer watchdog organization. \n“There is no reason to delay implementation of this rule — unless you are more concerned with the needs of payday lenders than you are with the interests of the consumers these financial bottom-feeders prey upon.” \nWhy did the CFPB introduce the payday rule? \nThe CFPB had developed the rule after researching payday lending practices for five years. It published a proposed rule in June 2016 , which received more than one million comments online and was then revised to its current format. \nCordray, the former head of the CFPB, said there was good reason to introduce the rule. Almost 70% of payday loan borrowers take out a second loan within a month of their last one, according to CFPB research. There are some 16,000 payday lending stores in 35 states that allow payday lending, the CFPB said. Because of certain state laws, payday lending is already effectively illegal in 15 states. \nFor payday lenders, everything could be about to change. Trump has called the CFPB “a total disaster,” and when Mulvaney took over, many of the CFPB’s supporters said they were concerned he would dismantle various parts of the agency, including its public database of consumer complaints . \nPayday lenders don’t support the rule \nThe Obama-era rule had stricter guidelines for payday lenders. It requires lenders to do a “full-payment test” to determine whether the borrower can make loan payments. To complete that test, the prospective borrower would have to show proof of income. It also limits the number of loans consumers are able to get; they can only get three loans “in quick succession.” But Mulvaney’s CFPB could loosen those requirements. \nDennis Shaul, the CEO of the Community Financial Services Association of America, a trade group that includes payday lenders, said he was “pleased” the CFPB is take a second look at the regulations. “The bureau’s rule was crafted on a pre-determined, partisan agenda that failed to demonstrate consumer harm from small-dollar loans, ignored unbiased research and data, and relied on flawed information to support its rulemaking,” he said in a statement. \nOthers said the payday rule also hurts banks, which typically offer loans to creditworthy consumers at more reasonable rates. “Under the current rule, many banks are forced to sit on the sidelines and prevented from offering affordable and popular small-dollar credit options to help meet the needs of their customers,” said Richard Hunt, the CEO and president of the Consumer Bankers Association, a trade group. See also ", "external_links": [], "published": "2018-01-17T01:55:00.000+02:00", "crawled": "2018-01-17T04:25:30.020+02:00", "highlightTitle": ""}