{"organizations": [], "uuid": "7a89f61059fa2778dacd173649057eb45f2c2c99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-cnx-midstream-reports-fourth-quarter-and-full-year-2017-results-and-announces-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "CNX Midstream Reports Fourth Quarter and Full Year 2017 Results and Announces 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:45:00.000+02:00", "replies_count": 0, "uuid": "7a89f61059fa2778dacd173649057eb45f2c2c99"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-cnx-midstream-reports-fourth-quarter-and-full-year-2017-results-and-announces-2018-guidance.html", "ord_in_thread": 0, "title": "CNX Midstream Reports Fourth Quarter and Full Year 2017 Results and Announces 2018 Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "cnx midstream reports fourth quarter", "sentiment": "negative"}, {"name": "cnx midstream partners lp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 30, 2018 (GLOBE NEWSWIRE) -- CNX Midstream Partners LP (NYSE:CNXM) (“CNX Midstream” or the “Partnership”) today reported financial and operational results for the three months and the full year ended December 31, 2017. (1) The Partnership also announced financial guidance for 2018.\nFourth Quarter Results\nHighlights of fourth quarter 2017 results attributable to the Partnership as compared to the fourth quarter of 2016 include:\nNet income of $27.0 million as compared to $24.8 million Average daily throughput volumes of 961 billion Btu per day (BBtu/d) as compared to 933 BBtu/d Net cash provided by operating activities of $40.9 million as compared to $37.2 million Adjusted EBITDA (2) of $32.4 million as compared to $29.1 million Distributable cash flow (DCF) (2) of $27.7 million as compared to $24.7 million Distribution coverage ratio (2) of 1.29x on an as declared basis\nFull Year 2017 Results\nHighlights of full year 2017 results attributable to the Partnership as compared to full year 2016 include:\nNet income of $115.0 million as compared to $96.5 million Net cash provided by operating activities of $155.6 million as compared to $160.1 million Adjusted EBITDA (2) of $136.1 million as compared to $110.5 million Distributable cash flow (DCF) (2) of $117.0 million as compared to $96.2 million\nManagement Comment\n\"Our fourth quarter results were in-line with expectations and capped another year of growth and strong financial and operating performance for CNX Midstream,\" said Nicholas J. DeIuliis , Chief Executive Officer of CNX Midstream GP LLC (the \"General Partner\"). \"For the full year 2017, CNXM reported a 19% increase in net income, a 23% increase in Adjusted EBITDA , and distributable cash flow grew by 22% over 2016 results. Our cash distribution with respect to the fourth quarter of $0.3133 per unit represents a 15% increase over the distribution paid with respect to the fourth quarter of 2016.\"\nQuarterly Distribution\nAs previously announced, the Board of Directors of the General Partner declared a quarterly cash distribution of $0.3133 per unit with respect to the fourth quarter of 2017. The distribution payment will be made on February 14, 2018 to unitholders of record on February 5, 2018. The distribution, which equates to an annual rate of $1.2532 per unit, represents an increase of 3.6% over the third quarter of 2017 and an increase of 15% over the distribution paid with respect to the fourth quarter of 2016.\nCapital Investment and Resources\nCNX Midstream's allocated fourth quarter 2017 share of investment in expansion projects was $7.6 million. Total expansion capital investment at the three development companies in which CNX Midstream holds controlling interests was $9.0 million. CNX Midstream's respective share of maintenance capital expenditures for the three development companies for fourth quarter 2016 was $3.5 million. Maintenance capital expenditures in the aggregate for the development companies in which CNX Midstream holds controlling interests totaled $4.5 million.\nAs of December 31, 2017, CNX Midstream had outstanding borrowings of $149.5 million under its $250 million revolving credit facility.\n2018 Guidance\nBased on current expectations, management is providing the following guidance for 2018. Full year 2018 Adjusted EBITDA (2) attributable to the Partnership is expected to be in the range of $130 to $145 million and full year DCF (2) attributable to the Partnership is expected to be in the range of $111 to $126 million. Management currently anticipates that 2018 capital expenditures attributable to the Partnership will be in the range of $70 to $80 million, of which approximately $12 to $14 million will be for maintenance capital.\nCNX Midstream’s financial guidance is based on numerous assumptions about future events and conditions and, therefore, could vary materially from actual results. These estimates, including capital expenditure plans, are meant to provide guidance only and are subject to revision for acquisitions or operating environment changes.\nFourth Quarter and Full Year 2017 Financial and Operational Results Conference Call\nA conference call and webcast, during which management will discuss fourth quarter and full year 2017 financial and operational results and guidance for 2018, is scheduled for January 30, 2018 at 11:30 a.m. Eastern Time. Prepared remarks by members of management will be followed by a question and answer period. Interested parties may listen via webcast at http://services.choruscall.com/links/cnxm180130.html . Participants who would like to ask questions may join the conference by phone at 888-349-0097 (international 412-902-0126) five to ten minutes prior to the scheduled start time (reference the CNX Midstream call). An on-demand replay of the webcast will be also be available at http://services.choruscall.com/links/cnxm180130.html shortly after the conclusion of the conference call. A telephonic replay will be available through February 13, 2018 by dialing 877-344-7529 (international: 412-317-0088) and using the conference playback number 10116239.\n(1) Unless otherwise indicated, the reporting measures included in this news release reflect the unallocated total activity of the three development companies that have been jointly owned by the Partnership and CNX Gathering LLC (“CNX Gathering”) since completion of the Partnership’s initial public offering (\"IPO\") in September 2014. Effective November 16, 2016, the Partnership acquired the remaining 25% controlling interest in the Anchor Systems, which brought its controlling interest in that system to 100%. The Partnership's current financial interests in the development companies are: 100% in the Anchor Systems, 5% in the Growth Systems, and 5% in the Additional Systems. Because the Partnership owns a controlling interest in each of the three development companies, it fully consolidates their financial results. CNX Gathering is an entity 100% owned by CNX Resources Corporation that owns noncontrolling interests in two of the Partnership’s development companies.\n(2) Adjusted EBITDA, DCF and distribution coverage ratio are not Generally Accepted Accounting Principles (“GAAP”) measures. Definitions and reconciliations of these non-GAAP measures to their nearest comparable GAAP reporting measures appear in the financial tables which follow.\nContacts:\nInvestor Relations:\nSteve Milbourne\n724-485-4408\nstevemilbourne@cnx.com\nMedia:\nBrian Aiello\n724-485-3078\nbrianaiello@cnx.com\n* * * * *\nCNX Midstream Partners is a growth-oriented master limited partnership that owns, operates, develops and acquires gathering and other midstream energy assets to service natural gas production in the Appalachian Basin in Pennsylvania and West Virginia. Our assets include natural gas gathering pipelines and compression and dehydration facilities, as well as condensate gathering, collection, separation and stabilization facilities. More information is available at our website www.cnxmidstream.com .\n* * * * *\nThis press release is intended to be a qualified notice to nominees as provided for under Treasury Regulation Section 1.1446-4(b). Brokers and nominees should treat one hundred percent (100.0%) of CNX Midstream’s distributions to non-U.S. investors as being attributed to income that is effectively connected with a United States trade or business. Accordingly, CNX Midstream's distributions to non-U.S. investors are subject to federal income tax withholding at the highest applicable effective tax rate. Nominees, and not CNX Midstream, are treated as withholding agents responsible for withholding on the distributions received by them on behalf of foreign investors.\n* * * * *\nThis press release contains within the meaning of the federal securities laws. Statements that are predictive in nature, that depend upon or refer to future events or conditions or that include the words “will,” “believe,” “expect,” “anticipate,” “intend,” “estimate” and other expressions that are predictions of or indicate future events and trends and that do not relate to historical matters identify . You should not place undue reliance on . Forward-looking statements include, among others, statements regarding the payment of our quarterly distribution for the quarter ended December 31, 2017 and our anticipated 2018 financial performance. Forward-looking statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions that are difficult to predict, and there can be no assurance that actual outcomes and results will not differ materially from those expected by our management. You should not place undue reliance on . Although reflect our good faith beliefs at the time they are made, they involve known and unknown risks, uncertainties and other factors. While our management considers these expectations and assumptions to be reasonable, they are inherently subject to significant business, economic, competitive, regulatory and other risks, contingencies and uncertainties, most of which are difficult to predict and many of which are beyond our control. These risks, contingencies and uncertainties relate to, among other matters, the following: CNX and HG Energy II Appalachia, LLC currently account for substantially all of our revenue; if either or both of them change their business strategies, or otherwise significantly reduce the volumes of natural gas and condensate transported through our gathering systems, we could be materially and adversely affected; under our gathering agreements, our customers may transfer their leasehold, working and mineral fee interests in their dedicated acreage, and provide for the release of dedicated acreage in certain situations; we may not generate sufficient distributable cash flow to make the payment of the minimum quarterly distribution to our unitholders; our cash flow will depend entirely on the performance of our operating subsidiaries and their ability to distribute cash to us; our midstream systems are exclusively located in the Appalachian Basin, making us vulnerable to risks associated with operating in a single geographic area; we may be unable to grow by acquiring the noncontrolling interests in, or assets of, our operating subsidiaries owned by CNX Gathering, which could limit our ability to increase our distributable cash flow; to maintain and grow our business, we will be required to make substantial capital expenditures and these capital expenditures may not result in revenue increases and may be subject to regulatory, environmental, political, legal and economic risks, which could adversely affect our business and our ability to distribute cash to our unitholders; if we are unable to obtain needed capital or financing on satisfactory terms, our ability to make cash distributions may be diminished or our financial leverage could increase; our exposure to commodity price risk may change over time and we cannot guarantee the terms of any existing or future agreements for our midstream services with third parties or with CNX; restrictions in our revolving credit facility, and other debt agreements that we may enter into in the future, could adversely affect our business, and ability to make quarterly cash distributions to our unitholders; we and our customers may incur significant liability under, or costs and expenditures to comply with, environmental and worker health and safety regulations, which are complex and subject to frequent change; we may not own in fee the land on which our pipelines and facilities are located, which could result in disruptions to our operations; a shortage of equipment and skilled labor could reduce equipment availability and labor productivity and increase labor and equipment costs, which could have a material adverse effect on our business and results of operations; we do not have any officers or employees and rely on officers of our general partner and employees of CNX; terrorist attacks or cyber-attacks could have a material adverse effect on our business, financial condition or results of operations; our general partner and its affiliates, including CNX, have conflicts of interest with us and limited fiduciary duties to us and our unitholders, and they may favor their own interests to our detriment and that of our unitholders; our general partner’s discretion in establishing cash reserves may reduce the amount of cash we have available to distribute to unitholders; affiliates of our general partner, including CNX and CNX Gathering, may compete with us, and neither our general partner nor its affiliates have any obligation to present business opportunities to us except with respect to rights of first offer contained in our omnibus agreement; our tax treatment depends on our status as a partnership for federal income tax purposes; as a result of investing in our common units, you may become subject to state and local taxes and return filing requirements in jurisdictions where we operate or own or acquire properties.\nAlthough reflect our good faith beliefs at the time they are made, they involve known and unknown risks, uncertainties and other factors. For more information concerning factors that could those conveyed in the , including, among others, that our business plans may change as circumstances warrant, please refer to the “Risk Factors” and “Forward-Looking Statements” sections of our Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, unless required by law.\nCNX MIDSTREAM PARTNERS LP CONSOLIDATED STATEMENTS OF OPERATIONS (in thousands, except per unit data) (unaudited) Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 2017 2016 Revenue Gathering revenue — related party $ 37,369 $ 57,827 $ 184,693 $ 239,211 Gathering revenue — third party 24,329 — 49,155 — Total Revenue 61,698 57,827 233,848 239,211 Expenses Operating expense — third party 7,718 6,084 26,640 30,405 Operating expense — related party 4,472 7,140 25,513 29,771 General and administrative expense — third party 2,391 1,978 5,506 5,174 General and administrative expense — related party 2,597 4,135 10,961 10,656 Loss on asset sales — — 3,914 10,083 Depreciation expense 5,717 5,818 22,692 21,201 Interest expense 1,201 694 4,560 1,799 Total Expense 24,096 25,849 99,786 109,089 Net Income 37,602 31,978 134,062 130,122 Less: Net income attributable to noncontrolling interest 10,581 7,130 19,069 33,636 Net Income Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 27,021 $ 24,848 $ 114,993 $ 96,486 Calculation of Limited Partner Interest in Net Income: Net Income Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 27,021 $ 24,848 $ 114,993 $ 96,486 Less: General partner interest in net income, including incentive distribution rights 1,676 1,093 5,614 2,526 Limited partner interest in net income $ 25,345 $ 23,755 $ 109,379 $ 93,960 Net income per limited partner unit - Basic $ 0.40 $ 0.38 $ 1.72 $ 1.59 Net Income per limited partner unit - Diluted $ 0.40 $ 0.38 $ 1.72 $ 1.58 Limited partner unit outstanding - Basic 63,588 61,799 63,582 59,207 Limited partner unit outstanding - Diluted 63,660 61,911 63,634 59,289\nCNX MIDSTREAM PARTNERS LP CONSOLIDATED BALANCE SHEETS (in thousands, except number of units) (Unaudited) December 31,\n2017 December 31,\n2016 ASSETS Current Assets: Cash $ 3,194 $ 6,421 Receivables — related party 13,104 22,434 Receivables — third party 8,251 — Other current assets 2,169 2,181 Total Current Assets 26,718 31,036 Property and Equipment: Property and equipment 972,841 930,732 Less — accumulated depreciation 73,563 52,172 Property and Equipment — Net 899,278 878,560 Other assets 593 8,961 TOTAL ASSETS $ 926,589 $ 918,557 LIABILITIES AND EQUITY Current Liabilities: Accounts payable $ 23,602 $ 18,007 Accounts payable — related party 2,376 8,289 Total Current Liabilities 25,978 26,296 Other Liabilities: Revolving credit facility 149,500 167,000 Total Liabilities 175,478 193,296 Partners' Capital and Noncontrolling Interest: Common units - (63,588,152 units issued and outstanding at December 31, 2017 and 34,363,371 units issued and outstanding at December 31, 2016) 389,427 418,352 Subordinated units (29,163,121 units issued and outstanding at December 31, 2016) — (65,986 ) General partner interest 4,328 (2,311 ) Partners' capital attributable to CNX Midstream Partners LP 393,755 350,055 Noncontrolling interest 357,356 375,206 Total Partners' Capital and Noncontrolling Interest 751,111 725,261 TOTAL LIABILITIES AND PARTNERS' CAPITAL $ 926,589 $ 918,557\nCNX MIDSTREAM PARTNERS LP CONSOLIDATED STATEMENTS OF CASH FLOWS (in thousands) Year Ended December 31, 2017 2016 (Unaudited) Cash Flows from Operating Activities: Net Income $ 134,062 $ 130,122 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation expense and amortization of debt issuance costs 22,860 21,364 Unit-based compensation 1,176 775 Loss on asset sales 3,914 10,083 Other 771 695 Changes in assets and liabilities: Receivables — related party 9,330 7,265 Receivables — third party (8,251 ) — Other current and non-current assets 162 (144 ) Accounts payable (2,520 ) (16,691 ) Accounts payable - related party (5,954 ) 6,620 Net Cash Provided by Operating Activities 155,550 160,089 Cash Flows from Investing Activities: Capital expenditures (48,366 ) (50,660 ) Proceeds from sale of assets 21,531 5,332 Net Cash Used in Investing Activities (26,835 ) (45,328 ) Cash Flows from Financing Activities: Distributions to general partner and noncontrolling interest holders, net (36,889 ) (2,344 ) Quarterly distribution to unitholders (77,117 ) (59,690 ) Net (payment) proceeds on revolving credit facility (17,500 ) 93,500 Vested units withheld for unitholder taxes (436 ) (23 ) Acquisition of remaining 25.0% noncontrolling interest in the Anchor Systems — (140,000 ) Net Cash Used In Financing Activities (131,942 ) (108,557 ) Net (Decrease) Increase in Cash (3,227 ) 6,204 Cash at Beginning of Period 6,421 217 Cash at End of Period $ 3,194 $ 6,421\nCNX MIDSTREAM PARTNERS LP\nSUPPLEMENTAL STATEMENTS OF CASH FLOWS (in thousands) (unaudited) Three Months Ended December 31, 2017 2016 Cash Flows from Operating Activities: Net income $ 37,602 $ 31,978 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation expense and amortization of debt issuance costs 5,759 5,857 Unit-based compensation 277 198 Other 91 115 Changes in assets and liabilities: Receivables — related party (1,307 ) (2,146 ) Receivables — third party (492 ) — Other current and non-current assets (426 ) (750 ) Accounts payable (646 ) (4,728 ) Accounts payable — related party 55 6,627 Net Cash Provided by Operating Activities 40,913 37,151 Cash Flows from Investing Activities: Capital expenditures (13,461 ) (10,194 ) Proceeds from sale of assets — 5,095 Net Cash Used in Investing Activities (13,461 ) (5,099 ) Cash Flows from Financing Activities: Contributions from general partner 1 — Quarterly distribution to unitholders (20,573 ) (15,827 ) Net (payment) proceeds on revolver credit facility (7,500 ) 126,000 Vested units withheld for unitholder taxes (25 ) — Acquisition of remaining 25.0% noncontrolling interest in the Anchor Systems — (140,000 ) Net Cash Used In Financing Activities (28,097 ) (29,827 ) Net (Decrease) Increase in Cash (645 ) 2,225 Cash at Beginning of Period 3,839 4,196 Cash at End of Period $ 3,194 $ 6,421 CNX MIDSTREAM PARTNERS LP\nRECONCILIATION OF NET INCOME TO EBITDA AND DISTRIBUTABLE CASH FLOW\n(in thousands)\n(unaudited)\nDefinition of Non-GAAP Financial Measures\nEBITDA and Adjusted EBITDA\nWe define EBITDA as net income (loss) before net interest expense, depreciation and amortization, and Adjusted EBITDA as EBITDA adjusted for non-cash items which should not be included in the calculation of distributable cash flow. EBITDA and Adjusted EBITDA are used as supplemental financial measures by management and by external users of our financial statements, such as investors, industry analysts, lenders and ratings agencies, to assess:\n• our operating performance as compared to those of other companies in the midstream energy industry, without regard to financing methods, historical cost basis or capital structure;\n• the ability of our assets to generate sufficient cash flow to make distributions to our partners;\n• our ability to incur and service debt and fund capital expenditures; and\n• the viability of acquisitions and other capital expenditure projects and the returns on investment of various investment opportunities.\nWe believe that the presentation of EBITDA and Adjusted EBITDA provides information that is useful to investors in assessing our financial condition and results of operations. The GAAP measures most directly comparable to EBITDA and Adjusted EBITDA are net income and net cash provided by operating activities. EBITDA and Adjusted EBITDA should not be considered an alternative to net income, net cash provided by operating activities or any other measure of financial performance or liquidity presented in accordance with GAAP. EBITDA and Adjusted EBITDA exclude some, but not all, items that affect net income or net cash, and these measures may vary from those of other companies. As a result, EBITDA and Adjusted EBITDA as presented herein may not be comparable to similarly titled measures of other companies.\nDistributable Cash Flow\nWe define distributable cash flow as Adjusted EBITDA less net income attributable to noncontrolling interest, net cash interest paid and maintenance capital expenditures. Distributable cash flow does not reflect changes in working capital balances.\nDistributable cash flow is used as a supplemental financial measure by management and by external users of our financial statements, such as investors, industry analysts, lenders and ratings agencies, to assess:\n• the ability of our assets to generate cash sufficient to support our indebtedness and make future cash distributions to our unitholders; and\n• the attractiveness of capital projects and acquisitions and the overall rates of return on alternative investment opportunities.\nWe believe that the presentation of distributable cash flow in this release provides information useful to investors in assessing our financial condition and results of operations. The GAAP measures most directly comparable to distributable cash flow are net income and net cash provided by operating activities. Distributable cash flow should not be considered an alternative to net income, net cash provided by operating activities or any other measure of financial performance or liquidity presented in accordance with GAAP. Distributable cash flow excludes some, but not all, items that affect net income or net cash, and these measures may vary from those of other companies. As a result, our distributable cash flow may not be comparable to similarly titled measures of other companies.\nDistribution Coverage Ratio\nWe define distributable coverage ratio as distributable cash flow divided by cash distributions declared or paid.\nCNX MIDSTREAM PARTNERS LP\nRECONCILIATION OF NET INCOME AND NET CASH PROVIDED BY OPERATING ACTIVITIES TO ADJUSTED EBITDA AND DISTRIBUTABLE CASH FLOW\n(in thousands)\n(unaudited)\nThe following table presents a reconciliation of the non-GAAP measures Adjusted EBITDA and distributable cash flow with the most directly comparable GAAP financial measures of net income and net cash provided by operating activities.\nThree Months Ended December 31, Twelve Months Ended December 31, 2017 2016 2017 2016 Net Income $ 37,602 $ 31,978 $ 134,062 $ 130,122 Depreciation expense 5,717 5,818 22,692 21,201 Interest expense 1,201 694 4,560 1,799 EBITDA 44,520 38,490 161,314 153,122 Non-cash unit-based compensation expense 277 198 1,176 775 Loss on asset sales — — 3,914 10,083 Adjusted EBITDA 44,797 38,688 166,404 163,980 Less: Net income attributable to noncontrolling interest 10,581 7,130 19,069 33,636 Depreciation expense attributable to noncontrolling interest 1,748 2,313 7,147 9,597 Other expenses attributable to noncontrolling interest 108 100 394 621 Loss on asset sales attributable to noncontrolling interest — — 3,718 9,579 Adjusted EBITDA attributable to general and limited partner ownership interest in CNX Midstream Partners LP $ 32,360 $ 29,145 $ 136,076 $ 110,547 Less: cash interest paid, net 1,154 628 4,387 1,310 Less: maintenance capital expenditures, net of reimbursements 3,483 3,837 14,658 13,071 Distributable Cash Flow $ 27,723 $ 24,680 $ 117,031 $ 96,166 Net Cash Provided by Operating Activities $ 40,913 $ 37,151 $ 155,550 $ 160,089 Interest expense 1,201 694 4,560 1,799 Loss on asset sales — — 3,914 10,083 Other, including changes in working capital 2,683 843 2,380 (7,991 ) Adjusted EBITDA 44,797 38,688 166,404 163,980 Less: Net income attributable to noncontrolling interest 10,581 7,130 19,069 33,636 Depreciation expense attributable to noncontrolling interest 1,748 2,313 7,147 9,597 Other expenses attributable to noncontrolling interest 108 100 394 621 Loss on asset sales attributable to noncontrolling interest — — 3,718 9,579 Adjusted EBITDA attributable to general and limited partner ownership interest in CNX Midstream Partners LP $ 32,360 $ 29,145 $ 136,076 $ 110,547 Less: cash interest paid, net 1,154 628 4,387 1,310 Less: maintenance capital expenditures, net of reimbursements 3,483 3,837 14,658 13,071 Distributable Cash Flow $ 27,723 $ 24,680 $ 117,031 $ 96,166 The following table presents a reconciliation of the non-GAAP measures Adjusted EBITDA and distributable cash flow by quarter and for the most recently completed twelve month period with the most directly comparable GAAP financial measures, which are net income and net cash provided by operating activities.\n(unaudited) Q1 2017 Q2 2017 Q3 2017 Q4 2017 Twelve\nMonths\nEnded\nDecember\n31, 2017 Net Income $ 33,240 $ 29,752 $ 33,468 $ 37,602 $ 134,062 Depreciation expense 5,671 5,675 5,629 5,717 22,692 Interest expense 1,038 1,124 1,197 1,201 4,560 EBITDA 39,949 36,551 40,294 44,520 161,314 Non-cash unit-based compensation expense 283 367 249 277 1,176 Loss on asset sales 673 3,241 — — 3,914 Adjusted EBITDA 40,905 40,159 40,543 44,797 166,404 Less: Net income attributable to noncontrolling interest 3,173 761 4,554 10,581 19,069 Depreciation expenses attributable to noncontrolling interest 1,830 1,833 1,736 1,748 7,147 Other expenses attributable to noncontrolling interest 82 112 92 108 394 Loss on asset sales attributable to noncontrolling interest 639 3,079 — — 3,718 Adjusted EBITDA Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 35,181 $ 34,374 $ 34,161 $ 32,360 $ 136,076 Less: cash interest paid, net 1,000 1,079 1,154 1,154 4,387 Less: maintenance capital expenditures, net of reimbursements 3,881 3,715 3,579 3,483 14,658 Distributable Cash Flow $ 30,300 $ 29,580 $ 29,428 $ 27,723 $ 117,031 Net Cash Provided by Operating Activities $ 34,176 $ 42,258 $ 38,203 $ 40,913 $ 155,550 Interest expense 1,038 1,124 1,197 1,201 4,560 Loss on asset sales 673 3,241 — — 3,914 Other, including changes in working capital 5,018 (6,464 ) 1,143 2,683 2,380 Adjusted EBITDA 40,905 40,159 40,543 44,797 166,404 Less: Net income attributable to noncontrolling interest 3,173 761 4,554 10,581 19,069 Depreciation expense attributable to noncontrolling interest 1,830 1,833 1,736 1,748 7,147 Other expenses attributable to noncontrolling interest 82 112 92 108 394 Loss on asset sales attributable to noncontrolling interest 639 3,079 — — 3,718 Adjusted EBITDA Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 35,181 $ 34,374 $ 34,161 $ 32,360 $ 136,076 Less: cash interest paid, net 1,000 1,079 1,154 1,154 4,387 Less: maintenance capital expenditures, net of reimbursements 3,881 3,715 3,579 3,483 14,658 Distributable Cash Flow $ 30,300 $ 29,580 $ 29,428 $ 27,723 $ 117,031 Distributions Declared $ 18,842 $ 19,698 $ 20,573 $ 21,489 $ 80,602 Distribution Coverage Ratio - Declared 1.61 x 1.50 x 1.43 x 1.29 x 1.45 x Distributable Cash Flow $ 30,300 $ 29,580 $ 29,428 $ 27,723 $ 117,031 Distributions Paid $ 18,004 $ 18,842 $ 19,698 $ 20,573 $ 77,117 Distribution Coverage Ratio - Paid 1.68 x 1.57 x 1.49 x 1.35 x 1.52 x The following table presents a reconciliation of the non-GAAP measures of the Partnership's projected adjusted EBITDA and projected distributable cash flow with the most directly comparable GAAP financial measure, which is projected net income. The following projections represent the approximate midpoint of the announced full year 2018 expected guidance ranges of adjusted EBITDA ($130-$145 million) and full year distributable cash flow ($111-$126 million) attributable to the Partnership. CNX Midstream’s financial guidance is based on numerous assumptions about future events and conditions and, therefore, could vary materially from actual results. These estimates are meant to provide guidance only and are subject to revision for acquisitions or operating environment changes.\n(unaudited) (in millions) Forecast 2018\nEstimate Net Income $ 142 Depreciation expense 23 Interest expense 6 EBITDA 171 Non-cash unit-based compensation expense 1 Adjusted EBITDA 172 Less: Net income attributable to noncontrolling interest 27 Depreciation and other expenses attributable to noncontrolling interest 7 Adjusted EBITDA Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 138 Less: cash interest paid, net 6 Less: maintenance capital expenditures, net of reimbursements 13 Distributable Cash Flow $ 119\nThe Partnership is unable to project net cash provided by operating activities or provide the related reconciliation of projected net cash provided by operating activities to projected distributable cash flow, the most comparable financial measure calculated in accordance with GAAP, because net cash provided by operating activities includes the impact of changes in operating assets and liabilities. Changes in operating assets and liabilities relate to the timing of the Partnership’s cash receipts and disbursements that may not relate to the period in which the operating activities occurred, and the Partnership is unable to project these timing differences with any reasonable degree of accuracy.\nDevelopment Companies Jointly Owned by CNX Gathering LLC and CNX Midstream Partners LP Operating Income Summary, Selected Operating Statistics and Capital Investment (in thousands) (unaudited) Three Months Ended December 31, 2017 Development Company Anchor Growth Additional TOTAL Income Summary Revenue $ 44,830 $ 1,942 $ 14,926 $ 61,698 Expenses 18,364 1,422 4,310 24,096 Net Income 26,466 520 10,616 37,602 Less: Net income attributable to noncontrolling interest — 494 10,087 10,581 Net Income Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 26,466 $ 26 $ 529 $ 27,021 Operating Statistics - Gathered Volumes Dry gas (BBtu/d) 567 45 16 628 Wet gas (BBtu/d) 369 4 313 686 Condensate (Bcfe/d) 5 — 25 30 Total Gathered Volumes 941 49 354 1,344 Total Volumes Net to CNX Midstream Partners LP 941 2 18 961 Capital Investment Maintenance capital $ 3,430 $ 185 $ 884 $ 4,499 Expansion capital 7,512 (418 ) 1,868 8,962 Total Capital Investment $ 10,942 $ (233 ) $ 2,752 $ 13,461 Capital Investment Net to CNX Midstream Partners LP Maintenance capital $ 3,430 $ 9 $ 44 $ 3,483 Expansion capital 7,512 (21 ) 93 7,584 Total Capital Investment Net to CNX Midstream Partners LP $ 10,942 $ (12 ) $ 137 $ 11,067\nDevelopment Companies Jointly Owned by CNX Gathering LLC and CNX Midstream Partners LP Operating Income Summary, Selected Operating Statistics and Capital Investment (in thousands) (unaudited) Three Months Ended December 31, 2016 Development Company Anchor Growth Additional TOTAL Income Summary Revenue $ 48,728 $ 2,173 $ 6,926 $ 57,827 Expenses 20,013 1,593 4,243 25,849 Net Income 28,715 580 2,683 31,978 Less: Net income attributable to noncontrolling interest 4,030 551 2,549 7,130 Net Income Attributable to General and Limited Partner Ownership Interest in CNX Midstream Partners LP $ 24,685 $ 29 $ 134 $ 24,848 Operating Statistics - Gathered Volumes Dry gas (BBtu/d) 665 59 26 750 Wet gas (BBtu/d) 387 5 155 547 Condensate (Bcfe/d) 4 — 4 8 Total Gathered Volumes 1,056 64 185 1,305 Total Volumes Net to CNX Midstream Partners LP 921 3 9 933 Capital Investment Maintenance capital $ 4,328 $ 271 $ 715 $ 5,314 Expansion capital 5,696 125 (941 ) 4,880 Total Capital Investment $ 10,024 $ 396 $ (226 ) $ 10,194 Capital Investment Net to CNX Midstream Partners LP Maintenance capital $ 3,787 $ 14 $ 36 $ 3,837 Expansion capital 4,803 6 (47 ) 4,762 Total Capital Investment Net to CNX Midstream Partners LP $ 8,590 $ 20 $ (11 ) $ 8,599\nSource:CNX Midstream Partners LP", "external_links": ["https://www.globenewswire.com/Tracker?data=Fxf1tFfmvpJuw1G7gu7_WkNvEgvmJxuoCGNkccPmSc-w7GDkSmEjBh4AeefYByvaN178qAHycY9BiJYNyietnzok084sNVr_v1jXQfUUVmzfY0bukGk4jNQOQ1ebCh6InZd6c9E6CYoSe2bBItuPViUb_11UybqYnR7zZctK3Bc=", "http://services.choruscall.com/links/cnxm180130.html", "https://www.globenewswire.com/Tracker?data=xDcxSfsdmp-q_UGP8KNLSxAYBEUIkkypAdvAc9YRH9nG2Qpg_AjdnguFg0ZkTUDmst0Y6wLTrs3ZUn4eaJO8SULQHcAVMUN8bOnelOPeYUI=", "https://www.globenewswire.com/Tracker?data=BgOjeiSuy9D9LbGgMPTWgn9n8yidcJuhjjhEJNaTYFv9t7xdl4gA3ypYmBnwa1weRtkuRCKesM4x9bAffo7sR5kZQqN8DIsCQhMFIIiLKag=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/537b4a4a-6df3-4d1a-bad0-e74175cd6931", "https://www.globenewswire.com/Tracker?data=37VZQfpjNRRL6puBPmg6WM52XgTwos4Fm4YhnAyKQTTnLdGR8M95W_RBLe7CywQTWExMgyYjk1WJhVKIbyK-7kuymzJ_WqMpC7vdsdjr4wk=", "https://www.globenewswire.com/Tracker?data=Fxf1tFfmvpJuw1G7gu7_WkNvEgvmJxuoCGNkccPmSc-w7GDkSmEjBh4AeefYByva8JDujQccILHjoFWLRELAp8hsQYVCYYAzmdRfPXBSXADesdAZprNmtUmOkDRpZEkS86qJa-dGW8U9LKOsS1Pm-gWengI3R1XD5KNH_4UjhlI="], "published": "2018-01-30T14:45:00.000+02:00", "crawled": "2018-01-30T15:36:09.009+02:00", "highlightTitle": ""}