{"organizations": [], "uuid": "078fe0857a774fa50232467a5cb2f6ea54ad8ad7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-flx-bio-appoints-dirk-g-brockstedt-ph-d-as-senior-vice-president-of-biology.html", "country": "US", "domain_rank": 767, "title": "FLX Bio Appoints Dirk G. Brockstedt, Ph.D., as Senior Vice President of Biology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "078fe0857a774fa50232467a5cb2f6ea54ad8ad7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-flx-bio-appoints-dirk-g-brockstedt-ph-d-as-senior-vice-president-of-biology.html", "ord_in_thread": 0, "title": "FLX Bio Appoints Dirk G. Brockstedt, Ph.D., as Senior Vice President of Biology", "locations": [], "entities": {"persons": [{"name": "dirk g. brockstedt", "sentiment": "negative"}, {"name": "brockstedt", "sentiment": "none"}, {"name": "brian wong", "sentiment": "none"}, {"name": "dirk", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "flx bio, inc.", "sentiment": "neutral"}, {"name": "aduro biotech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif.--(BUSINESS WIRE)-- FLX Bio, Inc., a biopharmaceutical company focused on the discovery and development of oral small molecule drugs to activate the immune system against cancer, today announced the appointment of industry veteran Dirk G. Brockstedt, Ph.D., to the position of Senior Vice President of Biology.\n“Dirk brings a wealth of experience in immuno-oncology at all stages of discovery, translational and clinical development, as well as a deep knowledge of immunology and the tumor microenvironment. He will play a pivotal role in the advancement of our programs targeting CCR4, USP7 and GCN2, key regulators of immunosuppression pathways in tumors, as well as our newer emerging small molecule immuno-oncology targets,” said Brian Wong, M.D., Ph.D., President and CEO.\nDr. Brockstedt joins FLX Bio most recently from Aduro Biotech, where he served in a number of escalating positions, most recently as Executive Vice President of Research and Development. Prior to joining Aduro, Dr. Brockstedt held increasing positions within the immunology department of Cerus Corporation, as Director of Immunology. Prior to Cerus, he served as a scientist at Aventis in the immunotherapy and anti-angiogenesis group, developing novel therapies against cancer. Dr. Brockstedt has co-authored 40 scientific papers and is a named inventor on seven issued patents and several pending applications. Dr. Brockstedt holds an M.S. in Microbiology from the University of Kiel and he earned his Ph.D. from the University of Kiel and Stanford University. He was a post-doctoral fellow at the Stanford School of Medicine in the Department of Pathology.\n“I’m extremely pleased to join FLX Bio at this pivotal time, with the company’s lead compound FLX475, a CCR4 antagonist, now in clinical development and a robust pipeline of oral small molecule compounds moving through early-stage studies,” commented Dr. Brockstedt. “FLX has built an impressive small molecule drug discovery engine that has generated some very promising compounds in a potentially transformative area of tumor biology. In addition, I am eager to work with FLX Bio’s scientific advisory board of world-renowned thought leaders in the field of tumor immunology to pursue new approaches to cancer therapy.”\nAbout FLX Bio\nFLX Bio, Inc. is an immuno-oncology company focused on the discovery and development of orally-available, small molecule drugs to activate the immune system and eradicate cancer. Using its integrated immuno-oncology drug discovery platform, FLX Bio’s small molecule compounds specifically target proteins and pathways important for regulatory T cells or myeloid cells within the tumor microenvironment. Its lead candidate, a best-in-class CCR4 inhibitor, entered Phase 1 studies in December 2017 and has the potential to be used alone or in combination with checkpoint inhibitors to treat a variety of cancers. The company employs a precision medicine strategy for prospective patient selection in clinical studies, applying its robust computational and translational biology capabilities to identify key biomarkers that should maximize clinical response and increase the probability of clinical success.\nLocated in South San Francisco, Calif., and funded by leading investors, including The Column Group (TCG), Kleiner Perkins (KP), Topspin Partners, GV (formerly Google Ventures) and Celgene Corporation, FLX Bio has assembled a leadership team and advisory group with a proven track record of success and team of scientists with substantial knowledge and expertise in drug discovery and translational areas essential to execute on this approach. For more information, please visit www.flxbio.com .\n //www.businesswire.com/news/home/20180103005417/en/\nfor FLX Bio, Inc.\nAngela Bitting, 925-202-6211\nmedia@flxbio.com\nSource: FLX Bio, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.flxbio.com%2F&esheet=51737028&newsitemid=20180103005417&lan=en-US&anchor=www.flxbio.com&index=1&md5=389780e31cc2d7988bc66b298d90f656", "http://www.businesswire.com/news/home/20180103005417/en/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:50:19.010+02:00", "highlightTitle": ""}