{"organizations": [], "uuid": "e8474af60d785403081c46ead956d5497f604585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-broadvoice-hires-vincent-mussumeci-as-senior-channel-manager.html", "country": "US", "domain_rank": 767, "title": "Broadvoice Hires Vincent Mussumeci as Senior Channel Manager", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:03:00.000+02:00", "replies_count": 0, "uuid": "e8474af60d785403081c46ead956d5497f604585"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-broadvoice-hires-vincent-mussumeci-as-senior-channel-manager.html", "ord_in_thread": 0, "title": "Broadvoice Hires Vincent Mussumeci as Senior Channel Manager", "locations": [], "entities": {"persons": [{"name": "vincent mussumeci", "sentiment": "negative"}, {"name": "randy greene", "sentiment": "none"}, {"name": "vincent", "sentiment": "none"}, {"name": "mussumeci", "sentiment": "none"}, {"name": "tessley smith", "sentiment": "none"}, {"name": "alan kaplan", "sentiment": "none"}, {"name": "broadvoice", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "broadvoice", "sentiment": "none"}], "organizations": [{"name": "broadvoice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 10, 2018 /PRNewswire/ -- Broadvoice®, an award-winning provider of hosted voice, unified communications (UC) and SIP Trunking services for businesses, has tapped Vincent Mussumeci as senior channel manager.\nMussumeci's appointment follows the recent additions of Alan Kaplan and Randy Greene as channel managers to further support Broadvoice's expanding channel program and double-digit sales growth with its suite of cloud communications services.\nMussumeci has worked in the telecom industry for 20 years as a unified communications as a service (UCaaS) reseller, account executive and channel manager. Prior to joining Broadvoice, he spent several years with 8x8, earning recognition as a Top 15 Channel Manager .\n\"We are excited about Vincent joining our team,\" said Tessley Smith, vice president of channel for Broadvoice. \"He has a stellar reputation in the channel community and a proven track record of supporting and empowering partners as their clients increasingly migrate to cloud-based solutions. He also adds a wealth of knowledge and experience to a veteran team that will continue to drive phenomenal growth.\"\nAs senior channel manager, Mussumeci will leverage his existing partner relationships and develop new ones to further grow Broadvoice's presence in Northern California and the Northwest.\n\"Broadvoice is channel friendly and makes it easy for customers to do business with them,\" said Mussumeci. \"They care about each other and want to do what is right for their partners and customers. And, the tech is strong -- the software is slick and has the potential to take over the market. It's exciting to join the Broadvoice team at such a pivotal time.\"\nBroadvoice offers a flexible, smart portfolio of IP-based voice and data offerings, backed by its enterprise-class, geo-redundant IP telephony platform. This includes its flagship cloud UC and PBX services, which features unlimited voice calling plans throughout the continental United States and Canada.\nFor more information on the Broadvoice Partner Program, please call 866.634.1394, or visit www.broadvoice.com/partners .\nAbout Broadvoice\nHeadquartered in Los Angeles, Broadvoice is a premier provider of cloud phone service, contact center solutions, collaboration and conferencing. Utilizing the latest cloud communications technology, Broadvoice helps businesses achieve higher call quality and faster Internet speeds while reducing overall costs and improving efficiency. The company continuously delivers a full suite of secure, reliable, real-time communication solutions that help businesses connect with customers anywhere, anytime and with any device. Broadvoice is ranked in the Deloitte Technology Fast 500 and Inc. 500 Fastest Growing Private Companies in America. Visit Broadvoice.com to learn more.\nMedia Contact:\nRebecca Rosen\nVice President of Marketing\nBroadvoice\n818.671.2953\n188541@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/broadvoice-hires-vincent-mussumeci-as-senior-channel-manager-300580665.html\nSOURCE Broadvoice", "external_links": ["http://www.broadvoice.com/partners", "http://www.prnewswire.com/news-releases/broadvoice-hires-vincent-mussumeci-as-senior-channel-manager-300580665.html", "http://pho.virgocreative.com/articles/2010/10/8x8-s-vincent-mussumeci-named-top-15-channel-mana.aspx"], "published": "2018-01-10T16:03:00.000+02:00", "crawled": "2018-01-10T19:15:19.009+02:00", "highlightTitle": ""}