{"organizations": [], "uuid": "ec2e34f3999baed7d071944e15e5dad9b6dd4ea2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/brazil-ma-outlook/recovery-to-drive-brazil-ma-pipeline-in-2018-after-33-pct-jump-idUSL2N1M02BP", "country": "US", "domain_rank": 408, "title": "Recovery to drive Brazil M&A pipeline in 2018 after 33 pct jump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:00:00.000+02:00", "replies_count": 0, "uuid": "ec2e34f3999baed7d071944e15e5dad9b6dd4ea2"}, "author": "", "url": "https://www.reuters.com/article/brazil-ma-outlook/recovery-to-drive-brazil-ma-pipeline-in-2018-after-33-pct-jump-idUSL2N1M02BP", "ord_in_thread": 0, "title": "Recovery to drive Brazil M&A pipeline in 2018 after 33 pct jump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 00 AM / Updated 14 minutes ago Recovery to drive Brazil M&A pipeline in 2018 after 33 pct jump Tatiana Bautzer 4 Min Read \nSAO PAULO, Jan 9 (Reuters) - Brazil’s rebounding economy and record-low interest rates are likely to change the nature of mergers and acquisitions in 2018 from scandal-driven asset sales to investor bets on a broad recovery, bankers and lawyers in the country said. \nConglomerates under pressure from corruption probes and excessive debt were forced to sell major assets last year, lifting the value of Brazilian M&A to $61.77 billion, up 33 percent from 2016. Bigger transactions drove the increase, as the number of deals fell to 544 from 615 a year before. \nBankers expect a similar volume of deals in Brazil this year, but driven by new motives as Latin America’s largest economy is poised to grow the most in at least five years. \n“We will still see a lot of deals in infrastructure and energy, but the recovery may stimulate acquisitions in retail and consumer industries too,” said Roderick Greenlees, head of investment banking at Itaú BBA SA, which topped the Thomson Reuters ranking last year in number of deals. \nSome of the first deals of 2018 have highlighted a new kind of interest from buyers. \nChina’s Didi Chuxing announced last week that it was taking control of Brazilian ride-hailing app 99 as part of its expansion in Latin America. \nBoeing Co is also in tie-up talks with Brazilian airmaker Embraer SA with an eye on its new regional jets and military airlifter. \nBy contrast, several of the biggest deals last year involved companies sold by conglomerate J&F Investimentos SA, which agreed to pay the largest-ever leniency fine for its role in political bribery schemes. Its owners, brothers Joesley and Wesley Batista, are now in jail. \nJ&F closed several multibillion deals, such as the sale of dairy company Vigor Alimentos SA to Mexico’s Grupo Lala SAB de CV in August and pulpmaker Eldorado Celulose Brasil SA to Paper Excellence in September. \nWhile deals related to graft investigations are winding down, some large Brazilian groups still need to sell assets and pay down debt, said Leandro Miranda, head of investment banking at Banco Bradesco BBI, the leader in deal value in Brazil last year. \nRecord-low interest rates this year may favor financial acquirers such as buyout firms instead of strategic investors and M&A deal financing, Miranda added. \nAlthough volatility related to an October presidential election may weigh on capital markets activity, Itaú BBA’s Greenlees does not expect a significant effect on M&A. Still, he said investors would be watching President Michel Temer’s efforts to streamline social security in order to close a fiscal deficit. \n“Approval of pension reform is more important to these long-term investors than the elections,” he said. \nThe rally of the benchmark Bovespa stock index to a fresh high this week has also boosted valuations to levels that could stimulate more moves like the biggest deal of 2017. \nIn that transaction, iron ore miner Vale SA migrated to a single class of stock and incorporated its controlling shareholder Valepar SA. The miner intends to become a dispersed ownership company with gradual steps to scrap its shareholders agreement. The boost to corporate governance, isolating the company from government’s influence, lifted its shares about 64 percent last year. \n“Other companies that still have this governance gap and are discounted by the market may follow Vale’s lead”, said Alessandro Zema, head of investment banking at Morgan Stanley. \n($1 = 3.24 reais)", "external_links": [], "published": "2018-01-09T09:00:00.000+02:00", "crawled": "2018-01-09T09:39:10.604+02:00", "highlightTitle": ""}