{"organizations": [], "uuid": "715e3feeae3361e5ffb2a631a3eefdf9eaffa5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 23}, "facebook": {"likes": 85, "shares": 85, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224941981&w=1200&r=LYNXMPEE0N28D", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-eu-court-facebook-privacy/eu-court-to-decide-if-austrian-can-bring-facebook-class-action-suit-idUSKBN1FD33U", "country": "US", "domain_rank": 408, "title": "EU court to decide if Austrian can bring Facebook class action suit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:58:00.000+02:00", "replies_count": 0, "uuid": "715e3feeae3361e5ffb2a631a3eefdf9eaffa5d7"}, "author": "", "url": "https://www.reuters.com/article/us-eu-court-facebook-privacy/eu-court-to-decide-if-austrian-can-bring-facebook-class-action-suit-idUSKBN1FD33U", "ord_in_thread": 0, "title": "EU court to decide if Austrian can bring Facebook class action suit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - An Austrian privacy activist cannot bring a class action lawsuit against Facebook for alleged privacy violations but can sue the company himself in his home country, the European Union’s highest court ruled on Thursday.\nThe Court of Justice of the European Union (ECJ) said Max Schrems could bring a case against the U.S. company under consumer law as an individual, but could not bring claims on behalf of the more than 25,000 signatories to his lawsuit.\nSchrems alleges Facebook has illegally violated the privacy rights of European users, including by helping a U.S. spy agency. Facebook rejects his assertions, which date back to 2014, and says it has always complied with European data protection laws.\n“Mr Schrems may bring an individual action in Austria against Facebook Ireland,” the court said in a statement, referring to Facebook’s European headquarters.\n“By contrast, as the assignee of other consumers’ claims, he cannot benefit from the consumer forum (consumer law) for the purposes of a collective action.”\nSchrems had sought to claim 500 euros ($620) in damages for each of the signatories to his lawsuit, but Facebook argued the Austrian courts had no jurisdiction and that Schrems could not benefit from consumer protection laws.\nFacebook said Schrems stopped being a consumer when he used a page for professional purposes. Under EU law, consumers are allowed to sue companies in their home country, as opposed to the one where the company is established.\n“Today’s decision by the European Court of Justice supports the previous decisions of two courts that Mr. Schrems’s claims cannot proceed in Austrian courts as “class action” on behalf of other consumers,” said a spokeswoman for Facebook.\nSchrems said the ruling was a “huge blow” for Facebook as his individual lawsuit against the company could go ahead in a Vienna court and Facebook would have to explain whether “its business model is in line with stringent European privacy laws.”\nFacebook’s Chief Operating Officer Sheryl Sandberg traveled to Europe this week to meet with policymakers and said the social network would make it easier for users to manage their privacy settings ahead of the entry into force of a tough new data privacy law.\nSchrems recently set up a non-profit organization, noyb, that will seek to enforce citizens’ rights under the new law and said privacy class actions would be possible under it.\nMISSING PIECE OF CONSUMER PROTECTION While Austria recognizes some forms of class action law suits, Ireland does not.\nThe ECJ said only the person who concluded the original contract with the business could sue under consumer law in his or her home country. The same applies to a consumer to whom the claims of other consumers have been assigned, the court said.\nRelated Coverage Austrian privacy activist says will sue Facebook in Vienna after EU ruling “Since only the original consumer can sue, there is no possibility to bring a class action in Austria,” Schrems said in a video on Twitter after the ruling.\nThe European Consumer Organization (BEUC) said the ruling exposed “a missing and vital piece of the consumer protection jigsaw.”\n“It is another stark illustration that there are legal and procedural barriers which prevent people from seeking collective access to justice. Due to the high costs, it is often not realistic for consumers to go to court alone, especially when the harm they have suffered is rather small in monetary terms,” said Monique Goyens, director general of BEUC.\nReporting by Julia Fioretti; Editing by Alastair Macdonald and Mark Potter\n ", "external_links": [], "published": "2018-01-24T23:58:00.000+02:00", "crawled": "2018-01-25T00:12:47.005+02:00", "highlightTitle": ""}