{"organizations": [], "uuid": "cb95cc445aab62db4d4e487ce8c9b27f718a0e51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/german-parties-agree-on-a-key-point-of-migrant-policy-source-idUKKBN1FJ17G", "country": "US", "domain_rank": 408, "title": "German parties agree on a key point of migrant policy - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:03:00.000+02:00", "replies_count": 0, "uuid": "cb95cc445aab62db4d4e487ce8c9b27f718a0e51"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/german-parties-agree-on-a-key-point-of-migrant-policy-source-idUKKBN1FJ17G", "ord_in_thread": 0, "title": "German parties agree on a key point of migrant policy - source", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "madeline chambers", "sentiment": "none"}, {"name": "holger hansen", "sentiment": "none"}, {"name": "michelle martin", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "none"}, {"name": "rlin", "sentiment": "none"}, {"name": "spiegel online", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 10:04 AM / Updated an hour ago German parties at odds after agreeing migrant policy in coalition talks Holger Hansen 4 Min Read \nBERLIN (Reuters) - Germany’s would-be coalition parties reached a compromise on the divisive question of family reunions for migrants on Tuesday, clearing a major hurdle in talks on a ruling alliance, although both sides immediately presented varying interpretations of it. \nChancellor Angela Merkel’s conservatives and the Social Democrats (SPD) are in talks to end a four-month political impasse and agree a deal within a week to rule Europe’s biggest economy together. \nMigration, and in particular the question of family reunions, is one of the thorniest issues. \nUnder the agreement, a suspension of family re-unifications introduced in 2016 for migrants with “subsidiary protection” will be extended until July 31. That applies to people who are not deemed to be personally persecuted but in whose home country war, torture or other inhumane treatment exist. \nSyrians, the biggest group of asylum applicants in Germany, are increasingly being granted subsidiary protection, only getting the right to stay a year, although that can be extended. \nThe lower house of parliament, the Bundestag, will vote on the extension on Thursday as the suspension is due to expire. \nFrom Aug. 1, up to 1,000 family members a month will be permitted to join people who are allowed to stay in Germany on less than full refugee status. That agreement tallies with a blueprint agreed in exploratory talks earlier this month. \nThe conservatives, especially Merkel’s Bavarian allies, did not want to give way to a more generous policy. \nHowever, SPD party leader Martin Schulz hailed the agreement, saying he had won a concession from the conservatives that meant that more than 1,000 individuals a month would be allowed to enter Germany in cases of special hardship. \nThat would be an addition to the framework agreement which SPD delegates voted narrowly in favour of last week. Under pressure from the narrow result, the party’s leaders promised to improve that document. \n“The SPD has held sway, as the SPD party conference demanded, in getting a significant additional provision for special hardship cases, beyond the 1,000 family members a month agreed in the exploratory talks,” said Schulz. \nIn a foretaste of the tensions that are likely to emerge in the coming days, conservatives played down any extra leeway. \n“There are no new rules on special cases, which would mean an increase in migration,” said Bavarian conservative Alexander Dobrindt. \nOther difficult areas coming up include employment and health policy. The parties also have still to carve up ministerial posts. \nEven if the parties hammer out a deal over the weekend or early next week, as planned, Merkel’s fourth term as chancellor is not guaranteed until the SPD’s roughly 440,000 members have approved it in a ballot. The outcome is unclear. \nThe party’s leaders are keenly aware they have to win further concessions to reassure members who are deeply sceptical about joining Merkel for a re-run of the “grand coalition” that has ruled Germany since 2013.   Andreas Rinke; Writing by Madeline Chambers; Editing by Larry King", "external_links": [], "published": "2018-01-30T12:03:00.000+02:00", "crawled": "2018-01-30T12:22:55.000+02:00", "highlightTitle": ""}