{"organizations": [], "uuid": "dedeac2dfbbc23a904abca85fabdb0f741c76e40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223387795&w=1200&r=LYNXMPEE0I18G", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/usa-trump-russia/in-russia-trump-inauguration-euphoria-leaves-lasting-hangover-idINKBN1F821P", "country": "US", "domain_rank": 408, "title": "In Russia, Trump inauguration euphoria leaves lasting hangover", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:43:00.000+02:00", "replies_count": 0, "uuid": "dedeac2dfbbc23a904abca85fabdb0f741c76e40"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-russia/in-russia-trump-inauguration-euphoria-leaves-lasting-hangover-idINKBN1F821P", "ord_in_thread": 0, "title": "In Russia, Trump inauguration euphoria leaves lasting hangover", "locations": [], "entities": {"persons": [{"name": "andre", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "valery garbuzov", "sentiment": "none"}, {"name": "osborn", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "institute for u.s.", "sentiment": "none"}, {"name": "canadian studies", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - A year ago on Saturday, Russian nationalists partied in central Moscow to celebrate Donald Trump’s inauguration as the 45th president of the United States.\nEuphoria has given way to dismay as the man they expected to end U.S. sanctions against Russia reluctantly reinforced the penalties and allegations of Russian interference in the U.S. election, denied by Moscow, eroded political ties.\nSome Russians even say it might have been better if Hillary Clinton, long portrayed here as rabidly anti-Russian, had won the presidency.\n“Under a Clinton administration ... we could have maintained some kind of contacts and dialogue, at least in the arms control sphere. Now, that’s all gone,” said Valery Garbuzov, director of the Institute for U.S. and Canadian Studies in Moscow, which advises the government on foreign policy.\nBefore he was elected, Trump’s talk of wanting better relations with Moscow and praise for President Vladimir Putin delighted Russian officials, who had watched ties with the administration of Barack Obama sink to a post-Cold War low.\nNews of Trump’s White House win was greeted by applause in the Russian lower house of parliament and the head of the Kremlin-backed RT TV channel, Margarita Simonyan, said she felt like driving around Moscow with a U.S. flag.\nSimonyan now spends much of her time assailing the U.S. authorities, accusing them of shutting down free speech there by designating her channel as “a foreign agent.”\nTsargrad, the nationalist TV channel that broadcast the main Russian Trump inauguration party at Moscow’s Soviet-era post office, accused Trump this week of criticising Russia over North Korea to distract from his own problems at home.\nWith the U.S. Congress continuing investigations into alleged collusion between Trump and Russia and the administration working on lawmakers’ demand for more punitive measures, the Kremlin’s frustration is palpable.\nWhile Putin met Trump twice last year, officials here say they are unaware of any plans for a bilateral summit and Moscow tried and failed to set up a formal meeting between Putin and Trump at an APEC summit in November.\nKremlin spokesman Dmitry Peskov listed U.S.-Russia relations as among the biggest disappointments of 2017.\nThe U.S. Treasury Department is due to publish a report before the end of this month naming wealthy Russians close to Putin or the authorities, something Russian officials fear is a prelude to extending a list of sanctioned people and entities.\nRussian officials say they expect at least another six U.S. government reports this year that may result in new U.S. action against Russia’s energy and financial sectors as well as media, and a possible ban on the purchase of Russian Treasury bonds.\n“(U.S.) sanctions policy is designed to turn Russia into a toxic asset so that any investor will think 10 times before deciding to enter the Russian market,” said Ivan Timofeev, a sanctions expert at the Russian International Affairs Council (RIAC), a think-tank close to the Russian Foreign Ministry.\nFILE PHOTO: Head of the Liberal Democratic Party of Russia (LDPR) Vladimir Zhirinovsky celebrates Donald Trump's election as president by drinking sparkling wine with other party members during a break in the session of the State Duma, the lower house of parliament, in Moscow, Russia November 9, 2016. REUTERS/Maxim Zmeyev/File Photo Russia’s scope to defend itself from new sanctions was “extremely limited,” he said.\n‘TOUGHER THAN OBAMA’\nPutin has put a brave face on worsening U.S.-Russia relations, using his annual news conference in December to say he thought ties would eventually recover, while praising Trump for his economic achievements.\nBut though Russian officials say they believe Trump’s stated desire to improve ties with Moscow is sincere, they portray him as a lame duck president when it comes to making Russia policy, neutered by his domestic political opponents.\nThe result, they complain, is that U.S.-Russia ties are actually worse in some ways than under Obama and that high-level contacts are virtually non-existent.\n“Unfortunately the actions of the current administration are in line with Obama‘s, despite the line of president Trump during his election campaign. In certain areas, they are even more assertive,” Foreign Minister Sergei Lavrov told his annual news conference this month.\nBoth Trump and Putin may say they want better ties, officials say, but day-to-day relations between the two countries are locked in a downward spiral with no Cold War-style communications channels to help tamp down tensions.\nRussian efforts to persuade Trump to hand it back two diplomatic properties in the United States seized under the Obama administration have come to nothing, prompting Moscow to respond by seizing U.S. property in Russia. Putin last year ordered the U.S. Embassy in Russia to shed half its staff.\nThe Trump administration has also upped pressure on Russia over Ukraine, going further than Obama by authorising the supply of new weapons to Kiev, which is locked in a war with pro-Russian separatists in eastern Ukraine.\nIt has also described Russia as a revisionist state seeking to challenge U.S. power.\nAndrey Kortunov, head of RIAC, said Moscow had been blinded by its desire for “anyone but Clinton”, a view that the Republicans were easier to work with than the Democrats, and a belief that Trump’s world view overlapped with Russia‘s.\n“We warned them,” he said.\nGarbuzov, whose institute also advises the government, said the elite wrongly assumed the U.S. political system was like Russia’s where the president has few checks on his authority, and can now only try to limit the damage by cooperating where possible.\n“Trump can’t do anything (to improve Russia ties),” said Garbuzov.\n“He’s made vague statements saying it would be good to fix relations, but how to achieve this is an enigma for him.”\nEditing by Philippa Fletcher\n ", "external_links": [], "published": "2018-01-19T18:43:00.000+02:00", "crawled": "2018-01-19T19:07:59.020+02:00", "highlightTitle": ""}