{"organizations": [], "uuid": "9b28dc3a284891d667453b83f06567467fc1b4a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226275285&w=1200&r=LYNXMPEE0S0RF", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-politics/new-task-for-old-ally-of-chinas-president-xi-suggests-bigger-role-ahead-idUKKBN1FI19T", "country": "US", "domain_rank": 408, "title": "New task for old ally of China's President Xi suggests bigger role ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:31:00.000+02:00", "replies_count": 0, "uuid": "9b28dc3a284891d667453b83f06567467fc1b4a7"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-politics/new-task-for-old-ally-of-chinas-president-xi-suggests-bigger-role-ahead-idUKKBN1FI19T", "ord_in_thread": 0, "title": "New task for old ally of China's President Xi suggests bigger role ahead", "locations": [], "entities": {"persons": [{"name": "xi", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "wang qishan", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hunan", "sentiment": "none"}, {"name": "hunan da", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "communist party congress", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "politburo standing committee", "sentiment": "none"}, {"name": "reuters xi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:33 AM / Updated an hour ago New task for old ally of China's President Xi suggests bigger role ahead Reuters Staff 3 Min Read \nBEIJING (Reuters) - China implied on Monday a new job could be in the offing for Wang Qishan, the powerful former top graft-buster and a close ally of President Xi Jinping, with an announcement that he had been chosen as a delegate to the annual meeting of parliament. \nWang stepped down from the seven-man Politburo Standing Committee, the apex of power in China, during a leadership reshuffle in October at the end of the once-in-five-years Communist Party Congress, amid intense interest in whether he would leave the post. \nAged 69, Wang had reached the age at which top officials tend to retire, but sources with ties to the leadership have told Reuters Xi could keep him on in some capacity, thanks to his loyalty and history of successfully tackling tough issues such as corruption. \nWang has been appointed a delegate to the largely rubber stamp parliament from the southern province of Hunan, according to a notice on the official Hunan Daily’s WeChat account that lists all the province’s parliamentary delegates. \nWang was previously a parliament delegate from the same province. \nThe notice gave no other details or reason why Wang had been kept on as a delegate, and it was not possible to reach him for comment. \nThe move is significant because if Wang does not retire, that could set a precedent for Xi to stay on in power after he completes the traditional two terms in office. China's Politburo Standing Committee member Wang Qishan, the head of China's anti-corruption watchdog, attends a tribute ceremony in front of the Monument to the People's Heroes at Tiananmen Square, ahead of National Day marking the 68th anniversary of the founding of the People's Republic of China in Beijing, China September 30, 2017. REUTERS/Jason Lee \nThe national parliament opens in March, and provinces are now selecting their delegates to it. \nIt is unclear what new role Wang could be given, though leadership sources and diplomats say he might become the country’s new vice president, with a possible focus on relations with the United States. \nThe State Council Information Office, which doubles as the party spokesman’s office, did not immediately respond to a request for comment. \nWang, who keeps a low public profile but is often described as China’s second most powerful politician, has not been totally out of the limelight since the end of the congress, for example, attending a banquet Xi hosted for U.S. President Donald Trump in November. \nWang was at the forefront of Xi’s anti-corruption push launched some five years ago as head of the party’s graft fighting Central Commission for Discipline Inspection, which has been responsible for jailing dozens of top officials. \nHe has a strong economic background also, previously serving as a vice governor of the central bank, and, as a vice premier with an economic portfolio, helped oversee China’s recovery from the 2008 global financial crisis. \nWang has experience managing relations with the United States too, heading the China delegation for the economic track at the once annual U.S.-China Strategic and Economic Dialogue. Reporting by Ben Blanchard and Christian Shepherd; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-29T13:31:00.000+02:00", "crawled": "2018-01-29T13:57:05.051+02:00", "highlightTitle": ""}