{"organizations": [], "uuid": "35632c187aecf1720b800db081531a4f3592fe74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/01/104812165-RTX3IDM6.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/will-the-solar-tariffs-be-a-boon-for-the-us-the-answer-is-far-from-straightforward.html", "country": "US", "domain_rank": 767, "title": "Will the solar tariffs be a boon for the US? The answer is far from straightforward", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.663, "site_type": "news", "published": "2018-01-29T09:37:00.000+02:00", "replies_count": 0, "uuid": "35632c187aecf1720b800db081531a4f3592fe74"}, "author": "Willem Marx", "url": "https://www.cnbc.com/2018/01/29/will-the-solar-tariffs-be-a-boon-for-the-us-the-answer-is-far-from-straightforward.html", "ord_in_thread": 0, "title": "Will the solar tariffs be a boon for the US? The answer is far from straightforward", "locations": [], "entities": {"persons": [{"name": "alvin baez", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "san juan", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "san juan children's hospital", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One plank of Donald Trump 's election platform was centered on rebalancing the trade relationship between the U.S. and China.\nHe once told an interviewer that he preferred \"fair trade\" to plain old \"free trade.\" His Commerce Secretary Wilbur Ross has taken up that baton as a very public proponent of the so-called \"America First\" policy; he has strongly backed Boeing in a dispute with Canada's Bombardier over subsidized pricing for its C-series jet program, and recently told a Davos audience that while there have always been trade wars, the situation today is different because \"U.S. troops are now coming to the ramparts.\"\nAs the World Economic Forum opened at Davos, in what may have been the opening salvo of a potential U.S.-China trade spat, the Trump administration announced it was applying a 30 percent tariff to certain imports, to include solar panels and modules. The White House framed the decision as one that provided \"relief to U.S. manufacturers,\" with U.S. Trade Representative Robert Lighthizer's office claiming that artificially low-priced solar cells and modules from the world's leading producer of solar products, China had caused \"serious injury\" to America's domestic solar industry.\nAs ever, it is worth examining the back story to this decision, which will mean tariffs on imported solar cells and modules jump to 30 percent over the next year before gradually falling to 15 percent at the end of a four-year period. The administration's argument is that the Chinese government has in the past subsidized solar manufacturers inside China, allowing them to sell products in the U.S. at less than their fair market value. When the U.S. authorities previously attempted to clamp down on this practice under former President Barack Obama, the Chinese firms simply started producing their solar panels and modules elsewhere. During Obama's last term in office, the amount of solar power generating capacity that was installed each year across the United States tripled, imports quintupled and correspondingly prices — according to Lighthizer's office — plummeted 60 percent. U.S. solar firms struggled to compete on price, and more than two dozen ended operations during that same period, so that 2017 saw just a handful of U.S. producers of solar cells and modules survive.\nshow chapters Al Gore defends Trump, says he's not to blame for tariffs on solar panels 1:00 PM ET Thu, 25 Jan 2018 | 00:43 Lower prices for solar products may have proven a boon for U.S. electricity consumers, and several high-profile figures have said the new tariffs will cause electricity prices to rise. But surely all those company closures meant lost jobs, and that's the trend this decision by the Trump administration — with its focus on job creation — is trying to reverse? Well yes and no. The broader U.S. solar industry has seen its workforce double between 2012 and 2016, with 268,000 people working for 9,000 companies, according to The Solar Foundation, a not-for-profit research group. Advocates of solar argue that the administration's tariffs will mean tens of thousands in potential blue collar job losses, since hiring will stagnate at a time when the solar sector is growing rapidly and finally starting to undercut other forms of energy in the U.S. domestic supply market.\nIn the increasingly polarized United States of 2018, there are of course critics who say nominally non-partisan groups like The Solar Foundation essentially act as lobbying outfits for the solar industry, keen to push scare stories about job losses in a sector that has long benefitted from tax incentives. But few participants in America's energy sector have ever operated without some form of government subsidies, whether fiscally indirect or otherwise. And over the past year Trump's appointees at the Environmental Protection Agency and Department of Energy have not so discretely worked to support America's fossil fuel producers while seeking to undermine renewable alternatives.\nshow chapters US trade action on solar panels is a tax on consumers 9:20 PM ET Tue, 23 Jan 2018 | 05:59 So what about the impact on shareholders; perhaps these new tariffs can return value to U.S. investors and business owners who have struggled to compete with the Chinese? Again, the answer is far from straightforward. The two main corporate petitioners that helped instigate the U.S. government's examination of this issue are called Suniva and SolarWorld. The former's bankruptcy last year was cited as a casus belli by Lighthizer's office, but what went unmentioned was that the firm had been loss-making even before a Chinese firm, Shunfeng International, became its majority owner in 2015. Meanwhile SolarWorld is a wholly-owned subsidiary of a German company that was rescued from bankruptcy last year by a 100 million euro Qatari investment. So much for \"America First.\" SolarWorld's corporate parent had also struggled to compete against cut-price Chinese products, with EU anti-dumping measures ultimately failing to staunch the Chinese-induced decline of German solar manufacturing.\nThis leaves one final argument for imposing the tariffs, which were first mooted last May; punishment of the Chinese giants who have been propelled to success by a decade of state-imposed targets and structural support from Beijing. Authorities in China immediately protested the measures as an \"overreaction\" and an \"abuse of trade remedy measures,\" and insisted they would consider taking action through the WTO. But the actual Chinese firms may be more sanguine. The U.S. is undoubtedly a big market for them, but they can potentially circumvent the tariffs by building U.S. manufacturing plants and claw back their market share, or they can simply concentrate elsewhere. After all, the U.S. this year will represent just one eighth of the global market for solar installation capacity.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-29T09:37:00.000+02:00", "crawled": "2018-01-29T09:36:47.006+02:00", "highlightTitle": ""}