{"organizations": [], "uuid": "ea1185e9ac6536fb05d13251509682a4e7ef6cbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 35, "shares": 35, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/08/103853704-GettyImages-161820977-2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/apple-should-create-a-smart-contact-lens-commentary.html", "country": "US", "domain_rank": 767, "title": "Apple should create a smart contact lens - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-27T01:56:00.000+02:00", "replies_count": 0, "uuid": "ea1185e9ac6536fb05d13251509682a4e7ef6cbf"}, "author": "Anita Balakrishnan", "url": "https://www.cnbc.com/2018/01/26/apple-should-create-a-smart-contact-lens-commentary.html", "ord_in_thread": 0, "title": "Apple should create a smart contact lens - commentary", "locations": [], "entities": {"persons": [{"name": "phil schiller", "sentiment": "negative"}, {"name": "tim cook", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apple's Phil Schiller introduces Face ID at the iPhone X launch in September 2017. \nMy editor recently asked me to imagine Apple's 20-year vision. \nI can't read Tim Cook 's mind. But if I were the CEO of Apple , my vision would be just that — it would, literally, be my vision. \nMany people see the future of technology as a world where we are surrounded by technological devices, overwhelmed with wearables, robots and holograms. But if I were Apple, I would want to cut through that noise and create a device designed so seamlessly that it fades to invisibility. \nLike a contact lens. \nThere are a ton of reasons why an iLens could fit with Apple's brand. Apple is all about supporting individual creativity and advancing the beauty in the world — and the eye is not only unique to each person , but widely considered one of our most alluring and evocative features. Many applications of creativity are ways to express how the way we see the world differs from everyone else. \nA smart contact lens could combine many of Apple's current initiatives as well, such as augmented reality, content, photography , navigation and health monitoring . One can imagine them pairing nicely with bone conduction or AirPod audio. \nThere's no indication that any technology close to this will become available in the next 20 years, nor is there evidence that Apple is working at it. \nThe wafers and prisms used in augmented reality are still clunky, for the most part. And while the iPhone X and Apple Watch have made strides toward more voice, face, and gesture-based controls, eye-tracking and eye-driven interfaces are still in the nascent stages of development. \nWhile contact lenses have become much more comfortable over time, some people do still find them uncomfortable and invasive, and the regulatory process for a contact lens would be unprecedented for a company like Apple. \nStill, there are some cool precursors on the horizon. Foldable displays made of very thin glass are already a possibility, and most big technology companies are likely working on augmented reality glasses or headsets. Contact lenses with glucose monitoring and LED displays have already been created by researchers . \nThe idea of smart contact lenses has been the stuff of sci-fi for years, and at least a couple big technology companies have filed patents on ideas, with little visible impact. But if I were to bet on a company to do it well and wow us with the unexpected, I think I would bet on Apple. ", "external_links": [], "published": "2018-01-27T01:56:00.000+02:00", "crawled": "2018-01-27T02:08:02.014+02:00", "highlightTitle": ""}