{"organizations": [], "uuid": "353b131139a757a56ff61c7eef468c51d29b3da8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222129433&w=1200&r=LYNXMPEE0E0Q4", "site_section": "https://www.reuters.com/news/entertainment/arts", "section_title": "Arts - Entertainment | Reuters.com", "url": "https://www.reuters.com/article/us-art-nazis-swiss/swiss-museum-revisits-demand-for-nazi-era-art-return-after-2008-denial-idUSKBN1F41FP", "country": "US", "domain_rank": 408, "title": "Swiss museum revisits demand for Nazi-era art return after 2008 denial", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.936, "site_type": "news", "published": "2018-01-15T20:00:00.000+02:00", "replies_count": 0, "uuid": "353b131139a757a56ff61c7eef468c51d29b3da8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-art-nazis-swiss/swiss-museum-revisits-demand-for-nazi-era-art-return-after-2008-denial-idUSKBN1F41FP", "ord_in_thread": 0, "title": "Swiss museum revisits demand for Nazi-era art return after 2008 denial", "locations": [], "entities": {"persons": [{"name": "glaser", "sentiment": "none"}, {"name": "josef helfenstein", "sentiment": "none"}, {"name": "madonna", "sentiment": "none"}, {"name": "valerie sattler", "sentiment": "none"}, {"name": "curt glaser", "sentiment": "none"}], "locations": [{"name": "switzerland", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "basel art museum", "sentiment": "none"}, {"name": "basel", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "basel art museum", "sentiment": "none"}, {"name": "edvard munch", "sentiment": "none"}, {"name": "nazis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Switzerland is again at the center of a dispute over a Nazi-era art trove as the Basel Art Museum reconsiders demands it return a Jewish art historian’s collection to descendants.\nIt rejected their restitution bid in 2008.\nThe museum owns 120 drawings and prints, including a “Madonna” lithograph from Edvard Munch potentially worth millions of dollars, that belonged to Curt Glaser.\nGlaser auctioned the works in 1933 after losing his job leading the Prussian State Art Library in Berlin and being evicted from his home in the first wave of Nazi anti-Semitic laws.\nBasel Art Museum director Josef Helfenstein has called up a task force after Glaser’s heirs demanded the case be re-opened, citing unearthed documents they say underscore their claims.\n“We hope it won’t be put on the backburner, so everybody forgets about it again,” said Valerie Sattler, a great niece of Glaser.\nBasel may announce a meeting with the family and its lawyer as early as this week, a museum spokeswoman said on Monday.\nScrutiny of Jewish-owned art sold for low prices or stolen by the Nazis is nothing new in Switzerland.\nSo-called “degenerate art” amassed by the Nazis’ art dealer, Hildebrand Gurlitt, and given to a Bern museum in 2014 have been on display since November.\nFor decades, Sattler’s family in the United States, Brazil and Germany has petitioned museums and private owners around the world to return art Glaser sold before fleeing Germany.\nSome including Amsterdam’s Rijksmuseum and Cologne’s Ludwig Museum have cooperated.\nLast month, the 2.8 million pound ($3.85 million) sale of Bartholomaeus Spranger’s 16th century “Mercury carrying Psyche to Mount Olympus” at Christie’s in London concluded a deal with a private owner in Germany.\nBut they have faced rejection, too, including in Basel.\nTen years ago, Basel officials wrote the museum had “absolutely no evidence” the art belonged to Glaser and that it paid “period-typical” prices.\nGlaser’s heirs now cite June 1933 Basel Art Commission meeting minutes describing works “from the Glaser auction”, indicating the museum knew the source. The minutes, dug out by Swiss state broadcaster SRG, also describe a “good opportunity” “at cheap prices”.\nMuseum spokeswoman Karen Gerig said the task force aims to understand how Basel arrived at its conclusions a decade ago. It will make a recommendation to the city, owner of the art.\nMORAL SITUATION “We have in mind the whole moral situation, to try to figure out ... why this auction happened and when he (Glaser) decided to sell,” Gerig said.\nFelix Uhlmann, president of the Basel museum’s art commission, said a decision could take six months to accommodate meetings with the family, gathering any new evidence and scrutinizing how museums in Germany, the Netherlands and Britain handled similar claims involving Glaser’s collection.\n“On the outcome, it’s really an open process,” Uhlmann said in a phone interview on Monday. “Otherwise, we would not do this.”\nMuch rides on the case, given Glaser’s heirs dispute ownership of valuable works elsewhere in Switzerland.\nIn 1941, Glaser sold Munch’s “Music on Karl Johan Street” to the Zurich Museum for Modern Art for 12,000 francs. The family contends the transaction was forced as a cash-strapped Glaser fled Europe for the United States, where he died in 1943.\nSattler, a U.S.-born cellist with the Nuremberg Symphony in the city where Adolf Hitler once staged massive Nazi party rallies, said her family was treated shabbily by Basel in 2008.\nOfficials called them “supposed heirs” and “distant relatives” and argued Germany’s Jews began unloading art at fire-sale prices only after 1938 -- long after the Glaser auction.\n“It’s impossible to deny he was a victim,” Sattler said.\nReporting by John Miller Editing by Jeremy Gaunt\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T20:00:00.000+02:00", "crawled": "2018-01-15T22:21:33.010+02:00", "highlightTitle": ""}