{"organizations": [], "uuid": "348e31b7851abe83916fb5572bffe3fab93d6118", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104966426-GettyImages-907026568.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trump-accused-russia-of-helping-north-korea-putin-would-have-his-reasons.html", "country": "US", "domain_rank": 767, "title": "Trump accused Russia of helping North Korea. Putin would have his reasons", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-26T08:09:00.000+02:00", "replies_count": 0, "uuid": "348e31b7851abe83916fb5572bffe3fab93d6118"}, "author": "Andrew Wong", "url": "https://www.cnbc.com/2018/01/26/trump-accused-russia-of-helping-north-korea-putin-would-have-his-reasons.html", "ord_in_thread": 0, "title": "Trump accused Russia of helping North Korea. Putin would have his reasons", "locations": [], "entities": {"persons": [{"name": "putin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "neutral"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "mikhail klimentyev", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "tass", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump made major news last week when he accused Russia of helping North Korea evade international sanctions.\nReports that Russian tankers helped deliver fuel to the pariah state underscore that contention, but that occurrence alone doesn't explain why the Kremlin would actively undermine the international community.\nThe reason, experts told CNBC, could be that Russian President Vladimir Putin is working several angles, including sowing chaos to distract the U.S. and creating an opening for Moscow to burnish its reputation.\nFor its part, Russia's foreign ministry has formally denied any participation in helping Pyongyang skirt sanctions. Still, foreign policy specialists said the Kremlin stands to benefit from tensions surrounding North Korea.\nPutin's gamble By enabling Kim Jong Un's international belligerence, Russia could alleviate some of the international scrutiny on Moscow's own activities, analysts said. The country is currently still facing sanctions from the international community over its activities in Georgia and Ukraine .\n\"Putin has his own interest in helping North Korea,\" said Gustav Gressel, a senior policy fellow at the Wider Europe Program at the European Council on Foreign Relations. \"Moscow's interference also serves as a diversion to take the focus away from the country's own activities in Europe.\"\nshow chapters Trump accuses Russia of helping North Korea evade sanctions: Reuters 4:06 PM ET Wed, 17 Jan 2018 | 00:57 Experts also said the Kremlin's goal is to split the U.S.'s attentions and military capabilities between different theaters — stretching Washington's budget in the process. A study out of Brown University reported that the U.S. has spent $5.6 billion on war and conflicts since 2001.\nRebranding Russia The Kremlin's interference could additionally be seen as a rebranding in the international community, according to an expert from Stratfor, a geopolitical intelligence firm.\n\"Historically, Russia has always been ostracized within the international community,\" said Rodger Baker, Stratfor's vice president of global analysis.\nSo, the rising tensions between North Korea and the international community at large could serve as an opportunity for Putin to redefine Russia's role in international affairs. By offering to become an arbitrator for peace talks and calling for de-escalation, Russia is hoping to build credibility as a conflict mediator and global voice for good, Baker explained.\nFurthermore, if Moscow is integral to any progress in dialogue between Pyongyang and the international community, then that gives Putin some leverage against sanctions, foreign policy experts said.\n\"Once Russia is accepted as the mediator for peace talks between the U.S. and North Korea, they will be able to bargain for their own sanctions,\" Baker said.\nStill, the Stratfor expert said he doesn't think North Korea tensions will ease in the near future.\n\"I think the situation is only going to escalate,\" Baker said. \"Kim Jong Un sees his nuclear weapons as being fundamental to the regime's self preservation and is never going to give them up — putting any progress on peace talks on a standstill.\"", "external_links": [], "published": "2018-01-26T08:09:00.000+02:00", "crawled": "2018-01-26T08:09:36.004+02:00", "highlightTitle": ""}