{"organizations": [], "uuid": "7c4918b5288de59cdb9af239f4d61641da7c7783", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-wingstop-inc-releases-preliminary-fiscal-fourth-quarter-2017-sales-results.html", "country": "US", "domain_rank": 767, "title": "Wingstop Inc. Releases Preliminary Fiscal Fourth Quarter 2017 Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "7c4918b5288de59cdb9af239f4d61641da7c7783"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-wingstop-inc-releases-preliminary-fiscal-fourth-quarter-2017-sales-results.html", "ord_in_thread": 0, "title": "Wingstop Inc. Releases Preliminary Fiscal Fourth Quarter 2017 Sales Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "wingstop inc.", "sentiment": "negative"}, {"name": "wingstop inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Wingstop Inc. (“Wingstop” or the “Company”) (NASDAQ:WING) today released preliminary unaudited sales results for the fiscal fourth quarter and full year 2017 periods ended December 30, 2017.\nHighlights for the fiscal fourth quarter 2017 as compared to the fiscal fourth quarter 2016 (on a 13-week basis):\nSystem-wide restaurant count increased 13.5% to 1,133 worldwide locations with 45 net openings Domestic same store sales increased 5.2% Company-owned restaurant same store sales increased 4.6% System-wide sales increased 15.6% to approximately $285 million\nHighlights for the fiscal year 2017 as compared to the fiscal year 2016 (on a 52-week basis):\n135 net openings in fiscal year 2017 Domestic same store sales increased 2.6% Company-owned restaurant same store sales increased 1.6% System-wide sales increased 14.0% to approximately $1.1 billion\nNote fiscal year 2016 contained an extra week in the fourth quarter, resulting in incremental revenue in the comparable periods, which had 14- and 53-weeks, respectively.\nAs of December 30, 2017, there were 1,133 Wingstop restaurants system-wide. This included 1,027 restaurants in the United States, of which 1,004 were franchised restaurants and 23 were company-owned. Our international footprint consisted of 106 franchised restaurants across eight countries.\nChairman and Chief Executive Officer Charlie Morrison stated, “Overcoming the challenges that we faced in 2017, including record wing inflation over 40% and post-election consumer sentiment is a testament of the strength of our brand and business model. Despite those challenges, we achieved 13.5% unit growth, recorded our 14th consecutive year of same store sales growth and ended the year with fourth quarter same store sales growth of 5.2%, resulting in 2017 system-wide sales of $1.1 billion. The resilience of our team members and franchisees helped make these strong results possible.” Morrison continued, “Our achievements in 2017 reflect our focus on four key long-term growth strategies: national advertising, digital expansion, delivery and international development which we believe will position us to achieve our vision of becoming a top 10 global restaurant brand.”\nICR Conference Participation\nBeginning today, Monday, January 8 th , Wingstop will be participating at the 20th Annual ICR Conference at the Grande Lakes Hotel & Resort in Orlando, FL.\nThe Company will host investor meetings on Monday, January 8th and Tuesday, January 9th as well as webcast its presentation beginning at 3:00 PM ET on Tuesday, January 9th. The presentation will be webcast live and later archived on the investor relations section of Wingstop's corporate website at ir.wingstop.com under the 'News & Events' section.\nThe following definitions apply to these terms as used in this release:\nSame store sales reflects the change in year-over-year sales for the comparable restaurant base. We define the comparable restaurant base to include those restaurants open for at least 52 full weeks. This measure highlights the performance of existing restaurants, while excluding the impact of new restaurant openings and closures.\nSystem-wide sales represents net sales for all of our company-owned and franchised restaurants, as reported by franchisees.\nAbout Wingstop\nFounded in 1994 and headquartered in Dallas, Texas, Wingstop Inc. (NASDAQ:WING) operates and franchises more than 1,100 restaurants across the United States, Mexico, Singapore, the Philippines, Indonesia, the United Arab Emirates, Malaysia, Saudi Arabia, and Colombia. The Wing Experts’ menu features classic and boneless wings with 11 bold, distinctive flavors including Original Hot, Cajun, Atomic, Mild, Teriyaki, Lemon Pepper, Hawaiian, Garlic Parmesan, Hickory Smoked BBQ, Louisiana Rub, and Mango Habanero. Wingstop’s wings are always cooked to order, hand-sauced and tossed and served with a variety of house-made sides including fresh-cut, seasoned fries. Having grown its domestic same store sales for 13 consecutive years, the Company has been ranked #3 on the “Top 100 Fastest Growing Restaurant Chains” by Nation’s Restaurant News (2016), #7 on the “Top 40 Fast Casual Chains” by Restaurant Business (2016), and was named “Best Franchise Deal in North America” by QSR magazine (2014). Wingstop was ranked #88 on Fortune ’s 100 Best Medium Workplaces list in October 2016. For more information visit www.wingstop.com or www.wingstopfranchise.com . Follow us on facebook.com/Wingstop and Twitter @Wingstop.\nMedia Contact\nBrian Bell\n972-707-3956\nbbell@wingstop.com\nInvestor Contact\nRaphael Gross\n203-682-8253\nraphael.gross@icrinc.com\nForward-looking Information\nCertain statements contained in this news release, as well as other information provided from time to time by Wingstop Inc. or its employees, may contain forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. You can identify forward-looking statements by the fact that they do not relate strictly to historical or current facts. These statements may include words such as “guidance,” “anticipate,” “estimate,” “expect,” “forecast,” “project,” “plan,” “intend,” “believe,” “confident,” “may,” “should,” “can have,” “likely,” “future” and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events. Examples of forward-looking statements in this news release include our anticipated potential restaurant expansion opportunities and progress toward our goal of becoming a top 10 global restaurant brand.\nAny such forward-looking statements are not guarantees of performance or results, and involve risks, uncertainties (some of which are beyond the Company’s control) and assumptions. Although we believe any forward-looking statements are based on reasonable assumptions, you should be aware that many factors could affect our actual financial results and cause them to differ materially from those anticipated in any forward-looking statements. Further, we have not yet completed closing procedures for fiscal fourth quarter or full year 2017, and our independent registered public accounting firm has not yet reviewed or audited the results. Accordingly, these preliminary results are subject to change pending finalization, and actual results could differ materially as we finalize such results. Please refer to the risk factors discussed in our Form 10-K for the year ended December 31, 2016, which can be found at the SEC’s website www.sec.gov . The discussion of these risks is specifically incorporated by reference into this news release.\nAny forward-looking statement made by Wingstop Inc. in this press release speaks only as of the date on which it is made. We undertake no obligation to update any forward looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\nSource:Wingstop Restaurants, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=COSdvNp9x0CgB3YnB0LDO4Jm_BXefsM__6DcrrcOxfV9S0cJsJBTzQVX6UNDBeenU4WuP5MYRAocpc4CxQYnd8VgNSmLyb_jYrk5Ni9k2PI=", "https://www.globenewswire.com/Tracker?data=HnhLMhb_DYIoGslpWprUazsiNedLjePMBWXeiS21B9Ez2a8yirYQujpIZiUnhCLFGgwN-MlYhKKJH1p8jNRw35hJc32IXMn7ZN11QUzRBTA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0c46df32-a921-4d86-a9f0-da35ed272bf8", "https://www.globenewswire.com/Tracker?data=mPsL6Pif3gLxnpxxxfB0TH0zX3jHYhz2gqLxHTcqaBtBqKVL6EoClg6iYURDhLVTIfbMZ5VagcAsIlA63_JZv-N0W3P0pkZBD9ri_ZIZJtM=", "https://www.globenewswire.com/Tracker?data=mPsL6Pif3gLxnpxxxfB0TMiCXik6333kk0Gotr99MwcpuAuja_-kWi35gi3J9EEvR03hTgyLWWQF1XdLzKDNUg==", "https://www.globenewswire.com/Tracker?data=8KRjeb71LraBZPu8XlviNotkd6SlZczfjLx2swCw-CZ8aENV4sYPL0N_whec-S2GgZ9E6lIEaH_e9xgCEVp5uSPT9dInLzfH6M482F7RwaY="], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:12:05.016+02:00", "highlightTitle": ""}