{"organizations": [], "uuid": "9efbe3cb625a8354ed689536ecc6b1f1a2410aad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874373-RTX3KQPE.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-news-bill-clears-senate-hurdle.html", "country": "US", "domain_rank": 767, "title": "Government shutdown news: Bill clears Senate hurdle", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-22T19:42:00.000+02:00", "replies_count": 0, "uuid": "9efbe3cb625a8354ed689536ecc6b1f1a2410aad"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-news-bill-clears-senate-hurdle.html", "ord_in_thread": 0, "title": "Government shutdown news: Bill clears Senate hurdle", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "negative"}, {"name": "bill", "sentiment": "negative"}, {"name": "james lawler duggan", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "reuters senate", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "daca", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 Hours Ago | 00:35 \nA bill to reopen the federal government and fund its operations until Feb. 8 cleared a major procedural hurdle in the Senate on Monday, setting the stage for a quick turnaround to the House, and the prospect that the government shutdown could be over as soon as Monday afternoon. \nThe final cloture was 81 yeas, to 18 nays. The difference was made by moderate Democrats who had previously voted against a spending bill, but flipped on Monday, three days into the government shutdown. \nSenate Majority Leader Mitch McConnell on Monday morning said he intends to bring immigration issues up for debate before Feb. 8. Later, Senate Minority Leader Chuck Schumer confirmed an agreement to reopen the government and tackle immigration within three weeks. \n\"We will vote today to reopen the government to continue negotiating a global agreement [on immigration reform] with the commitment that if an agreement isn't reached by February the 8th, the Senate will immediately proceed to consideration of legislation dealing with DACA,\" Schumer said on the Senate floor. \"We expect that a bipartisan bill on DACA will receive fair consideration and an up or down vote on the floor.\" \nThe next step in reopening the government would be a final Senate vote on the February 8 spending bill, which would require only a simple majority. After that, the bill would head to the House, where a vote had yet to be scheduled -- but was considered likely to occur -- later on Monday afternoon. After that, the bill would go to President Donald Trump's desk for signature. \nTrump has been largely absent from negotiations for the past three days, speaking to congressional Republicans by phone, but refusing to speak with Democrats. An email sent to a White House aide Monday seeking comment on the Senate vote was returned with an automatic out-of-office reply. \n\"Unfortunately, I am out of the office today because congressional Democrats are holding government funding—including funding for our troops and other national security priorities—hostage to an unrelated immigration debate,\" read the email. \nHundreds of thousands of federal employees also remained on furlough Monday afternoon, even as prospects improved significantly that they would return to work on Tuesday. Christina Wilkie Political Reporter for CNBC.com Playing", "external_links": [], "published": "2018-01-22T19:42:00.000+02:00", "crawled": "2018-01-22T19:45:41.004+02:00", "highlightTitle": ""}