{"organizations": [], "uuid": "53c4586c1aa4d69ddf31f040dfd6ff8c971452ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/03/gettyimages-506028328.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/spotify-ipo-crypto-crash-carillion-ceo-daily-for-january-13-2018/", "country": "US", "domain_rank": 1196, "title": "Spotify IPO, Crypto Crash, Carillion: CEO Daily for January 16, 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-16T08:31:00.000+02:00", "replies_count": 0, "uuid": "53c4586c1aa4d69ddf31f040dfd6ff8c971452ad"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/16/spotify-ipo-crypto-crash-carillion-ceo-daily-for-january-13-2018/", "ord_in_thread": 0, "title": "Spotify IPO, Crypto Crash, Carillion: CEO Daily for January 16, 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "huawei cord", "sentiment": "negative"}, {"name": "spotify ipo", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "fortune top news  at&t", "sentiment": "neutral"}, {"name": "huawei technologies", "sentiment": "none"}, {"name": "reuters  carillion collapses  carillion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china mobile", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top News \nAT&T Urged to Cut the Huawei Cord \nU.S. lawmakers want AT&T to sever its commercial ties to Chinese phone maker Huawei Technologies, and they oppose plans by telecom operator China Mobile to enter the U.S. market due to national security concerns, Reuters reports, citing two congressional aides. The pushback comes as the Trump administration takes a hard line against Beijing’s efforts to gain access to U.S. industry. Reuters \nCarillion Collapses \nCarillion on Monday announced that it would go into compulsory liquidation after the British construction giant’s last-ditch efforts to broker a deal with the U.K. government and its lenders failed over the weekend. The British government assured employees working on the company’s public-sector contracts that they’d be paid, but no such promises were made to workers on Carillion’s contracts in the private sector. Financial Times \nOil Is Up, Up, Up \nBrent crude oil prices held near $70 a barrel this morning, up almost 15% since early December to a level not seen since the market’s dramatic slump in 2014. What’s behind the rise? The ongoing efforts by OPEC and Russia to withhold production (the cuts are set to last through 2018) and healthy demand. Reuters \nA Convenient Friendship? \nThe Wall Street Journal dropped a bombshell story on Monday, reporting that U.S. counterintelligence officials warned Jared Kushner last year that Wendi Deng Murdoch could be using her close friendship with Kushner and wife Ivanka Trump to advance interests of the Chinese government. A spokesperson for Murdoch said the Chinese-American businesswoman (and ex of Rupert Murdoch) has no knowledge of the FBI’s concerns or of the Chinese matters in question. Wall Street Journal Around the Water Cooler \nAnother False Alarm \nA Japanese public broadcaster issued a false alarm about a North Korean missile launch today. The error followed the false emergency alert that prompted mass panic in Hawaii this past weekend, but in this case, the mistake was corrected in a matter of minutes. In Hawaii, it took 38 harrowing minutes to confirm the false alarm. Reuters \nCrypto Crash \nThe value of cryptocurrencies Bitcoin, Ethereum, and Ripple plummeted this morning, dropping 15%, 21%, and 29%, respectively. The dips seem to be tied to a report that China—which banned cryptocurrency exchanges last year—is taking more action against other online and app-based services that offer exchange-like functionality. Fortune \nNo More Touch-Ups \nCVS Health is aiming to eliminate the use of “materially altered” imagery for its beauty items by 2020. The move is seen as appealing to female customers and as an attempt to bolster the company’s beauty products business, which generated 4.2% ($3.4 billion) of CVS’s retail sales in 2016, a decrease from the previous year. Fortune \nMr. Popular \nMassachusetts voted overwhelmingly against Donald Trump in the 2016 election, and his unfavorables are even higher there now. Those factors should be dooming the re-election prospects of Republican Gov. Charlie Baker, but just the opposite is happening. Not only is Baker the most popular politician in the solidly blue state, he’s the most popular governor in the nation. Politico \nThis edition of CEO Daily was edited by Claire Zillman . Find previous editions here , and sign up for other Fortune newsletters here . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T08:31:00.000+02:00", "crawled": "2018-01-16T16:15:19.030+02:00", "highlightTitle": ""}