{"organizations": [], "uuid": "2ffe5dd6f65388af05c312116a460ed65e61f876", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-main-street-announces-ceo-succession-plan.html", "country": "US", "domain_rank": 767, "title": "Main Street Announces CEO Succession Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:00:00.000+02:00", "replies_count": 0, "uuid": "2ffe5dd6f65388af05c312116a460ed65e61f876"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-main-street-announces-ceo-succession-plan.html", "ord_in_thread": 0, "title": "Main Street Announces CEO Succession Plan", "locations": [], "entities": {"persons": [{"name": "foster", "sentiment": "none"}, {"name": "dwayne", "sentiment": "none"}, {"name": "vincent d. foster", "sentiment": "none"}, {"name": "hyzak", "sentiment": "none"}, {"name": "dwayne l. hyzak", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "main street", "sentiment": "none"}], "organizations": [{"name": "main street capital corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 3, 2018 /PRNewswire/ -- Main Street Capital Corporation (NYSE: MAIN) (\"Main Street\") is pleased to announce that Vincent D. Foster, co-founder of Main Street, and who has served as its Chairman and Chief Executive Officer (\"CEO\") since its 2007 initial public offering, will transition the role and responsibility of CEO to Dwayne L. Hyzak, with this transition presently planned to occur in the fourth quarter of 2018. Integral to this plan is the continuation of Mr. Foster at Main Street as its Executive Chairman. In this capacity, he will work closely with Mr. Hyzak as CEO. This transition is the cornerstone of the board of directors' long-term succession plan for the company.\nMr. Hyzak also joined the Main Street board of directors, effective immediately, bringing the size of the board to ten members.\n\"Dwayne is uniquely qualified to assume the role as CEO of Main Street,\" Mr. Foster said. \"He has been affiliated with us since 2000 when he joined a Main Street portfolio company in an acquisition and integration role, and went on to join Main Street's investment team in 2002. Dwayne served as our CFO from 2011 through 2014 while also leading one of our largest lower middle market investment teams. He has a tremendous work ethic and demonstrates a real passion in leading the technical training and professional development of our investment professionals. As Chief Operating Officer since 2014 and President since 2015, Dwayne has successfully led our lower middle market investment division, our investment professional recruiting efforts and investor relations initiatives. We are fortunate to have a leader with Dwayne's level of energy and personal integrity ascend to our CEO position later this year.\"\nABOUT MAIN STREET CAPITAL CORPORATION\nMain Street ( www.mainstcapital.com ) is a principal investment firm that primarily provides long-term debt and equity capital to lower middle market companies and debt capital to middle market companies. Main Street's portfolio investments are typically made to support management buyouts, recapitalizations, growth financings, refinancings and acquisitions of companies that operate in diverse industry sectors. Main Street seeks to partner with entrepreneurs, business owners and management teams and generally provides \"one stop\" financing alternatives within its lower middle market portfolio. Main Street's lower middle market companies generally have annual revenues between $10 million and $150 million. Main Street's middle market debt investments are made in businesses that are generally larger in size than its lower middle market portfolio companies.\nMain Street's common stock trades on the New York Stock Exchange (\"NYSE\") under the symbol \"MAIN.\" In addition, Main Street has outstanding 6.125% Notes due 2023, which trade on the NYSE under the symbol \"MSCA.\"\nFORWARD-LOOKING STATEMENTS\nThis press release may contain certain forward-looking statements, including but not limited to executive succession plans. Any such statements other than statements of historical fact are likely to be affected by other unknowable future events and conditions, including elements of the future that are or are not under Main Street's control, and that Main Street may or may not have considered; accordingly, such statements cannot be guarantees or assurances of any aspect of future performance. Actual performance and results could vary materially from these estimates and projections of the future. Such statements speak only as of the time when made and are based on information available to Main Street as of the date hereof and are qualified in their entirety by this cautionary statement. Main Street assumes no obligation to revise or update any such statement now or in the future.\nContacts:\nMain Street Capital Corporation\nDwayne L. Hyzak, President & COO, dhyzak@mainstcapital.com\nBrent D. Smith, CFO, bsmith@mainstcapital.com\n713-350-6000\nDennard Lascar Investor Relations\nKen Dennard | ken@dennardlascar.com\nMark Roberson | mroberson@dennardlascar.com\n713-529-6600\nView original content: http://www.prnewswire.com/news-releases/main-street-announces-ceo-succession-plan-300577138.html\nSOURCE Main Street Capital Corporation", "external_links": ["http://www.prnewswire.com/news-releases/main-street-announces-ceo-succession-plan-300577138.html", "http://www.mainstcapital.com/"], "published": "2018-01-04T01:00:00.000+02:00", "crawled": "2018-01-04T00:25:00.006+02:00", "highlightTitle": ""}