{"organizations": [], "uuid": "08ef0db1864735e0f2a02a2c89fb6c4fa96a06d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-match-group-appoints-ariel-charytan-chief-executive-officer-of-okcupid.html", "country": "US", "domain_rank": 767, "title": "Match Group Appoints Ariel Charytan Chief Executive Officer of OkCupid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-29T17:00:00.000+02:00", "replies_count": 0, "uuid": "08ef0db1864735e0f2a02a2c89fb6c4fa96a06d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-match-group-appoints-ariel-charytan-chief-executive-officer-of-okcupid.html", "ord_in_thread": 0, "title": "Match Group Appoints Ariel Charytan Chief Executive Officer of OkCupid", "locations": [], "entities": {"persons": [{"name": "ariel charytan", "sentiment": "negative"}, {"name": "charytan", "sentiment": "none"}, {"name": "ariel", "sentiment": "none"}, {"name": "elie seidman", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "match group appoints ariel charytan", "sentiment": "negative"}, {"name": "match group", "sentiment": "negative"}, {"name": "match group americas", "sentiment": "none"}, {"name": "tripadvisor", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 29, 2018 /PRNewswire/ -- Match Group (NASDAQ: MTCH) announced today that Ariel Charytan has been appointed Chief Executive Officer of OkCupid, effective immediately. Charytan succeeds Elie Seidman who was recently named Chief Executive Officer of Tinder.\nA respected leader and entrepreneur with more than two decades of experience developing and innovating consumer brands, Charytan most recently served as Senior Vice President at Audible, an Amazon company. Prior to Amazon, he was a co-founder and Chief Product Officer at Oyster.com , which was acquired by TripAdvisor in 2013.\n\"It is an incredibly exciting time for us to welcome Ariel to OkCupid, a hallmark brand making great strides both from a product and brand perspective,\" says Amarnath Thombre, CEO of Match Group Americas. \"Ariel is one of those rare individuals who has a rich entrepreneurial track record as well as a disciplined approach to execution and management, making him a perfect fit for OkCupid.\"\n\"OkCupid provides a truly unique user experience based on helping people connect on what really matters,\" says Charytan. \"These principles resonate now more than ever, so it's an incredibly exciting time to be joining the team.\"\nAbout Ariel:\nAriel Charytan joins OkCupid from Audible, an Amazon company where he served as SVP. A veteran company founder, Mr. Charytan has spent his career building and fostering media, CRM, online travel and telecom businesses. Previously he was the co-founder and CPO of Oyster.com , an online hotel review and price comparison site. Oyster was financed by Bain Capital Ventures and Scripps, and acquired by TripAdvisor (TRIP). He was the co-founder of and COO of Epana, a telecom and money remittance business he grew from its founding to more than $200M a year in revenue.\nAbout OkCupid\nOkCupid knows that you deserve what dating does: better. That's why OkCupid shows who you are beyond just a photo, allowing you to share your stories and find people as individual as you are. One of the most recognized dating websites and apps in the world, OkCupid uses a high-tech algorithm to connect people based on the deeper things, like beliefs and interests. Over 57,000,000 daters have used OkCupid since it was founded by in 2004. Acquired by Match Group (MTCH, NASDAQ) in 2011, the company is headquartered in New York City. For more information, visit www.okcupid.com or follow @okcupid on Facebook , Twitter and Instagram .\nAbout Match Group\nMatch group (NASDAQ: MTCH) is the world's leading provider of dating products. We operate a portfolio of brands, including, Tinder, Match, PlentyOfFish, OkCupid, OurTime, Meetic, and Pairs each designed to increase our users' likelihood of finding a romantic connection. Through our portfolio of trusted brands, we provide tailored products to meet the varying preferences of our users. We currently offer our dating products in 42 languages across more than 190 countries.\nView original content: http://www.prnewswire.com/news-releases/match-group-appoints-ariel-charytan-chief-executive-officer-of-okcupid-300589211.html\nSOURCE Match Group", "external_links": ["http://www.okcupid.com/", "https://twitter.com/okcupid", "http://www.prnewswire.com/news-releases/match-group-appoints-ariel-charytan-chief-executive-officer-of-okcupid-300589211.html", "https://www.instagram.com/okcupid/", "https://www.facebook.com/okcupid"], "published": "2018-01-29T17:00:00.000+02:00", "crawled": "2018-01-29T19:35:14.005+02:00", "highlightTitle": ""}