{"organizations": [], "uuid": "91a8a1a3cfd31f953fe40d5ae43d8377c8f94887", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220887064&w=1200&r=LYNXMPEE0916L", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-canada-wto/canada-takes-united-states-to-wto-in-wide-ranging-trade-complaint-idUSKBN1EZ1SE", "country": "US", "domain_rank": 408, "title": "Canada takes United States to WTO in complaint over trade remedies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:26:00.000+02:00", "replies_count": 0, "uuid": "91a8a1a3cfd31f953fe40d5ae43d8377c8f94887"}, "author": "", "url": "https://www.reuters.com/article/us-usa-canada-wto/canada-takes-united-states-to-wto-in-wide-ranging-trade-complaint-idUSKBN1EZ1SE", "ord_in_thread": 0, "title": "Canada takes United States to WTO in complaint over trade remedies", "locations": [], "entities": {"persons": [{"name": "tom miles", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "negative"}, {"name": "u.s. international trade commission", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "general agreement on tariffs and trade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - Canada has launched a wide-ranging trade complaint against the United States, the World Trade Organization said on Wednesday, in a dispute that Washington said would damage Canada’s own interests and play into China’s hands. \nCanada’s complaint, challenging Washington’s use of anti-dumping and anti-subsidy duties, was based on almost 200 examples of alleged U.S. wrongdoing, almost all of them concerning other trading partners, such as China, India, Brazil and the European Union. \n“Canada’s new request for consultations at the WTO is a broad and ill-advised attack on the U.S. trade remedies system,” U.S. Trade Representative Robert Lighthizer said in a statement. \n”Even if Canada succeeded on these groundless claims, other countries would primarily benefit, not Canada,“ he said. ”Canada’s complaint is bad for Canada.” \nThe 32-page complaint faulted technical details of the U.S. trade rule book, ranging from the treatment of export controls to the handling of split decisions at the six-member U.S. International Trade Commission. \nCanadian Foreign Minister Chrystia Freeland said the legal action was in response to the “unfair and unwarranted” U.S. duties against Canada’s softwood lumber producers and part of a “broader litigation” to defend forestry jobs. \n“We continue to engage our American counterparts to encourage them to come to a durable negotiated agreement on softwood lumber,” Freeland said in an emailed statement. \nCanada said U.S. procedures broke the WTO’s Anti-Dumping Agreement, the Agreement on Subsidies and Countervailing Measures, the General Agreement on Tariffs and Trade and the Understanding on Rules and Procedures Governing the Settlement of Disputes. \nAnti-dumping and countervailing duties - punitive tariffs to restrict imports that are unfairly priced or subsidized in order to beat the competition - are a core component of Washington’s trade arsenal, and frequently used to defend U.S. interests. \n\nSlideshow (2 Images) For U.S. President Donald Trump, who has espoused an “America First” trade policy and the unraveling of multi-party trade agreements, those levers for managing individual U.S. trade relationships appear even more important than before. \nUnder WTO rules, the United States has 60 days to try to settle the complaint, or Canada, which sends 75 percent of its goods exports to the United States, could ask the WTO to adjudicate. \nCHINA IMPORTS Lighthizer said Canada’s demands undermined confidence in its commitment to mutually beneficial trade, and would only damage its own interests if they were realized. \n“The flood of imports from China and other countries would negatively impact billions of dollars in Canadian exports to the United States, including nearly $9 billion in exports of steel and aluminum products and more than $2.5 billion in exports of wood and paper products,” he said. \nThe tariffs at the center of the complaint are allowed under WTO rules but they are subject to strict conditions. \nThe United States has been under fire for years about the way it calculates unfair pricing, or dumping. It has already lost a string of WTO disputes after its calculation methodology was ruled to be out of line with the WTO rule book. \nTrump has threatened to expand the use of punitive duties against China and has angered Beijing by refusing to accede to China’s demand to be treated as any other “market economy”. \nHe has also upset Canada by demanding major changes to the North American Free Trade Agreement, and by slapping punitive tariffs on Canadian softwood lumber exports, leading to a challenge at the WTO and NAFTA. \nTrade friction has also arisen over a dispute between U.S. planemaker Boeing Co ( BA.N ) and its Canadian rival Bombardier Inc ( BBDb.TO ), which faces a potential 300 percent duty on U.S. sales of its CSeries jets. \nReporting by Tom Miles, additional reporting by Andrea Hopkins in Ottawa and Tim Ahmann in Washington; Editing by Alison Williams and Phil Berlowitz\n ", "external_links": [], "published": "2018-01-10T19:26:00.000+02:00", "crawled": "2018-01-10T19:40:16.053+02:00", "highlightTitle": ""}