{"organizations": [], "uuid": "58d3e1ebf710b4cb9a54e6fa5db1c63616cee7fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sono-tek-announces-third-quarter-results-and-fourth-quarter-and-fiscal-year-guidance.html", "country": "US", "domain_rank": 767, "title": "Sono-Tek Announces Third Quarter Results and Fourth Quarter and Fiscal Year Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:55:00.000+02:00", "replies_count": 0, "uuid": "58d3e1ebf710b4cb9a54e6fa5db1c63616cee7fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sono-tek-announces-third-quarter-results-and-fourth-quarter-and-fiscal-year-guidance.html", "ord_in_thread": 0, "title": "Sono-Tek Announces Third Quarter Results and Fourth Quarter and Fiscal Year Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "guidance milton", "sentiment": "none"}], "organizations": [{"name": "sono-tek corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILTON, N.Y., Jan. 16, 2018 /PRNewswire/ -- Sono-Tek Corporation (OTCQX: SOTK) today announced sales of $2,982,000 for the three months ended November 30, 2017, compared to sales of $2,599,000 for the prior year period, an increase of $383,000 or 15%. The Company's third quarter sales level also increased over second quarter sales, as expected, and as communicated to shareholders in the Company's recent press releases. Based on current backlog, shipments and proposals, the Company is expecting another increase for the fourth quarter of its current fiscal year (December 2017 – February 2018) compared to last year.\nThe Company reported net income of $194,000 for the three months ended November 30, 2017, compared to net income of $62,000 for the prior year period. The improvement over the prior year period is due to increased revenue which resulted in higher gross profit, also, the Company's fixed overhead costs remained steady as revenue levels increased. The Company's third quarter net income was an increase when compared to the second quarter. The Company expects to see continued profitability in the fourth quarter and to achieve overall profitability for the current Fiscal Year.\nDr. Christopher L. Coccio, Sono-Tek's Chairman and CEO, stated that, \"This fiscal year has been one of increasing revenues and income, both compared to last fiscal year and to each preceding quarter. Last year we experienced a slowdown in orders as our customers seemed to take a \"wait and see\" attitude regarding the political and business climate in the US. Overseas customers also slowed down their purchases, perhaps affected by the US economic climate or forces in their own regions. All that seemed to turn around with the new year, as it became clear that deregulation and tax reform were major priorities here at home. Whatever the reason, our sales began to increase, and our income did as well. The organic growth has been gratifying, since we have focused on new product development for the past several years, and that has been adding to our top line.\"\nFor further information, contact Dr. Christopher L. Coccio, at 845-795-2020, or visit our website at www.sono-tek.com\nSono-Tek Corporation is the leading developer and manufacturer of liquid spray products based on its proprietary ultrasonic nozzle technology. Founded in 1975, the Company's products have long been recognized for their performance, quality, and reliability.\nThis earnings release contains forward looking statements regarding future events and the future performance of Sono-Tek Corporation that involve risks and uncertainties that could cause actual results to differ materially. These factors include, among other considerations, general global economic and business conditions; political, regulatory, competitive and technological developments affecting our operations or the demand for our products; timely development and market acceptance of new products; adequacy of financing; the continued accumulation of cash and marketable securities; stability in our geographic markets; capacity additions; the ability to enforce patents; maintenance of order backlog; consummation of order proposals; the ability to achieve increased sales volume at projected and targeted levels for the fourth quarter and current fiscal year and to maintain profitability. We refer you to documents that the company files with the Securities and Exchange Commission, which includes Form 10-K and Form 10-Qs containing additional important information.\nSono-Tek Corporation\nSelected Financial Data\nUnaudited\nNine Months Ended November 30,\nThree Months Ended November 30,\n2017\n2016\n2017\n2016\nNet Sales\n$8,169,000\n$7,150,000\n$2,982,000\n$2,599,000\nGross Profit\n$4,036,000\n$3,288,000\n$1,475,000\n$1,239,000\nIncome Before Taxes\n$357,000\n$40,000\n$235,000\n$62,000\nNet Income\n$265,000\n$28,000\n$194,000\n$62,000\nBasic Earnings Per Share\n$0.02\n$0.00\n$0.01\n$0.00\nDiluted Earnings Per Share\n$0.02\n$0.00\n$0.01\n$0.00\nWeighted Average Shares - Basic\n14,964,048\n14,961,076\n14,969,933\n14,961,076\nWeighted Average Shares - Diluted\n15,073,576\n15,015,370\n15,113,389\n15,038,794\nView original content: http://www.prnewswire.com/news-releases/sono-tek-announces-third-quarter-results-and-fourth-quarter-and-fiscal-year-guidance-300583156.html\nSOURCE Sono-Tek Corporation", "external_links": ["http://www.sono-tek.com/", "http://www.prnewswire.com/news-releases/sono-tek-announces-third-quarter-results-and-fourth-quarter-and-fiscal-year-guidance-300583156.html"], "published": "2018-01-16T17:55:00.000+02:00", "crawled": "2018-01-16T18:35:55.001+02:00", "highlightTitle": ""}