{"organizations": [], "uuid": "5817a9a4243286a1d812cac3888b285583c4280e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-falls-to-more-than-3-month-low-on-first-day-of-2018-idUSL8N1OX2F5", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar falls to more than 3-month low on first day of 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-03T00:21:00.000+02:00", "replies_count": 0, "uuid": "5817a9a4243286a1d812cac3888b285583c4280e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-falls-to-more-than-3-month-low-on-first-day-of-2018-idUSL8N1OX2F5", "ord_in_thread": 0, "title": "FOREX-Dollar falls to more than 3-month low on first day of 2018", "locations": [], "entities": {"persons": [{"name": "gertrude chavez-dreyfuss", "sentiment": "none"}, {"name": "omer esiner", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "commonwealth foreign exchange", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar pressured by doubts about Fed rate hike outlook * Euro rises as ECB seen normalizing rate policy * MiFID II introduction weighs on volumes (New throughout, updates prices, market activity, comments and table; new byline, changes dateline; previous LONDON) By Gertrude Chavez-Dreyfuss NEW YORK, Jan 2 (Reuters) - The dollar sank on Tuesday to its lowest in more than three months, weighed down on the first trading day of 2018 by market expectations of a slower pace of interest rate increases by the Federal Reserve amid a tepid U.S. inflation picture. The dollar's decline continued the momentum of 2017, the greenback's weakest annual performance in 14 years. \"Investors remain skeptical about the Fed's outlook for three additional interest rate increases this year, especially given the extremely benign inflation backdrop in the U.S.,\" said Omer Esiner, chief market analyst, at Commonwealth Foreign Exchange in Washington. The dollar's upside was also capped as many of the world's major central banks such as the Bank of England and European Central Bank are moving toward normalizing their own monetary policies. Trading volumes were thin. Some strategists said traders were wary of taking big positions ahead of Wednesday's scheduled introduction of the wide-ranging EU financial markets directive known as MiFID II, aimed at making European markets more transparent and providing better value for investors. The dollar index hit a 3-1/2-month trough of 91.751 and was last down 0.1 percent at 91.996. For 2017, the dollar index slid more than 9.8 percent, its weakest year since 2003. The euro has been on a tear especially since the second half of last year, on optimism over a brightening economic picture in the euro zone. In 2017, the single currency posted its strongest year against the dollar since 2003 as European economies strengthened and expectations grew that the ECB will wind down monetary stimulus. The euro added more gains to start the new year, climbing to a nearly four-month high of $1.2082. It was last up 0.2 percent at $1.2033. Euro zone manufacturers ended 2017 by ramping up activity at the fastest pace in more than two decades, a survey showed on Tuesday, and rising demand suggests they will start the new year on a high. The European Central Bank's Benoit Coeure said on the weekend he saw a \"reasonable chance\" the bank's bond purchases would not be extended beyond September. \"It's a combination of dollar weakness and euro strength. The euro strength is underpinned by some hawkish comments from the ECB's Coeure,\" said Commerzbank currency strategist Thu Lan Nguyen in Frankfurt.", "external_links": [], "published": "2018-01-03T00:21:00.000+02:00", "crawled": "2018-01-03T06:36:42.014+02:00", "highlightTitle": ""}