{"organizations": [], "uuid": "f3e99b085b7321555510f141840186914c302770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/01/103909125-GettyImages-487461725.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/facebook-news-feed-changes-not-doom-for-publishers-adam-mosseri.html", "country": "US", "domain_rank": 767, "title": "Facebook News Feed changes not doom for publishers: Adam Mosseri", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:40:00.000+02:00", "replies_count": 0, "uuid": "f3e99b085b7321555510f141840186914c302770"}, "author": "Michelle Castillo", "url": "https://www.cnbc.com/2018/01/16/facebook-news-feed-changes-not-doom-for-publishers-adam-mosseri.html", "ord_in_thread": 0, "title": "Facebook News Feed changes not doom for publishers: Adam Mosseri", "locations": [], "entities": {"persons": [{"name": "adam mosseri", "sentiment": "negative"}, {"name": "mosse", "sentiment": "none"}, {"name": "stratechery", "sentiment": "none"}, {"name": "mosseri", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook's latest algorithm change may not be as detrimental to publishers and companies as everybody thinks.\nFacebook's old NewsFeed algorithm, which was set in place in spring 2016, highlighted content and conversations among family and friends. However, this new tweak will place value on \"meaningful social interactions. \" Rather than spelling doom for publishers as many have suggested, this could actually mean more traffic to groups and official Pages from publishers and businesses, Facebook vice president of NewsFeed Adam Mosseri said in an interview with Stratechery .\n\"So if you and I had a back and forth conversation on a post from a Page, that would actually count as a meaningful social interaction,\" Mosseri said. \"So it's more about the interactions between people and less about just the consumption of content from friends.\"\nThe takeaway for publishers: The world isn't necessarily ending. Publisher posts that don't get any meaningful engagement won't appear as prominently in the News Feed. But posts that people actually comment and share could be favored more highly.\nMosseri says Facebook changed its algorithm not to fight \"fake news,\" but because the company was noticing more Page posts and videos being posted overall. It needed make sure this flood of content wasn't drowning out social interactions that Facebook was built upon. So the company is going to favor material that is shared and commented upon.\nThe owners of Facebook Pages were especially posting more content because they received financial benefits when people clicked on their content.\nVideo has also boomed on the platform, especially in India. Carrier wars caused the price of data to go down, so time spent watching video grew much faster than overall time on Facebook, Mosseri said.\n\"Video by nature is very passive,\" Mosseri said. \"So while you're watching a video on Facebook you don't tend to comment a lot, like a lot, or talk with your friends a lot, or read articles for that matter.\"\nFacebook has acknowledged the adjustments may lower engagement time on platform in the short term. Video watch time is also going down, which is driving the drop in time spent on the Facebook platform Mosseri added.\nHowever the company believes the NewsFeed shift will allow people to have more valuable and relevant conversations on the platform which will improve \"well-being,\" Mosseri said. Shorter video watch time will also free up users to read more stories and comment.\n\"So we hope that the time spent on Facebook, though overall it will go down, is time well-spent or time better spent,\" Mosseri said.", "external_links": ["https://www.nytimes.com/2018/01/11/business/media/facebook-news-feed-media.html", "https://stratechery.com/2018/an-interview-with-facebook-vice-president-of-news-feed-adam-mosseri/"], "published": "2018-01-16T21:40:00.000+02:00", "crawled": "2018-01-16T20:51:10.000+02:00", "highlightTitle": ""}