{"organizations": [], "uuid": "d678b3a249d9002664fbc5ac0125929aebd8e61b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-panasonic-names-jeffrey-d-werner-to-lead-corporate-government-affairs.html", "country": "US", "domain_rank": 767, "title": "Panasonic Names Jeffrey D. Werner to Lead Corporate & Government Affairs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:20:00.000+02:00", "replies_count": 0, "uuid": "d678b3a249d9002664fbc5ac0125929aebd8e61b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-panasonic-names-jeffrey-d-werner-to-lead-corporate-government-affairs.html", "ord_in_thread": 0, "title": "Panasonic Names Jeffrey D. Werner to Lead Corporate & Government Affairs", "locations": [], "entities": {"persons": [{"name": "jeffrey d. werner", "sentiment": "negative"}, {"name": "damien atkins", "sentiment": "none"}, {"name": "pete", "sentiment": "none"}, {"name": "peter m. fannon", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "pete fannon", "sentiment": "none"}, {"name": "werner", "sentiment": "none"}, {"name": "jeff werner", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "panasonic", "sentiment": "negative"}, {"name": "panasonic corporation", "sentiment": "negative"}, {"name": "daimler north america corporation", "sentiment": "none"}, {"name": "international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWARK, N.J., Jan. 25, 2018 /PRNewswire/ -- Panasonic Corporation of North America today announced that Jeffrey D. Werner will join the company as Vice President, Corporate and Government Affairs, from January 29. Mr. Werner comes to Panasonic from Daimler North America Corporation, where he served as General Manager, International and Public Policy, since 2007.\nMr. Werner will succeed Peter M. Fannon, who is retiring after having led the company's government and corporate relations since 1997.\n\"We are delighted to welcome Jeff Werner to Panasonic, where his expertise in government relations, including trade, investment and key public policy matters, as well as his automotive industry experience, will be especially helpful as the company continues its growth in B2B solutions,\" said Damien Atkins, Vice President and General Counsel, to whom Mr. Werner will report. \"As Jeff's transition begins, we want to express our gratitude to Pete Fannon for the two decades he devoted to representing Panasonic before the government, in industry organizations and in public forums. Pete has made incredible contributions to our company.\"\nPrior to joining Daimler, Mr. Werner served as executive director of the Transatlantic Business Dialogue and worked for the European-American Business Council. He holds an MS degree from The London School of Economics and graduated with a BA in Political Science from Hobart College.\n\"I am looking forward to joining Panasonic and supporting the company's great work such cutting-edge areas as connected and self-driving vehicles, smart highways, energy generation and storage, video and entertainment media,\" Mr. Werner said. \"There are so many challenges ahead in the arenas in which Panasonic works. It's a very exciting time, and I'm thrilled to become part of this global company's dynamic North American operations.\"\nMr. Werner will manage multiple activities in his new role including the government and public affairs office in Washington, DC, and related units at the company's Newark, NJ, headquarters.\nAbout Panasonic Corporation of North America\nNewark, NJ-based Panasonic Corporation of North America is a leading technology partner and integrator to businesses, government agencies and consumers across the region. The company is the principal North American subsidiary of Osaka, Japan-based Panasonic Corporation and leverages its strengths in Immersive Entertainment, Sustainable Energy, Automated Supply Chains and Connected Solutions to provide secure and resilient integrated solutions for B2B customers. Panasonic was highlighted in Forbes Magazine's Global 2000 ranking as one of the Top Ten Best Regarded Companies for 2017. The ranking is based on outstanding scores for trustworthiness, honesty with the public and superior performance of products and solutions Learn more about Panasonic's ideas and innovations at PanasonicMovesUs.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/panasonic-names-jeffrey-d-werner-to-lead-corporate--government-affairs-300588267.html\nSOURCE Panasonic Corporation of North America", "external_links": ["http://www.panasonicmovesus.com/", "http://www.prnewswire.com/news-releases/panasonic-names-jeffrey-d-werner-to-lead-corporate--government-affairs-300588267.html"], "published": "2018-01-25T18:20:00.000+02:00", "crawled": "2018-01-25T20:49:07.004+02:00", "highlightTitle": ""}