{"organizations": [], "uuid": "3420c0c912dc51bb34814e91d43a4c2cba9ee8eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-oil/oil-markets-cling-to-near-3-year-highs-on-tighter-u-s-market-idUSL4N1P616S", "country": "US", "domain_rank": 408, "title": "Oil markets cling to near 3-year highs on tighter U.S. market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.065, "site_type": "news", "published": "2018-01-11T09:47:00.000+02:00", "replies_count": 0, "uuid": "3420c0c912dc51bb34814e91d43a4c2cba9ee8eb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-oil/oil-markets-cling-to-near-3-year-highs-on-tighter-u-s-market-idUSL4N1P616S", "ord_in_thread": 0, "title": "Oil markets cling to near 3-year highs on tighter U.S. market", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "janua", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* US oil production posts surprise fall to 9.5 mln bpd\n* US crude stocks drop below 5 year average of 420 mln barrels\n* But US fuel inventories post rise amid ample supplies\n* Analysts warn oil markets may have overheated\nBy Henning Gloystein\nSINGAPORE, Jan 11 (Reuters) - Oil prices held near three-year highs on Thursday, supported by a surprise drop in U.S. production and lower crude inventories, although analysts increasingly warned of signs that fuel markets have overheated.\nU.S. West Texas Intermediate (WTI) crude futures were at $63.53 a barrel at 0144 GMT, 4 cents below their last settlement but still close to a December 2014 high of $63.67 per barrel reached the previous day.\nBrent crude futures were at $69.14 a barrel, 6 cents below their last finish. That was also close to the previous day’s high of $69.37 a barrel, which was the highest level since an intra-day spike in May 2015 and, before that, in December 2014.\nOil markets have generally been supported by a production cut led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia that started in January last year and is set to last through 2018.\nMore immediate price support came overnight from the United states, where crude inventories C-STK-T-EIA fell almost 5 million barrels in the week to January 5, to 419.5 million barrels.\nThat’s slightly below the five year average of just over 420 million barrels.\nU.S. production fell 290,000 barrels per day to 9.5 million bpd, the EIA said, foiling expectations of U.S. output breaking through 10 million bpd.\n“Supply disruptions and falling U.S. and global inventories have driven crude oil higher,” said Ole Hansen, head of commodity strategy at Saxo Bank in a note.\n“Such is the current mood that bullish news tends to get more attention than potentially bearish signals,” he added.\nBearish signals include a rise in fuel inventories as well as a fall in refined products profits in Asia, which are expected to hamper orders for new feedstock crude.\nU.S. gasoline stocks rose 4.1 million barrels, EIA data showed, more than expected, while Singapore average refinery profit margins DUB-SIN-REF have fallen below $6 per barrel this month, their lowest seasonal level in five years.\nSingapore average refinery profit margins DUB-SIN-REF have fallen below $6 per barrel this month, their lowest seasonal level in five years.\nAnd with the crude price up by more than 13 percent since early December, some analysts expect a downward price correction following the recent bull-run.\n“Markets are getting a bit fatigued, and a healthy correction could be on the cards,” said Stephen Innes, head of trading for Asia/Pacific at futures brokerage Oanda in Singapore.\nReporting by Henning Gloystein; editing by Richard Pullin\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T09:47:00.000+02:00", "crawled": "2018-01-11T12:21:03.000+02:00", "highlightTitle": ""}