{"organizations": [], "uuid": "3decee3f169be1f10e66757983a1eba5ed43a763", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956183-GettyImages-185040106.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/20/the-federal-government-has-shut-down-it-may-be-a-while-before-you-notice.html", "country": "US", "domain_rank": 767, "title": "The government has shut down. It may be a while before you notice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T11:30:00.000+02:00", "replies_count": 0, "uuid": "3decee3f169be1f10e66757983a1eba5ed43a763"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/the-federal-government-has-shut-down-it-may-be-a-while-before-you-notice.html", "ord_in_thread": 0, "title": "The government has shut down. It may be a while before you notice", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "senate pentagon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — The federal government ran out of funding at midnight, but you may not have noticed.\nIn fact, it could be several days before the full impact of the shutdown is fully felt by the public.\nGovernment agencies began the process of shutting down at midnight Friday after Congress failed to pass a spending bill to keep them operating . But not every government employee was sent home.\nMore from USA Today:\nNo immediate resolution to spending impasse after Trump, Schumer met on shutdown\nHouse passes short-term spending bill, but legislation faces long odds in Senate\nPentagon readies to shutter offices, troops to keep fighting without pay\nFederal workers deemed \"essential\" are still on the job, and key government functions — such as national security operations and law enforcement work — remain up and running.\nOther agencies have residual funds that will keep them operating for several days. But if the shutdown drags on, they, too, could run out of money and have to close their doors.\nHere's a look at what you can expect during the Government Shutdown of 2018:\nWhat's open? The mail is still being delivered, Social Security checks are still being processed, the Medicare and Medicaid programs are still running, and veterans' hospitals are still operating.\nhe national monuments will remain accessible as will portions of many national parks. The Smithsonian Institution's museums and National Zoo are open for now, but could close as early as Monday.\nAirports are still operating, and air traffic controllers and Transportation Security Administration officials are still on the job. But you could still run into some delays if you're traveling because \"non-essential\" employees will be furloughed.\nYou can also travel by train. Even though Amtrak depends on federal subsidies, it also gets revenue from ticket sales and has managed to stay open during past shutdowns.\nWhat's closed? Only \"essential\" government employees will report to work, so most federal agencies and departments are closed for now.\nThe IRS, for example, is expected to furlough 87% of its workers, which means most of the agency's programs will be shuttered. That includes the agency's helplines, which are turned off during the shutdown — a potential problem for taxpayers seeking guidance on massive changes this year.\nMost employees at other departments and agencies, such as the Department of Education, the National Transportation Safety Board and the Consumer Product Safety Commission, are furloughed, which means that ongoing investigations and programs will be temporarily halted.\nThe Environmental Protection Agency remains open, but just for a limited time. EPA Administrator Scott Pruitt advised all employees to return to work next week, but said further guidance will be issued the shutdown extends beyond Jan. 26.\nWhat's different? The big difference this time around is that monuments and parts of most national parks will remain open during the shutdown.\nDuring the last shutdown, in 2013, the Obama administration closed park entrances and put up barriers around national monuments. The policy sparked a public outrage when veterans were turned away from the World War II Memorial in Washington.\nTrump and his team don't want to repeat that fiasco. Most national parks roads and monuments and the private concessions that serve them remain open this time.\nServices that require staffing and maintenance, such as campgrounds, full service restrooms, and concessions that require some park staff or assistance will not be operating, the Interior Department said.", "external_links": [], "published": "2018-01-20T11:30:00.000+02:00", "crawled": "2018-01-20T13:10:15.014+02:00", "highlightTitle": ""}