{"organizations": [], "uuid": "eba8f710ec93441c8b8f6c1f3933205ec8b59b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224219287&w=1200&r=LYNXMPEE0L1OI", "site_section": "https://www.reuters.com/commentary", "section_title": "Columns | Reuters.com", "url": "https://www.reuters.com/article/us-apps-davos-commentary/commentary-for-trump-a-great-davos-face-off-idUSKBN1FB2BR", "country": "US", "domain_rank": 408, "title": "For Trump, the great Davos face-off", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-23T01:36:00.000+02:00", "replies_count": 0, "uuid": "eba8f710ec93441c8b8f6c1f3933205ec8b59b85"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-apps-davos-commentary/commentary-for-trump-a-great-davos-face-off-idUSKBN1FB2BR", "ord_in_thread": 0, "title": "For Trump, the great Davos face-off", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "justin trudeau", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Since its foundation in 1971, the World Economic Forum in Davos has been a byword for the growing consensus around an increasingly globalized world. Now, President Donald Trump is on his way to tell those who consider themselves the global elite that they have been wrong on just about everything.\nTrump will be the first serving U.S. president to attend Davos since Bill Clinton in 2000. But Trump won’t be the only major world leader in attendance. Indian Prime Minister Narendra Modi will also be there for the first time, as well as French President Emmanuel Macron. German Chancellor Angela Merkel will also join the party after reaching preliminary agreement with the Social Democrats on a new coalition government for Germany last week.\nTheir presence, along with UK Prime Minister Theresa May and Canada’s Justin Trudeau among others, sets the stage for a fascinating face-off with Trump.\nDavos can be a great opportunity for leaders to showcase themselves. Last year’s meeting was dominated by Chinese President Xi Jinping, whose speech focused on opposing protectionism and painting Beijing as the new defender of free trade in the age of Trump. That burnished the Chinese leader’s credentials abroad in the run up to the Communist Party Congress, where he cemented power at home.\nThe number of big-ticket leaders this year, however, will inevitably make that space more contested. Macron and Merkel will likely use it as a platform to defend their record on migration and security and presenting a liberal, centrist European vision.\nThat puts Macron in a potentially difficult position. Now Merkel is also showing up, the French president may feel little choice but to join with her on a relatively anti-Trump platform. Macron and the U.S. president, however, are scheduled to meet and the French leader might wish to re-create the bonhomie that characterized their first interaction last year.\nFor India’s Modi, the circus will be a great frustration – he was clearly hoping to follow Xi’s example and dominate the conference. But the presence of Trump will also give him the opportunity to cement good relations after a positive meeting between the two men in November. In Davos, they have the opportunity to present themselves as leaders of the world’s two largest and most powerful democracies, a strong platform to push whatever ideas they wish.\nMany of the other attendees, meanwhile, will almost certainly jump at the opportunity to lay into Trump. That was always inevitable, but has become even more likely after his reported description of African and Caribbean countries as “shitholes.”\nMuch will depend on how rigorously the president can be persuaded to stay “on message” – and whether the other leaders can steer him toward their own agendas. Last year, his first address to Congress was largely free of Trump-style ad-libbing, regarded by many on both sides of the aisle as one of his more coherent outlines of his worldview. A speech to NATO leaders in May last year, in contrast, was rambling and accusatory.\nFrench President Emmanuel Macron, German Chancellor Angela Merkel and U.S. President Donald Trump, shown here at the 2017 G20 meeting, are due to meet at the World Economic Forum meeting in Davos. REUTERS/John MacDougall/Pool For his audience back home, the U.S. president and those around him face a difficult balancing act. Trump knows his political base would like nothing more than to see him criticize the chief executives, celebrities and more liberal politicians gathered in the Alps.\nAt the same time, the administration has no shortage of things it would like to achieve. The summit offers unparalleled opportunities for backroom dealing and short and surreptitious meetings.\nIn an interview with the Wall Street Journal, Trump said his aim in going to Davos was to be a “cheerleader for the country.” Treasury Secretary Steven Mnuchin said the president would be heavily promoting his “America first” economic doctrine, a protectionist message that he also pushed heavily on his November trip to Asia.\nThe administration will also hope to make some progress on a host of other topics, such as closing the gap between European nations and Washington on handling Iran and ratcheting up pressure on North Korea.\nThe U.S. president will be accompanied by the largest U.S. delegation in recent Davos history. In addition to Mnuchin, it is scheduled to include Security Advisor H.R. McMaster, Secretary of State Rex Tillerson, Commerce Secretary Wilbur Ross and Treasury Secretary Mnuchin. That will allow for an unusually wide collection of policymaker speeches in which the Washington can set out its positions – or add nuance and explanation to the utterances of POTUS.\nAny speech Trump gives will be his highest-profile overseas address yet. He will also, presumably, be keeping up his own very personal Twitter coverage of all that happens, giving a level of insight into his state of mind – as well as who has really annoyed him.\nAccording to reporting by Politico, the president will most likely use the speech to set off one what some advisors call a dramatic “stink bomb.” Expect the president to lambaste other attendees on free-trade deals that he believes have undermined the United States, express his skepticism on climate change and perhaps the activities of the International Monetary Fund and World Bank.\nLittle of that will go down particularly well. Much, however, will depend on Trump’s own reaction to any criticism. Without doubt, he will lose no opportunity to remind all other attendees – including world leaders – that he is the president of the United States and they, as he once told a critical journalist from Time magazine, are not.\nThe president is nothing if not a successful showman. And no doubt he will savor the fact that his speech is scheduled to be delivered as one of the meeting’s closing acts. The problem for the rest of the attending elite is that even the most adept maneuvering won’t prevent their own agendas being subsumed by his.\nWhich is, of course, exactly how he likes it.\nAbout the Author Peter Apps is Reuters global affairs columnist, writing on international affairs, globalization, conflict and other issues. He is founder and executive director of the Project for Study of the 21st Century; PS21, a non-national, non-partisan, non-ideological think tank in London, New York and Washington. Before that, he spent 12 years as a reporter for Reuters covering defense, political risk and emerging markets. Since 2016, he has been a member of the British Army Reserve and the UK Labour Party. @pete_apps\n ", "external_links": [], "published": "2018-01-23T01:36:00.000+02:00", "crawled": "2018-01-23T07:44:39.003+02:00", "highlightTitle": ""}