{"organizations": [], "uuid": "06adf09661e2ee0d4507414a63c54524151464d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC145_3n3gY_TOP_20180120093040.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/sell-in-january-why-treasurys-fall-in-winter-1516543200", "country": "US", "domain_rank": 387, "title": "Sell in January? Why Treasurys Fall in Winter", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:00:00.000+02:00", "replies_count": 0, "uuid": "06adf09661e2ee0d4507414a63c54524151464d6"}, "author": "Daniel Kruger", "url": "https://www.wsj.com/articles/sell-in-january-why-treasurys-fall-in-winter-1516543200", "ord_in_thread": 0, "title": "Sell in January? Why Treasurys Fall in Winter", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "treasurys fall", "sentiment": "negative"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS January Is one of the cruelest months for U.S. government bonds.\nA Wall Street adage holds investors should sell stocks in May and go away to avoid a summer market slump. For bondholders, that month could be January.\nInvestors and analysts often expect Treasury yields, which rise as bond prices fall, to climb more in the first five months than in the last seven. It is a pattern that has held up often since 1998—a time in which bond yields have remained near modern lows—with the yield on the benchmark 10-year U.S. Treasury note posting an average increase of 0.017 percentage point in the months between January and May, versus a 0.215 percentage point decline during the remainder of the year.\nIt is the type of seasonal pattern watched closely by some investors, who use the market’s perceived tendency toward higher yields in the first part of the year to guide their trading strategies. Others suggest such seasonal moves are akin to the correlation between stock returns and the price of butter in Bangladesh or which conference wins the Super Bowl— a coincidence in search of a causal link .\nThe debate holds particular significance now, after the yield on the 10-year Treasury last week hit its highest level since 2014. That left many analysts questioning if the climb signaled further selling ahead—as signs of a long-awaited pickup in growth relieve some of the anxiety pushing global investors into government debt—or if the move marks the latest in a series of false starts that have characterized much of this long bull market.\n“Oftentimes a technical phenomenon exists because everybody believes in it,” said Michael Pond, head of global inflation-linked research at Barclays PLC. While some of the gains may reflect an element of a self-fulfilling prophecy, “there’s some real stuff that investors should take note of.”\nOne explanation for the pattern: inflation tends to rise in the spring months as prices for a number of important components of the consumer-price index tend to rise, gasoline foremost among them but also airline fares, lodging, rents and apparel, according to Mr. Pond. Inflation poses a threat to the value of government bonds, because it chips away at the purchasing power of their fixed payments.\nOther possible reasons include personal income-tax season, which ends April 15 and often forces the government to increase its short-term borrowing to make refund payments, according to William O’Donnell, a strategist at Citigroup Global Markets Inc. Mr. O’Donnell also cites the repatriation of Japanese assets before the end of the country’s fiscal year on March 31, which typically leads investors their to sell some Treasurys\nA 2015 paper by Mark Kamstra, Lisa Kramer and Maurice Levi even attributed a “statistically and economically significant” tendency for yields to rise early in the year to investors’ seasonal depression.\nIn addition to those factors, this year also presents investors with “a fundamental story about an improved global backdrop” combined with the inflationary force of a weaker dollar and the stimulative effects of tax cuts, Mr. Pond said.\nThe benchmark 10-year Treasury note yield ended 2017 at 2.409%, little changed from the end of 2016, as investors canceled bets on faster growth and inflation and as President Donald Trump struggled throughout the year to enact his legislative agenda.\nNow, investors are reassessing the outlook for the economy following passage of a $1.5 trillion tax-cut bill that is expected to spur growth and lead to larger budget deficits. And after raising interest rates three times in 2017, the Federal Reserve has penciled in three more rate increases in 2018. Some firms, including JPMorgan Chase & Co., are forecasting four Fed rate increases, as the tax cuts take effect.\nThe rise in yields this year are better explained by “factors related to where we are in the economic cycle,” said Jeffrey Klingelhofer, a portfolio manager at Thornburg Investment Management. Seasonal patterns, if they exist, don’t “govern how we think about the world.”\nMr. Klingelhofer said he has been making trades intended to reduce his exposure to the risk of weakening credit quality and higher interest rates, such as selling longer-term, low-yielding company bonds and buying short-term floating-rate corporate and asset-backed debt.\nThe most potent factor pushing yields higher is likely to be global central banks, said Mr. Klingelhofer. The European Central Bank in January reduced its monthly bond purchases to €30 billion ($36.7 billion) from €60 billion, with authorization for the program expiring in September. The Bank of Japan has signaled that it will reduce its purchases of government bonds by 5%. The Bank of Canada raised interest rates Wednesday, and investors expect as many as three more rate increases this year.\nIn addition to its rate increases, the Fed is also scaling back on its reinvestment of maturing securities from its $4.2 trillion bond portfolio. Should Fed officials follow through on plans announced in September, that would produce a $30 billion reduction in monthly Fed Treasury reinvestments.\nEconomists in a Wall Street Journal survey are predicting the 10-year yield will rise to 2.74% by June 30, and 2.98% by year-end.\nWrite to Daniel Kruger at Daniel.Kruger@wsj.com", "external_links": ["https://djcs-olympics.s3.amazonaws.com/custom-data-charts/custom-data-chart-wsj-0.8.29.min.js"], "published": "2018-01-21T17:00:00.000+02:00", "crawled": "2018-01-21T20:59:09.014+02:00", "highlightTitle": ""}