{"organizations": [], "uuid": "9ed54bb3713d194b36161e9566f5f587632456d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219667611&w=1200&r=LYNXMPEE0414T", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-exercise-cognitive-impairment/twice-weekly-workouts-may-be-best-medicine-for-cognitive-decline-idUKKBN1EU1VC", "country": "US", "domain_rank": 408, "title": "Twice-weekly workouts may be best medicine for cognitive decline", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:01:00.000+02:00", "replies_count": 0, "uuid": "9ed54bb3713d194b36161e9566f5f587632456d6"}, "author": "", "url": "https://uk.reuters.com/article/us-health-exercise-cognitive-impairment/twice-weekly-workouts-may-be-best-medicine-for-cognitive-decline-idUKKBN1EU1VC", "ord_in_thread": 0, "title": "Twice-weekly workouts may be best medicine for cognitive decline", "locations": [], "entities": {"persons": [{"name": "cheryl platzman weinstock", "sentiment": "none"}, {"name": "ronald petersen", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "mci", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "nicholson  researchers", "sentiment": "none"}, {"name": "american academy of neurology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 7:04 PM / Updated an hour ago Twice-weekly workouts may be best medicine for cognitive decline Cheryl Platzman Weinstock 5 Min Read \n(Reuters Health) - - There’s little evidence that medications improve mild cognitive decline associated with aging, according to a new review of research, but doctors can recommend exercise with confidence. A man exercises in downtown Los Angeles, California, March 9, 2015. REUTERS/Lucy Nicholson \nResearchers reviewed 11,530 studies of so-called mild cognitive impairment (MCI), to see how many older people are affected and which interventions and lifestyle changes have been shown to improve symptoms. \nMCI becomes increasingly common at older ages and is characterized by mild problems with thinking and memory that usually don’t interfere with daily life or independent function. People diagnosed with MCI are more likely, however, to go on to develop Alzheimer’s or other dementias than people without it. \nUntil now, said Ronald Petersen, the lead author of the new study and American Academy of Neurology (AAN) treatment guidelines, “Clinicians didn’t know what to do with these people. Now that we know that it’s a burgeoning condition we need to pay attention when folks come in and complain.” \nPetersen, who directs the Mayo Clinic Alzheimer’s Disease Research Center in Rochester, Minnesota, and his coauthors found that between ages 60 and 64, 6.7 percent of people have MCI. In the 65-69 age group, that rises to 8.4 percent, and about 10 percent at ages 70-74, nearly 15 percent at 75-79 and just over 25 percent at ages 80 to 84. \nWhen they looked at the use of drugs, such as cholinesterase inhibitors, they found “no high-quality evidence” that the medications work, according to the report in the journal Neurology. \nTheir analysis of studies looking at the effects of physical exercise on cognition did find a benefit, though. In one study involving 86 women with MCI, 70 to 80 years old, researchers found that twice-weekly resistance training for 26 weeks was more effective than aerobic training over the same time period at increasing what’s known as executive functioning. After completing the exercise regimen, the women were better able to plan, manage and organize their thoughts. \nBased on their review, the authors updated a practice guideline for MCI to include, for the first time, a recommendation that people with the syndrome should exercise regularly as part of an overall approach to managing their symptoms. \n“This is a rich area of study. I don’t think you can say that if you exercise 150 minutes a week you can push back cognitive decline a certain number of years,” Petersen said in a telephone interview. “We don’t know that for sure, but . . . physical exercise might be beneficial in slowing down the rate of cognitive decline since it has been shown to cause some stabilization or improvement of cognition.” \nHe thinks a combination of aerobic exercise and resistance training is likely best for MCI patients, but the data about its long-term effectiveness remains “scant.” He recommends that patients with MCI try to work up a sweat by walking briskly for 50 minutes, three times a week, because it might improve blood flow to the brain or induce enzymes to break down proteins that can build up into brain plaques. \nNeurology researchers are hoping to develop more specific evidence-based guidelines on how much exercise and what kind is needed to potentially delay or prevent cognitive decline based on ongoing clinical trials, he noted. \nThe new AAN guideline, which is endorsed by the Alzheimer’s Association, also urges clinicians to discuss with their MCI patients the diagnosis, prognosis, long-term planning and the lack of evidence that drugs and dietary options, such as vitamins E and C, homocysteine-lowering B vitamins and flavonoid-containing drinks, are at all effective. \nPetersen and his colleagues also analyzed five studies of brain-training interventions and found “insufficient evidence to support or refute the use of any individual cognitive intervention strategy.” Nevertheless, they conclude that doctors may recommend this approach because it might improve specific cognitive skills. \n“Continuing to be cognitively and physically active is paramount for overall brain health,” noted Dr. Neelum T. Aggarwal of the Rush Alzheimer’s Disease Center in Chicago, who wasn’t involved in the review or guidelines. \nSome cases of MCI are associated with reversible causes of cognitive impairment, including medication side effects, sleep apnea, depression and other medical conditions, so it’s important for patients to visit their healthcare provider at the first sign of memory problems, he said in a phone interview. \nSOURCE: bit.ly/2BV4fVp Neurology, online December 27, 2017.", "external_links": [], "published": "2018-01-05T21:01:00.000+02:00", "crawled": "2018-01-05T21:32:36.003+02:00", "highlightTitle": ""}