{"organizations": [], "uuid": "cdb8f292dc6634f29ff450f20d280b09459f061d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-yulong-eco-materials-limited-appoints-new-director.html", "country": "US", "domain_rank": 767, "title": "Yulong Eco-Materials Limited Appoints New Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T05:38:00.000+02:00", "replies_count": 0, "uuid": "cdb8f292dc6634f29ff450f20d280b09459f061d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-yulong-eco-materials-limited-appoints-new-director.html", "ord_in_thread": 0, "title": "Yulong Eco-Materials Limited Appoints New Director", "locations": [], "entities": {"persons": [{"name": "yulong eco-materials", "sentiment": "negative"}, {"name": "wancheng xie", "sentiment": "none"}, {"name": "xie", "sentiment": "none"}, {"name": "zhu", "sentiment": "none"}, {"name": "yulong zhu", "sentiment": "none"}], "locations": [{"name": "pingdingshan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "shenzhen asayi investment company", "sentiment": "none"}, {"name": "shenzhen motian gaoxin group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PINGDINGSHAN, China, Jan. 30, 2018 /PRNewswire/ -- Yulong Eco-Materials Limited (Nasdaq: YECO) (\"Yulong\" or \"the Company\"), a leading vertically integrated manufacturer of eco-friendly building products and a leading producer of fly-ash bricks and concrete announced on January 30, 2018 that effective immediately, the board accepted Mr. Yulong Zhu's resignation from the board of directors and appointed Mr. Wancheng Xie as a director to fill in the vacancy created by Mr. Zhu's resignation. Mr. Zhu will continue as the CEO of the Company. Mr. Xie is also appointed as chairman of the board.\nMr. Xie has more than 20 years of broad industrial experience in trading, mining, project management, marketing of building material and enterprise management. Since January 2014 he has served as President of Shenzhen Motian Gaoxin Group, a trading company which does business with partners in 55 countries, over 600 outlet stores, 80 agency branches and more than 30,000 employees. From March 2010 to October 2013 he served as Chief Operating Officer of Shenzhen Asayi Investment Company where he was responsible for regional construction and national network sales of consumer goods. Mr. Xie obtained a bachelor degree at the School of Business Administration at Henan University in 1993.\nForward-Looking Statements\nThis press release contains , particularly as related to, among other things, the business plans of the Company, statements relating to goals, plans and projections regarding the Company's financial position and business strategy. The words or phrases \"plans,\" \"would be,\" \"will allow,\" \"intends to,\" \"may result,\" \"are expected to,\" \"will continue,\" \"anticipates,\" \"expects,\" \"estimate,\" \"project,\" \"indicate,\" \"could,\" \"potentially,\" \"should,\" \"believe,\" \"think,\" \"considers\" or similar expressions are intended to identify \" .\" These fall within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Act of 1934 and are subject to the safe harbor created by these sections. Actual results could differ materially from those projected in the as a result of a number of risks and uncertainties. Such are based on current expectations, involve known and unknown risks, a reliance on third parties for information, transactions or orders that may be cancelled, and other factors that may cause our actual results, performance or achievements, or developments in our industry, to differ materially from the anticipated results, performance or achievements expressed or implied by such . Factors that could cause actual results to differ materially from anticipated results include risks and uncertainties related to the fluctuation of local, regional, and global economic conditions, the performance of management and our employees, our ability to obtain financing, competition, general economic conditions and other factors that are detailed in our periodic reports and on documents we file from time to time with the Securities and Exchange Commission. Statements made herein are as of the date of this press release and should not be relied upon as of any subsequent date, and the Company specifically disclaims any obligation, to update any to reflect occurrences, developments, unanticipated events or circumstances after the date of such statement.\nContact:\nDavid Wang\nEmail: yulongeco@163.com\nTel: 0375-8888588\nWebsite: http://www.yulongeco.com\nView original content: http://www.prnewswire.com/news-releases/yulong-eco-materials-limited-appoints-new-director-300590812.html\nSOURCE Yulong Eco-Materials Limited", "external_links": ["http://www.prnewswire.com/news-releases/yulong-eco-materials-limited-appoints-new-director-300590812.html", "http://www.yulongeco.com/"], "published": "2018-01-31T05:38:00.000+02:00", "crawled": "2018-01-31T07:36:13.017+02:00", "highlightTitle": ""}