{"organizations": [], "uuid": "ee7dee37e38158eb08b3f0ba2a22982c2c09860e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/royal-nickel-mine/canadas-rnc-minerals-in-talks-to-fund-battery-material-mine-idUSL1N1P80AZ", "country": "US", "domain_rank": 408, "title": "Canada's RNC Minerals in talks to fund battery material mine", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T14:44:00.000+02:00", "replies_count": 0, "uuid": "ee7dee37e38158eb08b3f0ba2a22982c2c09860e"}, "author": "", "url": "https://www.reuters.com/article/royal-nickel-mine/canadas-rnc-minerals-in-talks-to-fund-battery-material-mine-idUSL1N1P80AZ", "ord_in_thread": 0, "title": "Canada's RNC Minerals in talks to fund battery material mine", "locations": [], "entities": {"persons": [{"name": "dumont", "sentiment": "none"}, {"name": "susan taylor", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}], "organizations": [{"name": "rnc minerals", "sentiment": "neutral"}, {"name": "s&p global market intelligence", "sentiment": "none"}, {"name": "rnc", "sentiment": "none"}, {"name": "royal nickel", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:44 PM / Updated 23 minutes ago Canada's RNC Minerals in talks to fund battery material mine Susan Taylor 3 Min Read \nTORONTO, Jan 15 (Reuters) - RNC Minerals is in talks with commodity traders, mine operators and financiers to help secure $1 billion to build the world’s biggest nickel and cobalt project next year, the Canadian miner said. \nA global battery boom, driven by growing demand for electric cars, is pushing prices higher for such key ingredients as nickel and cobalt and encouraging miners to accelerate development plans. \nConditions are right to build Dumont in the Canadian province of Quebec, said RNC. With 3.15 million tonnes of nickel sulphide and 126,000 tonnes of cobalt, it is the largest undeveloped reserve of both metals in the world, the Toronto-based company said on Monday, citing S&P Global Market Intelligence data. \nRNC, which changed its name from Royal Nickel in 2016, is in talks with large Japanese trading houses, companies that offer “streaming” deals and miners interested in off-take arrangements to feed their smelters, said Chief Executive Mark Selby in an interview. \nStreaming deals offer miners upfront cash in exchange for future production at a discounted, fixed price. \n“We have a clear path to secure financial backing,” said Selby. \nLithium batteries, which contain cobalt and high-grade nickel, power electric vehicles for automakers ranging from Tesla to General Motors. \nUBS estimates 15 million electric vehicles will be on the road by 2025, lifting nickel demand by 300,000-900,000 tonnes, or by some 10-40 percent of the current market. \nAnalysts at CRU Group forecast the battery sector will need more than 75,000 tonnes of cobalt a year by 2025, up from around 41,000 tonnes in 2016. \nIn the past six months, nickel prices have climbed 38 percent and cobalt 27 percent. \nRNC is not yet in direct talks with battery makers or car companies, but is open to those discussions, Selby said. \nThe company is also seeking debt financing to fund half the development cost, he said, and expects to complete financing deals late this year and start the two-year construction project in 2019. \nRNC owns 50-percent of Dumont with private equity firm Waterton Global Resource Management holding the remainder. \nCobalt is mainly mined in the war-torn Democratic Republic of Congo. The market is dominated by Glencore, which produced more than 28,000 tonnes in 2016 and agreed to sell up to 20,000 tonnes of cobalt to a Chinese battery maker. \nAnalysts at Macquarie Research expect cobalt deficits of 885 tonnes this year, 3,205 in 2019 and 5,340 in 2020. \nBMO forecasts a 36,000-tonne nickel deficit in 2018 and sees demand for nickel used in electric car batteries to grow by 215,000 tonnes by 2025, about 10 percent of the current market size. (Reporting by Susan Taylor; Editing by Nick Zieminski)", "external_links": [], "published": "2018-01-15T14:44:00.000+02:00", "crawled": "2018-01-15T15:13:23.004+02:00", "highlightTitle": ""}