{"organizations": [], "uuid": "84e8a43d9473f3dc5358520c143f0b927e6f03a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-elior-group-a-good-first-quarter-full-year-outlook-confirmed.html", "country": "US", "domain_rank": 767, "title": "Elior Group: A Good First Quarter, Full-Year Outlook Confirmed", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:36:00.000+02:00", "replies_count": 0, "uuid": "84e8a43d9473f3dc5358520c143f0b927e6f03a0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-elior-group-a-good-first-quarter-full-year-outlook-confirmed.html", "ord_in_thread": 0, "title": "Elior Group: A Good First Quarter, Full-Year Outlook Confirmed", "locations": [], "entities": {"persons": [{"name": "philippe guillemot", "sentiment": "none"}, {"name": "elior", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "elior group", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6.3% revenue growth, of which 4.7% organic growth Full-year outlook confirmed\nPARIS--(BUSINESS WIRE)-- Regulatory News:\nElior Group (Paris:ELIOR) (Euronext Paris – ISIN: FR 0011950732), one of the world's leading operators in the catering and support services industry, today released its consolidated revenue figures for the first quarter of fiscal year 2017-2018, corresponding to the three months ended December 31, 2017.\nCommenting on these figures, Philippe Guillemot, Chief Executive Officer of Elior Group , said: \"The level of activity for the first quarter of FY 2017-2018 was in line with our forecasts. Organic growth came in at 4.7%, reflecting strong sales momentum, particularly in the United States and United Kingdom. The increase was also led by a favorable calendar effect – mainly in France, although the second quarter will see an inverse effect. Our recent strategic acquisitions in the contract catering market – which have been primarily in the United States – were another growth factor, driving up revenue by 3.5%. Our performance since the beginning of the fiscal year clearly illustrates how our teams are mobilized to reach our full-year objectives. Going forward, our priorities are best-in-class delivery, rigorous management, and the ramp-up of new contracts. Together with the management team we will present our long-term project for the Group early in the summer of 2018.\"\nRevenue\n(in € millions)\n3 months 2017-2018\n3 months 2016-2017\nOrganic\ngrowth\nReported\ngrowth\nContract catering & services 1,285 1,187 5.7% 8.3% Concession catering 409 407 2.0% 0.4% Group total 1,694 1,594 4.7% 6.3% Business development\nBusiness development has been buoyant since the start of FY 2017-2018, and the retention rate for contract catering & services was pretty stable at 93%. A number of major contracts were won in the first quarter of the fiscal year in the contract catering & services business, including with Bouygues, Lacoste, the municipality of Versailles and René Dubois hospital in France, Banca Nazionale del Lavaro in Italy, Virgin Active in the United Kingdom, San Juan de Dios de Cordoba hospital in Spain and the Pine Manor College in the United States.\nExternal growth\nDuring the first quarter of FY 2017-2018, the Group acquired CBM Managed Services in the correctional facilities food services market in the United States. This company has been consolidated since December 1, 2017.\nRevenue\nConsolidated revenue totaled €1,694 million for the first quarter of FY 2017-2018. The 6.3% year-on-year increase reflects (i) organic growth of 4.7% (including an estimated 1.2% favorable calendar effect), (ii) a 3.5% positive impact from acquisition-led growth, and (iii) a 2.0% negative currency effect.\nThe portion of revenue generated by international operations rose to 57% in the first quarter of FY 2017-2018 from 55% in the comparable prior-year period.\nContract catering & services revenue was up €99 million (or 8.3%) year on year, coming in at €1,285 million and accounting for 76% of the Group's total consolidated revenue.\nOrganic growth was 5.7%, spurred by an estimated 1.6% positive calendar effect compared with the same period of FY 2016-2017.\nRecent acquisitions 1 accounted for €56 million (or 4.7%) of this business line's revenue figure.\nThe currency effect during the period was a negative 2.1%.\nRevenue generated in France totaled €579 million. Organic growth was 4.2%, driven by an estimated 3.2% favorable calendar effect.\nIn the business & industry market, revenue was buoyed by robust business development. The education market saw a strong revenue increase, due to a positive calendar effect which will reverse in the second quarter in view of the timings of the 2017 school winter vacation period. Revenue edged down in the healthcare market, reflecting the fact that certain contracts were not renewed.\n1 Corporate Chefs – consolidated since February 1, 2017; CRCL and Megabite – consolidated since April 1, 2017, Lancer Hospitality – consolidated since April 1, 2017; CBM Managed Services – consolidated since December 1, 2017; and bolt-on acquisitions\nRevenue for the international segment advanced 11.9% to €706 million. Organic growth for this segment was 7.0%. Recent acquisitions generated additional revenue growth of 8.9% whereas the currency effect had a negative 4.0% impact.\nIn Spain, growth was fueled by a slightly favorable calendar effect and sustained business development, especially in business & industry. Strong organic growth in the United States was driven by a high retention rate and the start-up of new contracts in all markets. In Italy, revenue was hampered by a slightly adverse calendar effect and a more selective approach to bidding. In the United Kingdom, revenue rose across all markets thanks to the start-up of new contracts and good performances by existing sites.\nConcession catering revenue increased 0.4% in the first quarter of FY 2017-2018, amounting to €409 million and representing 24% of total consolidated revenue for the period.\nOrganic growth came to 2.0%. Changes in exchange rates – notably for the US dollar and Mexican peso – had a 1.6% negative effect.\nRevenue generated in France totaled €155 million, down 3.9% on the same period of FY 2016-2017.\nThe motorways market felt the positive effect of good traffic volumes, especially during the winter vacation period, but continued to be affected by the termination of certain contracts and the effects of renovating sites whose concession contracts have been renewed. Revenue in the airports markets remained more or less stable over the period. The increase in traffic that was seen in most airports, combined with the opening of new points of sale at Lyon-Saint Exupéry, offset the last consequences of losing the Nice contract. The city sites & leisure market reported a revenue decrease due to (i) the unfavorable basis of comparison with the first quarter of FY 2016-2017, when major trade shows were held which only take place once every two years, (ii) the termination of contracts with the Le Bourget and Villepinte exhibition centers, and (iii) the impact of renovation works in certain stations. The opening of new points of sale (notably at Paris Gare du Nord) and good performances by leisure parks in France partly offset these impacts.\nIn the international segment, 3.2% growth drove revenue up to €254 million for the first quarter of FY 2017-2018. Organic growth was 5.8%, but changes in exchange rates shaved 2.6% of the revenue figure.\nThe motorways market felt the positive effects of higher traffic volumes in Portugal as well as the opening of new service plazas in Portugal and Germany, which offset the combined impacts of certain contracts ending in Italy and the construction work currently under way at the Fort Pierce service plaza in Florida (USA). Revenue in the airports market was lifted by increasing traffic volumes – especially in Spain and Portugal – as well as by the opening of new points of sale in Denmark, Germany, Portugal, the United States and Mexico.\nOutlook\nThe Group expects to see another year of growth, with:\nOrganic growth of at least 3%. Acquisitions carried out to date should generate additional revenue growth of more than 2%. The positive calendar effect in the first quarter will reverse in the second quarter. A stable adjusted EBITDA margin (based on a constant scope of consolidation and constant exchange rates). A slight increase in adjusted earnings per share.\nFinancial calendar:\nMarch 9, 2018: annual shareholders’ meeting May 29, 2018: First-half FY 2017-2018 results – issue of press release before the start of trading plus conference call July 25, 2018: Revenue for the first nine months of FY 2017-2018 – issue of press release before the start of trading\nAppendix 1: Revenue by business line and geographic region\nAppendix 2: Revenue by geographic region\nAppendix 3: Revenue by market\nAppendix 4: Definitions of alternative performance indicators\nThe English-language version of this document is a free translation from the original, which was prepared in French. All possible care has been taken to ensure that the translation is an accurate representation of the original. However, in all matters of interpretation of information, views or opinions expressed therein, the original language version of the document in French takes precedence over this translation.\nAbout Elior Group\nFounded in 1991, Elior Group has grown into one of the world's leading operators in the catering and support services industry, and has become a benchmark player in the business & industry, education, healthcare and travel markets. Now operating in 16 countries, the Group generated €6,422 million in revenue through 25,000 restaurants and points of sale in FY 2016-2017. Our 127,000 employees serve 5.5 million people on a daily basis, taking genuine care of each and every one by providing personalized catering and service solutions to ensure an innovative customer experience.\nWe place particular importance on corporate social responsibility and have been a member of the United Nations Global Compact since 2004. The professional excellence of our teams, as well as their unwavering commitment to quality and innovation and to providing best in-class service is embodied in our corporate motto: \"Time savored\".\nFor further information please visit our website ( http://www.eliorgroup.com ) or follow us on Twitter ( @Elior_Group )\nAppendix 1: Revenue by business line and geographic region\n(in € millions) Q1\n2017-2018 Q1\n2016-2017 Organic\ngrowth\nChanges in\nscope of\nconsolidation\nCurrency\neffect\nTotal growth\nFrance 579 556 4.2% 0.0% 0.0% 4.2% International 706 631 7.0% 8.9% -4.0% 11.9% Contract catering & services 1,285 1,187 5.7% 4.7% -2.1% 8.3% France 155 161 -3.9% 0.0% 0.0% -3.9% International 254 246 5.8% 0.0% -2.6% 3.2% Concession catering 409 407 2.0% 0.0% -1.6% 0.4% GROUP TOTAL 1,694 1,594 4.7% 3.5% -2.0% 6.3% Appendix 2: Revenue by Geographic Region\n(in € millions) Q1\n2017-2018 Q1\n2016-2017 Organic\ngrowth\nChanges in\nscope of\nconsolidation\nCurrency\neffect\nTotal growth\nFrance 735 717 2.4% 0.0% 0.0% 2.4% Other European countries 585 560 3.7% 1.3% -0.4% 4.5% Rest of the world 374 316 11.9% 15.4% -9.2% 18.2% GROUP TOTAL 1,694 1,594 4.7% 3.5% -2.0% 6.3% Appendix 3: Revenue by Market\n(in € millions) Q1\n2017-2018 Q1\n2016-2017 Organic\ngrowth\nChanges in\nscope of\nconsolidation\nCurrency\neffect\nTotal growth\nBusiness & industry 569 505 5.3% 8.6% -1.4% 12.5% Education 420 385 8.7% 3.2% -2.8% 9.0% Healthcare 297 296 2.5% 0.0% -2.4% 0.1% Contract catering & services 1,285 1,187 5.7% 4.7% -2.1% 8.3% Motorways 125 129 -1.8% 0.0% -1.3% -3.1% Airports 188 177 8.6% 0.0% -2.6% 6.0% City sites & leisure 96 101 -5.0% 0.0% -0.1% -5.1% Concession catering 409 407 2.0% 0.0% -1.6% 0.4% GROUP TOTAL 1,694 1,594 4.7% 3.5% -2.0% 6.3% Appendix 4: Definitions of Alternative Performance Indicators\nOrganic growth in consolidated revenue: Growth in consolidated revenue expressed as a percentage and adjusted for the impact of (i) changes in exchange rates, using the calculation method described in Chapter 4, Section 4.1.4.1 of the FY 2015-2016 Registration Document, and (ii) other-than-marginal changes in scope of consolidation.\nReported EBITDA: This indicator corresponds to the following, as recorded in the consolidated income statement: recurring operating profit including share of profit of equity-accounted investees whose activities are the same or similar to those of the Group, before (i) net depreciation and amortization expense included in recurring operating profit and (ii) net additions to provisions included in recurring operating profit.\nAdjusted EBITDA: Reported EBITDA as defined above adjusted for the impact of share-based compensation expense (stock options and free shares granted by Group companies).\nAdjusted EBITDA margin: Adjusted EBITDA as a percentage of consolidated revenue.\nAdjusted EBITA: Recurring operating profit reported under IFRS adjusted for the impact of share-based compensation expense (stock options and free shares granted by Group companies) and amortization of intangible assets recognized on consolidation.\nAdjusted earnings per share: This indicator is calculated based on consolidated profit for the period attributable to owners of the parent adjusted for non-recurring income and expenses, net of the income tax effect calculated at the Group’s standard tax rate of 34%, and amortization of intangible assets recognized on consolidation (mainly customer relationships).\nFree cash flow: The sum of the following items as otherwise defined and recorded either as individual line items or as the sum of several individual line items in the consolidated cash flow statement:\nreported EBITDA; net capital expenditure (i.e. amounts paid as consideration for property, plant and equipment and intangible assets used in operations less the proceeds received from sales of these types of assets); change in operating working capital; tax paid, which notably includes corporate income tax, the CVAE tax in France and the IRAP tax in Italy; other cash movements, which primarily comprise cash outflows related to (i) non-recurring items in the income statement and (ii) provisions recognized for liabilities resulting from fair value adjustments recognized on the acquisition of consolidated companies.\nConversion rate: free cash flow as a percentage of adjusted EBITDA.\nLeverage ratio (as defined in the covenants in the Senior Facilities Agreement and presented for the Group’s debt at a given period-end): The ratio between (i) the Group’s net debt (at a given period-end determined based on the definition and covenants in the Senior Facilities Agreement as described in Chapter 4, Section 4.7.2 of the FY 2015-2016 Registration Document: “Senior Facilities Agreement”, i.e. excluding unamortized issuance costs and the fair value of derivative instruments) and (ii) adjusted EBITDA calculated on a rolling basis for the twelve months preceding the period-end concerned, further adjusted to exclude the impacts of acquisitions and divestments of consolidated companies during the twelve months preceding said period-end.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006378/en/\nInvestor relations\nMarie de Scorbiac\nmarie.descorbiac@eliorgroup.com\n+33 (0) 1 71 06 70 13\nor\nMedia\nAnne-Laure Sanguinetti\nanne-laure.sanguinetti@eliorgroup.com\n+33 (0)1 71 06 70 57\nSource: Elior Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.eliorgroup.com&esheet=51748524&newsitemid=20180124006378&lan=en-US&anchor=http%3A%2F%2Fwww.eliorgroup.com&index=1&md5=1e20fee83a0f29beb0bf5ee090d5e0f7", "http://www.businesswire.com/news/home/20180124006378/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FElior_Group&esheet=51748524&newsitemid=20180124006378&lan=en-US&anchor=%40Elior_Group&index=2&md5=ab64af78daf4350229d3d6236cbb2977"], "published": "2018-01-25T10:36:00.000+02:00", "crawled": "2018-01-25T12:29:40.003+02:00", "highlightTitle": ""}