{"organizations": [], "uuid": "e1e99ebe610cb1e7f0369e3b2542a63910e181f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 145, "shares": 145, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225688463&w=1200&r=LYNXMPEE0Q04C", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-louisiana-shooting-mcknight/man-convicted-of-manslaughter-in-road-rage-killing-of-ex-nfl-player-joe-mcknight-idUSKBN1FG05I", "country": "US", "domain_rank": 408, "title": "Man convicted of manslaughter in road-rage killing of ex-NFL player Joe McKnight", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T07:05:00.000+02:00", "replies_count": 0, "uuid": "e1e99ebe610cb1e7f0369e3b2542a63910e181f5"}, "author": "", "url": "https://www.reuters.com/article/us-louisiana-shooting-mcknight/man-convicted-of-manslaughter-in-road-rage-killing-of-ex-nfl-player-joe-mcknight-idUSKBN1FG05I", "ord_in_thread": 0, "title": "Man convicted of manslaughter in road-rage killing of ex-NFL player Joe McKnight", "locations": [], "entities": {"persons": [{"name": "joe mcknight", "sentiment": "negative"}, {"name": "gasser", "sentiment": "none"}, {"name": "ronald gasser", "sentiment": "none"}, {"name": "mcknight", "sentiment": "none"}], "locations": [{"name": "terrytown", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "new orleans times-picayune", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jefferson parish", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 5:07 AM / in 15 hours Man convicted of manslaughter in road-rage killing of ex-NFL player Joe McKnight Reuters Staff 3 Min Read \n(Reuters) - The man tried for murder in the road-rage shooting death of former National Football League running back Joe McKnight near New Orleans in 2016 was found guilty of the lesser charge of manslaughter on Friday, local media reported. \nThe verdict capped six days of testimony and 7-1/2 hours of deliberation by a Jefferson Parish jury in the trial of Ronald Gasser, 56, who admitted to shooting McKnight but said he acted in self-defense, according to the New Orleans Times-Picayune and the news website NOLA.com. \nThe deadly confrontation between Gasser and McKnight, 28, occurred at a traffic intersection in the New Orleans suburb of Terrytown, where the two men stopped their vehicles after shouting vulgarities at each other and driving erratically for about 5 miles. \nGasser had been charged with second-degree murder, meaning that he acted with specific intent to kill but not with premeditation or planning. The jury instead convicted him of manslaughter, essentially a crime of passion. \nProsecutors said after the trial they were happy with the verdict and that McKnight’s family was satisfied as well. \nAssistant District Attorney Seth Shute told reporters Gasser faced a possible prison term of up to 40 years when he is sentenced. \nGasser, who did not take the witness stand in his own defense, told investigators that he shot McKnight from the driver’s seat of his car as the former NFL player stood at Gasser’s open passenger-side window on Dec. 1, 2016. \nAccording to Gasser, he feared for his life when McKnight made an aggressive movement, or lunged in such a way as to attempt to get inside his vehicle. Gasser’s lawyer argued that his client was justified in defending himself with lethal force under Louisiana’s so-called “stand-your-ground” law. \nBut prosecutors said physical evidence, including the lack of gunpowder residue on McKnight’s body, disputed Gasser’s account and showed the two men were farther apart than Gasser has asserted. \nMcKnight played in the NFL as a running back for the New York Jets and Kansas City Chiefs from 2010 through 2014. He later played for the Edmonton Eskimos and Saskatchewan Roughriders in the Canadian Football League. Writing and reporting by Steve Gorman in Los Angeles; Editing by Tom Hogue", "external_links": [], "published": "2018-01-27T07:05:00.000+02:00", "crawled": "2018-01-27T07:15:46.008+02:00", "highlightTitle": ""}