{"organizations": [], "uuid": "55b8a2a5cf7047b1da826bc930e69b5160c8992d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-nears-recent-three-year-high-on-dollar-weakness-idUSL4N1PH3S5", "country": "US", "domain_rank": 408, "title": "FOREX-Euro nears recent three-year high on dollar weakness", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-22T19:42:00.000+02:00", "replies_count": 0, "uuid": "55b8a2a5cf7047b1da826bc930e69b5160c8992d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-nears-recent-three-year-high-on-dollar-weakness-idUSL4N1PH3S5", "ord_in_thread": 0, "title": "FOREX-Euro nears recent three-year high on dollar weakness", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "none"}, {"name": "thomas flury", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ubs wealth management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Japan, Europe central bank meetings in focus this week\n* Positioning data shows increased dollar bearish bets\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 22 (Reuters) - The euro rose a third of a percent on Monday on expectations the European Central Bank will maintain its current monetary policy at a meeting this week and not signal a dovish tilt.\nDollar weakness, exacerbated by a U.S. government shutdown and strengthening economic growth in Europe, also encouraged large investors to boost their expectations on the euro with UBS Wealth Management upgrading its short-term forecast for the single currency.\n“If it was not for the interest rate differentials, the euro would be much higher against the dollar as the underlying fundamentals such as current account balances have improved significantly in recent months,” said Thomas Flury, head of currency strategy at UBS Wealth Management’s Chief Investment Office.\nIn a report published on Monday, the unit upgraded the euro forecast against the dollar to $1.25 over the next three months from a previous forecast of $1.18.\nThe single currency was up 0.3 percent to $1.2259 in early trades, nearing a three-year high of $1.2323 that it reached last Wednesday.\nIt is up more than 2 percent this year after gaining more than 10 percent against the dollar last year.\nECB SURPRISE Investors were also focused on policy decisions in Japan and Europe. Japan is unlikely to signal any policy shift when its meeting ends on Tuesday; the ECB which may stick to its dovish policy stance and is unlikely to offer any hint of a change in forward guidance.\nSome analysts advise caution in betting on any quick withdrawal of ECB policy stimulus on Thursday as broad measures of inflation remain well below its targets.\n“Unless the U.S. government shutdown ends very quickly, which may boost the dollar, markets are focusing on the two other cross currents this week, namely the BOJ and the ECB, with the latter likely to surprise euro bulls,” said Alvin Tan, a currency strategist at Societe Generale in London.\nRecent data and political developments, especially in Germany, have bolstered the euro, with business sentiment optimistic and capital spending picking up.\nMeanwhile, latest positioning data showed dollar bears extended bets against the greenback last week as the political wrangling dented investor confidence.\nThe U.S. government shutdown took effect at midnight on Friday after Democrats and Republicans failed to agree on a last-minute deal to fund government operations. A vote on Sunday to provide funding through Feb. 8 was cancelled and will be held at 12 p.m. (1700 GMT) on Monday.\nThe dollar’s index against a basket of six other major currencies initially dipped to 90.155 but was last up 0.1 percent at 90.665, managing to hold above the three-year low of 90.113 set on Thursday.\nSterling steadied around $1.39 on Monday, with traders cautious about pushing the pound higher after five consecutive weeks of gains against the dollar, its longest winning streak since 2014.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee, editing by Larr King)\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T19:42:00.000+02:00", "crawled": "2018-01-22T19:22:13.005+02:00", "highlightTitle": ""}