{"organizations": [], "uuid": "d8cab3f69b9b43047b802c490a18811379b5f4db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-aaf-international-announces-the-acquisition-of-ris-facility-management-gmbh.html", "country": "US", "domain_rank": 767, "title": "AAF International Announces the Acquisition of RIS Facility Management GmbH", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.287, "site_type": "news", "published": "2018-01-15T17:08:00.000+02:00", "replies_count": 0, "uuid": "d8cab3f69b9b43047b802c490a18811379b5f4db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-aaf-international-announces-the-acquisition-of-ris-facility-management-gmbh.html", "ord_in_thread": 0, "title": "AAF International Announces the Acquisition of RIS Facility Management GmbH", "locations": [], "entities": {"persons": [], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "eppingen", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "aaf lufttechnik gmbh", "sentiment": "negative"}, {"name": "aaf international announces the acquisition of ris facility management gmbh", "sentiment": "negative"}, {"name": "aaf international", "sentiment": "none"}, {"name": "air filter co", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "hvac", "sentiment": "none"}, {"name": "aaf", "sentiment": "none"}, {"name": "ris facility management gmbh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BENSHEIM, Germany, Jan. 15, 2018 (GLOBE NEWSWIRE) -- AAF Lufttechnik GmbH, a German affiliate of American Air Filter Co. Inc., d/b/a AAF International, today announced the acquisition of RIS Facility Management GmbH, a leading provider of Indoor Air Quality services in Germany. With this acquisition, AAF International will further expand its operational footprint and enhance both the level and the quantity of services offered in Germany and all of Europe.\nRIS is headquartered in Eppingen, Germany, and provides HVAC inspections, process technology, repairs and maintenance to a wide range of industries, for both supply and exhaust air. The family-owned company employs approximately 100 qualified employees that are able to deliver first class consultancy and service for clean air related process security and value retention of equipment and buildings.\n“AAF International is an industry leader with ambitious goals for the future. We are looking forward to join forces with the AAF team and combine AAF’s high quality product portfolio and unique intelligent data tools with our service offerings,” said Mehmet Tiftikci, Management Director of RIS.\n“Both of our companies’ philosophies are dedicated to ‘Bringing Clean Air to Life’™, which is an excellent fit for a new partnership,” said Philip Whitaker, AAF International’s Chief Executive Officer. “Since 2006, RIS has successfully built up their business from zero to now serving the biggest brands in the automotive industry. With this new partnership we are now looking forward to further expand this great track record.”\n“This acquisition will immediately help us to meet our customers’ demand for value-added air filtration solutions in Germany,” said Stefan Berbner, AAF International’s Chief Operating Officer in Europe. “In addition, we are now strategically positioned to expand our idea of a true one-stop-shop across all of Europe.”\nAbout the AAF group of companies\nHeadquartered in Louisville, Ky., American Air Filter Co. Inc., d/b/a AAF International, offers the most comprehensive manufacturing capabilities in the air filtration industry. A global leader in the clean air industry, AAF develops and manufactures a wide variety of air filtration solutions that are designed to remove and control airborne particulates and gaseous contaminants in commercial, residential, industrial, cleanroom, transportation and nuclear power applications. AAF is committed to manufacturing the highest quality filter and containment housings necessary to protect people, processes and systems.\nAmerican Air Filter Co. Inc. is supported in its international ventures through the resources of its parent company Daikin Industries Ltd., based in Osaka, Japan, a diversified international manufacturing company and a global leader in air conditioning. For more information, visit www.aafintl.com .\nCONTACT: Franz Carsten-Weidner Marketing Director Franz-Carsten.Weidner@aafeurope.com\nSource:AAF International", "external_links": ["http://www.aafintl.com/"], "published": "2018-01-15T17:08:00.000+02:00", "crawled": "2018-01-15T18:50:52.001+02:00", "highlightTitle": ""}