{"organizations": [], "uuid": "b59b233fd46d4fac40a7ba3eeeaf564b8e367da3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-654212048.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/apple-iphone-addiction-parental-controls/", "country": "US", "domain_rank": 1196, "title": "iPhone Parental Controls: What You Can Do to Protect Kids | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.16, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "b59b233fd46d4fac40a7ba3eeeaf564b8e367da3"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/09/apple-iphone-addiction-parental-controls/", "ord_in_thread": 0, "title": "iPhone Parental Controls: What You Can Do to Protect Kids | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "california state teachers’ retirement system", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "jana partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 \nApple has promised new ways for parents to control what their kids see on its products. \nIn a statement to The Wall Street Journal , Apple said that it’s “constantly looking” for opportunities to protect children and will, in a future software update, make parental controls that are “even more robust” available on its many products. \nApple’s decision came after two prominent investors, Jana Partners and California State Teachers’ Retirement System, sent a letter to Apple over the weekend requesting the company build new tools to help parents curb their children’s use of iPhones. They cited the potential for negative effects on a child’s mental health with too much smartphone use, and suggested Apple, as one of the most prominent technology companies in the world, could lead a charge to safeguard children. \nBut while you’re waiting for that update, you can take action now if you believe your kids are spending too much time on their favorite apps. \nApple’s iPhone (and iPad) parental controls are already quite useful and give you broad control over what your kids can and cannot do. Here’s a quick guide on how to restrict app access on your kids’ iPhones: Ensure You Have a Passcode Set \nIn order to create restrictions—and ensure your children can’t easily turn them off—you’ll need to turn on passcodes in your iPhone settings. The passcode will need to be input to access the Restrictions settings. \nTo create a passcode, go to Settings > General > Face ID & Passcode (or Touch ID & Passcode). Create the passcode you want and you’ll be all set. Open the Restrictions App \nTo access the Restrictions app, you’ll need to open your Settings and go to General. In there, you’ll see an option for Restrictions. Once you tap it, the software will request you input a passcode. Do that and you’ll see a long list of restrictions. \nGet Data Sheet , Fortune’s technology newsletter Make Some Basic Adjustments \nFirst things first, decide whether you want your children to access built-in apps, including Apple’s Safari browser, the Camera app, and FaceTime. You can also decide whether iTunes and the ability to install apps should be turned on. If you don’t allow apps to be installed, only you will be allowed to install programs when you turn off the restriction and install apps from the App Store. Choose an Age Rating \nIf you’ve decided to allow your children to download apps but want to restrict what they can access, scroll down on the Restrictions menu to the “Allowed Content” section. \nThere, you’ll decide whether Apple should automatically filter explicit content. You can also choose the “apps” pane and determine whether the iPhone should allow any apps to be accessible, or only those that are appropriate for a variety of ages, including 4+, 9+, 12+, or 17+. \nSimilar control is available on TV show access, music, and allowed websites. In fact, the Allowed Websites pane lets you determine which websites your kids can access at any time. Focus on Games \nIf games is the real problem you’re dealing with, Apple makes it easy to control that behavior. \nIf you scroll the bottom of the Restrictions menu, you’ll see a “Game Center” section. There you can decide whether your kids should be allowed to play multiplayer games or communicate with others inside a game. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T05:06:17.027+02:00", "highlightTitle": ""}