{"organizations": [], "uuid": "8c825a41a45c470e4f1be691d73d3630678e3986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220228965&w=1200&r=LYNXMPEE070JV", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-safrica-politics/new-leader-of-south-africas-anc-calls-for-unity-as-rift-over-zuma-widens-idUSKBN1EX0TR", "country": "US", "domain_rank": 408, "title": "New leader of South Africa's ANC calls for unity as rift over Zuma widens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T12:20:00.000+02:00", "replies_count": 0, "uuid": "8c825a41a45c470e4f1be691d73d3630678e3986"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-politics/new-leader-of-south-africas-anc-calls-for-unity-as-rift-over-zuma-widens-idUSKBN1EX0TR", "ord_in_thread": 0, "title": "New leader of South Africa's ANC calls for unity as rift over Zuma widens", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "nkosazana dlamini-zuma", "sentiment": "none"}, {"name": "ramaphosa", "sentiment": "none"}, {"name": "joe brock", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}], "organizations": [{"name": "anc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - The new leader of South Africa’s African National Congress (ANC) Cyril Ramaphosa called for unity on Monday as factions within the party become increasingly divided over the future of President Jacob Zuma.\nThere is widespread speculation that Ramaphosa and his allies are lobbying ANC members to oust Zuma as head of state within weeks. Ramaphosa, who is also the country’s deputy president, publicly supports Zuma.\nMarkets have rallied since Ramaphosa narrowly defeated Zuma’s ex-wife Nkosazana Dlamini-Zuma in an ANC leadership contest last month as investors bet he will tackle rampant political corruption and implement economic reforms.\nZuma’s term doesn’t officially end until 2019 when national elections will be held but he could be removed early through a motion of no confidence in parliament or at meeting of the ANC’s national executive committee (NEC). The NEC will meet this week.\nZuma himself orchestrated the removal of former president Thabo Mbeki in 2008 once he had succeeded Mbeki as ANC leader.\nRamaphosa used Dlamini-Zuma’s own words as he called on the ANC to end its differences ahead of the 2019 vote.\nFILE PHTOTO: Newly elected president of the African National Congress (ANC) Cyril Ramaphosa makes the closing address at the 54th National Conference of the ruling ANC in Johannesburg, South Africa December 21, 2017. REUTERS/Rogan Ward “We must rid ourselves of factionalism. We do not want a divided African National Congress,” Ramaphosa told ANC leaders at a celebration of the party’s 106th birthday in Kwa-Zulu Natal, the home province of Zuma and Dlamini-Zuma.\n“One of the things Comrade Nkosazana Dlamini-Zuma said was: ‘divided we fall, united we stand’. That has a great deal of meaning,” he said, as a stony-faced Dlamini-Zuma looked on.\nSlideshow (2 Images) Ramaphosa tried to balance the priorities of both factions within the ANC, reiterating his anti-graft stance but also blunting Dlamini-Zuma by pledging to redistribute land from the white-minority to the black-majority, her main campaign promise.\nThough Ramaphosa says he supports land redistribution without compensations, a popular policy among poor black voters, he has promised he will not do it at the expense of the economy.\nThe ANC’s public support has declined under Zuma’s leadership as voters have become increasingly disillusioned with a raft of corruption scandals, weak economic growth and an unemployment rate that has risen to nearly 28 percent.\nMany analysts say the 2019 election is the first realistic chance of the ANC losing power since the party swept to power under Nelson Mandela at the end of apartheid in 1994.\nReporting by Joe Brock; Editing by Raissa Kasolowsky\n ", "external_links": [], "published": "2018-01-08T12:20:00.000+02:00", "crawled": "2018-01-08T12:35:43.057+02:00", "highlightTitle": ""}