{"organizations": [], "uuid": "e6bcb1fd63c34b8f110551d596237ad3a8f9f9b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-moduslink-global-solutions-adopts-tax-benefits-preservation-plan.html", "country": "US", "domain_rank": 767, "title": "ModusLink Global Solutions Adopts Tax Benefits Preservation Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:30:00.000+02:00", "replies_count": 0, "uuid": "e6bcb1fd63c34b8f110551d596237ad3a8f9f9b8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-moduslink-global-solutions-adopts-tax-benefits-preservation-plan.html", "ord_in_thread": 0, "title": "ModusLink Global Solutions Adopts Tax Benefits Preservation Plan", "locations": [], "entities": {"persons": [{"name": "moduslink", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "moduslink global solutions", "sentiment": "negative"}, {"name": "moduslink global solutions ™ , inc.", "sentiment": "negative"}, {"name": "tax benefits", "sentiment": "none"}, {"name": "moduslink", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 19, 2018 /PRNewswire/ -- ModusLink Global Solutions ™ , Inc. (the \"Company\" or \"ModusLink\") (NASDAQ: MLNK), today announced that its Board of Directors has adopted a tax benefits preservation plan (the \"Plan\") designed to preserve ModusLink's ability to utilize its net operating loss carryforwards and other tax attributes (collectively, \"Tax Benefits\"). ModusLink intends to submit the Plan, which is similar to plans adopted by other public companies with significant Tax Benefits, for stockholder approval at its 2017 Annual Meeting of Stockholders.\nModusLink had net operating loss carryforwards for federal and state tax purposes of approximately $2.1 billion and $209.8 million, respectively, as of July 31, 2017. ModusLink's ability to use its Tax Benefits would be substantially limited if ModusLink undergoes an \"ownership change\" (within the meaning of Section 382 of the Internal Revenue Code). The Plan is intended to prevent an \"ownership change\" of ModusLink that would impair ModusLink's ability to utilize its Tax Benefits.\nAs part of the plan, the Board of Directors of ModusLink declared a dividend of one right (a \"Right\") for each share of common stock, par value $0.01 per share, of ModusLink (the \"Common Stock\") then outstanding. The dividend will be payable to holders of record as of the close of business on January 29, 2018. Any shares of Common Stock issued after the record date will be issued together with the Rights. Each Right initially represents the right to purchase one one-thousandth of a share of newly created Series D Junior Participating Preferred Stock.\nInitially, the Rights will be attached to all certificates representing shares of Common Stock then outstanding and no separate rights certificates will be distributed. In the case of book entry shares, the Rights will be evidenced by notations in the book entry accounts. Subject to certain exceptions specified in the Plan, the Rights will separate from the Common Stock and a distribution date (the \"Distribution Date\") will occur upon the earlier of (i) ten (10) business days following a public announcement that a stockholder (or group) has become a beneficial owner of 4.99% or more of the shares of Common Stock then outstanding and (ii) ten (10) business days (or such later date as the Board determines) following the commencement of a tender offer or exchange offer that would result in a person or group becoming a 4.99 percent stockholder.\nPursuant to the Plan and subject to certain exceptions, if a stockholder (or group) becomes a 4.99 percent stockholder after adoption of the Plan, the Rights would generally become exercisable and entitle stockholders (other than the 4.99-percent stockholder or group) to purchase additional shares of ModusLink at a significant discount, resulting in substantial dilution in the economic interest and voting power of the 4.99-percent stockholder (or group). In addition, under certain circumstances in which ModusLink is acquired in a merger or other business combination after an non-exempt stockholder (or group) becomes a 4.99 percent stockholder, each holder of the Right (other than the 4.99-percent stockholder or group) would then be entitled to purchase shares of the acquiring company's common stock at a discount.\nThe Rights are not exercisable until the Distribution Date and will expire at the earliest of (i) 11:59 p.m. on the date that the votes of the stockholders of Company with respect to the Company's next annual meeting or special meeting of stockholders are certified (which date will be no later than January 18, 2019), unless the continuation of the Plan is approved by the affirmative vote of the majority of shares of Common Stock present at such meeting of stockholders (in which case clause (ii) will govern); (ii) 11:59 p.m., on January 18, 2021; (iii) the time at which the Rights are redeemed or exchanged as provided in the Plan; and (iv) the time at which the Board determines that the Plan is no longer necessary or desirable for the preservation of Tax Benefits.\nAdditional details of the Plan will be communicated in a current report on Form 8-K to be filed with the U.S. Securities and Exchange Commission.\nAbout ModusLink Global Solutions, Inc.\nModusLink Global Solutions, Inc. is a diversified holding company, publicly traded on the Nasdaq Global Select Market under the symbol \"MLNK\". Through its wholly owned subsidiary ModusLink Corporation, the Company provides digital and physical supply chain solutions to many of the world's leading brands across a diverse range of industries including consumer electronics, telecommunications, computing and storage, software and content, consumer packaged goods, medical devices, retail and luxury, and connected devices, among others. With a global footprint spanning North America, Europe and the Asia-Pacific region, the Company's solutions and services are designed to improve end-to-end supply chains in order to drive growth, lower costs and improve profitability. IWCO Direct, a wholly owned subsidiary is a leading provider of data-driven marketing solutions that help clients drive response across all marketing channels to create new and more loyal customers. They are the largest direct mail production provider in North America, with a full range of services including strategy, creative, and production for multichannel marketing campaigns, along with one of the industry's most sophisticated postal logistics strategies for direct mail.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Statements in this release that are not historical facts are hereby identified as \"forward-looking statements\" for the purpose of the safe harbor provided by Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical fact, including without limitation, those with respect to the Company's goals, plans, expectations and strategies set forth herein are forward-looking statements. The following important factors and uncertainties, among others, could cause actual results to differ materially from those described in these forward-looking statements: the Company's ability to execute on its business strategy, including any cost reduction plans and the continued and increased demand for and market acceptance of its services, which could negatively affect the Company's ability to meet its revenue, operating income and cost savings targets, maintain and improve its cash position, expand its operations and revenue, lower its costs, improve its gross margins, reach and sustain profitability, reach its long-term objectives and operate optimally; failure to realize expected benefits of restructuring and cost-cutting actions; the Company's ability to preserve and monetize its net operating losses; difficulties integrating technologies, operations and personnel in accordance with the Company's business strategy; client or program losses; demand variability in supply chain management clients to which the Company sells on a purchase order basis rather than pursuant to contracts", "external_links": ["http://www.prnewswire.com/news-releases/moduslink-global-solutions-adopts-tax-benefits-preservation-plan-300585424.html"], "published": "2018-01-20T00:30:00.000+02:00", "crawled": "2018-01-20T00:43:56.011+02:00", "highlightTitle": ""}