{"organizations": [], "uuid": "2f16b3eeed9aed9d4f1279091a4f76727b42b231", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224200640&w=1200&r=LYNXMPEE0L1LW", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-trade-nafta/naftas-fate-uncertain-ahead-of-final-round-of-talks-in-montreal-idUSKBN1FB27R", "country": "US", "domain_rank": 408, "title": "NAFTA's fate uncertain ahead of final round of talks in Montreal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:16:00.000+02:00", "replies_count": 0, "uuid": "2f16b3eeed9aed9d4f1279091a4f76727b42b231"}, "author": "", "url": "https://www.reuters.com/article/us-trade-nafta/naftas-fate-uncertain-ahead-of-final-round-of-talks-in-montreal-idUSKBN1FB27R", "ord_in_thread": 0, "title": "NAFTA's fate uncertain ahead of final round of talks in Montreal", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  ottawa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - The NAFTA trade agreement’s future hangs in the balance this week as negotiators from the United States, Canada and Mexico try to settle major differences over revamping a pact that President Donald Trump has threatened to abandon.\nSenior officials from the three nations will meet in Montreal for a week starting on Tuesday in the sixth and penultimate round of talks to modernize the 1994 North American Free Trade Agreement.\nTrump, who entered office last year pledging to undo what he described as disastrous trade deals, has portrayed NAFTA as grossly unfair to the United States and its workers.\nCanada and Mexico, which initially dismissed most of Washington’s demands as unworkable, now say there is room to maneuver. But that still may not be enough to satisfy Trump and impatient U.S. officials.\nU.S. threats to walk away from NAFTA, which underpins much of the more than $1 trillion in annual trilateral trade among the three nations, have put markets on edge. The talks are supposed to wrap up by the end of March to avoid clashing with Mexico’s general elections in July.\nTrump, who blames NAFTA for killing off hundreds of thousands of U.S. manufacturing jobs and says it has led to a large U.S. trade deficit with Mexico, tweeted last Thursday that “NAFTA is a bad joke!”\nOver the last 10 days the Republican president has generated confusion by indicating that he might extend the deadline for talks while saying that walking away from the table would be the best idea.\nA council advising Canadian Foreign Minister Chrystia Freeland on NAFTA has concluded that Washington is most likely to announce that it wants out of the pact. It met with Freeland last week.\n“There is still a shred of optimism, but I have to say the consensus around the room ... felt like it’s not if, it’s when he’s going to pull the plug,” Rona Ambrose, a council member and former Canadian minister, told CTV television.\nThat pessimism is in stark contrast to a large majority of economists polled by Reuters who are betting the treaty will be renegotiated successfully with only marginal changes.\nFreeland, who also says a positive result is still possible, is due to meet Mexican Economy Minister Ildefonso Guajardo in Toronto on Monday.\nFILE PHOTO: Flags are pictured during the fifth round of NAFTA talks involving the United States, Mexico and Canada, in Mexico City, Mexico, November 19, 2017. REUTERS/Edgard Garrido/File Photo CAUTIOUS OPTIMISM Canada and Mexico initially said they would not even discuss U.S. demands to set minimum levels of North American content for the auto sector, a clause that would terminate the deal if it is not renegotiated every five years, and end the so-called Chapter 19 dispute mechanism.\nSources close to the talks say Canada and Mexico will now be more flexible on the auto content and dispute resolution issues.\n“We have got areas we are going to fight for, obviously, but that doesn’t mean we can’t be creative, nimble, clever,” said one Canadian source familiar with Ottawa’s strategy.\n“There can be very strong lines (in the sand) ... it’s not to say you don’t talk around them. Sometimes you find creative ways without necessarily compromising,” said the source, who requested anonymity given the sensitivity of the situation.\nIn Mexico, some of the pessimism palpable in late December has given way to cautious optimism that progress towards a deal is possible in Montreal if the Trump administration is prepared to give ground on its toughest proposals.\nJaime Zabludovsky, one of the Mexican negotiators of the original NAFTA accord and an adviser to the private sector on the current talks, said the negotiations in Montreal would be a decisive test of the countries’ ability to make progress.\n“I think we’re at a make-or-break moment,” he said in an interview.\nOne Mexican source familiar with the process said he expected further talks through March and mentioned the possibility that final discussions could, if necessary, be postponed until after the Mexican elections.\nDespite a U.S. government shutdown, Washington will send a team to the Montreal talks, a Trump administration source said.\n(This story corrects headline, second paragraph to remove reference to final round of talks.)\nAdditional reporting by Dave Graham in Mexico City and Lesley Wroughton in Washington; Editing by Christian Plumb and Paul Simao\n ", "external_links": [], "published": "2018-01-22T18:16:00.000+02:00", "crawled": "2018-01-22T18:26:50.018+02:00", "highlightTitle": ""}