{"organizations": [], "uuid": "8b2ddc5a62574af572e10a640866a9f2c39716c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-scynexis-provides-corporate-and-scy-078-pipeline-update.html", "country": "US", "domain_rank": 767, "title": "SCYNEXIS Provides Corporate and SCY-078 Pipeline Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T00:05:00.000+02:00", "replies_count": 0, "uuid": "8b2ddc5a62574af572e10a640866a9f2c39716c2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-scynexis-provides-corporate-and-scy-078-pipeline-update.html", "ord_in_thread": 0, "title": "SCYNEXIS Provides Corporate and SCY-078 Pipeline Update", "locations": [], "entities": {"persons": [{"name": "marco taglietti", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "scy-078 pipeline update jersey city", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERSEY CITY, N.J., Jan. 4, 2018 /PRNewswire/ -- SCYNEXIS, Inc. (NASDAQ: SCYX), a biotechnology company delivering innovative anti-infective therapies for difficult-to-treat and often life-threatening infections, today provided a corporate update, including recent pipeline developments and anticipated milestones in 2018, for its lead antifungal candidate, SCY-078. SCY-078 is the first representative of a novel oral and intravenous (IV) triterpenoid antifungal family in clinical and pre-clinical development for the treatment of several serious fungal infections, including invasive candidiasis, invasive aspergillosis, refractory invasive fungal infections and vulvovaginal candidiasis (VVC).\n\"In 2017, we made significant progress in advancing the clinical development of SCY-078 in indications addressable and approvable with an orally-administered antifungal therapy,\" said Marco Taglietti, M.D., President and Chief Executive Officer of SCYNEXIS. \"In addition, we advanced the IV program of SCY-078 to address the clinical hold placed by the U.S. Food and Drug Administration (FDA) following thrombotic events observed in a Phase 1 study. We plan to restart clinical trials with IV SCY-078 in the third quarter of 2018, using a liposomal IV formulation that has shown an improved tolerability profile in pre-clinical assessments compared with the cyclodextrin-based IV formulation used in the earlier study.\"\nDr. Taglietti continued: \"We are excited about our strategic plans for 2018, when we envision SCY-078 advancing in multiple Phase 2 and Phase 3 trials to maximize the broad potential clinical utility of SCY-078 in addressing unmet medical needs in VVC, invasive candidiasis, invasive aspergillosis and refractory invasive fungal infections.\"\nPath Forward Established for IV Program of SCY-078, with Clinical Trials to Initiate in the Third Quarter of 2018 with an Improved IV Formulation\nAs previously disclosed in March 2017, the FDA required SCYNEXIS to hold the initiation of any new clinical studies of the IV formulation of SCY-078 following the review of three mild-to-moderate inflammation-related thrombotic events in healthy volunteers receiving the IV formulation at the highest dose level in a Phase 1 study. That study used a cyclodextrin-based IV formulation.\nBroad Pre-clinical Program Executed to Address the Clinical Hold. Based on subsequent interactions with the FDA, SCYNEXIS completed a broad range of pre-clinical activities designed to identify the underlying cause of the thrombotic events and to evaluate the optimal administration regimen for the cyclodextrin-based IV formulation of SCY-078. In parallel, SCYNEXIS continued its pursuit of alternative IV formulations. No Intrinsic Pro-Coagulant Effect of the SCY-078 Compound. Several pre-clinical studies showed that SCY-078 does not affect blood coagulation by itself, providing supporting evidence that the thrombotic events associated with the administration of the cyclodextrin-based IV formulation were triggered by vascular endothelium inflammation at the site of infusion. Accelerated Development of a Liposomal IV Formulation of SCY-078. During 2017, SCYNEXIS accelerated the development of a new formulation based on liposomal technology. This technology has been successfully used to improve systemic tolerability of other commercially available IV formulations. Favorable Profile of the Liposomal IV Formulation of SCY-078. SCYNEXIS compared the cyclodextrin-based IV formulation head-to-head against the liposomal IV formulation of SCY-078 in pre-clinical evaluations, and the liposomal formulation showed a superior profile for infusion-related tolerability and vascular inflammation. Pre-clinical Activities Ongoing to Enable Planned Human Studies of the Liposomal IV Formulation of SCY-078. Based on these initial pre-clinical studies, SCYNEXIS believes that the liposomal IV formulation may offer significant clinical benefits over the cyclodextrin-based IV formulation and, therefore, decided to focus its efforts on the advancement of the liposomal IV formulation of SCY-078. This decision was discussed with the FDA and a path forward was established. Additional pre-clinical studies are ongoing, and SCYNEXIS intends to initiate a Phase 1 study in healthy volunteers in the third quarter of 2018, pending FDA's review. Phase 2b Study in Invasive Candidiasis. Upon successful completion of the Phase 1 study in healthy volunteers, SCYNEXIS plans to initiate a Phase 2b study of SCY-078 in invasive candidiasis with the liposomal IV formulation in the fourth quarter of 2018.\nClinical Development of Oral Formulation of SCY-078 Continues to Progress as Planned in Multiple Indications Approvable with an Oral Agent\nSCYNEXIS is pursuing several programs where the oral formulation of SCY-078 has the potential to be a suitable treatment for indications with significant unmet medical needs and considerable commercial potential.\nV VC – Most Advanced Stage of Clinical Development, Targeting Both Acute and Recurrent Infections. Rapid Recruitment in the Phase 2 Dose-finding DOVE Study. In August 2017, SCYNEXIS initiated dosing in the Phase 2 study, designed to evaluate the safety and efficacy of the oral formulation of SCY-078 vs. oral fluconazole, the standard of care, for the treatment of VVC. Robust enrollment in the trial has been maintained, and SCYNEXIS continues to expect top-line results in mid-2018. In a previously conducted, proof-of-concept, Phase 2a study in VVC patients, SCY-078 showed high clinical cure and low recurrence rates. Initiation of Phase 3 Program Planned for the Fourth Quarter of 2018. SCYNEXIS anticipates that the dose regimen selected from the DOVE study will be subsequently evaluated in Phase 3 studies following an End-of-Phase 2 meeting with the FDA. SCYNEXIS expects to initiate the Phase 3 clinical program in the fourth quarter of 2018. Refractory Invasive Fungal Infections – Potential for Streamlined Development Pathway. Enrollment Ongoing in the FURI Study for the Treatment of Patients with a Wide Range of Candida spp. Infections with Limited or No Treatment Options. Sixteen sites in the U.S and Europe are now active in this open-label study, and enrollment is progressing as planned. CARES Study Opened for Enrollment for the Treatment of Patients with Candida auris Infections. Systemic infections caused by C. auris, a pathogen that is often multidrug-resistant, are associated with high mortality. The CARES study is designed to provide rapid access to oral SCY-078 for patients with this life-threatening and difficult-to-treat infection. This emergency protocol allows for expeditious site initiation upon request from investigators. Both FURI and CARES Studies Designed as Pivotal Trials to Support a Potential Approval. The open-label design of these studies allows for evaluation of the data on an interim basis to further inform subsequent regulatory steps of the development program. Invasive Aspergillosis – SCY-078 in Combinati", "external_links": ["http://www.scynexis.com/", "http://www.prnewswire.com/news-releases/scynexis-provides-corporate-and-scy-078-pipeline-update-300577832.html", "http://ir.scynexis.com/investor-relations", "http://www.globenewswire.com/Tracker?data=5r3uGttvkXtqVsQr0f7dEr1-0gU95kWCvCnDfT7XVgrlVb-P8IjJuzaLTn3pN9Kfpx9rMFCkxosS0hoSsoSNXw==", "http://www.scynexis.com/science/science.php", "http://scynexis.com/about/company-officers.php", "https://www.globenewswire.com/Tracker?data=q0R2g-fR4BZloHS-dO9BIr09rje-BBaTj0DCV6Ajkz4wCQIdyxVDD57RZ2quqvzWH8qlPJPk-gg1f3Um9C6UuSYXgKyWMszairBZAU1gjGIr2AvuTKqcukeMbtfF2fULZSWuNgdvjk8TXWPa3q-tu_e_G1U3jhAcsWzHm9u4kcA7GHKTQeU5fJ9iJa6HGL7ICxKa66zD-SJko2RrrGu4hTo32V9R0vQw-S2_ZuuhAf7VJf0ZKraF0Ee6WvxI9m30"], "published": "2018-01-05T00:05:00.000+02:00", "crawled": "2018-01-05T01:32:08.000+02:00", "highlightTitle": ""}