{"organizations": [], "uuid": "878ba1bfa905db9710095b73778bc87422fd1ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 31, "shares": 31, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219551884&w=1200&r=LYNXMPEE040GE", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-china-npl-funds/global-distressed-debt-funds-circle-china-again-eye-256-billion-bad-loans-market-idUSKBN1EU0RZ", "country": "US", "domain_rank": 408, "title": "Global distressed-debt funds circle China again, eye $256 bln bad-loans market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T11:05:00.000+02:00", "replies_count": 0, "uuid": "878ba1bfa905db9710095b73778bc87422fd1ac8"}, "author": "", "url": "https://www.reuters.com/article/us-china-npl-funds/global-distressed-debt-funds-circle-china-again-eye-256-billion-bad-loans-market-idUSKBN1EU0RZ", "ord_in_thread": 0, "title": "Global distressed-debt funds circle China again, eye $256 bln bad-loans market", "locations": [], "entities": {"persons": [{"name": "matthew miller", "sentiment": "none"}, {"name": "rao", "sentiment": "none"}, {"name": "tony rao", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "global", "sentiment": "negative"}, {"name": "blackstone group lp", "sentiment": "none"}, {"name": "bain capital credit lp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "oaktree", "sentiment": "none"}, {"name": "oaktree capital group llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Global distressed-debt specialists are stepping up their dealmaking in China after a decade, betting that the country is becoming serious about developing a market to tackle its $256 billion of official non-performing loans (NPLs).\nGroups such as Blackstone Group LP ( BX.N ) and Bain Capital Credit LP made their first investments in recent months, amid surging write-offs by banks and indications that China’s commercial bad loans market is set to deepen.\nOaktree Capital Group LLC ( OAK.N ) last month agreed to buy a portfolio of distressed loans with a face value of 3.1 billion yuan ($476.70 million), its fifth deal, according to Tony Rao, a partner with law firm Alpha & Leader, which helped provide due diligence on the deal.\nMore overseas cash is set to enter the market in 2018, said Rao, in spite of rising competition with local buyers that has sent average prices above 50 cents on the dollar.\nOaktree declined to comment.\nNPLs on commercial bank balance sheets officially amounted to 1.67 trillion yuan ($256.80 billion) at the end of September, or 1.74 percent of all loans. Overdue loans - those not yet technically considered bad - reached 3.4 trillion yuan. Many analysts estimate actual amounts are much higher.\nLoan write-offs by commercial lenders, one indication of how deeply banks are cleaning house, jumped 50 per cent to about 1.4 trillion yuan in 2016, according to estimates by UBS analyst Jason Bedford.\nAn initial wave of foreign interest in China’s bad loans a decade ago, led by big western banks, faded as deals failed to materialize and legal uncertainties multiplied.\nBut China’s distressed-debt market has become more commercialized since then. Once the monopoly of the Big Four asset management companies established in 1999 to take over bad loans from the country’s biggest lenders, the market today includes at least 55 regional managers while sales channels for bad loans now include online auctions, over-the-counter trades at local asset exchanges as well as NPL securitization.\n“The market has broadened,” said Phil Groves, president of DAC Management LLC, a China-focused alternative investment manager and bad-loan servicing company that was bought by Blackstone last year. “There’s more to buy, bigger portfolios, and different types of credit available.”\nBlackstone acquired its first-ever Chinese commercial loan portfolio for $195 million in August - the same month that Bain Capital Credit did its first-ever deal with the purchase of $200 million in mostly real estate backed loans in the coastal province of Jiangsu.\nBain is now looking at other real estate-backed portfolios and building a loan servicing team to handle future deals, said Kei Chua, Bain’s Hong Kong-based managing director.\n‘LOCALIZED BUSINESS’\nGlobal distressed-debt players said they’re encouraged by ongoing legal and structural changes in China - particularly in coastal regions - that has seen the emergence of professional appraisers and brokers, databases to check asset titles and liens, and greater certainty in the courts.\nForeign investors have for now mostly stuck to real estate deals because that market is better established with easily-valued collateral. Oaktree’s latest portfolio, consisting of 178 loans in China’s Pearl River Delta, is mostly but not entirely property-backed, according to Alpha & Leader’s Rao.\nChina’s bad loans market is, however, dominated by local distressed funds, many of which set up in the last two years, fund managers and advisers said, which has increased competition and raised NPL prices.\nA national industry association set up just two years ago has grown to more than 600 members from 200 initially.\n“There isn’t a national market,” said Deng Yanshan, executive director for investment at Lakeshore Capital, a domestic asset manager which oversees 2.5 billion yuan in funds. “This is still a localized business that’s based in provinces, counties and cities.”\nInternational firms must also deal with currency controls and related government approvals - creating an execution risk, particularly on timing and hedging costs, that their local rivals do not have to bear.\nBut Ted Osborn, an NPL specialist partner at PwC in Hong Kong, said the outlook for global distressed asset buyers remains good. “When China gets serious and needs to start selling big chunks of bad loans, foreigners are still the only ones with organized capital to do it.”\nReporting By Matthew Miller; Additional reporting by Engen Tham in Shanghai; Editing by Jennifer Hughes and Muralikumar Anantharaman\n ", "external_links": [], "published": "2018-01-05T11:05:00.000+02:00", "crawled": "2018-01-05T11:24:15.008+02:00", "highlightTitle": ""}