{"organizations": [], "uuid": "00b293b9381cc8b091f9ac00f7edb4a1e2cbf97b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-900140148.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/kim-jong-un-u-s-south-korea-alliance/", "country": "US", "domain_rank": 1196, "title": "Commentary: Kim Jong Un Peace Talk Won't Hurt US-South Korea Relations | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.166, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "00b293b9381cc8b091f9ac00f7edb4a1e2cbf97b"}, "author": "Scott Snyder", "url": "http://fortune.com/2018/01/03/kim-jong-un-u-s-south-korea-alliance/", "ord_in_thread": 0, "title": "Commentary: Kim Jong Un Peace Talk Won't Hurt US-South Korea Relations | Fortune", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "scott snyder", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}, {"name": "jung yeon-je", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "u.s.-south korea alliance", "sentiment": "none"}, {"name": "us-south korea", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North Korea Commentary: Why Kim Jong Un Will Fail at Breaking the U.S.-South Korea Alliance A man watches a television news broadcast showing North Korean leader Kim Jong-Un's New Year's speech, at a railway station in Seoul on January 1, 2018. Jung Yeon-Je—AFP/Getty Images By Scott Snyder January 3, 2018 \nAt least for the moment, Kim Jong Un has shifted gears from missile-testing to peace-talking. On Monday, he offered to discuss with South Korea the need for a peaceful winter Olympic atmosphere on the Korean peninsula. But to what end? \nThe clear objective of Kim’s dialogue offer to Moon Jae-in is to test South Korean willingness to trade short-term South Korean interests in peace and stability around next month’s Olympics for longer-term economic and security concessions. Those concessions—on timing of military exercises or restrictions on cash flows to North Korea—could compromise the effectiveness of the U.S.-Republic of Korea alliance and the U.S.-led international economic pressure strategy against North Korea. \nIn proposing “sincere efforts for a détente,” Kim urged the Moon administration to “discontinue all the nuclear war drills they stage with outside forces,” a clear reference to annual U.S.-ROK military exercises conducted in both March and August. In essence, Kim is asking the United States and South Korea to defer or cancel readiness-enhancing joint military exercises scheduled for 2018 as the price for a peaceful Olympic games. \nThe economic prong of North Korea’s strategy to open gaps between the United States and South Korea would be more subtle, but would introduce similar frictions between Washington and Seoul if South Korea pays too high an economic price for North Korean quiescence during the Olympics. For instance, North Korea could demand the reopening of the Kaesong Industrial Complex, a sort of joint venture just north of the demilitarized zone (DMZ) in which South Korean companies managed production of goods using North Korean labor. It closed in February 2016—a decade after its opening—following North Korea’s fourth nuclear test. Or North Korea could simply ask for subsidies in conjunction with support for the participation of North Korean athletes in the Olympic games as a price for keeping the peace. \nFor Kim Jong Un, the possibility of expanded participation by North Korean athletes in the games themselves will carry benefits for his own regime legitimation: North Korean triumphs will be celebrated widely and will be used internally to legitimize his dictatorial rule and to normalize North Korea’s international standing to his own people. \n\nLimited near-term South Korean political and economic concessions to North Korea may indeed be possible in order to secure a stable environment for the winter Olympic games, but the tasks of building momentum for longer-term inter-Korean cooperation will prove to be more difficult, primarily because Kim’s offer is so clearly intended as a tactical appeal rather than as a strategic opening. \nNorth Korean efforts to divide the U.S.-ROK alliance will also likely fail because North Korean appeals to the dream of independent national unification have become clumsy and unappealing to the South Korean public. Kim may generate some tweets from President Trump as well as rising political debates within South Korea over Moon’s standing and popularity, but Kim is unlikely to be able to lure Moon into fundamental missteps that would compromise the institutional strength of the U.S.-ROK alliance. \nGiven Kim’s efforts to pursue reform without opening by simultaneously pursuing economic and nuclear development, his best offer to South Korea will be peaceful coexistence, for a limited time only. While Kim’s strategy poses risks designed to pressure Moon and open up a breach in the U.S.-ROK alliance, who can blame Moon for trying to find ways to avert Kim from his longer-term trajectory of conflict with the United States? \nScott Snyder is senior fellow for Korea Studies at the Council on Foreign Relations and author of South Korea at the Crossroads: Autonomy and Alliance in an Era of Rival Powers . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T10:31:53.003+02:00", "highlightTitle": ""}