{"organizations": [], "uuid": "7033385efb961f747af227b30da358a332434be0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-game-changing-startups-recognized-at-rilas-retail-ceo-forum.html", "country": "US", "domain_rank": 767, "title": "Game-Changing Startups Recognized at RILA's Retail CEO Forum", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:33:00.000+02:00", "replies_count": 0, "uuid": "7033385efb961f747af227b30da358a332434be0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-game-changing-startups-recognized-at-rilas-retail-ceo-forum.html", "ord_in_thread": 0, "title": "Game-Changing Startups Recognized at RILA's Retail CEO Forum", "locations": [], "entities": {"persons": [{"name": "adam siegel", "sentiment": "none"}, {"name": "persado", "sentiment": "none"}], "locations": [{"name": "tucson", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}, {"name": "tucson", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "retail industry leaders association", "sentiment": "negative"}, {"name": "rila", "sentiment": "negative"}, {"name": "r)tech center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TUCSON, Ariz., Jan. 23, 2018 /PRNewswire-USNewswire/ -- The Retail Industry Leaders Association (RILA), the trade association for America's most recognized and innovative retailers, today announced the winners of the (R)Tech Retail CEO Innovation Awards. The three winners, IamBot , Multifold , and Persado , selected by RILA's Board of Directors, the CEOs and heads of innovation for America's largest retail brands, were featured in a showcase at RILA's Retail CEO Forum this week in Tucson.\n\"It's an incredible opportunity to have CEOs and chief innovation officers from America's most well-known brands interacting directly with emerging companies that, through their own commitment to innovation, are enabling the future of our industry,\" said RILA Senior Vice President of Research, Innovation, and Sustainability Adam Siegel. \"We're excited to recognize these three companies, who have embraced the charge from our consumers to deliver ubiquitous and ultra-personal shopping experiences and in turn, have developed game-changing technologies.\"\nRILA's (R)Tech Center believes that one trend is driving change in the industry more than any other: the trend toward ubiquitous and ultra-personal shopping. The winners were hand-picked by America's leading chief executives for their groundbreaking work in promoting the industry's move towards shopping wherever, whenever through artificial intelligence and augmented reality.\nDetails on the winners:\nIamBot helps brands and retailers sell directly to customers through messaging platforms. It is the comprehensive conversational commerce solution based on the state-of-the-art artificial intelligence. It seamlessly integrates with stores' messaging channels to provide customers with the ubiquitous and super convenient shopping experience.\n\"We're honored that IamBot was selected by this prestigious group of executives. We believe that conversational commerce is a key element of the industry's future, and we are glad that these CEOs see that as well.\"\nMultifold Retail believes that Augmented Reality will change the way that consumers shop. They offer all the tools retailers need: content creation (3D model creator, editor & library), viewers (Augmented Reality & 360 degrees), marketing and advertising tools (social media, catalog, in-store/OOH campaigns) and tracking/analytics.\n\"We are so honored to have been selected for this award by such a distinguished group of CEOs. Multifold aims to make it easier for companies to create, manage and launch Augmented Reality experiences for their customers. Our patent-pending web-based AR solution results in a more streamlined user experience and works across the majority of smart devices. We look forward to sharing our story with RILA members.\"\nPersado is the Marketing Language Cloud; AI generated language that resonates the most with any audience, segment or individual. Imagine having a data scientist and a copywriter for each person in your audience; you get the language that performs and the analytics explaining why, resulting in more business and unseen insights. Comprised of the world's largest database, with over a million words and phrases tagged and scored for consumer marketing, Persado's Marketing Language Cloud enables brands to increase acquisition and retention while building long term consumer relationships.\n\"Persado is proud to be selected as a winner of the inaugural (R)Tech Retail CEO Innovation Awards. We're excited for the opportunity to showcase our technology and challenge retail leaders to introduce data driven decision-making in new areas of their organizations, specifically within marketing content creation. Today's consumers seek to build lasting relationships with their favorite brands –– at Persado, we're helping brands navigate these relationships and shape the future of marketing through the effective use of AI-generated language that resonates with any audience or individual.\"\nRILA is the trade association of the world's largest and most innovative retail companies. RILA members include more than 200 retailers, product manufacturers, and service suppliers, which together account for more than $1.5 trillion in annual sales, millions of American jobs and more than 100,000 stores, manufacturing facilities and distribution centers domestically and abroad. RILA, in partnership with Accenture, launched the (R)Tech Center for Innovation in 2017 to help retailers navigate the industry's transformation.\nView original content: http://www.prnewswire.com/news-releases/game-changing-startups-recognized-at-rilas-retail-ceo-forum-300586699.html\nSOURCE Retail Industry Leaders Association", "external_links": ["http://www.youtube.com/watch?v=hcyzi_3Aoj4", "http://www.youtube.com/watch?v=KIu8Ssv4Sqc", "http://www.youtube.com/watch?v=YRmdwLHQvT8", "https://multifold.com/retail/", "http://www.prnewswire.com/news-releases/game-changing-startups-recognized-at-rilas-retail-ceo-forum-300586699.html", "https://persado.com/", "https://iambot.ai/", "https://rila.force.com/s/lt-event?id=a1T61000004mzJkEAI"], "published": "2018-01-23T18:33:00.000+02:00", "crawled": "2018-01-23T20:20:37.046+02:00", "highlightTitle": ""}