{"organizations": [], "uuid": "dc4ea761cf4317a78d53a72de790b13b8d2438ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-off-record-highs-as-wall-st-flags-dollar-firms-on-higher-yields-idUSL4N1PP2BV", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks off record highs as Wall St flags, dollar firms on higher yields", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:17:00.000+02:00", "replies_count": 0, "uuid": "dc4ea761cf4317a78d53a72de790b13b8d2438ed"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-off-record-highs-as-wall-st-flags-dollar-firms-on-higher-yields-idUSL4N1PP2BV", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks off record highs as Wall St flags, dollar firms on higher yields", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kospi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index down 1.1 pct, pulls away from record\n* Spreadbetters expect European stocks to open significantly lower\n* Dollar off 3-yr low as US yields climb to near 4-yr highs\n* Dollar’s bounce weighs on commodities like oil, gold\n* Trump’s State of the Union address awaited for clues\nBy Shinichi Saoshiro\nTOKYO, Jan 30 (Reuters) - Asian stocks retreated from record highs on Tuesday after a selloff in Apple shares and spike in bond yields knocked Wall Street lower, while the dollar found support as U.S. bond yields climbed to near four-year highs.\nMSCI’s broadest index of Asia-Pacific shares outside Japan was down 1.1 percent after rising to an all-time high the previous day. It was still on track for a 6.5 percent monthly gain.\nAustralian stocks shed 0.9 percent, South Korea’s KOSPI lost 1 percent and Japan’s Nikkei dropped 1.4 percent.\nHong Kong’s Hang Seng slipped 0.9 percent and Shanghai was down 0.8 percent.\nSpreadbetters expect the negative pressure to spill over to Europe, forecasting Britain’s FTSE to drop 0.7 percent at the open, Germany’s DAX to open 0.8 percent lower and France’s CAC to lose 0.6 percent at the open.\nThe bearish sentiment in Asia followed a softer lead from Wall Street, which has led a global equities rally over the past year thanks to strong world growth fuelling higher corporate earnings and stock valuations.\nOn Monday, U.S. stocks pulled back from record highs, with the Dow and the S&P 500 indexes marking their biggest one-day percentage declines in about five months, weighed down by a slide in Apple shares.\nThe dollar, however, enjoyed a reprieve from some persistent selling in the past few weeks.\nBuoyed by higher U.S. bond yields, the dollar index against a basket of six major currencies was 0.15 percent higher at 89.457, having bounced overnight from a three-year low of 88.438 plumbed on Friday when peers like the euro outshone the greenback.\nThe 10-year Treasury note yield stretched its overnight surge above 2.70 percent and reached its highest since April 2014 after comments from a European Central Bank official added to expectations that central banks globally will reduce stimulus as the economic outlook improves.\n“This is a rise in real interest rates, also reflecting a rise in inflation expectations,” said Masahiro Ichikawa, senior strategist at Sumitomo Mitsui Asset Management in Tokyo.\n“The yield rise may have bumped off U.S. stocks from highs, but a correction was due after their recent gains,” Ichikawa said.\nThe U.S. Treasury Department said on Monday that it expects to borrow $441 billion through the credit markets in the January-March quarter, less than announced previously.\nTreasury yields remained elevated, however, as U.S. borrowing is expected to continue increasing steadily in the coming years as the federal government looks for ways to fund budget deficits.\nMoreover, the bond market braced for potentially hawkish language from the Federal Reserve, which will begin its two-day policy meeting on Tuesday.\nThe focus was also on U.S. President Donald Trump’s State of the Union address scheduled later in the global day, with attention on his views on an infrastructure overhaul and trade.\nThe euro was down 0.2 percent at $1.2361 after slipping overnight from a three-year peak of $1.2538.\nThe dollar was 0.3 percent lower at 108.645 yen, unable to hold to a high of 109.205 scaled earlier.\n“The dollar lost a bit of traction against the yen as losses deepened for stocks in Tokyo and the rest of Asia. U.S. yields are going up, but players are hesitant to push dollar/yen higher ahead of President Trump’s address,” said Kyosuke Suzuki, director of forex at Societe Generale in Tokyo.\nThe Australian dollar shed 0.3 percent to $0.8072 after reaching $0.8136 on Friday, its highest since May 2015.\nOil prices extended losses after being pressured by the dollar’s bounce and rising U.S. crude output.\nU.S. crude futures were down 1.2 percent at $64.79 per barrel. Underpinned by the dollar’s recent slide, prices had risen to $66.66 per barrel on Thursday, the highest since December 2014.\nBrent crude fell 0.85 percent to $68.88 per barrel.\nSpot gold slipped to $1,334.10 an ounce, the lowest since Jan. 23, weighed by the stronger U.S. currency. The precious metal had climbed to $1,366.06 last week, its highest since August 2016. (Reporting by Shinichi Saoshiro; Editing by Shri Navaratnam and Kim Coghill)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T14:17:00.000+02:00", "crawled": "2018-01-31T16:29:47.000+02:00", "highlightTitle": ""}