{"organizations": [], "uuid": "b999b51345acddd4468270bda86be3c67b17f8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-canadian-cannabis-corp-announces-the-execution-of-a-revised-settlement-agreement-for-sale-of-the-assets-of-the-clinic.html", "country": "US", "domain_rank": 767, "title": "Canadian Cannabis Corp Announces the Execution of a Revised Settlement Agreement For Sale of the Assets of The Clinic Network Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:11:00.000+02:00", "replies_count": 0, "uuid": "b999b51345acddd4468270bda86be3c67b17f8b3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-canadian-cannabis-corp-announces-the-execution-of-a-revised-settlement-agreement-for-sale-of-the-assets-of-the-clinic.html", "ord_in_thread": 0, "title": "Canadian Cannabis Corp Announces the Execution of a Revised Settlement Agreement For Sale of the Assets of The Clinic Network Inc.", "locations": [], "entities": {"persons": [], "locations": [{"name": "oakville", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "clinic network inc", "sentiment": "negative"}, {"name": "canadian cannabis corp", "sentiment": "negative"}, {"name": "cannabis corp", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "ccan", "sentiment": "none"}, {"name": "the clinic network inc.", "sentiment": "none"}, {"name": "tcn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKVILLE, Ontario, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Canadian Cannabis Corp (\"CCAN\" or the \"Company\") (OTC PINK:CCAN) is pleased to announce that it has entered into a Revised Settlement Agreement (the “Agreement”) resulting in the settlement of certain outstanding debts and other financial obligations of the Company and its affiliates (collectively, the “Debts”) owed to certain creditors.\nAs contemplated by the Agreement, in partial consideration for the satisfaction of the Debts, CCAN has assigned certain assets of its wholly owned subsidiary, The Clinic Network Inc. (“TCN”). As additional consideration, CCAN and TCN will also enter into restrictive covenant agreements preventing it from competing with the business represented by the assigned TCN assets. The Agreement also places other obligations on CCAN in regard to its reporting obligations with the Securities and Exchange Commission and performing a successful financing for a Canadian entity as required by the creditors. The satisfaction of the Debts, termination of associated agreements, and release of the Company from the claims of the creditor are conditional on the Company successfully performing the financing for the Canadian entity.\nUnder the Agreement, upon closing 1,750,000 shares of Cura-Can Health Corp. (“Cura Can”) shall be deposited with the Escrow Agent as consideration, at which time one of two closings of the Agreement will occur and the assignment of the TCN assets consummated. After required payments and associated, estimated costs under the Agreement it is anticipated that TCN may realise net proceeds from sale of the Cura Can shares of approximately CAD $250,000.\nAdditionally, CCAN has been granted an option from Cura Can to purchase up to an additional 3,000,000 Common Shares of Cura Can at $1.00 per Common Share up until February 28, 2018.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 (The \"Act\"). When used in the preceding discussion, words such as “potential,” \"pleased,\" \"will,\" \"conditional,\" \"anticipated,\" \"option,\" or \"affords us,\" and similar conditional expressions are intended to identify forward-looking statements within the meaning of the Act and are subject to the safe harbor created by the Act. Such statements are neither historical facts nor assurance of future performance. Instead, they are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy and other future conditions and, therefore, subject to certain risks and uncertainties and actual results could differ materially from those expressed in any of the forward-looking statements. Such risks and uncertainties include, but are not limited to, market conditions, competitive factors, the ability to successfully complete additional financing and other risks described in the Company's SEC reports and filings. Therefore, you should not rely on any of these forward-looking statements\nAny forward-looking statement made by us in this press release is based only on information currently available to us and speaks only as of the date on which it is made. We undertake no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments or otherwise.\nAbout Canadian Cannabis Corp.\nCanadian Cannabis Corp (\"CCAN\") (OTC PINK:CCAN) is pursuing a business plan focused on entering strategic transactions in the distribution chain of medical marijuana. The Company believes its business model of engaging in strategic transactions to solidify the distribution chain by matching suppliers with a consistent demand source and providing suppliers with expert production consulting will bring a strategic advantage to the marketplace.\nInvestors Relations Contact:\nWall Street Media Group\n1-866-465-6551 or info@Wallstreetmediagroup.com\nSource:Canadian Cannabis Corp.", "external_links": [], "published": "2018-01-04T16:11:00.000+02:00", "crawled": "2018-01-04T16:42:16.007+02:00", "highlightTitle": ""}