{"organizations": [], "uuid": "9ee0f5c76fe8239bdf294e1366ffb7c9392c8108", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-dented-by-mnuchin-comments-slips-vs-all-major-peers-idUSL8N1PJ4FN", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar dented by Mnuchin comments, slips vs all major peers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-24T23:30:00.000+02:00", "replies_count": 0, "uuid": "9ee0f5c76fe8239bdf294e1366ffb7c9392c8108"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-dented-by-mnuchin-comments-slips-vs-all-major-peers-idUSL8N1PJ4FN", "ord_in_thread": 0, "title": "FOREX-Dollar dented by Mnuchin comments, slips vs all major peers", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saqib iqbal ahmed", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "sireen harajli", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mizuho", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Mnuchin says weak dollar is good for U.S. trade\n* Dollar index hits fresh 3-year low\n* Trump expected to push “America First” message in Davos speech (Updates prices and market activity to U.S. market open, changes dateline; previous LONDON)\nBy Saqib Iqbal Ahmed\nNEW YORK, Jan 24 (Reuters) - The dollar fell to a fresh three-year low against a basket of major currencies on Wednesday after the U.S. Treasury secretary said he welcomed weakness in the currency, and as investors worried about U.S. President Donald Trump’s protectionist agenda.\nSpeaking at the World Economic Forum in Davos on the eve of Trump’s arrival at the Swiss resort, Treasury Secretary Steven Mnuchin said the weaker dollar was positive for U.S. trade.\n“It’s quite significant given that this is the first time in a very long time that a Treasury secretary has spoken against a strong dollar,” said Sireen Harajli, FX strategist at Mizuho.\nMnuchin’s comments provided a fresh trigger for selling after dollar bears were already emboldened by Trump’s executive order imposing steep import tariffs on washing machines and solar panels, a move condemned by China and South Korea, analysts said.\nWhite House officials said on Tuesday that Trump would use his speech at Davos on Friday to stress his “America First” policies.\n“Any time we have these types of trade frictions it’s going to put more negative sentiment on the currency,” said Minh Trang, senior currency trader at Silicon Valley Bank in Santa Clara, California.\nThe dollar index, which measures the greenback against a basket of six major currencies, was down 0.93 at 89.283, slipping below 90 for the first time since December 2014. The dollar was down about 1 percent against the yen .\nThe dollar has pressured for months by the view that the Federal Reserve is no longer the only game in town when it comes to tighter monetary policy as growth in other regions, Europe in particular, picks up speed.\nOn Wednesday, the euro was up 0.78 percent against the greenback. Euro zone businesses kicked off 2018 in much better shape than anyone polled by Reuters expected, ramping up activity at the fastest rate since mid-2006, a survey showed.\nInvestors were keenly awaiting the European Central Bank’s meeting on Thursday for clues on the outlook for euro zone monetary policy.\nThe euro may have more room to rise given the negative sentiment around the greenback, Trang said.\nSterling jumped above $1.42 after strong British employment data helped extend a recent rally driven by optimism Britain will have a relatively smooth exit from the European Union. (Reporting by Saqib Iqbal Ahmed; Additional reporting by Karen Brettell; Editing by Meredith Mazzilli)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T23:30:00.000+02:00", "crawled": "2018-01-25T13:06:37.008+02:00", "highlightTitle": ""}