{"organizations": [], "uuid": "115c3e07914c77800604679ab75698d25b820a32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/binh-son-ipo/vietnam-raises-245-mln-from-refinery-operator-binh-sons-ipo-idUSL8N1PC4OI", "country": "US", "domain_rank": 408, "title": "Vietnam raises $245 mln from refinery operator Binh Son's IPO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.569, "site_type": "news", "published": "2018-01-17T22:49:00.000+02:00", "replies_count": 0, "uuid": "115c3e07914c77800604679ab75698d25b820a32"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/binh-son-ipo/vietnam-raises-245-mln-from-refinery-operator-binh-sons-ipo-idUSL8N1PC4OI", "ord_in_thread": 0, "title": "Vietnam raises $245 mln from refinery operator Binh Son's IPO", "locations": [], "entities": {"persons": [{"name": "binh son", "sentiment": "negative"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}], "organizations": [{"name": "bsr", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "binh son refining and petrochemical company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* State-owned Binh Son’s IPO proceeds exceed expectations\n* Sale was oversubscribed by 2.7 times\n* Foreign investors bought 4.77 percent stake\nHANOI, Jan 17 (Reuters) - The Vietnamese government has raised 5.57 trillion dong ($245 million) by selling a 7.79 percent stake in refinery operator Binh Son Refining and Petrochemical company in an initial public offering, the company said on Wednesday.\nThe proceeds exceeded the Vietnamese government’s plan to raise at least $155 million from the sale.\nThe stake sale is part of the Vietnamese government’s plan to privatise hundreds of state-owned enterprises to boost their performance, relax a tight state budget and reform an economy that is highly reliant on foreign investments.\nDemand at Wednesday’s IPO of Binh Son (BSR), which operates Vietnam’s first oil refinery, exceeded supply by 2.7 times, the firm said on its website.\nA total of 4,079 investors took part in the sale, including 74 foreigners, BSR said. Overseas investors bought a 4.77 percent stake in the company at the IPO.\n“It is a high quality asset and therefore is highly evaluated by the market,” BSR’s Chief Executive Officer, Tran Ngoc Nguyen, told Reuters.\nVietnam was among the fastest rising stock markets last year, with the benchmark VN Index leaping nearly 50 percent in 2017 supported by listings and share sales in companies such as brewer Sabeco, mall operator Vincom Retail and budget airline Vietjet Aviation.\nA further 49 percent stake in BSR, the operator of the $3-billion Dung Quat oil refinery, will be sold to strategic investors, including both domestic and foreign investors, but its foreign ownership is capped at 49 percent.\nVietnam has a shortage of refinery products, with Dung Quat refinery capable of supplying only 30 percent of domestic demand.\nNghi Son refinery, due to start commercial operations this year, would bring total domestic supply to 80 percent of demand.\nBSR is among dozens of units under the wing of state oil and gas company PetroVietnam (PVN).\nPVN is caught up in a widespread corruption crackdown. Many PVN officials are on trial or have been given sentences ranging from jail terms to the death penalty.\nBSR estimated its 2017 net profit jumped 79 percent from a year earlier to 8.03 trillion dong.\nThe Vietnamese government is also selling shares in two other state energy firms, Petrovietnam Power Co and PetroVietnam Oil Corp, later this month. ($1 = 22,711 dong) (Reporting by Mai Nguyen; Editing by Adrian Croft)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T22:49:00.000+02:00", "crawled": "2018-01-18T16:06:36.002+02:00", "highlightTitle": ""}