{"organizations": [], "uuid": "dcfe1a6add50a6c1fe0e365306019b7fe9e0fc01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-near-flat-in-seesaw-session-boc-hikes-despite-nafta-cloud-idUSL1N1PC287", "country": "US", "domain_rank": 408, "title": "CANADA FX DEBT-C$ near flat in seesaw session; BoC hikes despite NAFTA cloud", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.966, "site_type": "news", "published": "2018-01-18T05:44:00.000+02:00", "replies_count": 0, "uuid": "dcfe1a6add50a6c1fe0e365306019b7fe9e0fc01"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-near-flat-in-seesaw-session-boc-hikes-despite-nafta-cloud-idUSL1N1PC287", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ near flat in seesaw session; BoC hikes despite NAFTA cloud", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "fergal smith", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "boc", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates prices) * Canadian dollar at C$1.2427, or 80.47 U.S. cents * Loonie touches its strongest since Jan. 5 at C$1.2362 * Bond prices lower across much of the yield curve * Canada-U.S. 2-year spread widens by 1.7 basis points By Fergal Smith TORONTO, Jan 17 (Reuters) - The Canadian dollar changed little against the greenback in a Wednesday's seesaw session after the Bank of Canada hiked interest rates and indicated confidence in the outlook for the economy, but sounded a cautious tone on the future of NAFTA. The central bank raised its benchmark interest rate by 25 basis points to 1.25 percent, as expected, after recent data showed strong job growth and firmer inflation. The loonie initially fell as the bank's worries on prospects for the North American Free Trade Agreement (NAFTA) dented expectations for additional rate increases. Canada, which sends about 75 percent of its exports to the United States, is increasingly convinced U.S. President Donald Trump will soon announce that the United States intends to pull out of NAFTA. But the \"balanced tone\" of a news conference with Bank of Canada Governor Stephen Poloz and Senior Deputy Governor Carolyn Wilkins helped the currency recover, said Eric Theoret, currency strategist at Scotiabank. \"They were really quick to highlight a lot of the positive and constructive developments that made them optimistic about the forecast and the outlook for the economy,\" Theoret said. The central bank raised its forecast for 2018 growth to 2.2 percent from 2.1 percent, while it also bumped up its forecast for 2019, after an estimated 3.0 percent expansion in 2017. At 4 p.m. EST (2100 GMT), the Canadian dollar was trading nearly unchanged at C$1.2427 to the greenback, or 80.47 U.S. cents. The currency's weakest level of the session was C$1.2540, while it touched its strongest since Jan. 5 at C$1.2362. The price of oil, one of Canada's major exports, rose ahead of the release of U.S. petroleum data that was expected to show a ninth straight weekly drawdown in crude inventories. U.S. crude oil futures settled 0.4 percent higher at $63.97 a barrel. Canadian government bond prices were lower across much of the yield curve in sympathy with U.S. Treasuries. The two-year was down 2 Canadian cents to yield 1.784 percent and the 10-year declined 22 Canadian cents to yield 2.199 percent. The gap between the two-year yield and its U.S. counterpart widened by 1.7 basis points to a spread of -26.2 basis points, its widest since Dec. 18. (Reporting by Fergal Smith; Editing by Frances Kerry and Sandra Maler)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T05:44:00.000+02:00", "crawled": "2018-01-18T01:05:33.019+02:00", "highlightTitle": ""}