{"organizations": [], "uuid": "13633a8ea9b7fc7a4f1c2ab72039907980bb313d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-shareowners-elect-six-directors-at-new-jersey-resources-annual-meeting.html", "country": "US", "domain_rank": 767, "title": "Shareowners Elect Six Directors at New Jersey Resources Annual Meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:18:00.000+02:00", "replies_count": 0, "uuid": "13633a8ea9b7fc7a4f1c2ab72039907980bb313d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-shareowners-elect-six-directors-at-new-jersey-resources-annual-meeting.html", "ord_in_thread": 0, "title": "Shareowners Elect Six Directors at New Jersey Resources Annual Meeting", "locations": [], "entities": {"persons": [{"name": "alfred c. koeppe", "sentiment": "negative"}, {"name": "mike terry", "sentiment": "negative"}, {"name": "maureen a. borkowski", "sentiment": "none"}, {"name": "donald l. correll", "sentiment": "none"}, {"name": "j. terry strange", "sentiment": "none"}, {"name": "thomas c. o’connor", "sentiment": "none"}, {"name": "larry codey", "sentiment": "none"}, {"name": "laurence m. downes", "sentiment": "none"}, {"name": "m. william howard jr.", "sentiment": "none"}, {"name": "george r. zoffinger", "sentiment": "none"}, {"name": "lawrence r. codey", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "public service electric", "sentiment": "none"}, {"name": "njr", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "new jersey resources", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "First Responder Mike Terry Honored with the Alfred C. Koeppe Service Award\nMOUNTAIN LAKES, N.J.--(BUSINESS WIRE)-- New Jersey Resources (NYSE:NJR), today hosted its 65 th Annual Meeting, where shareowners elected Maureen A. Borkowski and Thomas C. O’Connor to the company’s board of directors for one-year terms and Donald L. Correll, M. William Howard Jr., J. Terry Strange and George R. Zoffinger for new three-year terms.\nAdditionally, Director Lawrence R. Codey retired from the board. The former Public Service Electric and Gas president, chief operating officer and director joined the NJR board of directors in 2000 and served as the lead director since 2003.\n“Larry Codey has provided our board with invaluable leadership and a keen understanding of the critical issues facing utility companies,” said Laurence M. Downes, chairman and CEO of New Jersey Resources. “We are grateful for all he has done for our company and customers.”\nShareowners also approved a non-binding advisory resolution on the compensation of NJR’s named executive officers and the ratification of the appointment of Deloitte & Touche LLP as its independent registered public accounting firm for the fiscal year ending September 30, 2018.\n“The leadership, expertise and diverse perspectives of our board of directors makes us a better, stronger company,” Downes continued. “Guided by our strategic vision and the dedication of our more than 1,000 employees, we remain committed to rewarding the trust our shareowners place in us year after year.”\nAlso at the meeting, First Responder Mike Terry, of Neptune, New Jersey, was recognized with the Alfred C. Koeppe Service Award. Created in honor of Al Koeppe, a member of NJR’s board of directors who passed away in 2016, the award is the highest honor NJR can bestow upon a union employee, who exemplifies a commitment to service that improves the lives of others, enhances New Jersey’s communities and benefits the company.\nMike joined New Jersey Natural Gas, the principal subsidiary of NJR, in 2004. Throughout his 14-year career, he has proven to be a person of character, courage and compassion. In addition to his dedicated service to customers, Mike is a committed supporter of St. Jude’s Children Research Hospital in honor of his daughter, Mya, who passed away in 2013 at the age of 10 following a five and a half year battle with cancer. In her memory, he created Mya's Warriors to help raise money for pediatric cancer research. In the five years since Mya passed, Mike has raised over $40,000 for St. Jude’s to help those children and families who are dealing with the challenges his family faced.\n“Al Koeppe believed the greatest contribution you can make is to have a positive and lasting impact on the lives of others,” Downes said. “I can think of no one who exemplifies this belief more than Mike Terry. His spirit, strength and commitment to service make him a fitting and deserving recipient of this year’s Alfred C. Koeppe Service Award.”\nAbout New Jersey Resources\nNew Jersey Resources (NYSE:NJR) is a Fortune 1000 company that, through its subsidiaries, provides safe and reliable natural gas and clean energy services, including transportation, distribution, asset management and home services. NJR is composed of five primary businesses:\nNew Jersey Natural Gas, NJR’s principal subsidiary, operates and maintains over 7,400 miles of natural gas transportation and distribution infrastructure to serve over half a million customers in New Jersey’s Monmouth, Ocean and parts of Morris, Middlesex and Burlington counties. NJR Clean Energy Ventures invests in, owns and operates solar and onshore wind projects with a total capacity of more than 315 megawatts, providing residential and commercial customers with low-carbon solutions. NJR Energy Services manages a diversified portfolio of natural gas transportation and storage assets and provides physical natural gas services and customized energy solutions to its customers across North America. NJR Midstream serves customers from local distributors and producers to electric generators and wholesale marketers through its 50 percent equity ownership in the Steckman Ridge natural gas storage facility and its stake in Dominion Midstream Partners, L.P., as well as its 20 percent equity interest in the PennEast Pipeline Project. NJR Home Services provides service contracts as well as heating, central air conditioning, water heaters, standby generators, solar and other indoor and outdoor comfort products to residential homes throughout New Jersey.\nNJR and its more than 1,000 employees are committed to helping customers save energy and money by promoting conservation and encouraging efficiency through Conserve to Preserve ® and initiatives such as The SAVEGREEN Project ® and The Sunlight Advantage ® .\nFor more information about NJR:\nVisit www.njresources.com .\nFollow us on Twitter @NJNaturalGas.\n“Like” us on facebook.com/NewJerseyNaturalGas .\nDownload our free NJR investor relations app for iPad, iPhone and Android.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006127/en/\nNew Jersey Resources\nMedia:\nMichael Kinney, 732-938-1031\nmkinney@njresources.com\nor\nInvestors:\nDennis Puma, 732-938-1229\ndpuma@njresources.com\nSource: New Jersey Resources", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.njresources.com&esheet=51748509&newsitemid=20180124006127&lan=en-US&anchor=www.njresources.com&index=1&md5=556a5cef29ed2a69823b8fdfdc3529fb", "http://facebook.com/NewJerseyNaturalGas", "http://www.businesswire.com/news/home/20180124006127/en/"], "published": "2018-01-24T23:18:00.000+02:00", "crawled": "2018-01-25T02:03:41.000+02:00", "highlightTitle": ""}