{"organizations": [], "uuid": "ca0f4d7537ee1385e2298c0b5b03faff47ea3aa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-colony-northstar-completes-sale-of-the-townsend-group-to-aon.html", "country": "US", "domain_rank": 767, "title": "Colony NorthStar Completes Sale of The Townsend Group to Aon", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "ca0f4d7537ee1385e2298c0b5b03faff47ea3aa3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-colony-northstar-completes-sale-of-the-townsend-group-to-aon.html", "ord_in_thread": 0, "title": "Colony NorthStar Completes Sale of The Townsend Group to Aon", "locations": [], "entities": {"persons": [{"name": "richard b. saltzman", "sentiment": "none"}, {"name": "townsend", "sentiment": "none"}], "locations": [{"name": "aon los angeles", "sentiment": "none"}], "organizations": [{"name": "northstar", "sentiment": "negative"}, {"name": "townsend group", "sentiment": "negative"}, {"name": "colony northstar", "sentiment": "negative"}, {"name": "colony northstar, inc.", "sentiment": "neutral"}, {"name": "aon", "sentiment": "none"}, {"name": "aon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- Colony NorthStar, Inc. (“Colony NorthStar” or the “Company”) (NYSE: CLNS), a leading global real estate and investment management firm, announced today that is has closed its previously announced sale of The Townsend Group (“Townsend”) to Aon plc (NYSE: AON). Aon is a global professional services firm providing a broad range of risk, retirement and health solutions. Colony NorthStar was the majority owner of Townsend, a leading provider of global investment management and advisory services primarily focused on real estate and real assets.\nOn September 1, 2017 Colony NorthStar announced the agreement to sell Townsend to Aon for $475 million. Net proceeds to affiliates of Colony NorthStar, Inc. for its ownership interest after transaction and other expenses is estimated to be approximately $379 million.\n“The closing of the Townsend sale is a great outcome for Colony NorthStar and its shareholders as well as for the acquirer, Aon, and Townsend employees,” said Richard B. Saltzman, President and Chief Executive Officer of Colony NorthStar. “Townsend’s market leading business is situated now in a synergistic home while we continue our path towards simplification and reinvesting proceeds from non-core liquidity events into our strategic priorities.”\nMorgan Stanley & Co. LLC acted as exclusive financial advisor to Colony NorthStar for the transaction.\nAbout Colony NorthStar, Inc.\nColony NorthStar, Inc. (NYSE:CLNS) is a leading global real estate and investment management firm. The Company resulted from the January 2017 merger between Colony Capital, Inc., NorthStar Asset Management Group Inc. and NorthStar Realty Finance Corp. The Company has significant property holdings in the healthcare, industrial and hospitality sectors, other equity and debt investments and an embedded institutional and retail investment management business. The Company currently has assets under management of $57 billion as of September 30, 2017 (which includes approximately $15 billion through its ownership of the Townsend Group) and manages capital on behalf of its stockholders, as well as institutional and retail investors in private funds, non-traded and traded real estate investment trusts and registered investment companies. The firm maintains principal offices in Los Angeles and New York, with more than 500 employees in offices located across 18 cities in ten countries. The Company will elect to be taxed as a REIT for U.S. federal income tax purposes. For additional information regarding the Company and its management and business, please refer to www.clns.com .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of the federal securities laws. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify forward-looking statements by the use of forward-looking terminology such as “may,” “will,” “should,” “expects,” “intends,” “plans,” “anticipates,” “believes,” “estimates,” “predicts,” or “potential” or the negative of these words and phrases or similar words or phrases which are predictions of or indicate future events or trends and which do not relate solely to historical matters. You can also identify forward-looking statements by discussions of strategy, plans or intentions.\nForward-looking statements involve known and unknown risks, uncertainties, assumptions and contingencies, many of which are beyond the Company’s control, and may cause the Company’s actual results to differ significantly from those expressed in any forward-looking statement. Factors that might cause such a difference include, without limitation, the effect of the sale of The Townsend Group on the Company’s performance and its positive impact to stockholders, if any; the ability of the Company (i) to simplify its business strategy or (ii) to deploy proceeds from non-liquidity events in strategically important areas, on a timely basis or at all; and the impact of legislative, regulatory and competitive changes, and other risks and uncertainties detailed in our filings with the U.S. Securities and Exchange Commission (“SEC”). All forward-looking statements reflect the Company’s good faith beliefs, assumptions and expectations, but they are not guarantees of future performance. Additional information about these and other factors can be found in Colony NorthStar’s reports filed from time to time with the SEC.\nColony NorthStar cautions investors not to unduly rely on any forward-looking statements. The forward-looking statements speak only as of the date of this press release. Colony NorthStar is under no duty to update any of these forward-looking statements after the date of this press release, nor to conform prior statements to actual results or revised expectations, and Colony NorthStar does not intend to do so.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005107/en/\nMedia:\nOwen Blicksilver Public Relations, Inc.\nCaroline Luz, caroline@blicksilverpr.com , 203-656-2829, or\nLisa Baker, lisa@blicksilverpr.com , 914-725-5949\nor\nInvestor:\nAddo Investor Relations\nLasse Glassen, lglassen@addoir.com , 310-829-5400\nSource: Colony NorthStar, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.clns.com&esheet=51736212&newsitemid=20180102005107&lan=en-US&anchor=www.clns.com&index=1&md5=b55776db27b0974a849401abd896369b", "http://www.businesswire.com/news/home/20180102005107/en/"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:19:55.022+02:00", "highlightTitle": ""}