{"organizations": [], "uuid": "c10c57252e0c1a768ff801d2226f4b43a10572b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226339119&w=1200&r=LYNXMPEE0S16H", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-alibaba-olympics-technology/alibaba-looks-to-modernise-olympics-starting-in-pyeongchang-idUKKBN1FI1ZH", "country": "US", "domain_rank": 408, "title": "Alibaba looks to modernise Olympics starting in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:48:00.000+02:00", "replies_count": 0, "uuid": "c10c57252e0c1a768ff801d2226f4b43a10572b1"}, "author": "", "url": "https://uk.reuters.com/article/uk-alibaba-olympics-technology/alibaba-looks-to-modernise-olympics-starting-in-pyeongchang-idUKKBN1FI1ZH", "ord_in_thread": 0, "title": "Alibaba looks to modernise Olympics starting in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "liana b.", "sentiment": "negative"}, {"name": "chris tung", "sentiment": "none"}, {"name": "baker", "sentiment": "none"}, {"name": "tung", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "alibaba", "sentiment": "negative"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 53 PM / Updated 11 minutes ago Alibaba looks to modernise Olympics starting in Pyeongchang Liana B. Baker 3 Min Read \nSAN FRANCISCO (Reuters) - Alibaba Group Holding Ltd, one of the few Olympics sponsors signed up until 2028, said it wants to upgrade the technology that keeps the Games running and will study the Pyeongchang Games to help find ways to save future host countries money. \n“Pyeongchang will be a very important learning opportunity for our team to see how things are working and what’s missing,” Alibaba’s chief marketing officer Chris Tung said in an interview. Alibaba, the cloud-services and e-commerce provider for the Olympics, will take back what it has learnt at the Feb. 9 to 25 Pyeongchang Winter Games and develop solutions for the next Games. \nTicketing, media and video services are among the areas that Tung said Alibaba wants to improve. It especially wants to end the inefficient practice of building from scratch local data centres and IT services for each Olympic Games. \n“It will be great if a lot of the back end systems from hosting a Games can be hosted on the cloud and can be reused from Games to Games to enhance the cost efficiency,” he said. \nAtos SE, the French information services company that is also a top sponsor, said on its website that all critical IT systems in Pyeongchang have already been moved to the cloud using its technology. \nAlibaba will send to South Korea between 200 and 300 employees from across all its management teams, Tung said, adding that he wants the “organizers to see how the operations could be made more efficient, effective and secure.” \nAlibaba’s views are in line with the Olympics Agenda 2020 reforms that also aimed to make the Games more attractive and cut the cost of hosting them. The next Winter Olympics after Pyeongchang will be in 2022 on Alibaba’s home turf in China, where the company said it wants to make the experience of going to an Olympics totally different for consumers, whether it’s how they buy tickets, use mobile technology or find related events in Beijing. \nAt Pyeongchang, Alibaba said on its website that it will put on a showcase at the Gangneung Olympic Park demonstrating concepts Alibaba is looking to pursue for future Games, including facial recognition technology, travel guidance, content creation and better ways to buy Olympics merchandise. Related Coverage Alibaba unveils Olympics campaign in first corporate ad push outside China \n“We’re new to the Olympics games but we’ve been studying what would be solutions to the pain points that game hosting cities have been facing over the years,” Tung said. \nAs for the cold weather expected in Pyeongchang, there will also be a daily tea ritual at the Alibaba site to keep fans warm. Reporting by Liana B. Baker in San Francisco; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-29T17:48:00.000+02:00", "crawled": "2018-01-29T18:07:59.016+02:00", "highlightTitle": ""}