{"organizations": [], "uuid": "965e8299284855d70eea838388139f59b2920b50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-greece/update-1-euro-zone-awaits-expert-view-to-clear-new-greek-loans-idUSL8N1PH4KA", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Euro zone awaits expert view to clear new Greek loans", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-22T22:55:00.000+02:00", "replies_count": 0, "uuid": "965e8299284855d70eea838388139f59b2920b50"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-greece/update-1-euro-zone-awaits-expert-view-to-clear-new-greek-loans-idUSL8N1PH4KA", "ord_in_thread": 0, "title": "UPDATE 1-Euro zone awaits expert view to clear new Greek loans", "locations": [], "entities": {"persons": [{"name": "valdis dombrovskis", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "esm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds background, more commissioner comments)\nBRUSSELS, Jan 22 (Reuters) - Euro zone finance ministers will decide on Monday whether Greece is eligible for the next tranche of bailout loans after listening to an expert review of reforms recently adopted by Athens, top euro zone officials said.\nTo pay out 6.7 billion euros ($8.2 billion) of new loans, probably in more than one tranche, international lenders have asked Greece first to adopt 110 “prior actions”.\nGreece passed a so-called omnibus bill last week to meet that condition and experts -- the European Commission, the bailout fund ESM and the European Central Bank -- have been looking at them to see if they cover what was agreed.\nCommission Vice President Valdis Dombrovskis told reporters before finance ministers met that Greece was on track.\n“Greece has over-performed its fiscal targets during the last three years so now, provided that all prior actions are delivered, the council (of ministers) could decide on the next disbursement,” he said.\nSenior euro zone officials preparing the ministers’ meeting, last week said Athens completed 92 of the requested actions, which meant the ministers could agree “in principle” on Monday to disburse once the remaining actions are completed.\n“We have now to listen to the ESM on the issue of disbursement, but certainly this is the natural sequence of the programme,” the chairman of euro zone finance ministers Mario Centeno told reporters on entering the talks.\nEuropean Economics Commissioner Pierre Moscovici said he believed ministers would look favourably on Greek reforms.\n“I‘m quite confident that, on the basis of the good work that has been made on prior actions voted ... in the Greek parliament, we will conclude today the third review of the programme Greece,” Moscovici said before the meeting.\nGreece is to use the money to redeem maturing debt, pay arrears and create a cash buffer for when it leaves the bailout, its third one since ballooning deficit and debt triggered a euro zone sovereign debt crisis in 2010.\nGreece should return to market financing in August.\nIt could ask for a precautionary credit from the ESM to cushion it from market swings, but this would entail continued euro zone control over economic policy, something for which Athens has no appetite.\nThe final review of Greece’s performance under the bailout is expected in June, with disbursements of the last loans in July. ($1 = 0.8165 euros) (Reporting By Jan Strupczewski, Francesco Guarascio, Robert-Jan Bartunek and Philip Blenkinsop; editing by Philip Blenkinsop)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:55:00.000+02:00", "crawled": "2018-01-23T17:51:54.010+02:00", "highlightTitle": ""}