{"organizations": [], "uuid": "8159dff2e08e01f7cea137f367da4de08f14a603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-positiveid-announces-2017-highlights-and-projects-continued-30-percent-growth.html", "country": "US", "domain_rank": 767, "title": "PositiveID Announces 2017 Highlights and Projects Continued 30% Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:00:00.000+02:00", "replies_count": 0, "uuid": "8159dff2e08e01f7cea137f367da4de08f14a603"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-positiveid-announces-2017-highlights-and-projects-continued-30-percent-growth.html", "ord_in_thread": 0, "title": "PositiveID Announces 2017 Highlights and Projects Continued 30% Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "national academies of science", "sentiment": "none"}, {"name": "biowatch panel", "sentiment": "none"}, {"name": "excitepcr/molecular diagnostics highlights formed excitepcr", "sentiment": "none"}, {"name": "genarraytion inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DELRAY BEACH, Fla., Jan. 10, 2018 (GLOBE NEWSWIRE) -- PositiveID Corporation (“PositiveID” or “Company”) (OTC:PSID), a life sciences company focused on detection and diagnostics, announced today 2017 highlights for its molecular diagnostics, mobile labs and medical devices businesses. The Company also reiterated its projection for 30% growth for the 2017 fourth quarter and 2018 first quarter.\nExcitePCR/Molecular Diagnostics Highlights\nFormed ExcitePCR subsidiary to better position FireflyDX for the global, point-of-care diagnostics market and provide a platform for strategic partnership and financing opportunities Announced a new product under development, the FireflyDX-Portable, a lightweight, real-time pathogen detection system with commercial availability slated for late 2018 ExcitePCR’s CEO featured on BioWatch Panel at National Academies of Science, Engineering, and Medicine Detected Ebola virus on its lab-based FireflyDX prototype system in a collaborated effort with its assay partner, GenArraytion Inc. Formed ExcitePCR board of advisors with industry and subject matter experts Continued its testing and evaluation of FireflyDX for applications ranging from food safety to infectious disease detection\nE-N-G Mobile Systems (“ENG”)/Mobile Labs Highlights\nClosed strategic investment of $1.5 million in ENG Received a $1.2 million purchase order for mobile labs from a single customer, the largest single order received since PositiveID acquired ENG Began incorporating advanced drone technology with its product offerings to offer all-inclusive command and control centers and utility operations vehicles with real-time communication capabilities in challenging environments Celebrated 40 years in business Total vehicle bookings (new contracts and purchase orders signed) up 100% over prior year Expanded service business to offer mobile maintenance and repair\nThermomedics/Caregiver Medical Device Highlights\nCompleted development and commenced production of a Bluetooth-enabled version of the Caregiver® thermometer to connect wirelessly to patient monitoring stations Expanded distribution for Caregiver with National Distribution & Contracting, Inc., and MedPro Associates Exhibited at several industry conferences to increase exposure and awareness for Caregiver and generate qualified leads for its national network of distributors\n“In 2017, we executed on a number of our goals in our mobile labs and medical device businesses, while continuing to pursue our long-term vision for our FireflyDX products, which includes finding the right strategic partner to complete the testing and development of the FireflyDX-Portable and FireflyDX-Handheld,” stated William J. Caragol, PositiveID’s Chairman and CEO. “Looking ahead, as we continue to build bookings within our mobile labs business and see a more robust sales pipeline for Caregiver, we believe we can deliver growth in excess of 30% for both the 2017 fourth quarter and 2018 first quarter, with continued strength expected through the first half of 2018 and beyond.”\nPositiveID, through its ExcitePCR Corporation subsidiary, is developing the FireflyDX family of products, automated pathogen detection systems for rapid diagnostics at the point-of-care/point-of-need (“POC/PON”). The FireflyDX family products, consisting of the FireflyDX-Portable™ and the FireflyDX-Handheld™, are designed to be lab quality, real-time devices able to detect pathogens faster and less expensively than existing systems. FireflyDX’s applications include POC/PON detection of pathogenic organisms; agricultural and food screening in both domestic sectors and developing countries; and detection of biological agents associated with weapons of mass destruction.\nPositiveID’s E-N-G Mobile Systems (“ENG”) subsidiary designs and builds mobile laboratories, wireless support vehicles (cell-on-wheels and cell-on-light-trucks), radio frequency (“RF”) test platforms, broadcast news vehicles, and other technical vehicles. ENG has delivered more than 1,500 specialty vehicles to customers around the globe, including more than 400 mobile laboratories, 600 broadcast news vehicles, and more than 400 vehicles for cellular, RF, infrared, and other applications.\nThe Company’s Thermomedics subsidiary markets the FDA-cleared Caregiver® thermometer, which is a clinical grade, infrared thermometer for measurement of forehead temperature in adults, children, and infants, without contact. It delivers an oral-equivalent temperature directly from the forehead in one to two seconds. Since there is no skin contact and Caregiver does not require probe cover supplies, it reduces the risk of cross-contamination, which is an increasing concern, and saves healthcare facilities the cost of covers (as much as $0.10 per temperature), storage space, and waste disposal costs.\nPositiveID will announce its financial results for the fourth quarter and year ended December 31, 2017 when it files its Form 10-K on or about March 30, 2018.\nAbout PositiveID Corporation\nPositiveID Corporation is a life sciences tools and diagnostics company with an extensive patent portfolio. PositiveID develops biological detection and diagnostics systems, specializing in the development of microfluidic systems for the automated preparation of and performance of biological assays. PositiveID is also a leader in the mobile technology vehicle market, with a focus on the laboratory market and homeland security. For more information on PositiveID, please visit http://www.psidcorp.com , or connect with PositiveID on Twitter , Facebook or LinkedIn .\nOn August 24, 2017, PositiveID Corporation and its wholly-owned subsidiary PositiveID Diagnostics, Inc. (collectively, the “Seller”), entered into an Asset Purchase Agreement (“APA”) with ExcitePCR Corporation. Pursuant to the APA, at closing, the Seller will sell and deliver to ExcitePCR all assets used in connection with the operation of the FireflyDX technology. For more information on the APA, please read PositiveID’s Form 8-K filed on August 28, 2017, which can be found here .\nStatements about PositiveID's future expectations, including the likelihood that Company expects year-over-year growth of over 30% for the 2017 fourth quarter and 2018 first quarter; the likelihood that the FireflyDX-Portable will be commercially available in late 2018; the likelihood that as the Company continues to build bookings within its mobile labs business and sees a more robust sales pipeline for Caregiver, it can deliver growth in excess of 30% for both the 2017 fourth quarter and 2018 first quarter, with continued strength expected through the first half of 2018 and beyond; the likelihood that FireflyDX’s applications include POC/PON detection of pathogenic organisms; agricultural and food screening in both domestic sectors and developing countries; and detection of biological agents associated with weapons of mass destruction; the likelihood that Caregiver reduces the risk of cross-contamination, which is an increasing concern, and saves healthcare facilities the cost of covers (as much as $0.10 per temperature), storage space, and waste disposal costs; constitute \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, Section 21E of", "external_links": ["https://www.globenewswire.com/Tracker?data=IF6JflJC47tKvPIrW_fM1WkMsGEVauARdGTsNbpCI6C0pHvhdI-wEfgwZsIvMzS5iAjhijDljaSYJWPWno26IicIJLXNjZ584lPBsx1Dp1k=", "https://www.globenewswire.com/Tracker?data=jOeGBFP4aK2LnGpSqn5PYwSa6foN7NNrgSdw6_nMidB1RF6KOApyXQxJp1jNgWBgSjqFkSdwBCmgn0fXRyu3xVB-p1bu7v33X7S3t20r7rc=", "https://www.globenewswire.com/Tracker?data=got3ZMHA1RctJGNwO5ohLuuU_3-LWWy7CnLfWx4aoXUAoEEXIK56o9S3klXIwSETSb8yvknoh790X2MbS1mWHywJJJWws1R8IiKMXWESutT2a8OVvXEjL0nM_b4p3KPjsHc7A5sxAbUK5Vf3TINnWdrrxHNnY6QN72Qc02L_S_k=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/a8293ba5-6726-4018-973a-726b2c40bf36", "https://www.globenewswire.com/Tracker?data=6EDG-wLsAX-_AWk_to-xbg400B7oKOHZlo5Bx0M7bhaRnzNx28yHIF_NTwHIXlOyCbu6xOLt-D6MeKKkKBpzaU3hlFeRb03Uk6mtplCzFydQFVt8egpd_xa77_sHwN3w", "https://www.globenewswire.com/Tracker?data=yJs9K30X5A9OxUuD-go6CV2xH57xmyIIuVmwYdO5FKBSBjvmyTYnM_ppI1UEvIagF2w9plij_0QyfvvWF-KWX7RpE6Lj_y3GSwt-ZSSbr7c="], "published": "2018-01-10T16:00:00.000+02:00", "crawled": "2018-01-10T19:15:24.000+02:00", "highlightTitle": ""}