{"organizations": [], "uuid": "b13d04fabfe49718900deadbcee0ba5bd54e75d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-gains-in-consumer-stocks-prop-up-sp-nasdaq-idUSL3N1PE4BA", "country": "US", "domain_rank": 408, "title": "US STOCKS-Gains in consumer stocks prop up S&P, Nasdaq", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-20T00:41:00.000+02:00", "replies_count": 0, "uuid": "b13d04fabfe49718900deadbcee0ba5bd54e75d0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-gains-in-consumer-stocks-prop-up-sp-nasdaq-idUSL3N1PE4BA", "ord_in_thread": 0, "title": "US STOCKS-Gains in consumer stocks prop up S&P, Nasdaq", "locations": [], "entities": {"persons": [{"name": "sruthi shankar jan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "s&p", "sentiment": "negative"}, {"name": "nike", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "philip morris", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* IBM lower after saying higher tax rates will hit profit\n* AmEx posts first loss in 26 years on tax charge\n* Dow off 0.15 pct, S&P 0.09 pct, Nasdaq 0.12 pct (Changes comment, updates prices, adds details)\nBy Sruthi Shankar\nJan 19 (Reuters) - The S&P 500 and the Nasdaq were prodded higher by gains in consumer stocks, while investors played down fears of a looming U.S. government shutdown.\nPhilip Morris, Nike and Home Depot were the main drivers of the S&P, following positive brokerage recommendations on their stocks.\nAmazon’s 1 percent rise after its move to hike monthly fees for Amazon Prime service helped the Nasdaq.\nLawmakers are racing against a midnight deadline to pass a bill to fund government operations through to Feb. 16 and avoid federal agency shutdowns this weekend.\nAlthough the House of Representatives voted to extend the funding on Thursday, the bill appeared to be on the verge of collapse in the Senate.\n“The market appears to be looking through this as a non-essential event, although we’re seeing a little bit of a pickup in volatility in the last couple of days,” said Bill Northey, senior vice president of U.S. Bank Wealth Management in Helena, Montana.\nInvestors have already shown they can ignore political risks at home and abroad, focusing instead on earnings and economic data.\n“Valuations that were somewhat higher are beginning to look more reasonable based on what’s happening to earnings estimate as they are re-evaluated with company guidance and what is being reported,” said Northey.\nAt 11:01 a.m. ET (1601 GMT), the S&P 500 was up 2.41 points, or 0.09 percent, at 2,800.44 and the Nasdaq Composite was up 8.60 points, or 0.12 percent, at 7,304.64.\nSeven of the 11 major S&P sectors were higher, led by a 0.74 percent gain in the consumer staples index and a 0.4 percent rise in discretionary stocks.\nThe Dow Jones Industrial Average was down 39.02 points, or 0.15 percent, at 25,978.79, weighed down by IBM and American Express.\nIBM fell 3.75 percent despite posting its first revenue rise in 23 quarters. The company warned that a higher tax rate this year would eat into its profit.\nAmerican Express slipped 2.5 percent after the credit card issuer posted its first quarterly loss in 26 years and said it would not buy back shares for the next six months due to the impact of the U.S. tax reform.\nSchlumberger was up marginally after the oilfield services provider reported a bigger-than-expected profit and said it expected another strong year for North American shale drilling in 2018.\nOil prices were down more than 1 percent on Friday as a bounce-back in U.S. production outweighed ongoing declines in crude inventories.\nAdvancing issues outnumbered decliners on the NYSE by 1,669 to 1,089. On the Nasdaq, 1,804 issues rose and 966 fell. (Reporting by Sruthi Shankar in Bengaluru; Editing by Anil D‘Silva)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T00:41:00.000+02:00", "crawled": "2018-01-20T17:46:36.055+02:00", "highlightTitle": ""}