{"organizations": [], "uuid": "27b7eab11c682e8fb80e4fa6d9977fcafb13f81b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221415633&w=1200&r=LYNXMPEE0B0NC", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-bulgaria-politics/bulgaria-parliament-overturns-presidential-veto-on-anti-corruption-law-idUSKBN1F115T", "country": "US", "domain_rank": 408, "title": "Bulgaria parliament overturns presidential veto on anti-corruption law", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:05:00.000+02:00", "replies_count": 0, "uuid": "27b7eab11c682e8fb80e4fa6d9977fcafb13f81b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bulgaria-politics/bulgaria-parliament-overturns-presidential-veto-on-anti-corruption-law-idUSKBN1F115T", "ord_in_thread": 0, "title": "Bulgaria parliament overturns presidential veto on anti-corruption law", "locations": [], "entities": {"persons": [{"name": "rumen radev", "sentiment": "none"}], "locations": [{"name": "sofia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "black sea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "united patriots", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "gerb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOFIA (Reuters) - Bulgaria’s parliament on Friday overturned a presidential veto on anti-graft legislation, clearing the way for the creation of a special unit to investigate individuals occupying high public office as well as assets and conflicts of interest.\nLast week Bulgarian President Rumen Radev vetoed the law, passed by parliament, saying the bill failed to offer the means to effectively investigate corruption networks.\nBulgaria has made scant progress towards stamping out graft and organized crime, and the European Commission, the EU’s executive, has repeatedly rebuked the Black Sea country for failing to prosecute and sentence allegedly corrupt officials.\nSome analysts say the fact that the new unit’s management will be appointed by parliament means it might not be truly independent and could be used by those in power to persecute opponents.\nBut the motion to overrule the veto was passed by 146 votes in the 240-seat parliament, bringing together lawmakers from the ruling center-right GERB party, allies in the nationalist United Patriots formation and opposition deputies from the Movement for Rights and Freedoms and Volya. The Socialists voted against.\n“Today, by rejecting the president’s veto, our country will fulfill a commitment to the European Commission,” GERB’s parliamentary group leader Tsvetan Tsvetanov told lawmakers.\nThe moves allows the government to pursue plans to focus on improving control and accountability of law-enforcement agencies to try to change opinions and clean the Balkan country’s tarnished image during its EU presidency.\nRadev acted only a day after the European Union’s poorest country assumed the six-month, rotating presidency of the bloc for the first time since it joined the EU in 2007.\nAccording to Transparency International, Bulgaria is the EU’s most corrupt country.\nCorruption has deterred foreign investment since communism collapsed in Bulgaria in 1989, and the EU has kept Sofia as well as neighboring Romania - for the same rule-of-law failings - outside its Schengen zone of passport-free travel.\n“The president’s veto was like the last chance to adjust your policy on corruption,” Kornelia Ninova, leader of the main opposition Socialist Party, said in parliament.\nOn Thursday several demonstrations, some with an anti-corruption theme, blocked Bulgarian capital Sofia as the country hosted official ceremonies for the start of its EU presidency.\nReporting by Angel Krasimirov, Editing by William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T19:05:00.000+02:00", "crawled": "2018-01-13T14:42:00.003+02:00", "highlightTitle": ""}