{"organizations": [], "uuid": "541fdb254a39da9d1b4f47009de6606c2597b489", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-harassment/beijing-professor-dismissed-as-sexual-harassment-allegations-spark-campus-activism-idUSKBN1F10J9", "country": "US", "domain_rank": 408, "title": "Beijing professor dismissed as sexual harassment allegations spark campus activism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:39:00.000+02:00", "replies_count": 0, "uuid": "541fdb254a39da9d1b4f47009de6606c2597b489"}, "author": "", "url": "https://www.reuters.com/article/us-china-harassment/beijing-professor-dismissed-as-sexual-harassment-allegations-spark-campus-activism-idUSKBN1F10J9", "ord_in_thread": 0, "title": "Beijing professor dismissed as sexual harassment allegations spark campus activism", "locations": [], "entities": {"persons": [{"name": "philip wen", "sentiment": "none"}, {"name": "weibo", "sentiment": "none"}, {"name": "luo xixi", "sentiment": "none"}, {"name": "chen xiaowu", "sentiment": "none"}, {"name": "chen", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "christian shepherd", "sentiment": "none"}, {"name": "beijing youth daily", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "beihang university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - A professor in China accused of sexually harassing students under his supervision has been removed from teaching posts by a top Beijing university, in a case that has sparked national media coverage and a nascent #MeToo movement in the country.\nBeihang University said in a statement on its official Weibo account late on Thursday that an investigation found the professor, Chen Xiaowu, had engaged in “sexual harassment behavior” that seriously violated professional ethics and the school’s code of conduct.\nThe Beijing Youth Daily had previously reported Chen saying he had done “nothing illegal”, but Reuters was unable to reach him for comment as the university declined to provide Chen’s telephone number and said he was refusing interviews.\nThe university’s investigation was launched after former Beihang student Luo Xixi publicly accused Chen of sexually harassing her 13 years ago in an online blog that promptly went viral after it was posted on Jan. 1.\nIn the post, Luo said Chen made an unwanted sexual advance after luring her to his sister’s house, and that he only relented after she burst into tears and said she was a virgin. Luo also accused Chen of harassing several other students.\nLuo, who now lives in the United States, said she was inspired by the #MeToo social media movement that started in October in the wake of sexual misconduct allegations in the U.S. entertainment industry, and encouraged others to come forward and share their own experiences under the hashtag.\nLuo did not immediately respond to a request for comment on Chen’s dismissal.\nLuo’s allegations, combined with another public post from a Peking University graduate, have inspired students from more than 50 universities to issue open letters demanding more effective oversight and a reporting system to deal with sexual harassment on their campuses.\nBut unlike #MeToo in the United States, the campaign has mostly been spread by word of mouth and has struggled to gain traction on social media, in part because Chinese internet censors have been swift to take down the open letters.\nInstances of campus sexual harassment have surfaced regularly in recent years, but are usually reported in China’s state-run media as isolated cases rather than part of a wider systemic problem.\nIn its statement, Beihang said Chen was removed as vice-president of the university’s graduate school and that his credentials as a teacher and post-graduate supervisor were revoked.\nZhang Leilei, a Guangzhou-based women’s rights activist involved in the campaign against campus sexual harassment, said the response from Beihang was clear and swift and represented progress.\nShe said the campaign would continue to raise the issue’s profile in the media so that people would become more ready to speak out, as they have through the #MeToo movement.\nOn Friday, a student from another university in Beijing came forward with accusations of sexual harassment against her professor in an online post, saying she was emboldened by Beihang’s handling of Luo’s complaint.\n“Right now it seems we may be reaching a tipping point on this particular issue,” Zhang told Reuters. “We hope to use it as a window to begin making change.”\nReporting by Philip Wen and Christian Shepherd; Additional reporting by Liangping Gao; Editing by Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-12T08:39:00.000+02:00", "crawled": "2018-01-12T09:03:15.028+02:00", "highlightTitle": ""}