{"organizations": [], "uuid": "a9acdfeb85b31c4d6a0b9246018329f9c17ca379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219443367&w=1200&r=LYNXMPEE031GI", "site_section": "http://feeds.reuters.com/reuters/INhealth", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/usa-justice-marijuana/trump-administration-drops-obama-era-easing-of-marijuana-prosecutions-idINKBN1ET2J7", "country": "US", "domain_rank": 408, "title": "Trump administration drops Obama-era easing of marijuana prosecutions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:02:00.000+02:00", "replies_count": 0, "uuid": "a9acdfeb85b31c4d6a0b9246018329f9c17ca379"}, "author": "", "url": "https://in.reuters.com/article/usa-justice-marijuana/trump-administration-drops-obama-era-easing-of-marijuana-prosecutions-idINKBN1ET2J7", "ord_in_thread": 0, "title": "Trump administration drops Obama-era easing of marijuana prosecutions", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "sarah sanders", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 11:09 PM / in 35 minutes Trump administration drops Obama-era easing of marijuana prosecutions Sarah N. Lynch 6 Min Read \nWASHINGTON (Reuters) - The U.S. Justice Department on Thursday rescinded an Obama administration policy that had eased enforcement of federal marijuana laws in states that legalized the drug, instead giving federal prosecutors wide latitude to pursue criminal charges. \nThe action by Attorney General Jeff Sessions could have damaging consequences for the burgeoning marijuana industry in the six states including California and Colorado that have legalized the drug for recreational use, plus dozens of others that permit medicinal use. \nJustice Department officials declined to say whether they might take legal action against those states, saying further steps were “still under consideration.” \nFederal law still prohibits marijuana even as some states move to legalize it. White House spokeswoman Sarah Sanders said President Donald Trump’s top priority was enforcing federal law “whether it’s marijuana or immigration.” \nThe policy change, detailed by Sessions in a one-page memo to federal prosecutors nationwide, came three days after California formally launched the world’s largest regulated commercial market for recreational marijuana. \nThe administration’s action drew condemnation from marijuana legalization advocates and politicians in both parties in states where the drug has been legalized. They said it trampled on the rights of voters in those states and created uncertainty about how strictly federal drugs laws will be enforced. \nThe move raised questions about how it might impact tax revenues in states that permit some form of legal marijuana use. It also created uncertainty for banks, already fearful about business relationships with the marijuana industry because of concerns they might run afoul of anti-money laundering rules. \nThere has been a surge in legalization of marijuana at the state level in recent years. Other states that permit the regulated sale of marijuana for recreational use include Washington, Oregon, Alaska, and Nevada. Massachusetts and Maine are on track to do so this year. \nThe policy put in place under Democratic former President Barack Obama, outlined by then-Deputy Attorney General James Cole in a series of memos, had discouraged federal prosecutors from pursuing marijuana-related criminal cases in states that had legalized the drug. \nSessions said in a statement that the Obama-era policy “undermines the rule of law” and told federal prosecutors in his memo to “follow the well-established principles that govern all federal prosecutions” in deciding which marijuana-related activities to prosecute. \nSome prosecutors in legalization states issued statements on how they would proceed. A U.S. attorney in Colorado said he would not change his approach toward marijuana prosecutions, while a U.S. attorney in Massachusetts said he would pursue federal marijuana criminal cases. FILE PHOTO: Customers shop for \"Green Friday\" deals at the Grass Station marijuana shop on Black Friday in Denver, Colorado, U.S., November 28, 2014. REUTERS/Rick Wilking/File Photo \nThe Trump administration’s action seemed incongruous with comments that Trump, a Republican, made during the 2016 presidential campaign. Trump told a TV news reporter that the decision to legalize marijuana should be left “up to the states.” \n‘DEFIES FACTS AND LOGIC’ \nCalifornia Lieutenant Governor Gavin Newsom, a Democrat, said his state will pursue “all legal, legislative and political options to protect its reforms and its rights as a state.” He said the Trump administration’s position “defies facts and logic.” \nRepublican Senator Cory Gardner of Colorado said on Twitter that the administration’s action “directly contradicts what Attorney General Sessions told me prior to his confirmation.” \nGardner said he would take all steps necessary to fight the measure, including possibly holding up the Senate from voting on pending Justice Department nominees. \nThe Obama-era policy recognised marijuana as a “dangerous drug,” but said the Justice Department expected states and localities that authorized various uses to effectively regulate and police it. \nAmong companies that have invested in the industry, Scotts Miracle-Gro ( SMG.N ), a gardening product manufacturer, has spent hundreds of millions of dollars to acquire companies that sell soil, lighting, fertilizer and other products to marijuana growers. Shares in the company closed down about 2.3 percent. Several Canadian marijuana-related stocks also fell. \nMarijuana startup companies said they were now bracing for a deceleration in funding. \n“In the short term, this news will further scare away investors, which will, in turn, slow down cannabis entrepreneurship,” said Nicolas Ruiz, co-founder of Cloudponics, a San Francisco startup whose technology can be used to grow marijuana. \nFunding for such startups has been on an upswing since Colorado’s legalization of recreational marijuana use in 2014. Since then, the industry has amassed nearly $1.3 billion in private equity funding for marijuana startups, with more than $600 million in 2017 alone, according to research firm CB Insights. \nThe Sessions memo did not distinguish between enforcement against marijuana used for recreational versus medicinal purposes. But his department’s ability to pursue criminal charges related to medicinal marijuana remains in doubt. \nSince 2014, federal lawmakers have attached language to spending legislation that explicitly bars the Justice Department from spending resources to enforce cases in states where medicinal marijuana is legal. Reporting by Sarah N. Lynch; Additional reporting by Susan Heavey in Washington and Salvador Rodriguez in California; Editing by Will Dunham", "external_links": [], "published": "2018-01-05T01:02:00.000+02:00", "crawled": "2018-01-05T01:37:54.000+02:00", "highlightTitle": ""}