{"organizations": [], "uuid": "9960fe447c9d68db2fbe5b7e572b6fb0e265c658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-adt-announces-initial-public-offering-launch.html", "country": "US", "domain_rank": 767, "title": "ADT Announces Initial Public Offering Launch", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:45:00.000+02:00", "replies_count": 0, "uuid": "9960fe447c9d68db2fbe5b7e572b6fb0e265c658"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-adt-announces-initial-public-offering-launch.html", "ord_in_thread": 0, "title": "ADT Announces Initial Public Offering Launch", "locations": [], "entities": {"persons": [], "locations": [{"name": "boca raton", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "adt", "sentiment": "negative"}, {"name": "adt inc.", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOCA RATON, Fla., Jan. 05, 2018 (GLOBE NEWSWIRE) -- ADT Inc. (“ADT”), the leader in security and automation solutions for homes and businesses in North America, today announced the launch of its initial public offering of 111,111,111 shares of common stock. The initial public offering price is expected to be between $17.00 and $19.00 per share, before underwriting discounts and commissions. In addition, the Company granted to the underwriters a 30-day option to purchase up to an additional 16,666,667 shares of common stock at the initial public offering price, less underwriting discounts and commissions. ADT’s existing shareholders will not sell any shares in the offering. ADT has applied to list shares on the New York Stock Exchange (NYSE) under the symbol \"ADT.”\nADT expects to receive gross proceeds of approximately $2 billion from the offering, or $2.3 billion if the underwriters exercise their over-allotment option in full. ADT intends to use the gross proceeds from the offering to partially redeem outstanding second lien notes, deposit approximately $750 million of the net proceeds from this offering into a separate account, which amount will be used to redeem ADT Inc.’s preferred securities on a date to be determined following the consummation of the initial public offering, and pay fees and expenses in connection with the offering.\nMorgan Stanley, Goldman Sachs & Co. LLC, Barclays, Deutsche Bank Securities, and RBC Capital Markets are acting as joint book-running managers for the offering. Citigroup, BofA Merrill Lynch, and Credit Suisse are serving as bookrunners. Imperial Capital, Academy Securities Inc., Allen & Company LLC, Apollo Global Securities, Citizens Capital Markets, LionTree, SunTrust Robinson Humphrey and The Williams Capital Group, L.P. are acting as co-managers for the offering.\nA registration statement on Form S-1, including a prospectus, which is preliminary and subject to completion, relating to these securities has been filed with the U.S. Securities and Exchange Commission, but has not yet become effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nThe offering is being made only by means of a prospectus. A copy of the final prospectus relating to the offering may be obtained from Morgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282 (telephone: (866) 471-2526 or email: prospectus-ny@ny.email.gs.com ); Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717 (telephone: (888) 603-5847 or email: Barclaysprospectus@broadridge.com ); Deutsche Bank Securities Inc., Attention: Prospectus Group, 60 Wall Street, New York, NY 10005 (telephone (800) 503-4611 or email: prospectus.cpdg@db.com ); RBC Capital Markets, LLC, Attention: Equity Syndicate, 200 Vesey Street, 8th Floor, New York, NY 10281-8098 (telephone: (877) 822-4089 or email: equityprospectus@rbccm.com ); Citigroup, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717 (telephone: (800) 831-9146); BofA Merrill Lynch, Attention: Prospectus Department, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte NC 28255-0001 (email: dg.prospectus_requests@baml.com ); and Credit Suisse Securities (USA) LLC, Attention: Credit Suisse Prospectus Department, One Madison Avenue, New York, NY 10010 (telephone: 1 (800) 221-1037 or email: newyork.prospectus@credit-suisse.com ).\nAbout ADT\nADT is a leading provider of security and automation solutions in the United States and Canada for homes and businesses, people on-the-go and their network. Making security more accessible than ever before, and backed by 24/7 customer support, ADT delivers same-day service and live answer within seconds in customer operations, helping customers feel more safe and empowered. ADT is headquartered in Boca Raton, Florida and employs more than 18,000 people throughout North America.\nForward-Looking and Cautionary Statements\nThis press release contains, and oral statements made from time to time by ADT’s representatives may contain, “forward-looking statements.” Forward-looking statements include statements regarding the proposed public offering and other statements identified by words such as “could,” “may,” “might,” “will,” “likely,” “anticipates,” “intends,” “plans,” “seeks,” “believes,” “estimates,” “expects,” “continues,” “projects” and similar references to future periods, or by the inclusion of forecasts or projections. Forward-looking statements are based on ADT’s current expectations and assumptions regarding capital market conditions ADT’s business, the economy and other future conditions. Because forward-looking statements relate to the future, by their nature, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. As a result, ADT’s actual results may differ materially from those contemplated by the forward-looking statements. Important factors that could cause actual results to differ materially from those in the forward-looking statements include regional, national or global political, economic, business, competitive, market and regulatory conditions, including risk regarding when ADT can complete the offering, ADT’s ability to anticipate consumer demand; changes in consumer confidence and spending; ADT’s competitive environment and other factors set forth under “Risk Factors” in the registration statement on Form S-1. Any forward-looking statement made in this press release speaks only as of the date on which it is made. ADT undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nMedia Relations Contact\nJason Shockley\ntel: +1 561.322.7325\njshockley@adt.com\nSource:ADT LLC", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8c124b95-fcbb-4bfc-a372-592cb616541f", "https://www.globenewswire.com/Tracker?data=IRUHtswPk_ZSqOMewT90DryLf5n5ERx21uIgkUJ9LbKg8dAO_UxofDVNKnWPPCqFA77gnYhSifKIbNq2lHWafQ==", "https://www.globenewswire.com/Tracker?data=mDSFeEC9r8vMpuw-ppwg-NugPsNfFbmoQdjHfwo8CTF9JiakEVIqGDvfEqgCWf-Q"], "published": "2018-01-05T14:45:00.000+02:00", "crawled": "2018-01-05T14:40:47.035+02:00", "highlightTitle": ""}