{"organizations": [], "uuid": "e9f40b87824b7e4261a6424cbaee68e1b549e482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-colony-northstar-credit-real-estate-northstar-real-estate-income-trust-and-northstar-real-estate-income-ii-announce-approval.html", "country": "US", "domain_rank": 767, "title": "Colony NorthStar Credit Real Estate, NorthStar Real Estate Income Trust and NorthStar Real Estate Income II Announce Approval of Combination", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.131, "site_type": "news", "published": "2018-01-19T18:53:00.000+02:00", "replies_count": 0, "uuid": "e9f40b87824b7e4261a6424cbaee68e1b549e482"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-colony-northstar-credit-real-estate-northstar-real-estate-income-trust-and-northstar-real-estate-income-ii-announce-approval.html", "ord_in_thread": 0, "title": "Colony NorthStar Credit Real Estate, NorthStar Real Estate Income Trust and NorthStar Real Estate Income II Announce Approval of Combination", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "northstar real estate income ii announce approval of combination new york", "sentiment": "neutral"}, {"name": "northstar real estate income trust", "sentiment": "neutral"}, {"name": "northstar credit real estate", "sentiment": "neutral"}, {"name": "northstar credit real estate, inc.", "sentiment": "neutral"}, {"name": "northstar", "sentiment": "none"}, {"name": "colony northstar", "sentiment": "none"}, {"name": "northstar real estate income trust, inc.", "sentiment": "none"}, {"name": "northstar real estate income ii, inc.", "sentiment": "none"}, {"name": "colony northstar, inc.", "sentiment": "none"}, {"name": "colony northstar credit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK & LOS ANGELES--(BUSINESS WIRE)-- Colony NorthStar Credit Real Estate, Inc. (“Colony NorthStar Credit”), NorthStar Real Estate Income Trust, Inc., a public, non-traded REIT (“NorthStar I”), and NorthStar Real Estate Income II, Inc., a public, non-traded REIT (“NorthStar II”), today announced that at special meetings held on January 18, 2018, NorthStar I and NorthStar II stockholders approved the merger of NorthStar I and NorthStar II, respectively, with and into Colony NorthStar Credit in a stock-for-stock transaction, with Colony NorthStar Credit surviving each merger (the “NorthStar I Merger” and the “NorthStar II Merger,” respectively, and, collectively, the “Mergers”), and the other proposals presented at the special meetings in connection with the previously announced combination of a select portfolio of assets and liabilities of Colony NorthStar, Inc. (“Colony NorthStar”) with substantially all of the assets and liabilities of NorthStar I and all of the assets and liabilities of NorthStar II (the “Combination”) pursuant to the tri-party agreement, dated as of August 25, 2017 and amended and restated on November 20, 2017. The Combination will create a leading commercial real estate credit REIT with approximately $5.1 billion in assets and $3.3 billion in equity value.\nAt the special meeting of NorthStar I stockholders, approximately 94% of the votes cast were voted in favor of the proposal in connection with the NorthStar I Merger.\nAt the special meeting of NorthStar II stockholders, approximately 93% of the votes cast were voted in favor of the proposal in connection with the NorthStar II Merger.\nThe Combination is currently expected to close on or about January 31, 2018, subject to the satisfaction or waiver of all closing conditions relating to the Combination. As a result of the Mergers, among other things, each outstanding share of NorthStar I common stock will be converted into the right to receive 0.3532 shares of Colony NorthStar Credit Class A common stock (the “Common Stock”) and each outstanding share of NorthStar II Class A and Class T common stock will be converted into the right to receive 0.3511 shares of Common Stock. No fractional shares will be issued in connection with the Mergers and the applicable NorthStar I and NorthStar II stockholders will receive cash in lieu of fractional shares. It is currently expected that Colony NorthStar Credit will pursue a listing, rather than an initial public offering, to satisfy the condition to completion of the Combination that the Common Stock be approved for listing on a national securities exchange in connection with either an initial public offering or a listing. Subject to approval for listing from the New York Stock Exchange (the “NYSE”), it is expected that the Common Stock will be listed on the NYSE under the ticker symbol “CLNC” and will begin trading on or about February 1, 2018.\nAbout Colony NorthStar Credit\nColony NorthStar Credit is a newly organized Maryland corporation focused on originating, acquiring, financing and managing a diversified portfolio consisting primarily of commercial real estate senior mortgage loans, mezzanine loans, preferred equity, debt securities and net leased properties predominantly in the United States. Colony NorthStar Credit will be externally managed and advised by a subsidiary of Colony NorthStar, Inc. (NYSE: CLNS), a leading global real estate and investment management firm.\nAbout NorthStar Real Estate Income Trust, Inc.\nNorthStar I is a public, non-traded REIT sponsored by Colony NorthStar. NorthStar I was formed to originate, acquire and asset manage a diversified portfolio of commercial real estate debt, select equity and securities investments predominantly in the United States.\nAbout NorthStar Real Estate Income II, Inc.\nNorthStar II is a public, non-traded REIT sponsored by Colony NorthStar. NorthStar II was formed to originate, acquire and asset manage a diversified portfolio of commercial real estate debt, select equity and securities investments predominantly in the United States.\nForward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of the federal securities laws. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify forward-looking statements by the use of forward-looking terminology such as “may,” “will,” “should,” “expects,” “intends,” “plans,” “anticipates,” “believes,” “estimates,” “predicts,” or “potential” or the negative of these words and phrases or similar words or phrases which are predictions of or indicate future events or trends and which do not relate solely to historical matters. Forward-looking statements involve known and unknown risks, uncertainties, assumptions and contingencies, many of which are beyond our control, and may cause actual results to differ significantly from those expressed in any forward-looking statement. Among others, the following uncertainties and other factors could cause actual results to differ from those set forth in the forward-looking statements: the failure to receive, on a timely basis or otherwise, the required approvals by governmental or regulatory agencies and third parties; the risk that a condition to closing of the Combination may not be satisfied (including the listing by Colony NorthStar Credit of its Common Stock on a national securities exchange); each party’s ability to consummate the transactions contemplated by the Combination; operating costs and business disruption may be greater than expected; and the ability to realize substantial efficiencies as well as anticipated strategic and financial benefits, and the impact of legislative, regulatory and competitive changes. The foregoing list of factors is not exhaustive. Additional information about these and other factors can be found in each company’s reports filed from time to time with the Securities and Exchange Commission. There can be no assurance that the Combination will in fact be consummated on the date noted above or at all or that Colony NorthStar Credit will pursue a listing of the Common Stock with trading commencing on the date noted above or at all.\nWe caution investors not to unduly rely on any forward-looking statements. The forward-looking statements speak only as of the date of this press release. None of Colony NorthStar Credit, NorthStar I or NorthStar II is under any duty to update any of these forward-looking statements after the date of this press release, nor to conform prior statements to actual results or revised expectations, and none of Colony NorthStar Credit, NorthStar I or NorthStar II intends to do so.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005492/en/\nColony NorthStar Credit Real Estate, Inc.\nAddo Investor Relations\nLasse Glassen\n310-829-5400\n", "external_links": ["http://www.businesswire.com/news/home/20180119005492/en/"], "published": "2018-01-19T18:53:00.000+02:00", "crawled": "2018-01-19T20:49:09.012+02:00", "highlightTitle": ""}