{"organizations": [], "uuid": "79cc198de4f8728e4924082028ffed533f67fc6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-marathon-patent-group-announces-global-bit-ventures-purchase-of-1300-bitmain-s9-antminers.html", "country": "US", "domain_rank": 767, "title": "Marathon Patent Group Announces Global Bit Ventures Purchase of 1,300 Bitmain S9 Antminers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:00:00.000+02:00", "replies_count": 0, "uuid": "79cc198de4f8728e4924082028ffed533f67fc6c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-marathon-patent-group-announces-global-bit-ventures-purchase-of-1300-bitmain-s9-antminers.html", "ord_in_thread": 0, "title": "Marathon Patent Group Announces Global Bit Ventures Purchase of 1,300 Bitmain S9 Antminers", "locations": [], "entities": {"persons": [{"name": "bitmain", "sentiment": "none"}, {"name": "merrick okamoto", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "bitmain", "sentiment": "none"}], "organizations": [{"name": "marathon patent group announces global bit ventures", "sentiment": "negative"}, {"name": "marathon patent group, inc.", "sentiment": "neutral"}, {"name": "asic", "sentiment": "none"}, {"name": "global bit ventures inc.", "sentiment": "none"}, {"name": "application specific integrated circuit", "sentiment": "none"}, {"name": "gbv", "sentiment": "none"}, {"name": "gpu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 12, 2018 (GLOBE NEWSWIRE) -- Marathon Patent Group, Inc. (Nasdaq:MARA) (“Marathon” or the “Company”), today announced that Global Bit Ventures Inc. (“GBV”), a digital asset technology company that mines cryptocurrencies has purchased 1,300 of Bitmain’s Antminer S9 miners (“Antminer S9s”). Marathon and GBV have entered into a definitive purchase agreement whereby Marathon is acquiring 100% ownership of GBV.\nThe Antminer S9s are manufactured by Bitmain, one of the world’s most recognized Application Specific Integrated Circuit (“ASIC”) server manufacturers. The 1,300 Antminer S9s are expected to utilize an estimated 1.8 MW of power once fully deployed and add 14 Ph/s of ASIC mining capacity. GBV currently owns 1,000 GPU mining servers capable of 250 GH/s. The Antminer S9s are able to mine any cryptocurrency using the SHA256 algorithm, including Bitcoin and Bitcoin Cash.\nMerrick Okamoto, Marathon’s Interim Chief Executive Officer and Chairman of the Board of Directors, stated, “We are pleased that GBV has now acquired the anticipated 1,300 new S9s. The addition of 14 Ph/s of ASIC mining capacity, in combination with our anticipated merger, sets the stage for rapid revenue acceleration in the years ahead.”\nOn November 2, 2017, Marathon announced that it had entered into a definitive purchase agreement to acquire 100% ownership of GBV. GBV has a robust infrastructure in place with significant capability for expansion. The closing of the transaction is subject to obtaining requisite approvals and customary closing conditions.\nAbout Marathon Patent Group, Inc.\nMarathon is an IP licensing company. Following the acquisition of GBV, the combined company will focus on the development of GBV’s new business involving the blockchain ecosystem and generation of digital assets. GBV is focused on mining digital assets and intends to add specialized computer equipment and plans to expand its activities to mine new digital assets. To learn more about Marathon Patent Group, visit www.marathonpg.com . To learn more about Global Bit Ventures Inc., visit www.globalbitventures.com .\nForward-Looking Statements\nStatements made in this press release include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements can be identified by the use of words such as “may,” “will,” “plan,” “should,” “expect,” “anticipate,” “estimate,” “continue,” or comparable terminology. Such forward-looking statements are inherently subject to certain risks, trends and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate, and involve factors that may cause actual results to differ materially from those projected or suggested. Readers are cautioned not to place undue reliance on these forward-looking statements and are advised to consider the factors listed above together with the additional factors under the heading “Risk Factors” in the Company's Annual Reports on Form 10-K, as may be supplemented or amended by the Company's Quarterly Reports on Form 10-Q. The Company assumes no obligation to update or supplement forward-looking statements that become untrue because of subsequent events, new information or otherwise.\nContact Information\nName: Jason Assad\nPhone: 678-570-6791\nEmail: Jason@marathonpg.com\nSource:Marathon Patent Group, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=D4m8e24m1UPZHmhhgBv9D9zIUNnyWWxB0iornk9lNg21_Srtb4yE3WHj2jdIDt-fd3FrYS3AkpVWtv47BO0nMHplYsQ6veL7xV6aqmRnd6I=", "https://www.globenewswire.com/Tracker?data=6JMDLSlEN6I80qpac3DLEKzPCBziG9EKJSMh6zWvkaWV9wFKMASWa4vd-1G-vK4cgj31Kyp_i8dIuX93HY2v2ialj-wNuVm8gFmsVxa82LECqmtUBbnFjGjuWkAEWeLRWFFpVmGTKk0wvGT3NmzZ8tG9BWV7lXqm7Y2B9m0_ney3Kvwj3B2MV-YhoMb832uS9r4ZHreLHWyz6U5V3PmND1LJwhRTP-juUJYke88JiyO9UZr5OCvw7MQJVX6C2sKmQvcEXbXm1Bdf38wtV4EQjg==", "https://www.globenewswire.com/Tracker?data=CDL9YcTOgNFdXkrZ6nVpQRnQwiBvqnUQZ51mucPaXR1z4hfxJqt-990ebAAmdIstuXQJss3xpX-OUnYgGYDVqDdw-C9GQvmZqbUB1HvM2R8UbW1_Zy5DoaJGNumEsGcDiNvZ4gI_Y7zP3I5KgT6heieoPi5PmHvwp1VfKACtKxN5m7oAkRP73bMXmyMeRExsvbQKUx7lNyAtZXeo4WF_10WuGR7A2fOT_RetSXEzEoWCXULqi6a6POCvCZGG4QNo"], "published": "2018-01-12T15:00:00.000+02:00", "crawled": "2018-01-12T15:53:27.058+02:00", "highlightTitle": ""}