{"organizations": [], "uuid": "0b635fc8bca200934f55a69a76e619daaca4eb33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-ashes-smith/cricket-incredible-smith-the-difference-in-the-ashes-says-cummins-idUKL4N1P02V8", "country": "US", "domain_rank": 408, "title": "Cricket-'Incredible' Smith the difference in the Ashes, says Cummins", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T10:28:00.000+02:00", "replies_count": 0, "uuid": "0b635fc8bca200934f55a69a76e619daaca4eb33"}, "author": "", "url": "https://uk.reuters.com/article/cricket-ashes-smith/cricket-incredible-smith-the-difference-in-the-ashes-says-cummins-idUKL4N1P02V8", "ord_in_thread": 0, "title": "Cricket-'Incredible' Smith the difference in the Ashes, says Cummins", "locations": [], "entities": {"persons": [{"name": "smith", "sentiment": "negative"}, {"name": "pat cummins", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}], "locations": [{"name": "brisbane", "sentiment": "none"}, {"name": "perth", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney cricket ground", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "cummins nick mulvenney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 8:29 AM / Updated 8 hours ago Cricket-'Incredible' Smith the difference in the Ashes, says Cummins Nick Mulvenney 3 Min Read \nSYDNEY, Jan 5 (Reuters) - Steve Smith’s importance to Australia in the Ashes series has not just been in the torrent of runs he has scored but also in timing of his big innings, according to his team mate Pat Cummins. \nThe Australia skipper once again proved immovable at the crease as he passed 6,000 test runs in his 111th innings on the second day of the fifth test at the Sydney Cricket Ground on Friday. \nHis 44 not out helped Australia to 193 for two at close, 153 runs behind England’s first innings score, and brought his own tally over the five tests to 648 runs at a provisional average of 162. \nAn unbeaten century in Brisbane and 239 in Perth helped ensure the return of the Ashes as Australia took an unassailable 3-0 lead in the series, while his 102 not out in the fourth test stymied England’s hopes of victory in Melbourne. \n“We’re stoked he’s on our team so we don’t have to bowl at him. He just goes out there and looks from ball one that he’s been batting for three hours already,” Cummins told reporters. \n”No obvious weakness, no obvious time that it takes him to build into his innings. From ball one he knows his game so well. \n”Those big innings he has played as well, they have been really important. In Brisbane and Perth they were match-winning and in Melbourne it was match-saving. \n“It’s just incredible and I think he’s been the difference between the two sides.” \nSmith’s extraordinary form has solidified his position as the world’s top-ranked batsman and only Donald Bradman reached the 6,000-run milestone in fewer innings - West Indies great Garfield Sobers taking the same number. \nAs a team mate of Smith’s at New South Wales, Cummins rarely bowls against him in match conditions but his experiences in the nets have given him enough of an inkling of how difficult it is. “He’s very different to pretty much every other batsman,” the paceman said. \n”He moves so much it’s harder to find your target. A normal fourth stump ball to anyone else, he can hit to the leg side as though it’s a leg stump ball and then the next ball he might not move so far and he hits a full-blooded cover drive. \n”I think he’s just a really hard batsman to get a rhythm to. I think the best batsmen in the world are the most proactive, that find a way to get off strike, find a way not to let you settle in as a bowler. \n“He’s a seriously smart batsman, he knows what he’s doing and he knows how to have one over the bowler.” (Editing by Sudipto Ganguly)", "external_links": [], "published": "2018-01-05T10:28:00.000+02:00", "crawled": "2018-01-05T10:43:32.040+02:00", "highlightTitle": ""}