{"organizations": [], "uuid": "d8fba4d39fcfdf40fe00fb704280e071ca6c5679", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 216}, "facebook": {"likes": 1123, "shares": 1123, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104972933-GettyImages-902730330.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/28/trump-administration-could-build-nationalized-5g-mobile-network.html", "country": "US", "domain_rank": 767, "title": "Trump administration could build nationalized 5G mobile network", "performance_score": 10, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.166, "site_type": "news", "published": "2018-01-29T03:17:00.000+02:00", "replies_count": 0, "uuid": "d8fba4d39fcfdf40fe00fb704280e071ca6c5679"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/28/trump-administration-could-build-nationalized-5g-mobile-network.html", "ord_in_thread": 0, "title": "Trump administration could build nationalized 5G mobile network", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "tech guide trump", "sentiment": "negative"}, {"name": "et sun", "sentiment": "none"}, {"name": "axios", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "National security officials in the Trump administration are looking at options where the U.S. government could take over a part of the country's mobile network as a way of guarding against China , news outlet Axios reported. \nAxios, citing sensitive documents it obtained, said there are two options up for consideration: First, the U.S. government could pay for and build a single, super-fast mobile network and could then rent access to national carriers. The move, according to Axios, could see an unprecedented nationalization of infrastructure that has historically been privately owned. \nBut, the news outlet reported, a source familiar with the matter said a newer version of the document is neutral about whether the government should build and own such a network. The Trump administration has since denied to Recode that it has any plans to build a government-run 5G network.\nThe alternative, according to Axios, is that wireless providers in the U.S. build their own 5G networks that would compete with one another — an option the document said could be costly and more time-consuming, but would be less commercially disruptive to the industry.\nThe reason for even considering nationalization of part of the system is that China \"has achieved a dominant position in the manufacture and operation of network infrastructure\" and it's \"the dominant malicious actor in the Information Domain,\" the document said, according to Axios.\nReuters reported that a senior administration official on Sunday said that the government wants to build a secure 5G network and it'll have to work with the industry to figure out the best way to do it. \n\"We want to build a network so the Chinese can't listen to your calls,\" the official told Reuters. \"We have to have a secure network that doesn't allow bad actors to get in. We also have to ensure the Chinese don't take over the market and put every non-5G network out of business.\" \nThe matter was being debated at a lower level, the official said to Reuters, adding that it would take between six to eight months before it reaches President Donald Trump for consideration.\nOn Monday, the Federal Communications Commission warned against the notion of government-owned networks.\n\"I oppose any proposal for the federal government to build and operate a nationwide 5G network,\" FCC Chairman Ajit Pai said, in a statement. \"Any federal effort to construct a nationalized 5G network would be a costly and counterproductive distraction from the policies we need to help the United States win the 5G future.\"\nThe fifth generation (hence the 5G name) of mobile networks aims to provide faster data speeds and more bandwidth to carry ever-growing levels of web traffic. Late last year, the first specification for 5G was completed, which was considered a huge step toward commercializing the technology.\nMarket watchers have predicted the technology will have more than one billion users by 2023, with more than half based in China. U.S. carriers are already working on deploying 5G networks. \nClick here to read the full report from Axios. \n— CNBC's David Reid contributed to this report.", "external_links": [], "published": "2018-01-29T03:17:00.000+02:00", "crawled": "2018-01-29T03:17:52.013+02:00", "highlightTitle": ""}