{"organizations": [], "uuid": "503c06de555ce4011ee5ee3e46c71f5d995f2910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/tele2-ma-com-hem-holding/update-1-swedens-tele2-to-buy-cable-tv-firm-com-hem-idUSL8N1P50OH", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Sweden's Tele2 to buy cable TV firm Com Hem", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T09:45:00.000+02:00", "replies_count": 0, "uuid": "503c06de555ce4011ee5ee3e46c71f5d995f2910"}, "author": "", "url": "https://www.reuters.com/article/tele2-ma-com-hem-holding/update-1-swedens-tele2-to-buy-cable-tv-firm-com-hem-idUSL8N1P50OH", "ord_in_thread": 0, "title": "UPDATE 1-Sweden's Tele2 to buy cable TV firm Com Hem", "locations": [], "entities": {"persons": [], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "tele2", "sentiment": "negative"}, {"name": "com hem", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hem reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:46 AM / Updated 19 minutes ago UPDATE 2-Sweden's Tele2 to buy cable TV firm Com Hem in $3.2 billion deal Reuters Staff \n* Deal would create bigger rival to Telia \n* Brings together mobile and fixed line services \n* Tele2 CEO confident of green light for deal (Adds comments, shares, detail) \nBy Olof Swahnberg and Helena Soderpalm \nSTOCKHOLM, Jan 10 (Reuters) - Tele2 has agreed a $3.2 billion takeover of cable TV company Com Hem in a Swedish instalment of a global wave of mergers reshaping the telecoms and media sector. \nIf the deal is approved, the new company would be able to sell mobile telephony services to Com Hem’s household customers, while Tele2 would add fixed-line connectivity and TV services to its range of products. \nThe deal would also create a bigger challenger to market leader Telia Company and is the latest example of convergence in the telecom and TV sectors to try to maintain customer loyalty. \nA deal had been predicted by some analysts after investment company Kinnevik, Tele2’s main owner, bought an 18.5 percent stake in Com Hem in April last year to also become its biggest shareholder. \n“We are confident that the deal should be approved,” Tele2 CEO Allison Kirkby told Reuters. \n“These are two very complementary businesses.” \nCom Hem’s owners will receive a 26.9 percent stake in the merged company and 6.6 billion Swedish crowns ($801.7 million) in cash, valuing its shares at 146 crowns each, a premium of 11.8 percent to Tuesday’s closing price of 130.6 crowns. \nThat gives the company a valuation of around 26.6 billion Swedish crowns ($3.2 billion). \n“LOGICAL DEAL” \nCom Hem shares rose 6.4 percent by 1050 GMT while Tele2 shares were down by 5.7 percent. \nThe decline in Tele2 shares was mainly due to a relatively high price paid for Com Hem, said Lars Soderfjell, portfolio manager at Alandsbanken with no holding in either of the two companies. \n“It is a very logical deal,” said Bengt Nordstrom, CEO of telecoms consulting firm Northstream. \n“It is a mature sector, revenues are not growing and to stay profitable and be competitive you need to merge and create bigger entities than you have today.” \nIn recent global deals in the sector, AT&T Inc and Time Warner Inc are seeking to merge, while Verizon Communications Inc did a $4.48 billion deal for Yahoo Inc’s core business. \nThe merged company will have a fourth-generation (4G) mobile network covering all but a fraction of Sweden’s population as well as broadband services reaching almost 60 percent of households, Tele2 said. \nThe firms expect synergies of around 900 million crowns from the merger within five years and said the deal was expected to close in the second half of 2018. \nKinnevik, which will become the top owner of the merged company with a stake totalling 27.3 percent of shares and 41.9 percent of votes​, said it was prepared to take steps if needed to get the deal approved by European competition authorities. \nThe merged company’s preliminary combined net sales are approximately 31.8 billion crowns with adjusted operating earnings before depreciation and amortisation (EBITDA) of 9.2 billion crowns for the 12 months to the end of September. ($1 = 8.2329 Swedish crowns) (Reporting by Anna Ringstrom, Helena Soderpalm and Olof Swahnberg; Editing by Niklas Pollard and Keith Weir)", "external_links": [], "published": "2018-01-10T09:45:00.000+02:00", "crawled": "2018-01-10T10:10:19.002+02:00", "highlightTitle": ""}