{"organizations": [], "uuid": "9c82b6dc083aecd4b1bbdb65e432db4e395e2dce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 22, "shares": 22, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222832339&w=1200&r=LYNXMPEE0G1RU", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-bitcoin-futures-cboe/shorts-on-top-as-january-cboe-bitcoin-futures-near-settlement-idUSKBN1F62JA", "country": "US", "domain_rank": 408, "title": "Shorts on top as January CBOE bitcoin futures near settlement", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:57:00.000+02:00", "replies_count": 0, "uuid": "9c82b6dc083aecd4b1bbdb65e432db4e395e2dce"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bitcoin-futures-cboe/shorts-on-top-as-january-cboe-bitcoin-futures-near-settlement-idUSKBN1F62JA", "ord_in_thread": 0, "title": "Shorts on top as January CBOE bitcoin futures near settlement", "locations": [], "entities": {"persons": [{"name": "tyler winklevoss", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cboe", "sentiment": "negative"}, {"name": "cboe global markets", "sentiment": "none"}, {"name": "cboe futures exchange", "sentiment": "none"}, {"name": "gemini exchange", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Bitcoin was seen as coming to the big leagues with the launch of U.S. futures trading in December. For those keeping score at home, the first round of this series was a resounding win for bitcoin bears over the bulls.\nWith the first contract expiring on Wednesday, the hedge funds and other speculative investors that took out bets that bitcoin was due for a pullback have likely made a handsome profit.\nMeanwhile, the bulls who took the other side of that trade, mostly small investors, have largely seen their positions expire worthless courtesy of a massive selloff across the cryptocurrency complex since futures trading launched.\nThe cash-settled bitcoin futures allow investors and speculators to place bets on whether bitcoin will soar or slip, without holding bitcoin itself.\nThe futures are based on the auction price of bitcoin in U.S. dollars on the Gemini Exchange, which is owned and operated by virtual currency entrepreneurs and brothers Cameron and Tyler Winklevoss.\nOn Wednesday, the official auction price for bitcoin on the Gemini Exchange was $10,900, compared with an auction price of $17,285.89, on Dec. 11, the first full day of Cboe bitcoin futures trading.\nSo far, speculative positioning on the Cboe bitcoin contracts has leaned to the short side. To be short a futures contract means traders believe the underlying security will fall in value.\nSpeculators’ net short position on bitcoin Cboe futures rose to 1,907 contracts in the week to Jan. 9, Commodity Futures Trading Commission data showed on Friday.\nThe bulk of volume and open interest had been centered in the front month, suggesting much of that short position is likewise concentrated in January.\nTo be sure, some front-month positions may have since been closed out or rolled forward into future months.\n“Someone who shorted bitcoin futures last week would potentially be very happy this week,” said Steve Sosnick, chief options strategist at Interactive Brokers Group Inc in Greenwich, Connecticut.\nWith South Korea, Japan and China all making noises about a regulatory swoop, and officials in France and the United States vowing to investigate cryptocurrencies, investor fears have hit bitcoin prices hard in recent weeks.\nBitcoin has lost about 37 percent of its value on the Gemini Exchange since Dec. 11.\nWhile the initial bitcoin futures trading may have favored bears, it is still early days, said Ophir Gottlieb, chief executive of Los Angeles-based Capital Market Laboratories.\n“We will see the risk appetite if bitcoin rises abruptly. I could see people throwing up their hands and discarding the idea of shorting bitcoin altogether. I could also see people piling on if it gets to $8,000 or lower,” Gottlieb said.\n“For now, it is in a spot of disequilibrium. This asset is either worth a lot less or a lot more, but $10,000 is not a resting spot, in my opinion.”\nReporting by Saqib Iqbal Ahmed; Editing by Meredith Mazzilli\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T02:57:00.000+02:00", "crawled": "2018-01-18T00:04:28.002+02:00", "highlightTitle": ""}