{"organizations": [], "uuid": "65308674f127bca72b897bce0fc5ce738471f885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/29/104135306-RTSNOE8.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/megadeals-in-the-euro-zone-hit-their-highest-value-since-the-financial-crisis-study-shows.html", "country": "US", "domain_rank": 767, "title": "Megadeals in the euro zone hit their highest value since the financial crisis, study shows", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.05, "site_type": "news", "published": "2018-01-16T13:42:00.000+02:00", "replies_count": 0, "uuid": "65308674f127bca72b897bce0fc5ce738471f885"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/16/megadeals-in-the-euro-zone-hit-their-highest-value-since-the-financial-crisis-study-shows.html", "ord_in_thread": 0, "title": "Megadeals in the euro zone hit their highest value since the financial crisis, study shows", "locations": [], "entities": {"persons": [{"name": "linde", "sentiment": "none"}, {"name": "jonathan klonowski", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "european union megadeals", "sentiment": "positive"}, {"name": "european central bank", "sentiment": "none"}, {"name": "praxair", "sentiment": "none"}, {"name": "mergermarket", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The growth momentum in the euro zone helped the region log its highest annual value of mergers for over 10 years in 2017, according to new data from research firm Mergermarket.\nThroughout last year, more than 4,000 deals targeted the euro zone and were worth a total of 476.7 billion euros ($584.48 billion), the data showed. This represented an increase of 19.3 percent by value from the previous year.\n\"Despite a clear increase in domestic consolidation in the U.K., the euro zone represents 57.4 percent of the European value,\" Jonathan Klonowski, research editor (EMEA) at Mergermarket, said in the new report.\nAccording to Volker Geyrhalter, a partner at law firm Hogan Lovells, the uncertainty surrounding the U.K.'s decision to leave the European Union didn't have an impact in driving the mergers on the European continent.\n\"Brexit is unlikely to have played a material role in intra-euro zone mergers and acquisitions,\" Geyrhalter also said in the study. \"This is most likely to have been driven by renewed confidence in the euro area economies as evidenced by recent macro data,\" he added.\nThe European Central Bank estimated in a report in December that euro zone GDP (gross domestic product) rose by 2.4 percent during 2017.\nMichaela Rehle | Reuters Linde Group logo is seen at a company building in Munich-Pullach, Germany. Among the top 10 M&A (merger and acquisition) global deals in 2017 was Linde's merger with U.S. rival Praxair — with a value of 40.5 billion euros ($49.66 billion). Meanwhile, the energy, mining and utilities sector grew the most by value in terms of M$A compared to the previous year.\nKlonowski from Mergermarket, told CNBC Tuesday morning that there would be a \"steady flow of deals\" in 2018.\n\"Populist shocks, which threatened at the start of 2017, did not come to fruition. The resulting stability boosted sentiment and this should carry over into 2018. While some may be wary of uncertainty surrounding the Italian election, growth in the region remains strong and private equity firms retain readily available dry-powder,\" he said.\nshow chapters Outlook for mergers and acquisitions market is robust going into 2018: Deutsche Bank 4:18 AM ET Fri, 15 Dec 2017 | 02:43", "external_links": [], "published": "2018-01-16T13:42:00.000+02:00", "crawled": "2018-01-16T13:51:55.033+02:00", "highlightTitle": ""}