{"organizations": [], "uuid": "14b994a5948f5cde18c6f6fbfa2e3d0b3df52af3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224838178&w=1200&r=LYNXMPEE0N1GV", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/global-insurance-aon/2017-second-costliest-year-on-record-for-natural-disaster-insured-losses-aon-idINKBN1FD223", "country": "US", "domain_rank": 408, "title": "2017 second-costliest year on record for natural-disaster insured losses: Aon", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:56:00.000+02:00", "replies_count": 0, "uuid": "14b994a5948f5cde18c6f6fbfa2e3d0b3df52af3"}, "author": "", "url": "https://in.reuters.com/article/global-insurance-aon/2017-second-costliest-year-on-record-for-natural-disaster-insured-losses-aon-idINKBN1FD223", "ord_in_thread": 0, "title": "2017 second-costliest year on record for natural-disaster insured losses: Aon", "locations": [], "entities": {"persons": [{"name": "aon benfield", "sentiment": "none"}, {"name": "harvey", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new orleans", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}], "organizations": [{"name": "aon", "sentiment": "negative"}, {"name": "aon reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 2:57 PM / Updated 29 minutes ago 2017 second-costliest year on record for natural-disaster insured losses: Aon Reuters Staff 3 Min Read \n(Reuters) - Insured losses in the private sector and government-sponsored programmes from natural disasters came to $134 billion in 2017, making it the second-costliest year on record, broker Aon Benfield said on Wednesday. \nThree major hurricanes in the United States and Caribbean alone led to losses of $100 billion in 2017, according to risk modelling agencies and reinsurers. \nThat compares with losses of about $74 billion caused by Hurricane Katrina, which hit New Orleans in 2005. \nThere were 330 natural catastrophes last year, leading to overall economic losses of $353 billion, of which an “unprecedented” 97 percent were caused by weather-related events, according to Aon’s catastrophe report, making 2017 the costliest year on record for weather disasters. \nAt $132 billion, 2017 was also the costliest year for insurers for weather disasters, with 60 percent of global insurance payouts in the year caused by Hurricanes Harvey, Irma, and Maria. \nWeather losses exclude losses from other natural disasters such as earthquakes, volcanic eruptions and tsunamis. An aerial photo shows damage caused by Hurricane Harvey in Rockport, Texas, U.S., August 31, 2017. REUTERS/DroneBase/Files \nWildfires caused $14 billion of insurance losses in 2017 – the highest on record for the peril, Aon said. \nCalifornia faced wildfires in the northern part of the state that resulted in losses to those insured of more than $9 billion in October. Later in December, a sprawling Southern California wildfire become the largest on record in the state. Slideshow (2 Images) \nOther notable weather events in the year included earthquakes in Mexico, floods and Typhoon Hato in China and drought in Southern Europe. \n“The insurance industry was well-positioned to handle the cost of the 2017 disasters. Global reinsurer capital was a record $600 billion at the end of third quarter 2017,” Aon said. \nAs a result, some reinsurers had been expecting double-digit price rises across the board when the Jan. 1 renewals came around after all of last year’s losses. \nIn the end, however, global property reinsurance prices rose less than expected, with strong competition limiting increases to single-digit percentages. \nGerman reinsurer Munich Re, said this month that insurers will have to pay claims of around $135 billion for 2017, the most ever, following the spate of hurricanes, earthquakes and fires in North America. Reporting by Noor Zainab Hussain in Bengaluru; Additional reporting by Carolyn Cohn in London; Editing by Hugh Lawson", "external_links": [], "published": "2018-01-24T16:56:00.000+02:00", "crawled": "2018-01-24T17:30:47.006+02:00", "highlightTitle": ""}