{"organizations": [], "uuid": "1b019de3446982260287500a2d71697881514f05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/japan-economy-boj/boj-to-sound-cautious-optimism-on-inflation-keep-policy-unchanged-idUSL4N1PH1FM", "country": "US", "domain_rank": 408, "title": "BOJ to sound cautious optimism on inflation, keep policy unchanged", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T05:01:00.000+02:00", "replies_count": 0, "uuid": "1b019de3446982260287500a2d71697881514f05"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/japan-economy-boj/boj-to-sound-cautious-optimism-on-inflation-keep-policy-unchanged-idUSL4N1PH1FM", "ord_in_thread": 0, "title": "BOJ to sound cautious optimism on inflation, keep policy unchanged", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "none"}, {"name": "haruhiko kuroda", "sentiment": "none"}, {"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Policy decision expected 0330-0500 GMT\n* BOJ seen keeping interest rate targets unchanged\n* Growth f‘cast seen revised up in quarterly review\n* BOJ may sound more upbeat on inflation expectations\n* Governor Kuroda to brief media 0630 GMT\nBy Leika Kihara\nTOKYO, Jan 23 (Reuters) - Japan’s central bank is set to keep monetary settings unchanged on Tuesday and offer a cautiously optimistic view on the inflation outlook, nodding to expectations that a strengthening recovery and a tightening job market may prompt firms to lift wages.\nBut Bank of Japan Governor Haruhiko Kuroda will seek to dispel market speculation of an early withdrawal of stimulus by reminding investors at his post-meeting briefing that inflation remains distant from his 2 percent target, analysts say.\nThe yen’s recent gains, if they persist, may also keep BOJ officials from openly debating a future exit from crisis-mode policies, as a weak currency and a rise in exports have been among the key drivers of Japan’s recovery.\n“I don’t think the BOJ is worried about current dollar/yen levels. Its key concern is the risk of triggering a big market reaction when it starts to signal a hike in its yield targets,” said Hiroshi Ugai, chief Japan economist at JPMorgan Securities.\n“The BOJ probably wants to spend more time looking at wage and price developments, so I doubt Kuroda will send any signals on the future policy path this time,” he said.\nAt the two-day meeting ending on Tuesday, the BOJ is seen maintaining a pledge to guide short-term interest rates at minus 0.1 percent and 10-year bond yields around zero percent.\nIt will also likely keep intact a loose pledge to buy government bonds so its holdings increase roughly at an annual pace of 80 trillion yen ($722 billion).\nNO COMPLACENCY Brightening global growth prospects are offering fresh communication challenges for policymakers. The BOJ, the Federal Reserve and the European Central Bank are all grappling with how to exit extraordinary policy steps, without scaring investors accustomed to years of massive cheap money.\nJapan got a taste of the challenge when a cut in the BOJ’s bond buying pushed up global yields, and Kuroda’s positive remarks on the economy drove the yen to a four-month high.\nWith exports booming from robust global demand, the BOJ is seen slightly raising its growth forecast for the fiscal year beginning in April from a projection of 1.4 percent made three months ago, according to sources familiar with its thinking.\nIn the quarterly review, the central bank will roughly maintain its price forecasts for coming years and stick to its view that inflation will hit 2 percent by March 2020, they say.\nSources say the nine-member board may also debate offering a slightly brighter view on inflation expectations than the existing assessment, which currently describes expectations as being “on a weak note.”\nJapan’s economy expanded for the seventh straight quarter in July-September and business confidence hit a 11-year high on robust exports and capital expenditure.\nCore consumer prices rose for the 11th straight month in November and the percentage of households expecting inflation to accelerate hit a nearly two-year high in January, adding to signs Japan may be emerging from two decades of deflation.\nBut BOJ policymakers are hardly complacent and warn that an index of consumer inflation that strips away the effect of fresh food and energy - still at 0.3 percent - must accelerate more before any debate on withdrawing stimulus could begin.\n($1 = 110.8000 yen)\nEditing by Sam Holmes\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T05:01:00.000+02:00", "crawled": "2018-01-23T17:59:40.003+02:00", "highlightTitle": ""}