{"organizations": [], "uuid": "86198ecb05724e3271d925efe5e718a49ad587d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-fm-capital-and-amac-holdings-acquire-1692-beds-in-greenville-nc-near-east-carolina-university-and-pitt-community-college.html", "country": "US", "domain_rank": 767, "title": "FM Capital and AMAC Holdings Acquire 1,692-Beds in Greenville, NC Near East Carolina University and Pitt Community College", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-03T19:08:00.000+02:00", "replies_count": 0, "uuid": "86198ecb05724e3271d925efe5e718a49ad587d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-fm-capital-and-amac-holdings-acquire-1692-beds-in-greenville-nc-near-east-carolina-university-and-pitt-community-college.html", "ord_in_thread": 0, "title": "FM Capital and AMAC Holdings Acquire 1,692-Beds in Greenville, NC Near East Carolina University and Pitt Community College", "locations": [], "entities": {"persons": [{"name": "gottlieb", "sentiment": "negative"}, {"name": "jaclyn fitts", "sentiment": "none"}], "locations": [{"name": "greenville", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "nc", "sentiment": "none"}], "organizations": [{"name": "amac holdings", "sentiment": "negative"}, {"name": "pitt community college", "sentiment": "negative"}, {"name": "fm capital", "sentiment": "negative"}, {"name": "nc near east carolina university", "sentiment": "negative"}, {"name": "amac", "sentiment": "none"}, {"name": "national student housing", "sentiment": "none"}, {"name": "east carolina university", "sentiment": "none"}, {"name": "pitt", "sentiment": "none"}, {"name": "cbre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, N.C., Jan. 3, 2018 /PRNewswire/ -- FM Capital, in conjunction with Gottlieb Family Partners, and AMAC Holdings, through a joint venture, announced today that they have acquired Captain's Quarters, the largest student housing property in Greenville, NC, near East Carolina University (ECU) and Pitt Community College (PITT) campuses.\n\"The Captain's Quarters sales process was extremely competitive as the asset offered unprecedented upside potential given ECU's strong enrollment growth. FM Capital and AMAC's track record closing complicated transactions allowed for them to rise to the top of the aggressive bidding process,\" said Jaclyn Fitts, Director of National Student Housing, CBRE. With this acquisition, FM Capital's student housing portfolio has reached a new milestone of over 5,000 beds.\nCaptain's Quarters encompasses 600 units and 1,692 beds, spans 38 buildings and has extensive amenities, including: three resort-style pools with expansive outdoor lounging and dining areas, two clubhouses, full-court basketball gymnasium, double sand volleyball courts, dog park, fitness center, theater room, computer lab, and multiple private and group study rooms.\nFM Capital and AMAC plan to renovate and reposition the property, in order to restore it as one of the most desirable student housing communities in the Greenville market. Upon takeover, FM Capital and AMAC announced a rebranding of the property, changing the name from Captain's Quarters to Paramount 3800. The new name reflects ownership's strategy to offer a more modern brand that represents a new resident-life experience. Paramount 3800 will also undergo a multi-million dollar renovation. This includes exterior and interior improvements such as the upgrading and modernization of the common areas and amenities, installing high-speed fiber-optic internet, and unit upgrades.\nThe Preiss Company, a national leader in owning and operating student housing, has been selected to manage the property. According to Joe Fishman, VP of Acquisitions for FM Capital, \"The Preiss Company's industry expertise and youthful approach mirrors our value-add strategy for this asset.\" Prior to purchase, the property was divided into two adjacent lots (Phases). Phase I (876-beds) was occupied at 78% for the 2017-18 academic year, while Phase II (816-beds) was left vacant. Post-acquisition, ownership plans to merge the two phases and operate them as a single entity.\nFM Capital and Gottlieb Family Partners are actively acquiring student housing properties in strong markets near and adjacent to universities with growing student populations.\nFor acquisitions opportunities, please contact:\nJoe Fishman, VP of Acquisitions, FM Capital\nJFishman@fmcapital.com\n(305) 722 - 6182\nAbout FM Capital\nFM Capital, LLC is a full service, vertically integrated real estate investment firm that focuses on commercial real estate investment opportunities, debt acquisitions, and loan originations. FM Capital has a value investing philosophy and specialize in profiting from value-add and opportunistic investments. FM Capital currently manages and controls roughly half a billion in assets across the United States. This includes multifamily, student housing, retail, office, industrial, development, and mixed-use properties. www.FMCapital.com\nAbout Gottlieb Family Partners\nGottlieb Family Partners LLC (GFP) is a New York City-based family office which owns and invests in real estate throughout the United States. GFP's current portfolio includes approximately 5,000 student housing units, 15,000 multi-family apartments and 750,000 square feet of commercial space. GFP has been involved in well over $1 billion worth of acquisitions and dispositions and focuses on handling investor equity relationships for its partners.\nAbout AMAC Holdings\nNew York-based Arbor Management Acquisition Company (AMAC) is a full service acquisition and investment firm founded in 2012. Since its inception, the company has successfully acquired more than 8,000 multifamily units across the country within diverse primary and secondary markets. AMAC Holdings is actively pursuing new investment opportunities in the multifamily and student housing sector nationwide. For all inquiries and leads, please contact: Info@AMACHoldings.com or visit our website at www.AMACHoldings.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/fm-capital-and-amac-holdings-acquire-1692-beds-in-greenville-nc-near-east-carolina-university-and-pitt-community-college-300576702.html\nSOURCE FM Capital", "external_links": ["http://www.amacholdings.com/", "http://www.prnewswire.com/news-releases/fm-capital-and-amac-holdings-acquire-1692-beds-in-greenville-nc-near-east-carolina-university-and-pitt-community-college-300576702.html", "http://www.fmcapital.com/"], "published": "2018-01-03T19:08:00.000+02:00", "crawled": "2018-01-03T20:58:44.009+02:00", "highlightTitle": ""}