{"organizations": [], "uuid": "1fe127ed1bdca8e801a4dee58f9c4c120b61b68b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/morocco-currency-band/update-2-morocco-dirham-stable-as-central-bank-introduces-flexible-fx-system-idUSL8N1PA3CZ", "country": "US", "domain_rank": 408, "title": "UPDATE 3-Morocco dirham stable on 1st day of looser exchange rate", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.116, "site_type": "news", "published": "2018-01-15T21:26:00.000+02:00", "replies_count": 0, "uuid": "1fe127ed1bdca8e801a4dee58f9c4c120b61b68b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/morocco-currency-band/update-2-morocco-dirham-stable-as-central-bank-introduces-flexible-fx-system-idUSL8N1PA3CZ", "ord_in_thread": 0, "title": "UPDATE 3-Morocco dirham stable on 1st day of looser exchange rate", "locations": [], "entities": {"persons": [{"name": "ulf laessing", "sentiment": "none"}, {"name": "aziz el yaakoubi casablanca/dubai", "sentiment": "none"}], "locations": [{"name": "morocco", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* No significant pressure on dirham seen\n* Central bank signals it won’t tolerate speculators\n* Global weakness of dollar also helps\n* Morocco’s current account gap set to shrink, reserves high\n* System should make economy more resilient in long term (Adds outlook on dirham trading)\nBy Ulf Laessing and Aziz El Yaakoubi\nCASABLANCA/DUBAI, Jan 15 (Reuters) - Morocco’s dirham barely moved against major currencies and there was little speculative trade as the central bank introduced a more flexible exchange rate on Monday, part of reforms recommended by the International Monetary Fund.\nThe new system, designed to keep exports competitive and protect Morocco’s foreign exchange reserves, widened the band in which the dirham can trade against hard currencies to 2.5 percent on either side of a reference price, from the previous 0.3 percent.\nThis could potentially give speculators more room to take positions against the dirham. But the market was calm on Monday and almost all activity was to fill commercial orders.\nBankers said they expected the dirham to remain stable in the next few weeks as the central bank had made clear it would not tolerate speculation.\n“The central bank is in a position to intervene if necessary thanks to its foreign reserves,” said Abdelmalek Mouatadid, head of Capital Market Sales at Banque Populaire, one of the country’s biggest lenders.\n“Demand for foreign currency has been normal today and we expect demand to remain normal without exceptional moves.”\nThe central bank set a band of 8.9969-9.4524 dirhams to the dollar on Monday. In late trade, the dirham had firmed marginally in the spot market to around 9.2167, Thomson Reuters data showed.\nThe dollar has been falling sharply against currencies globally over the past few days.\nAgainst the euro, the Moroccan currency edged down to 11.3015.\nIMF HELP Morocco has been working for years with a technical mission from the IMF towards liberalising its currency, with both saying the move would be gradual and a full float would take years.\nThe central bank and IMF say the country has enough foreign exchange reserves, covering close to half a year of imports, to allow a smooth transition. The central bank manages the dirham against a currency basket in which the euro has a weight of 60 percent and the dollar 40 percent.\nIt has said it will intervene through regular auctions of the dollar, and other currencies if needed. On Monday, it sold $3.5 million in an auction at a weighted average rate of 9.2307, after offering $20 million.\nJason Tuvey, Middle East economist for London-based Capital Economics, said the new system was a positive step.\n”Last year it was delayed amid fears the currency could sharply depreciate. Those fears have dissipated over the past six to 12 months as foreign exchange reserves have continued to build and capital inflows have remained fairly strong.\n“We saw in Egypt in November 2016 the currency was floated and subsequently fell 50 percent against the dollar. The chance of such a scenario taking hold in Morocco is very unlikely.”\nTuvey said Morocco’s current account deficit, which had deteriorated in recent years because of higher oil prices and imports, was now starting to shrink, with imports falling and exports picking up quite strongly.\n“That should support an improvement in the current account position over the coming years.”\nHasnain Malik, global head of equity research at Exotix Capital, said: “Egypt made its move ...in a crisis situation for foreign reserves and foreign debt servicing, and with a very overvalued exchange rate. The Morocco starting point is the opposite in all these respects.” (Reporting by Ulf Laessing and Aziz El Yaakoubi Additional reporting by Claire Milhench in London; Writing by Andrew Torchia Editing by Jeremy Gaunt and John Stonestreet)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T21:26:00.000+02:00", "crawled": "2018-01-16T13:36:55.030+02:00", "highlightTitle": ""}