{"organizations": [], "uuid": "f2a24790485be3bee7cb591169737a12b91c74e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bny-mellon-reports-fourth-quarter-earnings-of-1-point-13-billion-or-1-point-08-per-common-share.html", "country": "US", "domain_rank": 767, "title": "BNY Mellon Reports Fourth Quarter Earnings of $1.13 Billion Or $1.08 Per Common Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.921, "site_type": "news", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "f2a24790485be3bee7cb591169737a12b91c74e7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bny-mellon-reports-fourth-quarter-earnings-of-1-point-13-billion-or-1-point-08-per-common-share.html", "ord_in_thread": 0, "title": "BNY Mellon Reports Fourth Quarter Earnings of $1.13 Billion Or $1.08 Per Common Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bny mellon", "sentiment": "negative"}, {"name": "bank of new york mellon corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 /PRNewswire/ --\nTOTAL REVENUE OF $3.7 BILLION, DECREASED 2%\nIncludes $320 million negative impact related to U.S. tax legislation and other charges (a) ; which decreased total revenue growth by 8% Investment management and performance fees increased 13% Investment services fees increased 5%; Asset servicing fees increased 6%\nTOTAL EXPENSE OF $3.0 BILLION, INCREASED 14%\nIncludes $282 million (pre-tax) for severance, litigation and other charges (a) ; which increased total expense growth by 11%\nFULL-YEAR 2017 EARNINGS OF $3.9 BILLION, OR $3.72 PER COMMON SHARE, AN INCREASE OF 18%\nTotal revenue up 2% and total expense up 4% Includes impact of U.S. tax legislation, severance, litigation and other charges (a); which decreased revenue growth by 2% and increased expense growth by 3% These items increased earnings per share growth by 5%\nEXECUTING ON CAPITAL PLAN\nReturned nearly $900 million through share repurchases and dividends and $3.6 billion in full-year 2017\nThe Bank of New York Mellon Corporation (\"BNY Mellon\") (NYSE: BK) today reported fourth quarter net income applicable to common shareholders of $1.13 billion, or $1.08 per diluted common share. Results for the fourth quarter 2017 include an estimated net benefit related to the Tax Cuts and Jobs Act (\"U.S. tax legislation\") of $427 million, or $0.41 per common share, and severance, litigation and other charges of $246 million, or $0.24 per common share (a). Net income applicable to common shareholders was $822 million, or $0.77 per diluted common share, in the fourth quarter of 2016, and $983 million, or $0.94 per diluted common share, in the third quarter of 2017.\n\"Our fourth quarter results were impacted by new tax legislation and actions that we took to strengthen our firm for the longer term. Aside from these items, our results were favorably impacted by strong equity markets and the underlying businesses continued to show modest growth in revenues and profits,\" Charles W. Scharf, chairman and chief executive officer, said.\n\"We saw strength in asset servicing along with growth in collateral management and clearing services – areas where we see continued client demand. Additionally, our investment management business performed well due to an uplift from global equity markets, net inflows and improved investment performance fees, resulting from good investment performance, especially in fixed income,\" Mr. Scharf continued.\n\"The actions that resulted in the severance and other charges during the quarter are part of an ongoing review of our performance. We expect this review to be completed by our March 8th Investor Day where we intend to provide a comprehensive update of the review and have a broader discussion about our firm.\"\n\"In addition, we have thought how best to use the ongoing benefit from lower taxes and we believe that we have a responsibility to our employees to share the benefit, as well as to invest as much as we intelligently can to build the company for the future so we can serve our clients, communities, and shareholders for the long term. At this point, we are anticipating that the impact of the lower tax rate would be almost entirely offset by actions that we will take to reinvest this benefit in our employees and our business,\" Mr. Scharf concluded.\n(a) Other charges include an asset impairment and investment securities losses related to the sale of certain securities.\nFOURTH QUARTER 2017 FINANCIAL HIGHLIGHTS\n(comparisons are 4Q17 vs. 4Q16, unless otherwise stated)\nEarnings\nReported 4Q earnings of $1.13 billion, or $1.08 per common share, including the estimated impact of U.S. tax legislation and other charges (a).\nAmounts included in 4Q17 results\n(dollars in millions, except earnings per share)\nResults - GAAP\nU.S. tax legislation\nOther charges\n(a)\nFee and other revenue\n$\n2,860\n$\n(279)\n$\n(37)\nIncome from consolidated investment management funds\n17\n—\n—\nNet interest revenue\n851\n(4)\n—\nTotal revenue\n3,728\n(283)\n(37)\nProvision for credit losses\n(6)\n—\n—\nTotal noninterest expense\n3,006\n—\n282\nIncome before taxes\n728\n(283)\n(319)\n(Benefit) provision for income taxes\n(453)\n(710)\n(73)\nNet income\n$\n1,181\n$\n427\n$\n(246)\nDiluted earnings per common share\n$\n1.08\n$\n0.41\n$\n(0.24)\n(a) Other charges include severance, litigation, an asset impairment and investment securities losses related to the sale of certain securities.\nTotal revenue of $3.7 billion, decreased 2%. Investment services fees increased 5% reflecting higher money market fees, higher equity market values and termination fees due to lost business recorded in 4Q17. Investment management and performance fees increased 13% due to higher equity market values, money market fees, performance fees and the favorable impact of a weaker U.S. dollar. Investment management and performance fees increased 11% on a constant currency basis (Non-GAAP) (b). Foreign exchange revenue was unchanged reflecting higher volumes offset by lower volatility. Investment and other income decreased reflecting the impact of U.S. tax legislation on our renewable energy investments. Net interest revenue increased 2% driven by higher interest rates, offset by lower average deposits and loans as well as the impact of interest rate hedging activities and leasing. The provision for credit losses was a credit of $6 million. Noninterest expense of $3.0 billion, increased 14% reflecting higher severance, litigation and an asset impairment, as well as higher incentive expense driven by stronger performance and the unfavorable impact of the weaker U.S. dollar. Preferred stock dividends of $49 million.\nU.S. tax legislation\nU.S. tax legislation increased net income by an estimated $427 million as follows:\n(estimated in millions)\nTotal revenue\nIncome taxes\nNet income\nRemeasurement of net deferred tax liabilities (c)\n$\n—\n$\n1,191\n$\n1,191\nRepatriation tax\n—\n(723)\n(723)\nOther items\n(4)\n(39)\n(43)\nRenewable energy investments\n(279)\n281\n2\n$\n(283)\n$\n710\n$\n427\n(c) Excluding deferred tax liabilities related to renewable energy investments.\nRegulatory capital decreased by $551 million driven by the repatriation tax, offset by the tax benefit related to the remeasurement of certain deferred tax liabilities. Effective tax rate for 2018 is expected to be approximately 21%.\nAssets under custody and/or administration (\"AUC/A\") and Assets under management (\"AUM\")\nRecord AUC/A of $33.3 trillion increased 11% reflecting higher market values, the favorable impact of a weaker U.S. dollar and net new business. Estimated new AUC/A wins in Asset Servicing of $575 billion in 4Q17. Record AUM of $1.9 trillion increased 15% reflecting higher market values, the favorable impact of a weaker U.S. dollar and net inflows. Net long-term inflows of $16 billion in 4Q17 reflect inflows of liability-driven investments, partially offset by outflows of active equity and fixed income investments and index funds. Net short-term outflows of $4 billion in 4Q17.\nCapital and liquidity\nRepurchased 12 million common shares for $651 million and paid $248 million in dividends to common shareholders and repurchased 55 million common shares for $2.7 billion and paid $901 milli", "external_links": ["http://www.bnymellon.com/newsroom", "http://www.prnewswire.com/news-releases/bny-mellon-reports-fourth-quarter-earnings-of-113-billion-or-108-per-common-share-300584505.html", "http://www.bnymellon.com/investorrelations"], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T17:10:55.038+02:00", "highlightTitle": ""}