{"organizations": [], "uuid": "cef147ece13f0e52b58184d28ee9f6c65ad02f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224243841&w=1200&r=LYNXMPEE0L1WL", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-eu-poland-budget/eu-mulls-new-link-between-budget-and-civic-rights-idUKKBN1FB2OM", "country": "US", "domain_rank": 408, "title": "EU mulls new link between budget and civic rights", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:23:00.000+02:00", "replies_count": 0, "uuid": "cef147ece13f0e52b58184d28ee9f6c65ad02f3d"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-poland-budget/eu-mulls-new-link-between-budget-and-civic-rights-idUKKBN1FB2OM", "ord_in_thread": 0, "title": "EU mulls new link between budget and civic rights", "locations": [], "entities": {"persons": [{"name": "jourova", "sentiment": "none"}, {"name": "vera jourova", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:23 PM / Updated 2 hours ago EU mulls new link between budget and civic rights Reuters Staff 3 Min Read \nBRUSSELS (Reuters) - The EU’s justice commissioner is working on a proposal that could oblige member states such as Poland, which has clashed with Brussels over reforms to its courts, to pass tests on the independence of their judicial systems before receiving funding. \nVera Jourova said there was agreement within the executive European Commission to work on ideas to encourage strong judiciaries in planning for the new budget from 2021. \n“One way could be to insist that independent justice systems are necessary for effective control of the use of EU funds,” she said. “I would like to propose that link.” \nA Commission spokesman said on Monday the work by Jourova was part of broader preparations for a new, seven-year EU budget plan, due to be published in May, and was in line with policy outlines the EU executive has put forward since last year. \nThe remarks by Jourova, the Commission’s Czech member, come as the EU executive is challenging Poland, a major recipient of Union funds, to amend judicial reforms which Brussels says will hurt democracy and its oversight of EU trading rules. \nFacing the prospect of filling a hole left in the budget by Britain’s exit from the EU, and irritated by Poland and other governments in the ex-communist east on a range of issues, some wealthy Western governments have pushed for a clearer link between getting subsidies and abiding by EU standards. \nThe German commissioner in charge of the budget, Guenther Oettinger, warned Poland this month that it could lose some of its 7 billion euros annual funding if it fails to heed Brussels’ complaints about undermining the rule of law. \nMore broadly, Jourova is also hoping for a review of EU policy on judicial standards in the second half of this year. EU officials say that might, for example, include regular reviews of the performance of national justice systems, along the lines of existing biennial reviews of government economic policies, which are meant to promote “convergence” toward EU-wide goals. \nAs a former national official handling the regional funding that is a key part of EU efforts to bring poor regions closer to the prosperity of others, Jourova stressed that she saw any new rules applying to all EU funding for all states, not just to so-called “cohesion” policy. She also said it should not be seen as a punitive measure but designed to encourage good practice. \nShe also said discussion on the proposals could be used to help simplify some of the hurdles to applying for EU funds. \nAny Commission proposal seen as too radical by governments risk being killed off by member states. Reporting by Alastair Macdonald; Editing by Catherine Evans", "external_links": [], "published": "2018-01-22T21:23:00.000+02:00", "crawled": "2018-01-22T21:51:12.006+02:00", "highlightTitle": ""}