{"organizations": [], "uuid": "082911155bffcd2120a720dc1f15ad604c3732b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/891108664.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/trump-state-of-the-union-wear-black/", "country": "US", "domain_rank": 1196, "title": "Trump State of the Union: Female Democrats Will Wear Black | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.746, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "082911155bffcd2120a720dc1f15ad604c3732b3"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/10/trump-state-of-the-union-wear-black/", "ord_in_thread": 0, "title": "Trump State of the Union: Female Democrats Will Wear Black | Fortune", "locations": [], "entities": {"persons": [{"name": "claire zillman", "sentiment": "negative"}, {"name": "speier", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jackie speier", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "trump state", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "none"}, {"name": "democratic women’s working group", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Claire Zillman 11:59 AM EST \nTaking a cue from Hollywood, some female Democrats in Congress plan to wear black to President Donald Trump’s first State of the Union speech on January 30 in protest of sexual harassment. \nThe all-black fashion statement will replicate the one female film stars pulled off at Sunday’s Golden Globes. They flooded the awards ceremony red carpet with black gowns to protest the movie industry’s rampant sexual harassment and sexism. \nLawmakers’ protest will highlight the same cause. \n“This is a culture change that is sweeping the country, and Congress is embracing it,” Rep. Jackie Speier (D-Calif.) told NBC News. Speier said members of the Democratic Women’s Working Group supported the move and were encouraging male and female lawmakers from both parties to join in. \nDespite the group’s purported bipartisan approach to the symbolic protest, it will no doubt be viewed as a blatant statement against the president, who has been accused of sexual misconduct by more than a dozen women. He has denied all the claims and the White House has characterized his accusers as liars. \nSpeier, for her part, has been especially vocal on the issue of sexual harassment in politics. In testimony before a House committee in November , the California lawmaker said that two current members of Congress—a Democrat and a Republican—had sexually harassed staff members, according to stories she’d heard. \n“From comments like ‘Are you going to be a good girl?,’ to harassers exposing their genitals, to victims having their private parts grabbed on the House floor, women and men have trusted me with their stories,” Speier said at the time. “All they ask in return is that we fix our abusive system and hold perpetrators accountable.” \nAs early as 2014, Speier had pushed for House members and staffers to complete mandatory anti-harassment training. The bill didn’t pass then, but following Speier’s testimony in November, House Speaker Paul Ryan announced that members of the legislature and their office employees would be required to undergo training. \nThe planned State of the Union protest is reminiscent of a similar fashion statement Democratic women made at Trump’s first address to a joint session of Congress in February. Democratic women donned white to that event . Tonight, our Democratic #WomenWearWhite in support of women's rights — in spite of a @POTUS who doesn't! pic.twitter.com/kKJpfV5iUE \n— Nancy Pelosi (@NancyPelosi) February 28, 2017 \nThe Democratic Women’s Working Group, which organized the February protest, said the decision to wear white—a color associated with women’s suffrage movement—symbolized “the ongoing fight to attain equal rights for all women.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-10T20:40:25.005+02:00", "highlightTitle": ""}