{"organizations": [], "uuid": "838ab564c7b678ea27168df87f1daa9c98c4770c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-somalia-conflict-children/somalias-al-shabaab-denies-forcibly-recruiting-children-to-fight-idUSKBN1F72TE", "country": "US", "domain_rank": 408, "title": "Somalia's al Shabaab denies forcibly recruiting children to fight", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.607, "site_type": "news", "published": "2018-01-19T03:19:00.000+02:00", "replies_count": 0, "uuid": "838ab564c7b678ea27168df87f1daa9c98c4770c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-somalia-conflict-children/somalias-al-shabaab-denies-forcibly-recruiting-children-to-fight-idUSKBN1F72TE", "ord_in_thread": 0, "title": "Somalia's al Shabaab denies forcibly recruiting children to fight", "locations": [], "entities": {"persons": [{"name": "al shabaab", "sentiment": "none"}, {"name": "shabaab", "sentiment": "none"}], "locations": [{"name": "somalia", "sentiment": "none"}, {"name": "southern bay", "sentiment": "none"}, {"name": "horn of africa", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "human rights watch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOGADISHU/NAIROBI (Thomson Reuters Foundation) - Somalia’s Islamist militant group al Shabaab on Thursday denied that it was threatening and abducting civilians to hand over their children for indoctrination and military training.\nAl Shabaab has been fighting for years to topple Somalia’s central government and rule the Horn of Africa country according to its own interpretation of Islamic law.\nHuman Rights Watch (HRW) said on Monday that the armed group began ordering elders and teachers in rural parts of the southern Bay region in mid-2017 to provide them with children - as young as eight - or face reprisals.\nBut an al Shabaab spokesman told the Thomson Reuters Foundation the group does not recruit members below the age of 15, and that no one is forced to join. He said children were being sent to Islamic religious schools to be educated.\n“There is an al Shabaab rule in the areas we control that children should learn, and we give them teachers at boarding madrasas where they study. We have agreed with the clan elders about the education of their children,” he said.\n“When students complete their education, we return them to their parents. No one is forced to join our forces. We do not want children in the remote areas to become as ignorant asanimals,” he added, declining to be named.\nHRW says the armed group has recruited thousands of children for indoctrination and to become frontline fighters over the past decade, and its religious schools - which began in 2015 - are pressured to teach al Shabaab’s curriculum.\n“The group should immediately stop abducting children and release all children in their ranks,” said Laetitia Bader, HRW’s senior Africa researcher. “The Somali government should ensure these children are not sent into harm’s way.”\nGamal Hassan, Somalia’s minister for planning, investment and economic development, said he was not surprised by reports of aggressive child recruitment by the group. He did not provide any response to how authorities would better protect children.\n“Al Shabaab continues to do activities which are illegal, immoral and against humanitarian law,” Hassan told a conference on Wednesday. “So I am not surprised they do that. They used to do that, and now they continue to do that.”\nThe insurgents, who are allied with al Qaeda, were driven out of the capital Mogadishu in 2011. They have also lost nearly all other territory they previously held after an offensive by Somali government troops and African Union peacekeepers.\nAl Shabaab, however, remains a formidable threat and has carried out bombings in Mogadishu and other towns against military and civilian targets.\nReporting by Feisal Omar in Mogadishu and Nita Bhalla @nitabhalla in Nairobi; Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T03:19:00.000+02:00", "crawled": "2018-01-19T00:45:47.015+02:00", "highlightTitle": ""}