{"organizations": [], "uuid": "afd0dada88785746db2c635626285d5c1f85ca41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226950957&w=1200&r=LYNXMPEE0U0XV", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia-corallo/mueller-seeks-to-interview-trump-legal-team-ex-spokesman-source-idUSKBN1FK1VI", "country": "US", "domain_rank": 408, "title": "Mueller seeks to interview Trump legal team ex-spokesman: source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:22:00.000+02:00", "replies_count": 0, "uuid": "afd0dada88785746db2c635626285d5c1f85ca41"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-corallo/mueller-seeks-to-interview-trump-legal-team-ex-spokesman-source-idUSKBN1FK1VI", "ord_in_thread": 0, "title": "Mueller seeks to interview Trump legal team ex-spokesman: source", "locations": [], "entities": {"persons": [{"name": "mueller", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "mark corallo", "sentiment": "none"}, {"name": "corallo", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:19 PM / Updated 3 hours ago Mueller to interview former spokesman of Trump legal team: source Mark Hosenball , Karen Freifeld 3   Special Counsel Robert Mueller plans to interview the former spokesman of President Donald Trump’s legal team as part of an investigation into potential collusion between Russia and Trump’s campaign to sway the 2016 U.S. presidential election, according to a source with knowledge of the matter. \nMark Corallo had represented Trump’s outside lawyers amid the federal and congressional Russia inquiries until he resigned last summer, after revelations about a June 2016 meeting between Trump’s son Donald Jr and a group of Russians. \nThe Mueller team contacted Corallo’s lawyer, Victoria Toensing, and said they wanted to discuss the circumstances of his departure, the source said. The interview was expected within two weeks. \nCorallo’s departure in July came amid a shakeup of Trump’s legal team and media reports his lawyers were considering ways to limit Mueller’s probe. \nOne of the main reasons Corallo decided to leave was his refusal to criticize the integrity of Mueller, the person, who had direct knowledge of the matter, told Reuters. \nCorallo was also deeply disturbed by what he viewed as a false statement dictated by president from Air Force One about his son’s Trump Tower meeting with Russian lawyer Natalia Veselnitskaya and her associates, the source said. \nThe Russians had promised Trump Jr damaging information on Democratic presidential rival Hillary Clinton. \nU.S. intelligence agencies have determined that Moscow worked to sway last year’s election towards Trump. Moscow has denied interference and Trump, a Republican, has said there was no collusion. \nMueller’s team is investigating whether there was any collusion between Moscow and the Trump campaign, or attempts by members of the Trump team to obstruct the investigation. \nCorallo did not want to engage in or be associated with White House attacks on Mueller and top Justice Department officials, according to a person familiar with the matter. \nIn a July 2017 interview with the New York Times, Trump lashed out at his attorney general, Jeff Sessions, for recusing himself from overseeing the Russia investigation, which led to the appointment of a special counsel. He also attacked Mueller’s investigators as having conflicts of interest, and expressed unhappiness with the deputy attorney general, Rod Rosenstein. \nThe federal investigation has resulted in guilty pleas from former Trump national security adviser Michael Flynn and former campaign aide George Papadopoulos. Former campaign manager Paul Manafort and aide Richard Gates have pleaded not guilty to charges that include money laundering. Writing by Doina Chiacu; Editing by Bernadette Baum", "external_links": [], "published": "2018-01-31T15:22:00.000+02:00", "crawled": "2018-01-31T15:36:41.015+02:00", "highlightTitle": ""}