{"organizations": [], "uuid": "976215cb0aac2d69c78d3fbea7caf48d9ad03a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-trade-tariffs-tesla/update-1-fine-print-in-trump-solar-tariff-holds-some-good-news-for-tesla-idUSL2N1PJ029", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Fine print in Trump solar tariff holds some good news for Tesla", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T03:19:00.000+02:00", "replies_count": 0, "uuid": "976215cb0aac2d69c78d3fbea7caf48d9ad03a6d"}, "author": "", "url": "https://www.reuters.com/article/usa-trade-tariffs-tesla/update-1-fine-print-in-trump-solar-tariff-holds-some-good-news-for-tesla-idUSL2N1PJ029", "ord_in_thread": 0, "title": "UPDATE 1-Fine print in Trump solar tariff holds some good news for Tesla", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nichola groom", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "trump", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "tesla inc.", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 19 AM / Updated 17 minutes ago UPDATE 1-Fine print in Trump solar tariff holds some good news for Tesla Reuters Staff \n(Adds analyst comment in paragraph 9, detail on Tesla’s expectations in paragraph 5) \nBy Nichola Groom \nLOS ANGELES, Jan 23 (Reuters) - Electric vehicle maker and solar installer Tesla Inc. said on Tuesday that it does not expect President Donald Trump’s solar tariff to have much impact on its high-tech solar manufacturing ambitions, thanks to a clause exempting a vast amount of solar panel components from the levies. \nTrump’s order, signed into law on Tuesday, imposes a 30 percent tariff on fully assembled imported solar panels as well as the cells of which the panels are made - a move intended to protect American jobs but which the solar industry worries will raise costs and trigger thousands of layoffs. \nBut in a twist destined to help the California company, the solar cell tariff only kicks in after 2.5 gigawatts worth hit U.S. shores each year. \nTesla uses solar cells in its nascent solar roof tile business. The tiles generate electricity without the need for a traditional panel. Tesla also has plans to build conventional panels using imported cells for its U.S.-based residential installation business, which it also hopes to grow over the coming years. \nTesla expects to be able to import foreign cells for its tile and panel businesses free of tariffs thanks to the large exemption for cells, a source familiar with the company’s operations said on Tuesday. \nOnly 500 MW worth of solar cells were imported into the United States in total last year, according to the Solar Energy Industries Association, a fifth of what is being exempted from Trump’s tariff. \nBaird analyst Ben Kallo agreed the tariff was generally positive for Tesla as it will make its domestic products more competitive with imports - though he noted its installation business will pay higher prices for imported panels in the short term. Tesla shares rose $1.23, or 0.3 percent, to close at $352.79 on Tuesday. \nTesla had been part of a group of domestic manufacturers that lobbied against tariffs on solar products. \nGTM Research Senior Solar Analyst Jade Jones said in an emailed statement the 2.5 GW cell exemption could also benefit other U.S.-based panel manufacturers, including First Solar which plans to expand output in Ohio. (Reporting by Nichola Groom; Editing by Cynthia Osterman)", "external_links": [], "published": "2018-01-24T03:19:00.000+02:00", "crawled": "2018-01-24T03:44:01.002+02:00", "highlightTitle": ""}