{"organizations": [], "uuid": "9c928097c27355c3725a14393a7ac9c491510c31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941573-AP_293148909309.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/saudi-state-taking-control-of-binladin-construction-giant-report.html", "country": "US", "domain_rank": 767, "title": "Saudi state taking control of Binladin construction giant: Report", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:35:00.000+02:00", "replies_count": 0, "uuid": "9c928097c27355c3725a14393a7ac9c491510c31"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/saudi-state-taking-control-of-binladin-construction-giant-report.html", "ord_in_thread": 0, "title": "Saudi state taking control of Binladin construction giant: Report", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "binladin", "sentiment": "none"}, {"name": "mecca", "sentiment": "none"}, {"name": "grand mosque", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "saudi binladin group", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "binladin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "World News Saudi state taking control of Binladin construction giant: Report Riyadh's move to take control over the biggest builder in the country seems aimed at ensuring the group can continue to serve Saudi Arabia's development plans. Ownership of Binladin currently remains with the family, the group is in negotiations with the government about the potential transfer of some assets to the state. Published 57 Mins Ago SHARES Mosa'ab Elshamy | AP A construction worker walks past the site of a crane collapse that killed over a hundred on Friday inside the Grand Mosque in the holy city of Mecca, Saudi Arabia, Tuesday, Sept. 15, 2015. Saudi Arabia has in part blamed the construction giant Saudi Binladin Group for the collapse. \nSaudi Arabia is taking managerial control of Saudi Binladin Group and discussing a possible transfer of some of the giant construction group's assets to the state while its chairman and other family members are in detention, sources told Reuters. \nBinladin, which had over 100,000 employees at its height, is the biggest builder in the country and important to Riyadh's plans for large real estate, industrial and tourism projects to help diversify the economy beyond oil. \nHowever, the group has been hurt financially in the past couple of years by a slump in the construction industry and a temporary exclusion from new state contracts after a crane accident killed 107 people at Mecca's Grand Mosque in 2015. It was forced to lay off thousands of employees. \nRiyadh's move to take control appears aimed at ensuring the group can continue to serve Saudi Arabia's development plans, said banking and industry sources, who declined to be named due to the political and commercial sensitivity of the matter. \nThe government detained scores of senior officials and businessmen in October as part of a sweeping crackdown on corruption. The Binladin group's chairman Bakr Bin Laden and several family members have been held, the sources said. \nSaudi officials are trying to negotiate settlements with detainees, saying they aim to claw back some $100 billion of funds that rightfully belong to the state. The talks on Binladin's future are part of this effort, the sources said. \nSince the detention of Bin Laden family members, the finance ministry has formed a five-member committee, including three government representatives, to oversee the group's business and handle relations with suppliers and contractors, the sources said. \nBinladin executives did not respond to phone calls seeking comment. Finance ministry officials and the government media office also did not respond to requests for comment. Setting a precedent \nAlthough ownership of Binladin currently remains with the family, the group is in negotiations with the government about the potential transfer of some assets to the state, or possibly reducing or eliminating the government's outstanding debts to Binladin, the sources said. \nOne banking source with detailed knowledge of the group said the debt might total around $30 billion - the legacy of a period about 18 months ago when the government held off from settling many of its debts as its finances were hurt by low oil prices. \nIt is not clear whether the government's handling of Binladin may set a precedent for the cases of other businessmen detained in the corruption purge. \nThey include one of the kingdom's most prominent businessmen, Prince Alwaleed bin Talal, who is chairman and owner of global investment firm Kingdom Holding. \nBecause of Binladin's strategic importance to the construction industry and development projects, as well as its financial struggle, it may be treated differently from the assets of other detained suspects. \nThe new management committee's government representatives include Abdulrehman al-Harkan, a former chief executive of Saudi property company Dar Al Arkan, and Khaled Nahas, a board member of petrochemical producer Saudi Basic Industries Corp, the sources said. There are also two family members on the committee: Yehia Bin Laden and Abdullah Bin Laden. \nPreviously, the family was in total control of the group, with Bakr Bin Laden taking most decisions, the sources said. \nAlthough Osama Bin Laden, the founder of al-Qaeda who was killed by U.S. forces in 2011, was part of the same family, the company did not have any ties to him.", "external_links": [], "published": "2018-01-11T23:35:00.000+02:00", "crawled": "2018-01-11T23:17:00.005+02:00", "highlightTitle": ""}