{"organizations": [], "uuid": "0a18ee5522754bb82f8b712ee40aff22a4fc1539", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-great-lakes-announces-appointment-of-larry-dickerson-as-board-chair.html", "country": "US", "domain_rank": 767, "title": "Great Lakes Announces Appointment of Larry Dickerson as Board Chair", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:00:00.000+02:00", "replies_count": 0, "uuid": "0a18ee5522754bb82f8b712ee40aff22a4fc1539"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-great-lakes-announces-appointment-of-larry-dickerson-as-board-chair.html", "ord_in_thread": 0, "title": "Great Lakes Announces Appointment of Larry Dickerson as Board Chair", "locations": [], "entities": {"persons": [{"name": "larry dickerson", "sentiment": "negative"}, {"name": "robert b. uhler", "sentiment": "none"}, {"name": "lawrence r. dickerson", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "dickerson", "sentiment": "none"}, {"name": "uhler", "sentiment": "none"}], "locations": [{"name": "oak brook", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "great lakes dredge & dock corporation", "sentiment": "negative"}, {"name": "great lakes board", "sentiment": "none"}, {"name": "compensation and audit committees", "sentiment": "none"}, {"name": "board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAK BROOK, Ill., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Great Lakes Dredge & Dock Corporation (the “Company” or “Great Lakes”) (NASDAQ:GLDD), the largest provider of dredging services in the United States and a major provider of environmental and remediation services, today announced that the Board of Directors has appointed Lawrence R. Dickerson as Board Chair effective February 1, 2018. Mr. Dickerson is assuming the role from Robert B. Uhler who requested to step down as Board Chair in order to accommodate his other professional and personal time commitments. Mr. Uhler continues to serve as an independent director.\nMr. Dickerson has served on the Board since January 2017, including on the Compensation and Audit Committees, and has been a valuable contributor to the Great Lakes Board having over 30 years of operational and commercial experience in the oil and gas industry. Working with the current Board and management team, Mr. Dickerson will continue to oversee the updated strategy and direction of the Company.\nMr. Dickerson commented, “On behalf of the Board, I want to thank Bob for his service to Great Lakes, and we are grateful for his leadership as Board Chair over the last year.”\nAbout Lawrence R. Dickerson\nMr. Dickerson spent 34 years at Diamond Offshore Drilling, Inc., a deepwater oil and gas drilling contractor, where he served as President and Chief Executive Officer from 2008 until his retirement in 2014. Mr. Dickerson also served as Chief Financial Officer and Chief Operating Officer during his tenure at the company.\nIn addition to being a seasoned executive, Mr. Dickerson has significant board experience. He has been a Member of the Board of Directors on the boards of Murphy Oil Corporation (MUR), a gas exploration and production company, and Oil States International, an oilfield equipment services company, since 2014. Mr. Dickerson is on the Audit and Nominating and Governance Committees at Murphy Oil Corporation and on the Audit Committee at Oil States International. He was Chairman of the Board of Directors of Hercules Offshore, Inc. from 2015 to 2016, an offshore drilling company, and he also served on the Board of Directors of Global Industries, Ltd. from 2008 - 2012, a subsea construction company that was sold to Technip in 2011.\nThe Company\nGreat Lakes Dredge & Dock Corporation (“Great Lakes” or the “Company”) is the largest provider of dredging services in the United States and the only U.S. dredging company with significant international operations. The Company is also a significant provider of environmental and remediation services on land and water. The Company employs civil, ocean and mechanical engineering staff in its estimating, production and project management functions. In its over 127-year history, the Company has never failed to complete a marine project. Great Lakes has a disciplined training program for engineers that ensures experienced-based performance as they advance through Company operations. Great Lakes also owns and operates the largest and most diverse fleet in the U.S. dredging industry, comprised of over 200 specialized vessels.\nCautionary Note Regarding Forward-Looking Statements\nCertain statements in this press release may constitute \"forward-looking\" statements as defined in Section 21E of the Securities Exchange Act of 1934 (the \"Exchange Act\"), the Private Securities Litigation Reform Act of 1995 (the \"PSLRA\") or in releases made by the Securities and Exchange Commission (the \"SEC\"), all as may be amended from time to time. Such forward-looking statements involve known and unknown risks, uncertainties and other important factors that could cause the actual results, performance or achievements of Great Lakes and its subsidiaries, or industry results, to differ materially from any future results, performance or achievements expressed or implied by such forward-looking statements. Statements that are not historical fact are forward-looking statements. These cautionary statements are being made pursuant to the Exchange Act and the PSLRA with the intention of obtaining the benefits of the \"safe harbor\" provisions of such laws. Great Lakes cautions investors that any forward-looking statements made by Great Lakes are not guarantees or indicative of future events.\nAlthough Great Lakes believes that its plans, intentions and expectations reflected in this press release are reasonable, actual events could differ materially. The forward-looking statements contained in this press release are made only as of the date hereof and Great Lakes does not have or undertake any obligation to update or revise any forward-looking statements whether as a result of new information, subsequent events or otherwise, unless otherwise required by law.\nFor further information contact:\nAbby Sullivan, Investor Relations\n630-574-3024\nGLDD CORP\nSource:Great Lakes Dredge & Dock Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ca6d56aa-8171-44c8-86b2-6e219065ee1a"], "published": "2018-01-29T17:00:00.000+02:00", "crawled": "2018-01-29T19:36:48.025+02:00", "highlightTitle": ""}