{"organizations": [], "uuid": "538e2f26c8eacc9b27f217add44f8335f22b2eff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-slide-idUSL8N1PJ5Y4", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Closing snapshot: European stocks slide", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:02:00.000+02:00", "replies_count": 0, "uuid": "538e2f26c8eacc9b27f217add44f8335f22b2eff"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-slide-idUSL8N1PJ5Y4", "ord_in_thread": 0, "title": "LIVE MARKETS-Closing snapshot: European stocks slide", "locations": [], "entities": {"persons": [{"name": "anthony rayne", "sentiment": "none"}, {"name": "kit rees", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "miton", "sentiment": "none"}], "organizations": [{"name": "suez", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "novartis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European shares inch lower * Utilities drop after Suez warning * Tech hit by fresh Apple woes * Novartis beats analyst forecasts Jan 24 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: EUROPEAN STOCKS SLIDE (1658 GMT) European stocks have ended in negative territory, sliding further as consumer staples, industrials and financials all fell. This is the STOXX 600's first down day in four - guess the market takes a breather every now and then. And the FTSE 100 has ended at a 3-week low thanks to the pop higher in sterling. Here's your closing snapshot. (Kit Rees) WHICH SAFE HAVEN WOULD YOU CHOOSE IN THE EVENT OF A DOWNTURN? (1613 GMT) How to preserve capital in the event of a market downturn is at the fore of Miton's Anthony Rayner's mind given the run that this current bull market has had and in the face of policy tightening in some major economies. \"It’s worth stating that whilst we know there will be a crisis, we don’t know when it will occur and we don’t know its nature,\" Anthony Rayner, head of Miton's multi-asset fund range, said. Rayner added that if we see an economic crisis in the next few months, it will likely be driven by inflation, so U.S. Treasuries \"won't be the first port of call\" as they would probably struggle on the expectation of higher rates. In terms of equities, Rayner says that resources could be a better safe haven than traditional defensives which tend to move with the bond yield. \"We’re looking at what’s in front of us now, not into the future. To allow us to be pragmatists, we remain in liquid investments and continue to be as open-minded as possible,\" Rayner concludes. (Kit Rees) INSATIABLE APPETITE FOR RISK AND \"MELT UP\" CHATTER (1435 GMT) Just when the phrase \"melt up\" is proliferating in research notes and market commentary, the Sentix \"risk appetite for equities\" has reached its highest since 2004, with no sign of reversing. Sentix said investors' willingness to take more risk can be seen through their investments in emerging markets, IPOs and cyclical and growth stocks. \"In the past, such a high risk appetite was often a harbinger of imminent corrections or even trend reversals\", Sentix warns. As Deutsche Bank's Jim Reid said in his morning report: \"it seems it would take more than a glass of water to halt the melt-up in equities at the moment\". (Julien Ponthus) NPL HOPES LIFT BANKS, PARTICULARLY IN ITALY (1431 GMT) That Italian banks are particularly sensitive to regulation on non-performing loans isn't new but today we had fresh evidence of that following a Reuters report that ECB supervisors are likely to postpone publishing new rules aimed at tackling the huge pile of unpaid loans weighing down euro zone banks. Italy holds nearly one third of the euro zone's 800 billion euro bad loan pile inherited from the financial crisis and last year their stocks were heavily hit by worries over stricter provisioning rules on the existing backlog of bad loans. The Reuters report did not touch on that issue but indications of a delay provided support, sending the Italian banking index up 1.1 percent at one point with Banco BPM and BPER - particularly exposed to a positive solution to the NPL issues - rallying more than 3 percent. \"The main question mark is still on the stock\" of NPL,\" said a trader at a Milan based brokerage. The NPL delay comes after fierce criticism from lawmakers and bankers who feared strict new rules would hurt the banking sector and its ability to finance the economy. (Danilo Masoni) KEEPING AN EYE ON GLOBAL GROWTH (1411 GMT) Schroders' global head of multi-asset investments Johanna Kyrklund said that while developed economies are in the \"expansion\" phase of the economic cycle, the next phase of the cycle, the \"slowdown\", is the worst phase for returns. \"A disappointment on the growth front would be more concerning for us,\" says Kyrklund. Kyrklund added that \"for now the traffic light is still green\" but they are still watching three factors: the process of liquidity tightening in China and the U.S.; yield curves flattening; the U.S. dollar (a stronger dollar could put pressure on Chinese growth and tighten liquidity). \"All in all, we continue to be positioned for a reflationary environment with an emphasis on emerging market assets which look relatively cheap,\" Kyrkland concludes, saying that the real surprise for 2018 could be ending the year with government bonds yields lower than they are today. Schroders' multi-asset team are positive on European equities, expecting growth to remain strong. (Kit Rees) UK, A SHORT SELLER’S PARADISE? (1215 GMT) UK investment manager Smith and Williamson says its 136-million-pound Enterprise Fund is running at 14 percent net exposure to equities, near the bottom of its historic range. \"Our net exposure is currently at this low level because there are so many shorting opportunities,” said co-manager Mark Swain Stretched UK equity valuations and an end to the Bank of England’s extraordinary support mean “asymmetric risk to the downside” in UK equities which creates fertile ground for funds that can go both long and short, he explained. Muted index volatility masks increasingly aggressive stock dispersions within sectors. The fund is currently short on housebuilders, where the managers were unimpressed by the impact of last year’s Budget and where some valuations now appear stretched versus history, especially on a price-to-book basis. They are also running a small net short in utilities, although generally the fund targets individual stocks rather than sectors, as they do not want the performance of the fund to be governed by large factor risks. (Tom Pfeiffer) ROTATION INTO FINANCIALS, MATERIALS MAKES A LOT OF SENSE (1149 GMT) That's what Rachel Winter, senior investment manager at Killik & Co, told us. Winter said that inflation, which is starting to come through in the U.S., could lead to interest rates rising more quickly than is implied by the market. \"If that happens, that will be very good for financials,\" Winter added. In terms of materials stocks, Winter said that they tend to do very well when inflation is rising and would also be supported by a weaker dollar. Today, those sectors are the best-performers in Europe. (Kit Rees) ARE ALL TECH STOCKS EXPENSIVE? (1119 GMT) Heavy losses among European chipmakers on fresh Apple worries have put tech back in focus, adding to expectations that after a stellar year the richly valued sector could have a less shiny 2018. Columbia Threadneedle portfolio manager David Dudding says over the last 12 months he has slightly cut his exposure to some technology names where valuations have looked pricey but still sees very good opportunities in the space. \"Some investors have been far too quick to dismiss whole categories of the market as expensive, ignoring the strong competitive advantages and positive long-term growth profiles of high-quality businesses within these sectors,\" he writes in a note, adding that some technology stocks such as Microsoft are by no means expensive and could even perform better this year. \"The key is to be as stock specific as possible, focusing on the fundamentals of individual names rather than sectors as a whole,\" he adds. (Danilo Masoni) \"JUST A SPEEDBUMP\" FOR AMS (1002 GMT) As we've mentioned, semiconductor stocks are down today following JPM's downgrade on AMS . But Deutsche Bank have a slightly different assessment, calling concerns over the iPhone X \"just a speedbump\". \"Despite these cuts to our H1-18 view, H2-18 consensus estimates for ams AG still look low considering that Apple looks committed to roll out three new models with FaceID in 2018, while a new iPad looks likely,\" Deutsche Bank analysts say in a note. They add that they still see 1.6 billion euros of revenue in 2018, and that recent weakness in AMS' share price \"offers up a strong entry point to a stock with 30% upside.\" DB is sticking with its \"buy\" rating on the stock. (Kit Rees) EUROPEAN OPEN: TECH AND UTILITIES HIT STOXX 600 (0832 GMT) European shares are trading slightly in the red in early trading with utilities leading fallers after a profit warning from Suez, itself down 15 percent. Tech stocks were also under pressure after JP Morgan cut its rating for Apple supplier AMS to neutral, pointing to iPhone X order weakness. A strong update from Novartis however lifted healthcare stocks, providing support to the broader market and helping the Swiss index SMI stand out as the only gainer among major European benchmarks. Among single stocks, Maersk was the second biggest gainer on the STOXX after Novartis. Maersk was supported by reports it is seeking a partner for its drilling unit , while a trader also cited an upgrade to buy at SEB Equities. (Danilo Masoni) WHAT YOU NEED TO KNOW BEFORE EUROPE OPENS (0746) European shares are seen opening flat to slightly lower ahead of the release of PMI data later today. Some strong corporate updates however could provide support, helping the regional STOXX 600 benchmark index stay close to its highest levels since August 2015. Futures were last trading between flat and a fall of 0.1 percent, reversing opening gains. The pharma sector, recently penalized by a rotation into cyclicals, could be on the watchlist after Swiss heavyweight Novartis posted better-than-expected core net income in the fourth quarter and forecast 2018 operating profit would grow faster than sales as revenue from drugs accelerates. The retail sector could find support after Dutch-Belgian supermarket Ahold Delhaize reported fourth-quarter sales growth at the high end of market expectations, while France's Carrefour saw upgrades from SocGen, Bernstein and HSBC. The overnight headlines: Novartis beats forecasts, sees new drugs fuelling 2018 growth Ahold Delhaize Q4 sales lifted by strong Dutch performance MEDIA-Maersk in talks with possible Norwegian partners for drilling unit UK pub firm JD Wetherspoon posts strong Christmas sales Italian local utilities approve six-way merger UK's Purplebricks taps into U.S. East Coast with New York launch Barry Callebaut expects chocolate recovery to continue Estate agent Countrywide CEO Alison Platt resigns Average UK motor insurance premiums paid in 2017 highest since 2012 Tesco poaches Ulster Bank CEO Mallon for its financial services arm -Sky News Anglo American expects to get licenses to expand in Brazil Wirecard rejects report on India business that hit stock Publicis says was the victim of anonymous detribalization attempt MEDIA-RBS to sell London headquarters - The Telegraph bit.ly/2E3CTy7 BMW and Daimler close to merging car-sharing units - executive BRIEF-Sage posts 6 pct Q1 revenue growth, in line with expectations BRIEF-Fresnillo Says Set To Increase Throughput And Silver Ore Grades (Danilo Masoni and Tom Pfeiffer) EUROPEAN STOCK FUTURES EDGE UP (0703 GMT) European shares are expected to open just marginally higher with stock index futures moving between flat and a gain of 0.1 percent. Some strong corporate updates including from drugmaker Novartis, which we mentioned in our previous post, and Dutch-Belgian supermarket Ahold Delhaize could provide support, while on the macro front PMI data will grab the attention ahead of tomorrow's European Central Bank meeting. And Talking about the ECB here is a graphic piece from Reuters with five questions for Mario Draghi. Here is your futures snapshot: (Danilo Masoni) PHARMA IN FOCUS AFTER NOVARTIS BEAT (0632 GMT) The healthcare sector could be one to watch this morning after Swiss-based heavyweight Novartis posted better than expected results. European healthcare stocks have underperformed the broader market so far this year as expectations of stronger economic growth caused a switch from defensives into cyclicals. The Swiss drugmaker forecast 2018 operating profit would grow faster than sales as revenue from drugs including its latest blockbuster Cosentyx accelerates and the company exits a period when patent losses dented results. Will Novartis figures help the sector catch up today? (Danilo Masoni)", "external_links": [], "published": "2018-01-24T19:02:00.000+02:00", "crawled": "2018-01-24T19:32:55.000+02:00", "highlightTitle": ""}