{"organizations": [], "uuid": "5d771d9b3ae69da8756d6de67f713566d433762b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-higher-treasury-yields-knock-emerging-markets-idUSL8N1P51G4", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Higher Treasury yields knock emerging markets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:16:00.000+02:00", "replies_count": 0, "uuid": "5d771d9b3ae69da8756d6de67f713566d433762b"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-higher-treasury-yields-knock-emerging-markets-idUSL8N1P51G4", "ord_in_thread": 0, "title": "EMERGING MARKETS-Higher Treasury yields knock emerging markets", "locations": [], "entities": {"persons": [{"name": "guillaume tresca", "sentiment": "none"}, {"name": "sujata rao", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "samsung electronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 10 (Reuters) - Rising global bond yields knocked emerging markets lower on Wednesday, with stocks down for the second straight day and local bond markets broadly following the lead of their developed peers.\nU.S. Treasury yields are at 10-month highs while German yields are the highest since end-October, causing some wobbles on world equity markets. MSCI’s emerging equity index slipped 0.4 percent, edging further off 6-1/2-year highs.\nLosses also stemmed from a 1.4 percent fall in emerging tech shares, led by a 3 percent slump in Samsung Electronics following disappointing earnings guidance. Chinese mainland shares were the exception, up for a ninth day running to hit seven-week highs.\n“We are positive on emerging markets but we were not expecting such a performance (since the start of 2018). So we would not be surprised to see some respite. We remain constructive but we could see a temporary pause in the short term,” said Guillaume Tresca, a strategist at Credit Agricole.\nEmerging European shares also fell, with Turkish stocks losing more than 1 percent while bond yields edged higher across the region. Polish 10-year yields hit two-week highs as investors waited to see what clues the central bank could provide on the interest rate trajectory.\nThe bank is seen leaving rates at 1.5 percent, but Romania recently became the second country in the region to raise rates, indicating that policy tightening momentum is building. Czech and Hungarian yields rose around 1-2 basis points.\nJPMorgan’s GBI-EM index of local debt showed yields closing near one-week highs on Thursday though dollar bonds shrugged off higher U.S. yields, with average premia over Treasuries hitting new 3-1/2-year lows.\nOn currency markets, Angola’s kwanza was devalued to around 185 per dollar and around 220 per euro in an auction on Tuesday. Analysts at Standard Chartered predicted a rate of 210 per dollar later this year, adding that acute hard currency shortages would persist.\nAlso unlike Egypt and Nigeria, which benefited from devaluations, StanChart said that “in the absence of more developed and open domestic capital markets, Angola’s change in FX policy will not be enough to attract FX inflows”.\nIn addition, they warned the country’s debt ratio of 67 percent of GDP “could rise further in 2018 as a result of a weaker exchange rate”.\nAngola’s dollar bond maturing 2025 slipped another 0.3 cent in price to a near-one week low.\nThe rand fell 0.6 percent to the dollar ahead of a meeting of South Africa’s ruling ANC party which could decide on whether to start proceedings to remove President Jacob Zuma.\nThe rand gained sharply in December after the election of businessman Cyril Ramaphosa as ANC head, and briefly firmed 1 percent on Tuesday on rumours of Zuma’s resignation.\nTresca said the market had likely over-reacted after Ramaphosa’s victory, noting the divisions between the ANC’s pro- and anti-Zuma factions.\n“So the room to manoeuvre will be limited for Ramaphosa and he has to deal with the fate of Zuma. It’s not a done deal at all. We would not be surprised to see some correction for the rand in the short term,” Tresca said.\nFor GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see) Emerging Markets Prices from Reuters Equities Latest Net Chg % Chg % Chg\non year\nMorgan Stanley Emrg Mkt Indx 1199.64 -5.50 -0.46 +3.56\nCzech Rep 1102.14 -2.34 -0.21 +2.22\nPoland 2512.81 -15.57 -0.62 +2.10\nHungary 39626.33 -243.23 -0.61 +0.63\nRomania 8026.15 -8.61 -0.11 +3.51\nGreece 836.36 -4.92 -0.58 +4.24\nRussia 1229.68 +0.53 +0.04 +6.52\nSouth Africa 53025.84 -158.52 -0.30 +0.94\nTurkey 13754.72 -1268.09 -1.10 -1.37\nChina 3422.14 +8.24 +0.24 +3.48\nIndia 34433.84 -9.35 -0.03 +1.11\nCurrencies Latest Prev Local Local\nclose currency currency\n% change % change\nin 2018\nCzech Rep 25.57 25.55 -0.07 -0.15\nPoland 4.18 4.19 +0.30 -0.01\nHungary 309.51 309.43 -0.03 +0.33\nRomania 4.64 4.64 +0.05 +0.77\nSerbia 118.56 118.62 +0.05 -0.13\nRussia 56.98 56.88 -0.19 +1.19\nKazakhstan 330.37 330.73 +0.11 +0.74\nUkraine 28.32 28.22 -0.37 -0.62\nSouth Africa 12.44 12.34 -0.80 -0.66\nKenya 103.05 103.10 +0.05 +0.05\nIsrael 3.44 3.44 +0.12 +1.19\nTurkey 3.78 3.77 -0.43 +0.18\nChina 6.51 6.53 +0.20 -0.10\nIndia 63.71 63.67 -0.07 +0.18\nBrazil 3.25 3.25 +0.00 +1.97\nMexico 19.28 19.23 -0.25 +1.90\nDebt Index Strip Spd Chg %Rtn Index\nSov‘gn Debt EMBIG 297 1 .07 8 08.37 1\nAll data taken from Reuters at 10:01 GMT. Currency percent change calculated from the daily U.S. close at 2130 GMT.\nAdditional reporting and graphic by Claire Milhench; Editing by Raissa Kasolowsky\n ", "external_links": [], "published": "2018-01-10T12:16:00.000+02:00", "crawled": "2018-01-10T12:32:42.021+02:00", "highlightTitle": ""}