{"organizations": [], "uuid": "61bdc9f02881e036579a90e925bda96d23dd2f2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924028-GettyImages-879925232.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/vancouver-meeting-focuses-on-sanctions-as-koreas-explore-detente.html", "country": "US", "domain_rank": 767, "title": "Vancouver meeting focuses on sanctions as Koreas explore detente", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.124, "site_type": "news", "published": "2018-01-16T10:17:00.000+02:00", "replies_count": 0, "uuid": "61bdc9f02881e036579a90e925bda96d23dd2f2b"}, "author": "Afp", "url": "https://www.cnbc.com/2018/01/16/vancouver-meeting-focuses-on-sanctions-as-koreas-explore-detente.html", "ord_in_thread": 0, "title": "Vancouver meeting focuses on sanctions as Koreas explore detente", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A meeting of states that backed South Korea in the Korean war will look at ways to better implement sanctions to push North Korea to abandon its nuclear weapons, officials said, even as the North and South explore detente ahead of next month's Winter Olympics.\nForeign ministers and senior officials from 20 nations will hold a full-day meeting in Vancouver on Tuesday, hosted by the United States and Canada, looking to increase diplomatic and financial pressure on North Korea to give up development of nuclear missiles capable of hitting the United States, a program that has raised fears of a new war.\nCanadian and U.S. officials say the meeting will discuss ways to ensure implementation of wide-ranging U.N. sanctions, including steps agreed last month to further limit Pyongyang's access to refined petroleum products, crude oil and industrial goods.\nBrian Hook, the U.S. State Department's director of policy planning, said last week that participants, including U.S. Secretary of State Rex Tillerson, would probe how to boost maritime security around North Korea and options to interdict ships carrying prohibited goods in violation of sanctions.\nThe Vancouver meeting primarily groups nations that assisted South Korea in the 1950-53 Korean War, as well as South Korea and Japan. China and Russia, which backed the North in the war but have since agreed to U.N. sanctions on Pyongyang, will not be attending.\nSouth Korea and the United States are technically still at war with the North because the 1950-53 Korean War ended with a truce, not a peace treaty.\nTensions easing? The meeting was announced after North Korea tested its biggest ever intercontinental ballistic missile in late November, but now comes amid signs that tensions on the Korean peninsula are easing, at least temporarily.\nNorth and South Korea held formal talks this month for the first time in two years and Pyongyang said it would send athletes across the border to the Pyeongchang Winter Olympics to be held in South Korea next month.\nChina, North Korea's main ally and principal trading partner, has backed successive rounds of U.N. sanctions, but has also urged dialogue to solve the crisis. It has reacted angrily to the Vancouver meeting as an example of \"Cold War\" thinking.\nChina's state media said Chinese President Xi Jinping, in a phone call with U.S. President Donald Trump, stressed that a hard-earned alleviation of tensions must continue.\n\"Maintaining international unity on the issue is extremely important,\" Xi said. China was ready to work with the United States to resolve the issue in an appropriate way, state broadcaster CCTV Quote: d the Chinese leader as saying.\nChina's special envoy for North Korea Kong Xuanyou, speaking in an interview with Phoenix Television on Monday, urged the United States to seize the opportunity to seek direct talks with North Korea.\nChina's state-run Global Times newspaper said the Vancouver meeting reflected Washington's desire to \"highlight its dominant role in resolving the North Korean nuclear issue and cripple the clout of China and Russia.\"\n\"But the meeting will likely accomplish little,\" it said in an editorial. Diplomats say China's absence will limit what can be achieved, while North Korean leader Kim Jong Un has shown no sign of being willing to bow to pressure to give up weapons he sees as vital to his survival.\nSanctions 'gaps' The White House on Friday welcomed news that China's North Korea imports plunged in December to their lowest in dollar terms since at least the start of 2014, but President Donald Trump accused Beijing last month of allowing oil into North Korea, a charge Beijing denied.\nWestern European security sources told Reuters last month that Russian tankers had supplied fuel to North Korea on at least three occasions in recent months by transferring cargoes at sea. Russia says it observes U.N. sanctions.\nEric Walsh, Canada's ambassador to South Korea, told a panel at the University of British Columbia that the uneven way sanctions were applied meant \"there are a lot of gaps.\" \"One of the things we want to do is look at how we can improve enforcement,\" he said.\nU.S. officials say hawks in the Trump administration remain pessimistic that the North-South contacts will lead anywhere. Even so, debate within the U.S. administration over whether to give more active consideration to military options, such as a pre-emptive strike on a North Korean nuclear or missile site, has lost momentum ahead of the Olympics, the officials said.\nScott Snyder, director of the U.S.-Korea policy program at Washington's Council on Foreign Relations, said that if Pyongyang felt tougher sanctions constituted a blockade, it might interpret them as an act of war.\n\"If sanctions are going to be effective in achieving the objective of bringing about diplomacy, (they) have to be used not as a hammer but actually as a nutcracker or a scalpel,\" he told the university panel.\nBritish Foreign Secretary Boris Johnson, who will be in Vancouver, said the international community had to stand united.\n\"Sanctions are biting but we need to maintain diplomatic pressure on Kim Jong Un's regime,\" he said in a statement.", "external_links": [], "published": "2018-01-16T10:17:00.000+02:00", "crawled": "2018-01-16T10:27:03.010+02:00", "highlightTitle": ""}