{"organizations": [], "uuid": "c4239cc1eb44e8868698719c3e25973b3c11a30b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104932952-GettyImages-902386128.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/oprah-three-billboards-triumph-at-black-draped-globes.html", "country": "US", "domain_rank": 767, "title": "Oprah, ‘Three Billboards’ triumph at black-draped Globes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.612, "site_type": "news", "published": "2018-01-08T09:12:00.000+02:00", "replies_count": 0, "uuid": "c4239cc1eb44e8868698719c3e25973b3c11a30b"}, "author": "Joe Scarnici", "url": "https://www.cnbc.com/2018/01/08/oprah-three-billboards-triumph-at-black-draped-globes.html", "ord_in_thread": 0, "title": "Oprah, ‘Three Billboards’ triumph at black-draped Globes", "locations": [], "entities": {"persons": [{"name": "oprah", "sentiment": "negative"}, {"name": "winfrey", "sentiment": "negative"}, {"name": "joe scarnici", "sentiment": "none"}, {"name": "post-harvey weinstein", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}], "locations": [{"name": "beverly hills", "sentiment": "none"}, {"name": "golden globes", "sentiment": "none"}, {"name": "beverly hilton hotel", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "globes science oprah", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With a red carpet dyed black by actresses dressed in a color-coordinated statement, the Golden Globes were transformed into an A-list expression of female empowerment in the post-Harvey Weinstein era. Oprah Winfrey led the charge.\n\"For too long women have not been heard or believed if they dared to speak their truth to the power of those men,\" said Winfrey, accepting the Cecil B. DeMille Award for lifetime achievement. \"But their time is up. Their time is up!\"\nMore than any award handed out Sunday at the Beverly Hilton Hotel in Beverly Hills, California, Winfrey's speech, which was greeted by a rousing, ongoing standing ovation, encapsulated the \"Me Too\" mood at an atypically powerful Golden Globes. The night — usually one reserved for more carefree partying — served as Hollywood's fullest response yet to the sexual harassment scandals that have roiled the film industry and laid bare its gender inequalities.\n\"A new day is on the horizon!\" promised Winfrey, who noted she was the first black woman to be given the honor.\nWith a cutting stare, presenter Natalie Portman followed Winfrey's speech by introducing, as she said, \"the all-male\" nominees for best director.\nThe movie that many believe speaks most directly to the current moment — \"Three Billboards Outside Ebbing, Missouri,\" about a mother avenging the rape and murder of her daughter — emerged as the night's top film. It won best picture, drama, best actress, drama, for Frances McDormand, best supporting actor for Sam Rockwell and best screenplay for writer-director Martin McDonagh.\nAccepting her award, McDormand granted she was befuddled at the identities of the Hollywood Foreign Press Association, but gave them credit. \"At least they managed to elect a female president,\" she said. She added that the evening indeed had a special feeling.\nTrae Patton | NBCU Photo Bank Oprah Winfrey, recipient of the Cecil B. DeMille Award, poses in the press room at the 75th Annual Golden Globe Awards held at the Beverly Hilton Hotel on January 7, 2018. \"Trust me, the women in this room tonight are not here for the food,\" said McDormand.\nHost Seth Meyers opened the night by diving straight into material about the sex scandals. \"Good evening ladies and remaining gentlemen,\" he began. In punchlines on Weinstein — \"the elephant not in the room\" — Kevin Spacey and Hollywood's deeper gender biases, Meyers scored laughs throughout the ballroom, and maybe a sense of release.\n\"For the male nominees in the room tonight, this is the first time in three months it won't be terrifying to hear your name read out loud,\" said Meyers.\nThe first award of the night, perhaps fittingly, went to one of Hollywood's most powerful women: Nicole Kidman, for her performance in HBO's \"The Big Little Lies,\" a series she and Reese Witherspoon also produced. Kidman chalked the win up to \"the power of women.\"\n\"Big Little Lies\" won a leading four awards, including best limited series and best supporting actress for Laura Dern. Like seven other female stars, Dern walked the red carpet with a women's rights activist as part of an effort to keep the Globes spotlight trained on sexual harassment. Dern was joined by farmworker advocate Monica Ramirez, Michelle Williams with \"Me Too\" founder Tarana Burke, and Meryl Streep with domestic worker advocate Ai-jen Poo.\n\"May we teach all of our children that speaking out without fear of retribution is our new North Star,\" said Dern, accepting her Globe.\nOther winners continued the theme. Amazon's recently debuted \"The Marvelous Mrs. Maisel,\" about a 1950s housewife who takes up stand-up comedy, won best TV series comedy, and best actress for Rachel Brosnahan. Elisabeth Moss, accepting an award for her performance in Hulu's \"The Handmaid's Tale,\" movingly dedicated her award to Margaret Atwood, whose book the show is based on. \"The Handmaid's Tale\" later added the award for best TV series, drama.\n\"We no longer live in the blank white spaces at the edge of print,\" said Moss, referencing Atwood's prose. \"We no longer live in the gaps between the stories. We are the stories in print and we are writing the stories ourselves.\"\nHollywood's awards season is seen as wide open. And though the Globes have little correlation with the Oscars, a handful of movies came away with big wins.\nGreta Gerwig's mother-daughter tale \"Lady Bird\" won best picture, comedy or musical, and best actress honors for Saoirse Ronan. Guillermo del Toro's Cold War-era fantasy \"The Shape of Water\" won for its score and del Toro's directing. The emotional Mexican-born filmmaker wiped back tears and managed to quiet the music that urged him off.\nNotably left empty-handed were Christopher Nolan's \"Dunkirk,\" Jordan Peele's horror sensation \"Get Out\" and Steven Spielberg's \"The Post,\" starring Tom Hanks and Meryl Streep. At the top of the show, Meyers alluded to Spielberg's film's awards-season bona fides, feigned to present an armful of Globes before the show even started.\nThe Globes had long been the stomping grounds of disgraced mogul Weinstein, whose downfall precipitated allegations against James Toback, Spacey and many others. Weinstein presided over two decades of Globes winners and was well-known for his savvy manipulation of the 89-member press association.\nThough it bills itself as Hollywood's biggest party, the Golden Globes struck a slightly more formal, Oscar-like tone, complete with moments of appreciation for movie legends. Kirk Douglas, 101, appearing with his daughter-in-law, Catherin Zeta-Jones, received a warm standing ovation.\nBest actor in a comedy or musical went to James Franco for his performance as the infamous \"The Room\" filmmaker Tommy Wiseau. Franco dragged his co-star and brother, Dave, to the stage and called up Wiseau. When the Wiseau, wearing his trademark sunglasses, got to the stage, he moved for the microphone before Franco turned him back. \"Whoa, whoa, whoa,\" said Franco as the audience chuckled.\nGary Oldman, considered by some to be the best actor front runner, won for his Winston Churchill in \"Darkest Hour,\" edging out newcomer Timothee Chalamet (\"Call Me By Your Name\") and Hanks.\nBest foreign language film went to Germany's \"In the Fade.\" Allison Janney took best supporting actress in a comedy for the Tonya Harding tale \"I, Tonya.\" Aziz Ansari took best actor in a comedy series for his Netflix show \"Master of None.\"\nBest animated film went to the Pixar release \"Coco.\" Pixar co-founder John Lasseter is taking a \"six-month sabbatical\" after acknowledging \"missteps\" in his workplace behavior. Backstage, \"Coco\" director Lee Unkrich was asked about changes at Pixar. \"We can all be better,\" he said. \"We have been taking steps and continue to move forward to create art.\"\nSunday night's black-clad demonstration was promoted by the recently formed Time's Up: an initiative of hundreds of women in the entertainment industry —including Streep, Williams, Dern and Winfrey — who have banded together to advocate for gender parity in executive ranks and provide legal defense aid for sexual harassment victims.\nAshley Judd, the first big name to", "external_links": [], "published": "2018-01-08T09:12:00.000+02:00", "crawled": "2018-01-08T09:22:38.004+02:00", "highlightTitle": ""}