{"organizations": [], "uuid": "2c08b3ed39fa0f789db8b7d31603de1248d7e9f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222896466&w=1200&r=LYNXMPEE0H05F", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-britain-economy-poll/boe-to-wait-and-see-growth-inflation-brexit-key-poll-idUSKBN1F708K", "country": "US", "domain_rank": 408, "title": "BoE to wait and see; growth, inflation, Brexit key: Poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:13:00.000+02:00", "replies_count": 0, "uuid": "2c08b3ed39fa0f789db8b7d31603de1248d7e9f9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-economy-poll/boe-to-wait-and-see-growth-inflation-brexit-key-poll-idUSKBN1F708K", "ord_in_thread": 0, "title": "BoE to wait and see; growth, inflation, Brexit key: Poll", "locations": [], "entities": {"persons": [{"name": "victoria clarke", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "investec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Above-target inflation and a buoyant jobs market won’t push the Bank of England to tighten policy until at least November as it waits to see how divorce talks with the EU develop, a Reuters poll found.\nBritain's decision to leave the European Union sent sterling GBP= plummeting - and inflation rising as the cost of imports increased - yet with the country due to leave the bloc in little more than a year, negotiations have made little progress.\nThat means there is a 20 percent chance of the country leaving without a deal, the median in the latest survey suggested, albeit down from December’s 25 percent forecast. That would be the worst outcome for the economy and for sterling, Reuters polls last year repeatedly showed.\n“Given the ongoing uncertainty over Brexit discussions, the BoE may wish to avoid making major judgment changes on inflation that guide markets to a markedly different rate path,” said Victoria Clarke at Investec.\n“The current environment lends itself well to a one-step-at-a-time approach for policymaking.”\nWith the BoE having added 25 basis points to Bank Rate in November, taking it to 0.50 percent, none of the 75 economists polled expect a move in the next policy announcement on Feb. 8, when the Bank is also due to publish growth and inflation forecasts.\nThe BoE had “ample time” before considering raising rates again, policymaker Silvana Tenreyo said on Monday, as it monitors the impact from its first hike in over a decade. She said she expected a couple more increases would be needed over the next three years.\nMedians from the poll appear to concur and say Bank Rate will next rise by 25 basis points in the final quarter of this year to 0.75 percent. However, that forecast was a close call with 34 of 71 expecting no change in 2018.\nThe following hike, also of 25 basis points, was predicted in the last months of 2019.\nDEFLATING INFLATION The recession predicted in the event of a leave vote never materialized and instead the economy has since then performed better than expected, with unemployment tumbling.\nEconomic growth likely averaged 1.6 percent last year, the poll found, much faster than the 1.2 percent growth rate predicted at the start of 2017 but lagging behind the euro zone, where the economy is expected to have grown faster.\nThis year, Britain’s GDP will increase 1.4 percent and by 1.5 percent in 2019 - again probably lagging behind the common currency bloc. Still, there was only a 15 percent chance of a British recession this year, the poll said, down from the 20 percent given in December.\nInflation, which the central bank wants at 2 percent but was 3.0 percent in December, will likely drop to average 2.5 percent this year and 2.2 percent next, medians showed.\n“It’s worth remembering the spike in inflation over 2017 was almost solely down to the pound’s post-Brexit plunge,” said James Smith at ING.\nSterling is down over 7 percent against the dollar since the June 2016 vote to leave the EU.\n(For other stories from the Reuters global long-term economic outlook polls package see)\nPolling by Hari Kishan and Vivek Mishra; editing by John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T10:13:00.000+02:00", "crawled": "2018-01-18T05:43:22.049+02:00", "highlightTitle": ""}