{"organizations": [], "uuid": "d0e970c35064a20f3e9f62ae65e8d5126f33e94e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-state-firms/update-1-china-to-further-cut-debt-ratios-at-big-state-owned-firms-as-profit-growth-surges-idUSL3N1PC1NT", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China to further cut debt ratios at big state-owned firms as profit growth surges", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:51:00.000+02:00", "replies_count": 0, "uuid": "d0e970c35064a20f3e9f62ae65e8d5126f33e94e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-state-firms/update-1-china-to-further-cut-debt-ratios-at-big-state-owned-firms-as-profit-growth-surges-idUSL3N1PC1NT", "ord_in_thread": 0, "title": "UPDATE 1-China to further cut debt ratios at big state-owned firms as profit growth surges", "locations": [], "entities": {"persons": [{"name": "shen ying", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "state-owned asset supervision and administration commission", "sentiment": "none"}, {"name": "ministry of finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds background)\nBEIJING, Jan 17 (Reuters) - China aims to further lower debt ratios of central government-owned firms after profit growth hit a five-year high in 2017, giving Beijing more leeway to push forward corporate deleveraging reforms.\nChina will cut the debt to asset ratio of central government-run enterprises’ by another 2 percentage points by the end of 2020, Shen Ying, a spokeswoman for the state asset regulator, told reporters in a briefing on Wednesday.\nThe debt to asset ratio of centrally-owned firms was at 66.3 percent at the end of 2017, down 0.4 percentage points from a year ago.\nThe figures provided by the State-Owned Asset Supervision and Administration Commission (SASAC) appear to be slightly lower than official data from the Ministry of Finance, which put the ratio at 68.1 percent by the end of November.\nFinance ministry data also showed the ratio at the end of November remained higher than the 67.6 percent in September 2015, when Beijing launched the current round of state enterprise reforms.\nChina moved to revamp its lumbering state sector in 2015 in order to tackle rising debt levels and make its SOEs more profitable and responsive to the market.\nIt has claimed strong progress in tackling industrial overcapacity, closing “zombie” firms and implementing a controversial scheme aimed at converting debt into equity.\nA total of 17 central government-administered firms signed 500 billion yuan ($77.77 billion) worth of debt-to-equity swaps in 2017, said Shen.\nCentrally-owned enterprises cut a total of 5.95 million tonnes of outdated steel capacity and 27.03 million tonnes of coal capacity in 2017, while the number of enterprises administered by the central government was reduced to 98, Hong added. The total number of firms has fallen from 117 in 2012.\nShen said China has “basically completed” capacity cuts in the steel sector, adding that China will push for a steel industry upgrade in the future.\nChina will also push for more coal sector consolidation in 2018, Shen said, after the country’s top coal miner Shenhua Group took over power generator China Guodian Group last year to create the world’s top utility worth $278 billion.\nTotal profit at enterprises owned by China’s central government rose 15.2 percent in 2017 to 1.4 trillion yuan, the regulator said, thanks to a reversal of fortune in traditional sectors such as petroleum, steel and coal. ($1 = 6.4290 yuan) (Reporting by Stella Qiu and David Stanway; Editing by Sam Holmes)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T12:51:00.000+02:00", "crawled": "2018-01-17T20:16:21.033+02:00", "highlightTitle": ""}