{"organizations": [], "uuid": "d196277bfaa9d25ea146579b96abba3dd0450e05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224940568&w=1200&r=LYNXMPEE0N27F", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-handball-europe/france-spain-and-sweden-reach-euro-semis-germany-out-idUKKBN1FD333", "country": "US", "domain_rank": 408, "title": "France, Spain and Sweden reach Euro semis, Germany out", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:52:00.000+02:00", "replies_count": 0, "uuid": "d196277bfaa9d25ea146579b96abba3dd0450e05"}, "author": "", "url": "https://uk.reuters.com/article/uk-handball-europe/france-spain-and-sweden-reach-euro-semis-germany-out-idUKKBN1FD333", "ord_in_thread": 0, "title": "France, Spain and Sweden reach Euro semis, Germany out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 9:56 PM / Updated 13 minutes ago France, Spain and Sweden reach Euro semis, Germany out Reuters Staff 2 Min Read \nZAGREB (Reuters) - World champions France, Spain and Sweden qualified for the European handball championship semi-finals as holders Germany and hosts Croatia were knocked out after dramatic final games in the tournament’s main round on Wednesday. \nThe French remained the only team in the 16-nation tournament with a 100 percent record after a 30-27 win over Croatia at a packed Zagreb Arena, silencing a passionate 15,000 home crowd. \nThe result also sent Sweden through from Group I despite their 28-25 defeat by Norway in the afternoon fixture. \nFrance finished top of the section with a maximum 10 points, while Sweden, Croatia and Norway have six each and the Swedes squeezed through with the best head-to-head record among the three by a single goal. \nFrance will meet Group II runners-up Spain in their semi-final while the section’s winners Denmark face Sweden in another Scandinavian derby likely to keep fans on the edge of their seats. Handball - Men's EHF European Handball Championship - main round Group II - Germany v Spain - Arena Varazdin, Varazdin, Croatia - January 24, 2018. Maximilian Janke of Germany in action. REUTERS/Antonio Bronic \nHaving seen Sweden slip up against Norway, Croatia needed only a draw to join France in the medal rounds but fell behind 20-13 early in the second half after making a bright start. \nRoared on by their faithful fans, the Croatians slashed the deficit to two goals in the closing stages but ran out of steam and time as France closed out the match thanks to six goals from Nedim Remili and five from Kentin Mahe. Slideshow (9 Images) \nGermany held their own against Spain in a balanced first half but could not keep up with the pace after the interval as Ferran Sole and Alex Dujshebaev netted five goals each for the winners. \nDenmark, who qualified on Tuesday without throwing a ball as other results went their way, made sure they finished top of their group with a 31-20 drubbing of Macedonia. \nThe semi-finals are on Friday and the final on Sunday. Writing by Zoran Milosavljevic in Belgrade,; Editing by Ed Osmond", "external_links": [], "published": "2018-01-24T23:52:00.000+02:00", "crawled": "2018-01-25T00:10:49.009+02:00", "highlightTitle": ""}