{"organizations": [], "uuid": "3c7a078a0c62b3cb6ee00ca4208bbf00f84d5896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-clarivate-analytics-completes-executive-leadership-team-with-appointment-of-new-president-for-life-sciences-division.html", "country": "US", "domain_rank": 767, "title": "Clarivate Analytics Completes Executive Leadership Team with Appointment of New President for Life Sciences Division", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:29:00.000+02:00", "replies_count": 0, "uuid": "3c7a078a0c62b3cb6ee00ca4208bbf00f84d5896"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-clarivate-analytics-completes-executive-leadership-team-with-appointment-of-new-president-for-life-sciences-division.html", "ord_in_thread": 0, "title": "Clarivate Analytics Completes Executive Leadership Team with Appointment of New President for Life Sciences Division", "locations": [], "entities": {"persons": [{"name": "mukhtar ahmed", "sentiment": "negative"}, {"name": "ahmed", "sentiment": "none"}, {"name": "jay nadler", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}, {"name": "bioclinica", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "clarivate analytics completes executive leadership team", "sentiment": "negative"}, {"name": "life sciences", "sentiment": "none"}, {"name": "clarivate analytics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, January 9, 2018 /PRNewswire/ --\nMukhtar Ahmed brings 25+ years' experience in pharmaceutical, technology and life sciences industries\nClarivate Analytics , the global leader in providing trusted insights and analytics to accelerate the pace of innovation and commercialize ideas, has announced the appointment of Mukhtar Ahmed to the position of President - Life Sciences. His arrival marks a full complement of executive level appointments for Clarivate Analytics since its formation in October 2016. Following significant hiring activity, Mukhtar Ahmed joins a host of new C-suite appointments of global leaders with domain expertise for each business unit and supporting executive functions.\nAhmed brings a wealth of leadership experience to the organization, having worked across biopharmaceutical, technology and life sciences industries. In this role, he will be responsible for the strategic leadership of the division. He will be based in London and will report to Clarivate Analytics CEO Jay Nadler in Philadelphia.\nHe joins Clarivate Analytics from Bioclinica, where he held the position of president of eHealth Solutions for more than two and a half years. In a career spanning 25 years within the healthcare industry, Ahmed has held senior executive posts at Oracle Corporation, Parexel and Kendle International, and board-level positions with the National Health Service (NHS) in the UK. Ahmed has also served as an industry advisor to a number of medical device, clinical laboratory, mobile health start-up and private equity companies. He is a member of the Royal Society of Medicine and chairs the Digital Health Committee for Life Sciences.\nMukhtar Ahmed, President - Life Sciences stated, \"I am very proud to be joining Clarivate Analytics as the new president of the Life Sciences division at this pivotal time in its growth. Innovation within the life sciences industry continues at an exciting pace and we need to be at the forefront embracing the opportunity to combine industry intelligence, transformative analytics and data to drive smarter approaches to the issues facing our customers. We have an unrivalled portfolio of assets, industry leading content and expertise across the biopharma innovation lifecycle. I look forward to working with the management team to guide the business forward in 2018, shaping the trends that are changing our industry.\"\nThe Life Sciences division of Clarivate includes the flagship brand, Cortellis - the world's most comprehensive suite of solutions for life science professionals, providing unmatched content, intelligent search, state of the art analytics and powerful visualization tools. Bringing together data with analytics across the innovation lifecycle, the breadth of content delivered by Clarivate via Cortellis is unrivalled, bringing together a huge range of data across the drug and device innovation lifecycle, to provide new insights to improve success rates and shorten time to market.\nClarivate Analytics is a newly independent, global company with 4000+ employees in more than 40 countries. It was formed from the sale of the IP & Science business of Thomson Reuters to Onex Corporation and Baring Private Equity Asia in October 2016.\nJay Nadler, CEO of Clarivate Analytics said, \"As we forge into the New Year and build on the momentum created by our growth, we are delighted to welcome Mukhtar to Clarivate Analytics. His appointment completes our executive leadership team and our new investment in the company will allow us to enhance the content, analytics, products and technology that we provide to our thousands of customers around the globe. Mukhtar's significant expertise across industries, particularly life sciences, as well as proven leadership experience, make him the ideal candidate to lead our Life Sciences team into the future and will enable the division to accelerate its strategic objectives and support the wider business.\"\nClarivate Analytics\nClarivate™ Analytics is the global leader in providing trusted insights and analytics to accelerate the pace of innovation. Building on a heritage going back more than a century and a half, we have built some of the most trusted brands across the innovation lifecycle, including the Web of Science™, Cortellis™, Derwent™, CompuMark™, MarkMonitor® and Techstreet™. Today, Clarivate Analytics is a new and independent company on a bold entrepreneurial mission, to help our clients radically reduce the time from new ideas to life-changing innovations. For more information, please visit clarivate.com .\nSOURCE Clarivate Analytics", "external_links": ["http://www.clarivate.com/", "https://clarivate.com/", "https://clarivate.com/about-us/executive-leadership/"], "published": "2018-01-09T19:29:00.000+02:00", "crawled": "2018-01-09T21:31:37.006+02:00", "highlightTitle": ""}