{"organizations": [], "uuid": "b2192d24768f5c1e930f4f6f28f8fd439e90a49f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-malaysia-court-conversion/malaysian-court-says-both-parents-must-consent-on-childrens-religion-idUSKBN1FI14U", "country": "US", "domain_rank": 408, "title": "Malaysian court says both parents must consent on children's religion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:54:00.000+02:00", "replies_count": 0, "uuid": "b2192d24768f5c1e930f4f6f28f8fd439e90a49f"}, "author": "", "url": "https://www.reuters.com/article/us-malaysia-court-conversion/malaysian-court-says-both-parents-must-consent-on-childrens-religion-idUSKBN1FI14U", "ord_in_thread": 0, "title": "Malaysian court says both parents must consent on children's religion", "locations": [], "entities": {"persons": [{"name": "indira gandhi", "sentiment": "none"}, {"name": "zainun ali", "sentiment": "none"}], "locations": [{"name": "malaysia", "sentiment": "none"}, {"name": "muslim-majority", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  kuala lumpur", "sentiment": "none"}, {"name": "federal court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 55 AM / in 6 minutes Malaysian court says both parents must consent on children's religion Reuters Staff 4 Min Read \nKUALA LUMPUR (Reuters) - A Malaysian court on Monday said the religion of a minor could only be decided with consent from both parents, a landmark ruling ending a near decade-old case that widened religious and racial divisions. \nThe judgment is seen as a victory for ethnic and religious minorities in the Muslim-majority nation who are pushing for greater recognition of their rights, amid what critics see as growing Islamic conservatism in its government. \nFive judges of Malaysia’s Federal Court said it was unconstitutional for just one parent to convert a minor to their religion. \n“Both parents have equal rights,” the Star Online news site quoted one of the judges, Zainun Ali, as saying. \n“The word ‘parent’ - is a case of being lost in translation,” she added, referring to a Malaysian constitutional provision. \nThe decision upholds a lower court ruling in favor of Indira Gandhi - who challenged the conversion of her three children by her Muslim-convert former husband in 2009. \nThe conversion of her three children was null and void, the judges added. \nUntil now, the unilateral conversion of minors by Muslim converts had left women with little recourse, as their complaints would be referred to a sharia religious court, where non-Muslims have no standing to make claims. \n“It’s a great victory for many, because finally these unilateral conversions will stop,” said Kulasegaran Murugeson, Indira’s lead lawyer. \nMuslims make up about 60 percent of a population of about 30 million, although Buddhists, Christians and Hindus account for a significant minority. \nThe ruling leaves police with the responsibility to locate and return Indira’s youngest daughter, taken away by her ex-husband, Muhammad Riduan Abdullah, in 2009, when she was 11 months old, Kulasegaran said. \nMuhammad Riduan has yet to return the child and is believed to have gone into hiding, despite a 2010 high court order that awarded Indira custody of all three children. \nHowever, police have not acted on that order until now, because of a conflict in the jurisdiction of civil and sharia courts. \n“The police must go aggressively (to retrieve the child),” \nKulasegaran said. “Locating Muhammad Riduan is not impossible, and any extra day that goes by will only add to the pain of Indira and her family.” \nThe police will now obey the court order to track down Muhammad Riduan and the girl, media quoted the inspector-general of police, Mohamad Fuzi Harun, as saying. \nThe verdict was a “huge victory for all Malaysians” and for women like Indira who have faced “grave violations” of their rights, said Malaysian rights group the Women’s Aid Organisation. \nThe opposition and civil society groups have criticized Prime Minister Najib Razak’s administration for taking a more conservative tack, such as backing a bill to widen sharia courts’ jurisdiction over Muslims in northern Kelantan state. \nThe government also faced criticism for dropping, as being unconstitutional, a family law change that would have brought cases of unilateral conversion within the purview of civil law. Reporting by Joseph Sipalan; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-29T12:54:00.000+02:00", "crawled": "2018-01-29T13:07:07.007+02:00", "highlightTitle": ""}