{"organizations": [], "uuid": "22755629307c30ca40c0693bd7457d000447492e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-mautic-inc-achieves-record-q4-results-with-3x-quarter-over-quarter-growth-in-sales.html", "country": "US", "domain_rank": 767, "title": "Mautic, Inc. Achieves Record Q4 Results with 3X Quarter-Over-Quarter Growth in Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "22755629307c30ca40c0693bd7457d000447492e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-mautic-inc-achieves-record-q4-results-with-3x-quarter-over-quarter-growth-in-sales.html", "ord_in_thread": 0, "title": "Mautic, Inc. Achieves Record Q4 Results with 3X Quarter-Over-Quarter Growth in Sales", "locations": [], "entities": {"persons": [{"name": "mautic", "sentiment": "none"}], "locations": [{"name": "sales boston", "sentiment": "none"}], "organizations": [{"name": "mautic, inc", "sentiment": "neutral"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 29, 2018 /PRNewswire/ -- Mautic , the world's only Open Marketing Cloud, today announced it has seen rapid adoption of the company's marketing automation cloud platform , evidenced by a 3X increase in quarter-over-quarter sales in its recently-completed fourth quarter. Additionally, the company added key members to its leadership team and Board of Directors, and launched a new management tool that enables companies to scale their marketing operations.\nAfter emerging in the marketing automation market in the spring of 2017, the company focused on learning from early customer engagements to build a strong foundation and grow its readiness to serve mid-market and enterprise organizations. Late in the year, Mautic began to proactively invest in its go-to-market efforts, which resulted in dramatic increases in new customer subscriptions, as well as the largest deals in the company's young history.\n\"2017 was an incredibly successful first year-in-market for Mautic. We built the team and technology to deliver world-class open marketing automation solutions – and the results from Q4 blew away our expectations,\" said Mautic CEO Matt Johnston. \"This momentum has us poised for a breakout 2018 with even sharper growth through continued product innovation, maniacal customer-centricity, and serving the Mautic open source community.\"\nCommercial Adoption\nThe company achieved strong customer growth with an 8X increase in the number of new Mautic Cloud customers versus earlier quarters. Customer growth was most rapid amongst mid-size and large B2B companies such as Airbus, uTest and Layer; as well as B2C brands like BBVA, The Broad and Earplay. Adoption of Mautic's platform surpassed a major milestone, with more than 200,000 organizations now utilizing the software.\nProduct Innovation\nThere were 20 new releases of the Mautic marketing automation platform in 2017, which included more than 200 new features and 1,000+ other smaller enhancements. These updates include new and deeper integrations with several top CRM solutions – including Salesforce, HubSpot, SugarCRM, Vtiger, Connectwise, Pipedrive and Microsoft Dynamics – as well as enabling customers to manage all marketing communications, including email, SMS messages, mobile alerts and social from a single unified platform. Mautic, Inc. launched Maestro as the industry's first solution that enables agencies and enterprises to manage multiple marketing automation accounts. The company also announced the upcoming beta of Maven , a marketing intelligence tool that will apply machine learning to help marketers optimize campaigns and content.\nAwards, Accolades and Milestones\nThe Mautic platform was voted 2017's ' Best Marketing Automation Suite ' from CMS Critic. The company doubled the number of employees globally, and grew the presence at its Boston-based headquarters by 4X to keep up with spiking customer demand. This included key management additions throughout the year: Sarah Wernik to lead Customer Success; Matt Gallo for Sales; and Justin Forte for Product Management. Mautic, Inc. added serial technology entrepreneur, Jit Saxena , to the company's Board of Directors. The company launched its partner program to expand reach in North America and Europe.\nVisit https://mautic.com/demo to see how Mautic enables marketers to automate and personalize their entire digital experience.\nAbout Mautic\nMautic, Inc. offers the world's only Open Marketing Cloud . This enables brands to integrate and personalize all their digital properties and channels into a seamless customer experience. With its modern approach to marketing automation, Mautic's suite of tools enables marketers to deliver higher performing campaigns and content, and achieve superior results.\nHeadquartered near Boston, MA, the company has employees, customers and a highly engaged open source community around the globe. More info at www.mautic.com .\nMedia Contacts:\nKatie Staveley\nVP of Marketing\n1.857.770.1306\nkatie.staveley@mautic.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/mautic-inc-achieves-record-q4-results-with-3x-quarter-over-quarter-growth-in-sales-300588913.html\nSOURCE Mautic", "external_links": ["https://mautic.com/", "https://mautic.com/about-us/newsroom/mautic-adds-former-netezza-ceo-jit-saxena-to-its-board-of-directors/", "http://www.mautic.com/products/maven-marketing-intelligence", "https://www.mautic.com/", "http://www.prnewswire.com/news-releases/mautic-inc-achieves-record-q4-results-with-3x-quarter-over-quarter-growth-in-sales-300588913.html", "https://mautic.com/resources/blog/mautic-best-marketing-automation-suite/", "http://www.mautic.com/products/maestro-marketing-management", "https://mautic.com/demo", "https://mautic.com/products/mautic-marketing-automation", "https://mautic.com/open-marketing/partners/"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:38:33.017+02:00", "highlightTitle": ""}