{"organizations": [], "uuid": "64e5e251d55f24f25c04368c87498f7159a36366", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-factors-jan-30/italy-factors-to-watch-on-jan-30-idUSL8N1PO4M4", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 30", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:02:00.000+02:00", "replies_count": 0, "uuid": "64e5e251d55f24f25c04368c87498f7159a36366"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-factors-jan-30/italy-factors-to-watch-on-jan-30-idUSL8N1PO4M4", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 30", "locations": [], "entities": {"persons": [{"name": "carlo calenda", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stafano cao", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european medicines authority", "sentiment": "none"}, {"name": "istat", "sentiment": "none"}, {"name": "saipem", "sentiment": "none"}, {"name": "ferrovie", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Tuesday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nPOLITICS The anti-establishment 5-Star Movement, which has ridden a wave of dissatisfaction with conventional politics to become Italy’s most popular party, is fighting accusations of incompetence and inexperience from its mainstream rivals ahead of the March 4 ballot.\nFlorence, “BHGE Annual Meeting” ends. Expected attendees include Italian Economic Development Minister Carlo Calenda, Saipem CEO Stafano Cao and other top managers from the oil sector.\nECONOMY Italy will ask European authorities to reconsider whether the European Medicines Authority (EMA) could be moved to Milan after Brexit, in light of concerns about its planned move to Amsterdam, an Italian government source said on Monday.\nISTAT releases December consumer and business confidence data (0900 GMT) and Q4 wage inflation data (1000 GMT).\nMilan, state railways Ferrovie dello Stato (FS) and Banca Etica sign agreement, with FS CEO Renato Mazzoncini, Banca Etica CEO Alessandro Messina and Chairman Ugo Biggeri (1030 GMT).\nDEBT Treasury offers 1.5-2.0 billion euros in CCTeu bonds due April 15, 2025; 4.0-4.5 billion euros in new 2.0 percent BTP bond due Feb. 1, 2028; 1.250-1.750 billion euros 0.90 percent BTP bonds due Aug. 1, 2022; 0.250-0.750 biliion euros 2,80 percent BTP bonds due March 1, 2067. Subscriptions close at 1000 GMT.\nCOMPANIES (*) BANKS A parliamentary commission looking into Italian banking scandals is expected to release a report on the investigation.\nAccording to various papers, the commission will make various proposals, including giving Bank of Italy the same investigative powers already attributed to the market regulator, creating a public bad bank for the management of soured loans and reforming criminal law to set up an overarching body to look into financial crimes.\nLUXOTTICA The world’s biggest eyewear maker, sees 2017 adjusted net income growing strongly after a robust fourth quarter helped it to meet its full-year sales guidance.\nSAFILO GROUP Board meeting on FY preliminary results (sales, also on Q4).\nHAL Holding has no intention at present of changing its shareholding in the Italian eyewear maker, in which it is the largest investor, a Safilo spokeswoman said on Monday in response to media reports.\n(*) FIAT CHRYSLER Fiat Chrysler Automobiles will provide Waymo with thousands of Pacifica hybrid minivans as Alphabet Inc’s self-driving unit begins rolling out its first public ride-hailing service later this year, the companies said on Tuesday.\nLEONARDO Board meeting to approve industrial plan, followed by analysts presentation (1330 GMT) and news conference (1630 GMT). (*) CEO Alessandro Profumo doesn’t see a risk of Leonardo becoming a takeover target because as a company strategic to national interests it is protected by the government’s golden power, the executive told Il Sole 24 Ore in an interview. He also said Leonardo’s new business plan was focused on significant organic growth, sustainable in the medium-to-long term, and that U.S. supplier DRS remained a key asset for the company. He added that the fiscal reforms in the U.S. would have no impact on its cash position, adding he saw a positive impact from now onwards. (*) In an interview with the FT, Profumo said “there are no more surprises” after the profit warning the company issued in November and that the industrial plan that will be presented on Tuesday “will not be a skyrocketing plan” but will rather show that the group can deliver, in an interview with the FT. Profumo added that a string of orders was likely to come amid negotiations with Qatar and Saudi Arabia and “potential talks” with Germany and Poland.\n(*) TELECOM ITALIA The phone group presented to the communications regulator AGCOM a proposal to put all its last-mile phone network assets in a separate vehicle fully-controlled by TIM, Il Messaggero said. The paper adds CEO Amos Genish would present this plan to Italy’s industry minister on Feb. 7.\n(*) FINCANTIERI The closing of Fincantieri’s acquisition of a 51 percent stake in STX France isexpected within days, Il Sole 24 Ore said.\nCNH INDUSTRIAL Board meeting on full year results, followed by conference call (1500 GMT).\nINTESA SANPAOLO The banking foundation Compagnia di San Paolo presents 2018 guidelines with President Francesco Profumo and Secretary General Piero Gastaldo in Turin (0900 GMT).\nCAMPARI GROUP CEO Bob Kunze-Concewitz attends photo call in occasion of ‘Campari Red Diaries’ short movie presentation in Milan (1845 GMT).\nEQUITA Equita holds closed-door “Italian PIR Bond Conference” in Milan.\nACQUAFIL Ordinary and extraordinary shareholders’ meeting (0930 GMT).\nDIGITAL MAGICS ‘Investor Day’, Tamburi Investment Partners Chiarman and CEO Giovanni Tamburi attends (1700 GMT).\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T13:02:00.000+02:00", "crawled": "2018-01-31T16:23:36.002+02:00", "highlightTitle": ""}