{"organizations": [], "uuid": "19771a7fc5799fd28754f4730db586e3c6ebffd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224518138&w=1200&r=LYNXMPEE0M1CF", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-afghanistan-airforce/a-10-ground-attack-aircraft-bolster-u-s-air-power-in-afghanistan-idUSKBN1FC26F", "country": "US", "domain_rank": 408, "title": "A-10 ground attack aircraft bolster U.S. air power in Afghanistan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:03:00.000+02:00", "replies_count": 0, "uuid": "19771a7fc5799fd28754f4730db586e3c6ebffd6"}, "author": "", "url": "https://www.reuters.com/article/us-afghanistan-airforce/a-10-ground-attack-aircraft-bolster-u-s-air-power-in-afghanistan-idUSKBN1FC26F", "ord_in_thread": 0, "title": "A-10 ground attack aircraft bolster U.S. air power in Afghanistan", "locations": [], "entities": {"persons": [{"name": "james hecker", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "james mackenzie", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "kandahar", "sentiment": "none"}, {"name": "kandahar", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "u.s. air force", "sentiment": "none"}, {"name": "taliban", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 4:03 PM / in 8 minutes A-10 ground attack aircraft bolster U.S. air power in Afghanistan James Mackenzie 3 Min Read \nKANDAHAR, Afghanistan (Reuters) - U.S. forces in Afghanistan are deploying a squadron of A-10 “Warthog” ground attack aircraft, the U.S. military said on Tuesday, intensifying an air campaign that saw attacks more than triple in 2017 over the previous year. \nThe number of U.S. air strikes in Afghanistan has spiked since President Donald Trump took office a year ago though the insurgents have hit back with deadly attacks, including a bloody Taliban raid on a Kabul hotel on the weekend. \nThe A-10 is returning to Afghanistan for the first time since 2012, with the squadron of 12 aircraft to operate from Kandahar air base in the south, the heartland of the militants fighting to oust the Western-backed government and drive out foreign forces. \nU.S. Air Force Major General James Hecker said the A-10s were returning to meet an increased need for close air support in a campaign targeting Taliban revenue sources including drug-producing facilities and in counter-terrorism operations. \nThe new aircraft had already conducted their first attacks, continuing a campaign that increased in intensity since Washington gave commanders greater authority to perform air strikes last year. \n“We’ve been taking the fight to the enemy for a while now,” Hecker said. “Here in 2017 alone, we’ve dropped more bombs than over the last two years. Over 4,000 bombs have been used against the Taliban, against ISIS etcetera,” he said. REAPER DRONES U.S. military personnel pass in front of a U.S. A-10 aircraft, one of a squadron that has arrived to step up the fight against the Taliban, at the Kandahar air base, Afghanistan January 23, 2018. REUTERS/Omar Sobhani \nHecker said the success of the campaign against Islamic State in Iraq and Syria meant the A-10s could be deployed to Afghanistan instead of Incirlik Air Base in Turkey, where they would otherwise have been based. \nIn addition, MQ-9 Reaper drones would be deployed as part of a major increase in intelligence, surveillance and reconnaissance (ISR) assets closer to levels seen at the height of the U.S. engagement in Afghanistan. \n“We’re going to increase our ISR capacity here by about one third. That will get us somewhat close to the levels that we’ve had in the past,” he said. Slideshow (2 Images) \nThe Taliban have made steady inroads since NATO ended its main combat operation in 2014 and are now estimated to control or contest at least 40 percent of the country. Afghan commanders have regularly pleaded for more air support. \nAfter a months-long review of his Afghanistan policy, Trump in August committed the United States to an open-ended conflict in the country and promised a stepped-up campaign against the Taliban insurgents. \nThe “number of weapons released” in U.S. air strikes in Afghanistan in 2017 was 4,361, according to U.S. Air Force data, compared with 1,337 the previous year. \nThe increase in air strikes has led to concerns over civilian casualties, particularly after the United Nations reported a spike in deaths caused by air strikes last year. \nHowever U.S. commanders say the precision weapons used by the air force have meant an overall decrease in the number of civilian casualties from combat operations as fewer people have been killed in ground fighting. Editing by Robert Birsel and William Maclean", "external_links": [], "published": "2018-01-23T18:03:00.000+02:00", "crawled": "2018-01-23T18:18:46.030+02:00", "highlightTitle": ""}