{"organizations": [], "uuid": "c7219f955199667b3b88669c28e840a2a34ef7b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-nigeria-security/nigerian-shiite-leader-rumoured-dead-makes-first-public-appearance-in-two-years-idUKKBN1F20QZ", "country": "US", "domain_rank": 408, "title": "Nigerian Shi'ite leader, rumoured dead, makes first public appearance in two years", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T19:47:00.000+02:00", "replies_count": 0, "uuid": "c7219f955199667b3b88669c28e840a2a34ef7b8"}, "author": "", "url": "https://uk.reuters.com/article/uk-nigeria-security/nigerian-shiite-leader-rumoured-dead-makes-first-public-appearance-in-two-years-idUKKBN1F20QZ", "ord_in_thread": 0, "title": "Nigerian Shi'ite leader, rumoured dead, makes first public appearance in two years", "locations": [], "entities": {"persons": [{"name": "ibrahim zakzaky", "sentiment": "none"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "zakzaky", "sentiment": "none"}], "locations": [{"name": "zaria", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "zakzaky", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "islamic movement of nigeria", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 5:51 PM / Updated 31 minutes ago Nigerian Shi'ite leader, rumoured dead, makes first public appearance in two years Reuters Staff 3 Min Read \nABUJA (Reuters) - The leader of Nigeria’s Shi‘ite Muslim sect, rumoured to have died in detention, made his first public appearance in two years on Saturday, after police arrested dozens of members of the group during protests calling for his release this week. \nSheikh Ibrahim Zakzaky, the leader of the Islamic Movement of Nigeria (IMN), has been imprisoned at an unknown location without charge since December 2015 after his followers clashed with the army in the northern city of Zaria. \nA judicial inquiry the following year said 347 IMN members were killed by the military and buried in mass graves. \nThe violent repression of IMN and detention of Zakzaky, despite a court ruling that he could not be held without charge and should be released, drew accusations of human rights abuses by President Muhammadu Buhari’s administration. \nIn a brief exchange in the capital Abuja, Zakzaky told reporters that authorities had allowed him to see his doctor for treatment of an unspecified condition. \n“For the first time at least the security (officers) have allowed me to see my own doctors,” he said, according to footage of the exchange. “I am getting better.” \nThis week, Nigerian social media had been awash with rumours that Zakzaky had died. From Monday to Wednesday, IMN members protested in the capital, with police arresting 52 people without specifying charges. \nIn 2016, Nigeria’s northern state of Kaduna declared IMN - a minority sect in the mainly Sunni Muslim north - unlawful on security grounds, angering its adherents as anyone convicted of being a member could be imprisoned for up to seven years. \nThe ban triggered a wave of attacks on IMN members, worsening sectarian rivalries in northern Nigeria, where the army is also fighting Boko Haram, Sunni Islamist militants who have killed tens of thousands and caused a humanitarian crisis. \nSecurity analysts have drawn parallels between the Shi‘ite group and Boko Haram, whose insurgency began in 2009 after security forces killed hundreds of its members and its leader Mohammed Yusuf died in custody. Zakzaky was badly wounded in the 2015 clashes. \nNigeria, with a population of 190 million, combines a predominantly Christian south and mainly Sunni Muslim north. Shi‘ites are estimated at less than 4 million, although there are no official figures. Human Rights Watch estimates that IMN has around 3 million members. \nIMN was founded in the 1980s after an Islamic revolution in mainly Shi‘ite Iran in 1979, which inspired the sect’s founders. Reporting by Paul Carsten; Additional reporting by Alexis Akwagyiram in Lagos; Editing by Ros Russell", "external_links": [], "published": "2018-01-13T19:47:00.000+02:00", "crawled": "2018-01-13T20:10:10.001+02:00", "highlightTitle": ""}