{"organizations": [], "uuid": "91c4ffb25db76515a03aa1308a63b34f90ce61d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-harvard-business-schools-hbs-kraft-precision-medicine-accelerator-taps-dr-gabriel-eichler-to-lead-data-analytics-workstream.html", "country": "US", "domain_rank": 767, "title": "Harvard Business School's (HBS) Kraft Precision Medicine Accelerator Taps Dr. Gabriel Eichler to Lead Data & Analytics Workstream", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.631, "site_type": "news", "published": "2018-01-23T19:00:00.000+02:00", "replies_count": 0, "uuid": "91c4ffb25db76515a03aa1308a63b34f90ce61d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-harvard-business-schools-hbs-kraft-precision-medicine-accelerator-taps-dr-gabriel-eichler-to-lead-data-analytics-workstream.html", "ord_in_thread": 0, "title": "Harvard Business School's (HBS) Kraft Precision Medicine Accelerator Taps Dr. Gabriel Eichler to Lead Data & Analytics Workstream", "locations": [], "entities": {"persons": [{"name": "gabriel eichler", "sentiment": "negative"}, {"name": "eichler", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "lead data & analytics workstream", "sentiment": "negative"}, {"name": "hbs", "sentiment": "negative"}, {"name": "oak health partners", "sentiment": "negative"}, {"name": "kraft precision medicine accelerator", "sentiment": "negative"}, {"name": "harvard bu", "sentiment": "negative"}, {"name": "harvard business school", "sentiment": "negative"}, {"name": "data & analytics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 23, 2018 /PRNewswire/ -- Dr. Gabriel Eichler, the Managing Director of Oak Health Partners, has joined the Harvard Business School (HBS) Kraft Precision Medicine Accelerator. Eichler will lead the Accelerator's Data & Analytics workstream, which focuses on finding ways to increase data access and analytics across institutions and pinpoint insights that could help speed progress in cancer research.\n\"I'm honored to join the Accelerator's team of the best and brightest leaders in business and medicine as we work toward a common goal of realizing the potential of precision medicine,\" said Dr. Eichler. \"Data is the key to answering critical questions in precision medicine, but data sets are traditionally siloed by separate institutions, restricting access and hampering progress. I look forward to working with the team to break down these barriers and leverage the power of data and analytics to drive cures.\"\nDr. Eichler has more than 15 years of experience applying healthcare technologies to problems in the pharmaceutical and biotech industry and the delivery of healthcare. He was formerly the VP of Products at GNS Healthcare, architecting and overseeing the company's major pharmaceutical and payer-oriented product offerings. Prior to that, Dr. Eichler managed several global client programs at PatientsLikeMe, focusing on patient-centered research and real-world outcomes.\n\"We are thrilled to have Dr. Eichler on board to lead the Data and Analytics Solutions Team,\" said Kathy Giusti, co-chair of the HBS Kraft Precision Medicine Accelerator. \"His in-depth knowledge and experience in connecting the dots in big data will be instrumental in helping us answer critical questions regarding new targets, potential biomarkers, and clinical pathways.\"\nThe Accelerator is led by co-chairs Kathy Giusti, the founder of the Multiple Myeloma Research Foundation and Richard Hamermesh, Harvard Business School Senior Fellow, and works by the principles of collective impact : since problems often arise from a complex combination of factors, they can be better solved by a systemic approach to increasing collaboration and coordination among all relevant stakeholders. The Accelerator advances cures by focusing on four integrated workstreams: Direct to Patient, Data Sharing and Analytics, Clinical Trials, and Innovative Investment Models.\nThe addition of Dr. Eichler follows two recent appointments to the Accelerator Solutions teams. In 2017, the Accelerator tapped Lori Marcus– who has held C-level marketing roles at Peloton, Keurig Green Mountain, The Children's Place, and PepsiCo – to chair the Direct to Patient workstream. Additionally, Dr. Dixie Esseltine, formerly of Takeda Pharmaceuticals, joined the Accelerator to lead the Clinical Trials workstream. Each Solutions team leader was hand-picked for their deep expertise and proven track record of getting things done and developing actionable steps to affect immediate change.\nAbout the Harvard Business School Kraft Precision Medicine Accelerator\nThe Harvard Business School Kraft Precision Medicine Accelerator was established in 2016 with a $20 million endowment from the Robert and Myra Kraft Family Foundation, Inc. to speed precision medicine. The Accelerator's mission is to develop an open-access business model for the entire cancer ecosystem to follow. Co-chairs Kathy Giusti, founder of the Multiple Myeloma Research Foundation, and Richard Hamermesh, Harvard Senior Fellow, lead a diverse team of healthcare and business visionaries. The Accelerator team works within Harvard Business School to leverage its unique resources and world-renowned faculty.\nMedia Contact:\nMultiple Myeloma Research Foundation\nAnne Quinn Young, 203-652-0212\nSenior Vice President of Marketing and Communications\nquinnyounga@themmrf.org\nView original content: http://www.prnewswire.com/news-releases/harvard-business-schools-hbs-kraft-precision-medicine-accelerator-taps-dr-gabriel-eichler-to-lead-data--analytics-workstream-300586728.html\nSOURCE Harvard Business School Kraft Precision Medicine Accelerator", "external_links": ["https://ssir.org/articles/entry/collective_impact", "https://hbr.org/2016/10/the-ecosystem-of-shared-value", "http://www.prnewswire.com/news-releases/harvard-business-schools-hbs-kraft-precision-medicine-accelerator-taps-dr-gabriel-eichler-to-lead-data--analytics-workstream-300586728.html"], "published": "2018-01-23T19:00:00.000+02:00", "crawled": "2018-01-23T20:20:47.001+02:00", "highlightTitle": ""}