{"organizations": [], "uuid": "20a42b166a4580d414633071e0d6544918152a95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974484-GettyImages-185501344.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/boston-fans-should-order-bacon-if-they-want-the-patriots-to-win-the-super-bowl.html", "country": "US", "domain_rank": 767, "title": "Boston fans should order bacon if they want the Patriots to win the Super Bowl", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-29T21:48:00.000+02:00", "replies_count": 0, "uuid": "20a42b166a4580d414633071e0d6544918152a95"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/29/boston-fans-should-order-bacon-if-they-want-the-patriots-to-win-the-super-bowl.html", "ord_in_thread": 0, "title": "Boston fans should order bacon if they want the Patriots to win the Super Bowl", "locations": [], "entities": {"persons": [{"name": "alfredo", "sentiment": "none"}, {"name": "grubhub", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "philly", "sentiment": "none"}], "organizations": [{"name": "eagles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Report Boston fans should order bacon if they want the Patriots to win the Super Bowl Grubhub determined what foods were ordered most in the Patriots' and Eagles' hometowns on days they won football games. Boston fans ordered more bacon and Philly fans ordered more Philly cheesesteak pizzas on days when their team won. Across the U.S., four out of the five most ordered foods during last year's Super Bowl were a variation of chicken wings. CNBC.com rez-art | Getty Images \nSports fans are known for their superstitious nature, so Grubhub did some digging to help Patriots and Eagles fans figure out what to eat during the big game on Sunday. \nThe online ordering database determined what dishes were ordered most in each team's hometown on days they were victorious. \nFor the Patriots, bacon was ordered in Boston 153 percent more on days the team won than on days they lost. Chicken noodle soup, beef teriyaki, beef fried rice and chicken broccoli Alfredo were also ordered at a high volume on winning game days. \nThe Patriots won 13 out of the 16 games they played during the 2017 season. \nFor the Eagles, Philly cheesesteak pizza was ordered in Philadelphia 185 percent more on days the team won versus the days they lost. \nBuffalo tenders, vegetable omelets, barbecue chicken, calamari salads and Hunan beef were also ordered more during winning game days, said Grubhub. \nThe Eagles won 13 out of the 16 games they played during the 2017 season. \nWhile Boston and Philadelphia ordered a variety of dishes during the football season last year, across the U.S. chicken wings are undoubtedly the top choice on Super Bowl Sunday. Four out of the five most ordered foods during last year's Super Bowl were a variation of wings. \nAmericans are expected to eat a record 1.35 billion wings during Super Bowl weekend , according to the National Chicken Council. This is 20 million more wings than were eaten last year. \nTotal spending on the Super Bowl is expected to rise 8.5 percent from a year ago to $15.3 billion, according to a National Retail Federation survey. The survey polled 7,277 consumers about their plans and was conducted from Jan. 3-10. \nDisclosure: NBC Sports is televising Sunday's Super Bowl. CNBC is a unit of NBCUniversal.", "external_links": [], "published": "2018-01-29T21:48:00.000+02:00", "crawled": "2018-01-29T21:48:39.128+02:00", "highlightTitle": ""}