{"organizations": [], "uuid": "62c2d5e88667f673c04407e42e5798b00fff9c34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923443-GettyImages-896246048.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/03/bonds-and-fixed-income-data-geopolitics-on-the-agenda-for-investors.html", "country": "US", "domain_rank": 767, "title": "Bonds and fixed income: Data, geopolitics on the agenda for investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-03T13:03:00.000+02:00", "replies_count": 0, "uuid": "62c2d5e88667f673c04407e42e5798b00fff9c34"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/03/bonds-and-fixed-income-data-geopolitics-on-the-agenda-for-investors.html", "ord_in_thread": 0, "title": "Bonds and fixed income: Data, geopolitics on the agenda for investors", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "federal open market committee", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "fomc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. government debt yields held lower Wednesday after the Federal Open Market Committee minutes revealed that Republican tax cuts pushed the Federal Reserve to raise its economic outlook.\nThe yield on the benchmark 10-year Treasury note traded lower at 2.451 percent at 2:31 p.m. ET, while the yield on the 30-year Treasury bond was down at 2.789 percent. Bond yields move inversely to prices.\nSymbol Yield Change %Change US 3-MO --- US 1-YR --- US 2-YR --- US 5-YR --- US 10-YR --- US 30-YR --- Central to trading Wednesday was the release of the FOMC minutes. The document showed that the central bank decided to adjust its economic outlook higher in light of the Republican effort to lower the corporate tax rate. Officials expect the tax relief to bump consumer and firm expenditure.\nCommittee members increased their expectations for 2018 GDP growth to 2.5 percent.\nLast month, the Federal Reserve raised interest rates by a quarter point and hiked its growth outlook for the U.S. economy. The FOMC is the Fed's monetary policymaking arm. The minutes largely reflected the central bank's belief in a stronger economy, improved industrial production and healthy employment.\n\"Obviously the Fed is a little puzzled why inflation hasn't picked up,\" said Charlie Ripley, senior investment strategist for Allianz Investment Management. \"They did talk about taking a look at alternative methods at looking at inflation ... It feels like the Fed is looking for reasons to raise rates.\"\nFor his part, Ripley believes the central bank is likely to raise rates two to three times in 2018 despite a current lack of inflation.\nOn the data front, yields briefly perked up after the Institute for Supply Management's (ISM) manufacturing index came in higher than expected for December. The index increased to 59.7, topping economist expectations of 58.2 according to a Reuters poll and marking the 103rd consecutive month of growth for the industry.\nA reading above 50 for the index indicates expansion in the service sector.\nOn Tuesday, the first trading day of 2018, U.S. markets finished trade higher with the Dow Jones Industrial Average closing up above 100 points.\nU.S. government debt yields started the year higher on Tuesday.\nGeopolitics continues to shake up global markets. On Tuesday evening, President Donald Trump tweeted that that his \"nuclear button\" was \" much bigger and more powerful \" than the one controlled by North Korea's leader Kim Jong-un.\nThe U.S. incumbent's tweet comes after a New Year's Day address from Jong-un, who said that the isolated state's nuclear weapons could reach anywhere in the U.S.\nDespite the rising geopolitical tensions, indexes in Asia and Europe traded higher on Wednesday. U.S. futures also traded higher.", "external_links": ["https://www.nbcnews.com/nightly-news/video/kim-jong-un-entire-u-s-is-within-range-of-north-korea-s-nuclear-weapons-1127330371663"], "published": "2018-01-03T13:03:00.000+02:00", "crawled": "2018-01-03T13:48:43.004+02:00", "highlightTitle": ""}