{"organizations": [], "uuid": "fff594b1a9dd14659d1a6aeb96263588b95f2769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-l3-announces-fourth-quarter-2017-and-full-year-results.html", "country": "US", "domain_rank": 767, "title": "L3 Announces Fourth Quarter 2017 and Full Year Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-25T14:55:00.000+02:00", "replies_count": 0, "uuid": "fff594b1a9dd14659d1a6aeb96263588b95f2769"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-l3-announces-fourth-quarter-2017-and-full-year-results.html", "ord_in_thread": 0, "title": "L3 Announces Fourth Quarter 2017 and Full Year Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "vertex aerospace", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4Q Sales decreased 3% to $2,574 million; 2017 sales increased 4% to $9,573 million 4Q Diluted EPS from continuing operations of $3.34; 2017 diluted EPS from continuing operations of $9.46 4Q and 2017 includes $0.99 of tax benefits for U.S. Tax Reform 4Q Cash from continuing operations of $406 million; 2017 cash from continuing operations of $986 million 4Q Book-to-bill ratio of 1.06x on funded orders of $2.7 billion; 2017 book-to-bill ratio of 1.04x on funded orders of $10.0 billion Vertex Aerospace business held for sale (presented as discontinued operations) Increased 2018 financial guidance\nNEW YORK--(BUSINESS WIRE)-- L3 Technologies, Inc. (NYSE: LLL) today reported diluted earnings per share (EPS) from continuing operations of $3.34 for the quarter ended December 31, 2017 (2017 fourth quarter) compared to diluted EPS from continuing operations for the quarter ended December 31, 2016 (2016 fourth quarter) of $2.32. The 2017 fourth quarter results included an estimated tax benefit of $79 million, or $0.99 per diluted share, related to the enactment of the U.S. Tax Cuts and Jobs Act (U.S. Tax Reform) in December 2017. Net sales of $2,574 million for the 2017 fourth quarter decreased by 3% compared to the 2016 fourth quarter. The prior period results have been adjusted to present the Vertex Aerospace business as discontinued operations.\n“We had solid performance in 2017, with increases in every key performance metric, including sales, operating income and free cash flow,” said Christopher E. Kubasik, L3’s Chief Executive Officer and President. “As we continue to execute our strategy, we will enhance our profitability by integrating businesses to increase efficiencies and investing in emerging technologies. Looking ahead, our agility, commitment to excellence and customer-centric focus will position L3 for continued growth.”\nL3 Consolidated Results\nThe table below provides L3’s selected financial data.\n(in millions, except per share data) Fourth Quarter Ended Increase/ Year Ended Dec. 31, Increase/ 2017 2016 (decrease)\n2017 2016 (decrease) Net sales $ 2,574 $ 2,643 (3) % $ 9,573 $ 9,210 4 % Operating income $ 263 $ 282 (7) % $ 1,020 $ 957 7 % Operating margin 10.2 % 10.7 % (50) bpts 10.7 % 10.4 % 30 bpts Interest expense and other $ (37) $ (41) (10) % $ (149) $ (153) (3) % Effective income tax rate (19.9) % 22.4 % nm 11.7 % 21.3 % (960) bpts Net income from continuing operations attributable to L3 $ 267 $ 183 46 % $ 753 $ 619 22 % Diluted earnings per share from continuing operations $ 3.34 $ 2.32 44 % $ 9.46 $ 7.86 20 % Diluted weighted average common shares outstanding 79.9 78.9 1 % 79.6 78.8 1 % Net cash from operating activities from continuing operations $ 406 $ 490 (17) % $ 986 $ 1,022 (4) % Less: Capital expenditures, net of dispositions (a) (66) (82) (20) % (150) (189) (21) % Plus: Income tax payments attributable to discontinued operations 7 - nm 27 1 nm Free cash flow (b)(c) $ 347 $ 408 (15) % $ 863 $ 834 3 %\n(a) Results for the year ended December 31, 2017 include $64 million of cash proceeds related to the sale of the company's property in San Carlos, California.\n(b) Free cash flow is defined as net cash from operating activities from continuing operations, less net capital expenditures (capital expenditures less cash proceeds\nfrom dispositions of property, plant and equipment), plus income tax payments attributable to discontinued operations. The company believes free cash flow is a\nuseful measure for investors because it portrays the company's ability to generate cash from operations for purposes such as repaying debt, returning cash to\nshareholders and funding acquisitions. The company also uses free cash flow as a performance measure in evaluating management.\n(c) Excludes free cash flow from discontinued operations.\nnm = not meaningful\nFourth Quarter Results of Operations: For the 2017 fourth quarter, consolidated net sales of $2,574 million decreased $69 million, or 3%, compared to the 2016 fourth quarter. Organic sales (1) decreased by $95 million, or 4%, to $2,532 million for the 2017 fourth quarter. Organic sales exclude $42 million of sales increases related to business acquisitions and $16 million of sales declines related to business divestitures. For the 2017 fourth quarter, organic sales to the U.S. Government increased $7 million, or less than 1% to $1,787 million, and organic sales to international and commercial customers decreased $102 million, or 12%, to $745 million.\nDue to the calendarization of the Company’s fiscal quarter end dates, the 2017 fourth quarter had 7% less business days compared to the 2016 fourth quarter.\nOperating income for the 2017 fourth quarter decreased by $19 million, or 7%, compared to the 2016 fourth quarter. Operating income as a percentage of sales (operating margin) decreased by 50 basis points to 10.2% for the 2017 fourth quarter, compared to 10.7% for the 2016 fourth quarter. Operating margin decreased by 150 basis points due to severance and restructuring costs of $39 million, including a $12 million non-cash loss on the sale of a building in Sensor Systems and a $4 million pension curtailment charge in connection with the decision to discontinue future service accruals for substantially all salaried employee defined benefit plans effective January 1, 2019 (Pension Curtailment). These decreases were partially offset by 100 basis points primarily due to improved contract performance for the Electronic Systems,\nAerospace Systems and Communication Systems segments. See the reportable segment results for additional discussion of sales and operating margin trends.\nThe effective tax rate for the 2017 fourth quarter was a benefit of 19.9% compared to a provision of 22.4% for the 2016 fourth quarter. The decrease was driven by: (1) $79 million of estimated tax benefits related to U.S. Tax Reform and (2) $30 million of tax benefits from a realignment of foreign legal entities to conform with the reporting structure (Legal Realignment). These increases were partially offset by lower tax benefits related to domestic production activities deductions and the U.S. Federal research and experimentation tax credits.\nFull Year Results of Operations: For the year ended December 31, 2017, consolidated net sales of $9,573 million increased $363 million, or 4%, compared to the year ended December 31, 2016. Organic sales increased by $213 million, or 2%, to $9,369 million for the year ended December 31, 2017. Organic sales exclude $204 million of sales increases related to business acquisitions and $54 million of sales declines related to business divestitures. For the year ended December 31, 2017, organic sales to the U.S. Government increased $288 million, or 5%, to $6,642 million, and organic sales to international and commercial customers decreased $75 million, or 3%, to $2,727 million.\nOperating income for the year ended December 31, 2017 increased by $63 million, or 7%, compared to the year ended December 31, 2016. Operating margin increased by 30 basis points to 10.7% for the year ended December 31, 2017, compared to 10.4% for the year ended December 31, 2016. The increase in operating margin was driven by: (1) 60 basis points primarily due to improved contract performance for Electronic Systems, Communication Systems and Sensor Systems and (2) 30 basis points at Sensor Systems for a settlement of the class action litigation and product return allowances recorded in 2016 that did not recur. These increases were partially offset by 60 basis points due to severance and restructuring costs of $59 million, including a $12 million non-cash loss on the sale of a building in Sensor Systems and the Pension Curtailment. See the reportable segment results for additional discussion of sales and operating margin trends.\nThe effective tax rate for the year ended December 31, 2017 decreased to 11.7% from 21.3% for the year ended December 31, 2016. The decrease was driven by: (1) $79 million of estimated tax benefits related to U.S. Tax Reform and (2) $30 million of tax benefits from the Legal Realignment. These increases were partially offset by $21 million for the reversal of previously accrued amounts related to various U.S. Federal, foreign and state tax matters in 2016 that did not recur.\nDiluted EPS from continuing operations increased 20% to $9.46 for the year ended December 31, 2017, compared to $7.86 for the year ended December 31, 2016. Diluted EPS for 2017 included $0.99 of estimated tax benefits related to U.S. Tax Reform. Diluted weighted average common shares outstanding for the year ended December 31, 2017 increased 1% compared to the year ended December 31, 2016 due to changes in the dilutive impact of common share equivalents, primarily caused by a higher L3 stock price.\nOrders: Funded orders for the 2017 fourth quarter decreased 10% to $2,734 million compared to $3,043 million for the 2016 fourth quarter. Funded orders for the year ended December 31, 2017 increased 5% to $9,996 million compared to $9,520 million for the year ended December 31, 2016. The book-to-bill ratio was 1.06x for the 2017 fourth quarter and 1.04x for the year ended December 31, 2017. Funded backlog increased 6% to $8,879 million at December 31, 2017 compared to $8,380 million at December 31, 2016.\nCash Flow: Net cash from operating activities from continuing operations was $986 million for the year ended December 31, 2017, a decrease of $36 million, compared to $1,022 million for the year ended December 31, 2016. Capital expenditures, net of dispositions, were $150 million for the year ended December 31, 2017, including proceeds of $64 million from the sale of the company’s property in San Carlos, California, and decreased $39 million compared to the year ended December 31, 2016. The company paid dividends of $236 million during the year ended December 31, 2017 compared to $220 million during the year ended December 31, 2016. Repurchases of the company’s common stock were $180 million during the year ended December 31, 2017, compared to $373 million during the year ended December 31, 2016.\nReportable Segment Results\nThe company has four reportable segments. The company evaluates the performance of its segments based on their sales, operating income and operating margin. Corporate expenses are allocated to the company’s operating segments using an allocation methodology prescribed by U.S. Government regulations for government contractors. Accordingly, segment results include all costs and expenses, except for goodwill impairment charges and certain other items that are excluded by management for purposes of evaluating the performance of the company’s business segments.\nElectronic Systems\nFourth Quarter Ended Increase/ Year Ended Dec. 31, ($ in millions) 2017 2016 (decrease) 2017\n2016 Increase Net sales $ 803 $ 861 (7) % $ 3,024 $ 2,753 10 % Operating income $ 110 $ 109 1 % $ 403 $ 360 12 % Operating margin 13.7 % 12.7 % 100 bpts 13.3 % 13.1 % 20 bpts Fourth Quarter: Electronic Systems net sales for the 2017 fourth quarter decreased by $58 million, or 7%, compared to the 2016 fourth quarter. Organic sales decreased by $75 million, or 9%, compared to the 2016 fourth quarter. Organic sales exclude $33 million of sales increases related to business acquisitions and $16 million of sales declines related to business divestitures. Organic sales decreased by: (1) $38 million for Security & Detection due to fewer deliveries for airport screening devices to the U.S. Transportation Security Administration (TSA) and foreign customers, (2) $30 million due to lower deliveries of aviation products to the U.S. military and commercial customers and (3) $7 million primarily for Power & Propulsion due to lower volume for the U.S. Navy (USN) Ship-to-Shore Connector.\nElectronic Systems operating income for the 2017 fourth quarter increased by $1 million, or 1%, compared to the 2016 fourth quarter. Operating margin increased by 100 basis points to 13.7%. Operating margin increased by: (1) 90 basis points primarily due to reserves for excess and obsolete inventory at Security & Detection recorded in the 2016 fourth quarter that did not recur, (2) 30 basis points primarily due to improved contract performance primarily Power & Propulsion and (3) 20 basis points due to sales mix changes. These increases were partially offset by 30 basis points due to severance costs of $3 million and 10 basis points due to a higher pension expense related to the Pension Curtailment.\nFull Year: Electronic Systems net sales for the year ended December 31, 2017 increased by $271 million, or 10%, compared to the year ended December 31, 2016. Organic sales increased by $147 million, or 5%, compared to the year ended December 31, 2016. Organic sales exclude $178 million of sales increases related to business acquisitions and $54 million of sales declines related to business divestitures. Organic sales increased by: (1) $135 million for Total Training Solutions primarily due to higher volume on commercial flight simulators and training systems for the U.S. Air Force (USAF), (2) $80 million for Precision Engagement Systems primarily due to increased deliveries of fuzing and ordnance products and higher volume for guidance and control products to the U.S. Army and USAF and (3) $30 million for Power & Propulsion primarily due to higher volume for USN power conversion and distribution systems. These increases were partially offset by $98 million primarily for Security & Detection due to fewer deliveries for airport screening devices to the TSA and foreign customers and fewer deliveries of cargo screening devices to foreign customers.\nElectronic Systems operating income for the year ended December 31, 2017 increased by $43 million, or 12%, compared to the year ended December 31, 2016. Operating margin increased by 20 basis points to 13.3%. Higher sales volume and mix changes, primarily for Total Training Solutions and Power & Propulsion, increased operating margin by 110 basis points. These increases were partially offset by 40 basis points primarily due to lower margins related to acquisitions and 50 basis points due to higher severance costs of $13 million.\nAerospace Systems\nFourth Quarter Ended Increase/ Year Ended Dec. 31, ($ in millions) 2017 2016 (decrease) 2017\n2016 Decrease Net sales $ 727 $ 728 (0) % $ 2,773 $ 2,936 (6) % Operating income $ 58 $ 50 16 % $ 210 $ 255 (18) % Operating margin 8.0 % 6.9 % 110 bpts 7.6 % 8.7 % (110) bpts Fourth Quarter: Aerospace Systems net sales for the 2017 fourth quarter decreased by $1 million compared to the 2016 fourth quarter. Lower volume for large ISR aircraft systems for foreign military customers as contracts near completion was mostly offset by higher sales due to the procurement and delivery of one USAF Compass Call Recap aircraft to begin missionization.\nAerospace Systems operating income for the 2017 fourth quarter increased by $8 million, or 16%, compared to the 2016 fourth quarter. Operating margin increased by 110 basis points to 8.0%. Operating margin increased by: (1) 120 basis points due to improved contract performance primarily at Mission Integration and (2) 50 basis points primarily due to sales mix changes. These increases were partially offset by 50 basis points due to severance and restructuring costs of $4 million and 10 basis points due to higher pension expense related to the Pension Curtailment.\nFull Year: Aerospace Systems net sales for the year ended December 31, 2017 decreased by $163 million, or 6%, compared to the year ended December 31, 2016. Sales decreased by: (1) $71 million due to lower volume for large ISR aircraft systems for foreign military customers as contracts near completion, (2) $67 million due to lower volume for international aircraft modifications, primarily international head-of-state aircraft and Australian Defence Force C-27J aircraft, (3) $58 million due to the procurement and delivery of two aircraft to a foreign military customer in the 2016 second quarter compared to one for the USAF Compass Call Recap in the 2017 fourth quarter and (4) $46 million due to reduced deliveries for UH-1Y aircraft cabin assemblies. These decreases were partially offset by $79 million primarily due to higher volume for ISR systems to the U.S. Government.\nAerospace Systems operating income for the year ended December 31, 2017 decreased by $45 million, or 18%, compared to the year ended December 31, 2016. Operating margin decreased by 110 basis points to 7.6%. Operating margin decreased by: (1) 70 basis points due to severance and restructuring costs of $21 million, (2) 30 basis points primarily due to unfavorable contract performance adjustments on international aircraft modification contracts at Mission Integration and (3) 10 basis points primarily due to the Pension Curtailment.\nCommunication Systems\nFourth Quarter Ended Increase/ Year Ended Dec. 31, ($ in millions) 2017 2016 (decrease) 2017 2016 Increase Net sales $ 602 $ 583 3 % $ 2,229 $ 2,053 9 % Operating income $ 47 $ 56 (16) % $ 212 $ 195 9 % Operating margin 7.8 % 9.6 % (180) bpts 9.5 % 9.5 % - bpts Fourth Quarter: Communication Systems net sales for the 2017 fourth quarter increased by $19 million, or 3%, compared to the 2016 fourth quarter, primarily driven by Broadband Communication Systems due to increased deliveries of secure networked communication systems primarily for the U.S. Department of Defense (DoD).\nCommunication Systems operating income for the 2017 fourth quarter decreased by $9 million, or 16%, compared to the 2016 fourth quarter. Operating margin decreased by 180 basis points to 7.8%. Severance and restructuring costs of $15 million primarily related to the Traveling Wave Tube (TWT) businesses consolidation decreased operating margin by 250 basis points partially offset by 70 basis points due to improved contract performance at Broadband Communication Systems.\nFull Year: Communication Systems net sales for the year ended December 31, 2017 increased by $176 million, or 9%, compared to the year ended December 31, 2016. This increase was primarily driven by Broadband Communication Systems due to increased deliveries of secure networked communication systems primarily for the U.S. DoD.\nCommunication Systems operating income for the year ended December 31, 2017 increased by $17 million, or 9%, compared to the year ended December 31, 2016. Operating margin remained the same at 9.5%. Improved contract performance, primarily at Broadband Communication Systems, increased operating margin by 160 basis points. These increases were partially offset by 130 basis points due to mix changes primarily for Space & Power Systems. Consolidation activities primarily related to the TWT businesses reduced operating margin by 30 basis points consisting of severance and restructuring costs of $48 million partially offset by a pre-tax gain of $42 million on the sale of the company’s property in San Carlos, California in the second quarter of 2017.\nSensor Systems\nFourth Quarter Ended Year Ended Dec. 31, ($ in millions) 2017 2016 Decrease 2017 2016 Increase Net sales $ 442 $ 471 (6) % $ 1,547 $ 1,468 5 % Operating income $ 48 $ 67 (28) % $ 195 $ 147 33 % Operating margin 10.9 % 14.2 % (330) bpts 12.6 % 10.0 % 260 bpts Fourth Quarter: Sensor Systems net sales for the 2017 fourth quarter decreased by $29 million, or 6%, compared to the 2016 fourth quarter. Organic sales decreased by $38 million, or 8%, compared to the 2016 fourth quarter. Organic sales exclude $9 million of sales increases related to business acquisitions. Organic sales decreased by $44 million due to fewer deliveries of enhanced night vision goggle products to the U.S. Army as contracts near completion, partially offset by increased deliveries of airborne turret systems and electronic warfare countermeasures products primarily to foreign militaries.\nSensor Systems operating income for the 2017 fourth quarter decreased by $19 million, or 28%, compared to the 2016 fourth quarter. Operating margin decreased by 330 basis points to 10.9%. Operating margin decreased by: (1) 270 basis points due to a $12 million non-cash loss on the sale of a building in anticipation of consolidating two focal plane array foundries during 2018 and 2019, (2) 100 basis points primarily due to lower sales volume and (3) 20 basis points due to severance costs of $1 million. These increases were partially offset by lower product return allowances recorded at EoTech, which increased operating margin by 60 basis points.\nFull Year: Sensor Systems net sales for the year ended December 31, 2017 increased by $79 million, or 5%, compared to the year ended December 31, 2016. Organic sales increased by $53 million, or 4%, compared to the year ended December 31, 2016. Organic sales exclude $26 million of sales increases related to business acquisitions. Organic sales increased primarily due to increased task order volume on U.S. Government contracts, higher volume for space electronics products and increased deliveries of airborne turret systems to the USAF. These increases were partially offset by fewer deliveries of enhanced night vision goggle products to the U.S. Army as contracts near completion.\nSensor Systems operating income for the year ended December 31, 2017 increased by $48 million, or 33%, compared to the year ended December 31, 2016. Operating margin increased by 260 basis points to 12.6%. Operating margin increased by: (1) 180 basis points for a settlement of the class action litigation and product return allowances recorded in 2016 that did not recur at EoTech, (2) 120 basis points primarily for improved contract performance at Maritime Sensor Systems, (3) 30 basis points due to reserves for excess and obsolete inventory recorded in 2016 that did not recur and (4) 20 basis points primarily due to higher sales volume. These increases were partially offset by 70 basis points due to a $12 million loss on the sale of a building during the 2017 fourth quarter in anticipation of consolidating two focal plane array foundries during 2018 and 2019 and 20 basis points due to severance costs of $3 million.\nFinancial Guidance\nBased on information known as of today, the company has updated its consolidated and segment financial guidance for the year ending December 31, 2018 that was previously provided on December 5, 2017, as presented in the tables below. All financial guidance amounts are based on results from continuing operations and are estimates subject to change, including as a result of matters discussed under the “Forward-Looking Statements” cautionary language beginning on page 8. The company undertakes no duty to update its guidance.\nConsolidated 2018 Financial Guidance\n($ in millions, except per share data) Prior Guidance Current Guidance (December 5, 2017) Net sales $9,850 to $10,050 $9,850 to $10,050 Operating income $1,100 to $1,125 $1,100 to $1,150 Interest expense and other (1) $141 $141 Effective tax rate 20.0% 26.6% Minority interest expense (2) $17 $15 Diluted shares ~80 ~80 Diluted EPS from continuing operations $9.30 to $9.50 $8.60 to $8.85 Net cash from operating activities from continuing operations $1,145 $1,110 Capital expenditures, net of dispositions of property, plant and equipment (245) (245) Free cash flow $900 $865\n(1) Interest expense and other is comprised of: (i) interest expense of $170 million and (ii) interest and other income, net, of $29 million (including $9 million\nof income related to employee benefit plans).\n(2) Minority interest expense represents net income from continuing operations attributable to non-controlling interests.\nSegment 2018 Financial Guidance ($ in millions) Current Guidance Prior Guidance (December 5, 2017)\nNet Sales:\nElectronic Systems $3,200 to $3,300 $3,200 to $3,300 Aerospace Systems $2,625 to $2,725 $2,625 to $2,725 Communication Systems $2,225 to $2,325 $2,225 to $2,325 Sensor Systems $1,700 to $1,800 $1,700 to $1,800 Operating Margin:\nElectronic Systems 13.6% to 13.8% 13.7% to 13.9% Aerospace Systems 7.8% to 8.0% 8.0% to 8.2% Communication Systems 10.9% to 11.1% 11.1% to 11.3% Sensor Systems 11.7% to 11.9% 11.4% to 11.6% The revisions to our Current Guidance compared to our Prior Guidance includes (i) a decrease in the effective income tax rate driven by the enactment of U.S. Tax Reform in December 2017, and (ii) a decrease in consolidated and segment operating income and margin due to higher expected FAS pension expense, net of CAS recoveries, of $15 million.\nThe current guidance for 2018 is subject to potential changes to interpretations of U.S. Tax Reform and excludes: (i) any adverse impacts from a protracted U.S. DoD FY2018 budget continuing resolution, (ii) any potential goodwill impairment charges for which the information is presently unknown, (iii) potential adverse results related to litigation contingencies and (iv) other items such as gains or losses related to potential business divestitures and the impact of potential acquisitions.\nAdditional financial information regarding the 2017 fourth quarter results and the 2018 financial guidance is available on the company’s website at www.L3T.com .\nConference Call\nIn conjunction with this release, L3 will host a conference call today, Thursday, January 25, 2018, at 11:00 a.m. ET that will be simultaneously broadcast over the Internet. Christopher E. Kubasik, Chief Executive Officer and President, and Ralph G. D’Ambrosio, Senior Vice President and Chief Financial Officer, will host the call.\nListeners can access the conference call live at the following website address:\nhttp://www.L3T.com\nPlease allow 15 minutes prior to the call to visit this site to download and install any necessary audio software. The archived version of the call may be accessed at the site or by dialing (800) 585-8367/passcode: 2677676 (for domestic callers) or (404) 537-3406/passcode: 2677676 (for international callers) beginning approximately two hours after the call ends and will be available until the company’s next quarterly earnings release.\nHeadquartered in New York City, L3 Technologies employs approximately 31,000 people worldwide and is a leading provider of a broad range of communication, electronic and sensor systems used on military, homeland security and commercial platforms. L3 is also a prime contractor in aerospace systems, security and detection systems and pilot training.\nTo learn more about L3, please visit the company’s website at www.L3T.com . L3 uses its website as a channel of distribution of material company information. Financial and other material information regarding L3 is routinely posted on the company’s website and is readily accessible.\nForward-Looking Statements\nCertain of the matters discussed in this press release, including information regarding the company’s 2018 financial guidance, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than historical facts may be forward-looking statements, such as “may,” “will,” “should,” “likely,” “projects,” “financial guidance,” ‘‘expects,’’ ‘‘anticipates,’’ ‘‘intends,’’ ‘‘plans,’’ ‘‘believes,’’ ‘‘estimates,’’ and similar expressions are used to identify forward-looking statements. The company cautions investors that these statements are subject to risks and uncertainties, many of which are difficult to predict and generally beyond the company’s control, that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. Some of the factors that could cause actual results to differ include, but are not limited to, the following: our dependence on the defense industry; backlog processing and program slips resulting from delayed awards and/or funding from the Department of Defense (DoD) and other major customers; the U.S. Government fiscal situation; changes in DoD budget levels and spending priorities; U.S. Government failure to raise the debt ceiling; our reliance on contracts with a limited number of customers and the possibility of termination of government contracts by unilateral government action or for failure to perform; the extensive legal and regulatory requirements surrounding many of our contracts; our ability to retain our existing business and related contracts; our ability to successfully compete for and win new business, or, identify, acquire and integrate additional businesses; our ability to maintain and improve our operating margin; the availability of government funding and changes in customer requirements for our products and services; the outcome of litigation matters (see Notes to our annual report on Form 10-K and quarterly reports on Form 10-Q); results of audits by U.S. Government agencies and of ongoing governmental investigations; our significant amount of debt and the restrictions contained in our debt agreements and actions taken by rating agencies that could result in a downgrade of our debt; our ability to continue to recruit, retain and train our employees; actual future interest rates, volatility and other assumptions used in the determination of pension benefits and equity based compensation, as well as the market performance of benefit plan assets; our collective bargaining agreements; our ability to successfully negotiate contracts with labor unions and our ability to favorably resolve labor disputes should they arise; the business, economic and political conditions in the markets in which we operate; the risk that our commercial aviation products and services businesses are affected by a downturn in global demand for air travel or a reduction in commercial aircraft OEM (Original Equipment Manufacturer) production rates; the DoD’s Better Buying Power and other efficiency initiatives; events beyond our control such as acts of terrorism; our ability to perform contracts on schedule; our international operations including currency risks and compliance with foreign laws; our extensive use of fixed-price type revenue arrangements; the rapid change of technology and high level of competition in which our businesses participate; risks relating to technology and data security; our introduction of new products into commercial markets or our investments in civil and commercial products or companies; the impact on our business of improper conduct by our employees, agents or business partners; goodwill impairments and the fair values of our assets; and ultimate resolution of contingent matters, claims and investigations relating to acquired businesses, and the impact on the final purchase price allocations.\nOur forward-looking statements speak only as of the date of this press release or as of the date they were made, and we undertake no obligation to update forward-looking statements. For a more detailed discussion of these factors, also see the information under the captions “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our most recent report on Form 10-K for the year ended December 31, 2016 and in the quarterly report on Form 10-Q for the quarterly period ended September 29, 2017 and any material updates to these factors contained in any of our future filings.\nAs for the forward-looking statements that relate to future financial results and other projections, actual results will be different due to the inherent uncertainties of estimates, forecasts and projections and may be better or worse than projected and such differences could be material. Given these uncertainties, you should not place any reliance on these forward-looking statements.\n(1) Organic sales represent net sales excluding the sales impact of acquisitions and divestitures. Sales declines related to business divestitures are sales from divestitures that are included in L3’s actual results for the 12 months prior to the divestitures. Sales increases related to acquired businesses are sales from acquisitions that are included in L3’s actual results for less than 12 months. The company believes organic sales is a useful measure for investors because it provides period-to-period comparisons of the company’s ongoing operational and financial performance.\n– Financial Tables Follow –\nTable A L3 TECHNOLOGIES, INC. UNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (in millions, except per share data) Fourth Quarter Ended Year Ended Dec. 31, 2017 2016 2017 2016 Net sales $ 2,574 $ 2,643 $ 9,573 $ 9,210 Cost of sales (2,311) (2,361) (8,553) (8,253) Operating income 263 282 1,020 957 Interest expense (43) (43) (169) (164) Interest and other income, net 6 4 20 18 Debt retirement charge - (2) - (7) Income from continuing operations before income taxes 226 241 871 804 Benefit (provision) for income taxes 45 (54) (102) (171) Income from continuing operations 271 187 769 633 Income (loss) from discontinued operations, net of income tax (a) 22 5 (76) 91 Net income 293 192 693 724 Net income from continuing operations attributable to noncontrolling interests (4) (4) (16) (14) Net income attributable to L3 $ 289 $ 188 $ 677 $ 710 Basic earnings (loss) per share attributable to L3’s common shareholders: Continuing operations $ 3.42 $ 2.37 $ 9.65 $ 7.99 Discontinued operations 0.28 0.06 (0.97) 1.18 Basic earnings per share $ 3.70 $ 2.43 $ 8.68 $ 9.17 Diluted earnings (loss) per share attributable to L3's common shareholders: Continuing operations $ 3.34 $ 2.32 $ 9.46 $ 7.86 Discontinued operations 0.28 0.06 (0.95) 1.15 Diluted earnings per share $ 3.62 $ 2.38 $ 8.51 $ 9.01 L3’s weighted average common shares outstanding: Basic 78.2 77.3 78.0 77.4 Diluted 79.9 78.9 79.6 78.8 (a) Income (loss) from discontinued operations, net of income taxes for the year ended December 31, 2016 includes an after-tax gain of $64 million on the sale of the\nNational Security Solutions business.\nTable B L3 TECHNOLOGIES, INC. UNAUDITED SELECT FINANCIAL DATA (in millions) Fourth Quarter Ended Year Ended Dec. 31, 2017 2016 2017 2016 Segment operating data Net sales: Electronic Systems $ 803 $ 861 $ 3,024 $ 2,753 Aerospace Systems 727 728 2,773 2,936 Communication Systems 602 583 2,229 2,053 Sensor Systems 442 471 1,547 1,468 Total $ 2,574 $ 2,643 $ 9,573 $ 9,210 Operating income: Electronic Systems $ 110 $ 109 $ 403 $ 360 Aerospace Systems 58 50 210 255 Communication Systems 47 56 212 195 Sensor Systems 48 67 195 147 Total $ 263 $ 282 $ 1,020 $ 957 Operating margin: Electronic Systems 13.7 % 12.7 % 13.3 % 13.1 % Aerospace Systems 8.0 % 6.9 % 7.6 % 8.7 % Communication Systems 7.8 % 9.6 % 9.5 % 9.5 % Sensor Systems 10.9 % 14.2 % 12.6 % 10.0 % Total 10.2 % 10.7 % 10.7 % 10.4 % Depreciation and amortization: Electronic Systems $ 25 $ 15 $ 79 $ 60 Aerospace Systems 13 12 51 46 Communication Systems 13 12 49 47 Sensor Systems 13 12 46 45 Total $ 64 $ 51 $ 225 $ 198 Funded order data Electronic Systems $ 792 $ 821 $ 3,201 $ 2,956 Aerospace Systems 987 970 2,673 2,768 Communication Systems 465 552 2,120 1,967 Sensor Systems 490 700 2,002 1,829 Total $ 2,734 $ 3,043 $ 9,996 $ 9,520 Dec. 31, Dec. 31, 2017 2016 Period end data Funded backlog $ 8,879 $ 8,380 Table C L3 TECHNOLOGIES, INC. UNAUDITED CONDENSED CONSOLIDATED BALANCE SHEETS (in millions) December 31, December 31, 2017 2016 ASSETS Cash and cash equivalents $ 662 $ 363 Billed receivables, net 728 700 Contracts in process 1,932 1,858 Inventories 389 330 Other current assets 293 175 Assets held for sale 118 - Assets of discontinued operations 306 481 Total current assets 4,428 3,907 Property, plant and equipment, net 1,110 1,107 Goodwill 6,624 6,374 Identifiable intangible assets 294 229 Other assets 265 248 Total assets $ 12,721 $ 11,865 LIABILITIES AND EQUITY Accounts payable, trade $ 358 $ 284 Accrued employment costs 493 462 Accrued expenses 381 323 Advance payments and billings in excess of costs incurred 509 476 Income taxes payable 10 22 Other current liabilities 354 392 Liability held for sale 12 - Liability of discontinued operations 226 235 Total current liabilities 2,343 2,194 Pension and postretirement benefits 1,310 1,177 Deferred income taxes 167 189 Other liabilities 409 356 Long-term debt 3,330 3,325 Total liabilities 7,559 7,241 Shareholders’ equity 5,094 4,553 Noncontrolling interests 68 71 Total equity 5,162 4,624 Total liabilities and equity $ 12,721 $ 11,865 Table D L3 TECHNOLOGIES, INC. UNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions) Year Ended Dec. 31, 2017 2016 Operating activities Net income $ 693 $ 724 Less: Loss (income) from discontinued operations, net of tax 76 (91) Income from continuing operations 769 633 Depreciation of property, plant and equipment 172 156 Amortization of intangibles and other assets 53 42 Deferred income tax (benefit) provision (4) 27 Stock-based employee compensation expense 53 49 Contributions to employee savings plans in common stock 106 102 Amortization of pension and postretirement benefit plans net loss and prior service cost 59 48 Amortization of bond discounts and deferred debt issue costs (included in interest expense) 6 8 Gain on sale of property, plant and equipment (31) (5) Other non-cash items 9 17 Changes in operating assets and liabilities, excluding amounts from acquisitions and divestitures and\ndiscontinued operations:\nBilled receivables (18) 1 Contracts in process (70) 24 Inventories (69) 24 Other assets (13) 29 Accounts payable, trade 72 16 Accrued employment costs 28 10 Accrued expenses 61 (27) Advance payments and billings in excess of costs incurred 13 (73) Income taxes (43) 33 Other current liabilities (53) (20) Pension and postretirement benefits (47) (57) All other operating activities (67) (15) Net cash from operating activities from continuing operations 986 1,022 Investing activities Business acquisitions, net of cash acquired (317) (388) Proceeds from the sale of businesses, net of closing date cash balances 18 561 Capital expenditures (224) (210) Dispositions of property, plant and equipment 74 21 Other investing activities (5) 6 Net cash used in investing activities from continuing operations (454) (10) Financing activities Proceeds from sale of senior notes - 547 Borrowings under revolving credit facility 1,328 819 Repayments of borrowings under revolving credit facility (1,328) (819) Redemption of senior notes - (856) Common stock repurchased (180) (373) Dividends paid (236) (220) Proceeds from exercise of stock options 46 53 Proceeds from employee stock purchase plan 32 31 Debt issue costs - (10) Repurchases of common stock to satisfy tax withholding obligations (18) (21) Other financing activities (10) (7) Net cash used in financing activities from continuing operations (366) (856) Effect of foreign currency exchange rate changes on cash and cash equivalents 20 (13) Cash from (used in) discontinued operations: Operating activities 117 19 Investing activities (4) (6) Cash from discontinued operations 113 13 Net increase in cash and cash equivalents 299 156 Cash and cash equivalents, beginning of the period 363 207 Cash and cash equivalents, end of the period $ 662 $ 363 Table E L3 TECHNOLOGIES, INC. UNAUDITED HISTORICAL DATA FOR THE QUARTERLY PERIODS ENDED MARCH 31, JUNE 30 AND SEPTEMBER 29, 2017 (in millions, except per share data) Historical Results Discontinued Operations Continuing Operations (a) Q1 Q2 Q3 Q1 Q2 Q3 Q1 Q2 Q3 Net sales $ 2,669 $ 2,732 $ 2,646 $ 348 $ 347 $ 353 $ 2,321 $ 2,385 $ 2,293 Cost of sales (2,416) (2,420) (2,396) (331) (327) (332) (2,085) (2,093) (2,064) Goodwill impairment charge - - (187) - - (187) - - - Operating income (loss) 253 312 63 17 20 (166) 236 292 229 Interest expense (42) (43) (43) - (1) (1) (42) (42) (42) Interest and other income, net 5 4 6 - - 1 5 4 5 Income (loss) before income taxes 216 273 26 17 19 (166) 199 254 192 (Provision) benefit for income taxes (48) (66) - (6) (7) 46 (42) (59) (46) Net income (loss) 168 207 26 11 12 (120) 157 195 146 Net income attributable to noncontrolling interests (4) (5) (3) - - - (4) (5) (3) Net income (loss) attributable to L3 $ 164 $ 202 $ 23 $ 11 $ 12 $ (120) $ 153 $ 190 $ 143 Diluted earnings (loss) per share attributable to L3's common shareholders: $ 2.07 $ 2.54 $ 0.29 $ 0.14 $ 0.15 $ (1.50) $ 1.93 $ 2.39 $ 1.79 L3’s diluted weighted average common shares outstanding: 79.3 79.5 79.8 79.3 79.5 79.8 79.3 79.5 79.8 (a) The continuing operations were derived from L3 historical results and were adjusted to: (1) remove Vertex Aerospace results of operations, (2) allocate a portion of L3’s interest expense to Vertex Aerospace and (3)\nrealign certain contracts between L3 and Vertex Aerospace. In addition, certain overhead expenses previously allocated to Vertex Aerospace and included in L3’s historical results were retained by L3 and reported as part\nof L3 continuing operations. Vertex Aerospace will be reported as discontinued operations beginning with the 2017 fourth quarter.\nTable F L3 TECHNOLOGIES, INC. UNAUDITED HISTORICAL DATA FOR THE QUARTERLY PERIODS ENDED MARCH 25, JUNE 24, SEPTEMBER 23 AND DECEMBER 31, 2016 (in millions, except per share data) Historical Results Discontinued Operations Continuing Operations (a) Q1 Q2 Q3 Q4 Q1 Q2 Q3 Q4 Q1 Q2 Q3 Q4 Net sales $ 2,353 $ 2,664 $ 2,505 $ 2,989 $ 288 $ 346 $ 321 $ 346 $ 2,065 $ 2,318 $ 2,184 $ 2,643 Cost of sales (2,101) (2,417) (2,290) (2,695) (280) (319) (317) (334) (1,821) (2,098) (1,973) (2,361) Operating income 252 247 215 294 8 27 4 12 244 220 211 282 Interest expense (41) (43) (41) (44) (1) (2) (1) (1) (40) (41) (40) (43) Interest and other income, net 4 5 6 3 - - 1 (1) 4 5 5 4 Debt retirement charge - (5) - (2) - - - - - (5) - (2) Income before income taxes 215 204 180 251 7 25 4 10 208 179 176 241 Provision for income taxes (48) (53) (29) (59) (3) (8) (2) (5) (45) (45) (27) (54) Net income 167 151 151 192 4 17 2 5 163 134 149 187 Net income attributable to noncontrolling interests (3) (4) (3) (4) - - - - (3) (4) (3) (4) Net income attributable to L3 $ 164 $ 147 $ 148 $ 188 $ 4 $ 17 $ 2 $ 5 $ 160 $ 130 $ 146 $ 183 Diluted earnings per share attributable to L3's common shareholders: $ 2.08 $ 1.88 $ 1.88 $ 2.38 $ 0.06 $ 0.22 $ 0.03 $ 0.06 $ 2.02 $ 1.66 $ 1.85 $ 2.32 L3’s diluted weighted average common shares outstanding: 79.0 78.4 78.8 78.9 79.0 78.4 78.8 78.9 79.0 78.4 78.8 78.9", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.L3T.com&esheet=51748745&newsitemid=20180125005458&lan=en-US&anchor=www.L3T.com&index=3&md5=8e707d209da9632df61f51cb8d50a7e0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.L3T.com&esheet=51748745&newsitemid=20180125005458&lan=en-US&anchor=http%3A%2F%2Fwww.L3T.com&index=2&md5=8d718af2150a4c8aee1698172bfbf1db", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.L3T.com&esheet=51748745&newsitemid=20180125005458&lan=en-US&anchor=www.L3T.com&index=1&md5=97c23037a9bb1eec6b0a3cea4ab1305f"], "published": "2018-01-25T14:55:00.000+02:00", "crawled": "2018-01-25T14:24:07.003+02:00", "highlightTitle": ""}