{"organizations": [], "uuid": "545cd74d99c4c760a1740bcb19baaf0a7dd286b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227036368&w=1200&r=LYNXMPEE0U1HL", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-india-budget/as-india-unveils-budget-all-eyes-on-fiscal-deficit-target-idUSKBN1FK2TJ", "country": "US", "domain_rank": 408, "title": "As India unveils budget, all eyes on fiscal deficit target", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:45:00.000+02:00", "replies_count": 0, "uuid": "545cd74d99c4c760a1740bcb19baaf0a7dd286b6"}, "author": "", "url": "https://www.reuters.com/article/us-india-budget/as-india-unveils-budget-all-eyes-on-fiscal-deficit-target-idUSKBN1FK2TJ", "ord_in_thread": 0, "title": "As India unveils budget, all eyes on fiscal deficit target", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "suvashree choudhury", "sentiment": "none"}, {"name": "manoj kumar", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "nse", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nsei", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 6:56 PM / Updated 14 minutes ago As India unveils budget, all eyes on fiscal deficit target Manoj Kumar , Suvashree Choudhury 3 Min Read \nNEW DELHI (Reuters) - As India’s government gets set to unveil its 2018-19 budget on Thursday, all eyes will be on whether the authorities stay the course on containing the fiscal deficit, or whether they throw caution to the wind with a populist set of spending priorities. \nFacing discontent at home over falling farm incomes and a backlash following policy initiatives that have dented growth, Prime Minister Narendra Modi will be aiming to woo rural voters and small business owners in the last full budget before a general election that must be held by May 2019. \nWhile economic growth has been slowed by the botched rollout of a nationwide goods and service tax (GST) in 2017, and a shock move to ban high value currency notes in late 2016, investors have so far looked beyond the setbacks, perceiving the initiatives as positive long term. \nBenchmark 10-year bond yields have fallen 135 basis points and the NSE share index .NSEI has surged 55 percent since Modi took power in May 2014. \nTo keep investors on side however, Modi will have to convince them that he plans to keep to his word on working toward reining in the fiscal deficit. \nA Reuters poll this week showed most economists expect a 3.2 percent deficit in 2018-19, as the government looks to increase investments in areas such as agriculture. Anything much beyond that, however, may draw a swift sell-off in the markets. \nInvestors were already spooked this week after India’s Chief Economic Advisor Arvind Subramanian, in an economic survey ahead of the budget, suggested “a pause” in the fiscal consolidation path, while the government attempts to reinvigorate growth. \nIndian shares .NSEI fell for a second consecutive session on Wednesday, as investors opted to book profits ahead of the budget, with markets trading near all-time highs. \nThe benchmark 10-year bond yield IN067927G=CC closed flat at 7.60 percent on Wednesday, but it is up 13 basis points from its close on Friday after Subramanian’s comments. Reporting by Manoj Kumar and Suvashree Choudhury; Writing by Euan Rocha and Sanjeev Miglani, Editing by William Maclean", "external_links": [], "published": "2018-01-31T20:45:00.000+02:00", "crawled": "2018-01-31T21:15:25.002+02:00", "highlightTitle": ""}