{"organizations": [], "uuid": "15d1dd91ab9c8925cba71a1a1cab535936767dc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/libya-economy/libyan-dinar-climbs-steeply-against-dollar-on-parallel-market-idUSL8N1PC3RI", "country": "US", "domain_rank": 408, "title": "Libyan dinar climbs steeply against dollar on parallel market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.78, "site_type": "news", "published": "2018-01-17T23:32:00.000+02:00", "replies_count": 0, "uuid": "15d1dd91ab9c8925cba71a1a1cab535936767dc0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/libya-economy/libyan-dinar-climbs-steeply-against-dollar-on-parallel-market-idUSL8N1PC3RI", "ord_in_thread": 0, "title": "Libyan dinar climbs steeply against dollar on parallel market", "locations": [], "entities": {"persons": [], "locations": [{"name": "tripoli", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "tripoli", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TRIPOLI, Jan 17 (Reuters) - Libya’s currency has gained sharply on the informal market, rising to around six dinars to the dollar on Wednesday compared with around nine dinars to the dollar at the start of the year.\nThe dinar’s gains came as the central bank launched this year’s programme for selling limited quantities of dollars to citizens at the official exchange rate of 1.3 dinars.\nOne black market trader in Tripoli said only that there was “a big offer (of dollars) circulating at the moment”. Traders in Tripoli and Benghazi said the price was between 5.60 and 6.25 dinars to the dollar.\nDespite occasional swings, the dinar had been gradually losing value on the informal market in Libya since 2014, when conflict in the North African country worsened and rival governments with separate financial institutions were set up in Tripoli and the east.\nLibya’s dollar earnings for oil sales, on which the economy is highly dependent, partially recovered last year after previously blockaded fields and ports reopened.\nThe dinar’s value was last around the six dinar level in the first half of 2017. With the official dollar price fixed, Libyans with access to dollars at that rate have been able to make huge profits on the informal market, some through fraudulent import schemes.\nThe central bank has offered $500 per person at the official rate this year, but it is unclear how many dollars it will make available or how quickly the money will be disbursed through Libya’s crippled banking system. The central bank said it had released $2.78 billion through the scheme in 2016.\nAbdullah Zaidi, an economic expert in Benghazi said he did not believe the rise of the dinar would outlast the central bank’s injection of dollars. “It’s not possible to consider the fall in the price of the dollar as a recovery ... it is expected to rise again after the proposed period for buying the dollars through the banks”.\nLibya has been suffering from a severe liquidity crisis for several years, with residents queuing for days to try to collect local currency from banks. (Reporting by Ahmed Elumami and Ayman al-Warfalli; Writing by Aidan Lewis; Editing by Hugh Lawson)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T23:32:00.000+02:00", "crawled": "2018-01-18T16:26:49.000+02:00", "highlightTitle": ""}