{"organizations": [], "uuid": "21b8c22acca4862ac6e18bfff91687ceb1511874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/aviation-finance-exportfinance/update-1-airbus-in-talks-with-insurers-to-fill-export-funding-gap-idUSL8N1PH48D", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Airbus in talks with insurers to fill export funding gap", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:50:00.000+02:00", "replies_count": 0, "uuid": "21b8c22acca4862ac6e18bfff91687ceb1511874"}, "author": "", "url": "https://www.reuters.com/article/aviation-finance-exportfinance/update-1-airbus-in-talks-with-insurers-to-fill-export-funding-gap-idUSL8N1PH48D", "ord_in_thread": 0, "title": "UPDATE 1-Airbus in talks with insurers to fill export funding gap", "locations": [], "entities": {"persons": [{"name": "tim hepher", "sentiment": "none"}, {"name": "conor humphries", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "pnf", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "serious fraud office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:50 PM / Updated an hour ago UPDATE 1-Airbus in talks with insurers to fill export funding gap Reuters Staff \n* Talks emerge as export credits for Airbus remain frozen \n* U.S. export credits for Boeing also remain offline \n* Airbus, Boeing see export uncertainty resolved soon (Recasts, adds details) \nBy Tim Hepher and Conor Humphries \nDUBLIN, Jan 22 (Reuters) - Airbus said on Monday it is working with private insurance firms and banks to help fill a two-year gap in trade funding left by a European freeze on government export credits, but expects limited public financing to resume soon. \nAirbus has been unable to rely on export credits to help deliver jets to cash-strapped airlines since 2016, when Britain, France and Germany halted the system over the disclosure of misleading paperwork that led to a UK and French bribery probe. \nWhile Britain’s Serious Fraud Office and France’s PNF police probe the alleged wrongful use of middlemen going back years, which came to light in applications for UK support, Airbus is talking to agencies about tougher safeguards for future deals. \nOpening a second front for export financing, Airbus is also in talks with insurers and banks to provide an alternative system for cushioning the risk of exporting to nations where airlines have problems raising credit, an Airbus executive said. \n“The target is to offer conditions similar or equivalent to European Credit Agency financing,” Christin Lodberg, vice-president of customer finance, told the Airline Economics conference, a major gathering of financiers in Dublin. \nAirbus believes the new system should be ready in the first half of the year, mirroring a consortium of insurers recently established to support exports by rival Boeing. \nLodberg said five insurers and about as many banks were involved in the Airbus plan, but did not identify them. \nPlanemakers and major industrial exporters rely across the world on government-backed credits or insurance cover to help keep trade flowing to countries with poor access to finance. \nBoth Airbus and Boeing have seen their access to export funding suspended for about two years for different reasons: in Europe because of compliance probes and in the United States because of a debate over the future of the Export Import Bank. \nThe shutdown coincided with ample available market finance due to brimming liquidity in global financial markets, but both manufacturers and export agencies say a backstop of public export support is needed to ward off future instability. \nCongress reauthorised EXIM in late 2015 after a debate over what its critics described as “corporate welfare” to exporters. \nBut it remains hampered by a standoff over board appointments needed to approve deals over $10 million, resulting in an estimated backlog of about $7 billion in Boeing deals needing bridge loans or alternative financing to get completed. \nIn December, the U.S. Senate Banking Committee rejected President Donald Trump’s nominee to head EXIM but approved four other board nominees, enough to restore the trade bank’s full lending powers upon their confirmation by the full Senate. \nLegislation is also being considered to reduce the required board quorum at EXIM to allow large transactions to be approved. \nHowever, talks over EXIM nominations are expected to take a backseat during the current budget impasse in Washington, Daniel da Silva, vice president of strategic regulatory policy at Boeing Capital Corporation, said. \n“We expect that some time in the first quarter this situation with the board will be resolved one way or the other.” \nEuropean officials told the same conference government exports credits could be restored for Airbus this year. Airbus’s Lodberg predicted some cover “fairly soon.” \nHowever, funding is unlikely to be on the same scale as in the past due to toughened due-diligence rules, under which applications are expected to take longer, she added. (Reporting by Tim Hepher; Editing by Conor Humphries and Adrian Croft)", "external_links": [], "published": "2018-01-22T17:50:00.000+02:00", "crawled": "2018-01-22T18:06:21.006+02:00", "highlightTitle": ""}