{"organizations": [], "uuid": "f9bae25b0b0e1381d8f3f10abdbc996e19cd76ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224489323&w=1200&r=LYNXMPEE0M14G", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-afghanistan-attacks/afghan-hotel-attack-stirs-fresh-debate-on-private-security-firms-idUKKBN1FC1W3", "country": "US", "domain_rank": 408, "title": "Afghan hotel attack stirs fresh debate on private security firms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:18:00.000+02:00", "replies_count": 0, "uuid": "f9bae25b0b0e1381d8f3f10abdbc996e19cd76ad"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-attacks/afghan-hotel-attack-stirs-fresh-debate-on-private-security-firms-idUKKBN1FC1W3", "ord_in_thread": 0, "title": "Afghan hotel attack stirs fresh debate on private security firms", "locations": [], "entities": {"persons": [{"name": "hamid shalizi", "sentiment": "none"}, {"name": "sayed rahimi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "kbss", "sentiment": "none"}, {"name": "min read  kabul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kabul balkh safety and security organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:19 PM / Updated 5 minutes ago Afghan hotel attack stirs fresh debate on private security firms Hamid Shalizi 4 Min Read \nKABUL (Reuters) - A bloody Taliban raid on a high-end hotel guarded by a private company in the Afghan capital has stirred fresh debate about the role of security firms in the violence-plagued county. \nFive gunmen dressed in army uniforms made their way through two checkpoints before getting in to the hilltop Hotel Intercontinental on the weekend, killing at least 20 people, including 13 foreigners. \nAmericans were among the dead and wounded, a U.S. State Department spokesperson said without giving details. Seven Ukrainians and one German are also known to have died. \nOn Tuesday, security officials were meeting in the hotel, as guards of the Kabul Balkh Safety and Security Organisation (KBSS) stood outside, with rifles slung across their chests. \nKBSS won the contract to guard the hotel three weeks ago, the government said. \nThe company’s president, Sayed Rahimi, issued a statement saying it was “too early to come to conclusions as to how this occurred” and expressing condolences to the bereaved. \n“We will fully cooperate with the government in the investigation. I don’t have anything else to say,” Rahimi told Reuters when contacted by telephone. \nThe company has been operating since 2004, providing security services to numerous clients including businesses, the government and foreign forces, Rahimi said in his statement. \nA senior government security official involved in the investigation said the guards had offered little resistance. \n“There were 15 guards on duty at time of the attack and none of them engaged the attackers,” said the official, who declined to be identified as he is not authorised to speak to the media. \n“They were either watching the whole thing or hiding.” \nFormer President Hamid Karzai issued a decree in 2010 banning private security firms. \nAt the time, the government said the firms, which were estimated to employ some 40,000 people, were involved in weapons smuggling and shootings. An Afghan security guard stands at the entrance gate of the Intercontinental Hotel after an attack in Kabul, Afghanistan January 23, 2018.REUTERS/Mohammad Ismail \nThe ban raised concern in Washington that aid work would suffer as many development projects rely on private security firms for protection. \nExceptions were later made for companies guarding embassies, and military installations and diplomatic residences and personnel. The ban was delayed for companies with existing contracts and doing development jobs. \nMost of the companies were operated by Afghans with good government connections and many with foreign partners, often ex-military men. \n‘VERY CONCERNING’ \nKBSS said on its website it has been operating since 2004. It also displays certificates of appreciation including some from the European Union and U.S. military. \nInterior Ministry spokesman Najib Danish said investigators were looking into how the company got the job of guarding the Intercontinental Hotel, which is in public ownership and no longer part of the Intercontinental Hotels Group. \nA finance ministry official said the hotel management asked for the privatisation of its security and the National Security Council (NSC) had approved it. Neither the hotel’s manager nor NSC officials were available for comment. \nMerdad Nejrabi, a member of parliament and chairman of its internal security committee, said private security was more of a problem than a help. \n”These companies were disbanded for a reason,“ Nejrabi told Reuters. ”They were involved in arms smuggling, corruption, kidnapping and all that. Now that they have re-emerged, it is very concerning. \n“The privatisation of security for Kabul, and particularly at important sites, has never been helpful.” \nAnother critic of the private security firms, member of parliament Farhad Sediqi, said the assembly planned to hold a special session to discuss the issue. \n“It’s wrong to hand over the security responsibility for important sites to private companies,” Sediqi told Reuters. \nPresident Ashraf Ghani’s office declined to comment.   Jonathan Landay in WASHINGTON; Writing by Robert Birsel; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-23T16:18:00.000+02:00", "crawled": "2018-01-23T17:15:36.012+02:00", "highlightTitle": ""}