{"organizations": [], "uuid": "b42aaa877561caf135ddf4aec2b699c17f7c0926", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren-coach/sandgren-wants-more-meat-off-grand-slam-bone-coach-idUKKBN1FB1SI", "country": "US", "domain_rank": 408, "title": "INTERVIEW-Tennis-Sandgren wants more meat off grand slam bone - coach", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:05:00.000+02:00", "replies_count": 0, "uuid": "b42aaa877561caf135ddf4aec2b699c17f7c0926"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren-coach/sandgren-wants-more-meat-off-grand-slam-bone-coach-idUKKBN1FB1SI", "ord_in_thread": 0, "title": "INTERVIEW-Tennis-Sandgren wants more meat off grand slam bone - coach", "locations": [], "entities": {"persons": [{"name": "sandgren", "sentiment": "negative"}, {"name": "jim madrigal", "sentiment": "none"}, {"name": "dominic thiem", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "madrigal", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}], "locations": [{"name": "hisense arena", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 1:57 PM / Updated 32 minutes ago Sandgren wants more meat off grand slam bone - coach Ian Ransom 4 Min Read \nMELBOURNE (Reuters) - Tennys Sandgren’s mantra at the Australian Open has been to “tear the meat off the bone” but the American outsider is not ready to leave the table despite his brilliant run to the quarter-finals, according to his coach Jim Madrigal. \nThe world number 97 became only the second man to reach the last eight on debut at Melbourne Park in 20 years after toppling fifth seed Dominic Thiem in a five-set thriller at the Hisense Arena on Monday. \nThe Tennessee native’s advance has been all the more remarkable given his failure to win more than two Tour-level matches in succession prior to Melbourne Park. \nHis proud coach Madrigal wore sunglasses at the post-match news conference, hiding the tears in his eyes for fear he might throw off the player’s delivery when responding to questions. \n“We kind of had this slogan that there’s still meat on the bone, so as long as it’s there, we’re going to try to, well, milk this cow for every drop,” the misty-eyed Madrigal told Reuters in an interview. \n”That’s the philosophy, it’s all we can do. \n”It’s an amazing opportunity and I think he’s looked back at this year and previous years and felt that there have been dozens of opportunities that he felt he had meat left on the bone and he left it there. \n”Especially in that third-round match (against Maximilian Marterer) he thought, ‘when are you ever going to get another opportunity like this again? You are not going to leave it on the table’. \n“I think that’s his determination, he’s going to get as much as he can out of this week.” \nSandgren, who numbered triple grand slam champion Stan Wawrinka among his victims this week, will play young gun Chung Hyeon for a place in the semi-finals. \nChung upset six-times Australian Open champion Novak Djokovic to become the first South Korean to reach the last eight of a grand slam. \nIronically, he played no small part in 26-year-old Sandgren’s blossoming in Melbourne. LUCKY LOSER \nSandgren faced Chung as a lucky loser at the Auckland Classic in New Zealand days before arriving for the grand slam and absorbed plenty of lessons in a three-set loss to the 21-year-old. \n“(Chung) kind of called Tennys to the carpet and said ‘can you play this level and if you can how long can you play with me?',” said Madrigal, a long-time college coach at Nashville’s Belmont University. \n”Tennys kind of buckled down any sort of emotion he had and played the very best he could. \n“He walked away from the match with a loss but a lot of experience and a lot of ‘wow, this is what I‘m going to have to do if I want to succeed at the next level’.” \nWorld number 58 Chung’s star is rising and he will be another massive challenge for Sandgren, who felt he needed to pinch himself after beating Thiem to be sure he wasn’t dreaming. \nBut the American is already playing with house money, said Madrigal, and no longer needs to worry whether he is worthy to face off for a grand slam semi-final. \nThe positive attitude helped him shrug off a huge let-down when Thiem saved a match point in the fourth set tiebreak with a scintillating backhand winner down the line. \n“Now he’s in the moment, just in the details that he wants to execute in the moment,” Madrigal said. \n“That’s why it appears he’s unfazed with pressure. He’s not thinking about ‘what could be, could I win?', all the things that can swallow you if you get engulfed in them.” Editing by Ed Osmond", "external_links": [], "published": "2018-01-22T15:05:00.000+02:00", "crawled": "2018-01-22T16:33:40.026+02:00", "highlightTitle": ""}