{"organizations": [], "uuid": "895e39dff1e3e36696fc6278d8a86ca0a149e6f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/13/104897047-GettyImages-887892238.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/senate-democrats-close-to-winning-majority-backing-to-reverse-net-neutrality-rollback.html", "country": "US", "domain_rank": 767, "title": "Senate Democrats close to winning majority backing to reverse net neutrality rollback", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.748, "site_type": "news", "published": "2018-01-16T17:41:00.000+02:00", "replies_count": 0, "uuid": "895e39dff1e3e36696fc6278d8a86ca0a149e6f6"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/16/senate-democrats-close-to-winning-majority-backing-to-reverse-net-neutrality-rollback.html", "ord_in_thread": 0, "title": "Senate Democrats close to winning majority backing to reverse net neutrality rollback", "locations": [], "entities": {"persons": [{"name": "ed markey", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "susan collins", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "u.s. federal communications commissions", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Senate Democrats said on Tuesday they had the backing of 50 members of the 100-person chamber to overturn the U.S. Federal Communications Commissions reversal of landmark Obama administration net neutrality rules, but still faced an uphill battle.\nSenator Ed Markey said in a statement all 49 Democrats backed the repeal. Earlier this month, Republican Senator Susan Collins said she would back the effort to overturn the FCCs recent move.\nThe FCC voted in December along party lines to reverse rules introduced in 2015 that barred internet service providers from blocking or throttling traffic, or offering paid fast lanes, also known as paid prioritization. A group of state attorneys general immediately vowed to sue. The new rules will not take affect for several months, the FCC has said.\nA reversal of the FCC vote would need the approval of the U.S. Senate, the U.S. House and President Donald Trump. Trump backed the FCC action, the White House said last month.\nA trade group representing major tech companies including Facebook , Alphabet and Amazon.com said it would support legal challenges to the reversal.\nThe vote in December marked a victory for AT&T , Comcast and Verizon Communications and handed them power over what content consumers can access over the internet. It was the biggest win for FCC Chairman Ajit Pai in his sweeping effort to undo many telecommunications regulations.\nSenate Democratic Leader Chuck Schumer said the issue would be a major motivating factor for young voters the party is courting. \"Were going to let everyone know where we stand and they stand, Schumer said this month.\nSenate Majority Leader Mitch McConnell, a Republican, backs the FCC repeal.\nThe FCC order grants internet providers sweeping new powers to block, throttle or discriminate among internet content, but requires public disclosure of those practices. Internet providers have vowed not to change how consumers obtain online content.\nHouse Energy and Commerce Committee chairman Greg Walden, a Republican, said in an interview Tuesday he planned to hold a hearing on paid prioritization. He has urged Democrats to work constructively on a legislative solution to net neutrality \"to bring certainty and clarity going forward and ban behaviors like blocking and throttling.\"\nHe said it was unlikely a vote to overturn the FCC decision would get a majority in the U.S. House.\nPaid prioritization is part of American life, Walden said. \"Where do you want to sit on the airplane? Where do you want to sit on Amtrak?\" Walden said.\nDisclosure: Comcast is the parent company of NBCUniversal and CNBC.", "external_links": [], "published": "2018-01-16T17:41:00.000+02:00", "crawled": "2018-01-16T17:41:27.002+02:00", "highlightTitle": ""}