{"organizations": [], "uuid": "401c0d1f1a402e686f753f878071dc52e45ebe70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-oncosec-medical-incorporated-announces-proposed-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "OncoSec Medical Incorporated Announces Proposed Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-01T00:01:00.000+02:00", "replies_count": 0, "uuid": "401c0d1f1a402e686f753f878071dc52e45ebe70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-oncosec-medical-incorporated-announces-proposed-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "OncoSec Medical Incorporated Announces Proposed Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "oncosec medical incorporated", "sentiment": "negative"}, {"name": "piper jaffray & co.", "sentiment": "none"}, {"name": "cantor fitzgerald & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 31, 2018 /PRNewswire/ -- OncoSec Medical Incorporated (NASDAQ: ONCS), a biotechnology company focused on designing, developing and commercializing innovative therapies and proprietary medical approaches to stimulate and guide an anti-tumor immune response for the treatment of cancer, today announced that it intends to offer and sell, subject to market conditions, shares of its common stock in an underwritten public offering. All of the shares to be sold in the offering will be offered by OncoSec. In addition, OncoSec intends to grant the underwriters a 30-day option to purchase up to an additional 15% of the shares of its common stock offered in the public offering. There can be no assurance as to whether or when the offering may be completed, or as to the actual size or terms of the offering.\nPiper Jaffray & Co. is acting as lead book-running manager for the offering. Cantor Fitzgerald & Co. is also acting as a book runner.\nOncoSec intends to use the net proceeds from this offering primarily for the Phase 2 PISCES/KEYNOTE-695 trial in melanoma, for other clinical and research and development activities, and for working capital and general corporate purposes.\nThe offering is being made pursuant to a shelf registration statement on Form S-3 that was filed with the Securities Exchange Commission (SEC) on August 9, 2016 and declared effective by the SEC on August 25, 2016. The offering will be made only by means of a prospectus and a prospectus supplement that form a part of the registration statement. A preliminary prospectus supplement for the offering will be filed with the SEC and will be available on the SEC's website located at http://www.sec.gov . Copies of the preliminary prospectus supplement and the accompanying prospectus relating to these securities may also be obtained, when available, by contacting Piper Jaffray & Co., Attention: Prospectus Department, 800 Nicollet Mall, J12S03, Minneapolis, MN 55402, by telephone at (800) 747-3924, or by email at prospectus@pjc.com , or from Cantor Fitzgerald & Co., Attention: Capital Markets, 499 Park Ave., 6 th Floor, New York, New York 10022, or by email at prospectus@cantor.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout OncoSec Medical Incorporated\nOncoSec is a biotechnology company developing DNA-based intratumoral immunotherapies with an investigational technology, ImmunoPulse ® , for the treatment of cancer. ImmunoPulse is designed to enhance the local delivery and uptake of DNA-based immune-targeting agents, such as plasmid encoded IL-12 (tavokinogene telseplasmid or \"tavo\"). In Phase 1 and 2 clinical trials, ImmunoPulse ® IL-12 has demonstrated a favorable safety profile, evidence of anti-tumor activity in the treatment of various solid tumors, and the potential to reach beyond the site of local treatment to initiate a systemic immune response. OncoSec's lead program, ImmunoPulse IL-12, is currently in clinical development for metastatic melanoma and triple-negative breast cancer. The program's current focus is on the significant unmet medical need in patients with melanoma who are refractory or have relapsed on anti-PD-1 therapies. In addition to tavo, the Company is also identifying and developing new immune-targeting agents for use with the ImmunoPulse platform.\nForward-Looking Statements\nSome of the statements included in this press release may be forward-looking statements that involve a number of risks and uncertainties. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The factors that could cause our actual results to differ materially include: statements regarding the proposed public offering and the intended use of proceeds from the proposed offering; the status, progress and results of our clinical programs; our ability to obtain regulatory approvals for, and the level of market opportunity for our product candidates; our business plans, strategies and objectives, including plans to pursue collaboration, licensing or other similar arrangements or transactions; expectations regarding our liquidity and performance, including expense levels, sources of capital and ability to maintain operations as a going concern; the competitive landscape of our industry; and general market, economic and political conditions; and other risk factors identified from time to time in our reports filed with the Securities and Exchange Commission. Any forward-looking statements set forth in this press release speak only as of the date of this press release. We do not intend to update any of these forward-looking statements to reflect events or circumstances that occur after the date hereof.\nContact\nInvestor Relations:\nStern Investor Relations\nWill O'Connor\nPhone: (212) 362-1200\nwill@sternir.com\nMedia Relations:\nStern Strategy Group\nBrian Hyland or Ashley Duvall\nPhone: (908) 276-4344\nOncoSecPR@sternstrategy.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/oncosec-medical-incorporated-announces-proposed-public-offering-of-common-stock-300591442.html\nSOURCE OncoSec Medical Incorporated", "external_links": ["http://www.prnewswire.com/news-releases/oncosec-medical-incorporated-announces-proposed-public-offering-of-common-stock-300591442.html", "https://www.globenewswire.com/Tracker?data=aFKirvmEiB2ulfn_yl2PPhi6MoWqxl8f6o4I5P_D4-FKQyDNkZruZ4bCSDBY3sAIZVsdUwjHF4gxBBjDqpfS-kUSYF76S1WbIbV_WIeVXF943AYj_4irG3Fl6UT0i0gbyksvMelA3tovwMg3rgHN_V75nA2WXv_hT2tfoUbvfQrWe49GgbYHAlbweSwaNpvsehydAzXuqGvOEJE31UJJWfyp_mWU_rimox6caDhCnxIeOgt6Daa52bZIhZv-oK8Ow5Q-QTJPKd8enm7fIn75A44XjXtS4EG0g_pxBGxMxFfDOVoT3g6C3QUcQ0YzTlFZHrE_EWjke1TO2T-p1JqVRA=="], "published": "2018-02-01T00:01:00.000+02:00", "crawled": "2018-01-31T23:07:02.034+02:00", "highlightTitle": ""}