{"organizations": [], "uuid": "50ac3de18ae54e05f79c670a8dff3f2e3e0683fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220793862&w=1200&r=LYNXMPEE090K8", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ryanair-investors/ryanair-keeps-big-investors-onside-after-rocky-2017-idUKKBN1EZ12A", "country": "US", "domain_rank": 408, "title": "Ryanair keeps big investors onside after rocky 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:52:00.000+02:00", "replies_count": 0, "uuid": "50ac3de18ae54e05f79c670a8dff3f2e3e0683fa"}, "author": "", "url": "https://uk.reuters.com/article/uk-ryanair-investors/ryanair-keeps-big-investors-onside-after-rocky-2017-idUKKBN1EZ12A", "ord_in_thread": 0, "title": "Ryanair keeps big investors onside after rocky 2017", "locations": [], "entities": {"persons": [{"name": "tom pfeiffer", "sentiment": "none"}, {"name": "maiya keidan", "sentiment": "none"}, {"name": "michael o‘leary", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "manchester airport", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "ryanair boeing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 10:51 AM / Updated 10 minutes ago Ryanair keeps big investors onside after rocky 2017 Tom Pfeiffer , Maiya Keidan 5 Min Read \nLONDON (Reuters) - Several institutional investors are backing Ryanair to bounce back from a pilot rostering mess-up and a decision to recognise unions that jolted confidence in Europe’s most profitable airline. Ryanair Boeing 737-800 aircraft taxi at Manchester Airport, Britain, January 8, 2018. REUTERS/Phil Noble \nThe mishandling of staff holidays caused thousands of flight cancellations, angered passengers and helped pilots to secure union recognition for the first time in Ryanair’s 32-year history, sending the share price down 9 percent in one day in December. \nThe holiday rota errors were a rare serious slip-up by Chief Executive Michael O‘Leary, whose formula of dirt cheap, no-frills travel has transformed the continent’s airline sector and handed his shareholders big returns. \nO‘Leary had said hell would freeze over before he would welcome unions into Ryanair. The company now says dialogue with organised labour will help the business. \n(Graphic for 2017: A rollercoaster ride for Ryanair stock, click reut.rs/2CHXOFC ) \n(Graphic for Meagre gains for Ryanair in 2017, click reut.rs/2DaRRlq ) \nAnalysts say it will inflate its costs and could reduce the flexibility that helped it steal chunks of business from traditional airlines such as Lufthansa ( LHAG.DE ) and Air France-KLM ( AIRF.PA ). \nTop shareholder HSBC Global Asset Managers has cut a quarter of its Ryanair stake, according to a filing last month. HSBC declined to comment on the decision. \nBut other big Ryanair shareholders are maintaining or adding to their holdings. \n“Because the share price has fallen, it has become, in our opinion, compellingly attractive,” said Rory Powe, who manages European growth stocks at Man GLG and added to his Ryanair holdings in December. “I don’t see Ryanair’s cost advantage being eroded by anything more than an immaterial amount.” \nRyanair’s longer-term record as an investment may help explain why top shareholders appear reluctant to drop it. \nThe shares are up 150 percent over four years as it tackled a reputation for shoddy services and wooed higher-paying business passengers. Shares in its most successful rival, Easyjet ( EZJ.L ), have barely moved in that time. \nAnalysts agree upcoming union negotiations will be crucial, amid questions over whether O‘Leary’s pugnacious management style is still appropriate for a company that was once an upstart challenger but now dominates European short-haul air travel. \n“A unionised Ryanair will still be profitable, cash generative and value-creating in our view but will be a markedly different company,” HSBC analysts said last week, rating the shares “reduce”. \nHSBC believes Ryanair unit costs could rise by 20 percent by 2020, with unionisation and the localisation of contracts, and that Ryanair’s talks with continental unions could be tough, “...and airline strikes in these markets are commonplace”. \nBernstein sees a short-term rebound in the stock but believes Ryanair is “cornered” - profitability per passenger will fall if it continues to expand at the current pace but a slowdown in expansion will cause earnings to decline. \n“CATEGORY KILLER” \nOther big Ryanair institutional investors acknowledge the challenges but believe that, with its cost base still below rivals, it can still make bumper profits as the euro zone economy picks up steam, industry capacity growth eases and prices recover. \nRyanair has said it does not expect its costs to increase significantly. \nJonathan Fearon, who runs the Aberdeen Standard European Growth fund, said the market seemed to be pricing in the idea that Ryanair’s cost advantage will disappear. \nBut he said staff costs were only one of many advantages in Ryanair’s broad “ultra-low-cost” business model. \nFearon indicated Ryanair was still a favourite: it was a “category killer” in short-haul that stood to gain from Alitalia’s troubles and as industry capacity growth slows, boosting fares. \nTony Gibb, investment director at another Ryanair shareholder, Fidelity, said the company’s significant cost advantage, even over EasyJet, was “sustainable” and last month’s share slump was “probably overplayed”. \n“There is negative press and the share price has come off quite meaningfully but that is probably more of an opportunity than anything else,” said Gibb. \n(Graphic for Ryanair's share price relative to future earnings has ebbed, click reut.rs/2CIUkCO ) Additional reporting by Conor Humphries and Victoria Bryan Graphics by Ritvik Carvalho; Editing by Susan Fenton", "external_links": [], "published": "2018-01-10T12:52:00.000+02:00", "crawled": "2018-01-10T13:16:11.003+02:00", "highlightTitle": ""}