{"organizations": [], "uuid": "1a8f07a82f18f990bc085fff6094ab735fb6f34d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222489883&w=1200&r=LYNXMPEE0F1A5", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-venezuela-economy-cryptocurrency/advisers-urge-deep-discount-in-venezuelan-cryptocurrency-offering-idUSKBN1F52AB", "country": "US", "domain_rank": 408, "title": "Advisers urge deep discount in Venezuelan cryptocurrency offering", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:01:00.000+02:00", "replies_count": 0, "uuid": "1a8f07a82f18f990bc085fff6094ab735fb6f34d"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-economy-cryptocurrency/advisers-urge-deep-discount-in-venezuelan-cryptocurrency-offering-idUSKBN1F52AB", "ord_in_thread": 0, "title": "Advisers urge deep discount in Venezuelan cryptocurrency offering", "locations": [], "entities": {"persons": [{"name": "girish gupta", "sentiment": "negative"}, {"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}], "organizations": [{"name": "min read  caracas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 5:50 PM / Updated 37 minutes ago U.S. warns investors over Venezuela's 'petro' cryptocurrency Lesley Wroughton , Girish Gupta 5 Min Read \nWASHINGTON/CARACAS (Reuters) - The U.S. Treasury Department on Tuesday warned that Venezuela’s proposed “petro” cryptocurrency could violate sanctions against the OPEC nation’s socialist government, a statement that could dent investor appetite for the soon-to-be-launched token. \nVenezuelan President Nicolas Maduro this month said his government will soon issue 100 million petros, backed by an equivalent number of barrels of oil, partly to get around the U.S. sanctions. \nThose sanctions prohibit the purchase of newly issued Venezuelan debt, which has left Maduro unable to refinance the country’s crippling debt burden and led Socialist Party officials to seek new forms of raising hard currency. \nMaduro is seeking to capitalize on the success of cryptocurrencies like bitcoin by creating one for Venezuela as its traditional currency, the bolivar, plunges to all-time lows against the dollar and the country struggles with hyperinflation. \n“The petro digital currency would appear to be an extension of credit to the Venezuelan government ... (and) could therefore expose U.S. persons to legal risk,” a Treasury spokesman told Reuters on Tuesday. \n“(It) is another attempt to prop up the Maduro regime, while further looting the resources of the Venezuelan people.” \nVenezuela’s Information Ministry did not immediately respond to a request for comment. The OPEC nation, struggling with widespread shortages of food and medicine, is seeking to raise hard currency amid the crippling crisis. \nU.S. banks have grown more cautious about operations involving Venezuela since Washington imposed sanctions, exposing them to legal and reputational risks, finance industry sources said. \nThe United States is considered a crucial source of capital for securities and tokens because of the size of its economy and because many global financial operations at some point pass through U.S. financial institutions. \nMaduro has said each petro will be backed by one barrel of Venezuelan oil and will be sold at the same price, which last week averaged $60.40 per barrel. \nThat would put the value of the entire petro issuance of 100 million tokens at just over $6 billion. \nVenezuela’s government has not provided any description of whether or how investors could collect the oil backing petro holdings. PROPOSED PRIVATE OFFERING \nAdvisers to the Venezuelan government are recommending it sell $2.3 billion of its new cryptocurrency in a private offering at a discount of up to 60 percent, according to a document reviewed by Reuters. \nThe recommendation by newly formed advisory group VIBE, made up of cryptocurrency experts close to the government, indicates that Maduro’s valuation of the nascent petro faces significant market skepticism. \n“The center of financial policy will be the consolidation of the petro,” said Maduro in his annual message on Monday. “This cryptocurrency is the future of humanity. Venezuela has entered the future.” \nHowever, many were left confused. \nVenezuela’s opposition-run Congress has declared the petro an illegal debt issuance by a government desperate for cash, and has said it will not recognize it. \nVIBE recommended Venezuela sell 38.4 million petros with a face value of around $2.3 billion in private placements starting on Feb. 15 at a discount of up to 60 percent. \nAnother 44 million petros with a face value of $2.7 billion should be offered to the public a month later. \nThe remainder should be shared between the government and VIBE, the document said. \nHigh-ranking government advisers have discussed the proposal, according to a source familiar with the situation. It was not immediately clear if the proposal would be accepted. \nThe document suggested the government accept tax payments in petros, and that state oil company PDVSA incorporate cryptocurrencies in its dealings with foreign companies. \nThe country’s opposition said it is illegal to use oil reserves — of which Venezuela has the largest in the world — to issue debt. \nMaduro said the cryptocurrency issuance would take place via online exchanges, but he did not give further details. \nSome of the exchanges would work with bolivars, Venezuela’s collapsing local currency, while others would exchange other cryptocurrencies for the petro, said an adviser. \nThe petro will be pre-mined, meaning that unlike bitcoin, for example, new tokens cannot be created. This is the case with another popular cryptocurrency, ripple. \nThe document suggested the petro be a token on the Ethereum network, widely used by the cryptocurrency community. Its native coin is the ether, whose market capitalization is second only to bitcoin. Additional reporting by Corina Pons; Editing by Brian Ellsworth, Jeffrey Benkoe and David Gregorio", "external_links": [], "published": "2018-01-16T20:01:00.000+02:00", "crawled": "2018-01-16T20:16:15.006+02:00", "highlightTitle": ""}