{"organizations": [], "uuid": "edd70f8319470f017d4bab251b903b45ef6406c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/22/103407640-GettyImages-509147584.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/29/uber-enlists-its-drivers-in-the-fight-against-sex-trafficking.html", "country": "US", "domain_rank": 767, "title": "Uber enlists its drivers in the fight against sex trafficking", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.084, "site_type": "news", "published": "2018-01-29T18:40:00.000+02:00", "replies_count": 0, "uuid": "edd70f8319470f017d4bab251b903b45ef6406c6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/uber-enlists-its-drivers-in-the-fight-against-sex-trafficking.html", "ord_in_thread": 0, "title": "Uber enlists its drivers in the fight against sex trafficking", "locations": [], "entities": {"persons": [{"name": "tracey breeden", "sentiment": "none"}, {"name": "breeden", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "none"}, {"name": "global safety communications", "sentiment": "none"}, {"name": "human trafficking awareness month", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uber wants its drivers to help stop sex trafficking, an enduring problem that has prompted activists to press workers on the front lines of the travel industry to alert authorities if they see it happening.\nOver the past few years, Uber has enlisted its drivers in local and regional efforts to help fight human trafficking of adults and minors. But the new initiative, which begins Monday, at the end of Human Trafficking Awareness Month, targets all 750,000 active U.S. drivers and eventually will expand to other countries.\n\"This is a global problem that affects all our cities and communities, and we realized our drivers are uniquely positioned to make an impact,\" Tracey Breeden, a former police officer who spearheaded the program as Uber's Global Safety Communications lead, tells USA TODAY.\nBreeden says the expansion of the program to foreign markets will take time because \"we have to make it fit each country, with its own unique hotlines and support organizations, but that's definitely our goal.\"\nAmong Uber's partners in the U.S. initiative are The National Center for Missing and Exploited Children, anti-trafficking tech company Thorn, and The McCain Institute for International Leadership, whose efforts to battle human trafficking are led by Cindy McCain, the wife of Sen. John McCain (R-Ariz.).\nRead More from USA Today: \nHow to get your TV ready for Super Bowl Sunday \nWhat fare war? American CEO predicts higher fares \nGrammy Awards 2018: The winners' list \nThe new Uber program comes at a time when the ride-hailing company is trying to burnish its image after a year of reports on its toxic corporate culture and ethical lapses. An area of particular focus for new CEO Dara Khosrowshahi is drivers, who previously had a sour relationship with former CEO Travis Kalanick .\nUber has spent the past six months instituting a variety of driver-oriented changes ranging from establishing a hotline for questions to adding a tipping option.\nUnlike New York City taxi and limo drivers, who by law must watch a video on trafficking before being approved for service, nothing about the new Uber human trafficking awareness push is mandatory.\nWhen Uber drivers log on to the app, they will be presented with information that includes how to spot victims of trafficking and best practices for reporting tips to the police and anti-trafficking support groups such as Uber partner Polaris.\nThose tips include spotting clothing or behavior that seems inappropriate for the age; a younger rider displaying fearful emotions in the company of a fellow adult rider; tattoos that appear more like ownership branding than art; and ride requests that stop at multiple hotels for short durations.\nHuman trafficking experts say technology has made it easier for criminals to exploit victims by providing a global communications network and online payment options. But new digital-age conveniences such as Uber, which pimps may use to transport sex workers without themselves being seen, can be part of the solution.\n\"Drivers are the ones who will be able to get a sense of whether there is threatening behavior, so it's important they know what to do,\" says Bradley Miles, CEO of Polaris, who adds that reporting by Uber drivers can help the organization add critical information to its database of 40,000 cases.\nThere is evidence that a growing participation in this effort by a range of hospitality-oriented companies is helping make a dent in human trafficking, which affects some 21 million people worldwide, according to the International Labour Organization.\nBetween 2012 and 2016, the number of human trafficking cases logged and reporting calls made has roughly doubled to 7,600 and 26,700, respectively, according to the National Human Trafficking Hotline.\n\"It's not that we're having a moment, it's more that this is a movement,\" says Michelle Guelbart, director of private sector engagement at ECPAT-USA (which stands for End Child Prostitution and Trafficking). \"Over the past five years or so, we've developed an industry standard on training, and gotten more and more companies to take interest.\"\nGuelbart says that so far, 45 companies, including Uber, have collaborated with ECPAT to raise awareness. In the last year alone, roughly 86,000 travel company employees — working for the likes of Carlson Wagonlit, Delta Airlines and Hilton — were trained to spot human trafficking.\nECPAT's airline industry partners have trained 140,000 front line employees so far. American Airlines says it has run 60,000 of its employees through an online course. While declining to share statistics, American Airlines spokesman Matt Miller says \"there have been many instances where our staff has seen something and alerted authorities.\"\nIn fact, Uber drivers have done the same on their own initiative in Pennsylvania , Arizona and California . In Uber's online communication about its new program, the company highlights the story of Keith Avila, a driver in Sacramento, Calif., who in late 2016 gave a ride to three women.\nTwo older women started talking to the younger one about what sounded like an impending sex-for-money encounter. Avila dropped them off, but quickly called 911. Police officers arrived and made arrests. The girl, a runaway, was placed in alternative housing.\nSays Uber's Breeden: \"We have a lot of eyes and ears on the road, and if we can help just one child, it's worth it.\"", "external_links": ["https://www.usatoday.com/story/travel/flights/todayinthesky/2018/01/25/what-fare-war-american-ceo-predicts-higher-fares/1066078001/", "https://www.usatoday.com/story/life/music/2018/01/28/grammy-awards-2018-winners-list/1065641001/", "https://www.usatoday.com/story/tech/columnist/saltzman/2018/01/28/how-get-your-tv-ready-super-bowl-sunday/1071908001/"], "published": "2018-01-29T18:40:00.000+02:00", "crawled": "2018-01-29T17:52:39.004+02:00", "highlightTitle": ""}