{"organizations": [], "uuid": "5b15f4c28fa207b8a32b46e9f4a48e86999a9280", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-mid-penn-bancorp-inc-reports-2017-annual-earnings-and-continued-growth-in-assets-loans-and-deposits.html", "country": "US", "domain_rank": 767, "title": "Mid Penn Bancorp, Inc. Reports 2017 Annual Earnings and Continued Growth in Assets, Loans, and Deposits", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T01:16:00.000+02:00", "replies_count": 0, "uuid": "5b15f4c28fa207b8a32b46e9f4a48e86999a9280"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-mid-penn-bancorp-inc-reports-2017-annual-earnings-and-continued-growth-in-assets-loans-and-deposits.html", "ord_in_thread": 0, "title": "Mid Penn Bancorp, Inc. Reports 2017 Annual Earnings and Continued Growth in Assets, Loans, and Deposits", "locations": [], "entities": {"persons": [], "locations": [{"name": "millersburg", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "mid penn", "sentiment": "none"}], "organizations": [{"name": "mid penn bancorp, inc", "sentiment": "neutral"}, {"name": "mid penn bancorp, inc.", "sentiment": "neutral"}, {"name": "tcja", "sentiment": "none"}, {"name": "mid penn bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILLERSBURG, Pa., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Mid Penn Bancorp, Inc. (“Mid Penn”) (NASDAQ:MPB), the parent company of Mid Penn Bank (the “Bank”), today reported net income (earnings) of $7,089,000 or $1.67 per common share basic and diluted for the year ended December 31, 2017, compared to earnings of $7,804,000 or $1.85 per common share basic and diluted for the year ended December 31, 2016. For the three months ended December 31, 2017, Mid Penn’s earnings were $501,000 or $0.12 per common share basic and diluted, compared to earnings of $2,076,000 or $0.49 per common share basic and diluted for the same period in 2016. The full-year and fourth quarter earnings were negatively impacted by a non-cash reduction in the value of Mid Penn’s deferred tax asset which resulted in a charge of $1,169,000 included in the provision for income taxes. This income tax adjustment was a result of the Tax Cuts and Jobs Act (TCJA) enacted on December 22, 2017, which lowered Mid Penn’s future maximum corporate tax rate from 34 percent to 21 percent. Though the reduced rate will provide tax savings to Mid Penn in future periods, the reduction resulted in the $1,169,000 write-down of Mid Penn’s deferred tax asset, which was previously valued based upon the projection of a 34 percent future tax benefit. The full-year results also included $619,000 of merger expenses, most of which were not tax deductible.\nAdjusted 2017 earnings, when excluding the after-tax impact of the merger expenses and the deferred income asset charge (with such adjusted earnings being a non-GAAP measure), were $8,857,000 or $2.09 per share basic and diluted, representing a 13 percent increase compared to 2016’s full-year earnings per share of $1.85. There were no merger expenses or unusual tax charges in 2016. Non-GAAP adjusted earnings for the three months ended December 31, 2017, when excluding the after-tax impact of the merger-related expenses and the deferred tax asset charge, were $1,820,000 or $0.43 per common share basic and diluted. Please refer to the section included herein under the heading “Reconciliation of Non-GAAP Measures (Unaudited)” for a discussion of our use of non-GAAP adjusted financial information, which include tables reconciling GAAP and non-GAAP adjusted financial measures, for the periods ended December 31, 2017 and 2016.\nMid Penn also reported total assets of $1,170,354,000 as of December 31, 2017, an increase of $137,755,000 or 13 percent compared to total assets of $1,032,599,000 as of December 31, 2016. Mid Penn realized favorable loan growth, primarily in commercial relationships, of $96,480,000 or over 11 percent since December 31, 2016. This asset and loan growth was principally funded by an increase in deposits of $88,195,000 or over 9 percent since year-end 2016, with $40,903,000 of the deposit growth being in noninterest-bearing accounts.\nMERGER & ACQUISITION ACTIVITIES\nOn January 8, 2018, Mid Penn announced the successful completion of the legal acquisition of The Scottdale Bank & Trust Company (“Scottdale”), under which each share of Scottdale common stock issued and outstanding immediately prior to January 8, 2018 converted into the right to receive (i) $1,166 in cash without interest or (ii) 38.88 shares of Mid Penn common stock. As a result, Mid Penn issued approximately 1.9 million shares of Mid Penn common stock and cash of approximately $2.8 million in merger consideration. On a pro forma basis, after the Scottdale acquisition, Mid Penn will have approximately $1.4 billion in total assets.\nAdditionally, on January 16, 2018, Mid Penn entered into an Agreement and Plan of Merger (the “Merger Agreement”) with First Priority Financial Corp. (“First Priority”) pursuant to which First Priority will merge with and into Mid Penn (the “Merger”), with Mid Penn being the surviving corporation in the Merger. The acquisition will expand Mid Penn’s footprint into southeastern Pennsylvania, including Chester, Berks, Montgomery, and Bucks counties. On a pro forma basis, the combined company will have over $2 billion in total assets. Under the terms of the Merger Agreement, shareholders of First Priority will receive 0.3481 shares of Mid Penn common stock for each share of First Priority common stock they own. Subject to customary closing conditions including regulatory and shareholder approvals, it is expected that the Merger will be completed in the third quarter of 2018.\nPRESIDENT’S STATEMENT\nWe are pleased to report Mid Penn's financial results for the year ended December 31, 2017, which reflect continued growth in our core operating revenues, a double-digit percentage increase in total loans for the third straight year, and the majority of this growth funded by lower-cost deposits. That growth was enhanced by our continued commitment to strong asset quality as reflected by the fact that, for 2017, we experienced net loan recoveries, which helped us to reduce our required provisions to our Allowance for Loan Losses. Additionally, we recognized revenue increases from certain key noninterest income sources, including our trust and wealth management and small business lending functions.\nAs with many banks, our net income was adversely impacted by the large income tax charge from the write-down of our deferred tax asset as a result of the recently enacted Tax Cuts and Jobs Act. However, we expect this one-time non-cash charge will be more than offset in future years by the tax savings we will realize as our maximum federal income tax rate will decrease significantly from 34 percent to 21 percent. Furthermore, our 2017 results included substantial merger expenses related to the Scottdale acquisition, which was completed in January of 2018. Although these merger expenses negatively affected our results for 2017, we are confident that the investment we made in acquiring Scottdale will provide measurable benefits through increased profitability and growth for our franchise, particularly in the new offices and markets added in Western Pennsylvania.\nReflective of our core banking profitability and franchise growth, Mid Penn is proud to deliver another year of increased value and sound returns to our shareholders. Our common stock appreciated in price by $9.27 per common share during the twelve months ended December 31, 2017, with a closing price of $33.10 as of December 31, 2017. Additionally, shareholders who held our stock for the full year received $0.62 per share in cash dividends paid during 2017. Including both the stock price appreciation and cash dividends paid, the $9.89 of combined value reflects a 42% total annual return on the $23.83 closing price of Mid Penn common stock as of December 31, 2016.\nWe are driven to maintain our positive momentum in 2018. In addition to finalizing the Scottdale acquisition in January 2018, we proudly opened our newest branch as we re-established a full-service office in Halifax, PA. Additionally, on January 16, 2018, Mid Penn announced a proposed merger with First Priority Financial Corp., an institution based in southeastern Pennsylvania with an excellent banking reputation. The prospective merger with First Priority will provide us with the opportunity to expand into new and dynamic markets while adding a number of well-respected and talented employees. In both our legacy operations and these new markets, we will continue to pursue our core banking success through our demonstrated ability to develop and grow mutually beneficial relationships with our customers.\nWe remain focused on generating high quality loan and deposit relationships, supported by fee-based activities and effective integration of technology, all while ensuring a priority commitment to asset quality and customer service. By delivering the best possible banking products and services for our customers, we are confident that we will provide increased value and an attractive financial return for our shareholders.\nOPERATING RESULTS\nNet Interest Income and Net Interest Margin\nNet interest income was $37,588,000 for the year ended December 31, 2017, an increase of $2,743,000 or 8 percent compared to net interest income of $34,845,000 for the year ended December 31, 2016.\nFor the year ended December 31, 2017, Mid Penn’s tax-equivalent net interest margin was 3.68% compared to 3.82% for the year ended December 31, 2016. The decrease in the net interest margin year over year was attributed to both an increase in the cost of deposits and a lower yield earned on the investment portfolio. For the ended December 31, 2017, the overall investment portfolio yield was 2.36%, compared to an investment portfolio yield of 2.93% for the same period in 2016. The reduction was attributed to Mid Penn establishing a held-to-maturity investment portfolio including lower-risk and lower-yielding U.S. Treasury notes and U.S. agency mortgage-backed securities during 2017. The held-to-maturity portfolio was established to support the Bank’s growth in public fund deposit pledging requirements.\nNoninterest Income\nDuring the twelve months ended December 31, 2017, noninterest income was $5,693,000 reflecting a decrease of $231,000 or 4 percent compared to noninterest income of $5,924,000 for the twelve months ended December 31, 2016. Excluding net gains on sales of securities for both years, noninterest income increased $773,000 when comparing the twelve months ended December 31, 2017 to the prior year.\nMid Penn increased its origination and sales activities related to Small Business Administration (“SBA”) loans, resulting in gains of $800,000 from related loan sales during the year ended December 31, 2017, an increase of $330,000 or 70 percent compared to SBA loan sales gains of $470,000 for the twelve months ended December 31, 2016. More qualified small business borrowers continue to take advantage of Mid Penn’s Preferred Lender status with the SBA.\nIncome from fiduciary activities was $845,000 for the twelve months ended December 31, 2017, an increase of $364,000 or 76 percent compared to fiduciary income of $481,000 for the year ended December 31, 2016. These additional revenues were attributed to trust assets under management significantly increasing over the past twelve months as a result of successful business development efforts by Mid Penn’s expanded team of trust and retail investment officers.\nATM debit card interchange income was $937,000 for the twelve months ended December 31, 2017, an increase of $93,000 or 11 percent compared to interchange income of $844,000 for the same period in 2016. The additional income is a result of an increased volume of transactional checking accounts and an increase in Mid Penn Bank ATM debit card transactions across our market area.\nNet gains on sales of securities were $42,000 for the twelve months ended December 31, 2017, a decrease of $1,004,000 or 96 percent compared to net gains on sales of securities of $1,046,000 during the year ended December 31, 2016. During 2016, Mid Penn took advantage of favorable fixed income investment market conditions and increased fair values on several securities to reposition some of its investment portfolio, including selling a large volume of longer-term and rate-sensitive CMOs, as well as certain municipal bonds and agency notes.\nNoninterest Expense\nDuring the year ended December 31, 2017, noninterest expenses totaled $31,367,000, an increase of $2,549,000 or 9 percent compared to noninterest expenses of $28,818,000 for the year ended December 31, 2016.\nSalaries and employee benefits expense increased $1,365,000 or 9 percent during the twelve months ended December 31, 2017, versus the same period in 2016, with the increase attributable to (i) the addition of commercial lending personnel and credit support staff in alignment with Mid Penn’s core banking growth and expanding markets, (ii) retail staff additions at the New Holland and Orwigsburg locations which opened in 2017 and the Oregon Pike location opened in late 2016, and (iii) an increased volume of covered employees and healthcare claims as Mid Penn maintains a self-funded medical plan as part of a consortium.\nIn connection with the acquisition of Scottdale, Mid Penn incurred $619,000 of merger related expenses during 2017, while no merger related expenses were incurring in 2016.\nOccupancy expenses increased $448,000 or 22 percent during the year ended December 31, 2017 compared to the same period in 2016. In the twelve months since December 31, 2016, Mid Penn added facility operating costs associated with opening the above-noted three new branch offices, as well as incurring full-year costs for loan production offices opened during 2016 in Lancaster and Franklin Counties in Pennsylvania.\nMid Penn’s FDIC assessment costs were $792,000 during the twelve months ended December 31, 2017, an increase of $104,000 or 15 percent compared to the FDIC assessment of $688,000 for the twelve months ended December 31, 2016. The increase is due to Mid Penn’s growth in deposits and assets, which increased the base amount used to determine the FDIC insurance assessment.\nLegal and professional fees for the twelve months ended December 31, 2017 increased by $91,000 or 13 percent compared to the same period in 2016 due to increased third-party services for wealth management, audit, and public relations activities.\nPennsylvania bank shares tax expense decreased $197,000 or 30 percent during the twelve months ended December 31, 2017 versus the same period in 2016, due to the additional Pennsylvania-eligible tax credits generated from Mid Penn’s increased level of charitable donations to support education and community development organizations throughout the markets it serves. The increased amount of charitable contributions supported part of the increase in Other Expenses.\nFINANCIAL CONDITION\nLoans\nTotal loans at December 31, 2017 were $910,404,000 compared to $813,924,000 at December 31, 2016, an increase of $96,480,000 or over 11 percent. The majority of Mid Penn’s loan portfolio and growth continues to be commercial loans, including both commercial and industrial financing, and commercial real estate credits.\nDeposits\nTotal deposits increased $88,195,000 or over 9 percent, from $935,373,000 at December 31, 2016 to $1,023,568,000 at December 31, 2017, due to both retail branch deposit growth and cash management sales efforts.\nInvestments\nDuring 2017, Mid Penn added a held-to-maturity pool to its overall investment portfolio, and as of December 31, 2017, had $101,356,000 of held-to-maturity securities recorded at amortized cost. No securities were designated as held-to-maturity at December 31, 2016. Mid Penn’s total available-for-sale securities portfolio decreased $40,160,000 or 30 percent, from $133,625,000 at December 31, 2016 to $93,465,000 at December 31, 2017, as some available-for-sale investments were sold to fund both the held-to-maturity pool and loan growth.\nCapital\nShareholders’ equity increased by $5,236,000 or 7 percent, from $70,467,000 at December 31, 2016 to $75,703,000 at December 31, 2017. The increase during the twelve months ended December 31, 2017 was attributed to both (i) growth in retained earnings through year-to-date net income and (ii) other comprehensive income primarily due to the after-tax unrealized appreciation in the value of the available-for-sale investment portfolio since December 31, 2016. Regulatory capital ratios for both Mid Penn and the Bank exceeded regulatory “well-capitalized” levels at both December 31, 2017 and 2016.\nASSET QUALITY\nTotal nonperforming assets were $11,308,000 at December 31, 2017, compared to $5,759,000 at December 31, 2016 and $6,062,000 at December 31, 2015. The ratio of nonperforming assets to total loans and other real estate was 1.24% as of December 31, 2017, compared to 0.71% as of December 31, 2016, and 0.82% as of December 31, 2015. The increase in nonperforming assets is primarily due to two loan relationships totaling $7.3 million, with a combined $150,000 specific allowance allocation, being placed on nonaccrual status during the latter six months of 2017. Mid Penn had net loan recoveries of $98,000 for the twelve months ended December 31, 2017, compared to net loan charge-offs of $855,000 during the same period of 2016. The net recoveries were a result of Mid Penn’s successful collection and workout efforts on previously impaired loan relationships.\nBased upon its analysis of loan and lease loss allowance adequacy, management recorded a $325,000 loan loss provision for the year ended December 31, 2017, compared to $1,870,000 for the year ended December 31, 2016. The significant net principal recoveries during the twelve months ended December 31, 2017 added $98,000 to the allowance for loan loss balance. Also, as a result of favorable workout activities of certain impaired credits, the amount of required specific allocations in the allowance was reduced as of December 31, 2017 as compared to the prior year end. The allowance for loan and lease losses as a percentage of total loans was 0.84% at December 31, 2017, compared to 0.88% at December 31, 2016, and 0.84% at December 31, 2015. Loan loss reserves as a percentage of nonperforming loans were 68% at December 31, 2017, compared to 130% at December 31, 2016, and 126% at December 31, 2015. Management believes, based on information currently available, that the allowance for loan and lease losses of $7,606,000 is adequate as of December 31, 2017 to cover probable and estimated loan losses in the portfolio.\nFINANCIAL HIGHLIGHTS (Unaudited): (Dollars in thousands, except per share data) December 31, December 31, Change 2017 2016 $ % Total Assets $ 1,170,354 $ 1,032,599 $ 137,755 13.3 % Total Loans 910,404 813,924 96,480 11.9 % Total Deposits 1,023,568 935,373 88,195 9.4 % Total Equity 75,703 70,467 5,236 7.4 % Book Value per Share 17.85 16.65 1.20 7.2 % Tangible Book Value per Share * 16.82 15.59 1.23 7.9 % * Non-GAAP measure; see Reconciliation of Non-GAAP Measures\nOPERATING HIGHLIGHTS (Unaudited): Three Months Ended Years Ended (Dollars in thousands, except December 31, Change December 31, Change per share data) 2017 2016 $ % 2017 2016 $ % Net Interest Income $ 9,487 $ 9,129 $ 358 3.9 % $ 37,588 $ 34,845 $ 2,743 7.9 % Net Income $ 501 $ 2,076 $ (1,575 ) -75.9 % $ 7,089 $ 7,804 $ (715 ) -9.2 % Basic Earnings per Common Share $ 0.12 $ 0.49 $ (0.37 ) -75.5 % $ 1.67 $ 1.85 $ (0.18 ) -9.7 % Adjusted Earnings per Common Share * $ 0.43 $ 0.49 $ (0.06 ) -12.5 % $ 2.09 $ 1.85 $ 0.25 13.3 % Return on Average Equity 2.58 % 11.19 % N/A -76.9 % 9.48 % 10.71 % N/A -11.5 % * Non-GAAP measure; see Reconciliation of Non-GAAP Measures\nCAPITAL RATIOS (Unaudited): To Be Well-Capitalized Under Prompt Corrective Action December 31, 2017 December 31, 2016 Provisions: Leverage Ratio 6.5 % 6.8 % 5.0 % Common Tier 1 Capital (to Risk Weighted Assets) 8.5 % 9.1 % 6.5 % Tier 1 Capital (to Risk Weighted Assets) 8.5 % 9.1 % 8.0 % Total Capital (to Risk Weighted Assets) 11.3 % 11.0 % 10.0 % RECONCILIATION OF NON-GAAP MEASURES (Unaudited:)\nThis press release contains financial information determined by methods other than in accordance with U.S. Generally Accepted Accounting Principles (\"GAAP\"). For tangible book value, the most directly comparable financial measure calculated in accordance with GAAP is our book value. We believe that this measure is important to many investors in the marketplace who are interested in changes from period to period in book value per common share exclusive of changes in intangible assets. Goodwill and other intangible assets have the effect of increasing total book value while not increasing our tangible book value. We believe earnings per share excluding the after-tax impact of merger-related expenses and the adjustment of the deferred tax asset provides important supplemental information in evaluating Mid Penn’s operating results because these charges are not incurred as a result of ongoing operations. Income tax effects of non-GAAP adjustments are calculated using the applicable statutory tax rate for the jurisdictions in which the charges (benefits) are incurred, while taking into consideration any valuation allowances or non-deductible portions of the non-GAAP adjustments. This non-GAAP disclosure has limitations as an analytical tool, should not be viewed as a substitute for financial measures determined in accordance with GAAP, and should not be considered in isolation or as a substitute for analysis of Mid Penn’s results and financial condition as reported under GAAP, nor is it necessarily comparable to non-GAAP performance measures that may be presented by other companies. Management believes that this non-GAAP supplemental information will be helpful in understanding Mid Penn’s ongoing operating results. This supplemental presentation should not be construed as an inference that Mid Penn’s future results will be unaffected by similar adjustments to be determined in accordance with GAAP.\nRECONCILIATION OF NON-GAAP MEASURES, CONTINUED (Unaudited:)\nTangible Book Value per Share December 31, December 31, (Dollars in thousands, except per share data) 2017 2016 Shareholder's Equity $ 75,703 $ 70,467 Less: Goodwill 3,918 3,918 Less: Core Deposit and Other Intangibles 434 539 Tangible Equity $ 71,351 $ 66,010 Common Shares Issued and Outstanding 4,242,216 4,233,297 Tangible Book Value per Share $ 16.82 $ 15.59\nEarnings Per Share Excluding Non-Recurring Expenses Three Months Ended Years Ended December 31, December 31, (Dollars in thousands, except per share data) 2017 2016 2017 2016 Net Income $ 501 $ 2,076 $ 7,089 $ 7,804 Plus: Merger and Acquisition Expenses 152 - 619 - Less: Tax Effect of Merger and Acquisition Expenses 2 - 20 - Plus: Adjustment of Deferred Tax Asset 1,169 - 1,169 - Net Income Excluding Non-Recurring Expenses $ 1,820 $ 2,076 $ 8,857 $ 7,804 Weighted Average Shares Outstanding - denominator 4,240,802 4,232,191 4,236,616 4,229,284 Earnings Per Share Excluding Non-Recurring Expenses $ 0.43 $ 0.49 $ 2.09 $ 1.85\nCONSOLIDATED BALANCE SHEETS (Unaudited): (Dollars in thousands) December 31, 2017 December 31, 2016 ASSETS Cash and due from banks $ 19,795 $ 13,493 Interest-bearing balances with other financial institutions 3,028 2,003 Federal funds sold 691 30,477 Total cash and cash equivalents 23,514 45,973 Investment securities available for sale 93,465 133,625 Investment securities held to maturity, at amortized cost (fair value $100,483 and $0) 101,356 — Loans held for sale 1,040 1,959 Loans and leases, net of unearned interest 910,404 813,924 Less: Allowance for loan and lease losses (7,606 ) (7,183 ) Net loans and leases 902,798 806,741 Bank premises and equipment, net 16,168 11,074 Bank premises and equipment held for sale — 1,894 Cash surrender value of life insurance 13,042 12,780 Restricted investment in bank stocks 4,384 2,443 Foreclosed assets held for sale 189 224 Accrued interest receivable 4,564 3,928 Deferred income taxes 1,888 4,286 Goodwill 3,918 3,918 Core deposit and other intangibles, net 434 539 Other assets 3,594 3,215 Total Assets $ 1,170,354 $ 1,032,599 LIABILITIES & SHAREHOLDERS’ EQUITY Deposits: Noninterest-bearing demand $ 163,714 $ 122,811 Interest-bearing demand 349,241 317,533 Money Market 246,220 252,271 Savings 62,770 60,163 Time 201,623 182,595 Total Deposits 1,023,568 935,373 Short-term borrowings 34,611 — Long-term debt 12,352 13,581 Subordinated debt 17,338 7,414 Accrued interest payable 645 515 Other liabilities 6,137 5,249 Total Liabilities 1,094,651 962,132 Shareholders' Equity: Common stock, par value $1.00; authorized 10,000,000 shares; 4,242,216 and\n4,233,297 shares issued and outstanding at December 31, 2017 and December 31, 2016,\nrespectively 4,242 4,233 Additional paid-in capital 40,970 40,688 Retained earnings 32,224 28,399 Accumulated other comprehensive loss (1,733 ) (2,853 ) Total Shareholders’ Equity 75,703 70,467 Total Liabilities and Shareholders' Equity $ 1,170,354 $ 1,032,599\nCONSOLIDATED STATEMENTS OF INCOME (Unaudited): (Dollars in thousands, except per share data) Years Ended December 31, 2017 2016 2015 INTEREST INCOME Interest and fees on loans and leases $ 40,156 $ 36,402 $ 32,840 Interest on interest-bearing balances 18 12 44 Interest and dividends on investment securities: U.S. Treasury and government agencies 2,273 1,346 1,222 State and political subdivision obligations, tax-exempt 1,113 2,066 2,000 Other securities 217 304 382 Interest on federal funds sold 115 82 2 Total Interest Income 43,892 40,212 36,490 INTEREST EXPENSE Interest on deposits 5,463 4,514 3,889 Interest on short-term borrowings 111 15 47 Interest on long-term and subordinated debt 730 838 671 Total Interest Expense 6,304 5,367 4,607 Net Interest Income 37,588 34,845 31,883 PROVISION FOR LOAN AND LEASE LOSSES 325 1,870 1,065 Net Interest Income After Provision for Loan and Lease Losses 37,263 32,975 30,818 NONINTEREST INCOME Income from fiduciary activities 845 481 466 Service charges on deposits 721 684 690 Net gain on sales of investment securities 42 1,046 325 Earnings from cash surrender value of life insurance 262 264 269 Mortgage banking income 872 922 456 ATM debit card interchange income 937 844 741 Merchant services income 335 317 235 Net gain on sales of SBA loans 800 470 252 Other income 879 896 679 Total Noninterest Income 5,693 5,924 4,113 NONINTEREST EXPENSE Salaries and employee benefits 16,929 15,564 14,043 Occupancy expense, net 2,512 2,064 1,947 Equipment expense 1,536 1,689 1,477 Pennsylvania Bank Shares Tax expense 451 648 408 FDIC Assessment 792 688 613 Legal and professional fees 802 711 588 Marketing and advertising expense 516 500 533 Software licensing 1,458 1,380 1,472 Telephone expense 497 548 569 Loss on sale or write-down of foreclosed assets 88 217 111 Intangible amortization 104 126 114 Merger and acquisition expense 619 - 762 Other expenses 5,063 4,683 4,122 Total Noninterest Expense 31,367 28,818 26,759 INCOME BEFORE PROVISION FOR INCOME TAXES 11,589 10,081 8,172 Provision for income taxes 4,500 2,277 1,644 NET INCOME 7,089 7,804 6,528 Series B preferred stock dividends and redemption premium — — 473 Series C preferred stock dividends — — 17 NET INCOME AVAILABLE TO COMMON SHAREHOLDERS $ 7,089 $ 7,804 $ 6,038 PER COMMON SHARE DATA: Basic and Diluted Earnings Per Common Share $ 1.67 $ 1.85 $ 1.47 Cash Dividends Declared 0.77 0.68 0.44 Management considers subsequent events occurring after the balance sheet date for matters which may require adjustment to, or disclosure in, the consolidated financial statements. The review period for subsequent events extends up to and including the filing date of a public company’s consolidated financial statements when filed with the Securities and Exchange Commission (“SEC”). Accordingly, the financial information in this announcement is subject to change. The statements are valid only as of the date hereof and Mid Penn Bancorp, Inc. disclaims any obligation to update this information.\nSPECIAL CAUTIONARY NOTICE REGARDING FORWARD-LOOKING STATEMENTS\nThis press release, and oral statements made regarding the subjects of this release, contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's current views and expectations about new and existing programs and products, relationships, opportunities, technology and market conditions. These statements may be identified by such forward-looking terminology as \"continues,\" \"expect,\" \"look,\" \"believe,\" \"anticipate,\" \"may,\" \"will,\" \"should,\" \"projects,\" \"strategy\" or similar statements. Actual results may differ materially from such forward-looking statements, and no reliance should be placed on any forward-looking statement. Factors that may cause results to differ materially from such forward-looking statements include, but are not limited to, changes in interest rates, spreads on earning assets and interest-bearing liabilities, and interest rate sensitivity; prepayment speeds, loan originations, credit losses and market values on loans, collateral securing loans, and other assets; sources of liquidity; common shares outstanding; common stock price volatility; fair value of and number of stock-based compensation awards to be issued in future periods; the impact of changes in market values on securities held in Mid Penn’s portfolio; legislation affecting the financial services industry as a whole, and Mid Penn and Mid Penn Bank individually or collectively, including tax legislation; regulatory supervision and oversight, including monetary policy and capital requirements; changes in accounting policies or procedures as may be required by the Financial Accounting Standards Board or regulatory agencies; increasing price and product/service competition by competitors, including new entrants; rapid technological developments and changes; the ability to continue to introduce competitive new products and services on a timely, cost-effective basis; the mix of products/services; containing costs and expenses; governmental and public policy changes; protection and validity of intellectual property rights; reliance on large customers; technological, implementation and cost/financial risks in large, multi-year contracts; the outcome of future litigation and governmental proceedings, including tax-related examinations and other matters; continued availability of financing; financial resources in the amounts, at the times and on the terms required to support Mid Penn and Mid Penn Bank’s future businesses; the impact of Mid Penn’s announced combination with The Scottdale Bank & Trust Company; and material differences in the actual financial results of merger, acquisition and investment activities compared with Mid Penn’s initial expectations, including the full realization of anticipated cost savings and revenue enhancements. For a list of other factors which would affect our results, see Mid Penn’s filings with the SEC, including those risk factors identified in the \"Risk Factors\" section and elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2016. The statements in this press release are made as of the date of this press release, even if subsequently made available by Mid Penn on its website or otherwise. Mid Penn assumes no obligation for updating any such forward-looking statements at any time, except as required by law.\nCONTACTS Rory G. Ritrievi President & Chief Executive Officer 1-866-642-7736 Michael D. Peduzzi, CPA Chief Financial Officer 1-866-642-7736\nSource:Mid Penn Bancorp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c01160c9-6d5d-4841-a2b6-d69ec126a06c"], "published": "2018-01-27T01:16:00.000+02:00", "crawled": "2018-01-27T02:05:02.002+02:00", "highlightTitle": ""}