{"organizations": [], "uuid": "63cbae79871d3288ebd39eb6a674248509f3bc34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225971443&w=1200&r=LYNXMPEE0R05G", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-cricket-test-zaf-ind-kohli/cricket-positives-for-both-sides-south-africa-grapple-with-pitch-woes-idUSKBN1FH06I", "country": "US", "domain_rank": 408, "title": "Cricket: Positives for both sides, South Africa grapple with pitch woes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-28T16:14:00.000+02:00", "replies_count": 0, "uuid": "63cbae79871d3288ebd39eb6a674248509f3bc34"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cricket-test-zaf-ind-kohli/cricket-positives-for-both-sides-south-africa-grapple-with-pitch-woes-idUSKBN1FH06I", "ord_in_thread": 0, "title": "Cricket: Positives for both sides, South Africa grapple with pitch woes", "locations": [], "entities": {"persons": [{"name": "virat kohli", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South Africa’s triumph in their home test series against India was a tale of three pitches as the ball dominated the bat and the tourists made a statement about their ability to win in all conditions.\nSouth Africa claimed victory in the first two tests in Cape Town and Pretoria, before India triumphed in what will be much more than a mere consolation success on a spiteful wicket in Johannesburg.\n”This is one of our sweetest wins,“ India captain Virat Kohli told reporters. ”This day will be remembered for a long time for us as a team. We already had the belief but now we have the result to back that as well.\n“South Africa played better than us in the first two games so they deserved to win but we deserved to win this game. At many moments in the first two games we put them under pressure.”\nIn a series between top-ranked India and second-placed South Africa that had just one century scored in 12 completed innings, and in which all 120 wickets were taken, it was a massive test of grit, application and guts, and both teams will take positives.\nIndia also ensured they will retain the number one ranking past the April cut-off date for this year, which will earn them $1 million as a reward.\nThe Newlands wicket for the first test was what South Africa had been calling for, pace and bounce, and their bowlers had too much skill for the tourists.\nCricket - India v South Africa - Third Test match - The Wanderers Stadium, Johannesburg, South Africa - January 27, 2018. South Africa’s Vernon Philander is bowled out by Mohammed Shami. REUTERS/James Oatway The second test was quite the opposite, a track that was more Pune than Pretoria, suiting India. When the post-mortem on the series is done, it is this match they will look back on and feel they let victory slip from their fingers.\nA flat South Africa pitched up for the third game in Johannesburg on a snake-pit that saw balls spitting up off a good length.\nCricket - India v South Africa - Third Test match - The Wanderers Stadium, Johannesburg, South Africa - January 27, 2018. South Africa’s Dean Elgar plays a shot. REUTERS/James Oatway The fact that India were able to come away from the game with a 63-run victory is a massive credit to the players, who are often criticized for their inability to handle conditions outside of the sub-continent.\nPITCH PERFECT South Africa’s issue will be the how to prepare pitches that are a more even contest between bat and ball, with a four-match home series looming against Australia in March.\n“We never asked for something excessive. We never asked for extra grass. All we asked for was a typical South African wicket that has pace and bounce,” captain Faf du Plessis said.\n“So we’re pretty disappointed with that. It’s disappointing to see that once again we’re not getting it right. I don’t know how to answer it or how to change it, but it obviously needs to improve.”\nReporting By Nick Said; Editing by Amlan Chakraborty\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T16:14:00.000+02:00", "crawled": "2018-01-28T14:08:35.016+02:00", "highlightTitle": ""}