{"organizations": [], "uuid": "daa9e1be180761b16e108fd71e7b9b3b0fac8374", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/16/104846367-GettyImages-492663408.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/31/stocks-making-the-biggest-moves-premarket-ba-antm-adp-lly-avy-xrx-ea-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: BA, ANTM, ADP, LLY, AVY, XRX, EA & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:05:00.000+02:00", "replies_count": 0, "uuid": "daa9e1be180761b16e108fd71e7b9b3b0fac8374"}, "author": "Peter Schacknow", "url": "https://www.cnbc.com/2018/01/31/stocks-making-the-biggest-moves-premarket-ba-antm-adp-lly-avy-xrx-ea-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: BA, ANTM, ADP, LLY, AVY, XRX, EA & more", "locations": [], "entities": {"persons": [{"name": "avery dennison", "sentiment": "none"}], "locations": [], "organizations": [{"name": "avy", "sentiment": "negative"}, {"name": "boeing", "sentiment": "negative"}, {"name": "adp", "sentiment": "negative"}, {"name": "ea &", "sentiment": "negative"}, {"name": "ba", "sentiment": "negative"}, {"name": "eli lilly", "sentiment": "none"}, {"name": "lilly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nBoeing – The jet maker earned an adjusted $3.06 per share for the fourth quarter, beating estimates of $2.89 a share. The company's revenue also beat forecasts and Boeing gave an upbeat earnings forecast for 2018.\nAnthem – The health insurer beat estimates by 2 cents a share , with adjusted quarterly profit of $1.29 per share. Revenue also beat forecasts. Anthem was helped by higher membership numbers and increased premiums. The company also raised its quarterly dividend by 5 cents a share to 75 cents per share.\nADP – The payroll processing and human resources company earned $1.05 for its latest quarter , 15 cents a share above estimates. ADP's revenue also topped expectations and the company raised its full-year earnings forecast.\nEli Lilly – The drugmaker came in 7 cents a share above estimates , with adjusted quarterly profit of $1.14 per share. Revenue beat estimates as new diabetes and psoriasis treatments sold well. Lilly also raised its 2018 full-year forecast.\nAvery Dennison – The maker of labeling materials earned an adjusted $1.33 per share for its latest quarter, 8 cents a share above estimates. Revenue also topped forecasts and the company gave an upbeat 2018 forecast on strong results across all its businesses.\nXerox – Xerox will be absorbed into its joint venture with Japan's Fujifilm , under a new agreement struck between the two companies. The new entity will be known as Fuji Xerox and keep its New York Stock Exchange Listing. Current Xerox shareholders will receive $9.80 per share in cash in the form of a special dividend.\nElectronic Arts – Electronic Arts reported adjusted quarterly profit of $2.18 per share, missing estimates by a penny, with the videogame publisher's revenue also slightly below estimates. However, the company also gave stronger than expected guidance for the current quarter, with the launch of its \"UFC 3\" game set for later this week.\nApple – Apple was downgraded to \"market perform\" from \"outperform\" at BMO Capital, which is considered that a secular change for the worse is in store for the iPhone.\nFoot Locker – Foot Locker was upgraded to \"outperform\" from \"perform\" at Oppenheimer, which cites a cheap valuation for the athletic footwear and apparel retailer's shares and the likelihood of increased sales momentum from new Nike offerings.\nAdvanced Micro Devices – AMD beat estimates by 3 cents a share, with adjusted quarterly profit of 8 cents per share. The chipmaker's revenue also topped forecasts, as well as its current-quarter guidance.\nAlign Technology – Align reported adjusted quarterly profit of $1.19 per share, well above the 96 cent a share consensus estimate. The maker of Invisalign dental braces also saw revenue beat forecasts.\nShutterfly – Shutterfly came in 23 cents above estimates, with adjusted quarterly profit of $3.11 per share. The online photo service's revenue was also above forecasts. Shutterfly reported weaker-than-expected guidance for the current quarter, however, but is forecasting strong full-year results.\nWynn Resorts – The casino operator's stock remains on watch following news that Nevada regulators are conducting an investigation into the sexual misconduct charges against CEO Steve Wynn, which he has denied.\nJuniper Networks – Juniper came in a penny a share above estimates, with adjusted quarterly profit of 53 cents per share. Revenue for the networking equipment maker was slightly above forecasts, however the company also gave a current-quarter earnings and revenue forecast that came in well below current Street consensus. Juniper also announced an 80 percent dividend hike, to 18 cents per share, and announced a new $2 billion stock buyback program.\nThomson Reuters – The company agreed to sell a majority stake in its financial information and terminal business to private equity firm Blackstone (BX) for $17 billion. Reports Tuesday had indicated that the two sides were close to striking a deal.", "external_links": [], "published": "2018-01-31T16:05:00.000+02:00", "crawled": "2018-01-31T15:27:25.000+02:00", "highlightTitle": ""}