{"organizations": [], "uuid": "755dee350cfd5ac49961ba3d24bc8816dbbd87a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-eases-limited-reaction-to-trumps-address-idUSL4N1PQ1Y8", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar index eases, limited reaction to Trump's address", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.504, "site_type": "news", "published": "2018-01-31T11:40:00.000+02:00", "replies_count": 0, "uuid": "755dee350cfd5ac49961ba3d24bc8816dbbd87a8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-eases-limited-reaction-to-trumps-address-idUSL4N1PQ1Y8", "ord_in_thread": 0, "title": "FOREX-Dollar index eases, limited reaction to Trump's address", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "masayuki kitano", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar eases vs basket of major currencies\n* Limited reaction to Trump’s State of the Union address\n* Yen slips after BOJ increases buying of medium-term bonds (Updates prices, adds comments)\nBy Masayuki Kitano\nSINGAPORE, Jan 31 (Reuters) - The dollar inched lower against a basket of major rivals on Wednesday, showing scant reaction so far to U.S. President Donald Trump’s State of the Union address.\nIn his speech, Trump urged bitterly divided Republicans and Democrats to work toward compromises on immigration and infrastructure after a bruising year of partisan battles that centred on Trump’s leadership.\nThe dollar index, which measures the greenback against a basket of six major currencies, was last down 0.1 percent on the day at 89.062 , staying above a three-year low around 88.43 set last week.\nThe euro edged up 0.2 percent to $1.2426.\nThe yen was on the backfoot, after the Bank of Japan increased its buying of medium-term Japanese government bonds (JGBs) in a move seen as a warning shot against further rises in bond yields.\nThe dollar tacked on 0.1 percent to 108.87 yen, having risen to as high as 109.095 yen after the BOJ announcement.\nThe BOJ’s move came after the 10-year JGB yield had risen to a 6-1/2-month high of 0.095 percent on Tuesday. The central bank’s policy guidance is to control the 10-year yield “around zero percent.”\nBOJ officials have said that any changes to bond-buying operations are fine-tuning and not meant to telegraph hints on its future policy.\nStill, some market participants probably interpreted the increase in JGB buying as a signal that the central bank will stick with its monetary stimulus, said Teppei Ino, an analyst for Bank of Tokyo-Mitsubishi UFJ in Singapore.\n“The 10-year JGB yield had almost touched 0.1 percent yesterday, so there was a focus on how they would try to rein in that move,” Ino said.\nA reduction in the BOJ’s buying of long-dated government bonds earlier this month had sparked speculation that the central bank was moving toward an eventual exit from its large stimulus, giving a lift to the yen.\nThe focus now shifts to the U.S. Federal Reserve’s monetary policy statement due later on Wednesday, and a U.S. jobs report on Friday that will include data on nonfarm payrolls and average hourly earnings.\nThe Fed is widely expected to keep interest rates unchanged this week, and investors will be looking to its policy statement for fresh hints on the outlook for interest rates this year.\nThe Fed probably won’t make major changes to its assessment of the economic and inflation outlook at this stage, said Roy Teo, investment strategist for LGT Bank in Singapore, adding that any material changes are likely to be “further down the road”.\nSince market participants already seem to be bracing for the possibility of three U.S. interest rate hikes this year, the chances of the dollar getting a lift from the Fed’s forthcoming policy statement appear low, Teo added. (Reporting by Masayuki Kitano; Editing by Eric Meijer)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T11:40:00.000+02:00", "crawled": "2018-01-31T16:48:21.038+02:00", "highlightTitle": ""}