{"organizations": [], "uuid": "4221a58d2c948bf7fe8e2120c00d7e8152c87afe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224060928&w=1200&r=LYNXMPEE0L0DD", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-shutdown/u-s-government-workers-awake-to-shutdown-senate-vote-looms-idUKKBN1FB0IF", "country": "US", "domain_rank": 408, "title": "U.S. government workers awake to shutdown, Senate vote looms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:07:00.000+02:00", "replies_count": 0, "uuid": "4221a58d2c948bf7fe8e2120c00d7e8152c87afe"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-shutdown/u-s-government-workers-awake-to-shutdown-senate-vote-looms-idUKKBN1FB0IF", "ord_in_thread": 0, "title": "U.S. government workers awake to shutdown, Senate vote looms", "locations": [], "entities": {"persons": [{"name": "amanda", "sentiment": "negative"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "becker", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:07 AM / Updated 26 minutes ago U.S. senators forge deal to end government shutdown Susan Cornwell , Richard Cowan 5 Min Read \nWASHINGTON (Reuters) - U.S. senators struck a deal on Monday to lift a three-day government shutdown as Democrats agreed to end the standoff in exchange for President Donald Trump’s Republicans promising a debate on the future of young illegal immigrants. \nLegislation to renew government funding easily cleared a procedural hurdle in the Senate and was expected to pass both the Senate and House of Representatives, allowing government to reopen through Feb 8. \nMost Democratic lawmakers had initially opposed the funding bill, demanding that the Senate also approved protections for young undocumented immigrants known as “Dreamers.” \nDemocratic leaders -- worried about being blamed for a disruptive shutdown -- accepted a Republican promise to hold a full Senate debate over immigration and the 700,000 Dreamers who were brought to the United States illegally as children. \nTrump took a new swipe at Democrats as he celebrated. \n“I am pleased that Democrats in Congress have come to their senses,” Trump said in a statement. “We will make a long term deal on immigration if and only if it’s good for the country.” \nTens of thousands of federal workers had begun closing down operations for lack of funding on Monday, the first weekday since the shutdown, but essential services such as security and defense operations had continued. \nThe shutdown undercut Trump’s self-crafted image as a dealmaker who would repair the broken culture in Washington. \nIt had forced Trump to cancel a planned weekend trip to his Mar-a-Lago estate in Florida and created uncertainty around his scheduled trip this week to the World Economic Forum in Davos, Switzerland. \nAlthough Trump stayed in Washington, the deal to reopen the government was cut without him. \nThe U.S. government cannot fully operate without funding bills that are voted in Congress regularly. Washington has been hampered by frequent threats of a shutdown in recent years as the two parties fight over spending, immigration and other issues. The last U.S. government shutdown was in 2013. \nBoth sides in Washington had tried to blame each other for this shutdown. LIBERALS ANGRY U.S. Senate Majority Leader Mitch McConnell (R-KY) gestures to reporters after lawmakers struck a deal to reopen the federal government three days into a shutdown on Capitol Hill in Washington, U.S., January 22, 2018. REUTERS/Leah Millis \nSome liberal groups were infuriated by the decision to reopen the government. \n“Today’s cave by Senate Democrats - led by weak-kneed, right-of-center Democrats - is why people don’t believe the Democratic Party stands for anything,” said Stephanie Taylor, co-founder of the Progressive Change Campaign Committee. \nTrump was expected to sign the legislation, which would give Congress more time to try to reach agreement on a long-term spending bill that would resolve issues including immigration, border security and spending caps. \nHouse of Representatives Republicans have been told by their leaders to plan on voting on re-opening the government immediately. Slideshow (14 Images) \nMarkets have absorbed the shutdown drama over the last week. \nU.S. stocks advanced on Monday as each of Wall Street’s main indexes touched a record intraday level after the shutdown deal. \n“The only way politics affects what the market does is if they end of having a negative impact on the economy and corporate earnings and so far that hasn’t been the case,” said Michael Arone, Chief Investment Strategist at State Street Global Advisors in Boston. \nA bipartisan group of more than a dozen senators, led by Republican Susan Collins of Maine and Democrat Joe Manchin of West Virginia, crowded in front of an ornate 19th century clock in a hallway outside the Senate chamber to claim credit for the breakthrough and pledge their interest in overcoming partisan gridlock. Related Coverage", "external_links": [], "published": "2018-01-22T08:07:00.000+02:00", "crawled": "2018-01-22T08:24:36.056+02:00", "highlightTitle": ""}