{"organizations": [], "uuid": "d7b2b2d8f800648b837f94145d9c30ec734c1739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-romania-government/romanian-mp-targeted-by-prosecutors-named-to-head-eu-funds-ministry-idUSKBN1FF23P", "country": "US", "domain_rank": 408, "title": "Romanian MP targeted by prosecutors named to head EU funds ministry", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:42:00.000+02:00", "replies_count": 0, "uuid": "d7b2b2d8f800648b837f94145d9c30ec734c1739"}, "author": "", "url": "https://www.reuters.com/article/us-romania-government/romanian-mp-targeted-by-prosecutors-named-to-head-eu-funds-ministry-idUSKBN1FF23P", "ord_in_thread": 0, "title": "Romanian MP targeted by prosecutors named to head EU funds ministry", "locations": [], "entities": {"persons": [{"name": "viorica dancila", "sentiment": "none"}, {"name": "dancila", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "psd", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "radu-sorin marinas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}, {"name": "min read  bucharest", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:42 PM / in 10 minutes Romanian MP targeted by prosecutors named to head EU funds ministry Radu-Sorin Marinas 3 Min Read \nBUCHAREST (Reuters) - Romanian Prime Minister-designate Viorica Dancila announced on Friday the creation of a new ministry to handle European Union funds and nominated as its head a lawmaker whom anti-corruption prosecutors have tried to investigate. \nDancila’s move may annoy some Romanians, who have protested in their tens of thousands over the past year against official corruption, and fuel renewed concerns in the EU about Bucharest’s commitment to tackling graft. \nDancila’s cabinet, Romania’s third in just a year, will be mainly judged by voters and investors by its ability to tackle high-level corruption, political analysts say. \n“We’re changing the government’s structure. For me it’s important to relaunch the European dimension of it,” Dancila said after a meeting of the executive committee of the ruling Social Democrats (PSD). \nDancila said she would keep a third of the outgoing government in place. It is expected to easily win a vote of confidence on Monday given the PSD’s big parliamentary majority. \nThe EU funds portfolio had previously been a branch of the regional development ministry and until last October was led by PSD lawmaker Rovana Plumb, the woman now nominated to head the new EU funds ministry. \nRomanian anti-corruption prosecutors asked parliament last September to allow a criminal investigation into Plumb over a land transfer case also involving former development minister Sevil Shhaideh. Parliament rejected that request. \nBoth Plumb and Shhaideh denied any wrongdoing, but the then-prime minister sacked them in a reshuffle saying the corruption allegations were damaging Romania’s relations with the EU. GRAFT CONCERNS \nParliament has several times rejected prosecutors’ requests to question lawmakers without providing any clear legal reasons. Brussels has often criticized Romania’s parliament for this. \nTransparency International ranks Romania among the EU’s most corrupt states, though Brussels has also praised the efforts of anti-graft magistrates to bring offenders to justice. \nThe EU on Wednesday urged the Romanian parliament to reconsider recent judicial reforms, which critics say weaken judicial independence. \nRomania, which joined the EU in 2007, wants to improve its administrative capacity to ensure it can spend more of the EU funds to which it is entitled. In the current 2014-20 budgetary cycle it has tapped less than 3 percent of the 22.5 billion euros allocated to it due to EU red tape and lack of expertise. \nRomania and other ex-communist EU member states are net beneficiaries of the bloc’s multi-year budget, receiving funds to build roads and other infrastructure and for their farmers. Editing by Gareth Jones", "external_links": [], "published": "2018-01-26T17:42:00.000+02:00", "crawled": "2018-01-26T18:00:31.005+02:00", "highlightTitle": ""}