{"organizations": [], "uuid": "9ad522b977422fcf959be5d6c4c0cdc94e850c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-brookfield-asset-management-announces-proposed-offering-of-notes.html", "country": "US", "domain_rank": 767, "title": "Brookfield Asset Management Announces Proposed Offering of Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.833, "site_type": "news", "published": "2018-01-11T16:30:00.000+02:00", "replies_count": 0, "uuid": "9ad522b977422fcf959be5d6c4c0cdc94e850c47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-brookfield-asset-management-announces-proposed-offering-of-notes.html", "ord_in_thread": 0, "title": "Brookfield Asset Management Announces Proposed Offering of Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "brookfield", "sentiment": "none"}], "organizations": [{"name": "brookfield asset management", "sentiment": "negative"}, {"name": "brookfield asset management inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Brookfield Asset Management Inc. (“Brookfield”) (TSX:BAM.A) (NYSE:BAM) (Euronext:BAMA) today announced that it is commencing a public offering, subject to market and other conditions, of US$500 million of notes due 2028 (the “2028 notes”) and US$250 million re-opening of 4.700% notes due 2047 (the “additional 2047 notes” and, together with the 2028 notes, the “notes”).\nThe additional 2047 notes will form the same series as the already outstanding US$550 million principal amount of 4.700% notes due 2047 (the “existing 2047 notes”), which were issued on September 14, 2017. The terms of the additional 2047 notes will be identical to the existing 2047 notes, other than the issue date and issue price. The additional 2047 notes will be issued at a price inclusive of accrued and unpaid interest from the original issuance date of September 14, 2017 to, but excluding, the date of delivery of such notes. An aggregate principal amount of US$800 million of 4.700% notes due 2047 will be outstanding after giving effect to this offering.\nThe notes will be issued by Brookfield Finance Inc., a 100% owned subsidiary of Brookfield, and will be fully and unconditionally guaranteed by Brookfield. The net proceeds of the offering will be used for general corporate purposes.\nDeutsche Bank Securities Inc. and Merrill Lynch, Pierce, Fenner & Smith Incorporated are acting as joint book-running managers for the offering.\nThe notes will be offered under Brookfield Finance Inc.’s existing base shelf prospectus filed in the United States and Canada. In the United States, the notes are being offered pursuant to an effective registration statement filed with the U.S. Securities and Exchange Commission on September 29, 2017. Brookfield Finance Inc. has filed a preliminary prospectus supplement relating to the offering of the notes. You may obtain these documents for free on EDGAR at www.sec.gov or on SEDAR at www.sedar.com . Before you invest, you should read these documents and other public filings by Brookfield for more complete information about Brookfield and this offering.\nAlternatively, copies can be obtained from:\nDeutsche Bank Securities Inc.\n60 Wall Street\nNew York, New York 10005-2836\nTelephone: 1-800-503-4611\nEmail: prospectus.CPDG@db.com Merrill Lynch, Pierce, Fenner & Smith Incorporated\nNC1-004-03-43\n200 North College Street, 3rd floor, Charlotte NC 28255-0001\nAttn: Prospectus Department\nTelephone: 1-800-294-1322\nEmail: prospectus_requests@baml.com\nThis news release does not constitute an offer to sell or the solicitation of an offer to buy the notes described herein, nor shall there be any sale of these notes in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. The notes being offered have not been approved or disapproved by any regulatory authority, nor has any such authority passed upon the accuracy or adequacy of the base shelf prospectus or the preliminary prospectus supplement.\nBrookfield Asset Management\nBrookfield Asset Management Inc. is a global alternative asset manager with over US$265 billion in assets under management. The company has more than a 100-year history of owning and operating assets with a focus on real estate, renewable power, infrastructure and private equity. Brookfield offers a range of public and private investment products and services, and is co-listed on the New York, Toronto and Euronext stock exchanges under the symbol BAM, BAM.A and BAMA, respectively.\nFor more information, please contact:\nClaire Holland\nCommunications & Media\nTel: (416) 369-8236\nEmail: claire.holland@brookfield.com Linda Northwood\nInvestor Relations\nTel: (416) 359-8647\nEmail: linda.northwood@brookfield.com Forward-Looking Statements\nNote: This news release contains “forward-looking information” within the meaning of Canadian provincial securities laws and “forward-looking statements” within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, Section 21E of the U.S. Securities Exchange Act of 1934, as amended, “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995 and in any applicable Canadian securities regulations. The word “will” and derivations thereof and other expressions that are predictions of or indicate future events, trends or prospects and which do not relate to historical matters identify forward-looking statements.\nForward-looking statements in this news release include statements with respect to the offering and the use of proceeds from the offering described in this news release. Although Brookfield believes that such forward-looking statements and information are based upon reasonable assumptions and expectations, the reader should not place undue reliance on forward-looking statements and information as such statements and information involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from anticipated future results, performance or achievement expressed or implied by such forward-looking statements and information.\nFactors that could cause actual results to differ materially from those contemplated or implied by forward-looking statements include: economic and financial conditions in the countries in which we do business; the behaviour of financial markets, including fluctuations in interest and exchange rates; availability of equity and debt financing; and other risks and factors in the prospectus and as detailed from time to time in the Company’s Annual Report on Form 40-F filed with the Securities and Exchange Commission as well as other documents filed by the Company with the securities regulators in Canada and the United States.\nWe caution that the foregoing list of important factors that may affect future results is not exhaustive. When relying on our forward-looking statements to make decisions with respect to Brookfield, investors and others should carefully consider the foregoing factors and other uncertainties and potential events. Except as required by law, the Company undertakes no obligation to publicly update or revise any forward-looking statements or information, whether written or oral, that may be as a result of new information, future events or otherwise.\nSource:Brookfield Asset Management Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/dc51b021-86fa-4a9d-8941-a4f14b3bb17b"], "published": "2018-01-11T16:30:00.000+02:00", "crawled": "2018-01-11T18:49:53.079+02:00", "highlightTitle": ""}