{"organizations": [], "uuid": "477cf0d82aff4acd7761a8c8edd6d4b8e033a850", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/09/103618913-GettyImages-121184414.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/thinking-about-buying-a-home-ask-yourself-how-long-you-plan-to-stay.html", "country": "US", "domain_rank": 767, "title": "Thinking about buying a home? Ask yourself how long you plan to stay", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:20:00.000+02:00", "replies_count": 0, "uuid": "477cf0d82aff4acd7761a8c8edd6d4b8e033a850"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/25/thinking-about-buying-a-home-ask-yourself-how-long-you-plan-to-stay.html", "ord_in_thread": 0, "title": "Thinking about buying a home? Ask yourself how long you plan to stay", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "positive"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "7:56 AM ET Thu, 13 April 2017 | 01:20 SHARES \nBuying a home can be a smart move. Warren Buffett says real estate is a valuable asset \" for a great many people ,\" and one self-made millionaire calls home-ownership \" an escalator to wealth .\" \nBut buying before you're ready can also be a big mistake . \nTo help you decide whether or not you're ready to make the transition from renting to buying, ask yourself one crucial question: How long do you plan on staying in the home? \nIf the answer is less than five years, you're probably better off renting . In general, it's best to buy when you have your eye on the horizon and you're thinking long-term. Experts largely agree that you shouldn't own unless you plan on staying in the home for at least five years . show chapters 12:22 PM ET Mon, 24 April 2017 | 00:49 \nThat's because, thanks to their high start-up costs, houses don't usually make great short-term investments. The longer you stay put, the more likely you are to regain what you paid in transaction costs and be able to sell for a profit. \nConsider the charts below from personal finance site NerdWallet , which show the break-even period (when buying becomes more advantageous than renting, money-wise). \nAs NerdWallet's mortgage expert Tim Manni explains: \"If you plan to stay in your home for a longer time period, buying usually becomes more fiscally attractive. Your home has more time to appreciate in value, and you have a longer time to spread out all the costs you incur when buying and selling a home.\" \nIn the first chart, NerdWallet varies the monthly rent you may pay: \nIn this chart, NerdWallet varies the down payment you may make and the level your home may appreciate in value: \n\"Renting offers consumers flexibility and a financial advantage that buying and owning does not,\" Manni tells CNBC Make It . \"But as these graphs indicate, the financial advantage to renting is often short-term. \n\"Over the long term, owning allows consumers to gain wealth by building equity in their home and often eventually allows them to move up to a larger, more spacious property down the line.\" \nIf you have to keep focusing on the short-term — if you're on a two-year work assignment, for example, or you plan on moving cities or changing careers in a couple of years — settling down may not be the best choice. \nBut if you're feeling stable and ready to maintain your home for five years or more, buying might be for you. You'll want to use a mortgage calculator to figure out exactly how much home you can afford , have cash for a down payment and prepare for the hidden costs of owning a home. ", "external_links": [], "published": "2018-01-25T18:20:00.000+02:00", "crawled": "2018-01-25T18:36:49.000+02:00", "highlightTitle": ""}