{"organizations": [], "uuid": "f17d63338fbf5d69892f3370f8d8c3cdc2d8defe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-us-stocks-broadly-lower-in-afternoon-trading-oil-slides.html", "country": "US", "domain_rank": 767, "title": "US stocks broadly lower in afternoon trading; oil slides", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:27:00.000+02:00", "replies_count": 0, "uuid": "f17d63338fbf5d69892f3370f8d8c3cdc2d8defe"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-us-stocks-broadly-lower-in-afternoon-trading-oil-slides.html", "ord_in_thread": 0, "title": "US stocks broadly lower in afternoon trading; oil slides", "locations": [], "entities": {"persons": [{"name": "charles schwab", "sentiment": "none"}, {"name": "keurig", "sentiment": "none"}, {"name": "randy frederick", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "standard & poor", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "dr. pepper snapple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stocks were broadly lower in afternoon trading Monday as the market eased back from its recent record highs. Technology stocks, the biggest gainer this year and in 2017, accounted for much of the slide. Energy stocks also declined as crude oil prices headed lower. Retailers and other consumer-focused companies were on pace for a small gain. Investors had their eye on the latest company earnings and deal news, including Keurig's acquisition of Dr. Pepper Snapple.\nKEEPING SCORE: The Standard & Poor's 500 index fell 10 points, or 0.4 percent, to 2,862 as of 2:12 p.m. Eastern Time. The Dow Jones industrial average slid 88 points, or 0.3 percent, to 26,528. The Nasdaq composite lost 20 points, or 0.3 percent, to 7,485. The Russell 2000 index of smaller-company stocks gave up 4 point, or 0.3 percent, to 1,604. The stock market is coming off its biggest single-day gain since March 2017.\nTHE QUOTE: \"It may just be we've had a really good run and people are taking profit off the table right now,\" said Randy Frederick, vice president of trading & derivatives at Charles Schwab. \"Earnings continue to be really stellar so far this quarter.\"\nEARNINGS AND MORE: Investors are gearing up for a busy week of potential market-moving corporate news and economic data. A slew of big-name companies are due to report quarterly results this week, including Apple, Microsoft, Facebook and Google's parent company Alphabet. About a quarter of the companies in the S&P 500 have reported results so far this earnings season, and some 65 percent of those have delivered results that exceeded financial analysts' expectations, according to S&P Global Market Intelligence. Beyond company earnings, the market will be sizing up new data on U.S. jobs, manufacturing and consumer sentiment. They'll also be watching Tuesday night's State of the Union address and listening for any developments out of a two-day meeting of the Federal Reserve's policymaking committee that ends Wednesday.\nDRINK IT UP: Dr. Pepper Snapple Group jumped 24.9 percent after it agreed to be acquired by Keurig for $16.6 billion, including debt. The deal would create a beverage giant with about $11 billion in annual sales. The companies, both the result of previous mergers, would combine global brands like Dr. Pepper, 7UP, Snapple, A&W, Mott's, Sunkist and Keurig's single-serve coffee makers. Dr. Pepper Snapple shareholders will receive $103.75 per share in a special cash dividend and keep 13 percent of the combined company. Dr. Pepper Snapple shares added $23.77 to $119.42.\nPAPER DEAL: KapStone Paper and Packaging Corp. soared 29.9 percent after it agreed to be bought by rival WestRock for $35 a share, or $3.39 billion. KapStone shares gained $7.93 to $34.47. WestRock slid $1.63, or 2.3 percent, to $68.64.\nX FACTOR: Apple shares fell 1.9 percent amid growing investor worries that the iPhone X has not been a hit with customers. Shares in the technology giant have been declining for several days, erasing billions of the company's market capitalization. The company is scheduled to report first-quarter earnings Thursday. The stock was down $3.23 to $168.28.\nTECHNOLOGY SLUMP: A slide in technology sector stocks pulled the market lower. Lam Research lost $6.62, or 3.3 percent, to $195.95.\nSTRONG QUARTER: Lockheed Martin was trading 1.8 percent higher after the defense contractor's latest quarterly results beat financial analysts' expectations. The stock added $6.36 to $351.26.\nBETTING ON CONSUMERS: The Commerce Department said Monday that consumer spending rose 0.4 percent in December, a solid though slower pace than in November. Traders bid up shares in retailers, fast-food chains and other companies that provide consumer goods and services. Netflix was among the big gainers, climbing $9.97, or 3.6 percent, to $284.57.\nENERGY: Benchmark U.S. crude fell 67 cents, or 1 percent, to $65.47 a barrel on the New York Mercantile Exchange. It rose 63 cents on Friday. Brent crude, used to price international oils, dropped $1.43, or 2 percent, to $69.09 per barrel.\nThe slide in gas prices weighed on energy sector stocks. Chesapeake Energy fell 10 cents, or 2.6 percent, to $3.90.\nBOND YIELDS: Bond prices fell. The yield on the 10-year Treasury note rose to 2.70 percent from 2.66 percent late Friday, the highest level in almost four years. The rise in bond yields helped lift shares in some banks. Goldman Sachs gained $5.52 or 2.1 percent, to $273.66.\nMETALS: Gold, which hit an 18-month high last week, fell $11.80 to $1,340.30 an ounce. Silver dropped 31 cents, or 1.8 percent, to $17.13 an ounce. Copper slipped 1 cent to $3.19 a pound.\nCURRENCIES: The dollar, which fell sharply last week after U.S. officials said they accepted a weaker value for the currency, rose to 109.03 yen from 108.66 late Friday. The euro fell to $1.2380 from $1.2423. The ICE US dollar index is at three-year lows and has declined for six consecutive weeks.\nTHE BITCOIN TRADE: The price of bitcoin was down about 4.1 percent in afternoon trading Monday to $11,210, according to the tracking site CoinDesk. Bitcoin futures on the Cboe Futures Exchange were up 2.6 percent to $11,220. The futures allow investors to make bets on the future price of bitcoin.\nMARKETS OVERSEAS: Germany's DAX and France's CAC 40 fell 0.1 percent. Britain's FTSE 100 added 0.1 percent. In Asia, Japan's benchmark Nikkei 225 finished flat, while Hong Kong's Hang Seng index lost 0.6 percent. South Korea's Kospi gained 0.9 percent and the S&P ASX/200 in Australia added 0.4 percent.", "external_links": [], "published": "2018-01-29T09:27:00.000+02:00", "crawled": "2018-01-29T22:42:34.008+02:00", "highlightTitle": ""}