{"organizations": [], "uuid": "a9e293e04d75dc449bdfda8e4bf0ad1568d655d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 58, "shares": 58, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-881495214.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/donald-trump-conscience-and-religious-freedom/", "country": "US", "domain_rank": 1196, "title": "Commentary: Trump Conscience and Religious Freedom Division Dangerous | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.873, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "a9e293e04d75dc449bdfda8e4bf0ad1568d655d0"}, "author": "Louise Melling", "url": "http://fortune.com/2018/01/19/donald-trump-conscience-and-religious-freedom/", "ord_in_thread": 0, "title": "Commentary: Trump Conscience and Religious Freedom Division Dangerous | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "louise melling", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "trump conscience", "sentiment": "negative"}, {"name": "department of health and human services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Louise Melling January 19, 2018 \nThe Trump administration announced Thursday that it will create a “Conscience and Religious Freedom” division in the Department of Health and Human Services. The office’s stated goal is to protect institutions and people who refuse to provide medical assistance based on religious objections. It’s a new division, but an old—and dangerously discriminatory—approach to health care. \nAlthough the administration claims the new office is intended to protect religious beliefs, it will almost surely function to license discrimination against women, LGBT people, and others. Among those the administration wants to protect with today’s announcement are those who refuse to provide abortions. There was, naturally, no mention of the harm to women that results when hospitals refuse to provide abortions or referrals for abortions. Nor was there talk of what happens to women when nurses protest providing women care before and after abortion, as we have seen some do. \nSee also: Commentary: ‘Religious Liberty’ Is Not an Excuse to Deny Transgender People Medical Care \nThere was also no discussion of how the new division opens the door for health care workers and institutions to discriminate against transgender people, but there is reason to fear that’s just what they intend to do. The Trump administration has already taken protections away from trans students, trans service members, and trans employees. And anti-transgender advocates, who now have significant influence in the White House, have made it clear that a significant part of their agenda is to deprive transgender patients of essential, medically necessary health care. The new division could be one way to further this goal. \nMedical standards, not religious beliefs or moral convictions, should guide our health care policies. No one should be turned away when they need medical help. No one should be humiliated, demeaned, and left to suffer because of who they are or the health care they need. \n\nWhile Donald Trump and his administration may claim that initiatives such as this promote liberty, we know the opposite is true. The specifics of what this new division will do are still murky, but the principle of the law has been clear for a long time. Freedom of religion is at the core of our national fabric and our Constitution. But that freedom does not give anyone a right to harm others, including by way of an exemption from our nation’s laws that bar discrimination and that protect our health. Liberty doesn’t involve denying a patient needed health care. Freedom doesn’t include refusing to provide patients medical care based on the sex they were assigned at birth. \nWe don’t yet know how the work of this new division will play out. But we will be watching. And should the administration choose to move forward to implement a discriminatory policy, we will see them in court. \nLouise Melling is the deputy legal director of the American Civil Liberties Union. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:03:43.015+02:00", "highlightTitle": ""}