{"organizations": [], "uuid": "5cbbeadaadc9ea7335a4496d634363f0606d5802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-savii-inc-appoints-new-chief-executive-officer-and-chief-technology-officer-secures-additional-investment.html", "country": "US", "domain_rank": 767, "title": "Savii, Inc. Appoints New Chief Executive Officer and Chief Technology Officer, Secures Additional Investment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-09T14:30:00.000+02:00", "replies_count": 0, "uuid": "5cbbeadaadc9ea7335a4496d634363f0606d5802"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-savii-inc-appoints-new-chief-executive-officer-and-chief-technology-officer-secures-additional-investment.html", "ord_in_thread": 0, "title": "Savii, Inc. Appoints New Chief Executive Officer and Chief Technology Officer, Secures Additional Investment", "locations": [], "entities": {"persons": [{"name": "fitzgerald", "sentiment": "none"}, {"name": "dennis robinson", "sentiment": "none"}, {"name": "savii", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "evan williams", "sentiment": "none"}, {"name": "sean fitzgerald", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}, {"name": "eric schmidt", "sentiment": "none"}], "locations": [{"name": "raleigh", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "savii, inc.", "sentiment": "neutral"}, {"name": "savii, inc", "sentiment": "neutral"}, {"name": "bank of america", "sentiment": "none"}, {"name": "gensight group", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "lehman brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C., Jan. 9, 2018 /PRNewswire/ -- Savii, Inc. (\"Savii\") a leading mobile-first technology that automates home care agency workflows to manage referrals, hire and retain the best caregivers, and profitably deliver superior patient care, announced today that it has appointed Sean Fitzgerald, a leading technology executive, as Chief Executive Officer and Board Director. Additionally, Savii named Dennis Robinson Chief Technology Officer, and concurrently secured a follow-on financing from lead investor Cofounders Capital, along with existing and new investors.\nMr. Fitzgerald was most recently Chief Operating Officer and CFO of The GenSight Group, a leading Strategic Portfolio Management and workflow SaaS software solution. Prior to GenSight, Sean was Executive Vice President of leading education technology innovator, EverFi , backed by Amazon founder and CEO Jeff Bezos, Google Chairman Eric Schmidt, and Twitter founder Evan Williams. Prior to EverFi, he was a Senior Vice President at Lehman Brothers and Vice President at Bank of America.\nDennis Robinson's career has spanned over 20 years in multiple industries and markets specializing in the design and creation of large scale distributed and performance critical applications for financial markets, control systems and virtual reality. Before becoming the CTO at Savii, Mr. Robinson was a Principal Engineer at Itron Inc., and also Lead Developer at LMG Holdings.\n\"Three and a half years ago we founded Savii to address a huge need in the home care agency market,\" said Savii Co-Founder Michelle Harper, who will move to the role of Chief Product Officer. \"Our next phase of growth calls for experienced executives with proven leadership skills. Our investors and I are ecstatic that both Sean and Dennis see the value and momentum in Savii, and want to be part of leading our continued expansion as we strengthen our leadership position in the home care agency software market.\"\nAt GenSight, Sean led a conversion to a scalable SaaS business model, and at EverFi, he founded EverFi's Chicago office and led the company's expansion across the Midwest and Mountain West. He will lead Savii's operations, and the new investment will be used to add additional talent, including investing heavily in development, marketing, sales, and customer support resources.\n\"I feel privileged to join Savii, and I am very bullish on the runway we have in front of us,\" said Fitzgerald. \"Savii was the pioneering mobile-first technology in the home care software market, and a true disruptor and innovator. Customers value Savii's workflow automation platform for its ease-of-use and leading customer experience. As home care agencies continue to migrate from paper and legacy software providers to technology built for the future, Savii is positioned to be the top solution in this rapidly growing market.\"\nAbout Savii\nSavii, Inc. provides the easy-to-use, mobile-first software platform to help home care agencies profitably deliver superior patient care, while reducing administrative workload. The HIPPA-compliant Savii Care solution automates workflows and enables agencies, caregivers, patients, and family members to coordinate and communicate. From managing referrals, hiring caregivers, client intake, to scheduling, care delivery, and billing (Private Pay, Medicaid, VA, and Insurance), Savii's integrated platform connects care, by connecting people. To learn more about how Savii can help your organization, follow us on Facebook, LinkedIn, Twitter , or visit http://www.saviicare.com .\nFor press inquiries, please contact:\nLaura@LiFt-pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/savii-inc-appoints-new-chief-executive-officer-and-chief-technology-officer-secures-additional-investment-300579609.html\nSOURCE Savii, Inc.", "external_links": ["http://www.everfi.com/", "https://www.facebook.com/saviicare", "http://www.prnewswire.com/news-releases/savii-inc-appoints-new-chief-executive-officer-and-chief-technology-officer-secures-additional-investment-300579609.html", "https://twitter.com/saviicare?lang=en", "http://www.saviicare.com/", "https://www.linkedin.com/company/savii-care/"], "published": "2018-01-09T14:30:00.000+02:00", "crawled": "2018-01-09T15:41:03.000+02:00", "highlightTitle": ""}