{"organizations": [], "uuid": "7f1cf462282e274e7a514599ff168a3bb55ebfc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-bryn-mawr-bank-corporation-appoints-diego-f-calderin-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Bryn Mawr Bank Corporation Appoints Diego F. Calderin to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-25T00:32:00.000+02:00", "replies_count": 0, "uuid": "7f1cf462282e274e7a514599ff168a3bb55ebfc7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-bryn-mawr-bank-corporation-appoints-diego-f-calderin-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Bryn Mawr Bank Corporation Appoints Diego F. Calderin to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "frank leto", "sentiment": "none"}, {"name": "diego f. calderin", "sentiment": "none"}, {"name": "calder", "sentiment": "none"}, {"name": "calderin", "sentiment": "none"}], "locations": [{"name": "bryn mawr", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "bryn mawr bank corporation appoints diego f. calderin", "sentiment": "negative"}, {"name": "bryn mawr bank corporation", "sentiment": "negative"}, {"name": "bryn mawr bank corporation board of directors", "sentiment": "none"}, {"name": "bmbc", "sentiment": "none"}, {"name": "bryn mawr trust company", "sentiment": "none"}, {"name": "bmt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRYN MAWR, Pa., Bryn Mawr Bank Corporation (NASDAQ:BMTC) (“BMBC”), parent of The Bryn Mawr Trust Company (”BMT”), today announced the appointment of Diego F. Calderin as a director of BMBC and BMT, effective January 18, 2018.\n“Diego is an inspirational entrepreneur,” said Frank Leto, President and Chief Executive Officer of BMBC. “He is an important and exciting appointment to the Bryn Mawr Bank Corporation Board of Directors, bringing significant experience in the technology and financial services industries. Diego will be a valuable asset to our growing organization; he has an impressive, proven track record of helping companies capitalize on new opportunities while delivering value to their respective stakeholders. We believe his experience aligns with our continued commitment and investment in new technologies and he brings a great mix of skills necessary to add meaningful value.”\nMr. Calderin was the original co-founder and Chief Technology Officer of Anexinet which became an award winning Digital Systems Integration company. In 2014, Mr. Calderin and his partners sold Anexinet to a private equity company. He is currently the co-founder and Managing Partner of Banbury Systems, a data acquisition platform company that provides inventory tracking using advanced RFID readers with GPS and cellular transmission. Prior to Anexinet, Mr. Calderin was a software engineer with GE and consulted at Fortune 500 companies.\nMr. Calderin previously served on the Board of Trustees for a Philadelphia money management firm with over $6 billion in assets under management. He is also a member of the Board of Trustees for La Salle University where he serves on the Finance, Facilities and Student Affairs Committees.\nHe also recently served as Board Chairman of Community Volunteers in Medicine (CVIM), a philanthropic organization whose mission is to provide healthcare services to the working low-income residents of Chester County, PA. Mr. Calderin has also published and contributed over 300 business reports from 2008 to 2014 for KYW News Radio, 1060 AM in Philadelphia, PA.\nBorn in Havana, Cuba, Mr. Calderin immigrated to the United States with his family in 1962. He is fluent in Spanish and English, holds a Bachelor of Arts in Computer Science from La Salle University and a master’s degree in engineering from the Pennsylvania State University. He resides in West Chester, Pa. with his wife.\nBryn Mawr Bank Corporation (NASDAQ:BMTC), including its principal subsidiary, The Bryn Mawr Trust Company (founded in 1889; headquartered in Bryn Mawr, Pa.), is a locally managed financial services company providing retail and commercial banking, trust administration and wealth management, and insurance solutions. Bryn Mawr Bank Corporation has corporate assets in excess $4.3 billion. As of September 30, 2017, BMT had $12.4 billion in wealth assets under management, administration, supervision, and brokerage. BMT operates 37 full-service retail bank locations in Montgomery, Chester, Delaware, Philadelphia and Berks Counties in Pennsylvania, Camden County in New Jersey and New Castle County in Delaware. For more information, please visit bmtc.com .\nForward-looking Statements\nThis press release contains statements which, to the extent that they are not recitations of historical fact may constitute forward-looking statements for purposes of the Securities Act of 1933, as amended, and the Securities Exchange Act of 1934, as amended. Such forward-looking statements may include financial and other projections as well as statements regarding BMBC’s future plans, objectives, performance, revenues, growth, profits, operating expenses or BMBC’s or RBPI’s underlying assumptions. The words “may,” “would,” “should,” “could,” “will,” “likely,” “possibly,” “expect,” “anticipate,” “intend,” “indicate,” “estimate,” “target,” “potentially,” “promising,” “probably,” “outlook,” “predict,” “contemplate,” “continue,” “plan,” “forecast,” “project,” “are optimistic,” “are looking,” “are looking forward” and “believe” or other similar words and phrases may identify forward-looking statements. Persons reading this filing are cautioned that such statements are only predictions, and that BMBC’s actual future results or performance may be materially different.\nSuch forward-looking statements involve known and unknown risks and uncertainties. A number of factors could cause actual results, events or developments, or industry results, to be materially different from any future results, events or developments expressed, implied or anticipated by such forward-looking statements, and our business and financial condition and results of operations could be materially and adversely affected. All forward-looking statements and information set forth herein are based on management’s current beliefs and assumptions as of the date hereof and speak only as of the date they are made. BMBC does not undertake to update forward-looking statements.\nFor a complete discussion of the assumptions, risks and uncertainties related to our business, you are encouraged to review BMBC’s filings Commission, including the most recent Annual Report on Form 10-K, as updated by quarterly or other reports subsequently filed with the SEC.\nFOR MORE INFORMATION CONTACT:\nFrank Leto, President, CEO\n610-581-4730\nTina McDonald, SVP\n610-581-4875\nSource: BMT", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7556ca15-3078-4387-99c9-a0bfe4a2fb47", "https://www.globenewswire.com/Tracker?data=mEY0qPshqWGVbX8nfw05MSPau6Xu060VfDGQkL9WnVNa9vRlGdGzeEAWmlUxbzVXf9bOUeDubFxTbfKNjJ1mmw=="], "published": "2018-01-25T00:32:00.000+02:00", "crawled": "2018-01-25T01:49:13.016+02:00", "highlightTitle": ""}