{"organizations": [], "uuid": "b2ae92f0d32c38555afffb930fdd0ddbef7d82ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-4-mcdonalds-robust-u-s-sales-fail-to-impress-shares-fall.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-McDonald's robust U.S. sales fail to impress, shares fall", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:55:00.000+02:00", "replies_count": 0, "uuid": "b2ae92f0d32c38555afffb930fdd0ddbef7d82ec"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-4-mcdonalds-robust-u-s-sales-fail-to-impress-shares-fall.html", "ord_in_thread": 0, "title": "UPDATE 4-McDonald's robust U.S. sales fail to impress, shares fall", "locations": [], "entities": {"persons": [{"name": "steve easterbrook", "sentiment": "none"}, {"name": "easterbrook", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mcdonald's corp", "sentiment": "neutral"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "panera bread and chipotle mexican grill inc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds executive comment on competition, tax savings)\nJan 30 (Reuters) - McDonald's Corp on Tuesday reported robust U.S. fourth-quarter restaurant sales, boosted by new buttermilk chicken tenders and low-price food, but that was not enough to match Wall Street's increasing appetite for growth.\nInvestor expectations are high three years into a turnaround led by Chief Executive Steve Easterbrook. Under his guidance, the company is recapturing share from rivals and winning back customers who had defected to direct competitors and fast-casual chains like Panera Bread and Chipotle Mexican Grill Inc.\nShares in the world's biggest restaurant chain fell as much as 2.6 percent to $173.14 on Tuesday. The stock has jumped 80 percent since Easterbrook was named CEO on March 1, 2015, outperforming a 36 percent rise in the S&P 500.\nMcDonald's is now doubled down on discounting, piling more pricing pressure on rivals with a $1, $2, $3 value menu launched earlier this month.\nIt is preparing for tough battles as U.S. restaurants fight for a bigger share of a pie that is not growing.\n\"Value is where the street fighting really hits,\" Easterbrook said on a conference call with analysts.\nMcDonald's also plans to invest $2.4 billion this year to help open 1,000 new restaurants and renovate and modernize existing units to accommodate self-service kiosks, mobile ordering and delivery.\nExecutives said the company, which will see its effective tax rate drop due to the new U.S. tax law, is putting business investments before large share repurchases, comments that also contributed to Tuesday's share declines.\n\"The first priority is clearly to invest in the business for growth and then we'll consider dividends and share buyback,\" Chief Financial Officer Kevin Ozan said.\nSales at U.S. restaurants open at least 13 months jumped an enviable 4.5 percent, the fourth straight quarterly rise, but only matched analysts' estimates. Sales in the region were boosted by higher demand for its McPick 2 $5 combo offer and cheap drinks. The United States is McDonald's biggest market by restaurants, revenue and operating income.\nGlobal same-store sales rose 5.5 percent, as it served more customers in regions including Canada, the United Kingdom and China. That exceeded the 5 percent gain analysts expected, \"though a bit more modestly than in previous quarters,\" Bernstein analyst Sara Senatore said in a client note.\nNet income fell 41.5 percent to $698.7 million or 87 cents per share, mainly due to a $700 million one-time net charge related to the new U.S. tax law.\nExcluding items, the company earned $1.71 per share, beating the average analyst estimate of $1.59, according to Thomson Reuters I/B/E/S.\nAfter crunching the numbers to account for the tax charge and a lower-than-expected effective rate in the fourth quarter, Cowen & Co analyst Andrew Charles said in a client note that he viewed the underlying earnings per share as in-line with expectations.\nRevenue fell 11.4 percent to $5.3 billion in the quarter ended Dec. 31 as McDonald's stepped up sales of restaurants to franchisees and strategic partners.\n(Reporting by Siddharth Cavale in Bangalore and Lisa Baertlein in Los Angeles; Editing by Meredith Mazzilli)", "external_links": [], "published": "2018-01-30T19:55:00.000+02:00", "crawled": "2018-01-30T20:02:52.014+02:00", "highlightTitle": ""}