{"organizations": [], "uuid": "127922e6bfb7593af8165624364e186acaff714a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/04/104081824-GettyImages-57260771.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/04/new-health-insurance-rule-aims-to-deliver-on-trump-promise.html", "country": "US", "domain_rank": 767, "title": "New health insurance rule aims to deliver on Trump promise", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:20:00.000+02:00", "replies_count": 0, "uuid": "127922e6bfb7593af8165624364e186acaff714a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/new-health-insurance-rule-aims-to-deliver-on-trump-promise.html", "ord_in_thread": 0, "title": "New health insurance rule aims to deliver on Trump promise", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [], "organizations": [{"name": "labor department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Striving to fulfill a campaign promise, the Trump administration on Thursday proposed regulations to facilitate the interstate sale of health insurance policies that cost less but may not cover as much.\nThe complex proposal from the Labor Department aims to deliver on President Donald Trump's long-standing pledge to increase competition and lower costs by promoting the sale of health plans across state lines. Yet its success depends on the actions of insurers, state consumer protection regulators, plan sponsors and customers themselves. Some already have concerns.\nFrustrated in its efforts to repeal the Obama-era Affordable Care Act, the administration is pursuing regulations to change the insurance marketplace.\nThe new rule would make it easier for groups, or associations, to sponsor health plans that don't have to meet all consumer protection and benefit requirements of the Obama law. Those requirements improve coverage, but also raise premiums.\nBecause health insurance, like real estate, reflects wide variation in local prices, it's not immediately clear whether an insurer could charge Texas premiums for policies sold to people in Manhattan.\nInsurance industry groups are skeptical of Trump's idea. Patient groups are concerned about losing protections. Some state regulators object to federal interference. Some experts foresee potential legal challenges.\nIn a recent interview, Trump predicted that insurance markets would be transformed by the combination of this expected proposal, often referred to as \"association health plans,\" and the GOP's recent repeal of the health law's requirement that most people get health insurance or risk fines.\n\"So now I have associations,\" Trump told The New York Times last week. \"I have private insurance companies coming and will sell private health care plans to people through associations. That's gonna be millions and millions of people. People have no idea how big that is. And by the way, and for that, we've ended 'across state lines.' So we have competition.\"\nTrump appeared to be referring to current obstacles that deter a health insurance company in one state from marketing to individual customers in another state. Some of those barriers have to do with state regulations that differ in the kinds of benefits that insurers must cover. For example, one state may require robust coverage for children with autism, while another may not.\nUnder the administration's proposal, health plans sponsored by associations would gain enhanced status under a federal law that generally exempts large employer plans from state regulation. Experts are poring over the proposal to determine precisely to what degree such exemptions would apply to the new plans.\n\"The goal of the rule-making is to expand access to affordable health coverage, especially among small employers and self-employed individuals, by removing undue restrictions on the establishment and maintenance of association health plans\" under federal law, the proposal said.\nThe Labor Department said up to 11 million people who are self-employed or work for small businesses could benefit. Association plans, called \"Small Business Health Plans\" in the proposal, would be open to small employers and sole proprietors and their families. They could be organized on the lines of a geographic area or an industry.\nThe department said such plans would not be able to charge individuals higher premiums because of health issues or turn down applicants with medical problems. Interested parties will have 60 days to comment on the proposal.\nThe main insurance industry groups, along with organizations representing patients and consumers, worry that the administration's approach could siphon healthy people away from the health law's insurance markets, creating a spiral of rising premiums for people who need comprehensive benefits.\n\"We are concerned that this could create or expand alternative, parallel markets for health coverage, which would lead to higher premiums for consumers, particularly those with pre-existing conditions,\" according to a letter last month to state regulators, signed by America's Health Insurance Plans and the Blue Cross Blue Shield Association. \"Further, these actions destabilize the health insurance markets that guarantee access to comprehensive health coverage regardless of health status.\"\nEven before Thursday's development, Pennsylvania's acting insurance commissioner, Jessica Altman, had her own concerns. \"Generally speaking, these types of plans are exempt from state law and outside my jurisdiction,\" the Democratic appointee said in an interview. \"That means any issues that consumers have, I won't be able to help them. More and more people would fall under the jurisdiction of the federal government, and I think state regulators would say we really do it better.\"", "external_links": [], "published": "2018-01-04T17:20:00.000+02:00", "crawled": "2018-01-04T17:43:19.013+02:00", "highlightTitle": ""}