{"organizations": [], "uuid": "92e9b4e45c64452762dc60b730beb298743fb601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-niit-technologies-q3-fya18-pat-up-21-point-2-percent-yoy.html", "country": "US", "domain_rank": 767, "title": "NIIT Technologies Q3 FY’18 PAT up 21.2% YoY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.153, "site_type": "news", "published": "2018-01-19T15:07:00.000+02:00", "replies_count": 0, "uuid": "92e9b4e45c64452762dc60b730beb298743fb601"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-niit-technologies-q3-fya18-pat-up-21-point-2-percent-yoy.html", "ord_in_thread": 0, "title": "NIIT Technologies Q3 FY’18 PAT up 21.2% YoY", "locations": [], "entities": {"persons": [{"name": "sudhir singh", "sentiment": "none"}, {"name": "arvind thakur", "sentiment": "none"}], "locations": [{"name": "noida", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "niit technologies limited", "sentiment": "negative"}, {"name": "niit technologies", "sentiment": "negative"}, {"name": "niit technologies ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NOIDA, India, January 19, 2018 /PRNewswire/ --\nNIIT Technologies Limited (NSE: NIITTECH), a leading global IT solutions organization, today announced its financial results for the quarter ended in December 31, 2017 with revenue expanding 2.6% sequentially to Rs. 756.5 Crores representing an increase of 9.0% over the same period last year. Operating Profits expanded 8.7% QoQ or 11.4% YoY to Rs. 129.5 Crores and Profit after Tax improved 21.2% over same period last year to Rs. 75.6 Crores.\n(Logo: http://mma.prnewswire.com/media/537635/NIIT_Tech_Logo.jpg )\nQtr performance at a glance Particulars Qtr ended Qtr ended Growth 31-Dec-16 31-Dec-17 YoY Cr Cr Consolidated Revenues 693.8 756.5 9.0% Operating Profit 116.2 129.5 11.4% Operating Margin 16.8% 17.1% 37 bps Profit After Tax 62.4 75.6 21.2%\nThe board approved the appointment of Sudhir Singh as Chief Executive Officer of NIIT Technologies Ltd. Arvind Thakur was elevated to the role of Vice Chairman and Managing Director.\n\"It will be a privilege to lead the company on to its next growth trajectory,\" said Mr. Sudhir Singh , Chief Executive Officer , NIIT Technologies Ltd . \"Sequential growth during the quarter came on the back of traction in our two key segments of Travel and BFSI. Operating Margins expanded 97 bps sequentially to 17.1% as a result of growth in Digital engagements in U.S. and EMEA,\" he added.\nThe company continued to experience good traction in BFSI segment with revenues expanding 4.0% sequentially during the quarter contributing to 43% of revenue mix. Travel & Transportation segment grew by 4.4% and now represents 27% of total revenues.\nRevenues from EMEA expanded 7.2% sequentially during the quarter which now contributes to 30% of the revenue mix. U.S. grew 1.5% sequentially contributing to 50% of the mix. India and APAC business now represents 10% and 10% of the total mix.\n\" Sudhir has infused new energy into the organization which is reflected in our vastly improved deal momentum and we look forward to his leadership to embrace new opportunities,\" said Mr. Arvind Thakur, Vice Chairman & Managing Director , NIIT Technologies Ltd. \" Continuing with the good intake in the previous quarter, fresh business of USD 130m was secured during the current quarter which included 3 large deals and 8 new logos,\" he added.\nOf the fresh business secured during the quarter, USD 82 Mn was from the U.S., USD 25 Mn from EMEA and 23 Mn USD from ROW. Order book executable over the next 12 months expanded to USD 329 Mn, 2 of the 3 large deals were in the Insurance segment. Company used data analytics as an effective tool to win one of these deals.\nIn the digital space, the Company entered into agreements with a large multinational bank, a large cruise line and also signed a multi-million dollar, multi-year contract for upgrading the website of a large travel organizer. Digital revenues grew 11% sequentially contributing to 25% of the total revenues.\n\" With Sudhir at the helm, the company enters into a new era of growth with a fresh perspective and new leadership inducted in the markets that we serve,\" said Mr. Rajendra S Pawar, Chairman , NIIT Technologies Ltd .\nThe company added three new business leaders to head drive its growth agenda. Gautam Samantha formerly with Infosys joins to head Europe geography, Anantha Basavaraju formerly with Fujitsu joins to head APAC, and Madan Mohan formerly with Infosys takes charge of a new service line around Data Services & Automation with his base in the U.S. In addition, the company strengthened its cloud practice by inducting two senior leaders Bhartendra Gupta formerly with Microsoft based in the U.S. and Anthony Shepard, formerly with IBM to be based in UK. Further Martyn Sutton, an InsurTech veteran has joined in the U.S. to drive NITL business in the geography.\n59 people were added during the quarter taking headcount to 9,081 at the end of the period.\nAcknowledgements :\nNIIT Technologies has Won International Airport Review's award in the Category of Terminal Operations NIIT technologies was conferred with 'Automation Project of the Year' award from Global Sourcing Association NIIT Technologies won Business World HR Excellence awards for Change Management NIIT Technologies conferred with HRO Today Awards 2017 under 'Total Rewards & Benefits Excellence category'\nSOURCE NIIT Technologies Ltd", "external_links": ["http://www.niit-tech.com/industries/travel-transportation", "http://www.niit-tech.com/industries/banking-financial-services", "http://www.niit-tech.com/"], "published": "2018-01-19T15:07:00.000+02:00", "crawled": "2018-01-19T16:03:04.016+02:00", "highlightTitle": ""}