{"organizations": [], "uuid": "84ba48da89ee9d0af3a17f95eadc7bbaec4dd2e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223072635&w=1200&r=LYNXMPEE0H1CV", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-kosovo-serbs-shooting-funeral/slain-kosovo-serb-leader-ivanovic-given-big-funeral-in-belgrade-idUSKBN1F729H", "country": "US", "domain_rank": 408, "title": "Slain Kosovo Serb leader Ivanovic given big funeral in Belgrade", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.654, "site_type": "news", "published": "2018-01-19T00:19:00.000+02:00", "replies_count": 0, "uuid": "84ba48da89ee9d0af3a17f95eadc7bbaec4dd2e9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kosovo-serbs-shooting-funeral/slain-kosovo-serb-leader-ivanovic-given-big-funeral-in-belgrade-idUSKBN1F729H", "ord_in_thread": 0, "title": "Slain Kosovo Serb leader Ivanovic given big funeral in Belgrade", "locations": [], "entities": {"persons": [{"name": "ivanovic", "sentiment": "negative"}, {"name": "oliver ivanovic", "sentiment": "none"}, {"name": "nevenka medic", "sentiment": "none"}], "locations": [{"name": "belgrade", "sentiment": "none"}, {"name": "kosovo", "sentiment": "none"}, {"name": "belgrade belgrade", "sentiment": "none"}, {"name": "mitrovica", "sentiment": "none"}, {"name": "ibar river", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BELGRADE (Reuters) - Hundreds of mourners came to Belgrade’s central cemetery on Thursday to attend the funeral of a Kosovo Serb leader whose killing stoked tensions between Serbia and its former province of Kosovo.\nOliver Ivanovic, 64, was shot six times on Tuesday as he arrived at his party office in Mitrovica, a Kosovo town bitterly divided between majority ethnic Albanians and minority Serbs.\nIvanovic had been facing a retrial over killings of ethnic Albanians during Kosovo’s 1998-99 guerrilla uprising against repressive Serbian rule.\nHis body was brought by car to Serbia’s capital, 420 km (260 miles) north of Mitrovica, escorted by mourners.\n“The best among Kosovo Serbs was slain and the damage cannot be undone. This death will haunt us politically,” said Nevenka Medic, a Mitrovica Serb, clutching a red rose to place on Ivanovic’s grave.\nIvanovic rose to prominence shortly after the war as one of Mitrovica’s “bridge-watchers” - nationalist Serbs who sought to block “infiltration” by Albanians over the Ibar River bridge into the northern half of the town.\nAfter the group disbanded, Ivanovic entered politics and became known as a relative moderate for advocating post-war dialogue and compromise with Kosovo Albanians, while still refusing to recognize Kosovo’s 2008 independence from Serbia.\nSerbs from Belgrade and from Kosovo queued to lay wreaths and flowers and offer condolences to Ivanovic’s wife who stood next to the coffin in front of the cemetery’s main chapel.\nSERBIAN GOVERNMENT LEADERS\nA picture of Oliver Ivanovic is seen during his funeral ceremony in Belgrade, Serbia, January 18, 2018. REUTERS/Djordje Kojadinovic NO RESALES. NO ARCHIVES. Among them were top Serbian government officials including Prime Minister Ana Brnabic and Foreign Minister Ivica Dacic, as well as opposition leaders.\n“He was heard with attention by both foreigners and Serbs and often Albanians, for him Kosovo was more than just territory and politics,” Orthodox Bishop Teodosije said in a eulogy.\nAn EU-sponsored dialogue on the normalization of ties between Serbia and Kosovo was suspended when Belgrade’s delegation walked out after the killing, saying it would return only once Ivanovic’s killers are brought to justice.\nThe wife of Oliver Ivanovic, Milena Popovic Ivanovic, mourns during his funeral in Belgrade, January 18, 2018. REUTERS/Djordje Kojadinovic During a visit to neighboring Macedonia, NATO Secretary General Jens Stoltenberg said Ivanovic’s killing was “an example of how the situation in Kosovo is not where we would like it to be”. About 4,600 NATO troops remain in Kosovo as peacekeepers.\nKosovo police said they had traced the owner of a burned car believed to be linked to the killers and were interviewing potential witnesses. No one heard the shots as, according to investigators, the gunman likely used a silencer.\nIn 2016, Ivanovic was convicted by an European Union-run court of inciting murders of ethnic Albanians during the war and sentenced to nine years in prison. He appealed, arguing the evidence was forged, and a retrial was ordered.\nSerbian officials said the accusations were trumped up.\nKosovo’s estimated 50,000 Serbs live in a northern pocket that has been in legal limbo since the war - politically loyal to Serbia but effectively a no-go territory for both Serbian and Kosovo police, with Serb criminal gangs - some of whose members are ex-“bridge-watchers” - exerting a powerful grip.\nIvanovic’s car was set on fire last year in what he called a politically motivated attack.\nHis widow Milena said she planned to move to Belgrade along with their 7-year old son. “My son and I have finished with Mitrovica - it’s a town of fear, darkness and pain,” she said.\nWriting by Ivana Sekularac; editing by Mark Heinrich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T00:19:00.000+02:00", "crawled": "2018-01-19T12:28:33.011+02:00", "highlightTitle": ""}