{"organizations": [], "uuid": "1f1e93ac10627331c782d25a95f01a8cc33175ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-kiadis-pharma-proposes-former-cipla-ceo-subhanu-saxena-as-new-supervisory-board-member.html", "country": "US", "domain_rank": 767, "title": "Kiadis Pharma proposes former Cipla CEO Subhanu Saxena as new Supervisory Board member", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-16T09:00:00.000+02:00", "replies_count": 0, "uuid": "1f1e93ac10627331c782d25a95f01a8cc33175ce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-kiadis-pharma-proposes-former-cipla-ceo-subhanu-saxena-as-new-supervisory-board-member.html", "ord_in_thread": 0, "title": "Kiadis Pharma proposes former Cipla CEO Subhanu Saxena as new Supervisory Board member", "locations": [], "entities": {"persons": [{"name": "subhanu saxena", "sentiment": "negative"}, {"name": "saxena", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}], "organizations": [{"name": "amsterdam & duivendrecht", "sentiment": "negative"}, {"name": "supervisory board", "sentiment": "negative"}, {"name": "kiadis pharma n.v.", "sentiment": "negative"}, {"name": "cipla", "sentiment": "negative"}, {"name": "kiadis pharma", "sentiment": "negative"}, {"name": "bill & melinda gates foundation", "sentiment": "none"}, {"name": "new rhein healthcare", "sentiment": "none"}, {"name": "bain capital", "sentiment": "none"}, {"name": "kds", "sentiment": "none"}, {"name": "kiadis pharma supervisory board", "sentiment": "none"}, {"name": "general meeting of shareholders", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMSTERDAM & DUIVENDRECHT, Netherlands--(BUSINESS WIRE)-- Regulatory News:\nKiadis Pharma N.V. (“Kiadis Pharma” or the “Company”) (Euronext Amsterdam and Brussels: KDS) , a clinical stage biopharmaceutical company developing innovative T-cell therapy products to make bone marrow transplantations safer and more effective for patients, today announces that at its next General Meeting of Shareholders, the Kiadis Pharma Supervisory Board will nominate Subhanu Saxena to be appointed as a new member of the Supervisory Board.\nSubhanu Saxena is currently a Regional Director with The Bill & Melinda Gates Foundation as well as partner New Rhein Healthcare and Senior Advisor to Bain Capital. He was, until recently, the Managing Director and Global Chief Executive Officer of Cipla, a publicly listed, leading Indian pharmaceutical and biotech company with global operations and around 25,000 employees. During Mr. Saxena’s leadership Cipla was transformed into a more international and agile company. Prior to joining Cipla, Mr. Saxena was Head of Global Product Strategy and Commercialization and member of the Executive Committee at Novartis. Before that, Mr. Saxena was CEO of Novartis UK and held various leadership roles in business development. Prior to joining the pharma industry Mr. Saxena worked with leading global companies including Citicorp, the Boston Consulting Group and PepsiCo across markets in Europe, North America, Africa and Asia. Mr. Saxena holds a Graduate degree in Engineering from Oxford University and an MBA from INSEAD, France.\nArthur Lahr, CEO of Kiadis Pharma, commented: “I am delighted Subhanu has decided to join our Supervisory Board. As we continue to professionalize our company and prepare for the potential European commercial launch of ATIR101™ in H2 2019, Subhanu’s vast leadership experience in building and transforming a wide variety of organizations will be of immense value for Kiadis Pharma and help us tremendously to make ATIR101™ widely available to patients.’’\nSubhanu Saxena added: “I am very pleased to join the Kiadis Pharma Supervisory Board and am impressed by the Company’s investigational product and technology platform, which I am convinced can serve patients with a safer and more effective bone marrow transplantation. I look forward to support the further maturing of Kiadis Pharma.’’\nMark Wegter, Chairman of the Supervisory Board of Kiadis Pharma, commented: “We are very happy to welcome Subhanu to our Supervisory Board. His wealth of global strategic and commercial experience will be invaluable to Kiadis Pharma in the next stages of its growth and continued transformation into a successful commercial stage company.”\nAbout Kiadis Pharma\nKiadis Pharma’s allodepleted T-cell immunotherapy product can make haploidentical hematopoietic stem cell transplantations (HSCT) safer and more effective. Single dose Phase 2 data with lead product ATIR101™ given after a HSCT in patients with blood cancer shows a strong and clinically very relevant improvement over literature for the Baltimore protocol, without the risk of severe chronic Graft versus Host Disease (GVHD). Based on the positive results from the Phase 2 trial, the Company submitted a Marketing Authorization Application (MAA) to the European Medicines Agency (EMA) in April 2017, for approval of ATIR101™ across the EU as an adjunctive treatment in HSCT for malignant disease. Kiadis Pharma received Day 120 questions in September 2017 and is on track for potential (conditional) approval in Q4 2018 and launch in H2 2019. Kiadis Pharma is conducting a Phase 3 trial with ATIR101™ across Europe and North America (head to head against the Baltimore protocol). The first patient was enrolled in December 2017.\nIn September 2017 the US Food and Drug Administration (FDA) granted ATIR101™ the Regenerative Medicine Advanced Therapy (RMAT) designation. ATIR101™ has been granted Orphan Drug Designations both in the US and Europe.\nThe Company’s shares are listed on Euronext Amsterdam and Brussels under the ticker KDS.\nWebsite: www.kiadis.com\nCompany presentation: http://www.kiadis.com/company-presentation/\nForward Looking Statements\nCertain statements, beliefs and opinions in this press release are forward-looking, which reflect Kiadis Pharma’s or, as appropriate, Kiadis Pharma’s directors’ current expectations and projections about future events. By their nature, forward-looking statements involve a number of risks, uncertainties and assumptions that could cause actual results or events to differ materially from those expressed or implied by the forward-looking statements. These risks, uncertainties and assumptions could adversely affect the outcome and financial effects of the plans and events described herein. A multitude of factors including, but not limited to, changes in demand, competition and technology, can cause actual events, performance or results to differ significantly from any anticipated development. Forward looking statements contained in this press release regarding past trends or activities should not be taken as a representation that such trends or activities will continue in the future. As a result, Kiadis Pharma expressly disclaims any obligation or undertaking to release any update or revisions to any forward-looking statements in this press release as a result of any change in expectations or any change in events, conditions, assumptions or circumstances on which these forward-looking statements are based. Neither Kiadis Pharma nor its advisers or representatives nor any of its subsidiary undertakings or any such person's officers or employees guarantees that the assumptions underlying such forward-looking statements are free from errors nor does either accept any responsibility for the future accuracy of the forward-looking statements contained in this press release or the actual occurrence of the forecasted developments. You should not place undue reliance on forward-looking statements, which speak only as of the date of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005675/en/\nFor more information, please contact:\nKiadis Pharma:\nKarl Hård, +31 611 096 298\nHead of IR & Communications\nk.hard@kiadis.com\nor\nConsilium Strategic Communications:\nMary-Jane Elliott, Philippa Gardner, Lindsey Neville, Hendrik Thys, +44 203 709 5708\nkiadis@consilium-comms.com\nSource: Kiadis Pharma N.V.", "external_links": ["http://www.kiadis.com/company-presentation/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kiadis.com&esheet=51743416&newsitemid=20180115005675&lan=en-US&anchor=www.kiadis.com&index=1&md5=c97540dd30c2656290a47a75970c8abb", "http://www.businesswire.com/news/home/20180115005675/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kiadis.com%2Fcompany-presentation%2F&esheet=51743416&newsitemid=20180115005675&lan=en-US&anchor=http%3A%2F%2Fwww.kiadis.com%2Fcompany-presentation%2F&index=2&md5=e50a1dd1128bf4d9e907fd713616fad6"], "published": "2018-01-16T09:00:00.000+02:00", "crawled": "2018-01-16T11:02:11.000+02:00", "highlightTitle": ""}