{"organizations": [], "uuid": "f95e87aed93cd0ad70e88b9702f96194d4a4e9d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104927792-FACES_Sepulveda_96th_atLAXsmaller.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/medmens-largest-marijuana-marketing-campaign-hits-los-angeles.html", "country": "US", "domain_rank": 767, "title": "MedMen's 'largest marijuana marketing campaign’ hits Los Angeles", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-04T14:43:00.000+02:00", "replies_count": 0, "uuid": "f95e87aed93cd0ad70e88b9702f96194d4a4e9d9"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/04/medmens-largest-marijuana-marketing-campaign-hits-los-angeles.html", "ord_in_thread": 0, "title": "MedMen's 'largest marijuana marketing campaign’ hits Los Angeles", "locations": [], "entities": {"persons": [{"name": "daniel yi", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "la", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1 saw the official legalization of recreational marijuana in California, and with it a potential huge boost to an industry that one research company estimated could be worth $6 billion by 2021 .\nAnd those living in and around Los Angeles should get set for trucks driving around the city wrapped in advertising for MedMen, one of the stores \"mainstreaming marijuana,\" and a company that has spent more than $500,000 on marketing already.\nBut the ads — which have already run on billboards around LA's wider metropolitan area — won't feature any buds, blunts or bongs. Instead, the posters will show close-ups of people's faces with phrases such as \"Heal. It's legal,\" and \"Relax. It's legal.\"\nMedMen An ad for marijuana store MedMen They are real MedMen customers, said Daniel Yi, the firm's vice president of corporate communications. \"This is not about marijuana,\" he told CNBC in an email.\n\"This is about the people who use cannabis for all the reasons people have used cannabis for hundreds of years. Yes for recreation, just like alcohol, but also for wellness.\"\nMedMen lists six stores in Southern California and three in New York on its website, and Yi added that each has more than 1,000 different products. \"Many of them have nothing to do with 'getting high'… This is about giving choice and a safe and inviting environment for adults who want to make cannabis a part of their lives,\" he said.\nBloomberg | Getty Images A MedMen store in West Hollywood, California, on 2 January 2018. As well as the pure product itself, stores will sell skin creams, bath bombs and teas infused with cannabidiol (known as CBD), one of the active elements of cannabis.\nMedMen's \"Faces\" ads have featured on billboards around the Whisky a Go Go nightclub on Sunset Boulevard and the company has also run print and digital ads in what Yi claims is the \"largest marijuana marketing campaign in history.\"\nIt's an adspend that MedMen will be hoping will keep sending people into its shops. CEO Adam Bierman told CNBC's \" The Profit \" in August 2017 that each customer spends $85 on average. With about 180 customers a day, that would equate to $15,000 takings per store.\nshow chapters A hi-tech high 6:52 PM ET Mon, 7 Aug 2017 | 01:08 Until 2018, marijuana use was allowed only for medicinal purposes and not recreational purposes in California. But, as of January 1, not all businesses have yet received state licenses to sell it . Delivery business Eaze, for example, sells vaporizers, drinks and mouth sprays, among other products, and expects to be able to deliver in San Francisco from January 5.\nRules will operate in the state, governing opening hours and advertising — for example, cannabis must not be marketed to those under 21.", "external_links": [], "published": "2018-01-04T14:43:00.000+02:00", "crawled": "2018-01-04T14:49:38.004+02:00", "highlightTitle": ""}