{"organizations": [], "uuid": "65067514856e153959934f3557f2d4e0718dc724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223630511&w=1200&r=LYNXMPEE0J0HD", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-india-petcoke/india-restricts-imports-of-petcoke-for-users-in-delhi-region-idUSKBN1F90N1", "country": "US", "domain_rank": 408, "title": "India restricts imports of petcoke for users in Delhi region", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T16:15:00.000+02:00", "replies_count": 0, "uuid": "65067514856e153959934f3557f2d4e0718dc724"}, "author": "", "url": "https://www.reuters.com/article/us-india-petcoke/india-restricts-imports-of-petcoke-for-users-in-delhi-region-idUSKBN1F90N1", "ord_in_thread": 0, "title": "India restricts imports of petcoke for users in Delhi region", "locations": [], "entities": {"persons": [], "locations": [{"name": "delhi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - India’s environment ministry has placed restrictions on the use of imported petroleum coke in the capital Delhi and its surrounding region, in the latest effort to curb rising air pollution.\nAs the world’s largest consumer of petcoke, India imports over half its annual petcoke consumption of about 27 million tonnes, mainly from the United States. Local producers include Indian Oil Corp, Reliance Industries and Bharat Petroleum Corp.\n“Only consented and registered industrial units of NCR States shall be permitted to directly import pet coke and consignment shall be in the name of user industrial units for their own use,” the ministry of environment, forest and climate change said in a notification issued late on Friday.\nCement plants and other industries approved to use petcoke in the region would also need to obtain permission from the state pollution control board to continue operations, it said.\nThe ministry has also banned imports of petroleum coke for trading purposes in the capital region, the notice said, adding that even industrial units allowed to use petcoke will not be allowed to store more than three months worth of their consumption.\nIndia will also track the trade of the commodity, and has asked both sellers and consumers to submit monthly reports on\npetcoke-related transactions.\nIndia is the world’s biggest consumer of petroleum coke, which is a dark solid carbon material that emits 11 percent more greenhouse gases than coal, according to the Carnegie–Tsinghua Center for Global Policy.\nIndia’s government is in favor of imposing a wider ban on the import of petcoke, according to a government affidavit filed with its top court in December, a ruling on which is expected next month.\nReporting by Aditi Shah and Sudarshan Varadhan; Editing by Andrew Bolton and Alexander Smith\n ", "external_links": [], "published": "2018-01-20T16:15:00.000+02:00", "crawled": "2018-01-20T16:33:33.061+02:00", "highlightTitle": ""}