{"organizations": [], "uuid": "67cc6061486583e51717f9d53c27156a0f88307c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-nireland-politics/sinn-fein-summons-mp-over-indefensible-tweet-on-massacre-anniversary-idUSKBN1EX0RA", "country": "US", "domain_rank": 408, "title": "Sinn Fein summons MP over 'indefensible' tweet on massacre anniversary", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T11:44:00.000+02:00", "replies_count": 0, "uuid": "67cc6061486583e51717f9d53c27156a0f88307c"}, "author": "", "url": "https://www.reuters.com/article/us-nireland-politics/sinn-fein-summons-mp-over-indefensible-tweet-on-massacre-anniversary-idUSKBN1EX0RA", "ord_in_thread": 0, "title": "Sinn Fein summons MP over 'indefensible' tweet on massacre anniversary", "locations": [], "entities": {"persons": [{"name": "amanda ferguson", "sentiment": "none"}, {"name": "alan black", "sentiment": "none"}, {"name": "barry mcelduff", "sentiment": "none"}], "locations": [{"name": "republic of ireland", "sentiment": "none"}, {"name": "kingsmill", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "sinn fein", "sentiment": "negative"}, {"name": "ira", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BELFAST (Reuters) - Irish nationalist party Sinn Fein has summoned one of its lawmakers to explain an “indefensible” tweet on the anniversary of the day 10 Protestant textile workers were shot dead in 1976, which police blamed on the IRA.\nSinn Fein, which wants to enter government in both Northern Ireland and the Republic of Ireland, has struggled to distance itself from the violent legacy of the Provisional IRA, its former military wing, which fought a 30-year insurgency against British rule in Northern Ireland until 1998.\nBarry McElduff, who was last year elected to the British parliament, posted a video on Twitter on Friday, the anniversary of the massacre near the village of Kingsmill in which he balanced a loaf of Kingsmill brand bread on his head. He later deleted the tweet.\nAlan Black, the only survivor of the massacre in which Irish nationalist gunmen forced workers from a minibus and shot them dead at close range, told the BBC the video was “depraved” and designed to hurt relatives of the victims.\nNo one has ever been convicted for the crime, which an inquiry said was carried out by the IRA who targeted the men because of their religion. The IRA denied involvement.\nA spokesman for Sinn Fein said McElduff had been summoned to meet with the party’s leader in Northern Ireland, Michelle O‘Neill.\n“What has happened is inexcusable, it’s indefensible and the party is taking this matter very seriously,” party Chairman Declan Kearney told Irish state broadcaster RTE, declining to comment on whether McElduff might be asked to resign.\nMcElduff on Saturday apologized for the tweet, saying it was not his intention to cause offense and that he had not “imagined for a second” a possible link between the brand and the massacre.\nThe Police Service of Northern Ireland said on Saturday it was making inquiries following complaints about the tweet.\nThe 1976 massacre was one of a series of tit-for-tat attacks by Protestant paramilitaries who wanted Northern Ireland to remain part of the United Kingdom and Catholic Irish nationalists who wanted a united Ireland.\nThe 1998 peace agreement paved the way for a power-sharing government and mostly ended the cycle of violence, though some small armed groups remain.\nWriting by Conor Humphries; Editing by Robin Pomeroy\n ", "external_links": [], "published": "2018-01-08T11:44:00.000+02:00", "crawled": "2018-01-08T12:05:12.008+02:00", "highlightTitle": ""}