{"organizations": [], "uuid": "964041e87f1bf06e9f2e34940a0f7e023af9ed9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-iot-innovator-fintan-mcgovern-joins-ironclad-encryptions-advisory-board.html", "country": "US", "domain_rank": 767, "title": "IoT Innovator Fintan McGovern Joins IronClad Encryption's Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:45:00.000+02:00", "replies_count": 0, "uuid": "964041e87f1bf06e9f2e34940a0f7e023af9ed9f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-iot-innovator-fintan-mcgovern-joins-ironclad-encryptions-advisory-board.html", "ord_in_thread": 0, "title": "IoT Innovator Fintan McGovern Joins IronClad Encryption's Advisory Board", "locations": [], "entities": {"persons": [{"name": "fintan mcgovern", "sentiment": "negative"}, {"name": "mcgove", "sentiment": "negative"}, {"name": "mcgovern", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "ironclad encryption's advisory board", "sentiment": "neutral"}, {"name": "donseed ltd.", "sentiment": "none"}, {"name": "simeio trading ltd", "sentiment": "none"}, {"name": "firmwave ltd.", "sentiment": "none"}, {"name": "digicel eastern caribbean", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IoT Device Vulnerabilities Are \"A Clear and Present Danger\" to Infrastructure and Businesses, McGovern Says\nHOUSTON--(BUSINESS WIRE)-- IronClad Encryption Corporation (OTCQB: IRNC) today announced the appointment of Fintan McGovern to its advisory board. Mr. McGovern is CEO and co-founder of Internet of Things (IoT) edge to cloud platform company Firmwave Ltd. in Ireland. His appointment highlights the importance of securing IoT devices as companies extend their corporate networks out to non-traditional Internet-connected devices.\nMr. McGovern has a proven track record of senior leadership roles that span technology, operations, human resources, transformation, change management, and logistics across global channels. Before co-founding IoT design company Firmwave, he led operational change and new business integration, integrating biometrics company Donseed Ltd. and software development company Simeio Trading Ltd. Before that, he was regional HR director for Digicel Eastern Caribbean and Latin America where he directed and managed HR in 15 island markets that employ more than 1,000 individuals and have $250 million in combined annual revenues. After serving as a strategic HR planning senior manager and logistics and intelligence officer for the Irish Defence Forces, Mr. McGovern was the Transformation and Change Specialist and Communication Manager for mining company Kenmare Resources PLC in Moma, Mozambique. He holds an MBA from the University College Dublin (UCD) Michael Smurfit Graduate School of Business and a Bachelor of Business Studies (BBS with HR) from the Galway-Mayo Institute of Technology.\n\"The vulnerabilities of IoT devices are well known and hackers are actively exploiting IoT devices to gain access to corporate networks and sensitive data,\" said JD McGraw, president and CEO of IronClad Encryption. \"Fintan is a huge proponent of integrating security into IoT devices and sensor networks making them inherently more secure.\"\nFirmwave accelerates time to revenue by providing customers with everything they need to go to market from IoT sensor to cloud. The company licenses hardware, firmware and cloud management software so customers can connect, manage and maintain their IoT edge devices in an efficient and secure way.\n\"IronClad's patented cybersecurity technologies are critical for any company designing, manufacturing or using IoT devices,\" said Mr. McGovern. \"Right now, companies rely on firewalls, identity and access management and anomaly detection – all of which are necessary – but if your data isn't encrypted or you're using weak encryption key management mechanisms, you're exposing your business to dangerous and unnecessary risks.\"\nIronClad Encryption recently announced the availability of ICEMicro, a cybersecurity solution that secures communications among Docker containers. Docker containers have become popular in the software development community because they enable applications to run on any Infrastructure as a Service (IaaS) and Platform as a Service (PaaS), including Amazon Web Services (AWS) and Microsoft Azure without modification. Using IronClad's secure containers, developers can quickly and easily secure communications between software programs, devices, or software and devices.\nAccording to market research firm Gartner, the installed base of IoT devices is expected to reach 20.4 billion units by 2020. The rapid growth of IoT devices represents a huge opportunity for software developers and hardware manufacturers. However, due to many factors, including cost, power consumption and a general lack of appreciation for the risks associated with unsecured IoT devices, the market has not yet demanded that IoT devices be secure. For example, in an April 2017 survey, cybersecurity firm McAfee found that nearly half of U.S.-based companies using an IoT network have been hit by a recent security breach. IronClad's patented technologies offer a solution to the IoT market that is low cost, low power and provides unsurpassed security by any standard.\nAbout Firmwave Limited:\nFirmwave® licenses hardware, firmware and cloud device management software to build industrial grade IoT solutions for customers in healthcare, energy and logistics markets. Its Firmwave® Edge platform allows customers to reduce complexity and easily connect, manage, and maintain their edge devices in a secure way. This allows customers to focus on innovation and unleash their creativity in the IoT economy.\nAbout IronClad Encryption Corporation:\nIronClad Encryption Corporation is a next-generation cyber defense company that secures digital assets and communications across a wide range of industries and technologies. IronClad Encryption-powered solutions utilize our patented Dynamic Encryption and Perpetual Authentication technologies to make all known key-based encryption technologies virtually impossible to compromise. Dynamic Encryption Technology eliminates vulnerabilities caused by exposure of any single encryption key by continuously changing encryption keys and keeping the keys synchronized in a fault-tolerant manner. Perpetual Authentication Technology uses multiple virtual channels for encryption so that in the event one channel is compromised, the other channels maintain encryption integrity. Together, these technologies not only eliminate the single point of failure problem created by having keys exposed through brute force, side channel, or other types of attack, but do so with very low latency and system performance overhead. Developers, MSPs, MSSPs, and IT organizations can now easily and effectively integrate ultra-secure authentication and encryption measures across essentially all mediums. This includes the latest processors and operating systems, legacy hardware and software, within or between networks, and on compartmentalized data or entire databases. At rest or in-motion, IronClad Encryption ensures data remains safe, secure and uncompromised.\nVisit IronClad Encryption at www.IronCladencryption.com\nFORWARD-LOOKING STATEMENTS:\nThis press release may contain that involve substantial risks and uncertainties. The information included in this release should not be used for investment purposes because statements of intent or projections of financial performance are based on assumptions that can change. In addition, events or circumstances may arise that we can neither anticipate nor control. Therefore, any statements of intent or predictions of financial performance are valid only on the date of this press release. We undertake no obligation to update or revise publicly any , except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005429/en/\nIronClad Encryption Corporation\nMedia Contact:\nLisa Morgan, 928-284-6849\nor\nInvestor Contact:\nHalliburton Investor Relations\nTom Carey or Geralyn DeBusk, 972-458-8000\nSource: IronClad Encryption Corporation", "external_links": ["http://www.businesswire.com/news/home/20180130005429/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ironcladencryption.com&esheet=51750615&newsitemid=20180130005429&lan=en-US&anchor=IronClad+Encryption+Corporation&index=1&md5=c16b568cdac7217881d14412b604273d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.firmwave.com&esheet=51750615&newsitemid=20180130005429&lan=en-US&anchor=Firmwave+Ltd.&index=2&md5=5e2edfc3e10466dd5728fd649581cd2e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ironcladencryption.com&esheet=51750615&newsitemid=20180130005429&lan=en-US&anchor=www.IronCladencryption.com&index=3&md5=5552403545c9d3bb9838c53ff3ebfea7"], "published": "2018-01-30T14:45:00.000+02:00", "crawled": "2018-01-30T15:38:25.000+02:00", "highlightTitle": ""}