{"organizations": [], "uuid": "3a17fffc387027a198a46b72ba3b7bd6050064f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-eu-scotland/resigned-to-brexit-scots-push-case-for-staying-in-single-market-idUKKBN1FB2GG", "country": "US", "domain_rank": 408, "title": "Resigned to Brexit, Scots push case for staying in single market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:51:00.000+02:00", "replies_count": 0, "uuid": "3a17fffc387027a198a46b72ba3b7bd6050064f9"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-scotland/resigned-to-brexit-scots-push-case-for-staying-in-single-market-idUKKBN1FB2GG", "ord_in_thread": 0, "title": "Resigned to Brexit, Scots push case for staying in single market", "locations": [], "entities": {"persons": [{"name": "hyslop", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "fiona hyslop", "sentiment": "none"}, {"name": "alastair macdonald", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "scots", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:50 PM / Updated 30 minutes ago Resigned to Brexit, Scots push case for staying in single market Alastair Macdonald 4 Min Read \nBRUSSELS (Reuters) - Scotland’s government thinks campaigns to halt Brexit have little chance but believes it can persuade British negotiators to try to stay in the European Union’s single market, a senior Scottish minister said on Monday. \nSpeaking to Reuters during a two-day visit to Brussels to sound out EU diplomats and lawmakers on Britain’s upcoming talks on post-Brexit relations with the bloc, Fiona Hyslop, the devolved Scottish government external affairs minister, said talk of a new referendum or of a parliamentary U-turn on Brexit was “wishful thinking”. \n“We’ve got to be realistic here,” Hyslop said. “The UK seems to be adamant that they want to leave. We think that continued membership of the EU is what’s in the best interests of Scotland and the rest of the UK. But I think perhaps it is overly optimistic to think that would happen.” \nBritish Prime Minister Theresa May has insisted that the whole United Kingdom will leave the single market and a customs union when it leaves the European Union in March next year, although little would change in practice for another two years. \nMay is expected to offer more details next month on what her government wants in a future relationship. London has indicated it sees a broad free trade agreement, closer than a recent EU deal with Canada. But the pro-independence Scottish government says that would leave Scotland’s economy 6.1-percent smaller than it would be in 2030 if it had stayed in the EU. \nNoting that a Scottish government study last week showed that even staying in the single market would cost the economy 2.7 percentage points of GDP, Hyslop called said it was the “least worst option”. The goal was now to persuade May to seek that outcome before she finalises her negotiating position. SINGLE MARKET PUSH \nWhile a substantial majority of Scots opposed Brexit in the 2016 referendum, many of those backing May’s plan to leave the EU rule out single market and customs union membership because of Brussels’ insistence that those would mean Britain accepting open immigration from the continent and prevent it making it own free trade agreements with other countries round the world. \nBy contrast, the Scottish government argues that its ageing population means it actively wants to encourage immigration. \nHyslop said she expected May’s government to compromise on some of the “red lines” it has set out. She noted that it agreed last month to avoid regulations in Northern Ireland diverging from EU member Ireland. That, she said, showed a willingness in London to allow for regional differences that might apply to Scotland too. And it might also signal a will to keep regulation in Britain in line with the EU, as the single market demands. \n“Politics is always very volatile and we need to be looking for opportunities to take things forward,” Hyslop said. \n“We want to ensure that Scotland’s place is protected whatever scenario transpires.” \nHer nationalist government remains committed to secession and to membership of the EU but has no immediate plan to seek a rerun of the failed 2014 independence referendum. Hyslop confirmed First Minister Nicola Sturgeon’s intention to look again at a push to secede from the UK once London and Brussels have struck an outline accord late this year on a post-Brexit relationship. \nInsisting the Scottish National Party wanted to keep trade open with both the continent and with a post-Brexit England, she said that if May rejects single market membership “we reserve our position to make sure the people of Scotland have a choice”. \n“Because,” she said, “Leaving the EU will have an absolutely potentially catastrophic impact on the economy of Scotland.” Reporting by Alastair Macdonald Additional reporting by Samantha Koester Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-22T19:51:00.000+02:00", "crawled": "2018-01-22T20:39:39.050+02:00", "highlightTitle": ""}