{"organizations": [], "uuid": "f12b596bc19d5f621b4823d5d56c95ed3ae83454", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864902-RTX3K7Y6-jerome-powell.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/20910258/device/rss/rss.html", "section_title": "Economy", "url": "https://www.cnbc.com/2018/01/10/the-fed-worrying-about-the-next-recession-considers-changes.html", "country": "US", "domain_rank": 767, "title": "The Fed, worrying about the next recession, considers changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:00:00.000+02:00", "replies_count": 0, "uuid": "f12b596bc19d5f621b4823d5d56c95ed3ae83454"}, "author": "Steve Liesman", "url": "https://www.cnbc.com/2018/01/10/the-fed-worrying-about-the-next-recession-considers-changes.html", "ord_in_thread": 0, "title": "The Fed, worrying about the next recession, considers changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GDP outlook The Fed, worrying about the next recession, considers changes More and more, Fed officials are beginning to think seriously about a dramatic change to monetary policy that would revise or even scrap its current, flailing 2 percent inflation target. Economist Larry Summers notes that the Fed typically has lowered interest rates by 5 percentage points over time to stimulate the economy in recessions, but it doesn't have 5 points now. The solution gaining the most traction and mention by officials and academics is called \"price-level targeting.\" 1 Hour Ago | 02:41 \nEven while the economy and markets are booming, Federal Reserve officials are worrying about how they'll respond to the next recession, and they don't especially like the picture they see. \nIt's one where the economy starts contracting but the Fed, still at a low interest rate, has little ability to respond. It lowers rates to zero but that amounts to only a fraction of the stimulus it has provided in past downturns. Once again, the Fed faces the quandary of what more it can do when it's at zero and can't cut anymore and is forced to contemplate extraordinary, uncertain and controversial measures like quantitative easing . \nMore and more, Fed officials and academic economists are wondering if there's a better way and beginning to think seriously about a dramatic change to monetary policy that would revise or even scrap its current, flailing 2 percent inflation target. \nThe Fed has missed that target almost since it was implemented in 2012, undermining its credibility in markets and possibly entrenching expectations that inflation will always run below target. \nFormer Treasury Secretary Larry Summers, speaking at a Brookings Institution conference this week on the Fed's inflation target problem, urged the Fed to get moving on a fix. He noted that the Fed typically has lowered interest rates by 5 percentage points over time to stimulate the economy in recessions. The Fed doesn't have 5 points now, so the next recession will find the central bank less able to kick-start growth, possibly enabling a longer, deeper downturn. \nSource: Larry Summers \n\"The overwhelming likelihood is that when recession comes, policy will not have sufficient room to cut rates as much as it would like to within the current framework,'' Summers said. \nQuoting a recent research paper, Summers suggested the Fed could be at a zero interest rate 30 to 40 percent of the time in the future unless it changes its current regime. \"I am completely unconvinced that (quantitative easing) can be our salvation next time around,'' Summers said. Out of fiscal bullets as well? \nThe recent tax bill, which boosted the deficit outlook, means the fiscal side will have less ability to respond next time around as well. \nThe solution gaining the most traction and mention by officials and academics is called \"price-level targeting,\" and at least three Fed officials in recent weeks have talked about it, though with varying levels of support. Currently, Fed policy calls for the Fed to hit a 2 percent inflation target over time. It continues to shoot for that inflation rate even while it continuously misses that goal. \nPrice-level targeting would ratchet up the seriousness of the effort. It would account for those past misses and prompt the Fed to aim for a higher target in the future to make up for its prior shortcomings. The belief is that this would convince markets and consumers of the Fed's commitment, running a higher inflation rate to account for prior gaps. \n\"The price-level target will keep rates lower for longer,'' San Francisco Fed President John Williams said at the Brookings conference. Williams has been among the most outspoken advocates of making the change. \nOver time, it's hoped that a price-level target would keep the Fed away from zero, giving the policymakers ammunition to fight the next recession. \nCleveland Fed President Loretta Mester spoke last week on several changes, including price-level targeting, saying the Fed could consider changes to its inflation target, but she was careful not to advocate any single solution. \n\"Each framework is worthy of further study, and now may be an appropriate time to undertake such study because the economy is growing, labor markets are strong and inflation is projected to move back to our goal,\" Mester said. \nBoston Fed President Eric Rosengren also advocated discussion of the topic, noting the Fed's persistent failure to hit its target. \n\"The Great Recession was a big enough event that we might want to reassess and say, \"How do we make sure we don't have those kinds of events?\" he said at Brookings. \nThere's little conviction that price-level targeting or any of the alternatives is a silver bullet. Some wonder why the Fed, if it can't hit its inflation target, will be able to hit a price-level target. By advocating higher inflation for a time, there's concern that the Fed will introduce more volatility to both inflation and growth. \nAnd practically speaking, any change is a long way off. Fed Chairman nominee Jerome Powell hasn't been approved yet by the Senate, though he's supposed to start his term in three weeks. Former Fed Chairman Ben Bernanke, an advocate of a variant of price-level targeting, says the new chairman will likely appoint a committee to discuss the issue and the debate could take a year to 18 months. \n\"Somewhere in 2019 there will be some pretty serious discussions,\" Bernanke said. \nAt the slow pace that the Fed changes policy and regimes, if it wants to change something in two years, it better begin talking about it now. But no one can say if that change will take place in time for the next downturn. WATCH: Benefits of tax cuts could be reduced by higher rates show chapters", "external_links": [], "published": "2018-01-10T20:00:00.000+02:00", "crawled": "2018-01-10T19:11:34.003+02:00", "highlightTitle": ""}