{"organizations": [], "uuid": "c3f4c2d713457a3bf6dae57e73c59ae925d704d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-mistras-group-names-edward-j-prajzner-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "MISTRAS Group Names Edward J. Prajzner Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "c3f4c2d713457a3bf6dae57e73c59ae925d704d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-mistras-group-names-edward-j-prajzner-chief-financial-officer.html", "ord_in_thread": 0, "title": "MISTRAS Group Names Edward J. Prajzner Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "dennis m. bertolotti", "sentiment": "none"}, {"name": "prajzner", "sentiment": "none"}, {"name": "jon wolk", "sentiment": "none"}, {"name": "jon", "sentiment": "none"}, {"name": "edward j. prajzner", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "princeton junction", "sentiment": "none"}], "organizations": [{"name": "mistras group names edward j. prajzner", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "mistras group, inc.", "sentiment": "neutral"}, {"name": "mistras group", "sentiment": "none"}, {"name": "ceco environmental corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRINCETON JUNCTION, N.J., Jan. 08, 2018 (GLOBE NEWSWIRE) -- MISTRAS Group, Inc. (NYSE:MG), a leading \"one source\" global provider of technology-enabled asset protection solutions, named Edward J. Prajzner its new Senior Vice President and Chief Financial Officer, effective January 5, 2018.\nPrior to joining MISTRAS Group, Mr. Prajzner served as Chief Financial Officer of CECO Environmental Corporation, a global service provider to environmental, energy and filtration industries.\nDennis M. Bertolotti, MISTRAS President and Chief Executive Officer, stated: \"We are pleased to have Ed join the MISTRAS team. He brings us extensive experience as a senior financial officer who helps drive effective accounting and internal control disciplines. We look forward to leveraging his expertise, which includes a strong track record in managing the balance sheet and investor relations. I want to thank Jon Wolk for functioning as both our Chief Operating Officer and our acting Chief Financial Officer for these last several months. Effective with Ed joining the Company, Jon is transferring to Ed his former responsibilities as Chief Financial Officer.\"\nPrior to serving as CECO Environmental's CFO, Mr. Prajzner, a CPA, began his career at Ernst & Young before holding senior finance roles at CDI Corporation (now AE Industrial Partners), and American Infrastructure (now Allan Myers). He earned a BS from Villanova University and an MBA from Temple University.\nAbout MISTRAS Group, Inc.\nMISTRAS is a leading “one source” global provider of technology-enabled asset protection solutions used to evaluate the structural integrity of critical energy, industrial and public infrastructure. Mission critical services and solutions are delivered globally and provide customers with asset life extension, improved productivity and profitability, compliance with government safety and environmental regulations, and enhanced risk management operational decisions.\nMISTRAS uniquely combines its industry-leading products and technologies - 24/7 on-line monitoring of critical assets; mechanical integrity (MI) and non-destructive testing (NDT) services; destructive testing (DT) services; process and fixed asset engineering and consulting services; and its world class enterprise inspection data management and analysis software (PCMS™) to provide comprehensive and competitive products, systems and services solutions from a single source provider.\nFor more information, please visit the company's website at http://www.mistrasgroup.com or contact Nestor S. Makarigakis, Group Director, Marketing Communications at marcom@mistrasgroup.com .\nSource:MISTRAS Group, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/879ffacb-9208-46c9-ad88-c0619e3ddeb1"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:04:34.005+02:00", "highlightTitle": ""}