{"organizations": [], "uuid": "71ab66a4264f5f4c78e9f2f3d6205b5722739f92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/04/103444369-GettyImages-91837301.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/this-rollover-mistake-can-sink-your-retirement-savings.html", "country": "US", "domain_rank": 767, "title": "This rollover mistake can sink your retirement savings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-02T16:05:00.000+02:00", "replies_count": 0, "uuid": "71ab66a4264f5f4c78e9f2f3d6205b5722739f92"}, "author": "Lorie Konish", "url": "https://www.cnbc.com/2018/01/02/this-rollover-mistake-can-sink-your-retirement-savings.html", "ord_in_thread": 0, "title": "This rollover mistake can sink your retirement savings", "locations": [], "entities": {"persons": [{"name": "slott", "sentiment": "none"}, {"name": "ed slott", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ed slott & co.", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When you decide to move your individual retirement account, you want to avoid one error that can make all of your money taxable.\nSavers may choose to roll over their retirement funds because they have changed employers or want to access different investment options.\n\"Be very careful to avoid this fatal trap of getting caught in the once-per-year IRA rollover rule,\" said Ed Slott, founder of Ed Slott & Co. and an expert on individual retirement accounts.\nThe right way to roll over an IRA is to do a direct trustee-to-trustee or bank-to-bank transfer, Slott told CNBC. That way, the money goes from one IRA to another and never touches your hands.\nYou want to avoid the other way of rolling over an IRA, Slott said, which is the 60-day rollover. This transaction results in the money leaving your IRA with a check payable to you. You then have 60 days to transfer the money into another IRA.\nThe problem with this is that you can only do one per year. That one-year limitation is not according to the calendar year, Slott cautioned, but every 365 days. The once-per-year IRA rollover rule also applies to both IRAs and Roth IRAs.\n\"If you do a second rollover, it's taxable. It cannot be fixed,\" Slott said.\nIf you have already completed one rollover in the last 12 months, the full amount of your IRA could become taxable if you do another rollover. Plus, those who are under 59½ will face a 10 percent penalty.\n\"Worst of all, you don't have the IRA tax shelter anymore,\" Slott said. \"You don't have an IRA.\"\nMore from Personal Finance:\nMissing this key retirement deadline could trigger a 50% tax penalty\nTax bill kills this key strategy for how you save for retirement\nThis year-end donation move could reap big savings for retirees", "external_links": [], "published": "2018-01-02T16:05:00.000+02:00", "crawled": "2018-01-02T16:19:18.033+02:00", "highlightTitle": ""}