{"organizations": [], "uuid": "ba19d7444ce49cd3a242e1f14ae8025b7d7dd734", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226766247&w=1200&r=LYNXMPEE0U01N", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-nep/typecast-patriots-take-stage-again-as-super-bowl-villains-idUSKBN1FK04C", "country": "US", "domain_rank": 408, "title": "Typecast Patriots take stage again as Super Bowl villains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:46:00.000+02:00", "replies_count": 0, "uuid": "ba19d7444ce49cd3a242e1f14ae8025b7d7dd734"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-nep/typecast-patriots-take-stage-again-as-super-bowl-villains-idUSKBN1FK04C", "ord_in_thread": 0, "title": "Typecast Patriots take stage again as Super Bowl villains", "locations": [], "entities": {"persons": [{"name": "steve keating", "sentiment": "none"}, {"name": "vince lombardi", "sentiment": "none"}], "locations": [{"name": "santa", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "typecast patriots", "sentiment": "negative"}, {"name": "nfl", "sentiment": "none"}, {"name": "national football league", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS (Reuters) - Every great drama needs a hero and a villain and on Sunday the New England Patriots will assume their role as the National Football League’s most hated team when they take on the Philadelphia Eagles in the Super Bowl.\nFor the Patriots it is type-casting. On the NFL stage they play no other role. Fans criticise them for being just too successful in a league designed to not have dynasties and can not forgive two rule-bending scandals in the last decade.\nThe Eagles, however, are far from angels. Their fans after all once booed Santa and pelted him with snow balls.\nBut such behavior can be overlooked alongside what has become known as the New England Evil Empire, a championship machine that operates with ultimate efficiency.\nThey have reached the Super Bowl for the eighth time since 2002, hoisting the Vince Lombardi trophy five times, including twice in the past three seasons.\nThe Patriots, however, have also twisted the rules to their advantage -- including videotaping opposition coaches in 2007 and deliberately under-inflating balls in a playoff game in 2015 -- which have left a tarnish on their legacy.\nIt is a role Patriots owner Robert Kraft understands.\n“When I actually bought the Patriots there were 23 lawsuits out. I know the league was thinking about buying the team and everyone was so nice to me for those first few years,” Kraft told reporters during Super Bowl Opening Night on Monday.\n”Once we went to the Super Bowl in 1996 a lot of the people who were kind and gracious, changed.\n“Everyone loves a door mat in this league.”\nIt is that kind of attitude that resulted in a Public Policy Poll released just before last year’s Super Bowl that showed their quarterback Tom Brady and coach Bill Belichick were at the top of the most hated list.\nJan 21, 2018; Foxborough, MA, USA; New England Patriots quarterback Tom Brady (12) celebrates with wide receiver Danny Amendola (80) after a touchdown during the fourth quarter against the Jacksonville Jaguars in the AFC Championship Game at Gillette Stadium. Mandatory Credit: Greg M. Cooper-USA TODAY Sports Belichick could take some small comfort in that fans disliked NFL commissioner Roger Goodell more.\nBrady, however, is a more enigmatic figure. The poll also found him to the NFL’s most popular quarterback as well.\nFor fans outside of New England, however, he is simply too smug, too rich and too good.\nIn the Super Bowl setting it is hard to see what anyone could dislike about Brady.\nJan 21, 2018; Foxborough, MA, USA; New England Patriots players including Devin McCourty (32) and Brandin Cooks (14) celebrate after defeating the Jacksonville Jaguars in the AFC Championship Game at Gillette Stadium. Mandatory Credit: Mark J. Rebilas-USA TODAY Sports He arrived at Opening Night, smiled, answered questions, was playful and disarming.\nBut there is also the win at all costs Brady who was suspended four games for his part in deflating the balls.\nBelichick, on the other hand, emanates a ‘keep your distance’ vibe and appears to endure media conferences rather than enjoy them and rarely gives anything away.\nOnly Kraft is willing to offer a hint about the deeper philosophy.\n”I think it’s good (there is a team like the Patriots) but there are 31 other cities that don’t agree,“ said Kraft. ”I understand everyone wants their team to win.\n”I‘m just happy we are in our position.\n”Every roof has a leak, every heart has some sadness, you just work through it and you do your best.\n“Someone out there will work hard and take us down but I hope it’s not this Sunday.”\nEditing by Greg Stutchbury\n ", "external_links": [], "published": "2018-01-31T02:46:00.000+02:00", "crawled": "2018-01-31T02:57:34.002+02:00", "highlightTitle": ""}