{"organizations": [], "uuid": "b4db58d45b3405b936a58462581a72035cbf6b50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-quantcast-appoints-robert-horler-as-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Quantcast appoints Robert Horler as Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:25:00.000+02:00", "replies_count": 0, "uuid": "b4db58d45b3405b936a58462581a72035cbf6b50"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-quantcast-appoints-robert-horler-as-chief-operating-officer.html", "ord_in_thread": 0, "title": "Quantcast appoints Robert Horler as Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "robert horler", "sentiment": "negative"}, {"name": "horler", "sentiment": "none"}, {"name": "rob horler", "sentiment": "none"}, {"name": "konrad feldman", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "executive leadership team", "sentiment": "none"}, {"name": "dentsu aegis network", "sentiment": "none"}, {"name": "dentsu", "sentiment": "none"}, {"name": "quantcast's board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 8, 2018 /PRNewswire/ -- Quantcast, the world's largest AI-driven audience behavior platform for the open Internet, today announced the appointment of Rob Horler as Chief Operating Officer effective immediately. In this newly-created executive role, Mr. Horler's responsibilities will include oversight and leadership of global commercial operations, including the sales and services organization, as the company prepares for its next phase of growth. Based in the company's New York office, he will report to Quantcast's Chief Executive Officer and Founder Konrad Feldman and will serve on the company's Executive Leadership Team. Mr. Horler will also join Quantcast's Board of Directors.\nA highly-respected industry leader, Mr. Horler has served as a senior executive in multiple roles across the Dentsu Aegis Network for over 19 years. Most recently, he served as CEO of Dentsu Aegis U.S. which under his leadership grew significantly, doubling its business through a combination of new clients and M&A with a particular focus on scaling its data and technology capabilities. In 2016, Dentsu Aegis U.S. acquired seven US-based companies, including Accordant, Cardinal Path and Merkle.\nPrior to his Dentsu Aegis U.S. CEO appointment in 2015, Mr. Horler was CEO of Dentsu Aegis Network Northern Europe and CEO of Aegis Media U.K. In 2004, Mr. Horler founded Difiiniti, which became one of the largest standalone digital planning and buying companies in the U.K. before becoming part of the iProspect network in 2009. He originally joined the Dentsu Aegis Network as Managing Partner for Carat Interactive in 2000.\n\"Rob is that rare combination of someone who is both strategic and technical. In a career that spans over 25 years, he deeply understands how technology has been disrupting marketing and the growth challenges facing brands,\" said Mr. Feldman. \"Given his wealth of hands-on experience advising clients, managing large scale global organizations and developing talent and teams, I'm thrilled to have him join Quantcast so we can further our mission to help brands grow in the AI era.\"\n\"I've had the opportunity to work with Konrad and the Quantcast team over many years and I've been consistently impressed with their talent and technology. Since its founding in 2006, the company has been a true pioneer building the real-time pulse of the open Internet. Through the powerful combination of 1st party data, self-adapting predictive models and cutting edge artificial intelligence, Quantcast now runs the largest consumer behavior graph that helps brands discover new customers that will drive incremental growth,\" said Rob Horler. \"While some may dismiss it as a buzzword, AI will be the most important and disruptive technology of the 21st century. It will transform every customer experience, every company and every industry. I'm excited to join the team and help the marketing ecosystem harness the power of machine learning to inspire human learning.\"\nAbout Quantcast\nQuantcast is on a mission to help brands grow in the AI era. We are creating the System of Intelligence for the marketing ecosystem so clients can make every customer engagement smarter, faster and more relevant. Since 2006, we've been building \"Q\" - the world's largest AI-driven audience behavior platform for the open Internet that today directly quantifies over 100 million web and mobile destinations. Comprised of Internet-scale 1 st party data, self-adapting predictive models and integrated AI optimization, Q's collection of machine learning technologies continually interprets the consumer behavior graph giving brands a real-time pulse of the Internet. Q powers the Quantcast Intelligence Cloud, our suite of audience insights, targeting and measurement solutions designed to understand, influence, convert and measure the consumer journey. Marketers, agencies, consultancies and publishers use the Quantcast Intelligence Cloud to discover new customers, drive incremental growth and deliver business outcomes. As a global technology company, Quantcast operates in 10 countries with headquarters in San Francisco. For more information, visit quantcast.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/quantcast-appoints-robert-horler-as-chief-operating-officer-300578712.html\nSOURCE Quantcast", "external_links": ["http://www.prnewswire.com/news-releases/quantcast-appoints-robert-horler-as-chief-operating-officer-300578712.html"], "published": "2018-01-08T16:25:00.000+02:00", "crawled": "2018-01-08T19:39:47.075+02:00", "highlightTitle": ""}