{"organizations": [], "uuid": "020411d33e4300e6d09f14e518bdc57f67434822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-presidio-inc-announces-appointment-of-neil-johnston-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Presidio, Inc. Announces Appointment of Neil Johnston as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "020411d33e4300e6d09f14e518bdc57f67434822"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-presidio-inc-announces-appointment-of-neil-johnston-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Presidio, Inc. Announces Appointment of Neil Johnston as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "neil johnston", "sentiment": "negative"}, {"name": "paul fletcher", "sentiment": "none"}, {"name": "bob cagnazzi", "sentiment": "none"}, {"name": "cagnazzi", "sentiment": "none"}, {"name": "fletcher", "sentiment": "none"}, {"name": "johnston", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "neil", "sentiment": "none"}], "locations": [{"name": "presidio", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "presidio, inc", "sentiment": "neutral"}, {"name": "digital infrastructure", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Presidio, Inc. (NASDAQ:PSDO) (together with its subsidiaries, “Presidio” or the “Company”), a leading North American IT solutions provider delivering Digital Infrastructure, Cloud and Security solutions to middle-market customers, today announced that Neil Johnston has been appointed Chief Financial Officer, effective immediately. Mr. Johnston will succeed Paul Fletcher, who has decided to retire after serving as the Company’s Chief Financial Officer since 2007. Mr. Fletcher will continue to serve in an advisory capacity to help ensure a smooth transition.\n“I would like to thank Paul for his tremendous contributions to Presidio as CFO over the last ten years, during which time he has built a strong and capable finance and accounting organization,” said Bob Cagnazzi, Chief Executive Officer of Presidio. “I am thankful for Paul’s leadership and service and I wish him well in his retirement.”\nMr. Cagnazzi added, “On behalf of our board and management team, I welcome Neil Johnston to Presidio. Neil has a long tenure serving in various leadership roles and has exceptional experience as a public company financial and operational executive.”\nMr. Johnston commented, “It is a tremendous opportunity to join Presidio. I am fully committed and eager to help Presidio continue to execute on its financial and operational goals. I look forward to contributing my skills and working with the team to promote Presidio’s strategic growth initiatives and drive maximum value for our shareholders.”\nPrior to joining Presidio, Mr. Johnston served as Executive Vice President and Chief Financial Officer of Cox Automotive, the largest marketplace and leading provider of Software Solutions to auto dealers throughout the U.S. In this role, Mr. Johnston was responsible for overseeing the company’s finance and strategy functions including accounting, financial planning and analysis, financial reporting, procurement and billing, corporate development and strategic planning. Before working for Cox Automotive, Mr. Johnston served as Executive Vice President of Strategy and Digital Innovation at Cox Media Group (CMG), where he was responsible for driving strategic growth initiatives within the company and oversaw integrated digital strategy, operations and innovation. Prior to this, he served as Chief Financial Officer of CMG from 2009 to 2012, was the CFO of Cox Radio from 2000 until 2009 and he began his career with Cox Enterprises in 1996, serving in various financial and business development roles. Prior to joining Cox, Mr. Johnston worked for Coca-Cola Enterprises, Inc. and Deloitte and Touche, LLP.\nMr. Johnston holds an MBA from the Wharton School of the University of Pennsylvania and degrees in accounting, finance and information systems from Georgia State University and the University of Cape Town, South Africa. He is a certified public accountant and a chartered accountant.\nABOUT PRESIDIO\nPresidio is a leading North American IT solutions provider focused on Digital Infrastructure, Cloud and Security solutions. We deliver this technology expertise through a full life cycle model of professional, managed, and support services including strategy, consulting, implementation and design. By taking the time to deeply understand how our clients define success, we help them harness technology advances, simplify IT complexity and optimize their environments today while enabling future applications, user experiences, and revenue models. We serve approximately 7,000 middle-market, large, and government organizations across a diverse range of industries. More than 2,700 Presidio professionals, including more than 1,500 technical engineers, are based in 60+ offices across the United States in a unique, local delivery model combined with the national scale of a $2.8 billion dollar industry leader. We are passionate about driving results for our clients and delivering the highest quality of service in the industry. Presidio is controlled by funds affiliated with Apollo Global Management, LLC (NYSE:APO).\nSAFE HARBOR STATEMENT UNDER THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nThis press release contains “forward looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. The use of words such as “anticipates,” “expects,” “intends,” “plans” and “believes,” among others, generally identify forward-looking statements. These forward-looking statements include statements relating to: appointment and retirement of personnel, future financial performance, business prospects and strategy, anticipated trends, prospects in the industries in which our businesses operate and other similar matters. These forward looking statements are based on management’s current expectations and assumptions about future events, which are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Actual results could differ materially from those contained in these forward looking statements for a variety of reasons, including, among others: risks and uncertainties related to the capital markets, changes in senior management at Presidio, changes in our relationship with our vendor partners, adverse changes in economic conditions, risks resulting from a decreased demand for Presidio’s information technology solutions, risks relating to rapid technological change in Presidio’s industry and risks relating to acquisitions or regulatory changes. Certain of these and other risks and uncertainties are discussed in Presidio’s filings with the Securities and Exchange Commission. Other unknown or unpredictable factors that could also adversely affect our business, financial condition and results of operations may arise from time to time. In light of these risks and uncertainties, these forward looking statements may not prove to be accurate. Accordingly, you should not place undue reliance on these forward looking statements, which only reflect the views of our management as of the date of this press release. We do not undertake to update these forward-looking statements.\nSource: Presidio, Inc.\nCONTACT INFORMATION\nInvestor Relations Contact:\nEd Yuen\n866-232-3762\ninvestors@presidio.com\nMedia Contact:\nDori White\nVice President of Corporate Marketing\n212-324-4301\ndoriwhite@presidio.com\nSource:Presidio, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/fae183d3-3a53-4913-af7e-ac6d6a9520ac"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:17:55.007+02:00", "highlightTitle": ""}