{"organizations": [], "uuid": "1621a18c15dd163e17df0c4ac5d8ad50bf01d128", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/essity-results/update-1-swedens-essity-shrugs-off-pulp-cost-rise-to-beat-profit-forecasts-idUSL8N1PK39L", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Sweden's Essity shrugs off pulp cost rise to beat profit forecasts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:55:00.000+02:00", "replies_count": 0, "uuid": "1621a18c15dd163e17df0c4ac5d8ad50bf01d128"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/essity-results/update-1-swedens-essity-shrugs-off-pulp-cost-rise-to-beat-profit-forecasts-idUSL8N1PK39L", "ord_in_thread": 0, "title": "UPDATE 1-Sweden's Essity shrugs off pulp cost rise to beat profit forecasts", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "anna ringstrom", "sentiment": "negative"}], "locations": [{"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "sca", "sentiment": "none"}, {"name": "essity", "sentiment": "none"}, {"name": "tena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bsn medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds detail, background, share reaction, company comments)\nBy Anna Ringstrom\nSTOCKHOLM, Jan 25 (Reuters) - Swedish hygiene products group Essity posted a bigger than expected rise in fourth-quarter core profit on Thursday as sales of higher priced products and growth in emerging markets helped it to offset rising pulp costs.\nOperating profit before amortisation and one-off items at Essity, which was spun off from SCA in 2017 and whose products range from diapers to toilet paper, rose 13 percent from a year earlier to 3.62 billion crowns ($458 million).\nAnalysts’ mean forecast in a Reuters poll had been for a 9 percent increase.\nExcluding currency effects and medical equipment firm BSN Medical, which Essity bought in April 2017, profit growth was 3 percent.\nForest products group SCA had been growing its hygiene products operations rapidly in the years leading up to the spin-off, betting ageing populations and rising incomes in emerging markets would drive long-term demand.\nBut the listing of Essity, a market leader in incontinence products with the brand TENA and in professional hygiene with Tork, came at a time of rising pulp prices, while competition has stiffened, making it harder to pass on costs to customers.\nIn the fourth quarter, however, Essity said a better price mix - more sales of higher priced products - and growth in emerging markets helped to offset the higher pulp costs.\nEssity’s shares were up 2.6 percent at 1119 GMT, reducing the decline in the stock since its market debut to 3 percent.\nRival Kimberly-Clark this week announced large staff cuts and predicted meagre sales growth in 2018 due to the tough market conditions.\nProcter & Gamble on the same day reported a quarterly gross margin squeeze partly due to higher commodity costs.\nEssity’s organic growth remained below its 3 percent target in the quarter, but was in line with the previous quarter at 1.8 percent. Organic sales in emerging markets grew 5.9 percent while in mature markets they were roughly unchanged.\nExecutives warned analysts on a conference call that Essity expects significantly higher raw material costs again in the first quarter, and that although it anticipates pushing through price hikes this year, the effects will show only gradually from the second quarter.\nThe group proposed a 2017 dividend of 5.75 crowns per share, broadly meeting expectations.\n$1 = 7.9024 Swedish crowns Reporting by Anna Ringstrom; Editing by Niklas Pollard and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T20:55:00.000+02:00", "crawled": "2018-01-26T21:43:07.007+02:00", "highlightTitle": ""}