{"organizations": [], "uuid": "a6ee986d47c1303c89ef60c75b1069fa752628d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-erelevance-expands-leadership-team-with-two-executive-hires.html", "country": "US", "domain_rank": 767, "title": "eRelevance Expands Leadership Team with Two Executive Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.1, "site_type": "news", "published": "2018-01-30T22:42:00.000+02:00", "replies_count": 0, "uuid": "a6ee986d47c1303c89ef60c75b1069fa752628d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-erelevance-expands-leadership-team-with-two-executive-hires.html", "ord_in_thread": 0, "title": "eRelevance Expands Leadership Team with Two Executive Hires", "locations": [], "entities": {"persons": [{"name": "skidmore", "sentiment": "none"}, {"name": "travis skidmore", "sentiment": "none"}, {"name": "rafael landestoy", "sentiment": "none"}, {"name": "landestoy", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "erelevance corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 30, 2018 /PRNewswire/ -- eRelevance Corporation , the leading customer marketing service for small- to medium-size businesses, today announced the appointments of Rafael Landestoy as vice president of business development and Travis Skidmore as vice president of client success and retention.\nLandestoy will lead the company in identifying, structuring and closing strategic partnership deals to drive topline sales growth. He brings to eRelevance a decade of sales experience in high-growth healthcare technology startups, including PatientPop and Counsyl.\nIn his new role at eRelevance, Skidmore will lead client success and retention, working to build strong relationships while identifying new revenue opportunities from existing clients. Previously, Skidmore was vice president of client success at SpiceCSM, where he achieved 100 percent retention in the customer account base, as well as annual recurring revenue growth in 90 percent of customer accounts, with an average customer growth rate of 155 percent.\n\"We are excited about these strong new additions to our team,\" says eRelevance CEO and Co-founder Bob Fabbio. \"Rafael's expertise in healthcare technology sales makes him a valuable addition to our business development team as we outpace growth benchmarks in response to demand for our customer marketing service. Travis has an extraordinary track record of retaining and growing existing clients and will be instrumental as we continue to deepen relationships with our clients for long-term success and to reach our annual recurring revenue goals.\"\nClients who choose eRelevance have seen an average of five dollars back for every dollar spent, proving the ROI of its services. These appointments support the company's continued efforts to bring affordable marketing sophistication to small businesses.\nAbout eRelevance Corporation\neRelevance powers its clients' growth with a game-changing customer marketing service that increases the lifetime value of their customers. Pioneering the category of customer marketing automation as a service, the company provides sophisticated customer marketing done by marketing experts equipped with advanced, proprietary technology. By simplifying sophisticated customer marketing and making it available at an affordable price, eRelevance has earned the trust of over 1,100 small businesses, with a focus on delivering consistent and measurable business impact.\nPrivately funded and based in Austin, Texas, eRelevance is one of Entrepreneur magazine's 2017 Best Entrepreneurial Companies in America, a Red Herring Global 100 winner, one of BuiltInAustin's Top 50 Startups to Watch, Austin Inno's 50 on Fire, and a member of the Forbes Agency Council. For more information, visit erelevancecorp.com .\nMedia Contact:\nCassady Nordeen\ncassady@blastpr.com\n(718) 644-0273\nContact:\nCatherine DeStasio\ncdestasio@erelvancecorp.com\nPhotos:\nhttps://www.prlog.org/12689282\nPress release distributed by PRLog\nView original content: http://www.prnewswire.com/news-releases/erelevance-expands-leadership-team-with-two-executive-hires-300590494.html\nSOURCE eRelevance", "external_links": ["http://erelevancecorp.com/", "http://www.prnewswire.com/news-releases/erelevance-expands-leadership-team-with-two-executive-hires-300590494.html", "https://www.prlog.org/", "https://www.prlog.org/12689282", "http://www.erelevancecorp.com/"], "published": "2018-01-30T22:42:00.000+02:00", "crawled": "2018-01-31T00:38:05.000+02:00", "highlightTitle": ""}