{"organizations": [], "uuid": "fd26476871d6e7ecd88071c43783cbd77388d750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-strayer-education-inc-stockholders-approve-proposed-merger-with-capella-education-company.html", "country": "US", "domain_rank": 767, "title": "Strayer Education, Inc. Stockholders Approve Proposed Merger with Capella Education Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:05:00.000+02:00", "replies_count": 0, "uuid": "fd26476871d6e7ecd88071c43783cbd77388d750"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-strayer-education-inc-stockholders-approve-proposed-merger-with-capella-education-company.html", "ord_in_thread": 0, "title": "Strayer Education, Inc. Stockholders Approve Proposed Merger with Capella Education Company", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}], "organizations": [{"name": "capella education company herndon", "sentiment": "negative"}, {"name": "strayer education, inc", "sentiment": "neutral"}, {"name": "strayer education, inc.", "sentiment": "neutral"}, {"name": "capella education company", "sentiment": "none"}, {"name": "strategic education, inc.", "sentiment": "none"}, {"name": "capella university", "sentiment": "none"}, {"name": "strayer university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERNDON, Va.--(BUSINESS WIRE)-- Strayer Education, Inc. (NASDAQ: STRA) announced today that at a special meeting this morning, its stockholders approved proposals to effect the previously announced merger between Strayer Education, Inc. and Capella Education Company. These stockholder approved proposals, which will take effect at the time of the consummation of the merger, include an increase in the number of the company’s authorized shares of common stock to 32,000,000; the issuance of shares of Strayer Education, Inc. common stock to effectuate the merger; and the change of the company’s name from “Strayer Education, Inc.” to “Strategic Education, Inc.”\nAs a result of the proposed merger, Strategic Education, Inc. will be the corporate entity under which both Strayer University and Capella University will continue to operate as independent and separately accredited institutions. Together, the two universities will serve approximately 80,000 students across all 50 states. The combination is expected to achieve corporate level efficiencies that will enable each university to accelerate innovations that improve affordability, and enhance academic and career outcomes for students. The proposed merger, which is anticipated to close in the third quarter of 2018, is subject to the satisfaction of customary closing conditions, including approvals by the Department of Education, State regulators, and relevant accreditation bodies.\nStrayer Education, Inc. also announced today that it will host a conference call to discuss its fourth quarter earnings on Friday, March 2 at 8:30 a.m. (ET). A news release outlining the financial results will be issued after the market closes on Thursday, March 1. To participate in the live call on March 2, investors should dial (877) 303-9047 ten minutes prior to the start time. In addition, the call will be available via webcast. To access the live webcast of the conference call, please go to www.strayereducation.com 15 minutes prior to the start time of the call to register. Following the call, the webcast will be archived and available at www.strayereducation.com .\nAbout Strayer Education, Inc.\nStrayer Education, Inc. (NASDAQ: STRA) is educating a more competitive and qualified workforce by solving higher education’s most challenging problems. It includes Strayer University , a regionally accredited institution that delivers affordable degree programs for working adults, and a Top 25 Princeton Review-ranked executive MBA program through the Jack Welch Management Institute . Non-degree web and mobile application development courses are offered through the New York Code + Design Academy . Strayer also transforms the workforces of its corporate partners through customized degree and professional development programs. By deploying innovative teaching methods and technologies that enhance student learning outcomes, Strayer makes it possible for working adults to acquire the skills they need to succeed in today’s rapidly changing economy.\nForward Looking Statements\nThis communication contains certain forward-looking statements made pursuant to the Private Securities Litigation Reform Act of 1995 (the “Reform Act”). Such statements may be identified by the use of words such as “expect,” “estimate,” “assume,” “believe,” “anticipate,” “will,” “forecast,” “outlook,” “plan,” “project,” or similar words and may include statements with respect to, among other things, the proposed merger of a wholly-owned subsidiary of Strayer with and into Capella, including the expected timing of completion of the Merger; the anticipated benefits of the Merger, including estimated synergies; the combined company’s plans, objectives and expectations; future financial and operating results; and other statements that are not historical facts. The statements are based on Strayer’s current expectations and are subject to a number of assumptions, uncertainties and risks. In connection with the safe-harbor provisions of the Reform Act, Strayer has identified important factors that could cause Strayer’s actual results to differ materially from those expressed in or implied by such statements. The assumptions, uncertainties and risks include:\nthe risk that the Merger may not be completed in a timely manner or at all due to the failure to satisfy other conditions (including obtaining required regulatory and educational agency approvals) to completion of the Merger; the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; the outcome of any legal proceeding that may be instituted against Strayer, Capella and others following the announcement of the Merger; the amount of the costs, fees, expenses and charges related to the Merger; the risk that the benefits of the Merger, including expected synergies, may not be fully realized or may take longer to realize than expected; the risk that the Merger may not advance the combined company’s business strategy and growth strategy; the risk that the combined company may experience difficulty integrating Strayer’s and Capella’s employees or operations; the potential diversion of Strayer’s management’s attention resulting from the proposed Merger; and other risks and uncertainties identified in Strayer’s filings with the Securities and Exchange Commission.\nActual results may differ materially from those projected in the forward-looking statements. Strayer undertakes no obligation to update or revise forward-looking statements.\nAdditional Information and Where to Find It\nInvestors and security holders are urged to carefully review and consider each of Strayer’s and Capella’s public filings with the Securities and Exchange Commission (the “SEC”), including but not limited to their Annual Reports on Form 10-K, their proxy statements, their Current Reports on Form 8-K and their Quarterly Reports on Form 10-Q. The documents filed by Strayer with the SEC may be obtained free of charge at Strayer’s website at www.strayereducation.com , in the “Investor Relations” tab at the top of the page, or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from Strayer by requesting them in writing to 2303 Dulles Station Boulevard, Herndon, VA 20171. The documents filed by Capella with the SEC may be obtained free of charge at Capella’s website at www.capellaeducation.com , in the “Investor Relations” tab at the top of the page, or at the SEC’s website at www.sec.gov . These documents may also be obtained free of charge from Capella by requesting them in writing to 225 South 6th Street, 9th Floor, Minneapolis, Minnesota 55402.\nIn connection with the proposed transaction, on November 20, 2017, Strayer filed a registration statement on Form S-4 with the SEC which included a joint proxy statement of Strayer and Capella and a prospectus of Strayer. The registration statement was amended on December 4, 2017 and declared effective on December 8, 2017. On January 19, 2018 at their respective special meetings, Strayer’s stockholders approved the issuance of Strayer common stock and the amendment and restatement of Strayer’s charter, each in connection with the Merger, and Capella shareholders approved the Agreement and Plan of Merger, dated as of October 29, 2017, by", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayereducation.com%2F&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=Strayer+Education%2C+Inc.&index=3&md5=f603b50b0d52934a9b1096f8b710d705", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayereducation.com&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.strayereducation.com&index=2&md5=9824e8ec06900ca727bf6f7e24f75b12", "http://www.businesswire.com/news/home/20180119005688/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fjackwelch.strayer.edu%2F&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=Jack+Welch+Management+Institute&index=6&md5=9e7cd8a1056deb52eb57f804d73e1993", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.princetonreview.com%2Fbusiness-school-rankings%2Fonline-mba%2Ftop-25-online-mba-programs&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=Top+25+Princeton+Review-ranked+executive+MBA+program&index=5&md5=75181831db656e7a1b57363a578cc18c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.sec.gov&index=9&md5=ea8fb174ddc0d3f69aaded698c6158bc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nycda.com&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=New+York+Code+%2B+Design+Academy&index=7&md5=7677f3c8c9dfc6364922cd6b5bb1d19b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayer.edu%2F&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=Strayer+University&index=4&md5=4b0d9754976c3ce6753562f88d95c8ec", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayereducation.com&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.strayereducation.com&index=8&md5=be862a22fb4d15311e2988bd751be765", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.sec.gov&index=11&md5=c3ad810fcce3f044666dc653a094de30", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.capellaeducation.com&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.capellaeducation.com&index=10&md5=707c0a8515837eca0687d4feadce4ceb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strayereducation.com&esheet=51746116&newsitemid=20180119005688&lan=en-US&anchor=www.strayereducation.com&index=1&md5=8a5559f5698e1804fe0093dca6548a06"], "published": "2018-01-20T00:05:00.000+02:00", "crawled": "2018-01-20T00:55:03.038+02:00", "highlightTitle": ""}