{"organizations": [], "uuid": "15a53e07491b7bb60d7ba3919e32d3b402afa2ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219281753&w=1200&r=LYNXMPEE030DG", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-oil-exploration/quest-for-new-oil-discoveries-still-on-back-burner-idUSKBN1ET0LX", "country": "US", "domain_rank": 408, "title": "Quest for new oil discoveries still on back burner", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:08:00.000+02:00", "replies_count": 0, "uuid": "15a53e07491b7bb60d7ba3919e32d3b402afa2ca"}, "author": "", "url": "https://www.reuters.com/article/us-oil-exploration/quest-for-new-oil-discoveries-still-on-back-burner-idUSKBN1ET0LX", "ord_in_thread": 0, "title": "Quest for new oil discoveries still on back burner", "locations": [], "entities": {"persons": [{"name": "ron bousso", "sentiment": "none"}, {"name": "wood mackenzie", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "woodmac", "sentiment": "none"}, {"name": "royal dutch shell", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Despite the strongest start for oil prices in four years, the world’s top oil companies are hesitating to accelerate the search for new resources as a determination to retain capital discipline trumps the hope of making bonanza discoveries.\nExxon Mobil, Royal Dutch Shell, Total and their peers are set to cut spending on oil and gas exploration for a fifth year in a row in 2018, according to consultancy Wood Mackenzie (WoodMac), despite a growing urgency to replenish reserves after years of reining back investment.\n(For graphic 'Global spending on oil and gas exploration' click reut.rs/2CjAONv )\nGlobal investment in exploration, vital to increase output and offset the natural decline of existing fields, will reach $37 billion in 2018, down 7 percent from a year earlier and over 60 percent below the 2014 peak, according to WoodMac.\nFor majors, spending will collectively drop by around 4 percent this year to represent about a tenth of investment in oil and gas production, known as upstream.\n“This could be the new normal, with the days of one dollar in six or seven going to exploration forever in the past,” WoodMac said in a report.\nThe declines, however, mask a modest uptick in drilling activity as lower rig rates and a focused approach on well-charted basins allow firms to do more with their money, according to WoodMac analyst Andrew Latham.\n“Investment will be down year-on year but activity will be flat to slightly higher,” he told Reuters in an interview.\nA worker at an oil field owned by Bashneft, Bashkortostan, Russia, January 28, 2015. REUTERS/Sergei Karpukhin/File Photo The collapse in oil prices in 2014 led to a deep retrenchment in spending for the sector, but companies still need to increase their resources as reserves dwindle.\nAs crude prices and profits recover - prices are currently above $65 a barrel, the highest since mid-2015 - the push to beef up reserves will only increase.\nThe exploration success rate has dropped from 40 percent to 35 percent over the past decade, highlighting the importance of acquisitions as an alternative, albeit generally more expensive, to build resources.\n“Exploration spending (is) to remain low ... implying the need for more merger and acquisition” activity, analysts at RBC Capital Markets said.\nAfter spending more than $30 billion on acquisitions in 2017, oil Majors are expected to continue to make bolt-on purchases in areas where they already operate, even though the “upstream M&A window is starting to close,” RBC said, alluding to higher asset valuations and fewer distressed sellers.\nThe majors will once again be the ones to watch thanks to stronger balance sheets compared with smaller rivals, WoodMac’s Latham said.\nExploration is expected to focus on deepwater basins such as Mexico, Brazil and Guyana where large discoveries have been made in recent years, offering more confidence that additional resources could be found, he added.\nThe most watched exploration wells include BP and Kosmos Energy in Senegal, Total and Petrobras in Brazil, Exxon in Guyana, Total and Pemex in Mexico and Eni in Cyprus, according to WoodMac.\nThe growing appetite for exploration was made clear last October when the top oil companies vied for blocks in Brazil’s first deepwater oil auction for foreign operators, where Shell was awarded half of the blocks.\nReporting by Ron Bousso; Editing by Mark Potter\n ", "external_links": [], "published": "2018-01-04T12:08:00.000+02:00", "crawled": "2018-01-04T12:22:05.005+02:00", "highlightTitle": ""}