{"organizations": [], "uuid": "65be1d75dbdf7459d80a44281093ab6028a02d95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-alliance-resource-partners-l-p-reports-quarterly-and-annual-financial-and-operating-results-increases-quarterly-cash.html", "country": "US", "domain_rank": 767, "title": "Alliance Resource Partners, L.P. Reports Quarterly and Annual Financial and Operating Results; Increases Quarterly Cash Distribution 1.0% to $0.51 Per Unit; and Provides Initial 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-29T15:00:00.000+02:00", "replies_count": 0, "uuid": "65be1d75dbdf7459d80a44281093ab6028a02d95"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-alliance-resource-partners-l-p-reports-quarterly-and-annual-financial-and-operating-results-increases-quarterly-cash.html", "ord_in_thread": 0, "title": "Alliance Resource Partners, L.P. Reports Quarterly and Annual Financial and Operating Results; Increases Quarterly Cash Distribution 1.0% to $0.51 Per Unit; and Provides Initial 2018 Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "alliance resource partners", "sentiment": "neutral"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla.--(BUSINESS WIRE)-- Alliance Resource Partners, L.P. (NASDAQ: ARLP) today reported financial and operating results for the quarter and year ended December 31, 2017 (the \"2017 Quarter\" and the \"2017 Year\", respectively). Total revenues were $483.2 million in the 2017 Quarter compared to $527.4 million for the quarter ended December 31, 2016 (the \"2016 Quarter\"), as coal sales revenues declined due to reduced coal sales volumes and prices. Lower revenues contributed to reduced net income attributable to ARLP for the 2017 Quarter, which declined to $74.2 million, or $0.55 per basic and diluted limited partner unit, compared to $119.6 million, or $1.30 per basic and diluted limited partner unit, for the 2016 Quarter. EBITDA in the 2017 Quarter of $159.9 million was also lower compared to $217.8 million in the 2016 Quarter. (For a definition of EBITDA, Adjusted EBITDA and related reconciliations to comparable GAAP financial measures and actual and pro forma earnings per basic and diluted limited partner unit reflecting the exchange transaction announced in our July 28, 2017 press release as if it had occurred on January 1, 2016, please see the end of this release.)\nARLP’s financial performance for the 2017 Quarter improved compared to the quarter ended September 30, 2017 (the \"Sequential Quarter\"). Led by higher production and sales volumes from our Hamilton longwall operation, net income attributable to ARLP and EBITDA increased by 21.2% and 12.5%, respectively, compared to the Sequential Quarter. Increased volumes also helped drive Segment Adjusted EBITDA Expense per ton down by 3.5% compared to the Sequential Quarter. (For a definition of Segment Adjusted EBITDA Expense per ton and related reconciliation to comparable GAAP financial measures, please see the end of this release.)\nTotal revenues were $1.80 billion in the 2017 Year compared to $1.93 billion for the year ended December 31, 2016 (the \"2016 Year\"), as the anticipated reduction in coal sales prices more than offset increased sales volumes. Although lower revenues were partially offset by decreased operating expenses, reduced depreciation, depletion and amortization and increased income from our oil and gas investments, net income attributable to ARLP for the 2017 Year declined to $303.6 million, or $2.80 per basic and diluted limited partner unit, compared to $339.4 million, or $3.39 per basic and diluted limited partner unit, for the 2016 Year. Adjusted EBITDA for the 2017 Year also decreased to $620.8 million compared to $706.7 million in the 2016 Year.\nAs previously announced on January 26, 2018, the Board of Directors of ARLP’s general partner (the \"Board\") increased the cash distribution to unitholders for the 2017 Quarter to $0.51 per unit (an annualized rate of $2.04 per unit), payable on February 14, 2018 to all unitholders of record as of the close of trading on February 7, 2018. The announced distribution represents a 16.6% increase over the cash distribution of $0.4375 per unit for the 2016 Quarter and a 1.0% increase over the cash distribution of $0.505 per unit for the Sequential Quarter.\n\"ARLP achieved significant milestones and delivered impressive performance in 2017,\" said Joseph W. Craft III, President and Chief Executive Officer. \"Operationally ARLP increased year-over-year production volumes by more than 6% or 2.4 million tons and reduced Segment Adjusted EBITDA Expense by $1.81 per ton. Sales volumes also increased 1.1 million tons as ARLP expanded its presence in the international coal markets, delivering a record 5.6 million tons to the export thermal market and 745,000 tons to the export metallurgical market. This solid performance from our coal business and increased contribution from our investments in oil and gas minerals and compression services led ARLP to strong EBITDA and distributable cash flow in 2017. These results along with the successful completion of an 8 year, $400 million bond offering earlier in the year contributed to an improved balance sheet, allowed ARLP to return to growing distributions to unitholders beginning in July 2017 and continuing with the increase approved by the Board for the 2017 Quarter. For the year, ARLP achieved a robust 1.75 times distribution coverage ratio.\"\nConsolidated Financial Results\nThree Months Ended December 31, 2017 Compared to Three Months Ended December 31, 2016\nReduced coal sales volumes and prices led coal sales revenues lower in the 2017 Quarter to $454.9 million compared to $504.2 million for the 2016 Quarter. Lower sales volumes in the 2017 Quarter reflect the closure of the Pattiki mine in the 2016 Quarter, reduced sales volumes from our River View and Tunnel Ridge mines, partially offset by strong sales performance at our Mettiki and Gibson South mines. As anticipated, ARLP’s coal sales prices were also lower in the 2017 Quarter, falling to $45.03 per ton sold, a 6.2% decrease compared to $48.01 per ton sold in the 2016 Quarter. Total production in the 2017 Quarter was comparable to the 2016 Quarter.\nCompared to the 2016 Quarter, operating expenses increased in the 2017 Quarter by 5.6% to $298.3 million resulting in higher Segment Adjusted EBITDA Expense per ton of $29.48 in the 2017 Quarter compared to $26.87 in the 2016 Quarter. This increase in the 2017 Quarter was primarily due to reduced recoveries at our Gibson South and Tunnel Ridge mines, year-end actuarial adjustments to workers’ compensation expense and higher coal inventory charges, offset in part by a favorable production mix from ARLP’s lower-cost operations in the Illinois Basin; all as compared to the 2016 Quarter.\nDepreciation, depletion and amortization decreased $15.9 million to $74.9 million in the 2017 Quarter primarily due to the previously mentioned closure of the Pattiki mine in the 2016 Quarter. General and administrative expenses fell $3.7 million in the 2017 Quarter, primarily due to lower incentive compensation expenses.\nCompared to the 2016 Quarter, increased earnings from our investments in oil and gas mineral interests led equity investment income higher to $3.4 million in the 2017 Quarter and distributions of additional preferred interests received from our recent investment in compression services contributed $3.6 million of cost investment income to the 2017 Quarter.\nYear Ended December 31, 2017 Compared to Year Ended December 31, 2016\nIncreased coal sales and production volumes in the 2017 Year from the Hamilton, Gibson South, Mettiki, MC Mining and Tunnel Ridge mines drove coal sales volumes up by 3.1% to 37.8 million tons and production volumes higher by 6.7% to 37.6 million tons, both as compared to the 2016 Year. Higher sales volumes reflect the benefit of strong export markets as ARLP shipped 6.3 million tons into the international thermal and metallurgical coal markets during the 2017 Year, an increase of 4.7 million tons compared to the 2016 Year. Partially offsetting these increases were reduced sales and production volumes at our Dotiki and Warrior mines, the closure of the Pattiki mine in the 2016 Quarter and the depletion of reserves at our Elk Creek mine in the first quarter of 2016. Despite increased sales volumes, coal sales revenues of $1.71 billion for the 2017 Year decreased 8.1% compared to the 2016 Year as a result of the expiration of higher-priced legacy contracts, which led coal sales prices lower by 10.9% to $45.24 per ton sold.\nEven though coal sales and production volumes increased for the 2017 Year, operating expenses of $1.10 billion were 2.6% lower compared to the 2016 Year, reflecting our initiatives to shift production to ARLP’s lower-cost operations. As a result of reduced operating expenses and lower selling expenses, Segment Adjusted EBITDA Expense per ton sold declined to $28.88 in the 2017 Year, an improvement of 5.9% compared to the 2016 Year.\nDepreciation, depletion and amortization decreased $67.5 million to $269.0 million in the 2017 Year, primarily as a result of the previously mentioned depletion of reserves at the Elk Creek mine, closure of the Pattiki mine and volume reductions at our Dotiki and Warrior mines. The use of surplus equipment from our idled mines and ongoing capital reduction initiatives also contributed to lower depreciation and amortization in the 2017 Year. General and administrative expenses decreased $10.8 million to $61.8 million in the 2017 Period, primarily due to lower incentive compensation expenses.\nCompared to the 2016 Year, equity investment income rose $10.3 million to $13.9 million due to increased earnings from our investments in oil and gas mineral interests. Distributions of additional preferred interests received from our recent investment in compression services contributed $6.4 million of cost investment income to the 2017 Year.\nComparative results between the 2017 and 2016 Years were also impacted by a debt extinguishment loss of $8.1 million related to ARLP’s early repayment of its Series B Senior Notes in May 2017 following our high-yield bond issuance in April 2017.\nRegional Results and Analysis\n% Change 2017 Fourth 2016 Fourth Quarter / 2017 Third % Change (in millions, except per ton data) Quarter Quarter Quarter Quarter Sequential Illinois Basin\nTons sold 7.391 8.020 (7.8) % 6.872 7.6 % Coal sales price per ton (1) $ 39.13 $ 45.56 (14.1) % $ 40.56 (3.5) % Segment Adjusted EBITDA Expense per ton (2) $ 24.93 $ 24.24 2.8 % $ 28.01 (11.0) % Segment Adjusted EBITDA (2) $ 105.5 $ 171.2 (38.4) % $ 86.4 22.1 % Appalachia\nTons sold 2.712 2.498 8.6 % 2.773 (2.2) % Coal sales price per ton (1) $ 60.12 $ 52.80 13.9 % $ 54.77 9.8 % Segment Adjusted EBITDA Expense per ton (2) $ 40.39 $ 33.94 19.0 % $ 35.09 15.1 % Segment Adjusted EBITDA (2) $ 54.7 $ 47.8 14.4 % $ 55.5 (1.4) % Total (3)\nTons sold 10.103 10.503 (3.8) % 9.645 4.7 % Coal sales price per ton (1) $ 45.03 $ 48.01 (6.2) % $ 45.12 (0.2) % Segment Adjusted EBITDA Expense per ton (2) $ 29.48 $ 26.87 9.7 % $ 30.55 (3.5) % Segment Adjusted EBITDA (2) $ 175.7 $ 237.3 (26.0) % $ 157.2 11.8 % (1) Sales price per ton is defined as total coal sales divided by total tons sold. (2) For definitions of Segment Adjusted EBITDA Expense per ton and Segment Adjusted EBITDA and related reconciliations to comparable GAAP financial measures, please see the end of this release. Results presented for Segment Adjusted EBITDA Expense per ton and Segment Adjusted EBITDA for the 2016 Quarter have been recast to reflect a reclass of depreciation and depletion capitalized into coal inventory as adjustments to depreciation, depletion and amortization rather than operating expenses. (3) Total reflects consolidated results which include other and corporate and eliminations in addition to the Illinois Basin and Appalachia segments highlighted above. Tons sold in the 2017 Quarter decreased 7.8% in the Illinois Basin compared to the 2016 Quarter as a result of the closure of our Pattiki mine in the 2016 Quarter and reduced sales volumes from our River View mine, partially offset by increased volumes at our Gibson South operation. Strong sales performance at the Mettiki mine drove coal sales tons for the 2017 Quarter higher in Appalachia by 8.6% compared to the 2016 Quarter. Compared to the Sequential Quarter, tons sold increased 7.6% in the Illinois Basin primarily as a result of significantly higher sales and production volumes from the Hamilton mine due to increased recoveries in the 2017 Quarter and the impact of a longwall move and adverse geological conditions on Hamilton’s results during the Sequential Quarter. ARLP ended the 2017 Quarter with total coal inventory of 0.8 million tons, including approximately 266,000 in transit tons for deliveries to the export markets, a reduction of approximately 0.2 million tons and 0.7 million tons compared to the end of the 2016 and Sequential Quarters, respectively.\nAs anticipated, ARLP’s coal sales price realizations decreased 6.2% per ton sold in the 2017 Quarter compared to the 2016 Quarter, primarily due to the expiration of higher-priced legacy contracts offset in part by higher price realizations in Appalachia from sales at our Mettiki mine into the metallurgic coal export market and improved prices at our MC Mining mine.\nTotal Segment Adjusted EBITDA Expense per ton increased by 9.7% compared to the 2016 Quarter as a result of higher expenses per ton in both the Illinois Basin and Appalachian regions. In the Illinois Basin, Segment Adjusted EBITDA Expense per ton increased 2.8% compared to the 2016 Quarter primarily due to lower recoveries at our Gibson South and Dotiki mines and increased roof support and contract labor costs at all of our Illinois Basin mines, partially offset by lower selling expenses in the 2017 Quarter and the favorable production mix with ARLP’s lower-cost operations. Segment Adjusted EBITDA Expense per ton in Appalachia increased by 19.0% compared to the 2016 Quarter reflecting higher selling expenses and lower recoveries at our Tunnel Ridge mine as well as an increased sales mix of higher-cost metallurgical coal production at Mettiki in the 2017 Quarter. Both segments were also impacted by increased workers’ compensation expense and inventory costs in the 2017 Quarter compared to the 2016 Quarter. Compared to the Sequential Quarter, higher sales and production volumes and increased recoveries from our Hamilton mine drove Segment Adjusted EBITDA Expense per ton in the Illinois Basin lower by 11.0%. In Appalachia, Segment Adjusted EBITDA Expense per ton increased 15.1% compared to the Sequential Quarter resulting primarily from reduced sales and production volumes at our Tunnel Ridge mine due in part to a longwall move in the 2017 Quarter.\nMarket Update and Outlook\n\"ARLP enters 2018 poised for continued strong operating and financial performance,\" said Mr. Craft. \"We expect improved demand from our domestic customers in the first half of 2018 as recent cold weather across much of the U.S. has resulted in increased coal burn and reduced utility stockpiles. The international thermal and metallurgical coal markets continue to support participation by U.S. producers and we anticipate ARLP’s sales to these markets will increase in 2018, having already booked commitments to export approximately 5.9 million tons this year. As a result, ARLP is planning to increase production and sales volumes by 5.0% to 6.0% in 2018, which along with continued strong cost performance by our mines and an improving price environment are expected to drive solid results from ARLP’s coal operations. During the 2017 Quarter, we booked close to 10.0 million tons for delivery in 2018 and currently have price and volume commitments for approximately 85.0% of ARLP’s estimated 2018 production at the midpoint of our guidance. Longer term, we expect the strength of our market presence and strategically-located, low-cost mines will continue to support strong results from our coal operations for many years in the future.\"\nMr. Craft continued, \"The contribution from ARLP’s current investments in oil and gas minerals and compression services are expected to increase meaningfully in 2018, adding an estimated $25.0 to $35.0 million to ARLP’s net income and EBITDA this year. As ARLP continues to receive preferred returns on its investment in compression services and drilling activity on our mineral acreage continues to grow, we expect similar annual increases in earnings from these investments over the next 24 to 36 months. With expectations for strong distributable cash flow and healthy distribution coverage for the foreseeable future, ARLP remains focused on delivering value to our unitholders and is currently targeting annual distribution growth of approximately 4.0% in 2018.\"\nFor 2018, ARLP is providing the following full-year guidance for its operating and investment activities:\nCapital Expenditures and Investments – Total 2018 capital expenditures for ARLP’s operating activities are currently estimated in a range of $220.0 million to $240.0 million. 2018 Capital expenditures are primarily related to maintenance capital expenditures as well as $16.5 million of growth capital to re-open the Gibson North mine by bringing two mining units back into production. Considering its current five-year planning horizon, ARLP is estimating total average maintenance capital expenditures of approximately $4.72 per ton produced for long-term distribution planning purposes. Depreciation, depletion and amortization in 2018 is estimated in a range of $275.0 million to $285.0 million.\nIn addition, ARLP currently expects 2018 investments of approximately $30.0 million for existing commitments related to compression services and the acquisition of oil and gas mineral interests.\nCoal Production and Sales Volumes – During 2018, coal production is currently estimated in a range of 39.0 million to 40.0 million tons and sales volumes are expected in a range of 39.5 million to 40.5 million tons. To date, ARLP has secured price and volume commitments for approximately 33.7 million tons in 2018 and has also secured coal sales and price commitments for approximately 11.6 million tons, 7.6 million tons and 1.3 million tons in 2019, 2020 and 2021, respectively.\nRevenue, Net Income and EBITDA – Based on current expectations, ARLP is estimating 2018 revenues, excluding transportation revenues, in a range of $1.78 billion to $1.82 billion, net income in a range of $290.0 million to $310.0 million and EBITDA in a range of $610.0 million to $630.0 million. These 2018 estimates for net income and EBITDA include a contribution of approximately $25.0 million to $35.0 million related to our investments in oil and gas mineral interests and compression services. (For a definition of EBITDA and related reconciliations to comparable GAAP financial measures, please see the end of this release.)\nPer Ton Estimates – ARLP currently anticipates its average coal sales price per ton at the midpoint of its 2018 guidance ranges will be 2.0% to 3.0% lower than 2017 realizations, primarily reflecting soft coal market conditions during the first half of last year. ARLP also expects its ongoing efforts to enhance operational efficiency and control costs will result in a modest improvement to total Segment Adjusted EBITDA Expense per ton in 2018 compared to 2017. Based on these price and cost estimates, total Segment Adjusted EBITDA per ton sold in 2018 is currently expected to be approximately 2.0% to 6.0% below the prior year.\nA conference call regarding ARLP’s 2017 Quarter and Year financial results and 2018 outlook is scheduled for today at 10:00 a.m. Eastern. To participate in the conference call, dial (877) 506-1589 and request to be connected to the Alliance Resource Partners, L.P. earnings conference call. Canadian callers should dial (855) 669-9657 and all other International callers should dial (412) 317-5240 and request to be connected to the same call. Investors may also listen to the call via the \"investor information\" section of ARLP’s website at http://www.arlp.com .\nAn audio replay of the conference call will be available for approximately one week. To access the audio replay, dial US Toll Free (877) 344-7529; International Toll (412) 317-0088; Canada Toll Free (855) 669-9658 and request to be connected to replay access code 10115818.\nAbout Alliance Resource Partners, L.P.\nARLP is a diversified producer and marketer of coal to major United States utilities and industrial users. ARLP, the nation’s first publicly traded master limited partnership involved in the production and marketing of coal, is currently the second largest coal producer in the eastern United States with mining operations in the Illinois Basin and Appalachian coal producing regions.\nARLP currently operates eight mining complexes in Illinois, Indiana, Kentucky, Maryland and West Virginia as well as a coal loading terminal on the Ohio River at Mount Vernon, Indiana. ARLP also generates income from a variety of other sources, including investments in oil and gas royalties and midstream services.\nNews, unit prices and additional information about ARLP, including filings with the Securities and Exchange Commission, are available at http://www.arlp.com . For more information, contact the investor relations department of ARLP at (918) 295-7674 or via e-mail at investorrelations@arlp.com .\nThe statements and projections used throughout this release are based on current expectations. These statements and projections are forward-looking, and actual results may differ materially. These projections do not include the potential impact of any mergers, acquisitions or other business combinations that may occur after the date of this release. At the end of this release, we have included more information regarding business risks that could affect our results.\nFORWARD-LOOKING STATEMENTS: With the exception of historical matters, any matters discussed in this press release are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from projected results. These risks, uncertainties and contingencies include, but are not limited to, the following: changes in coal prices, which could affect our operating results and cash flows; changes in competition in coal markets and our ability to respond to such changes; legislation, regulations, and court decisions and interpretations thereof, including those relating to the environment and the release of greenhouse gases, mining, miner health and safety and health care; deregulation of the electric utility industry or the effects of any adverse change in the coal industry, electric utility industry, or general economic conditions; risks associated with the expansion of our operations and properties; dependence on significant customer contracts, including renewing existing contracts upon expiration; adjustments made in price, volume or terms to existing coal supply agreements; changing global economic conditions or in industries in which our customers operate; liquidity constraints, including those resulting from any future unavailability of financing; customer bankruptcies, cancellations or breaches to existing contracts, or other failures to perform; customer delays, failure to take coal under contracts or defaults in making payments; fluctuations in coal demand, prices and availability; continuation or worsening of depressed oil and gas prices adversely affecting our investments in oil and gas mineral interests and midstream services; our productivity levels and margins earned on our coal sales; the coal industry's share of electricity generation, including as a result of environmental concerns related to coal mining and combustion and the cost and perceived benefits of other sources of electricity, such as natural gas, nuclear energy and renewable fuels; changes in raw material costs; changes in the availability of skilled labor; our ability to maintain satisfactory relations with our employees; increases in labor costs including costs of health insurance and taxes resulting from the Affordable Care Act, adverse changes in work rules, or cash payments or projections associated with post-mine reclamation and workers' compensation claims; increases in transportation costs and risk of transportation delays or interruptions; operational interruptions due to geologic, permitting, labor, weather-related or other factors; risks associated with major mine-related accidents, such as mine fires, or interruptions; results of litigation, including claims not yet asserted; difficulty maintaining our surety bonds for mine reclamation as well as workers' compensation and black lung benefits; difficulty in making accurate assumptions and projections regarding post-mine reclamation as well as pension, black lung benefits and other post-retirement benefit liabilities; uncertainties in estimating and replacing our coal reserves; a loss or reduction of benefits from certain tax deductions and credits; difficulty obtaining commercial property insurance, and risks associated with our participation (excluding any applicable deductible) in the commercial insurance property program; and difficulty in making accurate assumptions and projections regarding future revenues and costs associated with investments in companies we do not control.\nAdditional information concerning these and other factors can be found in ARLP’s public periodic filings with the Securities and Exchange Commission (\"SEC\"), including ARLP’s Annual Report on Form 10-K for the year ended December 31, 2016, filed on February 24, 2017 and ARLP’s Quarterly Reports on Form 10-Q for the quarters ended March 31, 2017, June 30, 2017 and September 30, 2017, filed on May 8, 2017, August 4, 2017 and November 6, 2017, respectively, with the SEC. Except as required by applicable securities laws, ARLP does not intend to update its forward-looking statements.\nALLIANCE RESOURCE PARTNERS, L.P. AND SUBSIDIARIES\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME AND OPERATING DATA\n(In thousands, except unit and per unit data)\n(Unaudited)\nThree Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 Tons Sold 10,103 10,503 37,824 36,680 Tons Produced 9,398 9,485 37,609 35,244 SALES AND OPERATING REVENUES: Coal sales $ 454,946 $ 504,210 $ 1,711,114 $ 1,861,788 Transportation revenues 16,767 10,379 41,700 30,111 Other sales and operating revenues 11,518 12,811 43,406 39,554 Total revenues 483,231 527,400 1,796,220 1,931,453 EXPENSES: Operating expenses (excluding depreciation, depletion and amortization) 298,322 282,431 1,095,167 1,124,848 Transportation expenses 16,767 10,379 41,700 30,111 Outside coal purchases — — — 1,514 General and administrative 15,778 19,514 61,760 72,529 Depreciation, depletion and amortization 74,872 90,773 268,981 336,509 Total operating expenses 405,739 403,097 1,467,608 1,565,511 INCOME FROM OPERATIONS 77,492 124,303 328,612 365,942 Interest expense, net (10,481) (7,283) (39,385) (30,669) Interest income 12 2 94 10 Equity investment income 3,446 2,502 13,860 3,543 Cost investment income 3,598 — 6,398 — Debt extinguishment loss — — (8,148) — Other income 519 180 2,980 725 INCOME BEFORE INCOME TAXES 74,586 119,704 304,411 339,551 INCOME TAX EXPENSE 213 9 210 13 NET INCOME 74,373 119,695 304,201 339,538 LESS: NET INCOME ATTRIBUTABLE TO NONCONTROLLING INTEREST (138) (100) (563) (140) NET INCOME ATTRIBUTABLE TO ALLIANCE RESOURCE PARTNERS, L.P. (\"NET INCOME OF ARLP\") $ 74,235 $ 119,595 $ 303,638 $ 339,398 GENERAL PARTNERS' INTEREST IN NET INCOME OF ARLP $ 542 $ 20,188 $ 21,904 $ 80,911 LIMITED PARTNERS' INTEREST IN NET INCOME OF ARLP $ 73,693 $ 99,407 $ 281,734 $ 258,487 BASIC AND DILUTED NET INCOME OF ARLP PER LIMITED PARTNER UNIT $ 0.55 $ 1.30 $ 2.80 $ 3.39 DISTRIBUTIONS PAID PER LIMITED PARTNER UNIT $ 0.5050 $ 0.4375 $ 1.88 $ 1.9875 WEIGHTED-AVERAGE NUMBER OF UNITS OUTSTANDING – BASIC AND DILUTED 130,704,217 74,375,025 98,707,696 74,354,162 ALLIANCE RESOURCE PARTNERS, L.P. AND SUBSIDIARIES\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(In thousands, except unit data)\n(Unaudited)\nDecember 31, 2017 2016 ASSETS CURRENT ASSETS: Cash and cash equivalents $ 6,756 $ 39,782 Trade receivables 181,671 152,032 Other receivables 146 279 Due from affiliates 165 271 Inventories, net 60,275 61,051 Advance royalties, net 4,510 1,207 Prepaid expenses and other assets 28,117 22,050 Total current assets 281,640 276,672 PROPERTY, PLANT AND EQUIPMENT: Property, plant and equipment, at cost 2,934,188 2,920,988 Less accumulated depreciation, depletion and amortization (1,457,532 ) (1,335,145 ) Total property, plant and equipment, net 1,476,656 1,585,843 OTHER ASSETS: Advance royalties, net 39,660 29,372 Equity investments 147,964 138,817 Cost investments 106,398 — Goodwill 136,399 136,399 Other long-term assets 30,654 25,939 Total other assets 461,075 330,527 TOTAL ASSETS $ 2,219,371 $ 2,193,042 LIABILITIES AND PARTNERS' CAPITAL CURRENT LIABILITIES: Accounts payable $ 96,958 $ 64,055 Due to affiliates 771 906 Accrued taxes other than income taxes 20,336 18,273 Accrued payroll and related expenses 35,751 41,576 Accrued interest 5,005 316 Workers' compensation and pneumoconiosis benefits 10,729 9,897 Current capital lease obligations 28,613 27,196 Other current liabilities 19,071 14,778 Current maturities, long-term debt, net 72,400 149,874 Total current liabilities 289,634 326,871 LONG-TERM LIABILITIES: Long-term debt, excluding current maturities, net 415,937 399,446 Pneumoconiosis benefits 71,875 62,822 Accrued pension benefit 45,317 42,070 Workers' compensation 46,694 40,400 Asset retirement obligations 126,750 125,266 Long-term capital lease obligations 57,091 85,540 Other liabilities 14,587 17,203 Total long-term liabilities 778,251 772,747 Total liabilities 1,067,885 1,099,618 PARTNERS' CAPITAL: Alliance Resource Partners, L.P. (\"ARLP\") Partners' Capital: Limited Partners - Common Unitholders 130,704,217 and 74,375,025 units outstanding, respectively 1,183,219 1,400,202 General Partners’ interest 14,859 (273,788 ) Accumulated other comprehensive loss (51,940 ) (38,540 ) Total ARLP Partners' Capital 1,146,138 1,087,874 Noncontrolling interest 5,348 5,550 Total Partners' Capital 1,151,486 1,093,424 TOTAL LIABILITIES AND PARTNERS' CAPITAL $ 2,219,371 $ 2,193,042 ALLIANCE RESOURCE PARTNERS, L.P. AND SUBSIDIARIES\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\n(Unaudited)\nYear Ended December 31, 2017 2016 CASH FLOWS FROM OPERATING ACTIVITIES: $ 556,116 $ 703,544 CASH FLOWS FROM INVESTING ACTIVITIES: Property, plant and equipment: Capital expenditures (145,088 ) (91,056 ) Increase (decrease) in accounts payable and accrued liabilities 7,404 (4,402 ) Proceeds from sale of property, plant and equipment 2,139 1,165 Contributions to equity investments (20,688 ) (76,797 ) Purchase of cost investment (100,000 ) — Distributions received from investments in excess of cumulative earnings 11,462 3,313 Payment for acquisition of business — (1,011 ) Payment for acquisition of customer contracts — (23,000 ) Net cash used in investing activities (244,771 ) (191,788 ) CASH FLOWS FROM FINANCING ACTIVITIES: Borrowings under securitization facility 100,000 44,600 Payments under securitization facility (127,600 ) (27,700 ) Payments on term loan (50,000 ) (156,250 ) Borrowings under revolving credit facilities 215,486 140,000 Payments under revolving credit facilities (440,486 ) (270,000 ) Borrowings under long-term debt 400,000 — Payment on long-term debt (145,000 ) — Proceeds on capital lease transactions — 33,881 Payments on capital lease obligations (27,071 ) (24,456 ) Payment of debt issuance costs (16,487 ) (101 ) Payment for debt extinguishment (8,148 ) — Contributions to consolidated company from affiliate noncontrolling interest 251 3,014 Net settlement of employee withholding taxes on vesting of Long-Term Incentive Plan (2,988 ) (1,336 ) Cash contributions by General Partners 1,105 1,047 Distributions paid to Partners (240,812 ) (247,915 ) Other (2,621 ) (189 ) Net cash used in financing activities (344,371 ) (505,405 ) NET CHANGE IN CASH AND CASH EQUIVALENTS (33,026 ) 6,351 CASH AND CASH EQUIVALENTS AT BEGINNING OF PERIOD 39,782 33,431 CASH AND CASH EQUIVALENTS AT END OF PERIOD $ 6,756 $ 39,782 Reconciliation of GAAP \"net income attributable to ARLP\" and \"net income\" to non-GAAP \"EBITDA,\" \"Adjusted EBITDA\" and \"Distributable Cash Flow\" (in thousands).\nEBITDA is defined as net income (prior to the allocation of noncontrolling interest) before net interest expense, income taxes and depreciation, depletion and amortization and Adjusted EBITDA is EBITDA modified for certain items that may not reflect the trend of future results, such as debt extinguishment losses. Distributable cash flow (\"DCF\") is defined as Adjusted EBITDA excluding interest expense (before capitalized interest), interest income, income taxes and estimated maintenance capital expenditures. Distribution coverage ratio (\"DCR\") is defined as DCF divided by distributions paid to partners.\nManagement believes that the presentation of such additional financial measures provides useful information to investors regarding our performance and results of operations because these measures, when used in conjunction with related GAAP financial measures, (i) provide additional information about our core operating performance and ability to generate and distribute cash flow, (ii) provide investors with the financial analytical framework upon which management bases financial, operational, compensation and planning decisions and (iii) present measurements that investors, rating agencies and debt holders have indicated are useful in assessing us and our results of operations.\nEBITDA, Adjusted EBITDA, DCF and DCR should not be considered as alternatives to net income attributable to ARLP, net income, income from operations, cash flows from operating activities or any other measure of financial performance presented in accordance with GAAP. EBITDA, Adjusted EBITDA and DCF are not intended to represent cash flow and do not represent the measure of cash available for distribution. Our method of computing EBITDA, Adjusted EBITDA, DCF and DCR may not be the same method used to compute similar measures reported by other companies, or EBITDA, Adjusted EBITDA, DCF and DCR may be computed differently by us in different contexts (i.e. public reporting versus computation under financing agreements).\nThree Months Ended\nYear Ended Three Months\nEnded\nYear Ended December 31, December 31, September 30, December 31, 2017 2016 2017 2016 2017 2018E Midpoint Net income attributable to ARLP $ 74,235 $ 119,595 $ 303,638 $ 339,398 $ 61,271 $ 299,500 Net income attributable to noncontrolling interests 138 100 563 140 155 500 Net income 74,373 119,695 304,201 339,538 61,426 300,000 Depreciation, depletion and amortization (1) 74,872 90,773 268,981 336,509 69,962 280,000 Interest expense, net 10,666 7,319 39,842 31,017 10,876 40,900 Capitalized interest (197 ) (38 ) (551 ) (358 ) (107 ) (900 ) Income tax expense 213 9 210 13 5 — EBITDA 159,927 217,758 612,683 706,719 142,162 620,000 Debt extinguishment loss — — 8,148 — — — Adjusted EBITDA 159,927 217,758 620,831 706,719 142,162 620,000 Interest expense, net (10,666 ) (7,319 ) (39,842 ) (31,017 ) (10,876 ) (40,900 ) Income tax expense (213 ) (9 ) (210 ) (13 ) (5 ) — Estimated maintenance capital expenditures (2) (39,941 ) (45,054 ) (159,838 ) (167,409 ) (36,214 ) (186,400 ) Distributable Cash Flow $ 109,107 $ 165,376 $ 420,941 $ 508,280 $ 95,067 $ 392,700 Distributions paid to partners $ 67,528 $ 53,045 $ 240,812 $ 247,915 $ 66,844 $ 277,700 Distribution Coverage Ratio 1.62 3.12 1.75 2.05 1.42 1.41\n(1) Depreciation, depletion and amortization for the 2016 Quarter and 2016 Year have been recast to reflect a reclass of the amount capitalized into coal inventory previously reflected as an adjustment to operating expense. (2) Our maintenance capital expenditures, as defined under the terms of our partnership agreement, are those capital expenditures required to maintain, over the long-term, the operating capacity of our capital assets. We estimate maintenance capital expenditures on an annual basis based upon a five-year planning horizon. For the 2018 planning horizon, average annual estimated maintenance capital expenditures are assumed to be $4.72 per ton produced compared to the estimated $4.25 per ton produced in 2017. Reflecting the timing of rebuild schedules, we are currently estimating actual maintenance capital expenditures in 2018 of approximately $5.64 per ton produced. Our actual maintenance capital expenditures fluctuate depending on various factors, including maintenance schedules and timing of capital projects, among others. We annually disclose our actual maintenance capital expenditures in our Form 10-K filed with the SEC. Reconciliation of GAAP \"Operating Expenses\" to non-GAAP \"Segment Adjusted EBITDA Expense per ton\" and Reconciliation of non-GAAP \"Adjusted EBITDA\" to \"Segment Adjusted EBITDA\" and \"Segment Adjusted EBITDA per ton\" (in thousands, except per ton data).\nSegment Adjusted EBITDA Expense per ton includes operating expenses, coal purchases and other income divided by tons sold. Transportation expenses are excluded as these expenses are passed through to our customers and, consequently, we do not realize any margin on transportation revenues. Segment Adjusted EBITDA Expense is used as a supplemental financial measure by our management to assess the operating performance of our segments. Segment Adjusted EBITDA Expense is a key component of EBITDA and Adjusted EBITDA in addition to coal sales and other sales and operating revenues. The exclusion of corporate general and administrative expenses from Segment Adjusted EBITDA Expense allows management to focus solely on the evaluation of segment operating performance as it primarily relates to our operating expenses.\nThree Months Ended Year Ended Three Months\nEnded\nDecember 31, December 31, September 30, 2017 2016 2017 2016 2017 Operating expense (1) $ 298,322 $ 282,431 $ 1,095,167 $ 1,124,848 $ 295,385 Outside coal purchases — — — 1,514 — Other income (519 ) (180 ) (2,980 ) (725 ) (774 ) Segment Adjusted EBITDA Expense $ 297,803 $ 282,251 $ 1,092,187 $ 1,125,637 $ 294,611 Divided by tons sold 10,103 10,503 37,824 36,680 9,645 Segment Adjusted EBITDA Expense per ton $ 29.48 $ 26.87 $ 28.88 $ 30.69 $ 30.55", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.arlp.com&esheet=51749887&newsitemid=20180129005305&lan=en-US&anchor=http%3A%2F%2Fwww.arlp.com&index=2&md5=8c6672675ac9c06d54f2957d64344162", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.arlp.com&esheet=51749887&newsitemid=20180129005305&lan=en-US&anchor=http%3A%2F%2Fwww.arlp.com&index=1&md5=d6431759a12892555b21a029166cf7f9"], "published": "2018-01-29T15:00:00.000+02:00", "crawled": "2018-01-29T16:50:52.017+02:00", "highlightTitle": ""}