{"organizations": [], "uuid": "29187950807742158cda2718f2c1ec8630074323", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/05/reuters-america-update-1-california-bill-uses-donations-to-avoid-trump-tax-changes.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-California bill uses donations to avoid Trump tax changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:52:00.000+02:00", "replies_count": 0, "uuid": "29187950807742158cda2718f2c1ec8630074323"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/reuters-america-update-1-california-bill-uses-donations-to-avoid-trump-tax-changes.html", "ord_in_thread": 0, "title": "UPDATE 1-California bill uses donations to avoid Trump tax changes", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kevin de león", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "de leon", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "democratic senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds background information about previous similar tax credits)\nJan 5 (Reuters) - A new proposal in California would allow residents to make donations instead of paying taxes in order to avoid the new federal tax plans cap on deductions of state taxes.\nThe California legislation, introduced on Thursday by Democratic Senate President Pro Tempore Kevin de León, would allow residents to donate to a new state public-purpose \"excellence fund\" and receive a dollar-for-dollar tax credit in return. De Leon says taxpayers would then be able to deduct the donation from their federal taxes, essentially undermining that part of the law signed by President Donald Trump.\nThe proposal is one a few ideas under consideration by high-tax states that will most acutely feel the sting of the new federal cap on state and local tax deductions.\nDemocratic governors in New York and Connecticut have raised the possibility of challenging the constitutionality of the cap. New York Governor Andrew Cuomo said he was developing a plan to restructure the state's payroll tax system.\nCalifornia and other states with high income and property taxes are scrambling to deal with the $10,000 federal deduction cap imposed by the sweeping tax overhaul bill passed by congressional Republicans and signed into law last month by President Donald Trump.\n\"The Republican tax plan gives corporations and hedge-fund managers a trillion-dollar tax cut and expects California taxpayers to foot the bill,\" de León said in a statement. \"We wont allow California residents to be the casualty of this disastrous tax scheme.\"\nAbout 6 million California taxpayers, a third of the total, itemized deductions on their tax returns, claiming an average of $18,438 for state and local taxes, according to a fact sheet on the legislation.\nThe excellence fund would be created by the proposed legislation and exist within the states general fund, according to de Leons office. The bill did not provide details on how money in the fund would be used.\nBecause states are not registered as charities, their tax codes would have to be modified for them to be considered charitable organizations, said Joseph Callahan, a lawyer with Mackay, Caswell & Callahan in New York.\n\"Im scratching my head at how that would work,\" he said. \"From (a U.S. Internal Revenue Service) perspective, it is against public policy; it is against the intention of the Congress.\"\nAn IRS spokesman on Friday declined to comment on the California bill.\nThe bill's fact sheet said California and other states had created tax credit programs to fund access to college and private education.\nWhite House economic adviser Gary Cohn said the federal government might try to block attempts to circumvent the cap, Bloomberg reported on Friday.\nThe California proposal is modeled after an existing tax credit offered for contributions to the CalGrant program that provides college scholarships. Seventeen other states use similar models to fund private education. (Reporting by Karen Pierog and Stephanie Kelly; Additional reporting by Robin Respaut; Editing by Daniel Bases and Jonahan Oatis)", "external_links": [], "published": "2018-01-06T00:52:00.000+02:00", "crawled": "2018-01-07T03:41:36.000+02:00", "highlightTitle": ""}