{"organizations": [], "uuid": "8371a3c9b55d180adb1836e4af3ca472dbb1d3b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-apple-alphabet-buses/apple-alphabet-employee-buses-damaged-by-vandals-during-commute-idUSKBN1F73BS", "country": "US", "domain_rank": 408, "title": "Apple, Alphabet employee buses damaged by vandals during commute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:32:00.000+02:00", "replies_count": 0, "uuid": "8371a3c9b55d180adb1836e4af3ca472dbb1d3b3"}, "author": "", "url": "https://www.reuters.com/article/us-apple-alphabet-buses/apple-alphabet-employee-buses-damaged-by-vandals-during-commute-idUSKBN1F73BS", "ord_in_thread": 0, "title": "Apple, Alphabet employee buses damaged by vandals during commute", "locations": [], "entities": {"persons": [{"name": "paresh dave", "sentiment": "none"}, {"name": "art montiel", "sentiment": "none"}], "locations": [{"name": "san francisco bay area", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "california highway patrol", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (Reuters) - Vandals damaged Apple Inc and Alphabet Inc charter buses carrying employees to and from work in California’s Silicon Valley in recent days, police said on Thursday.\nThe cracked windows did not injure anyone but Apple shifted shuttles to a longer route as a precaution. The large coach buses are a common sight on San Francisco Bay Area freeways but have also become a symbol of the tech industry’s role in soaring housing costs and traffic congestion.\nAn Apple bus was hit by an unknown object last Friday, and four more of the companies’ shuttles and a shuttle for Google parent company Alphabet were hit Tuesday, according to California Highway Patrol.\nPolice do not know what caused the damage but have ruled out road debris such as rocks, agency spokesman Art Montiel said.\nThe union representing shuttle drivers who drove two of the Apple buses struck Tuesday, Teamsters Local 853, described the incidents as a “pellet gun attack” in a statement.\nDoug Bloch, a representative for the Teamsters unit, said that only the outer layer of the buses’ double-paned windows cracked, suggesting that the projectiles lacked the force of bullets.\n“It’s hard to know how to defend against this,” Bloch said. “It’s scary.”\nPolice have increased monitoring near the town of Woodside on Interstate 280, a major artery for traveling between San Francisco, where many tech industry workers live, and the corporate campuses of Silicon Valley.\nApple told employees in an email Tuesday night seen by Reuters that buses would take a new route that would add as much as 30 minutes to 45 minutes to the commute in each direction. The one-way trip is normally about an hour. It is unclear whether the rerouting remained in effect Thursday.\nAlphabet did not respond to a request for comment. Facebook Inc said on Thursday that its shuttles had not been attacked and were running with no changes in service.\nDemonstrators in 2013 and 2014 blocked and damaged buses to protest the booming tech industry’s impact on affordable housing and the gentrification of San Francisco.\nThe buses typically do not bear names of companies, but acronyms for destinations that appear on the vehicle’s digital banners can indicate to which tech campus they travel.\nReporting by Paresh Dave; Additional reporting by David Ingram and Stephen Nellis; Editing by Lisa Shumaker\n ", "external_links": [], "published": "2018-01-19T01:32:00.000+02:00", "crawled": "2018-01-19T01:44:55.016+02:00", "highlightTitle": ""}