{"organizations": [], "uuid": "d788ae96793effdc59b85277fd5c3fef7c377021", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cleantech-solutions-international-to-begin-trading-under-new-corporate-name-and-ticker-symbol-on-january-8-2018.html", "country": "US", "domain_rank": 767, "title": "Cleantech Solutions International to Begin Trading Under New Corporate Name and Ticker Symbol on January 8, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:44:00.000+02:00", "replies_count": 0, "uuid": "d788ae96793effdc59b85277fd5c3fef7c377021"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cleantech-solutions-international-to-begin-trading-under-new-corporate-name-and-ticker-symbol-on-january-8-2018.html", "ord_in_thread": 0, "title": "Cleantech Solutions International to Begin Trading Under New Corporate Name and Ticker Symbol on January 8, 2018", "locations": [], "entities": {"persons": [{"name": "cleantech solut", "sentiment": "negative"}, {"name": "parkson yip", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "cleantech solutions international", "sentiment": "negative"}, {"name": "sharing economy international inc.", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "coo of sharing economy international inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG, Jan. 8, 2018 /PRNewswire/ -- Sharing Economy International Inc. (formerly Cleantech Solutions International, Inc.) (\"the Company\") (Nasdaq: SEII) today announced that the Company will cease trading under the ticker symbol \"CLNT\" and commence trading under the ticker symbol \"SEII\" at the market open on January 8, 2018. Along with the ticker change, the Company's common stock has been assigned a new CUSIP number of 819534 108.\n\"Our new corporate name more accurately conveys our strategic focus on technology and the global sharing economy markets,\" said Parkson Yip, COO of Sharing Economy International Inc. \"We firmly believe that collaborative consumption will continue to change the world for the better, enriching consumers lives, reducing waste and positively impacting the environment. Going forward we will continue to develop online platforms and pursue business partnerships in technology and the sharing economy that provide strong potential for future growth.\"\n\"Embracing the unstoppable and irreversible development of emerging technology such as blockchain technology in recent years, we will effectively deploy our available resources to utilize this technology in the different businesses which we have recently acquired. We endeavor to create a reliable, user-friendly and secured ecosystem so that autonomous applications will allow users to efficiently share both public and private resources along with goods and services. Our goal is to apply advanced technological concepts from blockchain technology, such as distributed ledger and smart contracts, together with other advanced technologies, such as image recognition and matching, mobile payment solutions, and artificial intelligence analytics to develop our 'Sharing Blocks' platform which will allow individuals to realize the beauty of resource sharing and empower the sharing economy as a major force in the world today.\n\"Sharing Blocks will allow sharing economy applications to share, communicate and collaborate with each other within the ecosystem in a distributed, efficient and secured globally linked operating environment. This will help sharing economy providers to focus on their investments in sharing business models without worrying about technological problems and, at the same time, make sharing simpler and easier. With all of these new technological advancements, we are getting much closer to developing a fully autonomous sharing ecosystem.\"\nAbout Sharing Economy International Inc.\nSharing Economy International Inc., through its affiliated companies, designs, manufactures and distributes a line of proprietary high and low temperature dyeing and finishing machinery to the textile industry. The Company's latest business initiatives are focused on targeting the technology and global sharing economy markets, by developing online platforms and rental business partnerships that will drive the global development of sharing through economical rental business models. Moreover, the Company will actively pursue blockchain technology in its existing and to-be-acquired business, enabling the general public to realize the beauty of resource sharing.\nSafe Harbor Statement\nThis release contains certain \"forward-looking statements\" relating to the business of the Company and its subsidiary and affiliated companies and certain potential transactions that they may enter into. These forward looking statements are often identified by the use of forward looking terminology such as \"believes,\" \"expects\" or similar expressions. Such forward looking statements involve known and unknown risks and uncertainties that may cause actual results to be materially different from those described herein as anticipated, believed, estimated or expected. The Company's actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the Company's periodic reports that are filed with the Securities and Exchange Commission and available on its website, including factors described in \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Form 10-K for the year ended December 31, 2016 and in our Form 10-Q for the quarter ended September 30, 2017. All forward-looking statements attributable to the Company or to persons acting on its behalf are expressly qualified in their entirety by these factors other than as required under the securities laws. The Company does not assume a duty to update these\nContact Information:\nSharing Economy International Inc.\nParkson Yip, Chief Operating Officer\nparkson.yip@cleantechsolutionsinternational.com\n+852-31060372\nJoseph Chow, Director of Investor Relations\nir@cleantechsolutionsinternational.com\nView original content: http://www.prnewswire.com/news-releases/cleantech-solutions-international-to-begin-trading-under-new-corporate-name-and-ticker-symbol-on-january-8-2018-300578967.html\nSOURCE Sharing Economy International Inc.", "external_links": ["http://www.prnewswire.com/news-releases/cleantech-solutions-international-to-begin-trading-under-new-corporate-name-and-ticker-symbol-on-january-8-2018-300578967.html"], "published": "2018-01-08T16:44:00.000+02:00", "crawled": "2018-01-08T18:52:08.014+02:00", "highlightTitle": ""}