{"organizations": [], "uuid": "e1678e48e67041e12b8fb07a541da6bc133d716d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-oil/oil-edges-up-on-falling-us-crude-inventories-but-supply-remains-ample-idUSL3N1PD12L", "country": "US", "domain_rank": 408, "title": "Oil edges up on falling US crude inventories, but supply remains ample", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-18T09:20:00.000+02:00", "replies_count": 0, "uuid": "e1678e48e67041e12b8fb07a541da6bc133d716d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-oil/oil-edges-up-on-falling-us-crude-inventories-but-supply-remains-ample-idUSL3N1PD12L", "ord_in_thread": 0, "title": "Oil edges up on falling US crude inventories, but supply remains ample", "locations": [], "entities": {"persons": [{"name": "hennin", "sentiment": "negative"}, {"name": "gloystein", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* US crude stocks down by 5.1 mln at 411.5 mln -API\n* But gasoline, distillate stocks rise\nBy Henning Gloystein\nSINGAPORE, Jan 18 (Reuters) - Oil prices inched up on Thursday on a reported decline in U.S. crude inventories, but prices stayed below recent three-year highs as fuel supplies remain ample and as refineries scale back operations.\nBrent crude futures were at $69.48 at 0103 GMT, up 10 cents, or 0.1 percent, from their last close. On Monday, they hit their highest since December, 2014 at $70.37 a barrel.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.15 a barrel, up 18 cents, or 0.3 percent, from their last settlement. WTI marked a December-2014 peak of $64.89 a barrel on Tuesday.\nIn an effort to tighten markets and prop up prices, a group of major oil producers around the Organization of the Petroleum Exporting Countries (OPEC) and Russia started to withhold production in January last year, and the cuts are set to last through 2018.\n“Prices ... rallied on the back of noticeable de-stocking of crude inventories, owing in part to reduced crude production from OPEC and Russia,” said Fawad Razaqzada, market analyst at future brokerage Forex.com.\nU.S. crude inventories fell by 5.1 million barrels in the week ended Jan. 12 to 411.5 million, according to the American Petroleum Institute on Wednesday.\nDespite this, many analysts are warning that the recent oil price rally, which has lifted crude by around 14 percent since early December, may be about to run out of steam.\n“We reckon that the upside is now limited for oil prices ... U.S. oil producers will ramp up production in the coming months ... U.S. shale oil output will increase by a good 111,000 barrels per day (bpd) next month to 10 million bpd, and ... will rise to about 11 million bpd by the end of next year. This would put the U.S. on par with Saudi Arabia and Russia’s output,” Razaqzada said.\nWhat’s more, the API data showed a well supplied fuel product market, which could mean lower crude demand going forward.\nU.S. refinery crude runs fell by 420,000 bpd and refined product stocks rose, implying a well supplied market.\nGasoline stocks rose by 1.8 million barrels while distillate fuels stockpiles, which include diesel and heating oil, climbed by 609,000 barrels, the API data showed.\nOfficial U.S. oil inventory and production data is due on Thursday from the Energy Information Administration (EIA).\nReporting by Henning Gloystein; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T09:20:00.000+02:00", "crawled": "2018-01-18T16:07:11.000+02:00", "highlightTitle": ""}