{"organizations": [], "uuid": "727a86455ceac781d06e7541e852ffc91b9ab776", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/31/104979128-GettyImages-912528330_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/china-will-open-even-wider-to-the-uk-li-keqiang.html", "country": "US", "domain_rank": 767, "title": "China 'will open even wider to the UK,': Li Keqiang", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.179, "site_type": "news", "published": "2018-01-31T15:55:00.000+02:00", "replies_count": 0, "uuid": "727a86455ceac781d06e7541e852ffc91b9ab776"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/31/china-will-open-even-wider-to-the-uk-li-keqiang.html", "ord_in_thread": 0, "title": "China 'will open even wider to the UK,': Li Keqiang", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "li keqiang", "sentiment": "negative"}, {"name": "andy wong", "sentiment": "negative"}, {"name": "li", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "great hall of the people", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's prime minister promised Wednesday to increase its trade with the U.K. during Theresa May's visit to the country at a time of economic uncertainty in Britain amid Brexit negotiations.\nFollowing meetings between the U.K. and Chinese premiers and officials, Li Keqiang told a press conference that both countries were \"committed to upholding to free trade and pushing forward economic globalization, and in the process promoting free trade.\"\n\"We have delivered a two-way opening up between China and the U.K. and China will open even wider to the U.K.,\" Li said, adding that the world's second largest economy \"will expand openness\" to products from the U.K., particularly agricultural items such as dairy products.\nIt was also announced that a long-standing ban on British beef exports to China would be lifted within six months. Li said intergovernmental cooperative agreements in the areas of trade, investment and \"people to people exchanges\" had been reached.\n\"In line with our agreement, China will expand openness to products from the U.K. including agricultural products. China will import U.K. products that are needed in the Chinese market,\" he said.\nGolden era? May's visit to China comes at a time of domestic upheaval for the U.K. as it undergoes the process of leaving the European Union and tries to initiate post-Brexit trade deals. Trade with China is not balanced currently, with the U.K. importing far more from China than it exports to Beijing.\nAccording to the Office for National Statistics, U.K. exports to China in 2016 were worth £16.8 billion ($23.7 billion) while imports amounted to £42.3 billion.\nFor China, the visit comes amid pressure from the international community for the country to open up to international trade and investment. May's visit follows France's President Emmanuel Macron's trade trip to China two weeks ago where he too pressed Beijing or a reciprocal trade relationship.\nPolitically too, China is under pressure to help the international community to combat volatile regional threats, such as North Korea .\nLi told the press conference that both countries were facing challenges, saying \"we both face a complex and volatile international situation and we believe it's important for us to uphold world peace.\"\nHe said Brexit affected both countries but that \"our bilateral relationship won't change with the changes to the U.K.-EU relationship.\"\nMeanwhile, May told the audience that the U.K. and China were working together to tackle global and regional security challenges, threats to aviation security and to enhance their bilateral trade, cultural and investment relationships.\n\"I'm pleased that we've agreed to intensify the golden era of U.K.-China relations,\" she said.", "external_links": [], "published": "2018-01-31T15:55:00.000+02:00", "crawled": "2018-01-31T16:00:54.002+02:00", "highlightTitle": ""}