{"organizations": [], "uuid": "da84f7c95bfe9a4791b6aa643a7151b91d200567", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/cnbc-means-business-in-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC MEANS BUSINESS IN 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.838, "site_type": "news", "published": "2018-01-09T23:36:00.000+02:00", "replies_count": 0, "uuid": "da84f7c95bfe9a4791b6aa643a7151b91d200567"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/cnbc-means-business-in-2018.html", "ord_in_thread": 0, "title": "CNBC MEANS BUSINESS IN 2018", "locations": [], "entities": {"persons": [{"name": "jay leno", "sentiment": "none"}], "locations": [{"name": "developm", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "englewood cliffs", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "cable entertainment network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expands Primetime Lineup with Three Greenlights, Three New Series and Seven New Projects in Development\nCNBC in Primetime is the Fastest Growing Cable Entertainment Network Among Persons 25-54 Since Its Launch in 2013\nENGLEWOOD CLIFFS, N.J. & PASADENA, CA. — January 9, 2018 — CNBC continues to deliver a solid slate of original programming that speaks to the network's distinct brand filter. Since the launch of CNBC original unscripted programming, CNBC is the fastest-growing Cable Entertainment Network among Persons 25-54 in primetime with CNBC's audience moving younger and more affluent. CNBC had year-over-year viewership increases among all key demos and posted its best full-year C3 rating ever among Persons 18-34 in primetime. Coming off another solid year, CNBC today announced the network is growing its lineup in 2018 with a mix of new and returning series and seven development projects in the pipeline. New originals include \"BYOB: Be Your Own Boss,\" \"Staten Island Hustle\" and \"Deadly Rich.\" The network also announced the greenlight for a fourth season of \"Jay Leno's Garage,\" currently airing original episodes on Thursdays at 10PM ET/PT, season twelve of \"American Greed\" and a seventh season of \"Secret Lives of the Super Rich.\"\n\"It's an exciting time for CNBC as we build our primetime brand, grow our audience and draw in an even younger crowd,\" said Jim Ackerman, EVP, Primetime Alternative Programming, CNBC. \"The world of business will always be a great backdrop for storytelling and we're committed to serving up more titles and characters that capture the entrepreneurial spirit in all of us.\"\nNew Series:\n\"BYOB: Be Your Own Boss\" (Premieres Tuesday, February 27 at 10PM ET/PT)\nProduced by Brian Graden Media with Brian Graden and Dave Mace as executive producers. Jim Ackerman and Marshall Eisen are the executive producers for CNBC.\nReformed entrepreneur, self-made millionaire, and small-business expert, Dennis Mulgannon helps people escape the rat race and become their own boss in a week, by buying the existing small business of their dreams.\n\"Staten Island Hustle\" (Spring 2018)\nProduced by Left Hook Media and Endemol Shine North America with Scott Teti, Matt Odgers and Robin Feinberg as executive producers. Jim Ackerman and Marshall Eisen are the executive producers for CNBC.\n\"Staten Island Hustle\" follows a group of animated, life-long friends and businessmen from Staten Island who've yet to come up with an idea or product too far-fetched for them to invest in. Without MBAs (or even college degrees) these men prove that grit, ingenuity, and street smarts may be the real key to success. Of course, it helps that somebody's always \"got a guy\" with the right connection or a good hook-up.\n\"Deadly Rich\" (Summer 2018)\nProduced for CNBC by Kurtis Productions with Mike West and Tania Lindsay as executive producers. Charles Schaeffer is the executive producer for CNBC.\nThe rich do everything differently. Even murder. When too much is never enough and the lust for wealth goes beyond all reason, killing becomes the ultimate power play. \"Deadly Rich\" from the producers of \"American Greed\" takes viewers inside these cases, navigating every evil twist and salacious turn to reveal the secrets and lies of the moneyed class. In their minds they are killers too rich to jail. And for the victims, money does not protect them, it makes them a target.\nReturning Series:\n\"American Greed\" (Season 12 premieres Monday, February 26 at 10PM ET/PT)\nProduced for CNBC by Kurtis Productions with Mike West as executive producer. Charles Schaeffer is the executive producer for CNBC.\nCNBC's shocking true crime series examines the dark side of the American Dream. Some people will do ANYTHING for MONEY.\n\"Secret Lives of the Super Rich\" (Season 7, Spring 2018)\nProduced by CNBC. Scott Matthews is the Vice President of Business News Specials. Ray Parisi is the Senior Executive Producer of Business News Specials\nIt's an exclusive world filled with enormous fortunes, unimaginable extravagance and a cast of super-rich characters with one thing in common -- a voracious appetite for success, status, and the best of the best. Reported by CNBC's Robert Frank, the series unlocks the mansion gates and scores you the ultimate VIP access to a world inhabited by the wealthiest people on the planet.\n\"Jay Leno's Garage\" (Season 4, Spring 2018)\nProduced by Original Productions, a FremantleMedia Company, and Kitten Kaboodle, with Jay Leno, Sarah Whalen, Jeff Bumgarner and Ernie Avila as executive producers. Abby Schwarzwalder serves as co-executive producer for the series. Jim Ackerman and Adam Barry are the executive producers for CNBC.\n\"Jay Leno's Garage\" takes the fast and the furious car fan for a high-octane spin across the country with a mix of stunts, reviews, celebrity interviews and challenges. As well as putting some of the world's most amazing vehicles through their paces, Jay meets fellow car enthusiasts from who he'll discover the touching, hilarious and sometimes hard to believe stories that make these cars more than just rubber and metal. Whether it's performing a stunt with adrenaline junkie Travis Pastrana, going green with Governor Arnold Schwarzenegger or taking a spin with a Mafia getaway driver, there's no wheel Jay won't get behind to tell the story of our love affair with the automobile.\nProjects in Development:\n\"Aaron Kirman Project\" (wt)\nSuperstar real estate agent Aaron Kirman and his team help homeowners sell properties that have been languishing on the market. Produced by Authentic Entertainment with Lauren Lexton as executive producer.\n\"Cash Pad\" (wt)\nInvestor Andrew Keene searches for unique real estate around the country and partners with property owners to transform properties with unrealized potential into profitable vacation-rental hot spots. Produced by Electus with Chris Grant, Drew Buckley, Tim Puntillo and Craig Plestis as executive producers.\n\"Billions By Design\" (wt)\nIn each episode, author Jason Torchinsky goes deep to tell the surprising stories behind barrier-breaking industrial design throughout history – and the economic effects these revolutionary ideas brought to bear. Produced by Sharp Entertainment with Matt Sharp as executive producer.\n\"American Hustler\" (wt)\nFrom executive producer Ice T, \"American Hustler\" features custom jewelry-maker to the stars Ben Baller who helps a fledgling entrepreneur get a business off the ground using his five simple keys to success – \"ditch, grind, hustle, climb, respect.\" Produced by Renegade 83 Entertainment with David Garfinkle, Jay Renfroe, Ice T as executive producers.\n\"Million Dollar Judgement\" (wt)\nThe most outrageous and unpredictable civil cases where audacious amounts of money hang in the balance, as told by the real participants on the front lines and featuring recreations taken from the actual trial transcripts. Produced by Sirens Media and EGTV.\n\"Sex & Business\" (wt)\nThis series explores the business of sex – from the multi-billion dollar sex toy industry to strip club empires to burgeoning interactive technologies. Produced by Intellectual Property Corporation with Eli Holzman, Aaron Saidman and Domini Hofmann as executive producers.\n\"Teen Entrepreneur\" (wt)\nEntrepreneurial teens are put to the ultimate test when they try to convince their parents to invest in their risky startup, often in lieu of funding their college education. Produ", "external_links": ["http://www.nbcuniversal.com/", "https://www.instagram.com/cnbcprime/", "https://twitter.com/CNBCPrimeTV", "https://www.facebook.com/cnbcprimetv", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-09T23:36:00.000+02:00", "crawled": "2018-01-10T02:54:03.002+02:00", "highlightTitle": ""}