{"organizations": [], "uuid": "8af734b3cfa85866c8b0d6d4f7edd38533c772dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941801-GettyImages-903660780.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/trump-asked-why-the-us-needs-more-haitians-mar-a-lago-may-hold-the-answer.html", "country": "US", "domain_rank": 767, "title": "Trump asked why the US needs more Haitians. Mar-a-Lago may hold the answer", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-12T10:14:00.000+02:00", "replies_count": 0, "uuid": "8af734b3cfa85866c8b0d6d4f7edd38533c772dc"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/12/trump-asked-why-the-us-needs-more-haitians-mar-a-lago-may-hold-the-answer.html", "ord_in_thread": 0, "title": "Trump asked why the US needs more Haitians. Mar-a-Lago may hold the answer", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald tr", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "palm beach", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "mar-a-lago", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Trump asked why the US needs more Haitians. Mar-a-Lago may hold the answer President Donald Trump reportedly stunned lawmakers Thursday when he asked, \"Why do we need more Haitians\" in the United States Yet Trump's own Palm Beach resort, Mar-a-Lago, reportedly employs Haitian guest workers to do a variety of jobs Mar-a-Lago received 70 H-2B visas for foreign workers in 2017 — ahead of the current high season SHARES Davidoff Studios | Getty Images View towards the pool and spa of the Mar-a-Lago estate, Palm Beach, Florida, February 13, 2017. \n\"Why do we need more Haitians?\" President Donald Trump reportedly asked a group of lawmakers at the White House on Thursday, demanding that congressional negotiators \"take them out\" of any further talks about extending temporary protected status. \nThe members of Congress were there for a meeting on immigration policy, and Trump's comment about Haitians shocked a number of the attendees. \nA few minutes after the Haiti comment, the topic turned to immigration from African nations, prompting Trump to ask, \"Why are we having all these people from s---hole countries come here?\" \nThe Washington Post broke the news of Trump's remarks Thursday afternoon, and the condemnation was swift and scathing. \nBut setting aside Trump's vulgar language, the president was essentially asking questions. \nLuckily for Trump, the answer to one of them — namely, why America \"needs more Haitians\" — lies right outside the president's front door. \nThat's because The Mar-a-Lago Club, Trump's mansion-cum-golf resort in Palm Beach, Florida, reportedly hires more of its seasonal foreign workers from Haiti than it does from nearly any other country. \nThose Haitians come to the United States to work for Trump on H-2B visas, temporary work permits issued by the Department of Labor to employers who can't find enough American workers to fill their need for low-skilled, seasonal labor. \nAt Mar-a-Lago, the season runs from November to April, when sunny Palm Beach is a mecca for wealthy Northerners escaping the cold. \nFor the 2017-18 season , the club applied for and received 70 H-2B visas. The foreign workers serve as cooks, housekeepers and servers, paid between $10 and $13 an hour, according to filings Mar-a-Lago submitted to the DOL. \nIn other words, Trump is an American who literally petitioned the government for \"more Haitians.\" \nCNBC reached out to a White House spokesman for comment late Thursday on Trump's Haitian guest workers, and will update this story if he responds. \nIn the meantime, as Washington reeled Thursday night from news of Trump's comments, the White House announced that the president would spend the weekend at Mar-a-Lago.", "external_links": [], "published": "2018-01-12T10:14:00.000+02:00", "crawled": "2018-01-12T10:25:39.014+02:00", "highlightTitle": ""}