{"organizations": [], "uuid": "c6ffe81398e6276ac48bbdadf05b1ca0baa073d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/02/104748005-iyah-romm.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/alphabet-spin-off-cityblock-raises-20m-for-low-income-health-care.html", "country": "US", "domain_rank": 767, "title": "Alphabet spin-off Cityblock raises $20m for low-income health care", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.148, "site_type": "news", "published": "2018-01-04T23:27:00.000+02:00", "replies_count": 0, "uuid": "c6ffe81398e6276ac48bbdadf05b1ca0baa073d7"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/04/alphabet-spin-off-cityblock-raises-20m-for-low-income-health-care.html", "ord_in_thread": 0, "title": "Alphabet spin-off Cityblock raises $20m for low-income health care", "locations": [], "entities": {"persons": [{"name": "andy slavitt", "sentiment": "none"}, {"name": "halle tecco", "sentiment": "none"}, {"name": "jeff hammerbacher", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}], "organizations": [{"name": "alphabet", "sentiment": "none"}, {"name": "sidewalk labs", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "cms", "sentiment": "none"}, {"name": "rock health", "sentiment": "none"}, {"name": "cityblock health", "sentiment": "none"}, {"name": "medicaid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Iyah Romm, Cityblock CEO \nHere's a story that bucks the idea that the tech industry is selfish and myopic : A technology start-up raised more than $20 million this week to help low-income Americans, including the elderly and the homeless, access basic health services. \nCityblock Health, which spun out of Alphabet's urban innovation unit, Sidewalk Labs , will use its funds to open up or partner with community health centers in Brooklyn, New York and other urban hubs across the country. That's coupled with the development of a technology product, which it calls Commons. \nIt aims to treat low-income patients who qualify for Medicaid , which accounts for about 1 in 5 Americans including many with complex and costly needs. \nIts team includes a mix of technologists from companies like Google, as well as nonprofit and community health experts. The company named to its board some big names in health and technology, including former CMS administrator Andy Slavitt, Rock Health co-founder Halle Tecco, and Cloudera co-founder Jeff Hammerbacher. \nAlphabet subsidiary Sidewalk Labs is moving ahead with its own plans to redevelop Toronto's waterfront, an effort that will include a whole lot of sensors and other technologies. Cityblock was initially based at Sidewalk's offices, but will now operate as an independent company. \nCityBlock isn't yet treating patients until early next year. But Iyah Romm, the company's CEO and co-founder, explained on Wednesday that the company is hoping to provide a range of resources, including social services, access to affordable housing, and more. \nThe underlying premise is that these individuals need more than just medical care to stay healthier for longer and cut down on trips to the emergency room. \nRomm said he started the company because very few health-technology start-ups are focused on Medicaid patients. The vast majority are targeted to the so-called \"worried well,\" who are already fit and healthy but looking to optimize their health. \nThe company will make money by taking on risk for these populations, and delivering better, more affordable care. Its model involves improving outcomes, rather than reaping in revenues through costly tests and procedures. \nThe funds come from a slew of investment firms, including Maverick Capital Ventures and Thrive Capital, among others. Sidewalk Labs was also an investor. Christina Farr Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-04T23:27:00.000+02:00", "crawled": "2018-01-04T23:38:30.009+02:00", "highlightTitle": ""}