{"organizations": [], "uuid": "fe1368e652bb3acf0654f1bc29e7388d93083024", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-noble-corporation-plc-announces-pricing-and-upsizing-of-offering-of-senior-guaranteed-notes.html", "country": "US", "domain_rank": 767, "title": "Noble Corporation plc Announces Pricing And Upsizing Of Offering Of Senior Guaranteed Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-18T03:03:00.000+02:00", "replies_count": 0, "uuid": "fe1368e652bb3acf0654f1bc29e7388d93083024"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-noble-corporation-plc-announces-pricing-and-upsizing-of-offering-of-senior-guaranteed-notes.html", "ord_in_thread": 0, "title": "Noble Corporation plc Announces Pricing And Upsizing Of Offering Of Senior Guaranteed Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "cayman islands", "sentiment": "none"}], "organizations": [{"name": "noble corporation plc", "sentiment": "negative"}, {"name": "noble corporation", "sentiment": "none"}, {"name": "nhil", "sentiment": "none"}, {"name": "noble holding international limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Noble Corporation plc (\"Noble-UK\") (NYSE: NE) announced today that its indirect, wholly-owned subsidiary, Noble Holding International Limited (\"NHIL\"), has priced an offering to eligible purchasers under Rule 144A and Regulation S under the Securities Act of 1933, as amended (the \"Securities Act\"), of $750,000,000 aggregate principal amount of 7.875% senior unsecured guaranteed notes due 2026 (the \"Notes\"). The offering was upsized from a previously announced amount of $500,000,000. Noble Corporation, a Cayman Islands exempted company (\"Noble-Cayman\") and an indirect, wholly-owned subsidiary of Noble-UK, and certain other subsidiaries of Noble-Cayman will fully and unconditionally guarantee the Notes on a senior unsecured basis. NHIL intends to use the net proceeds of approximately $738,750,000, together with cash on hand, to pay the purchase price and accrued interest (together with fees and expenses) in the tender offers (the \"Tender Offers\") to purchase for cash up to $750,000,000 aggregate purchase price, excluding accrued interest, of NHIL's outstanding 4.00% Senior Notes due 2018 (for which the interest rate has been increased to 5.75%), 4.90% Senior Notes due 2020, 4.625% Senior Notes due 2021, 3.95% Senior Notes due 2022 and 7.75% Senior Notes due 2024 (the \"2024 Notes\") and the outstanding 7.50% Senior Notes due 2019 issued by certain subsidiaries of Noble-Cayman. If the Tender Offers, which are subject to market conditions and other factors, including a $250,000,000 cap with respect to the 2024 Notes and the completion of the offering of the Notes for gross proceeds of at least $500,000,000, are not consummated, or the aggregate purchase price of the notes tendered in the Tender Offers and accepted for payment is less than the net proceeds of the Notes offering, NHIL will use the remainder of those proceeds for general corporate purposes, which may include the further retirement of debt, including, but not limited to, the purchase of debt in open market or privately negotiated transactions. The Notes offering is expected to close on or about January 31, 2018, subject to customary closing conditions.\nThe Notes will be offered and sold to persons reasonably believed to be qualified institutional buyers in the United States pursuant to Rule 144A under the Securities Act, and outside the United States to non-U.S. persons pursuant to Regulation S under the Securities Act. The offer and sale of the Notes and the related guarantees have not been registered under the Securities Act or any state securities laws and may not be offered or sold in the United States absent registration or an applicable exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state laws.\nThis press release does not constitute an offer to sell, or a solicitation of an offer to buy, nor shall there be any sale of, these securities in any state or jurisdiction in which such offer, solicitation or sale is unlawful. Offers of securities will be made in the United States only by means of a private offering memorandum pursuant to Rule 144A under the Securities Act, and outside the United States to non-U.S. persons pursuant to Regulation S under the Securities Act. This press release is not an offer to purchase or a solicitation of an offer to sell any of the notes subject to the Tender Offers. The Tender Offers are being made subject to the terms of an offer to purchase and consent solicitation statement and only in such jurisdictions as is permitted under applicable law. In any jurisdiction in which the Tender Offers are required to be made by a licensed broker or dealer, the Tender Offers will be deemed to be made on behalf of NHIL by the dealer managers of the Tender Offers or one or more registered brokers or dealers that are licensed under the laws of such jurisdiction.\nThis press release is being issued pursuant to and in accordance with Rule 135c under the Securities Act.\nForward-Looking Disclosure Statement\nStatements in this press release regarding activities or events that may occur in the future, including statements about the intended use of proceeds or other aspects of the Notes offering, the Tender Offers, rig demand, the offshore drilling market, oil prices, contract backlog, fleet status, our or our affiliates' financial position, business strategy, impairments, repayment of debt, credit ratings, borrowings under our or our affiliates' credit facilities or other instruments, sources of funds, future capital expenditures, contract commitments, dayrates, contract commencements, extension or renewals, contract tenders, the outcome of any dispute, litigation, audit or investigation, plans and objectives of management for future operations, foreign currency requirements, results of joint ventures, indemnity and other contract claims, construction and upgrade of rigs, industry conditions, access to financing, impact of competition, governmental regulations and permitting, availability of labor, worldwide economic conditions, taxes and tax rates, indebtedness covenant compliance, dividends and distributable reserves, timing or results of acquisitions or dispositions and timing for compliance with any new regulations, as well as any other statements in this release that are not historical facts, are forward-looking statements that involve certain risks, uncertainties and assumptions. These include but are not limited to operating hazards and delays, risks associated with operations outside the U.S., actions by regulatory authorities, credit rating agencies, customers, joint venture partners, contractors, lenders and other third parties, legislation and regulations affecting drilling operations, compliance with regulatory requirements, factors affecting the level of activity in the oil and gas industry, supply and demand of drilling rigs, factors affecting the duration of contracts, the actual amount of downtime, factors that reduce applicable dayrates, litigation, violations of anti-corruption laws, hurricanes and other weather conditions, market conditions, the future price of oil and gas and other factors detailed in Noble-UK's most recent Form 10-K, Form 10-Qs and other filings with the Securities and Exchange Commission. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated.\nNoble-Cayman is an indirect, wholly-owned subsidiary of Noble-UK, a public limited company incorporated under the laws of England and Wales. Noble-Cayman performs, through its subsidiaries, contract drilling services with a global fleet of mobile offshore drilling units.\nNHIL is an indirect, wholly-owned subsidiary of Noble-Cayman. NHIL performs, through its subsidiaries, contract drilling services with a global fleet of mobile offshore drilling units.\nView original content: http://www.prnewswire.com/news-releases/noble-corporation-plc-announces-pricing-and-upsizing-of-offering-of-senior-guaranteed-notes-300584324.html\nSOURCE Noble Corporation", "external_links": ["http://www.prnewswire.com/news-releases/noble-corporation-plc-announces-pricing-and-upsizing-of-offering-of-senior-guaranteed-notes-300584324.html"], "published": "2018-01-18T03:03:00.000+02:00", "crawled": "2018-01-18T03:23:19.006+02:00", "highlightTitle": ""}