{"organizations": [], "uuid": "68b221b570d83eb553e4a7a3fa3ca489548ef776", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/tim-cook-iphone-x.jpg", "site_section": "http://feeds.feedburner.com/AppleNews-GoogleNews", "section_title": "apple news - Google News", "url": "http://fortune.com/2018/01/23/apple-iphone-x-sales-2/", "country": "US", "domain_rank": 1196, "title": "Apple's iPhone X Sales Have Been Strong—But Not Record-Breaking, Analyst Says - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:12:00.000+02:00", "replies_count": 0, "uuid": "68b221b570d83eb553e4a7a3fa3ca489548ef776"}, "author": "", "url": "http://fortune.com/2018/01/23/apple-iphone-x-sales-2/", "ord_in_thread": 0, "title": "Apple's iPhone X Sales Have Been Strong—But Not Record-Breaking, Analyst Says - Fortune", "locations": [], "entities": {"persons": [{"name": "don reisinger", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "canalys", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger 12:12 PM EST \nApple hasn’t revealed how many iPhone X units it sold in the fourth quarter, but a new study from researcher Canalys has put a number on it. \nThe tech giant sold 29 million iPhone units in the fourth quarter, including 7 million in the U.S., Canalys said in a statement on Tuesday. That was enough to make the iPhone X the most popular iPhone Apple sold during the period, topping the iPhone 8 and iPhone 8 Plus. \nApple unveiled the iPhone X in September and released the handset in November . The iPhone X is the most expensive smartphone Apple has ever released with a starting price of $999. For that, users get a dramatically redesigned iPhone that ditches the physical home button in favor of a 5.8-inch screen that nearly entirely covers the handset’s face. It also comes with support for a new Apple biometric technology called Face ID that scans a person’s face to unlock the smartphone and verify mobile purchases via Apple Pay. \nGet Data Sheet , Fortune’s technology newsletter \nAfter its announcement last year, there had been some speculation that at $999, the iPhone X might price itself out of the market . But Canalys found in its analysis of the worldwide market that many customers traded in their older iPhones to defray the cost of the iPhone X. \nStill, Canalys cautioned that the iPhone X might have performed “slightly below industry expectations” and early iPhone X shipments “were not the fastest ever for an iPhone.” The researcher didn’t say which Apple handset tallied the fastest sales. \nApple has been silent about iPhone X sales, despite widespread speculation over exactly how many units it has sold. The company will announce earnings next week for the fiscal period that includes the fourth quarter. It’s unknown whether it will break down iPhone sales by unit. \nApple did not respond to a Fortune request for comment on how many iPhone X units it sold during the fourth quarter. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-23T19:12:00.000+02:00", "crawled": "2018-01-23T23:50:24.031+02:00", "highlightTitle": ""}