{"organizations": [], "uuid": "fd45ea9d8027d6b9cfac775550971c4af4fb63d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 453}, "facebook": {"likes": 4187, "shares": 4187, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/12/104767738-SpaceX_Echostar_Falcon_9_launch.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/highly-classified-us-spy-satellite-appears-to-be-a-total-loss-after-spacex-launch.html", "country": "US", "domain_rank": 767, "title": "Highly classified US spy satellite appears to be a total loss after SpaceX launch", "performance_score": 10, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.527, "site_type": "news", "published": "2018-01-09T04:10:00.000+02:00", "replies_count": 0, "uuid": "fd45ea9d8027d6b9cfac775550971c4af4fb63d7"}, "author": "Everett Rosenfeld", "url": "https://www.cnbc.com/2018/01/08/highly-classified-us-spy-satellite-appears-to-be-a-total-loss-after-spacex-launch.html", "ord_in_thread": 0, "title": "Highly classified US spy satellite appears to be a total loss after SpaceX launch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A highly classified U.S. government satellite appears to have been totally lost after being taken into space by a recent launch from Elon Musk's SpaceX, according to a new report.\nDow Jones reported Monday evening that lawmakers had been briefed about the apparent destruction of the secretive payload — code-named Zuma — citing industry and government officials\nThe payload was suspected to have burned up in the atmosphere after failing to separate perfectly from the upper part of the SpaceX Falcon 9 rocket, the report said.\nAccording to Dow Jones, the absence of official word on the incident means that there could have been another chain of events.\nThe missing satellite may have been worth billions of dollars, industry officials estimated to the wire service.\nshow chapters US spy satellite launched by SpaceX appears to be lost: Report      21 Mins Ago | 00:43 Northrop Grumman, which built the satellite, told Dow Jones through a spokesman: \"We cannot comment on classified missions.\"\n\"For clarity: after review of all data to date, Falcon 9 did everything correctly on Sunday night,\" Gwynne Shotwell, President and COO of SpaceX, in a statement sent to CNBC. \"If we or others find otherwise based on further review, we will report it immediately. Information published that is contrary to this statement is categorically false. Due to the classified nature of the payload, no further comment is possible.\"\n\"Since the data reviewed so far indicates that no design, operational or other changes are needed, we do not anticipate any impact on the upcoming launch schedule. Falcon Heavy has been rolled out to launchpad LC-39A for a static fire later this week, to be followed shortly thereafter by its maiden flight. We are also preparing for an F9 launch for SES and the Luxembourg Government from SLC-40 in three weeks.\"\nThe Zuma spacecraft was attached to one of SpaceX's Falcon 9 rockets and launched from the Cape Canaveral Air Force Station in Florida. The Falcon 9 successfully landed back to base.\nLanding and reusing rockets is the main aim of SpaceX scientists, who argue that it reduces the cost of launches and allows it to perform more missions.\nSpaceX did not reveal the purpose of Zuma because it is classified, but the mission marked Elon Musk's company's first in 2018.\n—CNBC's Arjun Kharpal contributed to this report. \nFor more on the apparently lost satellite, see the full report from Dow Jones.", "external_links": [], "published": "2018-01-09T04:10:00.000+02:00", "crawled": "2018-01-09T10:14:31.531+02:00", "highlightTitle": ""}