{"organizations": [], "uuid": "d01a951118d86d0909ae4715fa0c4a7964ba913a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222424235&w=1200&r=LYNXMPEE0F0VH", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-citigroup-results/citi-reports-18-3-billion-loss-on-tax-law-adjusted-profit-rises-4-percent-idUSKBN1F51JX", "country": "US", "domain_rank": 408, "title": "Citi reports $18.3 billion loss on tax law; adjusted profit rises 4 percent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:15:00.000+02:00", "replies_count": 0, "uuid": "d01a951118d86d0909ae4715fa0c4a7964ba913a"}, "author": "", "url": "https://www.reuters.com/article/us-citigroup-results/citi-reports-18-3-billion-loss-on-tax-law-adjusted-profit-rises-4-percent-idUSKBN1F51JX", "ord_in_thread": 0, "title": "Citi reports $18.3 billion loss on tax law; adjusted profit rises 4 percent", "locations": [], "entities": {"persons": [{"name": "s.  citigroup", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "citi", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Citigroup Inc posted an $18-billion quarterly loss on Tuesday because of charges related to a new U.S. tax law, but its adjusted earnings beat Wall Street expectations and management signaled that the bank may soon lift financial performance targets.\nThe law, signed by President Donald Trump last month, has made fourth-quarter earnings a messy ordeal for big banks. It forces them to take one-time hits on earnings held abroad and changes the treatment of deferred tax assets, both of which affect Citigroup in particular.\nHowever, banks and other large U.S. corporations expect to benefit greatly from lower taxes and other provisions in the new law over the long term.\nCitigroup, the fourth-largest U.S. lender, stands to gain less than peers because it already earns about half of its profits in lower-tax countries abroad. Even so, it expects its tax rate to fall to about 25 percent this year from 30 percent in 2017. That could save the bank billions of dollars over the next few years.\nThe changes will not only boost Citigroup’s profits, but allow the bank to generate higher returns and generate more capital, Chief Executive Michael Corbat said. The new law might also stimulate economic growth because it incentivizes companies to invest in their businesses and has led to wage hikes that could help consumers, he said.\n“Tax reform is a clear net positive for Citi and its shareholders,” Corbat said on a conference call with analysts.\nManagement is now examining financial performance targets set before the tax law changes to see whether they should be lifted, Chief Financial Officer John Gerspach said on a separate call with journalists.\nBased on the tax savings alone, Citigroup expects to generate a return on tangible common equity of 10.5 percent this year, 12 percent next year and 13 percent in 2020, higher than previous forecasts. That metric is closely watched by Wall Street as a gauge of how much profit a bank can generate from shareholder money.\nExecutives also expect inflation to boost Citigroup’s net interest income as the U.S. Federal Reserve continues to lift rates this year. For every 25 basis points the Fed lifts rates, Citi should generate another $80 million of revenue, Gerspach said.\nCitigroup shares rose 0.4 percent to $77.12 in morning trading.\nFILE PHOTO: The Citibank building is seen in the financial district of Canary Wharf in London, Britain January 19, 2017. REUTERS/Kevin Coombs/File Photo Lagging competitors in growth and not earning its cost of capital, Citigroup’s valuation has not kept up with rivals like JPMorgan Chase and Bank of America Corp. Investors and analysts have been pushing Citi to prove it can grow revenue and profits as a second act to shrinking and returning capital.\nThe bank already plans to return at least $60 billion worth of capital to investors through stock buybacks and dividends, a target executives reiterated on Tuesday.\nExcluding the tax issues, which led to $22 billion in charges, its fourth-quarter earnings were boosted by growth in consumer banking, especially in Asia and Mexico.\nIts adjusted net income rose 4 percent to $3.7 billion, or $1.28 per share, compared with analysts’ average estimate of $1.19 per share, according to Thomson Reuters I/B/E/S.\nTotal revenue rose 1.4 percent to $17.26 billion and was slightly better than estimates of $17.22 billion.\nCitigroup’s institutional business, which includes investment banking and trading, fell 1 percent due to weakness in trading that has also affected Wall Street peers.\nBond trading revenue fell 18 percent due to ongoing weakness in volatility, while equity markets revenue was down 23 percent because of $130 million worth of losses on a derivatives trade with one client.\nThe client is troubled South African furniture retailer Steinhoff International, a source familiar with the matter told Reuters. Other lenders, including JPMorgan Chase & Co, also have exposure to Steinhoff, which has been embroiled in an accounting scandal.\nIn reports on Tuesday morning, several analysts said Citi’s results were modestly ahead of Wall Street’s best guess and that they were more focused on whether the bank would lift performance targets.\n“Results could prove ‘good enough’ this quarter,” Instinet analyst Steven Chubak wrote in a note to clients.\nCiti’s results follow JPMorgan and Wells Fargo last week. Bank of America Corp and Goldman Sachs Group Inc plan to report fourth-quarter results on Wednesday, with Morgan Stanley expected to report on Thursday.\nReporting by David Henry in New York and Sweta Singh in Bengaluru; Writing by Lauren Tara LaCapra; Editing by Bernard Orr and Nick Zieminski\n ", "external_links": [], "published": "2018-01-16T15:15:00.000+02:00", "crawled": "2018-01-16T15:21:42.041+02:00", "highlightTitle": ""}