{"organizations": [], "uuid": "4416b850c1571a323296c767af2370005f80531b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/10/104646316-GettyImages-810208294.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/white-house-tells-congress-were-not-going-to-apply-new-russia-sanctions-yet.html", "country": "US", "domain_rank": 767, "title": "White House tells Congress: We're not going to apply new Russia sanctions yet", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-30T06:03:00.000+02:00", "replies_count": 0, "uuid": "4416b850c1571a323296c767af2370005f80531b"}, "author": "", "url": "https://www.cnbc.com/2018/01/29/white-house-tells-congress-were-not-going-to-apply-new-russia-sanctions-yet.html", "ord_in_thread": 0, "title": "White House tells Congress: We're not going to apply new Russia sanctions yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration said on Monday it would not immediately impose additional sanctions on Russia under a new law designed to punish Moscow's alleged meddling in the 2016 U.S. election, insisting the measure was already hitting Russian companies.\n\"Today, we have informed Congress that this legislation and its implementation are deterring Russian defense sales,\" State Department spokeswoman Heather Nauert said in a statement.\n\"Since the enactment of the ... legislation, we estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions.\"\nThe administration faced a deadline on Monday to impose sanctions on anyone determined to conduct significant business with Russian defense and intelligence sectors, already sanctioned for their alleged role in the election.\nBut citing long time frames associated with major defense deals, Nauert said it was too soon to tell how effective the law had been, so it was better to wait to impose those sanctions.\n\"From that perspective, if the law is working, sanctions on specific entities or individuals will not need to be imposed because the legislation is, in fact, serving as a deterrent,\" she said in a statement.\nPresident Donald Trump's administration also did not make public reports required by Monday under the bill he reluctantly signed into law on Aug. 2, just six months into his presidency.\nThe measure, known as the \"Countering America's Adversaries Through Sanctions Act,\" or CAATSA, required the administration to list \"oligarchs\" close to President Vladimir Putin's government and issue a report detailing possible consequences of penalizing Russia's sovereign debt.\nReports may stay classified The administration said it would release at least some of that information to Congress, but it was not immediately clear whether it would be made public, or kept classified.\nTrump, who said he wanted warmer ties with Russia, had opposed the legislation as it made its way through Congress last year. Monday's deadline was seen as a test of his willingness to crack down on Russia.\nMembers of Congress, including Democrats and some of Trump's fellow Republicans, have been clamoring for his administration to use sanctions to punish Moscow for past election interference and prevent future meddling in U.S. polls.\nSeveral congressional committees, as well as Special Counsel Robert Mueller , are investigating whether Russia tried to tilt last November's election in Trump's favor, using means such as hacking into the emails of senior Democrats and promoting divisive social and political messages online. Trump and the Kremlin have separately denied any collusion.\nSenator Bob Corker , the Republican chairman of the Senate Foreign Relations Committee, one of the main congressional architects of the sanctions law, said he was not concerned that the administration did not announce sanctions or release all of the required reports on Monday.\n\"This is when sanctions season begins, and so they'll be rolling them out,\" he told reporters.\n\"We feel pretty good about the process,\" Corker said. \"They're rushing the information over to us today, and by the close of business, they're going to have two of the three, as I understand it. So they're taking it very seriously.\"", "external_links": [], "published": "2018-01-30T06:03:00.000+02:00", "crawled": "2018-01-30T06:03:46.146+02:00", "highlightTitle": ""}