{"organizations": [], "uuid": "d8cd1221ed3bed387e8b9247cec568753d12b32c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-literacy-heart-failure/poor-health-literacy-can-be-dangerous-for-heart-failure-patients-idUKKBN1FD2O3", "country": "US", "domain_rank": 408, "title": "Poor health literacy can be dangerous for heart failure patients", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:28:00.000+02:00", "replies_count": 0, "uuid": "d8cd1221ed3bed387e8b9247cec568753d12b32c"}, "author": "", "url": "https://uk.reuters.com/article/us-health-literacy-heart-failure/poor-health-literacy-can-be-dangerous-for-heart-failure-patients-idUKKBN1FD2O3", "ord_in_thread": 0, "title": "Poor health literacy can be dangerous for heart failure patients", "locations": [], "entities": {"persons": [{"name": "matteo fabbri", "sentiment": "none"}, {"name": "gregg fonarow", "sentiment": "none"}, {"name": "natalie grover", "sentiment": "none"}], "locations": [{"name": "rochester", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "mayo clinic", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  23 minutes ago Poor health literacy can be dangerous for heart failure patients Natalie Grover 4 Min Read \n(Reuters Health) - People with heart failure have higher odds of hospitalization and death if they have trouble getting and understanding good health information, a new study suggests. \n“This study points to an important need to address low health literacy in heart failure and find effective strategies that can help overcome the risk,” said Dr. Gregg Fonarow, co-chief of University of California, Los Angeles’ division of cardiology, who was not involved in the study. \nDr. Matteo Fabbri and colleagues at the Mayo Clinic in Rochester, Minnesota surveyed 2,647 people with heart failure in the southeastern region of their state in 2013-2015. After the survey, they tracked the patients for an average of about 15 months. \nNearly 11 percent of the study participants had poor health literacy, and these patients had a nearly two-fold higher risk of death, and a 30% increased likelihood of hospitalization, compared to the rest, the investigators report in Mayo Clinic Proceedings. \nThe risk of poor outcomes increased as people’s health literacy decreased, the researchers found. \nHealth literacy is defined as the capacity to obtain, process and understand basic health information and services needed to make appropriate health decisions, according to the non-profit National Academy of Medicine. \nThe organization estimates that 90 million American adults have limited health literacy, which is associated with higher rates of hospitalization and higher use of emergency services and can result in billions of dollars in avoidable healthcare costs. \nAbout 5.7 million adults in the U.S. have heart failure, according to the Centers for Disease Control and Prevention (CDC). The CDC estimates the condition costs $30.7 billion each year in medicines, healthcare services and lost productivity. \nPatients with a low level of health literacy are less likely to recognize the signs and symptoms of worsening heart failure, making hospitalization and death more likely, the researchers wrote. \nThe finding that health literacy “stood up against important other traditional risk factors as an independent predictor is important,” said Dr. Christopher O’Connor, editor-in-chief of the medical journal JACC: Heart Failure, who was not involved in the study. \nThe Fabbri team assessed participants’ health literacy by asking three questions: How confident are you filling out forms by yourself? How often do you have someone help you read hospital materials? How often do you have problems learning about your medical condition because of difficulty reading hospital materials? \nMauricio Avendano Pabon, professor of public policy and global health at King’s College London, told Reuters Health by email that the current study can’t prove that poor health literacy itself is what causes poor outcomes. \n“We cannot tell from their analysis whether it is health literacy or other unmeasured confounding factors associated with both literacy and outcomes, e.g., cognitive decline,” said Pabon, who was not involved in the study. \nThe study authors acknowledged some study limitations, most notably that people with lower health literacy could have been less likely to participant in the survey, and that the study was conducted in a homogeneous population with higher-than-average education. \nStill, said study coauthor Dr. Veronique Roger in an email, “While these results have been generated in a population composed of mainly non-Hispanic whites, the association between outcomes and health literacy has been studied in different hospital settings and among minorities - and similar results were found, affirming that our results could be generalizable to all patients with heart failure in the United States.” \nSOURCE: bit.ly/2DDlIXv Mayo Clinic Proceedings, online December 6, 2017.", "external_links": [], "published": "2018-01-24T20:28:00.000+02:00", "crawled": "2018-01-24T21:02:04.006+02:00", "highlightTitle": ""}