{"organizations": [], "uuid": "c176dca7b2fde5fec5726e48f0f6c556ac0d1606", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-france-security-prison/french-jail-boss-quits-as-guards-protest-over-islamist-inmates-attack-idUKKBN1F41PF", "country": "US", "domain_rank": 408, "title": "French jail boss quits as guards protest over Islamist inmate's attack", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:28:00.000+02:00", "replies_count": 0, "uuid": "c176dca7b2fde5fec5726e48f0f6c556ac0d1606"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-security-prison/french-jail-boss-quits-as-guards-protest-over-islamist-inmates-attack-idUKKBN1F41PF", "ord_in_thread": 0, "title": "French jail boss quits as guards protest over Islamist inmate's attack", "locations": [], "entities": {"persons": [{"name": "christian ganczarski", "sentiment": "none"}], "locations": [{"name": "fresnes", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "djerba", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "cgt", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:29 PM / Updated 36 minutes ago French jail boss quits as guards protest over Islamist inmate's attack Reuters Staff 3 Min Read \nPARIS (Reuters) - The head of a French jail where an al Qaeda inmate wounded three guards in a scissors attack resigned on Monday as security staff at several prisons protested, saying they no longer have the staff or clout to contain ultra-dangerous convicts. \nRiot police broke up a picket at the notoriously overcrowded Fresnes jail on the outskirts of Paris, the country’s second-biggest, and guards staged similar protests at prisons in the north and south of France. The CGT labour union said half of 188 French jails were affected by the protests. \nThe director of another prison in the Calais region resigned four days after guards there were injured by a scissors-wielding inmate convicted over an al Qaeda attack that killed 21 people at a synagogue on the Tunisian resort island of Djerba in 2000. \nThe inmate, Christian Ganczarski, is a convert to Islam and a German national of Polish origin who is serving an 18-year sentence for his role in the Djerba attack. \nFrench jail guards regularly complain of staff shortages. More prisons have been promised to tackle overcrowding, but the grievances took on additional weight after the attack at Vendin-le-Vieil prison in the Calais area. \nRepresentatives of prison guards said soft-touch prison management was making it increasingly difficult and dangerous to cope with large numbers of Islamist militants and sympathisers. \n“Some prison chiefs are running their jails like children’s nurseries,” said Jean-Francois Forget, a representative of one of the prison guard unions. “What will it take for them to act, a death?” \nHe accused the authorities of failing to address grievances that include 4,000 recently recorded cases of violence towards guards, including 15 incidents where guards were taken hostage. \nWhile new prisons and more staff would address the problem, urgent measures are needed to deal with a dangerous “diaspora” inside France’s jails, Forget said. \nPresident Emmanuel Macron said that an action plan would be presented in February to address the issue and seek to go beyond his election pledge that 15,000 new prison cells would be built. \nTension among guards spilled over late last week after the attack at Vendin-le-Vieil, perpetrated by a man who, as well as Djerba, faces extradition to the United States over the Sept. 11 2001 attacks once he completes his sentence in France. \nGanczarski, who once visited late al Qaeda leader Osama bin Laden in Afghanistan, is considered by France to have played a role as chief of al Qaeda’s short-wave communications network. \nThe prison where he is held, 200 km (125 miles) north of Paris, is the one where France plans to temporarily rehouse Salah Abdeslam, the main surviving suspect of an Islamist commando unit that killed 130 people in Paris in November 2015. Reporting by Brian Love, Emmanuel Jarry and Elizabeth Pineau; editing by Mark Heinrich", "external_links": [], "published": "2018-01-15T15:28:00.000+02:00", "crawled": "2018-01-15T16:11:19.008+02:00", "highlightTitle": ""}