{"organizations": [], "uuid": "0607aa35dd2b4d0fb7abffcdc0f28601b00ba9e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-alliance-holdings-gp-l-p-reports-quarterly-financial-results-increases-quarterly-distribution-by-1-point-0-percent-to-0.html", "country": "US", "domain_rank": 767, "title": "Alliance Holdings GP, L.P. Reports Quarterly Financial Results; Increases Quarterly Distribution by 1.0% to $0.7425 Per Unit; and Announces Intent to Simplify Structure", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.317, "site_type": "news", "published": "2018-01-29T15:00:00.000+02:00", "replies_count": 0, "uuid": "0607aa35dd2b4d0fb7abffcdc0f28601b00ba9e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-alliance-holdings-gp-l-p-reports-quarterly-financial-results-increases-quarterly-distribution-by-1-point-0-percent-to-0.html", "ord_in_thread": 0, "title": "Alliance Holdings GP, L.P. Reports Quarterly Financial Results; Increases Quarterly Distribution by 1.0% to $0.7425 Per Unit; and Announces Intent to Simplify Structure", "locations": [], "entities": {"persons": [], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "alliance resource partners", "sentiment": "none"}, {"name": "ahgp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla.--(BUSINESS WIRE)-- Alliance Holdings GP, L.P. (NASDAQ: AHGP) today reported financial results for the quarter and year ended December 31, 2017 (the \"2017 Quarter\" and the \"2017 Year\", respectively). As previously announced, the Board of Directors of its general partner (the \"Board\") approved a distribution to unitholders of $0.7425 per unit (an annualized rate of $2.97 per unit) for the 2017 Quarter, payable on February 20, 2018 to AHGP unitholders of record as of the close of trading on February 13, 2018. The announced distribution represents a 35.0% increase over the cash distribution of $0.55 for the quarter ended December 31, 2016 and a 1.0% increase over the cash distribution of $0.735 for the quarter ended September 30, 2017 (the “Sequential Quarter”).\nAHGP's principal sources of cash flow are its ownership interests in Alliance Resource Partners, L.P. (NASDAQ: ARLP). The declared distribution is based on the distribution AHGP will receive from its ownership interests in ARLP, which previously announced a quarterly distribution for the 2017 Quarter of $0.51 per unit, or $2.04 per unit on an annualized basis, payable on February 14, 2018 to all unitholders of record as of the close of trading on February 7, 2018. (See ARLP Press Release dated January 26, 2018.)\nAHGP also reported net income attributable to AHGP for the 2017 Quarter of $49.3 million, or $0.82 per basic and diluted limited partner interest, a decrease of 19.4% compared to net income attributable to AHGP for the 2016 Quarter of $61.2 million, or $1.02 per basic and diluted limited partner unit. Net income attributable to AHGP for the 2017 Quarter increased approximately 26.1% compared to net income attributable to AHGP for the Sequential Quarter of $39.1 million, or $0.65 per basic and diluted limited partner unit. For the year ended December 31, 2017, AHGP reported net income of $186.0 million, or $3.11 per basic and diluted limited partner unit, which is consistent with the year ended December 31, 2016.\nOperating results for AHGP reflect those of the operating subsidiaries of ARLP and, as a result, AHGP reports its financial results on a consolidated basis with the financial results of ARLP. The consolidated net income of AHGP includes earnings and losses attributable to both AHGP and noncontrolling interests.\nAHGP also announced it intends to move forward with a structural simplification of the Alliance Partnerships, as initially discussed last July when AHGP exchanged its incentive distribution rights in ARLP for common units in ARLP. (Please see Press Release dated July 28, 2017.) At that time, we indicated further evaluation of our structural alternatives and the potential outcome of tax reform proposals then under consideration was appropriate before determining whether further simplification of the Alliance Partnerships should proceed. Now that our structural evaluations are complete and tax reform has been clarified, management has recommended to the Board that further streamlining the Alliance Partnerships’ structure into a single reporting and trading entity should be pursued. We currently anticipate simplification would be principally accomplished through a distribution of ARLP common units held by AHGP to the AHGP unitholders. While the final form of this simplification is being refined, AHGP expects to complete this process in 2018 and will provide additional information once a final structure is approved.\nA joint conference call regarding AHGP and ARLP’s 2017 Quarter and 2017 Year financial results is scheduled for today at 10:00 a.m. Eastern. To participate in the conference call, dial (877) 317-6016 and request to be connected to the Alliance Resource Partners, L.P. and Alliance Holdings GP, L.P. earnings conference call. Canadian callers should dial (855) 669-9657 and all other International callers should dial (412) 317-6016 and request to be connected to the same call. Investors may also listen to the call via the \"investor information\" section of ARLP's website at http://www.arlp.com or AHGP's website at http://www.ahgp.com .\nAn audio replay of the conference call will be available for approximately one week. To access the audio replay, dial US Toll Free (877) 344-7529; International Toll (412) 317-0088; Canada Toll Free (855) 669-9658 and request to be connected to replay access code 10115818.\nAbout Alliance Holdings GP, L.P.\nAHGP is a limited partnership formed to own and control ARLP's general partner through which it holds a non-economic general partner interest in ARLP and an approximate one percent general partner interest in ARLP's operating subsidiary, Alliance Resource Operating Partners, L.P. In addition, AHGP owns 87,188,338 common units of ARLP.\nNews, unit prices and additional information about AHGP including filings with the Securities and Exchange Commission, are available at http://www.ahgp.com . For more information, contact the investor relations department of AHGP at (918) 295-1415 or via e-mail at investorrelations@ahgp.com .\nThe statements and projections used throughout this release are based on current expectations. These statements and projections are forward-looking, and actual results may differ materially. These statements do not include the potential impact of any mergers, acquisitions or other business combinations that may occur after the date of this release. At the end of this release, we have included more information regarding business risks that could affect our results.\nFORWARD-LOOKING STATEMENTS: With the exception of historical matters, any matters discussed in this press release are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from projected results. These risks, uncertainties and contingencies include, but are not limited to, the following: changes in competition in coal markets and the ability of ARLP and its consolidated subsidiaries (the \"ARLP Partnership\") to respond to such changes; changes in coal prices, which could affect the ARLP Partnership's operating results and cash flows; risks associated with the expansion of the ARLP Partnership's operations and properties; legislation, regulations, and court decisions and interpretations thereof, including those relating to the environment and the release of greenhouse gases, mining, miner health and safety and health care; deregulation of the electric utility industry or the effects of any adverse change in the coal industry, electric utility industry, or general economic conditions; dependence on significant customer contracts, including renewing existing contracts upon expiration; changing global economic conditions or in industries in which the ARLP Partnership's customers operate; liquidity constraints, including those resulting from any future unavailability of financing; customer bankruptcies, cancellations or breaches to existing contracts, or other failures to perform; customer delays, failure to take coal under contracts or defaults in making payments; adjustments made in price, volume or terms to existing coal supply agreements; fluctuations in coal demand, prices and availability; continuation or worsening of depressed oil and gas prices adversely affecting the ARLP Partnership’s investments in oil and gas mineral interests and midstream services; the ARLP Partnership's productivity levels and margins earned on its coal sales; changes in raw material costs; changes in the availability of skilled labor; the ARLP Partnership's ability to maintain satisfactory relations with its employees; increases in labor costs, including costs of health insurance and taxes resulting from the Affordable Care Act, adverse changes in work rules, or cash payments or projections associated with post-mine reclamation and workers' compensation claims; increases in transportation costs and risk of transportation delays or interruptions; operational interruptions due to geologic, permitting, labor, weather-related or other factors; risks associated with major mine-related accidents, such as mine fires, or interruptions; results of litigation, including claims not yet asserted; difficulty maintaining the ARLP Partnership's surety bonds for mine reclamation as well as workers' compensation and black lung benefits; difficulty in making accurate assumptions and projections regarding post-mine reclamation as well as pension, black lung benefits and other post-retirement benefit liabilities; the coal industry's share of electricity generation, including as a result of environmental concerns related to coal mining and combustion and the cost and perceived benefits of other sources of electricity, such as natural gas, nuclear energy and renewable fuels; uncertainties in estimating and replacing the ARLP Partnership's coal reserves; a loss or reduction of benefits from certain tax deductions and credits; difficulty obtaining commercial property insurance, and risks associated with the ARLP Partnership's participation (excluding any applicable deductible) in the commercial insurance property program; and difficulty in making accurate assumptions and projections regarding future revenues and costs associated with investments in companies the ARLP Partnership does not control.\nAdditional information concerning these and other factors can be found in AHGP's public periodic filings with the Securities and Exchange Commission (\"SEC\"), including AHGP's Annual Report on Form 10-K for the year ended December 31, 2016, filed on February 24, 2017 and AHGP's Quarterly Reports on Form 10-Q for the quarters ended March 31, 2017, June 30, 2017, and September 30, 2017 filed on May 8, 2017, August 4, 2017, and November 6, 2017, respectively, with the SEC. Except as required by applicable securities laws, AHGP does not intend to update its forward-looking statements.\nALLIANCE HOLDINGS GP, L.P. AND SUBSIDIARIES CONDENSED CONSOLIDATED STATEMENTS OF INCOME AND OPERATING DATA (In thousands, except unit and per unit data) (Unaudited) Three Months Ended Year Ended December 31, December 31, 2017 2016 2017 2016 SALES AND OPERATING REVENUES: Coal sales $ 454,946 $ 504,210 $ 1,711,114 $ 1,861,788 Transportation revenues 16,767 10,379 41,700 30,111 Other sales and operating revenues 11,417 12,702 43,027 39,124 Total revenues 483,130 527,291 1,795,841 1,931,023 EXPENSES: Operating expenses (excluding depreciation, depletion and amortization) 298,322 282,431 1,095,167 1,124,848 Transportation expenses 16,767 10,379 41,700 30,111 Outside coal purchases — — — 1,514 General and administrative 16,171 19,912 63,331 75,087 Depreciation, depletion and amortization 74,872 90,773 268,981 336,509 Total operating expenses 406,132 403,495 1,469,179 1,568,069 INCOME FROM OPERATIONS 76,998 123,796 326,662 362,954 Interest expense, net (10,481 ) (7,283 ) (39,385 ) (30,669 ) Interest income 15 3 102 14 Equity investment income 3,446 2,502 13,860 3,543 Cost investment income 3,598 — 6,398 — Debt extinguishment loss — — (8,148 ) — Other income 519 180 2,980 725 INCOME BEFORE INCOME TAXES 74,095 119,198 302,469 336,567 INCOME TAX EXPENSE 214 10 211 14 NET INCOME 73,881 119,188 302,258 336,553 LESS: NET INCOME ATTRIBUTABLE TO NONCONTROLLING INTERESTS (24,609 ) (57,976 ) (116,270 ) (150,619 ) NET INCOME ATTRIBUTABLE TO ALLIANCE HOLDINGS GP, L.P. (\"NET INCOME OF AHGP\") $ 49,272 $ 61,212 $ 185,988 $ 185,934 BASIC AND DILUTED NET INCOME OF AHGP PER LIMITED PARTNER UNIT $ 0.82 $ 1.02 $ 3.11 $ 3.11 DISTRIBUTIONS PAID PER LIMITED PARTNER UNIT $ 0.7350 $ 0.5500 $ 2.5650 $ 2.6100 WEIGHTED AVERAGE NUMBER OF UNITS OUTSTANDING – BASIC AND DILUTED 59,863,000 59,863,000 59,863,000 59,863,000 ALLIANCE HOLDINGS GP, L.P. AND SUBSIDIARIES CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands, except unit data) (Unaudited) December 31, 2017 2016 ASSETS CURRENT ASSETS: Cash and cash equivalents $ 8,643 $ 44,525 Trade receivables 181,671 152,032 Other receivables 146 279 Due from affiliates 25 37 Inventories, net 60,275 61,051 Advance royalties, net 4,510 1,207 Prepaid expenses and other assets 28,192 22,128 Total current assets 283,462 281,259 PROPERTY, PLANT AND EQUIPMENT: Property, plant and equipment, at cost 2,934,188 2,920,988 Less accumulated depreciation, depletion and amortization (1,457,532 ) (1,335,145 ) Total property, plant and equipment, net 1,476,656 1,585,843 OTHER ASSETS: Advance royalties, net 39,660 29,372 Equity investments 147,964 138,817 Cost investments 106,398 — Goodwill 136,399 136,399 Other long-term assets 30,712 25,997 Total other assets 461,133 330,585 TOTAL ASSETS $ 2,221,251 $ 2,197,687 LIABILITIES AND PARTNERS' CAPITAL CURRENT LIABILITIES: Accounts payable $ 97,371 $ 64,460 Due to affiliates 771 906 Accrued taxes other than income taxes 20,366 18,288 Accrued payroll and related expenses 35,801 41,576 Accrued interest 5,005 316 Workers' compensation and pneumoconiosis benefits 10,729 9,897 Current capital lease obligations 28,613 27,196 Other current liabilities 19,071 14,778 Current maturities, long-term debt, net 72,400 149,874 Total current liabilities 290,127 327,291 LONG-TERM LIABILITIES: Long-term debt, excluding current maturities, net 415,937 399,446 Pneumoconiosis benefits 71,875 62,822 Accrued pension benefit 45,317 42,070 Workers' compensation 46,694 40,400 Asset retirement obligations 126,750 125,266 Long-term capital lease obligations 57,091 85,540 Other liabilities 14,587 17,203 Total long-term liabilities 778,251 772,747 Total liabilities 1,068,378 1,100,038 PARTNERS ’ CAPITAL: Alliance Holdings GP, L.P. (\"AHGP\") Partners' Capital: Limited Partners – Common Unitholders 59,863,000 units outstanding 626,831 598,077 Accumulated other comprehensive loss (34,820 ) (16,550 ) Total AHGP Partners' Capital 592,011 581,527 Noncontrolling interests 560,862 516,122 Total Partners’ Capital 1,152,873 1,097,649 TOTAL LIABILITIES AND PARTNERS ’ CAPITAL $ 2,221,251 $ 2,197,687 ALLIANCE HOLDINGS GP, L.P. AND SUBSIDIARIES CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (In thousands) (Unaudited) Year Ended December 31, 2017 2016 CASH FLOWS FROM OPERATING ACTIVITIES: $ 554,082 $ 700,725 CASH FLOWS FROM INVESTING ACTIVITIES: Property, plant and equipment: Capital expenditures (145,088 ) (91,056 ) Increase (decrease) in accounts payable and accrued liabilities 7,404 (4,402 ) Proceeds from sale of property, plant and equipment 2,139 1,165 Contributions to equity investments (20,688 ) (76,797 ) Purchase of cost investment (100,000 ) — Distributions received from investments in excess of cumulative earnings 11,462 3,313 Payment for acquisition of business — (1,011 ) Payment for acquisition of customer contracts — (23,000 ) Net cash used in investing activities (244,771 ) (191,788 ) CASH FLOWS FROM FINANCING ACTIVITIES: Borrowings under securitization facility 100,000 44,600 Payments under securitization facility (127,600 ) (27,700 ) Payments on term loan (50,000 ) (156,250 ) Borrowings under revolving credit facilities 215,486 140,000 Payments under revolving credit facilities (440,486 ) (270,000 ) Borrowings under long-term debt 400,000 — Payment on long-term debt (145,000 ) — Proceeds on capital lease transactions — 33,881 Payments on capital lease obligations (27,071 ) (24,456 ) Payment of debt issuance costs (16,487 ) (101 ) Payment for debt extinguishment (8,148 ) — Contributions to consolidated company from affiliate noncontrolling interest 251 3,014 Net settlement of employee withholding taxes on vesting of ARLP Long-Term Incentive Plan (2,988 ) (1,336 ) Contribution by limited partner - affiliate 1,000 1,000 Distributions paid by consolidated partnership to non-affiliate non-controlling interest and unissued LTIP participants (84,973 ) (89,311 ) Distributions paid to Partners (153,549 ) (156,242 ) Other (5,628 ) (189 ) Net cash used in financing activities (345,193 ) (503,090 ) NET CHANGE IN CASH AND CASH EQUIVALENTS (35,882 ) 5,847 CASH AND CASH EQUIVALENTS AT BEGINNING OF PERIOD 44,525 38,678 CASH AND CASH EQUIVALENTS AT END OF PERIOD $ 8,643 $ 44,525\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005052/en/\nAlliance Holdings GP, L.P.\nBrian L. Cantrell, 918-295-7673\nSource: Alliance Holdings GP, L.P.", "external_links": ["http://www.businesswire.com/news/home/20180129005052/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.arlp.com&esheet=51749614&newsitemid=20180129005052&lan=en-US&anchor=http%3A%2F%2Fwww.arlp.com&index=1&md5=549d61118cb8687396b10bffa9887322", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ahgp.com&esheet=51749614&newsitemid=20180129005052&lan=en-US&anchor=http%3A%2F%2Fwww.ahgp.com&index=2&md5=6a4775d97e3b1cb6841266d8bd6e7d59", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ahgp.com&esheet=51749614&newsitemid=20180129005052&lan=en-US&anchor=http%3A%2F%2Fwww.ahgp.com&index=3&md5=41aeaa806c59a2ce5a9e52d8891bb1ef"], "published": "2018-01-29T15:00:00.000+02:00", "crawled": "2018-01-29T16:53:01.012+02:00", "highlightTitle": ""}