{"organizations": [], "uuid": "fc392973d3338bcd747efa3c46d5f39b853a1048", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 64}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940299-GettyImages-771455719.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/autonomous-flying-vehicles-heres-what-the-future-of-cars-could-be.html", "country": "US", "domain_rank": 767, "title": "Autonomous, flying vehicles? Here's what the future of cars could be", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T12:39:00.000+02:00", "replies_count": 0, "uuid": "fc392973d3338bcd747efa3c46d5f39b853a1048"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/11/autonomous-flying-vehicles-heres-what-the-future-of-cars-could-be.html", "ord_in_thread": 0, "title": "Autonomous, flying vehicles? Here's what the future of cars could be", "locations": [], "entities": {"persons": [{"name": "fred jones", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "From the introduction of power steering and air conditioning to the advent of electric windows and electric vehicles, the automotive industry has long been defined by technology.\nSelf-driving cars represent the next development, and could well be the most disruptive innovation the sector has ever seen. As wild as it sounds, in the near future it could be possible to hail a vertical take-off, flying taxi.\nTechnicians and engineers at German auto giant BMW have been working on driver assistance systems since the 1990s. Five \"levels\" of autonomous driving have been defined. At Level 1, BMW has said that \"driver assistance systems\" would support a driver but not assume control of the vehicle. At the other end of the scale, Level 5, full automation would be achieved with the driver becoming nothing more than a passenger.\nAccording to Fred Jones, head of cities in the U.K. and Ireland at Uber, the ride-sharing company wants to be at the heart of the transition to autonomous driving. \"We made a decision… do we want to be part of that change and shape the introduction of that technology, or do we want to have that change kind of thrust upon us?\"\nUber has already embraced the technology. \"We really wanted to be part of that evolution, and so now if you're in Phoenix, you can push a button and get a self-driving Uber to come and pick you up,\" Jones said. He added that, currently, such vehicles still had an engineer behind the wheel to keep an eye on things. Autonomous trucking was another avenue being investigated, Jones said.\nBMW's Jens Monsees told CNBC that technology would enable its customers to enjoy what he described as \"premium conveniences.\" On a commute to work in an autonomous vehicle, users could undertake a range of activities, he said, from preparing for a Skype call to sleeping.\nWith the technology developing at a rapid pace, future generations of autonomous vehicles will likely continue to push the boundaries of what is achievable. \"We're actually working on bringing autonomous, vertical… take-off electrical flying vehicles that you can summon very much like an UberX,\" Jones said.\nWith a push of a button, a flying vehicle could pick a passenger up and take them to their destination, he said. \"This is something where we're working with a variety of stakeholders… internationally to bring this technology about, including NASA.\"\nUber's goal, he said, was to target the piloting of such a service by 2020 before rolling it out as a \"mainstream service\" in 2023.\nFollow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci"], "published": "2018-01-11T12:39:00.000+02:00", "crawled": "2018-01-11T11:47:29.017+02:00", "highlightTitle": ""}