{"organizations": [], "uuid": "e561e94584b2f637d2a54b9ebf192291d38f34fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 37, "shares": 37, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-italy-accident-train/train-derails-near-milan-at-least-two-dead-tv-citing-emergency-services-idUKKBN1FE0PQ", "country": "US", "domain_rank": 408, "title": "Train derails near Milan, at least two dead - TV citing emergency services", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:37:00.000+02:00", "replies_count": 0, "uuid": "e561e94584b2f637d2a54b9ebf192291d38f34fa"}, "author": "", "url": "https://uk.reuters.com/article/uk-italy-accident-train/train-derails-near-milan-at-least-two-dead-tv-citing-emergency-services-idUKKBN1FE0PQ", "ord_in_thread": 0, "title": "Train derails near Milan, at least two dead - TV citing emergency services", "locations": [], "entities": {"persons": [{"name": "francesca landini", "sentiment": "none"}, {"name": "isla binnie", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "pioltello", "sentiment": "none"}], "organizations": [{"name": "min read  milan", "sentiment": "none"}, {"name": "ferrovie dello stato", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 7:37 AM / Updated an hour ago At least three dead after commuter train derails near Milan Emilio Parodi , Francesca Landini 3 Min Read \nSEGGIANO DI PIOLTELLO, Italy (Reuters) - At least three people were killed and 13 seriously injured on Thursday when a train carrying some 250 people along a busy commuter route derailed near Milan in northern Italy, regional authorities said. \nSeveral carriages of the train operated by Trenord derailed around 7 am (0600 GMT) close to the Pioltello Limito station, some 20 km (13 miles) outside Milan, Italian state-owned rail company Ferrovie dello Stato (FS) said. \n“There currently are three dead, five severely injured and eight injured in ‘code yellow’, all of whom are in hospital,” the body representing the Interior Ministry in Milan said in an emailed statement. \nSearch and rescue efforts ended around 11 am local time and about 100 passengers who suffered minor injuries were given shelter in a nearby gymnasium. \nThe head of Milan police said an investigation had been opened, with railway police interrogating the train driver. \nThe line links Milan and the northern city of Cremona. The accident caused disruption to rail traffic and some trains had to be re-routed. Slideshow (4 Images) \nRFI said it had detected some structural collapse in the track but that it was still unclear whether this was a cause or a consequence of the accident. \n“The rail track collapse was detected 2.3 kilometres before the spot of the accident, just before the Pioltello platform... but it is premature to establish the dynamics of the accident,” RFI regional director Vincenzo Macello told reporters. \nMacello added that maintenance work was regularly carried out on the track and that it was constantly monitored. \nA spokesperson for Trenord said the train had been travelling at a normal speed as it approached the station. Trenord is a joint venture between railway operator FNM ( FNMI.MI ) and Trenitalia, an FS unit. \n“There are precedents... but our (rail) system is among the safest in Europe. What worries us is maintenance, often carried out by subcontractors and not railway staff,” union secretary Adriano Coscia said on SKY TG24 television. \nMilan Mayor Beppe Sala called for more investment in Italy’s infrastructure to improve transport safety. Editing by Gareth Jones", "external_links": [], "published": "2018-01-25T09:37:00.000+02:00", "crawled": "2018-01-25T10:04:31.001+02:00", "highlightTitle": ""}