{"organizations": [], "uuid": "2348b10ce7a512c723af997131e3400734921a4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-astronics-corporation-announces-2017-fourth-quarter-bookings-and-updated-2018-revenue-guidance.html", "country": "US", "domain_rank": 767, "title": "Astronics Corporation Announces 2017 Fourth Quarter Bookings and Updated 2018 Revenue Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T00:15:00.000+02:00", "replies_count": 0, "uuid": "2348b10ce7a512c723af997131e3400734921a4a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-astronics-corporation-announces-2017-fourth-quarter-bookings-and-updated-2018-revenue-guidance.html", "ord_in_thread": 0, "title": "Astronics Corporation Announces 2017 Fourth Quarter Bookings and Updated 2018 Revenue Guidance", "locations": [], "entities": {"persons": [{"name": "astronics", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}], "organizations": [{"name": "astronics corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "company’s aerospace", "sentiment": "none"}, {"name": "telefonix pdt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expects 2018 revenue of $745 million to $815 million\nExpects to record non-cash impairment charge of approximately $16 million in fourth quarter of 2017\nEAST AURORA, N.Y.--(BUSINESS WIRE)-- Astronics Corporation (NASDAQ:ATRO), a leading provider of advanced technologies for the global aerospace, defense and semiconductor industries, announced today updated expectations for 2017 year-end results and revenue guidance for 2018.\nAstronics announced that bookings for the 2017 fourth quarter were approximately $229 million. The Company’s Aerospace segment contributed $171 million in orders, which included $17 million in orders related to the December 1, 2017 acquisition of Telefonix PDT. The Test segment had $58 million in bookings, which included $56 million for semiconductor test equipment.\nThe Company updated its 2018 consolidated revenue guidance to $745 million to $815 million. The Aerospace segment is expected to have a revenue range of $630 million to $680 million including Telefonix PDT. The Test segment is expected to have revenue of $115 million to $135 million.\nThe Company also announced that it expects to record a non-cash goodwill impairment charge against the goodwill associated with Armstrong Aerospace of approximately $16 million in the 2017 fourth quarter.\nPeter J. Gundermann, President and Chief Executive Officer of Astronics Corporation, commented, “We are disappointed with the goodwill situation at Armstrong, but we believe the combination of that business with Telefonix will perform well in the future. At the same time, we believe we have very strong momentum as we enter 2018. Our strong bookings in the second half of 2017 sets the stage for a very exciting year.”\nThe Company expects to release its fourth quarter and full year 2017 financial results in late February 2018.\nABOUT ASTRONICS CORPORATION\nAstronics Corporation (NASDAQ:ATRO) serves the world’s aerospace, defense and semiconductor industries with proven, innovative technology solutions. Astronics works side-by-side with customers, integrating its array of power, connectivity, lighting, structure, test and additional technologies to solve complex challenges. For nearly 50 years, Astronics has delivered creative, customer-focused solutions with exceptional responsiveness. Today, global airframe manufacturers, airlines, military branches, completion centers and Fortune 500 manufacturing organizations rely on the collaborative spirit and innovation of Astronics.\nFor more information on Astronics and its solutions, visit Astronics.com .\nSafe Harbor Statement\nThis news release contains forward-looking statements as defined by the Securities Exchange Act of 1934. One can identify these forward-looking statements by the use of the words “expect,” “anticipate,” “plan,” “may,” “will,” “estimate” or other similar expressions. Because such statements apply to future events, they are subject to risks and uncertainties that could cause actual results to differ materially from those contemplated by the statements. Important factors that could cause actual results to differ materially include the progress of customer fleet upgrade programs, the state of the aerospace and defense industries, the market acceptance of newly developed products, internal production capabilities, the timing of orders received, the status of customer certification processes, the demand for and market acceptance of new or existing aircraft which contain the Company’s products, customer preferences, and other factors which are described in filings by Astronics with the Securities and Exchange Commission. The Company assumes no obligation to update forward-looking information in this news release whether to reflect changed assumptions, the occurrence of unanticipated events or changes in future operating results, financial conditions or prospects, or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006127/en/\nCompany\nAstronics Corporation\nDavid Burney, 716-805-1599 x 159\nCFO\ndavid.burney@astronics.com\nor\nMedia Relations\nAstronics Corporation\nMichelle Manson, 425-463-6603\nCorporate Marketing\npress@astronics.com\nor\nInvestors\nKei Advisors LLC\nDeborah K. Pawlowski, 716-843-3908\ndpawlowski@keiadvisors.com\nSource: Astronics Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Astronics.com&esheet=51742197&newsitemid=20180111006127&lan=en-US&anchor=Astronics.com&index=1&md5=4fc091d044eccccbba73774fd608fd7b", "http://www.businesswire.com/news/home/20180111006127/en/"], "published": "2018-01-12T00:15:00.000+02:00", "crawled": "2018-01-12T01:56:50.003+02:00", "highlightTitle": ""}