{"organizations": [], "uuid": "4785a78df17f11c2e3277cd3e0d43e8b57594e64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/18/reuters-america-trump-move-on-healthcare-religious-freedom-prompts-discrimination-fears.html", "country": "US", "domain_rank": 767, "title": "Trump move on healthcare religious freedom prompts discrimination fears", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:03:00.000+02:00", "replies_count": 0, "uuid": "4785a78df17f11c2e3277cd3e0d43e8b57594e64"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-trump-move-on-healthcare-religious-freedom-prompts-discrimination-fears.html", "ord_in_thread": 0, "title": "Trump move on healthcare religious freedom prompts discrimination fears", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "blumstein", "sentiment": "none"}, {"name": "james blumstein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "tennessee", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "office of civil rights", "sentiment": "none"}, {"name": "religious freedom division", "sentiment": "none"}, {"name": "vanderbilt law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 18 (Reuters) - The Trump administration's move on Thursday to protect healthcare workers who refuse to perform abortions and other medical procedures on religious or moral grounds is raising fears among some civil rights and medical groups that it will provide legal cover for otherwise unlawful discrimination.\nThe U.S. Department of Health and Human Services created a new Conscience and Religious Freedom Division within its Office of Civil Rights to enforce the rights of doctors, nurses and others who invoke such objections.\nJames Blumstein, a professor at Vanderbilt Law School in Tennessee, said the administration's plan could remedy what he described as years of overreach by the federal government fighting discrimination against patients at the expense of the religious freedom of healthcare professionals.\n\"I think there has been an insensitivity on the secular side,\" Blumstein said.\nCritics of the move predicted the new division, whose creation was praised by conservative Christian advocacy groups that have strongly supported Republican President Donald Trump, would become embroiled in current litigation over whether healthcare workers can deny care to women seeking abortions or birth control as well as gay and transgender patients.\n\"We may not know exactly what this new division will look like in practice, but we do know that this means they prioritize religious liberty over women, transgender people and others,\" said Louise Melling, the American Civil Liberties Union's deputy legal director.\nExisting federal and state laws protect healthcare workers who express religious objections to performing abortions and certain other procedures. HHS said the new division would focus on enforcing those laws.\nCritics said the division's creation could encourage a broader range of religious objections, with a potentially strong impact on less-settled areas of the law like the status of gay and transgender individuals under anti-discrimination statutes.\nThe Supreme Court has put some limits on what constitutes a valid religious objection, saying the law does not protect \"personal philosophical choices.\"\nDENIAL OF ACCESS\nJack Ende, president of the American College of Physicians, said the second-largest U.S. doctors group \"would be particularly concerned if the new HHS division takes any actions that would result in denial of access to appropriate healthcare based on gender, gender identity, sexual orientation, race, ethnicity or other personal characteristics.\"\nFederal law restricts the ability of doctors and hospitals to turn away people seeking emergency care. But healthcare providers who accept federal funds through programs like Medicare otherwise have broad latitude to refuse patients, provided they are not doing so on a discriminatory basis.\nWhile discrimination based on race, religion and sex are barred under federal law, recent court battles have focused on whether sexual orientation and gender identity are similarly protected. Trump's Justice Department has said sexual orientation is not a protected category.\nUnder Democratic former President Barack Obama, HHS adopted a regulation that prohibited healthcare professionals from discriminating on the basis of gender identity. A federal judge in Texas last year blocked that regulation, saying it would require doctors to carry out gender-reassignment surgeries in violation of deeply held religious beliefs.\nSome of the leading hospital chains are Catholic. The Catholic Health Association of the United States said one in six patients in the country is treated in a Catholic hospital.\nLambda Legal, an advocacy group for lesbian, gay, bisexual and transgender people, already represents several transgender patients, including a New Jersey transgender man suing a Catholic hospital for allegedly denying a procedure related to his gender reassignment on religious grounds. Camilla Taylor, the organization's acting legal director, said Lambda Legal is prepared to continue to bring such challenges.\nRobin Wilson, a professor at University of Illinois College of Law, said she thought the Trump administration was indicating it will side with those doctors or hospitals who refuse to perform gender-reassignment surgery.\nReligious objectors were encouraged by a 2014 Supreme Court decision that a federal requirement that family-owned companies pay for insurance coverage for women's birth control violated a federal statute protecting religious freedom.\n\"Conscience protections for health professionals and religious institutions, particularly in the abortion context, are long-standing and deeply rooted,\" said Richard Garnett, a professor at Notre Dame Law School in Indiana.\n\"To me, there should be nothing particularly surprising or troubling about an administration, this one or any other, deciding that the Civil Rights Division should allocate resources to make those protections meaningful,\" Garnett added.\n(Reporting by Brendan Pierson and Jan Wolfe; Additional reporting by Andrew Chung in New York and Julie Steenhuysen in Chicago; Writing by Anthony Lin and Will Dunham)", "external_links": [], "published": "2018-01-19T02:03:00.000+02:00", "crawled": "2018-01-19T03:20:03.014+02:00", "highlightTitle": ""}