{"organizations": [], "uuid": "6e756c748cbbb3951fbe3badf6322a88b803fa60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sasser-family-holdings-names-kelly-pronek-as-vice-president-of-corporate-communications-and-marketing.html", "country": "US", "domain_rank": 767, "title": "Sasser Family Holdings Names Kelly Pronek as Vice President of Corporate Communications and Marketing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "6e756c748cbbb3951fbe3badf6322a88b803fa60"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-sasser-family-holdings-names-kelly-pronek-as-vice-president-of-corporate-communications-and-marketing.html", "ord_in_thread": 0, "title": "Sasser Family Holdings Names Kelly Pronek as Vice President of Corporate Communications and Marketing", "locations": [], "entities": {"persons": [{"name": "kelly pronek", "sentiment": "negative"}, {"name": "jeff walsh", "sentiment": "none"}, {"name": "sasser", "sentiment": "none"}, {"name": "pronek", "sentiment": "none"}], "locations": [{"name": "schaumburg", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "schaumburg", "sentiment": "none"}], "organizations": [{"name": "sasser family holdings", "sentiment": "negative"}, {"name": "corporate communications", "sentiment": "negative"}, {"name": "sasser family holdings, inc.", "sentiment": "neutral"}, {"name": "sfh", "sentiment": "none"}, {"name": "corporate communications and marketing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCHAUMBURG, Ill., Jan. 17, 2018 /PRNewswire/ -- Sasser Family Holdings, Inc. (SFH), a fourth-generation family-held transportation asset services and management company based in Schaumburg, Ill., today announced that Kelly Pronek has been promoted to vice president of Corporate Communications and Marketing. Pronek, formerly senior director, will have expanded leadership responsibility for the company's Corporate Communications and Marketing practice, SFH's brand strategy development for the company's subsidiary businesses. She will also continue to play a critical role in the implementations of Sasser's organizational narrative, helping to lead the building, enhancement, and measurement of our brands and culture within the Sasser family of businesses. She will report to CEO Jeff Walsh.\n\"Being a part of the leadership team for a company that is intentional in creating a culture that empowers its employees to succeed is extremely gratifying because corporate communications and marketing really lies at the heart of that. As a family-owned business that's focused on long-term success, we are able to be thoughtful in creating a compelling value proposition while never wavering from our values of uncompromising integrity, remarkable customer service, high-performing teams, and relentless improvement. I began my Sasser career at Union Leasing over a decade ago and joined the holding company when it was established in 2011, so I have a ground-up perspective on how to keep our employees engaged and motivated to put our customers first. I am excited about the opportunity to continue developing and implementing strategies that position our entire family of businesses for success well into the future,\" Pronek said.\nPronek founded Change For The Better, the company's philanthropic initiative, in 2012, and is active on both the associate board for Avenues to Independence, and the executive women's council for the Northern Illinois Food Bank—two of the company's core charities. Pronek also does pro bono work to help not-for-profit organizations such as the University of Chicago STEM (Science, Technology, Engineering, and Mathematics) Education build their brand profiles. In addition to her responsibilities as vice president and dedication to volunteerism, Kelly is a student in The University of Chicago Booth School of Business MBA program.\n\"Kelly has been integral to helping create our opportunity-based culture and identify our strategic objectives, and having her as part of our executive leadership team only strengthens our ability to manage our businesses for success now and into the future. Having worked with Kelly for the past several years, I realize how fortunate we are to be able to have someone with her talent, strategic mindset, and drive to our team. I know that she will continue to be an asset to Sasser and I congratulate her on a well-deserved promotion,\" said CEO Jeff Walsh.\nPronek will begin her new role effective immediately.\nAbout Sasser Family Holdings, Inc.:\nSasser Family Holdings is a fourth-generation, family-held transportation asset services and management company with roots dating to 1928. Its other subsidiary business units include Chicago Freight Car Leasing Co., Union Leasing Inc., CF Rail Services LLC, CF Asia Pacific Group PTY Ltd, Xcēd Aviation Services, and NxGen Rail Services LLC. The subsidiary units are leaders in providing commercial and industrial focused rail, vehicle and aviation transportation equipment solutions including asset leasing, fleet administration management, asset repair and maintenance, and innovative technology services throughout North America, and Australia. about Sasser Family Holdings, visit www.sfhsinc.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/sasser-family-holdings-names-kelly-pronek-as-vice-president-of-corporate-communications-and-marketing-300583614.html\nSOURCE Sasser Family Holdings, Inc.", "external_links": ["http://www.sfhsinc.com/", "http://www.prnewswire.com/news-releases/sasser-family-holdings-names-kelly-pronek-as-vice-president-of-corporate-communications-and-marketing-300583614.html"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:00:21.009+02:00", "highlightTitle": ""}