{"organizations": [], "uuid": "1776626e94765d27502c1d48954f00c765197e43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fca-us-announces-2017-profit-sharing-payment-for-u-s-hourly-employees.html", "country": "US", "domain_rank": 767, "title": "FCA US Announces 2017 Profit Sharing Payment for U.S. Hourly Employees", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:15:00.000+02:00", "replies_count": 0, "uuid": "1776626e94765d27502c1d48954f00c765197e43"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-fca-us-announces-2017-profit-sharing-payment-for-u-s-hourly-employees.html", "ord_in_thread": 0, "title": "FCA US Announces 2017 Profit Sharing Payment for U.S. Hourly Employees", "locations": [], "entities": {"persons": [], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fca us announces 2017 profit sharing payment for u.s. hourly employees auburn", "sentiment": "negative"}, {"name": "fca n.v.", "sentiment": "none"}, {"name": "fca us llc", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUBURN HILLS, Mich., Jan. 25, 2018 /PRNewswire/ --\nPayment recognizes hourly employees' key role in meeting Company objectives Profit sharing paid in addition to $2,000 special bonus payment for U.S. workforce related to tax reform Industrialization plan underway to expand Jeep ® and Ram brands Total U.S. investment grows to more than $10 billion since 2009, with over 25,000 jobs created to date\nAs a result of the Company's strong 2017 financial performance, FCA US LLC announced today that it will make average profit sharing payments of $5,500 to eligible UAW-represented employees. Approximately 40,000 employees will receive the payment on Feb. 16, 2018.\nWith this payment, FCA US hourly employees have received on average more than $23,000 in profit sharing since 2009.\nAs negotiated in the 2015 FCA US LLC-UAW Collective Bargaining Agreement, the 2017 profit sharing payment is based on the adjusted EBIT margin performance of the North American region reported in the FCA N.V. financial results and on individual compensated hours.\nFCA Commits to Growing U.S. Manufacturing Operations\nSince 2009, FCA has invested $10 billion and added more than 25,000 new jobs in its U.S. manufacturing operations. In 2017, FCA US launched the Jeep Cherokee and the Jeep Wrangler in their new production locations, completing the first two actions of an industrialization plan designed to realign U.S. manufacturing capacity to expand the Jeep ® and Ram brands.\nProduction of the Jeep Cherokee moved from the north plant of the Toledo Assembly Complex (Ohio), to the Belvidere, Illinois, Assembly Plant in June, following a $350 million transformation. More than 300 new jobs were added to support Cherokee production, which began in June.\nWith the Cherokee's move, the Toledo North plant embarked on a $700 million overhaul to produce the next generation Jeep Wrangler. Production began in December with the addition of more than 700 new jobs.\nThe all-new Ram 1500 will begin production at the Sterling Heights Assembly Plant in the first quarter of 2018 after moving from the nearby Warren Truck Assembly Plant. Nearly $1.5 billion was invested to convert the suburban Detroit facility from unibody to body-on-frame production. The plant will add 700 new jobs.\nThe Company has also committed to spending a total of $2 billion and adding 4,500 new jobs in the Warren Truck Assembly Plant and the south plant of the Toledo Assembly Complex. Warren Truck will be modernized to produce the Jeep Wagoneer and Grand Wagoneer alongside the Ram Heavy Duty, which will move from its current production location in Saltillo, Mexico. The Toledo South plant will be retooled to build the all-new Jeep truck. All of these actions are expected to be complete by 2020.\nSpecial Bonus Payment for FCA U.S. Employees\nIn addition to profit sharing, UAW-represented employees will receive a special $2,000 bonus payment in the second quarter. Announced on January 11, 2018, FCA will make the special bonus payment to approximately 60,000 hourly and salaried employees, excluding senior leadership, of FCA automotive and component operations in the U.S. because of U.S. tax reform legislation.\nAbout FCA US LLC\nFCA US LLC is a North American automaker based in Auburn Hills, Michigan. It designs, manufactures, and sells or distributes vehicles under the Chrysler, Dodge, Jeep®, Ram, FIAT and Alfa Romeo brands, as well as the SRT performance designation. The Company also distributes Mopar and Alfa Romeo parts and accessories. FCA US is building upon the historic foundations of Chrysler Corp., established in 1925 by industry visionary Walter P. Chrysler and Fabbrica Italiana Automobili Torino (F.I.A.T.), founded in Italy in 1899 by pioneering entrepreneurs, including Giovanni Agnelli. FCA US is a member of the Fiat Chrysler Automobiles N.V. (FCA) family of companies. (NYSE: FCAU/ MTA: FCA).\nFCA, the seventh-largest automaker in the world based on total annual vehicle sales, is an international automotive group. FCA is listed on the New York Stock Exchange under the symbol \"FCAU\" and on the Mercato Telematico Azionario under the symbol \"FCA.\"\nFollow FCA US news and video on:\nCompany blog: blog.fcanorthamerica.com\nCompany website: www.fcanorthamerica.com\nFacebook: https://www.facebook.com/FiatChrysler.NorthAmerica/\nInstagram: www.instagram.com/FiatChrysler_NA\nTwitter: www.twitter.com/FiatChrysler_NA\nTwitter (Spanish): www.twitter.com/fcausespanol\nYouTube: www.youtube.com/fcanorthamerica\nMedia website: media.fcanorthamerica.com\nView original content: http://www.prnewswire.com/news-releases/fca-us-announces-2017-profit-sharing-payment-for-us-hourly-employees-300588146.html\nSOURCE FCA US LLC", "external_links": ["http://media.fcanorthamerica.com/", "http://blog.fcanorthamerica.com/", "http://www.fcanorthamerica.com/", "http://www.twitter.com/FiatChrysler_NA", "https://www.facebook.com/FiatChrysler.NorthAmerica/", "http://www.instagram.com/FiatChrysler_NA", "http://www.prnewswire.com/news-releases/fca-us-announces-2017-profit-sharing-payment-for-us-hourly-employees-300588146.html", "https://twitter.com/fcausespanol", "http://www.youtube.com/fcanorthamerica"], "published": "2018-01-25T15:15:00.000+02:00", "crawled": "2018-01-25T16:58:52.009+02:00", "highlightTitle": ""}