{"organizations": [], "uuid": "7d34fea0e2bfae136e93e563af84e2602a0a275b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/08/104829360-RTS1J029.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/david-roche-on-north-korea-nuclear-threat-almost-inevitable-cold-war-between-us-and-china.html", "country": "US", "domain_rank": 767, "title": "David Roche on North Korea nuclear threat: 'Almost inevitable cold war' between US and China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.997, "site_type": "news", "published": "2018-01-02T06:28:00.000+02:00", "replies_count": 0, "uuid": "7d34fea0e2bfae136e93e563af84e2602a0a275b"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/01/david-roche-on-north-korea-nuclear-threat-almost-inevitable-cold-war-between-us-and-china.html", "ord_in_thread": 0, "title": "David Roche on North Korea nuclear threat: 'Almost inevitable cold war' between US and China", "locations": [], "entities": {"persons": [{"name": "david roche", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "roche", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "jonathan ernst | reute", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "independent strategy", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "16 Hours Ago | 04:07 \nNorth Korea called itself a nuclear power on Monday, but the question now is whether U.S. President Donald Trump recognizes the rogue regime as one, a strategist told CNBC Tuesday. \nThat's an important development to watch as actions taken by Trump against North Korea will likely result in a cold war between the U.S. and China , said David Roche, president and global strategist at Independent Strategy. Such a turn of events between the two major powers would have global implications, he added, pointing to how it would affect worldwide trade and investment. \nOutlining the two likely scenarios that could play out, Roche said the U.S. may try to contain North Korea by having \"rings of missiles throughout the Asia Pacific region pointing at Pyongyang\" or it could try to remove the hermit nation's leader Kim Jong Un through an attack. \nBoth those scenarios undermine China's influence — they would remove a key strategic ally from Beijing's foreign policy plan — and would lead to an \"almost inevitable cold war\" between China and the U.S., he said. Jonathan Ernst | Reuters President Donald Trump and China's President Xi Jinping leave after an opera performance at the Forbidden City in Beijing, China, November 8, 2017. \n\"One of these two outcomes is pretty likely so what comes out of that is all sorts of things: trade complications, cold wars et cetera. And that, I think, would be a major geopolitical forecast I would make for this year,\" said Roche. \nKim declared North Korea \"a peace-loving and responsible nuclear power\" in his annual New Year's Day address on Monday, Reuters reported. The leader also said the U.S. should be aware that his country's nuclear forces are now a reality, not a threat, but claimed that he was \"open to dialogue\" with the South. \nPyongyang's testing of its nuclear weapons escalated tensions throughout 2017 and brewed fiery rhetoric between Trump and Kim. But other than some knee-jerk reactions, financial markets mostly shrugged off those developments. \nRoche said it is hard to predict how Trump will react to Kim's latest declaration, but any actions by the U.S. will hit equities more than other asset classes. \n\"The major casualty out of this would be equities because equities are now based upon such optimism that any really negative impact will affect the most high-flown asset,\" he said.", "external_links": [], "published": "2018-01-02T06:28:00.000+02:00", "crawled": "2018-01-02T06:29:01.019+02:00", "highlightTitle": ""}