{"organizations": [], "uuid": "6952a286831c9f063c32cae1d15cb8775edd3aa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-pembina-pipeline-corporation-declares-common-share-dividend-for-january-and-quarterly-preferred-share-dividends.html", "country": "US", "domain_rank": 767, "title": "Pembina Pipeline Corporation Declares Common Share Dividend for January and Quarterly Preferred Share Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T03:47:00.000+02:00", "replies_count": 0, "uuid": "6952a286831c9f063c32cae1d15cb8775edd3aa1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-pembina-pipeline-corporation-declares-common-share-dividend-for-january-and-quarterly-preferred-share-dividends.html", "ord_in_thread": 0, "title": "Pembina Pipeline Corporation Declares Common Share Dividend for January and Quarterly Preferred Share Dividends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Jan. 8, 2018 /PRNewswire/ - Pembina Pipeline Corporation (\"Pembina\" or the \"Company\") (TSX: PPL; NYSE: PBA) announced today that its Board of Directors declared a common share cash dividend for January 2018 of $0.18 per share to be paid, subject to applicable law, on February 15, 2018 to shareholders of record on January 25, 2018.\nFor shareholders receiving their common share dividends in U.S. funds, the January 2018 cash dividend is expected to be approximately U.S. $0.1451 per share (before deduction of any applicable Canadian withholding tax) based on a currency exchange rate of 0.8063. The actual U.S. dollar dividend will depend on the Canadian/U.S. dollar exchange rate on the payment date and will be subject to applicable withholding taxes.\nPembina's Board of Directors also declared quarterly dividends for the Company's preferred shares, Series 1, 3, 5, 7, 9, 11, 13, 15, 17 and 19 and expects to declare a dividend on the preferred shares, Series 21. Series 1, 3, 5, 7, 9, 11, 13 and 21 preferred share dividends are payable on March 1, 2018 to shareholders of record on February 1, 2018. Series 15, 17 and 19 preferred share dividends are payable on March 31, 2018 to shareholders of record on March 15, 2018.\nSeries\nDividend Amount\nPreferred Shares, Series 1 (PPL.PR.A)\n$0.265625\nPreferred Shares, Series 3 (PPL.PR.C)\n$0.293750\nPreferred Shares, Series 5 (PPL.PR.E)\n$0.312500\nPreferred Shares, Series 7 (PPL.PR.G)\n$0.281250\nPreferred Shares, Series 9 (PPL.PR.I)\n$0.296875\nPreferred Shares, Series 11 (PPL.PR.K)\n$0.359375\nPreferred Shares, Series 13 (PPL.PR.M)\n$0.359375\nPreferred Shares, Series 15 (PPL.PR.O)\n$0.279000\nPreferred Shares, Series 17 (PPL.PR.Q)\n$0.312500\nPreferred Shares, Series 19 (PPL.PR.S)\n$0.312500\nPreferred Shares, Series 21 (PPL.PF.A)\n$0.281900\nThese dividends are designated \"eligible dividends\" for Canadian income tax purposes. For non-resident shareholders, Pembina's common share dividends should be considered \"qualified dividends\" and may be subject to Canadian withholding tax.\nDividends on the preferred shares Series 1, 3, 5, 7, 9, 11, 13 and 21 are payable on the first day of March, June, September and December in each year, if, as and when declared by the Board of Directors to shareholders of record on the first day of the preceding month, or, if such payment or record date is not a business day, the last preceding business day prior to the weekend or holiday. Dividends on the preferred shares Series 15, 17 and 19 are payable on the last day of March, June, September and December in each year, if, as and when declared by the Board of Directors to shareholders of record on the fifteenth day of the same month, or, if such payment or record date is not a business day, the next succeeding business day after the weekend or holiday.\nAbout Pembina\nCalgary-based Pembina Pipeline Corporation is a leading transportation and midstream service provider that has been serving North America's energy industry for over 60 years. Pembina owns and operates an integrated system of pipelines that transport various products derived from natural gas and hydrocarbon liquids produced primarily in western Canada. The Company also owns and operates gas gathering and processing facilities and an oil and natural gas liquids infrastructure and logistics business. Pembina's integrated assets and commercial operations along the majority of the hydrocarbon value chain allow it to offer a full spectrum of midstream and marketing services to the energy sector. Pembina is committed to working with its community and aboriginal neighbours, while providing value for investors in a safe, environmentally responsible manner. This balanced approach to operating ensures the trust Pembina builds among all of its stakeholders is sustainable over the long-term. Pembina's common shares trade on the Toronto and New York stock exchanges under PPL and PBA, respectively. For more information, visit www.pembina.com .\nForward-Looking Information and Statements\nThis news release contains certain forward-looking information and statements that are based on Pembina's current expectations, estimates, projections and assumptions in light of its experience and its perception of historical trends. In this news release, such forward-looking information and statements can be identified by terminology such as \"should\", \"may\", \"will\", \"continue\", \"if\", \"to be\", \"expects\", and similar expressions.\nIn particular, this news release contains forward-looking statements and information relating to: future dividends which may be declared on Pembina's preferred shares, the dividend payment and the tax treatment thereof. These forward-looking statements are being made by Pembina based on certain assumptions that Pembina has made in respect thereof as at the date of this news release, regarding, among other things: oil and gas industry exploration and development activity levels; the success of Pembina's operations, growth projects and the integration of acquisitions; prevailing commodity prices, margins, volumes and exchange rates; that Pembina's future results of operations will be consistent with past performance and management expectations in relation thereto; the continued availability of capital at attractive prices to fund future capital requirements relating to existing assets and projects, including but not limited to future capital expenditures relating to expansion, upgrades and maintenance shutdowns; the success of growth projects; future operating costs; that any third party projects relating to Pembina's growth projects will be sanctioned and completed as expected; that any required commercial agreements can be reached; that all required regulatory and environmental approvals can be obtained on the necessary terms in a timely manner; that counterparties to material agreements will continue to perform in a timely manner; that there are no unforeseen events preventing the performance of contracts; and that there are no unforeseen material construction, integrity or other costs related to current growth projects or current operations. These forward-looking statements are not guarantees of future performance and are subject to a number of known and unknown risks and uncertainties, including, but not limited to: the regulatory environment and decisions; non-performance of agreements in accordance with their terms; the impact of competitive entities and pricing; reliance on key industry partners, alliances and agreements; the strength and operations of the oil and natural gas production industry and related commodity prices; the continuation or completion of third-party projects; actions by governmental or regulatory authorities including changes in tax laws and treatment, changes in royalty rates or increased environmental regulation; adverse general economic and market conditions in Canada, North America and elsewhere; fluctuations in operating results; construction delays; labour and material shortages; and certain other risks detailed from time to time in Pembina's public disclosure documents including, among other things, those detailed under the heading \"Risk Factors\" in Pembina's management's discussion and analysis and annual information form for the year ended", "external_links": ["http://www.pembina.com/"], "published": "2018-01-09T03:47:00.000+02:00", "crawled": "2018-01-09T09:41:25.947+02:00", "highlightTitle": ""}