{"organizations": [], "uuid": "f1bdcdd4bceab268119cc2967115fbccc15dc1e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220330691&w=1200&r=LYNXMPEE0719T", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-fiatchrysler-stocks/fiat-chrysler-boosted-by-jeep-growth-expectations-idUSKBN1EX20W", "country": "US", "domain_rank": 408, "title": "Fiat Chrysler boosted by Jeep growth expectations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:20:00.000+02:00", "replies_count": 0, "uuid": "f1bdcdd4bceab268119cc2967115fbccc15dc1e3"}, "author": "", "url": "https://www.reuters.com/article/us-fiatchrysler-stocks/fiat-chrysler-boosted-by-jeep-growth-expectations-idUSKBN1EX20W", "ord_in_thread": 0, "title": "Fiat Chrysler boosted by Jeep growth expectations", "locations": [], "entities": {"persons": [{"name": "agni", "sentiment": "negative"}, {"name": "alfa romeos", "sentiment": "none"}, {"name": "marchionne", "sentiment": "none"}, {"name": "sergio marchionne", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fiat chrysler", "sentiment": "negative"}, {"name": "min read  milan", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:29 PM / in 23 minutes Fiat Chrysler boosted by Jeep growth expectations Agnieszka Flak 4 Min Read \nMILAN (Reuters) - Fiat Chrysler ( FCHA.MI )(FCA) shares hit a record high on Monday on growing expectations that the carmaker’s coveted Jeep brand will unlock even greater value this year. \nThe stock jumped more than 20 percent last week on a bullish outlook for the auto sector and media speculation that Chief Executive Sergio Marchionne’s final year at the helm could prompt strategic deals such as spin-offs, technology alliances and disposals. \nThat investor optimism gathered momentum on Monday, with the share price gaining another 3 percent after Morgan Stanley ( MS.N ) analysts said that Jeep -- one of the main pillars of Marchionne’s turnaround plan and a key profit driver for the group -- could make big strides this year as a global brand. \nThe Italian-American carmaker declined to comment. \nJeep is one of several brands in an FCA portfolio that also includes luxury Maseratis, sporty Alfa Romeos and mass-market Fiats. \nBut it is the Jeep sport utility vehicles (SUVs) that Marchionne sees creating a high-margin brand with global appeal. \n“2018 will feature a number of operational and financial milestones that can accelerate investor appreciation of the commercial power of the Jeep brand in a way that can potentially drive very positive share price movements,” Morgan Stanley analysts said in their report. \nThe U.S. broker estimates that Jeep could make up nearly 70 percent of the company’s profit this year. \nFCA has been retooling some U.S. factories to boost output of SUVs and trucks while ending production of some sedans to boost profitability in North America, its biggest market. AMBITIOUS TARGETS \nThe move is slowly paying off and has put FCA on track to reach its ambitious 2018 profit targets, including erasing all debt and generating up to 5 billion euros ($5.99 billion) in net cash by the end of this year. \nFCA unveiled a new Jeep Wrangler in November and a new Jeep Cherokee will enter production this quarter. \nThe popularity of the Jeep brand, which is targeting sales of 2 million vehicles this year, has prompted talk that it could be spun-off from the group, like tractor maker CNH Industrial ( CNHI.MI ) and supercar business Ferrari ( RACE.MI ), or sold off. \nFCA is already planning to separate two of its three components businesses -- Magneti Marelli and Comau -- to simplify its portfolio in a move some analysts said could help to push the shares further into the mid-to-high 20 euro range. \nBut while Marchionne acknowledged last year that Jeep and truck brand RAM could stand on their own, he has never said he was considering spinning them off and has repeatedly warned that he has to worry about the “stump that’s left behind” if he parts ways with FCA’s most profitable parts. \nFCA has been the subject of merger speculation, especially after its unsuccessful 2015 attempt to tie up with larger U.S. rival GM ( GM.N ). \nIts share price jumped to record highs in August after reports of interest from China’s Great Wall Motor Co ( 601633.SS ) and South Korea’s Hyundai ( 005380.KS ). \nBut besides potential mergers, a stable pricing environment, solid volume growth and the recently announced U.S. corporate tax reform could underpin auto stocks such as FCA this year, J.P. Morgan said last week. \nFCA’s Milan-listed shares closed up 1 percent on Monday at 18.11 euros, having touched an intraday peak of 18.48 euros. Reporting by Agnieszka Flak; Editing by David Goodman", "external_links": [], "published": "2018-01-08T20:20:00.000+02:00", "crawled": "2018-01-08T20:31:46.000+02:00", "highlightTitle": ""}