{"organizations": [], "uuid": "38291d05c8f51e8c6d02df083488c6c68bcb812a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226490546&w=1200&r=LYNXMPEE0T06Q", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-cambodia-australia-filmmaker/australian-filmmaker-denied-bail-in-cambodia-over-espionage-idUSKBN1FJ0FH", "country": "US", "domain_rank": 408, "title": "Australian filmmaker denied bail in Cambodia over espionage", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:37:00.000+02:00", "replies_count": 0, "uuid": "38291d05c8f51e8c6d02df083488c6c68bcb812a"}, "author": "", "url": "https://www.reuters.com/article/us-cambodia-australia-filmmaker/australian-filmmaker-denied-bail-in-cambodia-over-espionage-idUSKBN1FJ0FH", "ord_in_thread": 0, "title": "Australian filmmaker denied bail in Cambodia over espionage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 4:39 AM / in 2 minutes Australian filmmaker denied bail in Cambodia over espionage Prak Chan Thul 2 Min Read \nPHNOM PENH (Reuters) - Cambodia’s top court on Tuesday denied bail to an Australian filmmaker who has spent seven months behind bars accused of espionage and who faces 10 years in jail if he is convicted. \nJames Ricketson, 69, was arrested last June after he was photographed flying a drone above a political rally organised by the now-dissolved opposition Cambodia National Rescue Party (CNRP). \n“A judge is still investigating this case so the continuation of detention is necessary,” Supreme Court Judge Soeng Panhavuth told a court on Tuesday. \nRicketson was not in court to hear the decision. A clerk said a prison van transporting Ricketson to the court was late so the judge made the announcement before his arrival. \nIt remains unclear who Ricketson is accused of spying for. \nHis arrest comes amid a wider crackdown on freedom of expression by the government of Prime Minister Hun Sen, who has ruled for 32 years. \nRicketson’s family said they were “very disappointed” by the court’s decision. \n“They are very very disappointed by the outcome of today’s proceedings and in particular that the verdict, the denial of bail, was handed down in absentia,” his daughter-in-law Alexandra Kennett told reporters outside the court. \nKennett said Ricketson, who was close to Sam Rainsy, a former leader of the CNRP, was suffering in an overcrowded prison. \n“He’s suffering. He’s an Australian man in a tropical climate in an incredibly cramped condition with 140 other people in his cell,” Kennett said. \nAustralia’s Department of Foreign Affairs and Trade said that it was providing consular assistance to Ricketson. \nThe CNRP was dissolved last year at the request of Hun Sen’s government after the arrest of party leader Kem Sokha, who was accused of plotting to take power with American help - charges he says were politically motivated. Reporting by Prak Chan Thul; Editing by Amy Sawitta lefevre and Michael Perry", "external_links": [], "published": "2018-01-30T06:37:00.000+02:00", "crawled": "2018-01-30T07:10:15.779+02:00", "highlightTitle": ""}