{"organizations": [], "uuid": "fb6ed9aba4d28561329cf48043fee96f9ed5f72a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-mobile-game-publishing-company-gamemine-achieves-sustainable-profitability-shortly-after-securing-20-million-series-a-round-of.html", "country": "US", "domain_rank": 767, "title": "Mobile Game Publishing Company, GameMine, Achieves Sustainable Profitability Shortly After Securing $20 Million Series A Round Of Funding", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:18:00.000+02:00", "replies_count": 0, "uuid": "fb6ed9aba4d28561329cf48043fee96f9ed5f72a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-mobile-game-publishing-company-gamemine-achieves-sustainable-profitability-shortly-after-securing-20-million-series-a-round-of.html", "ord_in_thread": 0, "title": "Mobile Game Publishing Company, GameMine, Achieves Sustainable Profitability Shortly After Securing $20 Million Series A Round Of Funding", "locations": [], "entities": {"persons": [{"name": "spongebob squarepants", "sentiment": "none"}, {"name": "daniel starr", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "mobile game publishing company", "sentiment": "negative"}, {"name": "gamemine inc.", "sentiment": "negative"}, {"name": "nickelodeon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 29, 2018 /PRNewswire/ -- GameMine Inc., a US-based mobile game publisher, is announcing today it has become profitable. The achievement of positive revenue is being attributed to GameMine's recent expansion into new international territories, as well as aggressive growth of its diverse library of mobile game titles throughout 2017. This financial stability comes on the heels of GameMine successfully raising $20 million in series A venture capital, making several strategic executive hires, and securing multiple international distribution partnerships.\n\"The impressive growth of GameMine's mobile game library in 2017 allowed us to secure several new international distribution partnerships as well as significantly expand our existing partnerships with a range of European and African mobile carriers,\" says Daniel Starr, Global CEO of GameMine. \"We have also partnered with Nickelodeon to offer subscribers a range of mobile games featuring globally recognized characters like SpongeBob SquarePants and The Teenage Mutant Ninja Turtles. The diversity of our game library plus these partnerships' expansion of territories where GameMine is available effectively skyrocketed our subscriber base which pushed us solidly into profitability, so much so that we're on track to do more than $20 million in profits before the end of 2018.\"\nGameMine operates a multinational mobile game publishing company that develops, licenses and acquires mobile games, then provides them to consumers in more than 135 countries through a mobile game marketplace. The company leverages its talented global network of developers and gaming experts to provide a diverse variety of theme-based mobile gaming portals. GameMine maintains partnerships with international mobile carriers to distribute these games to consumers around the world on a subscription-based, ad-free basis.\nCo-founded by Starr and Flaviu Rus, President, GameMine maintains a vast catalogue of over 400 mobile game titles spanning all major gaming genres. GameMine serves millions of active users around the world via distribution partnerships with leading international mobile carriers including, among others, Vodacom , Orange , and Telefonica . In 2017, GameMine generated millions of installs and added more than 300 mobile game titles to its library, including a selection of games by world-renowned entertainment brand, Nickelodeon.\nAbout GameMine\nGameMine Inc. is a US-based mobile game publisher headquartered in Los Angeles, California. GameMine develops, licenses and acquires mobile games, then provides them to consumers in more than 135 countries through a subscription-based mobile game marketplace. Consisting of a global network of talented developers and gaming experts, multiple industry-leading mobile carrier partnerships and a presence on Google Play, GameMine provides a diverse variety of genre-based mobile gaming portals to satisfy a wide range of gaming interests.\nWebsite: https://www.gamemine.com/\nSocial:", "external_links": ["https://www.telefonica.com/en/", "https://www.orange.com/en/home", "https://www.gamemine.com/", "http://www.vodacom.com/"], "published": "2018-01-30T02:18:00.000+02:00", "crawled": "2018-01-30T03:44:36.000+02:00", "highlightTitle": ""}