{"organizations": [], "uuid": "5799f4c88bad54b32dfe603d1452dcdc6ecad69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/aur-02-18-sedric-exterior.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/aurora-innovation-self-driving-car-startup/", "country": "US", "domain_rank": 1196, "title": "Meet Aurora Innovation, the Ambitious Self-Driving Car Startup | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-25T08:30:00.000+02:00", "replies_count": 0, "uuid": "5799f4c88bad54b32dfe603d1452dcdc6ecad69e"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/25/aurora-innovation-self-driving-car-startup/", "ord_in_thread": 0, "title": "Meet Aurora Innovation, the Ambitious Self-Driving Car Startup | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}, {"name": "urmson", "sentiment": "none"}, {"name": "drew bagnell", "sentiment": "none"}, {"name": "chris urmson", "sentiment": "none"}, {"name": "john henry", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "meet aurora innovation", "sentiment": "negative"}, {"name": "aurora innovation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 6:30 AM EST \nSpecialists who want to save the world? Certainly. Technicians who seek to push the envelope? Absolutely. Self-proclaimed superstars without a clear job to interview for? Sure, we’ll take ’em. \nBut no jerks. \nSterling Anderson, Drew Bagnell, and Chris Urmson—cofounders of Aurora Innovation , a buzzy technology startup that has until recently operated in secret from offices in Pittsburgh, San Francisco, and Palo Alto—will do just about anything to bring self-driving cars to the world quickly and safely. But the men are just as concerned with who will bring autonomous technology to the driving masses as much as accomplishing the mission. “It’s important that we find people who are excellent at what they do,” Urmson says, “but it’s also important to us that they’re actually good human beings.” Chris Urmson (left) and Sterling Anderson, two of Aurora’s cofounders. John Henry—The New York Times/Redux \nFor a small company competing in a cutthroat race to commercialize autonomous vehicles, Aurora’s emphasis on soft skills might seem like a costly distraction. The stakes are certainly high: Autonomous vehicles are expected to give rise to a “passenger economy” worth $800 billion by 2035 and $7 trillion by 2050, according to a 2017 Strategy Analytics study. But Aurora can afford to be picky. The company’s three cofounders are considered to be some of the best minds in self-driving cars. Anderson is the former director of the Autopilot program at Tesla (tsla) , Bagnell headed the autonomy and perception team at Uber’s Advanced Technologies Center, and Urmson was the former head of Google’s (googl) self-driving project, now a discrete business called Waymo. Sedric, Volkswagen’s fully autonomous concept car. Courtesy of VW \nAurora works with automakers to design and develop a package of sensors, software, and data services—the “full stack,” in industry parlance—needed to deploy fully autonomous vehicles. Aurora is focused on Level 4 autonomous systems with an eye toward Level 5. (Level 4 is a designation by SAE International, the automotive engineering association, for autonomous vehicles that take over all driving in certain conditions. In Level 5 autonomy, the vehicle is self-driving in all situations.) “What’s most overlooked is how complicated the problem is,” Urmson says. “There’s a flood of companies that are indicating they’re going to come and solve this problem quickly. We understand where the pitfalls are and how hard this problem really is, and we’re building a company to go solve it for real, over time.” Without the need for a driver the Sedric has no steering wheel, pedals or cockpit leaving room for a generously proportioned lounge-like interior. Courtesy of VW Sedric as designed to be comfortable lounge on wheels, the prototype even includes space for plants. Courtesy of VW \nAurora’s pedigree and technology have attracted prominent partners. In January, the company announced collaborations with Volkswagen Group (vlkay) and Hyundai—two of the world’s largest automakers—to accelerate the development of fully autonomous vehicles for the masses. Volkswagen, for example, wants to launch commercial fleets of self-driving electric vehicles in two to five cities beginning in 2021. The automaker and Aurora have been working together for months to integrate the startup’s self-driving systems in custom-designed electric shuttles for VW’s new Moia brand. Volks­wagen plans to launch two types of test fleets using Aurora tech in 2018: one for ride-pooling using Moia shuttles, the other for door-to-door ride-hailing service in the U.S. and Germany. The tests are VW’s latest steps in an aggressive autonomy strategy established in 2016 and bolstered with the sleek Sedric self-driving concept car the following year. In January, Aurora announced collaborations with Volkswagen Group and Hyundai, above,—two of the world’s largest automakers—to accelerate the development of fully autonomous vehicles for the masses. Courtesy of Aurora \nBut the road to revolution is riddled with hurdles. There are logistical challenges such as how to deploy self-driving vehicles without causing additional problems for cities. There is also the matter of stiff competition. Aurora’s business model puts it in direct competition with Waymo, the Alphabet-owned self-driving unit; Uber; GM-owned Cruise Automation; Argo AI, a startup in which Ford (f) invested $1 billion in February 2017; and Aptiv, the Delphi spinoff that acquired self-driving-car startup NuTonomy for $450 million in October 2017. Aurora’s founders aren’t terribly concerned. “This is about realizing a goal that we’ve had for many years,” Anderson says. “We’re okay with there being multiple people developing these kinds of systems. That’s fine. I want to save and improve lives. It might sound superfluous or hackneyed, but that’s really it.” Volkswagen plans to launch two types of test fleets using Aurora tech in 2018: one for ride-pooling using Moia shuttles, above, the other for door-to-door ride-hailing service in the U.S. and Germany. Courtesy of VW \nWhat’s more, if Aurora gets it right, passengers will forget that self-driving technology is under the hood. “If it’s working,” Urmson says, “you don’t think about it.” \nNext stop: the future. \nA version of this article appears in the Feb. 1, 2018 issue of Fortune with the headline “Open the Pod Bay Doors.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T08:30:00.000+02:00", "crawled": "2018-01-25T17:28:24.005+02:00", "highlightTitle": ""}