{"organizations": [], "uuid": "83ce526bdc38eb74c21d4667a916aa4571ef8bd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-france-homelessness/europe-prods-homeless-with-spikes-and-cold-showers-idUSKBN1F8111", "country": "US", "domain_rank": 408, "title": "Europe prods homeless with spikes and cold showers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.147, "site_type": "news", "published": "2018-01-19T18:30:00.000+02:00", "replies_count": 0, "uuid": "83ce526bdc38eb74c21d4667a916aa4571ef8bd5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-france-homelessness/europe-prods-homeless-with-spikes-and-cold-showers-idUSKBN1F8111", "ord_in_thread": 0, "title": "Europe prods homeless with spikes and cold showers", "locations": [], "entities": {"persons": [{"name": "page", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "christian page", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS(Thomson Reuters Foundation) - Just outside a high rise in northeast Paris, Christian Page had found a decent place to sleep: it kept out the rain and a wobbly tile meant he could hear people approach, so the former wine waiter felt a little safer as he bedded down for the night.\nThere was even the odd home comfort.\nEvery morning, the building’s concierge brought him coffee as he packed up his sleeping bag before wandering away the day.\nThen all of a sudden, a concrete box appeared in what had come to be his corner, and he had to find somewhere new to go.\n“One evening I arrived, and a flower box had taken my place,” Page told the Thomson Reuters Foundation. ”I was not doing any harm. I was very careful. There was no reason.”\nMade homeless after a divorce and evicted in 2015, the one-time sommelier, 45, has since taken to social media to denounce what he and fellow campaigners say is a rising number of “anti-homeless devices” - benches, flower pots and fences that prevent homeless people from setting up camp in public spaces.\nBEDTIME STORY Across Europe, many countries have seen the number of homeless people rise since the 2007 financial crisis as a result of austerity measures and rising housing prices. Workers, women and even children – rarely seen on the streets a decade ago – have since become a regular sight, campaigners said.\nAt the same time, anti-homeless devices and measures to criminalise rough sleeping started emptying city centres: the very place where the homeless can access much-needed support.\n“If you put together anti-homeless devices and laws against begging, homelessness...camping, the lack of water fountains and toilets… In practice, that drives (homeless people) away,” said Christophe Robert, who heads French homelessness charity Fondation l’Abbe Pierre.\n“When we push homeless people away from town centres, we push them away from citizens’ eyes, from charities, from everyone who should collectively be looking for a solution,” he told the Thomson Reuters Foundation in his Paris office.\nOUTLAWED Earlier this month, a local council leader in the postcard town of Windsor, where Prince Harry and Meghan Markle will marry in May, said beggars must be cleared from the streets to avoid presenting the British town in a bad light.\nIn other parts of Britain, such as the popular seaside resort of Brighton, local authorities are enforcing bans on people begging or sleeping in tents - moves that critics say affect homeless people disproportionately.\nIt is illegal to beg on the streets of Denmark, Greece and Romania, and Sweden is debating following suit. In 2012, Hungary changed its constitution to make homelessness a crime.\nIn the meantime, campaigners say the number of homeless people has risen across the continent. According to the European Commission, there are an estimated 4.1 million homeless people in the European Union.\nThe number of people sleeping on the streets in France rose by 50 percent between 2001 and 2012, according to the latest figures from the French statistics agency INSEE. More than 400 homeless people died in France in 2017, according to Morts de la Rue, a campaign group that tracks the deaths.\nLast month, cold water sprays installed in a private car park entrance in Paris sparked a nationwide debate.\nThe setup, in a wealthy neighbourhood steps from the iconic Rivoli shopping avenue, sprayed water onto anyone approaching the covered entrance without a resident’s permit, effectively driving away homeless people seeking shelter for the night.\nPage, the former sommelier, said such measures had become increasingly common in the past two years.\nWithin just a few hundreds meters, he pointed out a bike rack - on which bikes could not be locked - installed where a homeless man had once bedded down, stones embedded near the entrance of a supermarket and short benches at bus stops to prevent anyone getting too comfortable.\nPRIVATE AFFAIR Paris city authorities say they firmly reject the use of anti-homeless structures, which exist mostly on private grounds.\nBut the controversial water sprays were installed to prevent passers-by – homeless or otherwise – from relieving themselves in the garage entrance, a representative for Penates, the garage owner behind the setup, told the Thomson Reuters Foundation.\n“This is not an anti-homeless system – it’s an anti-urination system,” said the employee, who asked not to be named.\nData on anti-homeless structures is scarce, as many items, such as the box installed in Page’s corner, serve other uses and are rarely explicitly installed to deter the homeless.\nBut in a campaign launched by French homelessness charities, hundreds of hostile installations across the country were mapped online and on social media under the hashtag #SoyonsHumains (let’s be human) following the uproar.\nPhotos posted on Twitter showed spikes, stones and railings strategically installed in just the sort of sheltered places that homeless Parisians had once called home.\nRobert, from Fondation l’Abbe Pierre, said the number of anti-homeless structures had increased “dramatically” since they last campaigned on the issue five years ago.\nTIDE TURNING? Campaigners hope the negative attention - a petition referring to it as “inhumane and unacceptable” gathered more than 270,000 signatures - might reverse the trend.\nOn Christmas Day, Page, who charges his smartphone in USB ports built into Paris bus stops and has more than 22,000 Twitter followers, posted a photo of fences installed around an air vent in the capital, preventing homeless people from sleeping on the warm metal.\nThe next day, local authorities had removed it.\nParis officials said the city was firmly against anti-homeless devices. When the eight-year-old fence was brought to their attention on social media, they removed it immediately, a spokesman said.\nBut many more installations are erected by private companies and citizens, and cannot be taken down by local authorities.\n“It doesn’t have to be this way,’ said Robert, from Fondation l’Abbé Pierre.\nMost Parisians, he said, had a warmer spirit.\n“There are people who lend a helping hand, who give out free coffees, who open their shops to allow for phones to be charged, who lend their houses, a look, a coin or a coffee.”\nEditing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T18:30:00.000+02:00", "crawled": "2018-01-20T17:26:01.009+02:00", "highlightTitle": ""}