{"organizations": [], "uuid": "d2b7f2c8792acc62a899c1eff3aad44018f15baf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-power-kemp/column-u-s-energy-regulator-rejects-bid-to-favour-coal-and-nuclear-power-kemp-idUSL8N1P54ZV", "country": "US", "domain_rank": 408, "title": "COLUMN-U.S. energy regulator rejects bid to favour coal and nuclear power: Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.074, "site_type": "news", "published": "2018-01-11T00:19:00.000+02:00", "replies_count": 0, "uuid": "d2b7f2c8792acc62a899c1eff3aad44018f15baf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-power-kemp/column-u-s-energy-regulator-rejects-bid-to-favour-coal-and-nuclear-power-kemp-idUSL8N1P54ZV", "ord_in_thread": 0, "title": "COLUMN-U.S. energy regulator rejects bid to favour coal and nuclear power: Kemp", "locations": [], "entities": {"persons": [{"name": "john kemp", "sentiment": "negative"}, {"name": "kemp", "sentiment": "negative"}, {"name": "perry", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "department of energy organisation", "sentiment": "none"}, {"name": "u.s. energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(John Kemp is a Reuters market analyst. The views expressed are his own)\nBy John Kemp\nLONDON, Jan 10 (Reuters) - Federal regulators in the United States have declined to act on a proposal from the secretary of energy that would have supported coal-fired and nuclear power plants by mandating special tariffs for essential reliability services.\nIn September, U.S. Energy Secretary Rick Perry directed the Federal Energy Regulatory Commission (FERC) to consider a rule ensuring full-cost recovery for generators providing reliability services and that store at least 90 days of fuel on site.\nFERC is an independent regulatory agency but the secretary invoked a little-used authority in the Department of Energy Organisation Act to require the commission to consider his proposed rule.\nPerry’s intervention has been characterised as deviating from market-based electricity pricing and putting a thumb on the scale to favour coal miners and nuclear generators.\nCoal-fired and nuclear power plants, as well as possibly hydroelectric power producers, are the only generators that store significant volumes of fuel on site so would have been the only beneficiaries from the revised pricing.\nThe proposed resilience rule scrambled traditional alliances, pitting oil and gas producers, renewables advocates, and many electric utilities and customers against coal miners and the nuclear industry.\nIt also deeply divided the coalition of economic and business interests that has backed the Trump administration.\nMiners and the nuclear industry have been vocal supporters while oil and gas producers as well as many business groups have been vociferous in opposition.\nThe grid rule also split the president’s coalition along ideological lines drawing strong backing from his protectionist and populist supporters but opposition from those committed to free energy markets.\nIn the end, FERC has rejected the secretary’s proposal, in a victory for gas producers, renewables firms, most utilities, free-market advocates and the majority of business groups.\nOn Jan. 8, the five commissioners, four of them nominated by President Donald Trump, agreed unanimously to reject the proposed rule and instead opt for a further study of resilience issues.\nLEGAL STANDARD The secretary has statutory authority to propose rules for FERC’s consideration, but final regulatory power lies with the commission.\nFERC concluded it had no power to issue the proposed regulation because it failed to meet the specific rule-making standards set out in the Federal Power Act.\n“The proposed rule did not satisfy those clear and fundamental requirements under ... the Federal Power Act. Given those legal requirements, we have no choice (but to reject the proposed rule),” the commission wrote in its decision.\nFERC found that the secretary had not shown that existing tariffs were “unjust, unreasonable unduly preferential or discriminatory” as required by the law.\nFERC also found the proposed remedy did not meet the requirement that it be just and reasonable and not unduly discriminatory or preferential.\nIf the commission had issued the rule, it would have been vulnerable to a court challenge for exceeding its authority under the Federal Power Act as well as for acting arbitrarily and capriciously under the Administrative Procedure Act.\nFERC has instead embarked on a new study of resilience threats to the power grid which has been broadened to include threats from terrorism, cyber-attacks and extreme weather events as well as fuel supply disruptions.\nThe commissioners have directed regional transmission organisations and independent system operators to provide detailed information on how they assess and manage resilience threats to their networks.\nThe intention is to create a common vocabulary and understanding about what constitutes resilience, identify threats to it, especially from high-impact low-frequency risks, and develop approaches for managing and mitigating them.\nOnce grid operators have provided detailed information, the commission will decide whether further regulatory actions are needed.\nPRO-MARKET RULES FERC’s decision to reject the proposed grid resilience rule and open a fresh investigation is consistent with the regulatory approach the commission has developed over the last three decades.\nThe commission has focused on promoting competition and market-based solutions while ensuring regulations are fuel neutral and do not artificially favour any one source of electric power over another.\n“The commission has largely adopted a pro-market regulatory model where in the commission relies on competition in approving market rules and procedures that in turn determine the prices for energy, ancillary services and capacity products,” the commission noted in its ruling.\n“Under this pro-competition, market-driven system, owners of generating facilities that are unable to remain economic in market may take steps to retire or mothball their facilities,” it added.\nSome commissioners were even more explicit. “The history of energy in the (United States) has been one of continual change,” Commissioner Cheryl LaFleur wrote in a concurring opinion.\nFERC’s task has been ensuring that rates remained just and reasonable and customers were served reliably through successive generations and technological changes she observed.\n“As with all transitions, there have been market winners and losers as new technologies have brought competitive pressures to bear on existing resources.”\n“Resource turnover is a natural consequence of markets, and the reduced prices that result from greater competition are a benefit to consumers, not a problem to solve.”\nLaFleur argued it was not commission’s task to freeze in place the existing generation mix. Instead of slowing the transition from the past it should focus on easing the transition to the future.\nRESILIENCE STUDY Proponents of the grid resilience rule have sought to salvage something from the wreckage by insisting the proposal has at least pushed the question of fuel security onto regulatory agenda.\nCoal miners and the nuclear industry are likely to shift their lobbying effort to the regional transmission operators in a bid to influence their submissions to the commission.\nIn reality, the commission and grid managers have been studying the issue for nearly a decade and have already taken a number of practical steps, including payments for ancillary services including reserve capacity.\nBut while the commission’s inquiry should lead to a clearer and more comprehensive understanding of threats to the grid it is unlikely to stop further retirements of coal-fired and nuclear power plants.\nSecretary Perry’s attempt to put a thumb on the scale to save coal and nuclear from the challenge of cheap gas has failed.\nRelated columns:\n“Fuel security and power generation in the United States”, Reuters, Oct. 17\n“Perry’s proposed grid resiliency rule scrambles energy alliances”, Reuters, Oct. 3\n“Perry puts thumb on the scale to save U.S. coal and nuclear”, Reuters, Sept. 29\nEditing by David Evans\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T00:19:00.000+02:00", "crawled": "2018-01-11T12:26:25.052+02:00", "highlightTitle": ""}