{"organizations": [], "uuid": "180aff1f42ae932aa0964852b0b637cf501b0e4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-usa-trump-immigration-un/u-n-rights-office-decries-trumps-reported-remarks-as-racist-idUSKBN1F114A", "country": "US", "domain_rank": 408, "title": "U.N. rights office decries Trump's reported remarks as 'racist'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:53:00.000+02:00", "replies_count": 0, "uuid": "180aff1f42ae932aa0964852b0b637cf501b0e4a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trump-immigration-un/u-n-rights-office-decries-trumps-reported-remarks-as-racist-idUSKBN1F114A", "ord_in_thread": 0, "title": "U.N. rights office decries Trump's reported remarks as 'racist'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "rupert colville", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "colville", "sentiment": "none"}], "locations": [{"name": "geneva", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "united nations", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - The United Nations human rights office on Friday rejected as “racist” and inciting xenophobia the reported remarks by U.S. President Donald Trump describing immigrants from Africa and Haiti as coming from “shithole” countries.\nTrump on Thursday questioned why the United States would want to have immigrants from Haiti and African nations, referring to some as “shithole countries,” according to two sources familiar with the comments made in the White House.\n“These are shocking and shameful comments from the President of the United States. There is no other word one can use but ‘racist’,” U.N. human rights spokesman Rupert Colville told a Geneva news briefing when asked about the comments.\n“You cannot dismiss entire countries and continents as ‘shitholes’, whose entire populations, who are not white, are therefore not welcome,” he added.\nThe issue was more than “vulgar language”, Colville said.\n“It’s about opening the door to humanity’s worst side, about validating and encouraging racism and xenophobia that will potentially disrupt and destroy lives of many people.”\nTrump had also failed to clearly condemn the “anti-Semitic and racist actions of white supremacists in Charlottesville” at a rally in Virginia last August, Colville said.\nThe program that was being discussed at the White House is called Temporary Protected Status.\nIn November, the Trump administration decided to end the status for immigrants from Haiti and Nicaragua. It gave the approximately 59,000 Haitian immigrants who had been granted the status until July 2019 to return home or legalize their presence in the United States. Nicaraguans were given until January 2019.\n“The future of the Dreamers should not be used as a bargaining chip to negotiate the most severe and restrictive immigration and security measures possible. These are human beings, not commodities,” Colville said.\n“Dreamers” is term used for undocumented immigrants who were brought into the United States as children.\nWilliam Spindler, a U.N. refugee agency spokesman, declined to comment directly on Trump’s purported remarks:\n“But what I can say is that UNHCR’s position is always that people forced to flee war or persecution, and needing asylum, should be given protection by whichever country they are in, irrespective of race, religion, ethnicity or place or country of origin,” Spindler said.\nReporting by Stephanie Nebehay, Editing by Tom Miles and Catherine Evans\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:53:00.000+02:00", "crawled": "2018-01-12T18:21:02.036+02:00", "highlightTitle": ""}