{"organizations": [], "uuid": "2114dfaa3089191a0be44a8b7ab98699942c5222", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WM357_nfl_fo_SOC_20171207053838.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/cmo-today-nfl-ratings-latest-on-uber-and-fetch-legal-dispute-publisher-view-on-facebook-1515070798", "country": "US", "domain_rank": 387, "title": "CMO Today: NFL Ratings; Latest on Uber and Fetch Legal Dispute; Publisher View on Facebook", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:59:00.000+02:00", "replies_count": 0, "uuid": "2114dfaa3089191a0be44a8b7ab98699942c5222"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-nfl-ratings-latest-on-uber-and-fetch-legal-dispute-publisher-view-on-facebook-1515070798", "ord_in_thread": 0, "title": "CMO Today: NFL Ratings; Latest on Uber and Fetch Legal Dispute; Publisher View on Facebook", "locations": [], "entities": {"persons": [{"name": "stephen colbert", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "cbs", "sentiment": "none"}, {"name": "the wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Good morning. We’re approaching Hollywood awards season, and while all eyes may be on the Golden Globes this Sunday, it’s really just a warm-up for THE MOST DISHONEST & CORRUPT MEDIA AWARDS OF THE YEAR. You may recall earlier this week, President Trump announced the inaugural celebration on Twitter , which is due to take place on Monday. Stephen Colbert is so keen for a “Fakies” accolade, he’s even taken out a billboard in Times Square in a bid to get nominated by POTUS in all categories. The Hollywood Reporter has more on the CBS late-night host’s campaign .\nFumble The final scores are in. The average audience for NFL games in the recently completed regular season was 14.9 million, down 9.7% from a year ago , The Wall Street Journal reports, citing Nielsen figures. That’s a steeper decline than last year’s 8% viewership erosion. As we’ve covered in this newsletter, there are plenty of theories for the ratings dip, including too many games across too many days, blowback from anthem protests, and football simply being hit by the same viewing declines that are affecting the broader TV business. All that considered, football remains one of the most attractive draws on television for advertisers, with NFL programming accounting for 33 of the top 50 programs in 2017, the league said. That demand has helped keep ad rates high. As Ad Age reported earlier this week, estimates from Standard Media Index suggest overall in-game NFL ad sales revenue was up 2% from last year .\nFetch Me an Uber CMO Today’s Alex Bruell reports : There’s a new twist in the ongoing fight between Uber and mobile ad agency Fetch. Uber had sued Fetch in September for breach of contract, alleging the Dentsu-owned agency failed to prevent ad fraud. Fetch has now flipped the tables on the ride-hailing startup by suing Uber in federal court this week over $19 million in unpaid invoices, arguing that its contract didn’t require it to police or prevent ad fraud from suppliers. The latest move is Fetch insisting on a federal court review after Uber sought to drop the claims last month and litigate the dispute in an ongoing state court case.\n—Can We Split the Fare?—\nThe countersuit fuels the debate around who is responsible for policing and preventing ad fraud—the agency, the vendors the agency subcontracts, or the client? A lack of transparency in ad-buying practices and contracts has already created an environment of mistrust between marketing clients, and their agencies and vendors. Regardless of whether Fetch was contractually obligated to police fraud or whether Uber ignored Fetch’s advice and warnings about certain suppliers, the dispute could further fan that sense of distrust.\nThese Are My Confessions The latest interview in Digiday’s anonymous “confessions” series has some attention-grabbing Quote: s from an audience development head at a midsize publisher, who opines on their relationship with Facebook . “They are going to completely deprioritize publishers,” the anonymous executive says, claiming Facebook told them, “If I were you, I would probably not rely on Facebook as much as you are.” That sounds ominous, but it’s also common sense as we’ve seen so many cautionary tales now of publishers being burned by algorithm changes or a switch in platform priorities (remember the commotion surrounding Facebook Live?). Perhaps the key line of the piece is the least controversial. The exec says 2018 is “very much going to be the year of the individual brand” and it plans to elevate its journalists on Facebook as much as they push their own personal brands on Twitter. That could be an interesting trend to follow into this year, especially if advertisers start thinking about having a presence on those pages. I asked Facebook for its reaction to the Digiday piece, but the company declined to comment.\nLooking Back Over My Shoulder I Can See That Deal In Your Eye LUMA Partners, the digital media and marketing-focused investment bank, has released its latest quarterly report , which outlines the biggest ad tech, martech and digital content deals of 2017. Taking a look at ad tech specifically, LUMA describes 2017 as the year of the “ad tech clean-up,” with all the remaining public companies that rely on insertion orders (rather than recurring platform fees) having been acquired. Private equity and companies in the telecom sector were among the most active buyers. For the year ahead, LUMA predicts ad tech firms that have a focus on first-party data should fare well because they are less vulnerable to “exogenous forces” such as Apple’s Intelligent Tracker Prevention (the predicted impact of which has hurt Criteo’s share price of late ) and Europe’s new General Data Protection Rule. Martech was the star performer in 2017, with the sector’s stocks growing 60%.\n—Where’s Your Head At—\nOn a related note, Pivotal Research analyst Brian Wieser released his quarterly ad tech and martech headcount tracker, which is based on LinkedIn data. Mr. Wieser estimates companies in the sector expanded headcount by 8% year-over-year in the fourth quarter, a slowdown from the 10% growth estimated in the previous quarter. Over the past year, the group of companies Mr. Wieser tracked were firms with a focus on ad quality and brand safety. Their growth comes as little surprise since marketers have paid more attention this year to where their ads are actually ending up, thanks to high-profile incidents such as YouTube’s brand safety snafu and the ongoing ad fraud cleanup.\nBest of the rest Adweek obtained early findings of a U.S. Army audit that reportedly suggests “ineffective marketing programs” have wasted millions of dollars each year. [ Adweek ]\nSpotify reportedly confidentially filed IPO documents at the end of last month and could list its shares in the first quarter of this year. [ Axios ]\nBillionaire venture capitalist Peter Thiel is reportedly interested in creating a new conservative cable news network. [ BuzzFeed ]\nDentsu Aegis Network has acquired Detroit-based digital marketing company HelloWorld. Terms were not disclosed. HelloWorld will become part of Dentsu’s Merkle business. [ Crain’s ]\nTime Inc. has sold African-American women’s lifestyle magazine Essence for an undisclosed sum to Essence Ventures LLC, a company formed by Sundial Brands co-founder Richelieu Dennis. [ WSJ ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": ["https://twitter.com/srabil", "http://www.crainsdetroit.com/article/20180103/news/649191/helloworld-bought-by-dentsu-aegis-network", "https://www.law.com/therecorder/sites/therecorder/2018/01/03/ad-firm-fetch-fires-back-at-uber-with-accusations-of-forum-shopping/?slreturn=20180003182404", "https://twitter.com/alexbruell", "https://twitter.com/VranicaWSJ", "http://adage.com/article/media/ratings-slum/311777", "https://twitter.com/larakiara", "https://digiday.com/media/facebook-encouraged-us-not-pivot-video-confessions-audience-development-head/", "https://twitter.com/asharma", "https://twitter.com/realDonaldTrump/status/948359545767841792", "https://twitter.com/wsjCMO", "https://www.axios.com/exclusive-spotify-files-for-its-ipo-2522109160.html", "https://www.buzzfeed.com/ryanmac/peter-thiel-conservative-news-network-roger-ailes-fox", "http://www.adweek.com/agencies/u-s-army-audit-claims-ineffective-marketing-programs-have-wasted-millions-in-taxpayer-dollars-each-year/", "https://twitter.com/BenMullin", "https://www.slideshare.net/tkawaja/luma-digital-brief-018-market-report-q4-2017", "https://digiday.com/media/facebook-plans-to-stop-paying-publishers-to-make-news-feed-videos/", "https://www.hollywoodreporter.com/live-feed/stephen-colbert-takes-billboard-campaigning-trumps-dishonest-media-awards-1071515"], "published": "2018-01-04T15:59:00.000+02:00", "crawled": "2018-01-04T20:46:17.009+02:00", "highlightTitle": ""}