{"organizations": [], "uuid": "32ee6ea4c75547bf33167fd96bf3f34a0abbac16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-quake/magnitude-8-2-quake-off-alaska-prompts-tsunami-warning-idUKKBN1FC118", "country": "US", "domain_rank": 408, "title": "Magnitude 8.2 quake off Alaska prompts tsunami warning", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:49:00.000+02:00", "replies_count": 0, "uuid": "32ee6ea4c75547bf33167fd96bf3f34a0abbac16"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-quake/magnitude-8-2-quake-off-alaska-prompts-tsunami-warning-idUKKBN1FC118", "ord_in_thread": 0, "title": "Magnitude 8.2 quake off Alaska prompts tsunami warning", "locations": [], "entities": {"persons": [{"name": "robin pomeroy", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "alaska", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chiniak", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. geological survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:54 AM / Updated 34 minutes ago Magnitude-7.9 quake off Alaska sparks brief West Coast tsunami fears Yereth Rosen 3 Min Read \nANCHORAGE (Reuters) - Tsunami alerts were lifted on Tuesday for the U.S. West Coast and western Canada after a magnitude-7.9 earthquake struck in the Gulf of Alaska, sending the state’s coastal residents inland to seek shelter from possible tidal waves. \nIn Alaska, people packed into high schools and other evacuation centres after the quake hit shortly after midnight local time (0900 GMT). \nOfficials had warned residents as far south as San Francisco to be ready to evacuate coastal areas but by 5:15 a.m. PST (1315 GMT) the U.S. National Weather Service had lifted all tsunami advisories, watches and warnings for California, Oregon Washington and Alaska. Canadian officials lifted one for coastal British Colombia. \nIn Alaska, residents gathered in shelters on Kodiak Island, the closest land point to the temblor, around 160 miles (250 km) southeast of Chiniak, Alaska, at a depth of 25 km - considered shallow but with broader damage - according to the U.S. Geological Survey (USGS). \nThere were no immediate reports of injuries or damage from the quake, which was initially measured at magnitude 8.2. \n“People are fine,” said Neil Hecht, assistant principal of Kodiak High School, which was sheltering a few hundred people. “Spirits are high.” Vehicles are seen during a tsunami warning evacuation in Kodiak, Alaska, U.S., January 23, 2018 in this still image obtained from social media video. Instagram @JUPITERTHEPRODUCER.ASTORIA via REUTERS \nLong lines of traffic formed in coastal communities including Homer and Seward, Alaska, residents said on social media. \nIn Homer, a few hundred cars were packed into its high school parking lot. Shawn Biessel, a 32-year-old park ranger, and his mother were in the lot, a few hundred feet above sea level. Vehicles are seen during a tsunami warning evacuation in Kodiak, Alaska, U.S., January 23, 2018 in this still image obtained from social media video. Instagram @JUPITERTHEPRODUCER.ASTORIA via REUTERS \n“It was a really obvious, pretty strong, long quake. A good rumbler,” Biessel said in a phone interview. “It went on for a solid minute and after a while we thought we should get outside.” \nPolice drove through Biessel’s neighbourhood with flashing lights to alert residents to evacuate, Biessel said. \nSan Francisco briefly warned residents within three blocks of the Pacific Ocean or five blocks of San Francisco Bay to prepare to evacuate. That warning was later lifted. \nEarthquakes of similar magnitude are not uncommon in Alaska, which is seismically active. The state has recorded 11 tremors with a magnitude of 7 or greater within 373 miles (600 km) of Tuesday’s quake over the past century, according to Zachary Reeves, a USGS seismologist in Golden, Colorado. \nThe largest U.S. earthquake ever recorded was a magnitude-9.2 temblor in Alaska in March 1964, causing tidal waves of more than 100 feet (30 m) high that killed 131 people.   Steve Gorman in Los Anglees, Brendan O'Brien in Milwaukee, Nate Raymond in Boston and Andrea Hopkins in Ottawa; Writing by Scott Malone and Robin Pomeroy; Editing by John Stonestreet and Jeffrey Benkoe", "external_links": [], "published": "2018-01-23T11:49:00.000+02:00", "crawled": "2018-01-23T12:10:44.023+02:00", "highlightTitle": ""}