{"organizations": [], "uuid": "18afe6093b81d839b46e94ec6d25c3acd81730d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/10/104577141-GettyImages-688402786.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/12/facebook-news-feed-change-shares-could-rally-20-percent.html", "country": "US", "domain_rank": 767, "title": "Facebook news feed change: Shares could still rally 20% thanks to Instagram", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:48:00.000+02:00", "replies_count": 0, "uuid": "18afe6093b81d839b46e94ec6d25c3acd81730d6"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/12/facebook-news-feed-change-shares-could-rally-20-percent.html", "ord_in_thread": 0, "title": "Facebook news feed change: Shares could still rally 20% thanks to Instagram", "locations": [], "entities": {"persons": [{"name": "daniel ives", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "instagram facebook", "sentiment": "negative"}, {"name": "gbh insights", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook announced big changes to its News Feed on Thursday, but that's not worrying one analyst who upped his outlook on the stock, expecting nearly 20 percent upside from the current price.\nCEO Mark Zuckerberg said the News Feed — one of the key areas where the social network shows ads — will begin to prioritize \"meaningful social interactions\" versus \"relevant content.\" This means users will start to see more posts from friends rather than publishers.\nZuckerberg added that he expects the time spent on Facebook will go down, but \"will be more valuable.\"\nThis could hit publishers that rely on traffic from Facebook, but Daniel Ives, head of technology research at GBH Insights, said he is not worried because the social networking giant has \"strong monetization tailwinds\" in 2018, thanks to a monthly active user (MAU) base of more than 2 billion .\n\"Facebook will continue to grow its massive global installed base in our opinion while importantly monetizing users especially on the Instagram side of the house, which remains the 'core 1-2 punch' that underlies our bullish thesis on the name,\" Ives said in a note released late Thursday.\n\"We note that Instagram already announced 800 million MAUs in September (vs. 700 million in April) as this platform remains a 'golden jewel' in Facebook's platform in our opinion with healthy monetization and ad growth set to play out in 2018 based on our forecasts.\"\nIves also raised his price target on Facebook's stock from $210 to $225. If realized, this would mark a nearly 20 percent increase from Thursday's close. Facebook shares were down around 3.7 percent in pre-market trade on Friday.\nshow chapters New Facebook timeline emphasizes friends over news 12 Hours Ago | 02:06 Facebook does not break out figures on how much ad revenue Instagram brings in. But eMarketer forecast in December that ad revenues from the platform would grow from $4.10 billion in 2017 to $10.87 billion by 2019.\nThe social media titan also plans to increase investment this year which could lead to expense growth of between 45 percent and 60 percent . This will go toward increasing the headcount of employees working on tackling content that violates the company's rules, but also investing in the \"Watch\" tab — its original video content project .\nFor Ives, \"Watch\" remains a \"major wild car\" however, but increasing investment will help the company in the long run, though it could hold back shares in the short term.\n\"This higher investment profile could be a lingering cloud over Facebook's shares in the near term ... And a small speed bump until investors can get further comfort that these investments are fueling the next phase of the growth story for 2018 and beyond with margin improvement set to kick in for 2019,\" Ives said.\nMany analysts are very bullish on Facebook's prospects in 2018, but there are some concerns. Michael Nathanson, an analyst at Wall Street firm MoffettNathanson, outlined some reasons why Facebook's stock could go lower in 2018 .\nIn a note last month, Nathanson said that its video strategy still remains a mystery, and that there is still a \"major question mark\" over whether Facebook can monetize its other platforms like WhatsApp and Messenger. With Wall Street overwhelmingly positive on the stock, any hiccup in growth could make a downside reaction amplified, according to Nathanson.", "external_links": [], "published": "2018-01-12T14:48:00.000+02:00", "crawled": "2018-01-12T14:01:11.021+02:00", "highlightTitle": ""}