{"organizations": [], "uuid": "5f16574f79b4f27b66dac86e408e27dbd3e18d77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-7-brent-crude-settles-below-70barrel-as-global-inventories-tighten.html", "country": "US", "domain_rank": 767, "title": "UPDATE 7-Brent crude settles below $70/barrel as global inventories tighten", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:05:00.000+02:00", "replies_count": 0, "uuid": "5f16574f79b4f27b66dac86e408e27dbd3e18d77"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-update-7-brent-crude-settles-below-70barrel-as-global-inventories-tighten.html", "ord_in_thread": 0, "title": "UPDATE 7-Brent crude settles below $70/barrel as global inventories tighten", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Prices end below $70\n* U.S. crude stocks at three-year low\n* Oil's rise helped by weak dollar\n* UAE says OPEC still committed to output cuts\n* Maintaining $70 Brent may be difficult - analyst (New throughout, updates prices, market activity and comments to settlement)\nHOUSTON, Jan 11 (Reuters) - Oil prices retreated from big gains on Thursday, but still managed to settle at three-year highs after the global Brent benchmark hit $70 a barrel on signs of tightening supply in the United States.\nBrent crude futures settled 6 cents higher at $69.26 a barrel, after hitting $70.05 a barrel during the session, its highest level since November 2014. Brent's settlement still represents a three-year closing high.\nBrent has gained 5 percent since the beginning of the year, picking up from its late-year surge.\nU.S. West Texas Intermediate (WTI) crude futures settled at $63.80 a barrel, up 23 cents, the highest since December 2014.\nPrices came off highs after an early surge that took benchmarks past key resistance levels that produced a flurry of buying in an active day in the market. However, analysts said it would take more than one day to convincingly break through $70 a barrel on Brent.\n\"The propulsion of the upside was due to short-covering and no buying,\" said Marty Wallace, broker for iitrader.com LLC in Chicago.\nThe relative strength index (RSI), which measures the speed and breadth of a rally, shows oil in an overbought condition, suggesting the move has come too far, too fast.\n\"You have a very overbought market. Oil is acting like an internet stock and when it does that you know its getting overcooked,\" said Walter Zimmerman, chief technical analyst for United-ICAP.\nOil has been in an upward trend thanks to a steady, pronounced drop in global supply, particularly in the United States, the world's largest consumer.\nOn Wednesday, the U.S. Energy Information Administration said crude inventories <C-STK-T-EIA> fell almost 5 million barrels to 419.5 million barrels last week. Production slowed by nearly 300,000 barrels per day, which analysts attributed to colder-than-usual weather across the United States last week.\nAdding to bullish sentiment on Thursday, market intelligence firm Genscape estimated a draw of more than 3.5 million barrels at the Cushing, Oklahoma delivery point for U.S. crude futures for the week ended Tuesday, according to traders who saw the data.\nProduction cuts, led by the Organization of the Petroleum Exporting Countries and Russia, which are set to continue throughout 2018, have underpinned prices.\nThe United Arab Emirates (UAE) Energy Minister and OPEC President Suhail al-Mazrouei said he expects the market to balance in 2018 and that the producer group is committed to its supply-reduction pact until the end of this year.\nThe greenback-denominated commodity has also benefited from weakness in the dollar, which neared a one-week low on Thursday, as it makes oil cheaper to buy for holders of other currencies.\nTrading volumes were higher than average, with a flurry of trades at about 10 a.m. EST as prices jumped. More than 820,000 U.S. crude contracts changed hands on Thursday, far surpassing the daily average of 619,000 contracts over the past 200 days of trading.\nBrent may not be able to sustain a $70 level unless additional news from the Middle East bolstered bullish sentiment, analysts said.\nICE Commitment of Traders figures showed speculators raised their net long holdings of Brent crude futures and options in the week to Jan. 2 to a new record. Heavy bets like this are at risk of being unwound after quick gains.\n(Additional reporting by Libby George in London and Henning Gloystein in Singapore; Editing by Marguerita Choy and Lisa Shumaker)", "external_links": [], "published": "2018-01-11T23:05:00.000+02:00", "crawled": "2018-01-14T00:10:39.002+02:00", "highlightTitle": ""}