{"organizations": [], "uuid": "76e2b13a4cfb4ce123353c53561c896f15765cfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-ufpi-sells-property-in-medley-fla-to-developer-for-more-efficient-operations-use-of-capital.html", "country": "US", "domain_rank": 767, "title": "UFPI sells property in Medley, Fla., to developer for more efficient operations, use of capital", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.19, "site_type": "news", "published": "2018-01-23T00:30:00.000+02:00", "replies_count": 0, "uuid": "76e2b13a4cfb4ce123353c53561c896f15765cfb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-ufpi-sells-property-in-medley-fla-to-developer-for-more-efficient-operations-use-of-capital.html", "ord_in_thread": 0, "title": "UFPI sells property in Medley, Fla., to developer for more efficient operations, use of capital", "locations": [], "entities": {"persons": [{"name": "matthew j. missad", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "medley", "sentiment": "none"}, {"name": "grand rapids", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "ufpi", "sentiment": "negative"}, {"name": "universal forest products, inc.", "sentiment": "neutral"}, {"name": "robbins manufacturing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAND RAPIDS, Mich., Jan. 22, 2018 (GLOBE NEWSWIRE) -- Universal Forest Products, Inc. (NASDAQ:UFPI) today announced that it closed on the sale and lease-back of its property in Medley, Fla., a 35-acre site that includes one of its large operations, as part of a long-term plan to enhance its operations in the region.\nThe move is part of a strategy to create efficiencies and advantages not possible with the current facility by optimizing the capacity of its other three Florida operations, including two it acquired from Robbins Manufacturing in 2017, and adding a state-of-the-art facility in South Florida. The Company will lease back the Medley, Fla., facility as it executes its long-term plan for Florida and the Southeast region.\n“We have an exciting opportunity to sell a valuable piece of property and structure our business in a way that will enhance our logistics, create operational efficiencies and create opportunity for growth in the region that we couldn’t realize with our existing operational structure and facilities,” said CEO Matthew J. Missad. “Our focus on return on investment has us constantly evaluating our assets to deploy them in the most efficient manner, and the sale of the Medley location enables us to be a better, more efficient manufacturer and supplier.”\nThe Company’s Aljoma Lumber affiliate, which Universal acquired in 2007 and operates out of the Medley facility, remains critical to Universal’s growth in the region and to its overall success. It will continue to operate out of the current location until a new site is identified.\nUniversal has great opportunity for growth in South Florida in each of its markets -- retail, construction and industrial. It will continue to serve its Caribbean customers from its Florida and Puerto Rico operations as well.\nUNIVERSAL FOREST PRODUCTS, INC.\nUniversal Forest Products, Inc. is a holding company whose subsidiaries supply wood, wood composite and other products to three robust markets: retail, construction and industrial. Founded in 1955, the Company is headquartered in Grand Rapids, Mich., with affiliates in North America, Australia, Europe and Asia. For more about Universal Forest Products, go to www.ufpi.com .\nThis press release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act, as amended, that are based on management’s beliefs, assumptions, current expectations, estimates and projections about the markets we serve, the economy and the Company itself. Words like “anticipates,” “believes,” “confident,” “estimates,” “expects,” “forecasts,” “likely,” “plans,” “projects,” “should,” variations of such words, and similar expressions identify such forward-looking statements. These statements do not guarantee future performance and involve certain risks, uncertainties and assumptions that are difficult to predict with regard to timing, extent, likelihood and degree of occurrence. The Company does not undertake to update forward-looking statements to reflect facts, circumstances, events, or assumptions that occur after the date the forward-looking statements are made. Actual results could differ materially from those included in such forward-looking statements. Investors are cautioned that all forward-looking statements involve risks and uncertainty. Among the factors that could cause actual results to differ materially from forward-looking statements are the following: fluctuations in the price of lumber; adverse or unusual weather conditions; adverse economic conditions in the markets we serve; government regulations, particularly involving environmental and safety regulations; and our ability to make successful business acquisitions. Certain of these risk factors as well as other risk factors and additional information are included in the Company's reports on Form 10-K and 10-Q on file with the Securities and Exchange Commission.\nLynn Afendoulis\nDirector, Corporate Communications\n(616) 365-1502\nSource:Universal Forest Products, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=oW3m0t1_gpd2dcfWKo_SC_CFdyomlGnrrk2MpmO0xtZyJUOehChSSiEhx_pnZr6e7ps5nyA4is1BddSslPXYIg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9b823f66-ecf5-426a-944f-b71693b51ca0"], "published": "2018-01-23T00:30:00.000+02:00", "crawled": "2018-01-23T02:17:20.028+02:00", "highlightTitle": ""}