{"organizations": [], "uuid": "a7843f3bd8bb3859b8b15311efcb7a8d2516d6e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-turbo-global-partners-announces-name-change-of-wholly-owned-subsidiary-alpha-life-foundation-inc-to-org-america.html", "country": "US", "domain_rank": 767, "title": "Turbo Global Partners Announces Name Change of Wholly-owned Subsidiary Alpha Life Foundation, Inc. to Org America", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.076, "site_type": "news", "published": "2018-01-31T16:30:00.000+02:00", "replies_count": 0, "uuid": "a7843f3bd8bb3859b8b15311efcb7a8d2516d6e7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-turbo-global-partners-announces-name-change-of-wholly-owned-subsidiary-alpha-life-foundation-inc-to-org-america.html", "ord_in_thread": 0, "title": "Turbo Global Partners Announces Name Change of Wholly-owned Subsidiary Alpha Life Foundation, Inc. to Org America", "locations": [], "entities": {"persons": [{"name": "robert w. singerman", "sentiment": "none"}, {"name": "henry marx", "sentiment": "none"}], "locations": [{"name": "org america carson city", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "org america", "sentiment": "none"}], "organizations": [{"name": "subsidiary alpha life foundation, inc.", "sentiment": "neutral"}, {"name": "nv", "sentiment": "neutral"}, {"name": "turbo global partners", "sentiment": "neutral"}, {"name": "org america, inc.", "sentiment": "none"}, {"name": "alpha life foundation, inc.", "sentiment": "none"}, {"name": "trbo", "sentiment": "none"}, {"name": "org america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARSON CITY, NV, Jan. 31, 2018 (GLOBE NEWSWIRE) -- Turbo Global Partners (TRBO) (OTC PINK: TRBO), has announced the name change of the previously reported acquisition of Alpha Life Foundation, Inc. (ALPHA) a California 501 (c) (3) domestic nonprofit, to Org America, Inc.\n“This is yet again an exciting milestone for TRBO,” states Robert W. Singerman, TRBO’s Chairman & CEO. He continues, “The name change of our previously reported acquisition of ALPHA to Org America fits our strategy of tactical acquisitions that can maximize the synergies of TRBO. We are confident the new name of Org America will resonate to the growing non-profit sector. Our core objectives of Org America are to help non-profits better communicate their stories, better engage their target audiences and generate new found revenues with our mobile pledge campaigns and digital marketing strategies. We believe every non-profit, large or small can benefit from our full-spectrum Web-television Telethon expertise.”\nHenry Marx, Org America’s CEO, agrees, “We are excited to change the name to Org America effective February 1, 2018. As a wholly-owned subsidiary of TRBO, we will be able to access the synergies within the TRBO offerings to catapult our reach to the next level and better showcase our work, which since 2000, has spanned charitable giving initiatives for pets to cancer awareness, autism to community advocacy.”\nSingerman explains, “We previously stated we already are innovators in the non-profit arena with our portal www.OrgAmerica.org where currently we present two (2) Web-television Telethons spotlighting global non-profits produced by Turbo Communications, Inc., our wholly-owned subsidiary. Changing the name of ALPHA to Org America is an evolution of our revolution. And the non-profit sector is huge and growing. According to the GuideStar USA ( www.GuideStar.org ), their database has information on more than 2.2 million nonprofits in the United States; more than 1.8 million are active organizations, a tremendous market for TRBO and Org America to pursue that will generate long-term predictable renewable cash-flow for our client non-profits and TRBO.”\nStatements made in this press release that express the Company or management's intentions, plans, beliefs, expectations or predictions of future events, are . The words \"believe,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"will\" and similar expressions are intended to further identify such , although not all contain these identifying words. Those statements are based on many assumptions and are subject to many known and unknown risks, uncertainties and other factors that could cause the Company's actual activities, results or performance to differ materially from those anticipated or projected in such . The Company cannot guarantee future financial results; levels of activity, performance or achievements and investors should not place undue reliance on the Company's . No information contained in this press release should be construed as any indication whatsoever of the Company's future financial performance, future revenues or its future stock price. The contained herein represent the judgment of the Company as of the date of this press release, and the Company expressly disclaims any intent, obligation or undertaking to update or revise such to reflect any change in the Company's expectations with regard thereto or any change in events, conditions or circumstances on which any such statements are based.\nhttp://www.TurboGlobalPartners.com\nTurbo Global Partners, Inc. Robert W Singerman, Chairman and CEO Direct / +1(888) 502-8666 Fax / +1(888) 909-7213\nSource:Turbo Global Partners, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=NDnXGMGrYGxkWbJYDJKLX0BhE9gZZzRqlPa6hvSgh4QDTpl0h8wcbJa7LpZ8vUYavLR8DkEbl8MobvtmAlvYICSCXWv6jfEzRcTKpl0dLUQ=", "https://www.globenewswire.com/Tracker?data=yuc_wXHMzmK_EMyVwzmPi5tioS0UrFMn2YjVWadqMFGtwsarGqjL7UzbmPs9bE5DboZjKhvuNuDJlkOPqM3sWiI7cegQBDdNNtgupOVW09M=", "https://www.globenewswire.com/Tracker?data=O0aUSELxUAMoY1frX7-_O8a3gg96396WxJo90CFHTYgcSbkSqCVj6CTbvHKjP5DqArVtHEYP_M3VH7kLo7cMTw=="], "published": "2018-01-31T16:30:00.000+02:00", "crawled": "2018-01-31T17:52:31.016+02:00", "highlightTitle": ""}