{"organizations": [], "uuid": "035f99bdefcad4172040c143c9c1413c4c224544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226615967&w=1200&r=LYNXMPEE0T0YT", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ecb-board/ireland-to-nominate-central-bank-chief-lane-for-ecb-vice-president-source-idUKKBN1FJ1X7", "country": "US", "domain_rank": 408, "title": "Ireland to nominate Central Bank chief Lane for ECB vice president - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:59:00.000+02:00", "replies_count": 0, "uuid": "035f99bdefcad4172040c143c9c1413c4c224544"}, "author": "", "url": "https://uk.reuters.com/article/uk-ecb-board/ireland-to-nominate-central-bank-chief-lane-for-ecb-vice-president-source-idUKKBN1FJ1X7", "ord_in_thread": 0, "title": "Ireland to nominate Central Bank chief Lane for ECB vice president - source", "locations": [], "entities": {"persons": [{"name": "lane", "sentiment": "negative"}, {"name": "louise heavens", "sentiment": "none"}, {"name": "luis de guindos", "sentiment": "none"}, {"name": "philip lane", "sentiment": "none"}, {"name": "vitor constancio", "sentiment": "none"}, {"name": "padraic halpin", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "central bank", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:00 PM / Updated 25 minutes ago Ireland fires first shot in race for top ECB jobs Padraic Halpin 5 Min Read \nDUBLIN (Reuters) - Ireland nominated its central bank governor Philip Lane for the post of European Central Bank vice president on Tuesday, the first shot in a high-stakes battle for the role that could foreshadow the tussle for the ECB’s top job. \nThe number two job is currently held by Portugal’s Vitor Constancio, whose eight-year term ends in May. \nEuro zone finance ministers launched the process of choosing his replacement last week, kicking off two years of significant change on the six-member executive board of the ECB, one of Europe’s most important institutions. \nThe decision is being closely watched by investors because it could end up influencing the race to replace ECB President Mario Draghi in 2019. \nSpanish Economy Minister Luis de Guindos has long been considered the favourite for the job of vice president. \nBut some southern euro zone members may welcome Lane’s nomination because they believe de Guindos aligned himself too closely with hardline German positions in recent years. \nCountries like France may also fear the appointment of a Spaniard to the number two post would strengthen the chances of a northern European candidate such as Bundesbank President Jens Weidmann in the race to replace Draghi. \nWere Ireland to get the vice president’s job, its first seat on the ECB’s board since the euro’s inception in 1999, it could shake up the north-south dynamic, opening up the contest for the coveted post of ECB chief. \nEuropean governments can present their candidates for the vice presidency until Feb. 7 and euro zone finance ministers will vote on Feb. 19, ahead of a European Parliament hearing and final appointment by EU leaders. \nIrish Finance Minister Paschal Donohoe confirmed Lane’s nomination on Tuesday, calling the 48-year-old Harvard-educated economist and former Trinity College, Dublin professor “eminently qualified” for the post. \n“I have already received indications of support from my colleagues but of course all my colleagues will wait and see who all the candidates are,” Donohoe told a news conference. \nHe said that if Lane were not successful, the government would assess its options for future ECB roles at another time. \nUntil recently Lane, who was appointed to a seven-year term as governor of Ireland’s central bank in October 2015, had been mentioned as a possible candidate to replace Peter Praet as ECB Chief Economist, another board position, in 2019. \nIf he were to get the number two job, he could in theory take on the additional role of chief economist when Praet leaves, but European officials said juggling both positions might prove difficult in practice. \nDraghi, Praet and Frenchman Benoit Coeure, also a board member, will all see their terms end next year. That promises to create a great deal of uncertainty at a time when the ECB is beginning to unwind years of ultra-loose monetary policy, including its controversial quantitative easing (QE) programme. \nIn evaluating a de Guindos candidacy, some ECB officials have privately expressed concern that European governments could end up packing the board with politicians, rather than experienced economists and central bankers. \nSylvie Goulard, a former member of the European Parliament, was named deputy governor of the Bank of France earlier this month, and is seen as a possible contender to replace Coeure. \n“One politician on the board is fine, but if you get two or more that could be seen as a problem,” one central bank official told Reuters. \nFurther complicating the debate over the vice presidency are demands from the European Parliament that governments put forward women candidates as well as men. \nCurrently, there are just two women on the ECB’s 25-member governing council and one on the six-member board. Related Coverage Ireland says already has some support for Lane ECB candidacy \nEuro zone officials noted on Tuesday that Spain had not formally put forward de Guindos as a candidate yet. Some speculated that Prime Minister Mariano Rajoy could nominate a woman instead if he senses that support for his economy minister is lacking. \n“Let’s wait and see who puts their name forward to replace Constancio. Then we can judge based on the merits of the candidates,” a French finance ministry official said after Lane’s nomination. \nThere are no doubts about Lane’s qualifications. He has acted as an academic consultant for the European Commission, International Monetary Fund, World Bank and a number of central banks, including the ECB. \nMore recently he spearheaded a taskforce in Frankfurt working on a new “safe asset” aimed at breaking a vicious circle of lending by banks to their national governments. Reporting by Padraic Halpin; Additional reporting by Noah Barkin in Berlin, Jan Strupczewski and Alastair Macdonald in Brussels, and Michel Rose in Paris; Editing by Catherine Evans", "external_links": [], "published": "2018-01-30T15:59:00.000+02:00", "crawled": "2018-01-30T16:33:37.035+02:00", "highlightTitle": ""}