{"organizations": [], "uuid": "20adce7193927ef90387f0c15b61f202c80eff3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221834736&w=1200&r=LYNXMPEE0D02E", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-figureskating-canchamps/figure-skating-chan-and-daleman-win-at-canadian-titles-as-olympics-loom-idUSKBN1F303V", "country": "US", "domain_rank": 408, "title": "Figure skating: Chan and Daleman win at Canadian titles as Olympics loom", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T06:27:00.000+02:00", "replies_count": 0, "uuid": "20adce7193927ef90387f0c15b61f202c80eff3e"}, "author": "", "url": "https://www.reuters.com/article/us-figureskating-canchamps/figure-skating-chan-and-daleman-win-at-canadian-titles-as-olympics-loom-idUSKBN1F303V", "ord_in_thread": 0, "title": "Figure skating: Chan and Daleman win at Canadian titles as Olympics loom", "locations": [], "entities": {"persons": [{"name": "daleman", "sentiment": "negative"}, {"name": "chan", "sentiment": "negative"}, {"name": "gabrielle daleman", "sentiment": "none"}, {"name": "tessa virtue", "sentiment": "none"}, {"name": "meagan duhamel", "sentiment": "none"}, {"name": "daleman pro", "sentiment": "none"}, {"name": "patrick chan", "sentiment": "none"}, {"name": "scott moir", "sentiment": "none"}, {"name": "eric radford", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "moulin rouge", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Patrick Chan won the Canadian figure skating championships men’s title for the 10th time on Saturday, while Gabrielle Daleman celebrated her 20th birthday by winning the women’s competition.\nTessa Virtue and Scott Moir won the ice dance with a steamy performance to the music of Moulin Rouge in Vancouver, while Meagan Duhamel and Eric Radford won the pairs.\nThree-times world champion Chan was not at his best, but did enough to prevail with a score of 274.24 points.\n”I won my first senior title (here). I’ve won my 10th here again and I want to live here,“ Chan said in a rink-side interview. ”What a way to kick it off.\n“Today was not the dream skate I imagine but when you look at every champion in every sport, it’s up and downs that create champions and how you weather the storms, weather the challenges.”\nChan won silver in Sochi four years ago and has said he felt overthinking the experience had hampered him.\nDaleman produced a brilliant free skate to finish with a Canadian record score of 229.78 points and edge Kaetlyn Osmond, who is still expected to start as one of the favourites next month after winning silver at last year’s world championships.\nJan 13, 2018; Vancouver, British Columbia, CAN; Patrick Chan skates in the Mens free program at Doug Mitchell Thunderbird Sports Centre. Mandatory Credit: Anne-Marie Sorvin-USA TODAY Sports “Hopefully the frustration I feel here will motivate me for the next month,” said Osmond.\nDaleman will head to Pyeongchang brimming with confidence.\n“You’re competing against number two in the world. This means the absolute world to me going into an Olympic year,” she told reporters.\nIn the ice dance, Virtue and Moir’s eighth national title was highlighted by their performance to Moulin Rouge, which they hope will provide a difference in Pyeongchang.\n“I think edgy would probably summarize most of the program quite well and that’s what we were going for,” Virtue said.\n”We knew that taking the ice at an Olympic Games again meant that we needed to have a different style.\n“If that was bringing an edge or sexuality or darkness, or a contemporary feel to it, then mission accomplished I guess.”\nVirtue and Moir won gold in Vancouver in 2010 before taking silver in Sochi then retired but launched a comeback last year.\nReporting by Andrew Both in Cary, North Carolina; Editing by Greg Stutchbury\n ", "external_links": [], "published": "2018-01-14T06:27:00.000+02:00", "crawled": "2018-01-14T06:37:39.002+02:00", "highlightTitle": ""}