{"organizations": [], "uuid": "e9adf7b097d0b0f538f9f0b59d7ee3e5b9173fb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224342453&w=1200&r=LYNXMPEE0L20R", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-davos-meeting-confidence/optimism-booms-among-davos-ceos-despite-geopolitical-storm-clouds-idUKKBN1FB2FK", "country": "US", "domain_rank": 408, "title": "Optimism booms among Davos CEOs despite geopolitical storm clouds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T05:14:00.000+02:00", "replies_count": 0, "uuid": "e9adf7b097d0b0f538f9f0b59d7ee3e5b9173fb0"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-confidence/optimism-booms-among-davos-ceos-despite-geopolitical-storm-clouds-idUKKBN1FB2FK", "ord_in_thread": 0, "title": "Optimism booms among Davos CEOs despite geopolitical storm clouds", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "noah barkin", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:37 PM / Updated an hour ago Optimism booms among Davos CEOs despite geopolitical storm clouds Noah Barkin 4 Min Read \nDAVOS, Switzerland (Reuters) - Chief executives are more optimistic about the economic outlook than they have been for many years although anxieties are rising about geopolitics, cyber threats and terrorism, a survey showed on the eve of the World Economic Forum (WEF) in Davos. \nThe PwC survey of nearly 1,300 CEOs found that 57 percent expect global growth to improve in 2018, almost twice the level of last year and the largest increase since the survey began in 2012. \nThe optimism was especially strong in the United States after a year of robust growth, deregulation and tax cuts under President Donald Trump. \nSome 59 percent of U.S. CEOs expressed confidence in the economy, compared to 24 percent last year, and 52 percent said they expected this to translate into revenue growth for their companies in 2018, up from 39 percent. \n“With the stock markets booming and GDP predicted to grow in most major markets around the world, it’s no surprise CEOs are so bullish,” said Bob Moritz, global chairman at PwC. \nBut the optimism over the one-year outlook masked deepening anxiety over a range of societal threats. \nAt least 40 percent of CEOs admitted to being “extremely concerned” about geopolitical uncertainty, cyber threats and terrorism, while 31 percent worried about climate change after a year of devastating storms. \nLast week, the WEF’s Global Risks Report pointed to rising concerns about war after a year in which Trump threatened to “totally destroy” nuclear power North Korea and pull the U.S. out of a deal between Western powers and Iran aimed at curbing its nuclear programme. \n“The higher level of concern is being driven by larger societal and geopolitical shifts rather than the dynamics of business leaders’ own markets” said Moritz. RECORD RALLY \nA decade after the bankruptcy of U.S. investment bank Lehman Brothers helped trigger a global financial crisis that plunged economies into recession, growth is accelerating and stock markets are setting new records. \nLast week, the Dow Jones Industrial Average pushed above the 26,000 mark for the first time on optimism over company earnings in the aftermath of the U.S. tax overhaul, which will push the corporate tax rate down to 21 percent from 35 percent. \nTrump is expected to laud his tax plan in a speech on the final day of the WEF, which runs from Jan. 23-26 under the banner “Creating a Shared Future in a Fractured World”. \nAsked to pick their most important foreign market for growth, CEOs chose the United States, ahead of China, Germany, the United Kingdom and India in that order. \nWhile the UK held steady in that ranking, its plans to exit the European Union appear to be affecting how business leaders in the country view prospects for their own companies. \nJust 34 percent of CEOs in Britain said they were confident about delivering revenue growth in 2018, down from 41 percent in 2017 and against the broader trend. \nOn a sectoral basis, technology, business services and pharmaceutical companies were most bullish. \nThe survey showed that CEOs had different views on the main threats to growth depending on where they came from. In the United States, cyber attacks topped the list of concerns, while in Europe populism was the chief worry and in the Asia-Pacific region it was skills shortages. \nThe PwC survey was based on interviews with 1,293 CEOs in 85 countries between August and November 2017. Reporting by Noah Barkin; Editing by Catherine Evans", "external_links": [], "published": "2018-01-23T05:14:00.000+02:00", "crawled": "2018-01-23T05:35:27.067+02:00", "highlightTitle": ""}