{"organizations": [], "uuid": "c69658fcfb294ab4fc8bc41ff794a83606c3ce6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227004914&w=1200&r=LYNXMPEE0U1B3", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/bp-gas/bp-expects-gas-to-overtake-oil-as-main-energy-source-in-2040-idINKBN1FK2FT", "country": "US", "domain_rank": 408, "title": "BP expects gas to overtake oil as main energy source in 2040", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:46:00.000+02:00", "replies_count": 0, "uuid": "c69658fcfb294ab4fc8bc41ff794a83606c3ce6a"}, "author": "", "url": "https://in.reuters.com/article/bp-gas/bp-expects-gas-to-overtake-oil-as-main-energy-source-in-2040-idINKBN1FK2FT", "ord_in_thread": 0, "title": "BP expects gas to overtake oil as main energy source in 2040", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA (Reuters) - BP expects gas to overtake oil as the world’s primary energy source in around 2040 as demand for the least polluting fossil fuel grows, its vice president for strategic planning said on Wednesday.\n“We see it (gas) take over from coal in the early 2030s... We think there is a very good case for gas actually overtaking oil post 2040 or just before 2040,” Dominic Emery told a gas conference in Vienna.\nEmery highlighted estimates for demand growth for gas in China of around 15 percent year-on-year last year and said BP expects overall gas demand to grow around 1.6 percent a year for years to come, compared with 0.8 percent for oil.\n“We do see a very strong chance that (gas) is going to be the largest source of primary energy into the future... By gas we mean natural gas, but also ... we mean biogas, we mean biomethane, we mean power-to-gas...”\nIn terms of demand for gas from different sectors, Emery singled out industry as especially resilient and transport as fast-growing, albeit from a low base, at annual rates of three to four percent.\nBP is due to reveal more details in its next energy outlook on Feb. 20. In its last outlook it said it saw gas overtaking coal’s share in the primary energy market to become the second-largest fuel source by 2035.\nBP’s previous forecast to 2035 forecast oil’s share shrinking from around 33 percent to around 30 percent and gas’ share grow from the low 20s to the mid 20-percentage range.\nEmery said one of the biggest challenges for the gas industry was reducing methane leakages from pipelines, which he said was estimated at around 1.3 to 1.4 percent.\n“Once (methane leakage) exceeds 3 percent it means that gas, certainly in the nearer term, over a few decades, is actually worse than coal from a (greenhouse gas) perspective,” he said.\n“We’re getting a lot of pressure..., and rightly so, to get our act together in terms of managing methane in the supply chain. There are not only climate benefits for doing it but also economic benefits from doing it.”\nReporting by Shadia Nasralla; editing by Alexander Smith\n ", "external_links": [], "published": "2018-01-31T18:46:00.000+02:00", "crawled": "2018-01-31T19:01:00.005+02:00", "highlightTitle": ""}