{"organizations": [], "uuid": "a1d41a4c027b7e3e9296efb8d80d6b65ed49de5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968853-GettyImages-93151189.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/cramer-never-buy-a-stock-all-at-once-youll-get-burned.html", "country": "US", "domain_rank": 767, "title": "Cramer: Never buy a stock all at once—you'll get burned", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:35:00.000+02:00", "replies_count": 0, "uuid": "a1d41a4c027b7e3e9296efb8d80d6b65ed49de5d"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/25/cramer-never-buy-a-stock-all-at-once-youll-get-burned.html", "ord_in_thread": 0, "title": "Cramer: Never buy a stock all at once—you'll get burned", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "At the end of the day, CNBC's Jim Cramer knows investors are only human.\nThat's why the \" Mad Money \" host has come up with a set of investing rules to help guide them through the emotion and the fallibility that can come with being involved in stocks.\nOne of Cramer's most important rules has to do with buying stocks.\n\"This is a real important one: never buy a stock all at once,\" Cramer said. \"I can't stress it enough: do not, under any circumstances, buy all at once.\"\nPlenty of Wall Street brokers and advisors prefer not to deal with partial orders or buying a stock gradually over time. They like to go in big and make a statement with their purchases.\n\"From where I stand, that's all wrong — 100 percent wrong,\" the \"Mad Money\" host said. \"What I want you to do is stage your buys. Stage your sells. The term we use on Wall Street is 'Work your orders.' Try to get the best price over time, and not necessarily in one day. Maybe multiple days.\"\nCramer remembers how he learned this lesson when he started as a money manager. He wanted to prove how smart he was, so he bought 50,000 shares of Caterpillar's stock.\nLooking back, Cramer saw that as a really dumb bet.\n\"All I can say is that I was one arrogant son of a gun. I was arrogant and I was wrong,\" he said. \"I should've been buying CAT in increments of 5,000 shares.\"\nThis strategy would've insured that Cramer got the stock he wanted at the best price he could get, instead of going in big and hoping Caterpillar wouldn't immediately go down.\nToday, Cramer runs his charitable trust the same way: Whenever he chooses a new name to buy, he buys 500 shares at a time or less over the course of a few days.\n\"When you buy all at once, you're basically declaring that the stock absolutely won't go any lower,\" the \"Mad Money\" host said. \"Don't you think that's crazy when I say it? No one has that kind of insight. Buying gradually, in stages, is all about recognizing that our judgment is fallible.\"\nBuying shares of a stock shouldn't be about making a statement, he added. If you resist the arrogance and buy slowly, you'll be more organized, less emotional and better off as an investor.\n\"Humility beats hubris every time,\" Cramer said. \"If you take your time, you're much less likely to end up with a large quantity of broken merchandise.\"\nWATCH: Why Cramer never buys stocks all at once show chapters Cramer: Never buy a stock all at once — you'll almost definitely get burned 19 Hours Ago | 06:29 ", "external_links": [], "published": "2018-01-26T01:35:00.000+02:00", "crawled": "2018-01-26T01:49:28.025+02:00", "highlightTitle": ""}