{"organizations": [], "uuid": "8b987797460bf2f1f4065a197206ad7f2eb58153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222170631&w=1200&r=LYNXMPEE0E12Z", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-argentina-grains-weather/some-drought-hit-parts-of-argentinas-soy-belt-relieved-by-rain-idUSKBN1F41WL", "country": "US", "domain_rank": 408, "title": "Some drought-hit parts of Argentina's soy belt relieved by rain", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-15T22:54:00.000+02:00", "replies_count": 0, "uuid": "8b987797460bf2f1f4065a197206ad7f2eb58153"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-argentina-grains-weather/some-drought-hit-parts-of-argentinas-soy-belt-relieved-by-rain-idUSKBN1F41WL", "ord_in_thread": 0, "title": "Some drought-hit parts of Argentina's soy belt relieved by rain", "locations": [], "entities": {"persons": [{"name": "fernando meoli", "sentiment": "none"}, {"name": "gattinoni", "sentiment": "none"}, {"name": "natalia gattinoni", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "cordoba", "sentiment": "none"}, {"name": "junin", "sentiment": "none"}, {"name": "buenos aires", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "buenos aires", "sentiment": "negative"}, {"name": "inta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUENOS AIRES (Reuters) - Rain over the weekend in drought-hit areas of Argentina’s farm belt helped growers plant soy in fields that had been at risk of staying barren this season, Natalia Gattinoni, weather expert with the INTA national climate institute, said on Monday.\nFarmers have been worried that excessively dry conditions in the northern part of the bread-basket province of Buenos Aires would persist, blocking them from planting soy in some areas.\n“In the central and northern part of the country there were wide but inconsistent rains. Some areas got an important amount of rain while others did not,” Gattinoni said.\nFor example, parts of Cordoba province and the key area Junin in northern Buenos Aires got more than 50 millimeters of rain, she added.\nGrowers further south were not as lucky, but southern Buenos Aires province was not as hard hit by drought.\n“It rained quite a bit in the northern part of the country over the weekend. It did not rain here but we had already planted all the soy we planned to sow,” said Fernando Meoli, a farmer in 9 de Julio and 25 de Mayo in the southern part of Argentina’s main Pampas farm belt.\nMeoli said his area got 20 millimeters of rain during the previous weekend, which allowed him to finish sowing last week.\nHe says the region’s soy plants will be in a delicate stage of development early next month, requiring more ground moisture.\n“The key to getting good soy yields will be how much rain falls in the first ten days of February. If we don’t get good rains, there will be a big impact on soy yields,” Meoli said.\nArgentine farmers will harvest 52 million tonnes of soy in the 2017/18 season, the Rosario grains exchange said last week, citing drought as its reason for cutting its previous forecast of 54.5 million tonnes.\nArgentine soy planting starts around mid-October and usually extends only into the first week of January. The later soy is sown, the higher the risk that early frosts will kill the crop before the May and June harvest months.\nThe Buenos Aires Grains Exchange on Thursday cut its 2017/18 soy planting area estimate to 18 million hectares from a previous 18.1 million, citing dryness in Buenos Aires.\nReporting by Hugh BronsteinEditing by Chizu Nomiyama\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:54:00.000+02:00", "crawled": "2018-01-16T13:17:35.000+02:00", "highlightTitle": ""}