{"organizations": [], "uuid": "6bc1fa691fa0c510e159fbc56fc386ff1e443c49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 98, "shares": 98, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225142941&w=1200&r=LYNXMPEE0O0XK", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-caterpillar-results/caterpillar-profit-beats-estimates-as-sales-surge-35-percent-idUSKBN1FE1QD", "country": "US", "domain_rank": 408, "title": "Caterpillar profit beats estimates as sales surge 35 percent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:48:00.000+02:00", "replies_count": 0, "uuid": "6bc1fa691fa0c510e159fbc56fc386ff1e443c49"}, "author": "", "url": "https://www.reuters.com/article/us-caterpillar-results/caterpillar-profit-beats-estimates-as-sales-surge-35-percent-idUSKBN1FE1QD", "ord_in_thread": 0, "title": "Caterpillar profit beats estimates as sales surge 35 percent", "locations": [], "entities": {"persons": [{"name": "rajesh kumar singh", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "caterpillar inc", "sentiment": "none"}, {"name": "rachit vats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:48 PM / in 7 minutes Caterpillar beats estimates on buoyant global demand Rajesh Kumar Singh , Rachit Vats 3 Min Read \n(Reuters) - Caterpillar Inc’s profit topped Wall Street forecasts for the seventh straight quarter on Thursday as equipment sales surged 35 percent on strong global demand for construction, mining and energy machines. \nThe world’s largest heavy-duty equipment maker, which serves as a bellwether for global economic activity, is benefiting from a global economy that is having its best run since 2011. \nThe biggest sales increase came from North America, its biggest market, led by better demand for construction and on-shore oil & gas machinery. \n“Economic indicators are positive at the moment, and we expect a strong start to 2018,” Chief Executive Officer Jim Umpleby told analysts on a post-earnings conference call. \nThe company expects further improvement in North American residential, non-residential and infrastructure markets. \nIn Asia, it expects Chinese construction demand to remain strong at least through the first half of the new year. \nMeanwhile, rising gold, iron ore and copper prices are expected to improve machine utilization and the demand for aftermarket parts. A rebound in oil prices has renewed investments in the sector and boosted demand for equipment. FILE PHOTO - Caterpillar Inc. equipment is on display for sale at a retail site in San Diego, California, U.S., March 3, 2017. REUTERS/Mike Blake/File Photo \nIt also said the prices it charges customers are staying ahead of material costs. \nThe past year marked a dramatic turnaround for Caterpillar which, weighed down by weak economic conditions and commodity price volatility, saw a more than 40-percent fall in sales between 2012 and 2016. \nThe downturn forced it to consolidate or close more than 30 facilities and reduced the total workforce by 16,000 between 2015 and 2016. The downsizing has led to some concerns that the company might not have enough muscle to meet the growing demand. \n“The challenge will be allocating equipment to inventory while also meeting end-market demand,” said Joe O‘Dea, a machinery analyst at Vertical Research Partners. \nShares in Caterpillar, part of the Dow Jones industrial average, were last up 0.3 percent. The company’s stock has risen around 80 percent in the past year. \nThe company forecast adjusted profit of $8.25 to $9.25 per share for 2018, above analysts’ average estimate of $8.19, according to Thomson Reuters I/B/E/S. \nIn the fourth quarter, in adjusted terms, it made a profit of $2.16 per share. On that basis, analysts had expected $1.79 per share. \nCaterpillar took a $2.4-billion charge related to the recent U.S. tax law, widening its net loss before adjustments to $1.30 billion, or $2.18 per share, from $1.17 billion, or $2.00 per share, a year earlier. Editing by Patrick Graham and Nick Zieminski", "external_links": [], "published": "2018-01-25T14:48:00.000+02:00", "crawled": "2018-01-25T15:04:05.079+02:00", "highlightTitle": ""}