{"organizations": [], "uuid": "acaad95301666a3e98bea8a44c2d3c50ce0017ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-thailand-politics/thailand-charges-nine-in-anti-government-protests-dating-to-2013-idUSKBN1FD0RS", "country": "US", "domain_rank": 408, "title": "Thailand charges nine in anti-government protests dating to 2013", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:13:00.000+02:00", "replies_count": 0, "uuid": "acaad95301666a3e98bea8a44c2d3c50ce0017ac"}, "author": "", "url": "https://www.reuters.com/article/us-thailand-politics/thailand-charges-nine-in-anti-government-protests-dating-to-2013-idUSKBN1FD0RS", "ord_in_thread": 0, "title": "Thailand charges nine in anti-government protests dating to 2013", "locations": [], "entities": {"persons": [{"name": "prayut bejraguna", "sentiment": "none"}, {"name": "thaksin shinawatra", "sentiment": "none"}, {"name": "suthep taugsuban", "sentiment": "none"}, {"name": "yingluck shinawatra", "sentiment": "none"}], "locations": [{"name": "thailand", "sentiment": "none"}, {"name": "yingluck", "sentiment": "none"}, {"name": "suthep", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}], "organizations": [{"name": "pdrc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "people’s democratic reform committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:14 AM / in an hour Thailand charges nine in anti-government protests dating to 2013 Reuters Staff 3 Min Read \nBANGKOK (Reuters) - Thailand on Wednesday charged nine leaders of anti-government protests in 2013 and 2014 with inciting insurrection and sedition in an attempt to oust Yingluck Shinawatra, who was prime minister at the time. \nThe People’s Democratic Reform Committee (PDRC) and its supporters took to the streets for seven months, aiming to rid Thailand of the influence of Yingluck, and her billionaire brother, ousted former premier Thaksin Shinawatra, who had massive support among the rural poor in the north and northeast. \nTheir governments were overthrown in 2014 and 2006 coups respectively. \nNine protest leaders, including Suthep Taugsuban, face eight charges over their roles in the bloody street protests, including insurrection, sedition, and obstructing a 2014 general election, said Prayut Bejraguna, a deputy spokesman for the office of the attorney-general. \nSuthep and one other protest leader also face an additional terrorism charge, Prayut added. \nThe nine men pleaded not guilty to the charges, Suthep told reporters after the court session, adding that each was granted bail of 600,000 baht ($18,969) and barred from traveling overseas until the end of the trial. \n“Whether we are right or wrong, we will fight it out in the justice process...because we believe in Thailand’s justice system,” Suthep said. \n“We will insist on pushing to reform Thailand, no matter at what cost.” \nPrayut said Thailand’s attorney-general planned to file charges against 34 other PDRC leaders who did not show up in court on Wednesday. \nTension has festered in Thailand since the 2006 coup removed Thaksin. Thailand is divided broadly between those backing Thaksin and Yingluck, whose government was ousted in 2014, and the elite in the capital, Bangkok. \nThaksin is credited by some as being the first Thai prime minister to tap into the potential of the rural electorate. But his enemies accuse him of corruption, which he denies. \nThaksin and Yingluck live abroad. Yingluck fled Thailand last August, ahead of a verdict in a negligence trial that eventually found her guilty and handed down a five-year jail term. Thaksin fled to avoid a 2008 jail term for corruption. Reporting by Aukkarapon Niyomyat and Suphanida Thakral; Writing by Patpicha Tanakasempipat; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-24T10:13:00.000+02:00", "crawled": "2018-01-24T10:25:35.002+02:00", "highlightTitle": ""}