{"organizations": [], "uuid": "70b6e19efff82015b61fd33d6382cfa738d5854a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-engie-enters-into-the-capital-of-eps-an-industrial-partner-to-scale-up-globally.html", "country": "US", "domain_rank": 767, "title": "ENGIE Enters into the Capital of EPS: an Industrial Partner to Scale up Globally", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-24T19:58:00.000+02:00", "replies_count": 0, "uuid": "70b6e19efff82015b61fd33d6382cfa738d5854a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-engie-enters-into-the-capital-of-eps-an-industrial-partner-to-scale-up-globally.html", "ord_in_thread": 0, "title": "ENGIE Enters into the Capital of EPS: an Industrial Partner to Scale up Globally", "locations": [], "entities": {"persons": [{"name": "isabelle kocher", "sentiment": "none"}, {"name": "ersel", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "engie", "sentiment": "none"}], "organizations": [{"name": "scale up globally paris & milan", "sentiment": "negative"}, {"name": "electro power systems s.a.", "sentiment": "negative"}, {"name": "prima industrie", "sentiment": "none"}, {"name": "euronext paris", "sentiment": "none"}, {"name": "capital partners", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS & MILAN--(BUSINESS WIRE)--\nRegulatory News:\nElectro Power Systems S.A. (“ EPS ”), (Paris:EPS) technology pioneer in energy storage systems and microgrids, listed on the French-regulated market Euronext Paris (EPS:FP), announces today the signing by ENGIE of a share purchase agreement with its main shareholders (360 Capital Partners, Ersel and Prima Industrie), to acquire a majority stake of EPS slightly above 50% of the share capital and voting rights. In order to achieve that threshold, the agreement also involves the members of the Board of Directors and the management team. A new retention and long-term incentive plan has been set-up, to secure and strengthen the full commitment of the management team until 2021, linked to the development of the company.\nENGIE, headquartered in Paris, is one the largest global utilities, active in around 70 countries, employs 150,000 people worldwide and achieved revenues of €66.6 billion in 2016. The French group led by Isabelle Kocher is committed to taking on the major challenges of the energy revolution, towards a world more decarbonised, decentralised and digitalised. ENGIE is listed on the Paris and Brussels stock exchanges and is represented in the main financial indices, including CAC 40.\nWith the transaction, a broad industrial partnership to scale up globally, both companies aim at further accelerating their vision to be at the forefront of the energy transition, with special focus on decentralised energy solutions.\nThe transaction is executed at €9,5 per share and will be followed by the filing of a simplified mandatory tender offer at the same price, subject to the fairness opinion of Associé en Finance, the independent expert appointed by EPS according to the article 261-1 I of the General Rules of the AMF General Regulation. ENGIE intends to maintain the listing of the EPS shares at the end of the offer.\n“EPS is a recognized technology provider in the microgrid market with a differentiating control technology and already significant micro-grid installed base, in particular in Africa and Asia Pacific. We sincerely welcome EPS at ENGIE and its highly specialized and sophisticated high-tech teams. Together, we will achieve a major step to become a decentralized energy leader and confirm that energy transition is at the core of the strategy and transformation of ENGIE. With decentralized clean energy, we also bring a key contribution towards more harmonious development” said Shankar Krishnamoorthy, Executive Vice President of ENGIE\nCarlalberto Guglielminotti, Chief Executive Officer and General Manager of EPS commented “This is a transformational step for EPS. We share ENGIE’s strategic vision of a paradigm shift in the energy system towards decentralized energy solutions: in advanced economies renewables are displacing conventional centralized power plants, calling for distributed energy storage to secure flexibility and capacity; thus, value added migrates from traditional energy supply to the delivery of advanced services. In parallel, in emerging economies, storage-enabled renewables open a market of 2.4 billion people reliant on diesel generation. EPS has been delivering one of the largest installed bases of commercial microgrids and utility-scale systems globally: today, our unique technological platform combined with ENGIE’s global reach, establishes a driving force of the energy transition”.\nThe transaction, which is subject to standard condition precedents, shall be completed during the first quarter of 2018.\nThe EPS shareholders have been advised by Lazard and Linklaters.\n* * *\nAbout ENGIE\nENGIE is committed to taking on the major challenges of the energy revolution, towards a world more decarbonised, decentralised and digitalised. The Group aims to become the leader of this new energy world by focusing on three key activities for the future: low carbon generation in particular from natural gas and renewable energy, energy infrastructure and efficient solutions adapted to all its customers (individuals, businesses, territories, etc.). Innovation, digital solutions and customer satisfaction are the guiding principles of ENGIE’s development. ENGIE is active in around 70 countries, employs 150,000 people worldwide and achieved revenues of €66.6 billion in 2016. The Group is listed on the Paris and Brussels stock exchanges (ENGI) and is represented in the main financial indices (CAC 40, BEL 20, DJ Euro Stoxx 50, Euronext 100, FTSE Eurotop 100, MSCI Europe) and non-financial indices (DJSI World, DJSI Europe and Euronext Vigeo Eiris - World 120, Eurozone 120, Europe 120, France 20, CAC 40 Governance).\nAbout ELECTRO POWER SYSTEMS\nElectro Power Systems (EPS) operates in the sustainable energy sector, specialising in storage solutions and microgrids that enable intermittent renewable sources to be transformed into a stable power source. Listed on the French-regulated market Euronext (EPS:FP), EPS is part of the CAC® Mid & Small and the CAC® All-Tradable indices. Its registered office is in Paris and conducts its research, development and manufacturing in Italy. Thanks to technology covered by 125 patents and applications, combined with more than 10 years of R&D, the Group develops utility scale energy storage systems to stabilize electrical grids that are heavily penetrated by renewable sources in developed countries and microgrids in emerging economies to power off-grid areas at a lower cost than fossil fuels. As of 30 June 2017, EPS has installed and has under commissioning an aggregate of 36 large scale projects, including off-grid hybrid systems powered by renewables and energy storage that provides energy to over 165,000 customers every day, with a total capacity output of 47MWh systems in 21 countries worldwide, including Europe, Latin America, Asia and Africa.\n* * *\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005919/en/\nENGIE Press:\nTel. France: +33 (0)1 44 22 24 35\nEmail: engiepress@engie.com\nor\nEPS Press:\nImage Building\ne-mail: Eps@imagebuilding.it\nor\nENGIE Investor relations:\nTel.: +33 (0) 1 44 22 66 29\nEmail: ir@engie.com\nor\nEPS Investor relations:\nEmail: francesca.cocco@eps-mail.com\nSource: Electro Power Systems", "external_links": ["http://www.businesswire.com/news/home/20180124005919/en/"], "published": "2018-01-24T19:58:00.000+02:00", "crawled": "2018-01-24T20:59:28.029+02:00", "highlightTitle": ""}