{"organizations": [], "uuid": "ff38960b5aa64f5c0e487328f9600e48db7586b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221421650&w=1200&r=LYNXMPEE0B0OZ", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-blackrock-results/blackrocks-profit-surges-on-gain-from-new-u-s-tax-laws-idUSKBN1F118R", "country": "US", "domain_rank": 408, "title": "BlackRock's profit surges on gain from new U.S tax laws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:28:00.000+02:00", "replies_count": 0, "uuid": "ff38960b5aa64f5c0e487328f9600e48db7586b8"}, "author": "", "url": "https://www.reuters.com/article/us-blackrock-results/blackrocks-profit-surges-on-gain-from-new-u-s-tax-laws-idUSKBN1F118R", "ord_in_thread": 0, "title": "BlackRock's profit surges on gain from new U.S tax laws", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "blackrock", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "blackrock inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:28 AM / Updated 37 minutes ago BlackRock hits record $6 trillion assets, helped by Trump tax law Trevor Hunnicutt 5 Min Read \nNEW YORK (Reuters) - BlackRock Inc ( BLK.N ) charged past a record $6 trillion in assets, its profit beating Wall Street forecasts, as investors flooded into the relatively low-cost funds of the world’s largest asset manager. \nA new U.S. tax law, which sliced corporate and individual income rates, also helped the company’s results in the fourth quarter ended Dec. 31. BlackRock said on Friday it saw a $1.2 billion tax benefit related to the law and raised its quarterly cash dividend by 15 percent. \n“We’ve been winning more share of wallet,” Chief Executive Larry Fink told Reuters. \n“Fees are really important and are becoming more important.” \nFink said the tax reform was putting more money in his clients’ pockets, which they would need to invest, and that the increased cash could allow him to invest more in the company’s future. He declined to identify such investments but said they were discussed at the company’s board meeting. \nThe New York-based company’s shares were up 2.8 percent at midday. Its shares have gained 47 percent over the last year, including dividends. \n“Just when we thought, after the third-quarter report, things couldn’t get better, it seems that they did,” said Edward Woods, portfolio manager at Bahl & Gaynor Inc, which owns BlackRock shares. \nStrong economic growth, tame inflation and supportive government policies propped up assets in 2017, with most countries’ equity markets recording gains, often at double-digit percentages. \nBlackRock has the largest lineup of exchange-traded funds (ETFs), many of which “passively” track segments of the market at a relatively low fee. Investors’ embrace of those funds caught many of BlackRock’s once-larger competitors flat-footed. \nBlackRock said its iShares ETF business took in $54.8 billion in new money in the quarter, up from $49.3 billion a year earlier. The $367 billion the company took in from investors in 2017 overall was a record, while assets under management expanded to $6.29 trillion. FILE PHOTO: A woman walks next to a BlackRock sign pictured in the Manhattan borough of New York, October 11, 2015. REUTERS/Eduardo Munoz \n“Our view is this acceleration - we saw 18 percent growth rate last year - we think something like that is going to continue for the next couple of years,” said Jennifer Grancio, a managing director at BlackRock focused on the iShares business. \nPortfolio managers at BlackRock who try to beat the market also posted a strong year, with 76 percent of the fund’s actively managed assets in funds ranked in the top half of their Thomson Reuters Lipper category over three years as of November, according to Credit Suisse Group AG ( CSGN.S ). \n“As more funds flow into passive investing, active management should have better performance, and I think that’s what we’re experiencing,” said Fink. “There is a need for passive, there is a need for active.” \nBlackRock shareholders and analysts said they are keeping a close eye on how fast expenses are rising and fees are falling given the demand for lower-fee products. \nGeneral and administration expenses for the quarter rose 26 percent in the quarter to $448 million, compared to the year-ago period. Meanwhile, BlackRock earned an annualized $19.28 for every $10,000 it managed during the quarter, down from $19.51 the prior quarter, excluding cash-like money-market funds, according to Reuters’ calculations. \nFink, whose succession plan has long been subject to speculation, said he has no intention to leave his post. \nBut he added that “we won’t be here forever” and that the company had issued a one-time equity grant “to a small group of senior leaders” that will pay out over five to seven years and is “focused on ensuring the interest of the next-generation leaders, individuals who we believe will play critical roles in BlackRock’s future.” \nBlackRock’s net income surged to $2.3 billion, or $14.07 per share, from $851 million, or $5.13 per share, a year earlier. \nThe company said its effective tax rate would fall to 23 percent, from closer to 30 percent, which could boost its profitability 6 to 7 percent this year, according to Edward D. Jones & Co LP. \nExcluding the benefit from the new tax law, BlackRock earned $6.24 per share. Analysts on average expected the company to earn $6.02 per share, according to Thomson Reuters I/B/E/S. Reporting by Trevor Hunnicutt; Additional reporting by Diptendu Lahiri in Bengaluru; Editing by Andrew Hay and Phil Berlowitz", "external_links": [], "published": "2018-01-12T13:28:00.000+02:00", "crawled": "2018-01-12T13:45:20.028+02:00", "highlightTitle": ""}