{"organizations": [], "uuid": "6427aeb38649c7f8d357481fedd4ff83e269d652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-health-cancer-survival/global-cancer-survival-rates-improve-but-wide-gaps-remain-idUKKBN1FJ34N", "country": "US", "domain_rank": 408, "title": "Global cancer survival rates improve, but wide gaps remain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:34:00.000+02:00", "replies_count": 0, "uuid": "6427aeb38649c7f8d357481fedd4ff83e269d652"}, "author": "", "url": "https://uk.reuters.com/article/uk-health-cancer-survival/global-cancer-survival-rates-improve-but-wide-gaps-remain-idUKKBN1FJ34N", "ord_in_thread": 0, "title": "Global cancer survival rates improve, but wide gaps remain", "locations": [], "entities": {"persons": [{"name": "kate kelland", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "global", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 11:34 PM / Updated 4 hours ago Global cancer survival rates improve, but wide gaps remain Kate Kelland 3 Min Read \nLONDON (Reuters) - Cancer patients’ survival prospects are improving, even for some of the deadliest types such as lung cancer, but there are huge disparities between countries, particularly for children, according to a study published on Wednesday. \nIn the most up-to-date study of cancer survival trends - between 2010 and 2014 - covering countries that are home to two-thirds of the world’s people, researchers found some significant progress, but also wide variations. \nWhile brain tumour survival in children has improved in many countries, the study showed that for children diagnosed as recently as 2014, five-year survival is twice as high in Denmark and Sweden, at around 80 percent, as it is in Mexico and Brazil, at less than 40 percent. \nThis gap was most likely due to variations in the availability and quality of cancer diagnosis and treatment services, the researchers said. \n“Despite improvements in awareness, services and treatments, cancer still kills more than 100,000 children every year worldwide,” said Michel Coleman, a professor at the London School of Hygiene & Tropical Medicine who co-led the research. \n“If we are to ensure that more children survive cancer for longer, we need reliable data on the cost and effectiveness of health services in all countries, to compare the impact of strategies in managing childhood cancer.” BREAST CANCER \nFor the research, known as the CONCORD-3 study and published in The Lancet medical journal, the scientists analysed patient records from 322 cancer registries in 71 countries and territories, comparing five-year survival rates for 18 common cancers for more than 37.5 million adults and children. \nFor most cancers over the past 15 years, survival is highest in just a few wealthy countries - the United States, Canada, Australia, New Zealand, Finland, Norway, Iceland and Sweden. \nFor women diagnosed with breast cancer in Australia and the United States between 2010 and 2014 for example, five-year survival is 90 percent. That compares to 66 percent for women diagnosed in India. \nWithin Europe, five-year breast cancer survival increased to at least 85 percent in 16 countries including Britain, compared with 71 percent in Eastern Europe. \nThe researchers noted that in some parts of the world, estimation of survival is limited by incomplete data and by legal or administrative obstacles to updating the cancer records with a patient’s date of death. In Africa, they said, as many as 40 percent of patient records did not have full follow-up data, so survival trends could not be systematically assessed. Reporting by Kate Kelland; editing by Ralph Boulton", "external_links": [], "published": "2018-01-31T01:34:00.000+02:00", "crawled": "2018-01-31T01:50:25.026+02:00", "highlightTitle": ""}