{"organizations": [], "uuid": "8aed5fffb88d10da557be45035ae9b1f9f9283da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225614953&w=1200&r=LYNXMPEE0P1DK", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-handball-europe-fra-esp/big-guns-silenced-as-spain-sweden-reach-euro-handball-final-idUSKBN1FF2WY", "country": "US", "domain_rank": 408, "title": "Big guns silenced as Spain, Sweden reach Euro handball final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:32:00.000+02:00", "replies_count": 0, "uuid": "8aed5fffb88d10da557be45035ae9b1f9f9283da"}, "author": "", "url": "https://www.reuters.com/article/us-handball-europe-fra-esp/big-guns-silenced-as-spain-sweden-reach-euro-handball-final-idUSKBN1FF2WY", "ord_in_thread": 0, "title": "Big guns silenced as Spain, Sweden reach Euro handball final", "locations": [], "entities": {"persons": [{"name": "perez de vargas", "sentiment": "none"}, {"name": "nikola karabatic", "sentiment": "none"}, {"name": "arpad sterbik", "sentiment": "none"}, {"name": "andreas palicka", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "zagreb arena", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "min read  zagreb", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 10:37 PM / Updated 6 hours ago Big guns silenced as Spain, Sweden reach Euro handball final Reuters Staff 2 Min Read \nZAGREB (Reuters) - Both favorites were knocked out of the European handball championship semi-finals on Friday as Spain beat world champions France 27-23 and Sweden edged Olympic title holders Denmark 35-34 after extra time. \nGoalkeepers took center stage in both games as Spain’s Arpad Sterbik, called up as a late replacement for the injured first-choice Perez de Vargas, stopped three penalties while Sweden’s Andreas Palicka racked up a barrage of saves. \nFrance and Denmark will meet in the bronze medal match on Sunday before Spain, who are aiming for their first European title after four silver medals, meet former quadruple champions Sweden in the imposing Zagreb Arena. \nA normally prolific French attack was stifled by Spain’s steely defense which gave playmaker Nikola Karabatic no room to operate and with the supply routes cut off, France trailed 15-9 at halftime. Handball - Men's EHF European Handball Championship - semi-final - Denmark v Sweden - Arena Zagreb, Zagreb, Croatia - January 26, 2018. Sweden's team reacts after the match. REUTERS/Marko Djurica \nSpain appeared to have wrapped up the match when they carved out a staggering 23-14 lead midway through the second half, but France then produced their best spell of the contest as they scored six unanswered goals. \nSpain held their nerve in the closing stages though and romped into the final on the back of seven goals from right wing Ferran Sole and six from center back Raul Entrerrios. Slideshow (4 Images) \nSweden prevailed in an epic Scandinavian derby after taking a body blow on the buzzer, when livewire Denmark winger Lasse Svan netted to force extra time and seemingly shift the momentum his team’s way. \nSweden had led throughout regular time and showed remarkable composure to regain the advantage in the additional 10 minutes, with Palicka frustrating the Danes whenever they looked likely to turn the tide. \nDenmark’s backs Mikkel Hansen and Rasmus Lauge topped the scoring with 12 and 11 goals respectively, but their valiant effort fells short against a more balanced Swedish outfit. Writing by Zoran Milosavljevic in Belgrade; Editing by Pritha Sarkar", "external_links": [], "published": "2018-01-27T00:32:00.000+02:00", "crawled": "2018-01-27T01:15:54.003+02:00", "highlightTitle": ""}