{"organizations": [], "uuid": "3c12db9b09562f9c6f5ef45fe6fd9b7b3c61611f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUSL8N1P61KJ", "country": "US", "domain_rank": 408, "title": "French retailers sold Lactalis baby milk after salmonella recall", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.087, "site_type": "news", "published": "2018-01-11T17:07:00.000+02:00", "replies_count": 0, "uuid": "3c12db9b09562f9c6f5ef45fe6fd9b7b3c61611f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUSL8N1P61KJ", "ord_in_thread": 0, "title": "French retailers sold Lactalis baby milk after salmonella recall", "locations": [], "entities": {"persons": [{"name": "desouches", "sentiment": "none"}, {"name": "picot", "sentiment": "none"}, {"name": "thierry desouches", "sentiment": "none"}, {"name": "milumel", "sentiment": "none"}, {"name": "leclerc", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "craon", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "carrefour", "sentiment": "none"}, {"name": "systeme u", "sentiment": "none"}, {"name": "bfm tv", "sentiment": "none"}, {"name": "dgccrf", "sentiment": "none"}, {"name": "auchan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS, Jan 11 (Reuters) - France’s biggest supermarket chains said they sold some Lactalis baby food products after a recall by the dairy giant over concerns they could be contaminated with salmonella.\nRetailers Carrefour, Leclerc, Auchan and Systeme U independently said products including infant formula remained on their shelves after the recall last December.\nThe product recall affected goods destined for French and overseas markets carrying the Picot, Milumel and Taranis brands and France’s consumer protection agency DGCCRF has begun an investigation and carried out more than 2,000 checks so far.\n“We made mistakes, as did all the big distribution companies,” Systeme U spokesman Thierry Desouches told BFM TV, adding that the recall had been complex and it had done all it could to carry it out quickly.\n“We’re speaking about a volume of products that perhaps earned us a total margin of 300 euros. Would we risk our image for such a derisory amount?” Desouches said on Thursday.\nThe DGCCRF issued a first recall on Dec. 10 after Lactalis discovered salmonella contamination at its Craon factory, halting the sale of several baby food products made there.\nProducts from the Craon plant are suspected by consumer protection authorities of being linked to cases of salmonella infection among infants in France.\nLactalis announced an extension to the recall less than two weeks later, confirming that contamination occurred at Craon during work in the first half of the year.\nIn a statement on Thursday, Carrefour said it had sold 434 products at risk of contamination since the Dec. 21 recall, but that another 95,000 had been successfully removed from shelves.\nLeclerc, France’s biggest food retailer, said it had sold 984 products involved in the recall.\nThe recall included products for export, including to China, Taiwan, Pakistan, Afghanistan, Iraq, Morocco, Lebanon, Sudan, Romania, Serbia, Georgia, Greece, Haiti, Colombia and Peru.\nSome were also destined for regional markets, including Africa and Asia.\nPrivately-held Lactalis is one of the world’s largest dairy companies, with annual sales of around 17 billion euros ($20 billion), and has been expanding its infant nutrition activity although its biggest categories are cheese and liquid milk. ($1 = 0.8378 euros) (Reporting by Richard Lough and Simon Carraud; editing by Dominique Vidalon and Alexander Smith)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T17:07:00.000+02:00", "crawled": "2018-01-12T18:25:32.002+02:00", "highlightTitle": ""}