{"organizations": [], "uuid": "df6043bf59937f94fb116ea96b80aa59b309ef37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/davos-meeting-nigeria/update-1-nigeria-says-weaker-dollar-may-not-hurt-the-country-idUSL8N1PK34F", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Nigeria says weaker dollar may not hurt the country", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T19:40:00.000+02:00", "replies_count": 0, "uuid": "df6043bf59937f94fb116ea96b80aa59b309ef37"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/davos-meeting-nigeria/update-1-nigeria-says-weaker-dollar-may-not-hurt-the-country-idUSL8N1PK34F", "ord_in_thread": 0, "title": "UPDATE 2-Nigeria says weaker dollar may not hurt the country", "locations": [], "entities": {"persons": [{"name": "alexis akwagyiram", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "yemi osinbajo", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "osinbajo", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments on U.S. and security)\nBy Alexis Akwagyiram\nDAVOS, Switzerland, Jan 25 (Reuters) - Nigeria’s vice president said on Thursday that a weaker U.S. dollar did not necessarily hurt his oil-producing nation.\nThe comments by Yemi Osinbajo were made after U.S. Treasury Secretary Steven Mnuchin welcomed a weaker dollar, saying it benefited U.S. trade balances in the short term.\nOPEC member Nigeria is Africa’s largest oil producer. Crude oil sales make up two-thirds of Nigeria’s government revenues and most of its foreign exchange earnings.\n“A weaker dollar doesn’t necessarily hurt Nigeria,” said Osinbajo, speaking at the World Economic Forum in Davos.\n“We are concerned most about ensuring that we are able to make our own exports cheaper and we working on all of that. Our major concern is how to make ourselves more competitive,” he added.\nThe welcoming of a weakened dollar, seen by markets as a departure from the usual U.S. currency policy, has been seen as an indication that President Donald Trump is stepping up his attack on China and other big trading partners as part of his America First agenda.\nTrump arrived in Davos on Thursday. Earlier this month the president was accused of using vulgar language Haiti and African countries, though he denied using the specific language .\n“We need each other: Africa needs America. America also needs Africa in several important ways, so for me the most important thing is that we continue to maintain those relationships,” Osinbajo said, when asked about the alleged remarks.\n“I‘m also told that Mr Trump has said that he did not in fact make those statements and we should be able to accept that,” he said.\nThe vice president also discussed security in Africa’s most populous nation, which is contending with Islamist militant Boko Haram insurgents in the northeast and working to maintain a fragile peace in the restive southern Niger Delta oil-producing region.\n“We are recruiting more policemen and we are recruiting more people in the army. Security is dynamic and you have to keep working at it,” Osinbajo said. He did not provide details of the number of new recruits.\nAttacks on energy facilities in the Niger Delta region pushed Africa’s biggest economy into recession in 2016, its first in 25 years.\nNiger Delta Avengers, the group which claimed responsibility for most of the attacks, last week said it would resume attacks within days.\n“We are in constant consultation with all groups in the Niger Delta,” said Osinbajo, when asked about the government’s response to the latest threat.\nThe country’s recovery has largely been driven by crude oil sales since emerging from recession in the second quarter of 2017. (Reporting by Alexis Akwagyiram, editing by Mark Bendeich and Larry King)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T19:40:00.000+02:00", "crawled": "2018-01-26T21:30:46.009+02:00", "highlightTitle": ""}