{"organizations": [], "uuid": "20f9fa8e170d2a912af13db602f75610c116437e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/05/104202079-GettyImages-631018464.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/stocks-making-the-biggest-moves-premarket-jnj-len-abt-bp-lvs-wynn-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: JNJ, LEN, ABT, BP, LVS, WYNN & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:40:00.000+02:00", "replies_count": 0, "uuid": "20f9fa8e170d2a912af13db602f75610c116437e"}, "author": "Peter Schacknow", "url": "https://www.cnbc.com/2018/01/02/stocks-making-the-biggest-moves-premarket-jnj-len-abt-bp-lvs-wynn-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: JNJ, LEN, ABT, BP, LVS, WYNN & more", "locations": [], "entities": {"persons": [{"name": "len", "sentiment": "negative"}, {"name": "abbott", "sentiment": "none"}], "locations": [{"name": "guggenheim", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "las vegas sands", "sentiment": "none"}], "organizations": [{"name": "johnson & johnson", "sentiment": "negative"}, {"name": "abt", "sentiment": "negative"}, {"name": "lvs", "sentiment": "negative"}, {"name": "bp", "sentiment": "negative"}, {"name": "wynn resorts", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "abbott labs", "sentiment": "none"}, {"name": "lennar", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "j&j", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nJohnson & Johnson – The stock was downgraded to \"neutral\" from \"overweight\" at JPMorgan Chase. The firm's view on J&J is still upbeat, but it sees more upside potential in other large-cap names.\nLennar – Wells Fargo upgraded the home builder to \"outperform\" from \"market perform,\" citing both tax law changes and prospects for improved profits from its planned purchase of CalAtlantic .\nAbbott Labs – The drugmaker was upgraded to \"overweight\" from \"neutral\" at JPMorgan Chase, and also received upgrades from Morgan Stanley and Guggenheim. Analysts are encouraged by the prospects for Abbott's product pipeline.\nBP — The British energy giant said it expected a positive impact on earnings from changes in U.S. tax law.\nLas Vegas Sands , Wynn Resorts – These and other casino companies with operations in Macau could benefit, following news that gaming revenue in the Chinese territory rose 19 percent in 2017. That was the first annual revenue gain in three years.\nVolkswagen – Volkswagen faces more legal issues over its diesel emissions scandal, with a Swiss consumer protection organization filing claims on behalf of about 6,000 owners seeking damages.\nSears Holdings – Sears has not run any paid national television commercials since late November, according to The Wall Street Journal. The parent of Sears and Kmart has run no national TV ads since late November, compared to $8.4 million a year earlier for the Sears brand and $6.5 million for the company's Kmart division.\nL Brands – The apparel retailer was upgraded to \"outperform\" from \"neutral\" at Baird, which said it believes the Victoria's Secret unit is turning the corner under new leadership.\nAltice USA – Altice pulled the Starz and Encore movie channels from its cable lineup after the two sides could not come to an agreement on a new carriage contract.\nApple – Apple is offering $29 replacement batteries immediately, a month earlier than planned. That comes after Apple's admission that iOS software may slow down older iPhones in order to prevent spontaneous shutdowns due to battery wear.\nAlibaba – Alibaba's UC Browser is overtaking Alphabet's Google Chrome in some of Asia's fastest-growing markets, according to The Wall Street Journal. Users tell the paper that the Alibaba browser works better in companies where mobile service is spotty and low-end smartphone use is prominent.\nGenesco – Genesco was upgraded to \"buy\" from \"hold\" at Jefferies, which also increased its price target on the specialty retailer's stock to $40 from $27.\nAllstate – Allstate was downgraded to \"underperform\" from \"market perform\" at Keefe Bruyette & Woods, which also cut the price target on the insurer's stock to $93 from $103. KBW notes decelerating rate increases and auto segment profit margin pressures.\nWalt Disney – Disney's \"Star Wars: The Last Jedi\" stayed on top of the holiday weekend box office, ringing up another $68.4 million in North American ticket sales. That brings its domestic total to $533.1 million.\nNordstrom – The retailer's stock was upgraded to \"neutral\" from \"underweight\" at JPMorgan Chase, which notes Nordstrom's strong finish to 2017 and the best holiday season in three years.\nPlanet Fitness – The fitness center operator's stock was downgraded to \"hold\" from \"buy\" at Jefferies, which calls the shares expensive and said that competition is increasing.\nDeckers Outdoor – Jefferies cut its rating on the footwear retailer to \"hold\" from \"buy,\" citing the current valuation and saying that an upbeat winter season for the Uggs maker is already priced in.\nSirius XM – The satellite radio operator's stock was downgraded to \"underweight\" from \"neutral\" at JPMorgan Chase, following the assessment of higher royalty rates beginning this year. JPMorgan feels the higher rates will impact profit margins and possibly subscriber growth rates.", "external_links": [], "published": "2018-01-02T15:40:00.000+02:00", "crawled": "2018-01-02T15:33:47.023+02:00", "highlightTitle": ""}