{"organizations": [], "uuid": "028d4c14dfec4e9c4431b5a98945cbb8ac3cddab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-zk-international-announces-earnings-per-share-of-0-point-45-on-record-revenue-of-44-point-95-million-for-the-fiscal-year-ended.html", "country": "US", "domain_rank": 767, "title": "ZK International Announces Earnings Per Share of $0.45 on Record Revenue of $44.95 Million for the Fiscal Year Ended September 30, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.21, "site_type": "news", "published": "2018-01-31T17:30:00.000+02:00", "replies_count": 0, "uuid": "028d4c14dfec4e9c4431b5a98945cbb8ac3cddab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-zk-international-announces-earnings-per-share-of-0-point-45-on-record-revenue-of-44-point-95-million-for-the-fiscal-year-ended.html", "ord_in_thread": 0, "title": "ZK International Announces Earnings Per Share of $0.45 on Record Revenue of $44.95 Million for the Fiscal Year Ended September 30, 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WENZHOU, China, Jan. 31, 2018 /PRNewswire/ -- ZK International Group Co., Ltd. (Nasdaq: ZKIN) (\"ZKIN\", \"ZK International\" or the \"Company\"), today announced its financial results for the fiscal year ended September 30, 2017.\nDuring the period the Company:\nGenerated record revenue of $44.95 million, an increase of 22.1% comparing to that of fiscal year 2016. Net income totaled $5.93 million or $0.45 per share, an increase of 11.9% comparing to that of fiscal year 2016.\nMr. Jiancong Huang, Chairman and CEO of ZK International, stated, \"The last six months has been a transformative period for the Company, having successfully closed on our IPO in August and yielding us the working capital to execute on our growth initiatives. Our ability to increase capacity at our facility with new, state-of-the art machinery, as well as increasing our sales force in our retail piping division from 15 to 49 professionals in 37 cities and 16 provinces, has allowed us to sell our products direct to the consumer and build new customer relationships. We are pleased to have signed and begun working with leading global corporations such as Huawei Technologies, China Railway Construction Engineering and Shenzhen Water Group. It is a testament to the efficient execution of our strategy and quality of our proprietary stainless steel piping and fittings.\"\nSignificant Contracts Signed Since Listing on NASDAQ:\nSigned agreement with Shenzhen Water Group Co., Ltd. in the amount of $3.0 million to deploy the Company's proprietary stainless steel pipes and fittings through the city's Community Pipeline Network Upgrade Program. Entered into $1.2 million contract with The XingRong Group, one of the largest water treatment and supply companies in Western China, to supply approximately 280,000 meters of piping and 280,000 pipe fittings over the course of one year. Signed multiple initial pipeline infrastructure contracts to supply Huawei Technologies Co. Ltd., a leading global information and communication technology solutions provider, and China Railway Construction Engineering Group (\"CRCEG\"), one of the largest construction and engineering companies in China, for approximately $2.75 Million USD. Signed initial framework contract of $300,000 USD for its consumer piping division with one of China's largest interior design and contract companies, Bo Tao Decoration Group Co. Ltd, (\"Bo Tao\"). Signed an initial pipeline infrastructure contract with Huawei Technologies Co. Ltd. (\"Huawei\"), a leading global information and communication technology solutions provider, for $2.0 million USD.\nOperational Highlights for the Fiscal Year Ended September 30, 2017 to Date:\nIn order to sell direct to the consumer at a higher margin, the Company increased its sales force in the retail piping division by 227% from 15 to 49 professionals who are strategically located in 37 cities and 16 provinces throughout China. The Pipe Network Division of Shenzhen Water Group Co., Ltd. invited ZK International to participate in drafting the product regulations and standards to be used in Phase II of the Community Pipeline Network Upgrade Program (CPNUP). The Company participated in water and gas industry exhibitions and seminars including the Gas & Heating China 2017 Exhibition and the 2017 Annual Water and Gas Academic Seminar. The Gas & Heating China 2017 Exhibition is one of the largest exhibitions for gas and heating technology and equipment, attracting more than 300 companies who participate and present their products and technology. The ZK International team presented the Company's patented products including the Double-Compression Pipe Connection Series and Integral Casted Gas Meter Connection. Both products have successfully reduced the gas leakage and installation cost for our clients due to its effective and durable structure.\nOn August 30, 2017, ZK International announced the closing of its initial public offering of 1,068,346 ordinary shares at a public offering price of $5.00 per share. ZK International received $5,341,730 in gross proceeds before underwriter's commission and expenses. The shares began trading on September 1, 2017 on The NASDAQ Capital Market under the symbol 'ZKIN'. Prior to closing on the Company's initial public offering, the Company completed three private transactions in December 2016, March 2017 and May 2017 in the total amount of $2.3 million. With the pre-IPO financings and the proceeds from the IPO the Company raised a total of $7,641,730.\nMr. Jiancong Huang continued, \"We are pleased to increase revenue and net income year-over-year while maintaining cash on hand of approximately $11.3 million. Our additional working capital has allowed us to make investments in the future growth of the Company, which resulted in increases in selling and marketing as well as general and administrative expenses year-over-year. This falls in line with our growth strategy.\"\nFinancial Results for the Fiscal Year Ended September 30, 2017:\nRecord revenue for the fiscal year ended September 30, 2017 totaled $44,951,740, an increase of 22.1%, as compared to $36,809,094 for the fiscal year ended September 30, 2016. The increase in revenue is primarily due to the Company's increasing its market share and closing more government projects to replace aged piping infrastructure and improve local water supply systems.\nTotal cost of revenue was $31,843,337 for the fiscal year ended September 30, 2017, as compared to $25,333,318 for the fiscal year ended September 30, 2016. Total cost of revenue as a percentage of revenue increased by 2.02% to 70.84% for the fiscal year ended September 30, 2017 as compared to 68.82% for the fiscal year ended September 30, 2016. The increase is primarily due to increase of raw material cost and labor cost.\nSelling and marketing expenses for the fiscal year ended September 30, 2017 totaled $1,915,127, as compared to $957,990 for the fiscal year ended September 30, 2016. Selling and marketing expenses increased primarily due to increases in advertisement expenses and compensation for the additional sales personnel we hired during the year.\nGeneral and administrative expenses for the fiscal year ended September 30, 2017 totaled $1,782,318, as compared to $1,599,743 for the fiscal year ended September 30, 2016. General and administrative expenses increased primarily due to the increase in administrative expenses relating to the increase in sales volume, plus increased compliance and consulting fees related to our IPO closed on September 01, 2017.\nResearch and development expenses for the fiscal year ended September 30, 2017 totaled $1,331,111, as compared to $1,302,022 for the fiscal year ended September 30, 2016. R&D expenses increased primarily due to the expenses relating to the materials and equipment we use to conduct our research for our new products.\nOperating income totaled $8,079,847 for the fiscal year ended September 30, 2017, as compared to operating income of $7,616,021 for the fiscal year ended September 30, 2016, an increase of operating income of $463,826, or approximately 6.09%.\nIncome tax expense totaled $995,005 for the fiscal year ended September 30, 2017, compared to $1,105,440 for the fiscal year ended September 30, 2016. The decrease is primarily attributable to the taxation adjustments made according to PRC Tax Law.\nNet income for the fiscal year ended September 30, 2017 was $5,933,688, compared to net profit of $5,302,691 for the fiscal year ended September 30, 2016, an increase in profit of $630,997. Earnings per share for the fiscal year ended September 30, 2017 was $0.45 per share based on approximately 13.1 million shares outstanding.\nAs of September 30, 2017 the Company had cash and cash equivalents of $11,278,475.\nAbout ZK International Group Co., Ltd.\nZK International Group Co., Ltd. is a China-based designer, engineer, manufacturer and supplier of patented high-performance stainless steel and carbon steel pipe products that require sophisticated water or gas pipeline systems. The Company owns 28 patents, 21 trademarks, 2 Technical Achievement Awards, and 10 National and Industry Standard Awards. ZK International is preparing to capitalize on the $850 Billion commitment made by the Chinese Government to improve the quality of water, which in its current supply state is 70% unfit for human contact. ZK International is Quality Management System Certified (ISO9001), Environmental Management System Certified (ISO1401), and a National Industrial Stainless Steel Production Licensee that is focused on supplying steel piping for the multi-billion dollar industries of Gas and Water sectors. ZK has supplied stainless steel pipelines for over 2,000 projects, which include the Beijing National Airport, the \"Water Cube\" and \"Bird's Nest\", which were venues for the 2008 Beijing Olympics. Emphasizing superior properties and durability of its steel piping, ZK International is providing a solution for the delivery of high quality, highly sustainable, environmentally sound drinkable water to not only to the China market but to international markets such as Europe, East Asia and Southeast Asia.\nFor more information please visit www.ZKInternationalGroup.com . Additionally, please follow the Company on Twitter , Facebook , YouTube , and Weibo . For further information on the Company's SEC filings please visit www.sec.gov .\nSafe Harbor Statement\nThis news within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. Without limiting the generality of the foregoing, words such as \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"intend,\" \"could,\" \"estimate\" or \"continue\" or the negative or comparable terminology are intended to identify forward-looking statements. In addition, any statements that refer to expectations, projections or other characterizations of future events or circumstances are forward-looking statements. These forward- not guarantees of future performance and are subject to certain risks, uncertainties and assumptions that are difficult to predict and many of which are beyond the control of ZK International. Actual results may differ from those projected due to risks and uncertainties, as well as other risk factors that are included in the Company's filings with the U.S. Securities and Exchange Commission. Although ZK International believes that the assumptions underlying the forward- reasonable, any of the assumptions could prove inaccurate and, therefore, there can be no assurance that the results contemplated in forward-looking statements will be realized. In light of the significant uncertainties inherent in the forward-looking information included herein, the inclusion of such information should not be regarded as a representation by ZK International or any other person that their objectives or plans will be achieved. ZK International does not undertake any obligation to revise the forward-looking statements contained herein to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\nInvestor Contact:\nKCSA Strategic Communications\nValter Pinto, Managing Director\nPH: +1 (212) 896-1242\nZKInternational@KCSA.com\nZK INTERNATIONAL GROUP CO. , LTD\nCONSOLIDATED BALANCE SHEETS\n( IN U.S. DOLLARS)\nAs of September 30,\n2017\n2016\nAssets\nCurrent assets\nCash and cash equivalents\n$ 11,278,475\n$ 123,649\nRestricted cash\n529,837\n3,236,482\nAccounts receivable, net of allowance for doubtful accounts of $1,817,050 and $1,648,178,\nrespectively\n21,261,609\n23,843,980\nNotes receivable\n214,999\n89,941\nOther receivables\n1,514,545\n1,625,872\nInventories\n10,048,568\n6,444,088\nAdvance to suppliers\n9,630,518\n3,251,295\nDeferred tax assets, current portion\n272,557\n247,227\nTotal current assets\n54,751,108\n38,862,534\nProperty, plant and equipment, net\n5,645,724\n5,907,985\nIntangible assets, net\n463,171\n468,148\nOther long-term assets\n313,066\n312,289\nTOTAL ASSETS\n$ 61,173,069\n$ 45,550,956\nCurrent liabilities:\nAccounts payable\n$ 717,272\n$ 1,141,803\nAccrued expenses and other current liabilities\n4,457,170\n3,416,613\nAccrued payroll and welfare\n325,675\n375,428\nAdvance from customers\n1,983,713\n1,618,216\nRelated party payables\n7,911,720\n1,662,160\nShort-term bank borrowings\n21,335,938\n21,793,454\nNotes payable\n-\n3,897,426\nIncome tax payable\n3,074,635\n2,066,934\nTOTAL LIABILITIES\n$ 39,806,123\n$ 35,972,034\nEquity\nCommon stock, no par value, 50,000,000 shares authorized, 13,068,346 and 9,000,000\nshares issued and outstanding, respectively\n-\n-\nAdditional paid-in capital\n8,382,876\n2,800,777\nStatutory surplus reserve\n1,173,363\n579,994\nRetained earnings\n10,978,891\n5,697,984\nAccumulated other comprehensive income\n681,788\n411,239\nTotal equity attributable to ZK International Group Co., Ltd.\n21,216,918\n9,489,994\nEquity attributable to non-controlling interests\n150,028\n88,928\nTotal equity\n21,366,946\n9,578,922\nTOTAL LIABILITIES AND EQUITY\n$ 61,173,069\n$ 45,550,956\nZK INTERNATIONAL GROUP CO., LTD\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\n(IN U.S. DOLLARS)\nFor the year ended September 30,\n2017\n2016\nRevenues\n$ 44,951,740\n$ 36,809,094\nCost of sales\n(31,843,337)\n(25,333,318)\nGross profit\n13,108,403\n11,475,776\nOperating expenses:\nSelling and marketing expenses\n1,915,127\n957,990\nGeneral and administrative expenses\n1,782,318\n1,599,743\nResearch and development costs\n1,331,111\n1,302,022\nTotal operating expenses\n5,028,556\n3,859,755\nOperating Income\n8,079,847\n7,616,021\nOther income (expenses):\nInterest expenses\n(1,245,385)\n(1,417,745)\nInterest income\n24,459\n51,058\nOther income, net\n69,772\n158,797\nTotal other expenses, net\n(1,151,154)\n(1,207,890)\nIncome before income taxes\n6,928,693\n6,408,131\nIncome tax provision\n(995,005)\n(1,105,440)\nNet income\n$ 5,933,688\n$ 5,302,691\nNet income attributable to non-controlling interests\n(59,412)\n(53,154)\nNet income attributable to ZK International Group Co., Ltd.\n5,874,276\n$ 5,249,537\nNet income\n$ 5,933,688\n$ 5,302,691\nOther comprehensive income (loss):\nForeign currency translation adjustment\n272,237\n(403,865)\nTotal c omprehensive income\n$ 6,205,925\n$ 4,898,826\nComprehensive loss (income) attributable to non-controlling interests\n(61,100)\n3,406\nComprehensive income attributable to ZK International Group Co., Ltd.\n$ 6,144,825\n$ 4,902,232\nBasic and diluted earnings per share\nBasic\n$ 0.56\n$ 0.59\nDiluted\n0.56\n0.59\nWeighted average number of shares outstanding\nBasic\n10,970,000\n9,000,000\nDiluted\n10,973,674\n9,000,000\nZK INTERNATIONAL GROUP CO. , LTD\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(IN U.S. DOLLARS)\nFor the year ended Sept ember 3 0 ,\n2017\n2016\nCash Flows from Operating Activities:\nNet income\n$ 5,933,688\n$ 5,302,691\nAdjustments to reconcile net income to net cash used in operating activities:\nDepreciation expense\n425,696\n442,793\nAmortization expense\n12,705\n13,248\nBad debt expense\n160,944\n691,156\nDeferred tax benefits\n(24,142)\n(103,673)\nChanges in operating assets and liabilities:\nAccounts receivable\n2,419,491\n(10,200,868)\nOther receivables\n411,554\n(381,751)\nNotes receivable\n(121,937)\n(76,531)\nInventories\n(3,505,158)\n(775,275)\nAdvance to suppliers\n(6,153,011)\n(805,016)\nAccounts payable\n(417,453)\n796,189\nAccrued expenses and other current liabilities\n791,312\n412,894\nAccrued payroll and welfare\n(49,512)\n50,897\nAdvance from customers\n282,817\n1,400,622\nIncome tax payable\n979,288\n2,031,515\nNet cash provided (used in) operating activities\n1,146,282\n(1,201,109)\nCash Flows from Investing Activities:\nPurchases of property, plant and equipment\n(155,152)\n(123,945)\nPurchases of intangible assets\n(6,704)\n-\nNet cash used in investing activities\n(161,856)\n(123,945)\nCash Flows from Financing activities:\nNet proceeds from issuance of shares\n5,582,099\n-\nCapital contributions from non-controlling interest\n-\n15,306\nNet proceeds released from (placed into) restricted cash\n2,651,704\n(206,633)\nNet proceeds (repayments) from short-term bank borrowings\n(499,904)\n2,148,310\nRepayments on notes payable\n(3,816,458)\n(2,602,037)\nProceeds from related parties\n6,051,523\n1,485,555\nNet cash provided by financing activities\n9,968,964\n840,501\nEffect of exchange rate changes on cash\n201,436\n(18,589)\nNet increase in cash and cash equivalents\n11,154,826\n(503,142)\nCash and cash equivalents at the beginning of year\n123,649\n626,791\nCash and cash equivalents at the end of year\n$ 11,278,475\n$ 123,649\nSupplemental disclosures of cash flows information:\nCash paid for income taxes\n$ 54,215\n$ 108,825\nCash paid for interest expenses\n$ 1,233,066\n$ 939,914\nView original content: http://www.prnewswire.com/news-releases/zk-international-announces-earnings-per-share-of-045-on-record-revenue-of-4495-million-for-the-fiscal-year-ended-september-30-2017-300590857.html\nSOURCE ZK International Group Co., Ltd.", "external_links": ["http://weibo.com/zkinternational", "https://www.facebook.com/ZKINTERNATIONAL/", "http://www.sec.gov/", "https://www.zkinternationalgroup.com/about-us", "https://twitter.com/ZKIN_CleanWater", "http://www.zkinternationalgroup.com/", "https://www.youtube.com/channel/UCdXBTSoR5ISnQjY78y44SvQ", "http://www.prnewswire.com/news-releases/zk-international-announces-earnings-per-share-of-045-on-record-revenue-of-4495-million-for-the-fiscal-year-ended-september-30-2017-300590857.html"], "published": "2018-01-31T17:30:00.000+02:00", "crawled": "2018-01-31T18:49:57.013+02:00", "highlightTitle": ""}