{"organizations": [], "uuid": "5b309c68c31f662278caa9b022a520f961f0e124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/13/104217833-GettyImages-140417888.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/trump-foreign-policy-and-global-hotspots-could-sustain-the-oil-rally.html", "country": "US", "domain_rank": 767, "title": "Trump foreign policy and global hotspots could sustain the oil rally", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-02T16:43:00.000+02:00", "replies_count": 0, "uuid": "5b309c68c31f662278caa9b022a520f961f0e124"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/02/trump-foreign-policy-and-global-hotspots-could-sustain-the-oil-rally.html", "ord_in_thread": 0, "title": "Trump foreign policy and global hotspots could sustain the oil rally", "locations": [], "entities": {"persons": [{"name": "helima croft", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6:42 AM ET Fri, 29 Dec 2017 | 01:17 \nOil prices appear poised to level off after a nearly six-month rally pushed futures to 2½-year highs at the close of 2017, analysts say. But several geopolitical hot spots could keep the run-up in the energy complex alive. \nThe oil market owes much of its gains to OPEC and Russia's deal to limit output this year. International benchmark Brent crude ended the fourth quarter nearly 18 percent higher, near $67 a barrel, while U.S. crude surged nearly 17 percent to more than $60. \nPrices got a boost as tensions flared in the Middle East, Venezuela and parts of Africa, and analysts say continued turmoil could be the key to further gains. \n\"If you want to say, 'How do we break out of this range?' it would be a geopolitical story,\" Helima Croft, global head of commodity strategy at RBC Capital Markets, told CNBC's \"Worldwide Exchange\" on Friday. \nOil supplies from Iraqi Kurdistan fell after a dispute between the central government in Baghdad and the semi-autonomous region . Concerns about stability in Saudi Arabia following a political crackdown also boosted markets in the fourth quarter. \nIn the final weeks of the year, the threat of a strike by oil workers in Nigeria and a pipeline attack in Libya bolstered a rally underpinned by an outage of U.K. North Seas Forties crude. \nCroft expects the market to soften in the first quarter of 2018 due to seasonally weak demand — unless one of several first-quarter shocks rears its head. show chapters 3:04 PM ET Fri, 13 Oct 2017 | 00:59 \nPresident Donald Trump could blow up the Iran nuclear deal by restoring sanctions that were suspended in 2016, according to Croft. Trump refused to certify the international accord in October, triggering a 60-day congressional review. \nSince then, Congress has made little progress on a solution to address concerns about the deal. Some fear Trump will refuse to continue suspending sanctions this month, causing the deal to collapse and potentially disrupting Iranian oil supplies. \n\"If he basically says 'I'm not going to waiver sanctions anymore,' those energy sanctions are going to come back,\" Croft said. @realDonaldTrump: The people of Iran are finally acting against the brutal and corrupt Iranian regime. All of the money that President Obama so foolishly gave them went into terrorism and into their \"pockets.\" The people have little food, big inflation and no human rights. The U.S. is watching! \nTrump's foreign policy is also at play in Venezuela, which struggled to make billions in debt payments this fall under the weight of U.S. sanctions. Large payments coming due in the first quarter could trigger the clear-cut default that Venezuela avoided this year and hasten the slow but steady decline in its crude oil output, according to Croft. \nAnalysts are also concerned about growing tensions between Saudi Arabia and Iran , particularly since Iranian-aligned Houthi militants in Yemen have fired missiles toward Riyadh , the Saudi capital. Saudi Arabia and Gulf allies invaded Yemen in 2015 after the Houthis overthrew the government. show chapters 7:18 AM ET Wed, 27 Dec 2017 | 01:47 \nThe Saudis and the United States have accused Iran of supplying the Houthis with the missiles, with the Saudi-led coalition saying one recent attempted strike could be considered an \"act of war\" by Iran. \n\"We've seen them battling each other on a sort of proxy basis on the edges of the region, in Yemen, in Syria,\" said John Kilduff, founding partner at energy hedge fund Again Capital. \n\"Does that become more direct hostilities next year? Because certainly the rhetoric out of Saudi Arabia has been quite fiery towards Iran,\" he told \"Worldwide Exchange\" on Wednesday. \nKilduff says he's bearish on oil prices, but agrees that geopolitical risks could push up prices, especially since supply and demand have tightened, leaving less of a cushion to prevent price slides. \nOil prices face downward pressure from rising U.S. production, which is approaching all-time highs above 10 million barrels a day. Analysts are also monitoring OPEC and Russia's output deal for signs of cheating on their deal.", "external_links": [], "published": "2018-01-02T16:43:00.000+02:00", "crawled": "2018-01-02T17:05:49.024+02:00", "highlightTitle": ""}