{"organizations": [], "uuid": "abe0f60f09b3a7dfdceee6f94d9665a9efdd1828", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224422181&w=1200&r=LYNXMPEE0M0K7", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-sweden-bookseller/china-says-it-has-no-information-on-seized-swedish-citizen-idUKKBN1FC10B", "country": "US", "domain_rank": 408, "title": "China says it has no information on seized Swedish citizen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:48:00.000+02:00", "replies_count": 0, "uuid": "abe0f60f09b3a7dfdceee6f94d9665a9efdd1828"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-sweden-bookseller/china-says-it-has-no-information-on-seized-swedish-citizen-idUKKBN1FC10B", "ord_in_thread": 0, "title": "China says it has no information on seized Swedish citizen", "locations": [], "entities": {"persons": [{"name": "swedi", "sentiment": "negative"}, {"name": "hua chunying", "sentiment": "none"}, {"name": "hua", "sentiment": "none"}, {"name": "angela gui", "sentiment": "none"}, {"name": "gui", "sentiment": "none"}, {"name": "gui minhai", "sentiment": "none"}, {"name": "margot wallstrom", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "hong kong-based", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "radio sweden", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:49 AM / Updated 15 minutes ago China says it has no information on seized Swedish citizen Reuters Staff 3 Min Read \nBEIJING (Reuters) - China’s foreign ministry said on Tuesday it had no information on a detained Swedish citizen and Hong Kong-based bookseller, Gui Minhai, after his daughter said he was seized from a train bound for the capital, Beijing. \nGui was taken away on Saturday by plainclothes police, Angela Gui told Radio Sweden, adding that she was concerned for the safety of her father who was released from Chinese custody in October. His whereabouts since have been unclear. \nAngela Gui said her father was being escorted by two Swedish diplomats to seek medical attention for a neurological disorder. \nSweden’s foreign ministry said Foreign Minister Margot Wallstrom had summoned China’s ambassador over the issue. \nIn Beijing, Foreign Ministry spokeswoman Hua Chunying said she did not have any specific information about Gui’s case. \n“The Chinese and Swedish sides have very open communication channels,” Hua told a daily news briefing. \n“If there are any problems, from one or both sides, they can be raised, both sides can conduct timely and effective dialogue, this is no problem at all,” she added. FILE PHOTO: Members from the pro-democracy Civic Party carry a portrait of Gui Minhai (L) and Lee Bo during a protest outside the Chinese Liaison Office in Hong Kong, China January 19, 2016. REUTERS/Bobby Yip \n”But as for the Swedish Foreign Ministry’s statement I have already said, as to the specific issue, I do not have any information at hand at this moment and you have to ask the relevant department in China. \n“I believe the relevant department will handle the issue in accordance with the law,” Hua said. \nChina’s Ministry of Public Security did not respond to a faxed request for comment. It was not possible to reach the Ministry of State Security, which has no website and does not have a publicly available telephone number. \nIn response to repeated questions regarding Gui’s case, Hua said China helped facilitate the work of foreign diplomats in keeping with the Vienna convention on diplomatic relations, while stressing that China hoped foreign diplomats, including those from Sweden, respected Chinese laws. \n“Any foreigner in China, including officials of foreign diplomatic missions, must not contravene international or Chinese laws,” she said. “This is basic common sense and a basic principle.” \nGui Minhai was abducted in Thailand while on holiday in 2015, one of five Hong Kong booksellers who went missing that year and later appeared in mainland Chinese custody. The four others have returned to Hong Kong. \nChinese authorities said Gui, who published books on the personal lives of Communist Party leaders, was released in October last year after serving a sentence for a traffic offence in 2003. Reporting by Philip Wen; Writing by Ben Blanchard; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-23T11:48:00.000+02:00", "crawled": "2018-01-23T12:10:48.014+02:00", "highlightTitle": ""}