{"organizations": [], "uuid": "65d64ee093bed9edd28903ed1c7aa1f8d9f9633f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938525-OLeary_wedding.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/kevin-oleary-why-you-shouldnt-buy-an-engagement-ring.html", "country": "US", "domain_rank": 767, "title": "Kevin O'Leary: Why you shouldn't buy an engagement ring", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:10:00.000+02:00", "replies_count": 0, "uuid": "65d64ee093bed9edd28903ed1c7aa1f8d9f9633f"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/10/kevin-oleary-why-you-shouldnt-buy-an-engagement-ring.html", "ord_in_thread": 0, "title": "Kevin O'Leary: Why you shouldn't buy an engagement ring", "locations": [], "entities": {"persons": [{"name": "kevin o'leary", "sentiment": "negative"}, {"name": "o'leary", "sentiment": "none"}, {"name": "kevin o'leary kevin o'leary", "sentiment": "none"}, {"name": "linda", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES \nWith Valentines' Day quickly approaching, engagement season is in full swing. \nFor all of the lovebirds swooning over the idea of proposing to their significant other — and planning to shell out big bucks to do it — Kevin O'Leary has a dose of reality for you. \n\"From the day you're born, there is a whole industry of people trying to figure out how to extract money from you,\" O'Leary tells CNBC Make It. \"One of the best at doing it are the guys that make wedding rings.\" \nIndeed, conventional wisdom holds that you should spend one to three months ' salary on an engagement ring — but that idea actually began as part of a campaign by a diamond retailer in the 1930s. \nSo ditch that rule, says O'Leary. \n\"[Ring retailers] tell you ... you should go into debt, you should put it on your credit card,\" he says. \n\"How about this idea? Don't buy one!\" Courtesy of Kevin O'Leary Kevin O'Leary and his wife, Linda, on their wedding day more than 25 years ago. \n\"Diamond rings are really expensive, and they don't produce any dividends or any interest,\" he explains. \nAccording to a 2017 report from WeddingWire.com, survey respondents spent $5,000 on an engagement ring on average. And 36 percent of people said they spent two months salary. \nO'Leary proposed to his wife Linda with a tiny diamond — no setting — which he got from a wholesaler. It saved him 70 percent of what a regular ring would have cost. They later had it mounted on a band. And for his 25-year wedding anniversary, he bought his wife a much bigger 5.5 carat rock. \nWhy? \"Frankly, there are better places to put your money until you have the luxury of being able to splurge on one, so don't buy one for your wedding,\" O'Leary says. \n\"I know its controversial, but you know what? You'll feel much better about it when it's making 6 percent [in returns] in the market every year,\" referring to an average rate of return in the stock market. \nInvesting the money instead will help ensure you don't start your marriage further in the hole. \n\"When ... you're starting out, the worst thing you can do is put yourself in debt for your wedding,\" O'Leary says. \"I know it sounds romantic to spend a lot of money — it's crazy to do that. \n\"Tell your girlfriend/fiance/soon-to-be-wife when you have the money to invest in a ring, you'll do that,\" he says. \n\"The whole idea is to remember you're building for your future. Don't get into debt, save, save save and invest,\" he suggests. \"It's a fantastic way to protect yourself down the road.\" ", "external_links": ["http://www.bbc.com/news/magazine-27371208", "http://publications.weddingwire.com/i/795912-weddingwire-2017-newlywed-report", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-10T19:10:00.000+02:00", "crawled": "2018-01-10T18:24:42.059+02:00", "highlightTitle": ""}