{"organizations": [], "uuid": "746f5fc8729ab78d48a1c425a1e2c3c17f7faefb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-national-litigation-firm-manion-gaynor-manning-llp-names-three-new-partners.html", "country": "US", "domain_rank": 767, "title": "National Litigation Firm Manion Gaynor & Manning LLP Names Three New Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2018-01-29T17:00:00.000+02:00", "replies_count": 0, "uuid": "746f5fc8729ab78d48a1c425a1e2c3c17f7faefb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-national-litigation-firm-manion-gaynor-manning-llp-names-three-new-partners.html", "ord_in_thread": 0, "title": "National Litigation Firm Manion Gaynor & Manning LLP Names Three New Partners", "locations": [], "entities": {"persons": [{"name": "stephanie m. batchelder", "sentiment": "none"}, {"name": "stephanie", "sentiment": "none"}, {"name": "ryan w. browning", "sentiment": "none"}, {"name": "stephanie m. batchelder stephanie batchelder", "sentiment": "none"}, {"name": "dustin c. beckley", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}, {"name": "providence", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "national litigation firm manion gaynor & manning llp", "sentiment": "negative"}, {"name": "manion gaynor & manning llp", "sentiment": "negative"}, {"name": "complex litigation practice group", "sentiment": "none"}, {"name": "hispanic national bar association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 29, 2018 /PRNewswire/ -- Manion Gaynor & Manning LLP (MG+M) is pleased to announce that the firm has expanded its partnership, naming three attorneys as new partners. The firm's newly named partners are Stephanie M. Batchelder from the firm's Boston, Massachusetts and Providence, Rhode Island offices; Dustin C. Beckley from the firm's Irvine, California office; and Ryan W. Browning from the firm's office in Wilmington, Delaware.\nSTEPHANIE M. BATCHELDER\nStephanie Batchelder is a member of the firm's Complex Litigation Practice Group and focuses her practice on products liability and toxic tort litigation. Stephanie has extensive experience overseeing and managing nationally recognized companies both as local counsel and national coordinating counsel. She is involved in all phases of litigation, including discovery and depositions, dispositive and pre-trial motions, and trial preparation. Stephanie is actively involved with MG+M's Women's Forum, serving as co-chair for the Boston and Providence offices. She is also a member of the Hispanic National Bar Association, and is currently the chair of the organization's Litigation and Dispute Resolution Section. A graduate of New England School of Law, Stephanie has been named a Massachusetts Super Lawyer each year since 2013. Stephanie works out of the firm's Boston and Providence offices.\nDUSTIN C. BECKLEY\nDustin C. Beckley is a member of the firm's Complex Litigation Practice Group. His civil litigation practice focuses on toxic tort and products liability litigation. As an experienced litigator, Dustin represents and counsels clients through all phases of complex litigation, from initial investigation and discovery through trial. Dustin has extensive experience handling asbestos cases and toxic tort cases both as local counsel and national expert witness coordinating counsel. Dustin is a graduate of Notre Dame Law School and the University of California, Los Angeles, and has been named a Southern California Super Lawyers Rising Star each year since 2014. He works in the firm's Irvine, California, office.\nRYAN W. BROWNING\nRyan Browning focuses his civil litigation practice on toxic tort and products liability litigation. Ryan has defended clients against claims for negligence, strict liability, breach of warranty, failure to warn, and various consumer protection violations. He also has extensive experience coordinating several clients' national discovery efforts. Ryan graduated from the College of William & Mary School of Law, and received his undergraduate degree magna cum laude from the University of North Carolina – Chapel Hill. Ryan works in the firm's Wilmington, Delaware office.\nThe new members of the firm's partnership, which hail from three MG+M offices across the country, will help to grow the firm's national litigation capabilities. \"I am very excited about these new additions to our firm's partnership,\" commented Amaryah K. Bocchino, the managing partner of MG+M. \"Each of them has developed strong working relationships with our clients on a national level, and their unique sets of legal skills make them invaluable assets to our firm. I believe that they will greatly enhance our ability to serve our clients nationwide.\"\nABOUT MANION GAYNOR & MANNING LLP\nMG+M is a national litigation firm with deep expertise in a wide range of practice areas. We approach litigation as a unified team, integrating the efforts of 100+ attorneys in 11 offices nationwide with those of our clients to advance their interests wherever they do business. Our goal always is to deliver optimal results at the best possible value. Find out more at www.mgmlaw.com .\nCONTACT:\nBillie Jean Potter\nMarketing Director, Manion Gaynor & Manning LLP\nbpotter@mgmlaw.com\nView original content: http://www.prnewswire.com/news-releases/national-litigation-firm-manion-gaynor--manning-llp-names-three-new-partners-300589042.html\nSOURCE Manion Gaynor & Manning LLP", "external_links": ["http://www.prnewswire.com/news-releases/national-litigation-firm-manion-gaynor--manning-llp-names-three-new-partners-300589042.html", "http://www.mgmlaw.com/"], "published": "2018-01-29T17:00:00.000+02:00", "crawled": "2018-01-29T19:35:40.002+02:00", "highlightTitle": ""}