{"organizations": [], "uuid": "907f98906d41cb75943035d397e79dcd859b6f49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-peopleadmin-and-performance-matters-will-combine-to-form-first-comprehensive-k-12-talent-management-suite-linking-educator.html", "country": "US", "domain_rank": 767, "title": "PeopleAdmin and Performance Matters Will Combine to Form First Comprehensive K-12 Talent Management Suite Linking Educator and Student Assessment Data with Actionable Insights to Enhance Teacher Performance and Improve Student Outcomes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:00:00.000+02:00", "replies_count": 0, "uuid": "907f98906d41cb75943035d397e79dcd859b6f49"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-peopleadmin-and-performance-matters-will-combine-to-form-first-comprehensive-k-12-talent-management-suite-linking-educator.html", "ord_in_thread": 0, "title": "PeopleAdmin and Performance Matters Will Combine to Form First Comprehensive K-12 Talent Management Suite Linking Educator and Student Assessment Data with Actionable Insights to Enhance Teacher Performance and Improve Student Outcomes", "locations": [], "entities": {"persons": [], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two K-12 education technology leaders announce plans to build ground-breaking solutions powered by market leading research and predictive analytics that improve all aspects of talent acquisition, educator professional development, and student assessment\nAUSTIN, Texas--(BUSINESS WIRE)-- PeopleAdmin, the industry-leading provider of talent management solutions for education, is pleased to announce that it has signed a definitive agreement to acquire Performance Matters. With best-in-class solutions and powerful, research-based predictive analytics, the combined companies will create K-12 education’s most comprehensive, innovative, and data-driven talent management platform dedicated to improving student outcomes.\nThe combined company will operate as TalentEd by PeopleAdmin, serving over 5,000 educational institutions, including the majority of the nation’s largest K-12 districts, who in turn educate over 30 million students. Joining Performance Matters’ award-winning tools and analytics for professional development, evaluation and student assessment with TalentEd’s solutions and partnerships that optimize recruiting, hiring, retaining, and developing teachers and staff will directly link educator and student performance, enabling greater efficiencies and analytic insights to empower professional development and drive student achievement.\n“We’re excited to join forces with Performance Matters to expand our customers’ abilities to strategically link talent development and professional learning, and deliver comprehensive tools that meet their needs for data-driven insights supported by proven results,” said Jack Blaha, CEO of PeopleAdmin. “Combining current offerings — such as our best-in-class EPI hiring assessment tool and the professional development and student support tools from Performance Matters — signifies a new era in using technology to link educator and student data to inform action at the individual educator, school and district levels.”\nPerformance Matters’ award-winning tools and actionable data are changing the way K-12 educators think about the relationship between professional development and student learning. TalentEd will be the first technology provider to offer these market-leading capabilities alongside proven solutions for educator recruitment, hiring, assessment, management, evaluation and retention.\n“Performance Matters, an operating company of Weld North Holdings LLC, was created with a clear focus on understanding and positively influencing the critical relationship between professional development and student outcomes, which perfectly aligns us with TalentEd’s commitment to empower talent and elevate education,” said Adam Klaber , CEO of Performance Matters. “By tying together educator and student data with TalentEd’s solutions, we’ll create an extremely powerful set of K-12 talent management and student assessment solutions that will give school and district leaders data-informed, actionable insights to expand and improve the way educators teach and students learn.”\nEducation leaders look forward to the acquisition and the improvements it will drive.\n“This combination is exciting because it carries real possibilities for improving the quality of instruction,” said Skye Duckett, chief human resources officer at Atlanta Public Schools, which currently uses both PeopleAdmin and Performance Matters solutions. “By bringing together the data we need to hire better teachers on the front end, evaluating effectiveness of teacher performance and connecting it to professional development in real-time, we can realize cost and time savings while improving academic outcomes for students.”\nAbout PeopleAdmin\nPowered by actionable analytics and insights gained from a team of education research experts, TalentEd by PeopleAdmin delivers solutions that streamline K-12 education recruitment, assessment, hiring, onboarding, records and contract management, absence management, evaluations and professional development management.\nTalentEd partners with thousands of schools in the U.S. and Canada to deliver data-driven talent management solutions that improve efficiency and effectiveness, so customers may focus on what they do best — empowering employees, advancing student achievement and inspiring a brighter future.\nTalentEd: Empower talent. Elevate education.\nAbout Performance Matters\nBy combining powerful student and educator growth solutions with real-time analytics, Performance Matters helps K-12 school districts drive continuous improvement of instruction and learning. The Performance Matters Growth Platform includes tools for student assessment development and delivery, as well as educator professional development, evaluation, observation, and calibration. The Performance Matters Growth Platform is used by more than 1 million educators and 11 million students in school districts across the country. For information, visit www.PerformanceMatters.com .\nAbout Weld North Holdings LLC\nWeld North operates a platform of digital and SaaS educational solution businesses and makes control investments in high potential businesses in the education industry. By attracting highly motivated and distinctly talented professionals, Weld North looks to accelerate growth through an obsessive focus on enhancing the customer experience, operational excellence, marketing expertise and disciplined financial management. For information, visit www.weldnorth.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131006003/en/\nPeopleAdmin\nMatt Keenan, 877-637-5800\nChief Revenue Officer\nMatt.keenan@peopleadmin.com\nor\nEicher Communications Inc.\nLeslie Eicher, APR, 314-965-1776\nMedia contact\nLeslie@EicherCommunications.com\nSource: PeopleAdmin", "external_links": ["http://www.businesswire.com/news/home/20180131006003/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.PerformanceMatters.com&esheet=51751413&newsitemid=20180131006003&lan=en-US&anchor=www.PerformanceMatters.com&index=1&md5=f21b5e5ec5a5036ddd315e3f310b80da", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.weldnorth.com&esheet=51751413&newsitemid=20180131006003&lan=en-US&anchor=www.weldnorth.com&index=2&md5=69e456766118a46fd2b1d09431c381b4"], "published": "2018-01-31T21:00:00.000+02:00", "crawled": "2018-01-31T22:52:33.007+02:00", "highlightTitle": ""}