{"organizations": [], "uuid": "1cefa3232f13d76e3b0c977a09b8028e5fe2e7b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-elliott-bay-announces-2017-activity-37-properties-acquired-three-independent-members-join-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Elliott Bay Announces 2017 Activity: 37 Properties Acquired, Three Independent Members Join Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:40:00.000+02:00", "replies_count": 0, "uuid": "1cefa3232f13d76e3b0c977a09b8028e5fe2e7b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-elliott-bay-announces-2017-activity-37-properties-acquired-three-independent-members-join-board-of-directors.html", "ord_in_thread": 0, "title": "Elliott Bay Announces 2017 Activity: 37 Properties Acquired, Three Independent Members Join Board of Directors", "locations": [], "entities": {"persons": [{"name": "elliott bay", "sentiment": "negative"}, {"name": "christian whipple", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "elliott bay capital trust", "sentiment": "negative"}, {"name": "eldridge industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 12, 2018 /PRNewswire/ -- Elliott Bay Capital Trust (\"Elliott Bay\"), a privately held real estate investment firm that invests in mission-critical healthcare properties leased by leading specialty care providers, hospitals, and health systems, has announced the expansion of its national portfolio of healthcare real estate assets with 37 transactions closed in 2017.\nElliott Bay, an Eldridge Industries portfolio company, now has more than 75 fully leased healthcare properties diversified across 25 states and is the largest owner of dialysis real estate in the U.S.\n\"2017 was another transformative year for Elliott Bay in which we further diversified our portfolio with integral healthcare properties leased to national operators and strong regional health systems operating across various attractive outpatient segments including dialysis, cancer treatment, imaging, ambulatory surgery and multi-specialty centers,\" said Christian Whipple, CEO of Elliott Bay. \"We continued to progress the execution of our strategy of acquiring mission-critical healthcare properties leased to leading providers with strong credit that are delivering superior services to patients in their communities across the country.\"\nElliott Bay has also announced that it has elected three new independent members to the Board of Directors of Elliott Bay Holdings: Mark Caputo, George Huber and Eric Shuey. The three are veteran business executives who have proven healthcare, real estate, and investment leadership experience and long track records of success.\n\"We are pleased to welcome Mark, George, and Eric to Elliott Bay's Board of Directors,\" said Todd Boehly, Chairman and CEO of Eldridge Industries. \"They are each highly accomplished and bring a wealth of experience and expertise to Elliott Bay as the company seeks to build on the effective execution of its business model and long-term strategy.\"\nMark Caputo\nMark Caputo currently serves as Chairman of Sound Physicians, Vice Chairman of Remedy Partners, and the Joint Venture Managing Partner for Fresenius Medical Care. Prior to this, Mark was the founder and CEO of Liberty Dialysis LLC, which he grew from one clinic in 2002 to the third largest dialysis company in the world, serving more than 20,000 ESRD patients in more than 280 dialysis centers, with hospital and physician partners in 32 states. In 2012, Liberty Dialysis merged with Fresenius Medical Care, in a transaction valued at $2.35 billion.\nDuring the course of his career, Mr. Caputo has served as (i) Chairman and a lead investor for Sound Physicians, Inc., the largest hospitalist company in the United States, employing more than 2,500 physicians, and (ii) Board Member and investor in National Cardiovascular Partners, a business that grew to become the largest outpatient cardiac cath lab business in the United States.\nMr. Caputo has dedicated much of his time to assisting non-profit organizations ranging from St. Francis Medical Center in Honolulu to St. Joseph's Hospital in Syracuse, to Mary's Place Homeless Shelters in Seattle, and the Little Sisters Fund in Nepal. In addition, he has served as an advisor to technology companies from Boston to Seattle.\nMr. Caputo received an M.B.A. from Harvard Business School and B.A. in Economics from Princeton University.\nGeorge Huber\nGeorge Huber is a co-founder and Managing Principal of Dock Square Capital LLC, a Miami based merchant bank focused on principal investments, strategic advisory services and joint ventures. He is also founder and managing principal of Equity Investment Group, an Indiana based commercial real estate investment firm which has completed over $7 Billion worth of transactions throughout the United States covering retail, office, industrial, multi-family, hotel and multiple other property types. By the early 2000's, Equity Investment Group, as a private retail REIT, had become one of the largest private owner/managers of retail real estate in the United States, with offices in six states and 120 shopping centers nationwide.\nMr. Huber also co-founded, owned and managed Blue Vista Capital Management, LLC, a Chicago based real estate investment management company that raised and managed in excess of $1 Billion of institutional equity through closed-end funds, separate accounts and joint venture relationships totaling approximately $5.25 Billion of capitalization. Mr. Huber also co-owned and served as Managing Principal of Peak Campus Companies, one of the five largest student housing managers and developers in the United States.\nMr. Huber has been active on numerous professional and charitable organizations including serving on the Board of Directors for publicly-traded companies Fort Wayne National Corporation (NASDAQ:FWNC) and Lakeland Financial Corporation (NASDAQ:LKFN).\nMr. Huber received an M.B.A with Honors from the University of Michigan and a B.A. in Business from Vanderbilt University.\nEric Shuey\nEric Shuey has more than 25 years of private equity investing, corporate finance and executive management experience in the healthcare industry. Mr. Shuey previously served as a senior executive at Fresenius Medical Care where he was involved with several major strategic initiatives including $1.5 billion of corporate investments and acquisitions. Prior to Fresenius, Mr. Shuey was a key member of the senior management team of Liberty Dialysis during its growth from a $10 million revenue business into the third largest national provider of dialysis services with over $1.0 billion of revenue and operating more than 280 clinics in 32 states. In 2012, Liberty Dialysis merged with Fresenius Medical Care, in a transaction valued at $2.35 billion.\nMr. Shuey has been an active investor and board member of healthcare services businesses across the dialysis, bundled payment, hospitalist, cardiology, ambulatory surgery center, SaaS based healthcare business analytics, healthcare IT and contract physical therapy sectors. Earlier in his career, Mr. Shuey served as a Director at DB Capital Partners, the private equity arm of Deutsche Bank responsible for over $10 billion in assets, and a Principal at Aurora Capital Group, a $1 billion private equity firm. Mr. Shuey started his investment banking career as an associate in DLJ's Los Angeles office.\nMr. Shuey received an M.B.A from the Wharton School of Business, where he was a Palmer Scholar. In addition, he has completed the coursework for a Ph.D. in Management at the Wharton School and earned his B.A. from California State University, Fullerton with highest honors.\nAbout Elliott Bay Capital Trust\nElliott Bay Capital Trust is a privately held real estate investment management firm based in Seattle, WA. Elliott Bay invests in properties that are mission-critical to healthcare providers' operations, provide superior services to patients and are integral for the future of healthcare delivery. www.elliottbaycap.com\nAbout Eldridge Industries\nEldridge Industries (\"Eldridge\") is a private investment firm that provides debt and equity capital to support growing companies. Eldridge invests across diversified industries with a focus on media and sports, insurance, real estate development, asset lending and financing, branded food and hospitality, and asset management businesses. In particular, ", "external_links": ["http://www.eldridge.com/", "http://www.prnewswire.com/news-releases/elliott-bay-announces-2017-activity-37-properties-acquired-three-independent-members-join-board-of-directors-300582032.html", "http://www.elliottbaycap.com/"], "published": "2018-01-12T19:40:00.000+02:00", "crawled": "2018-01-12T20:43:28.014+02:00", "highlightTitle": ""}