{"organizations": [], "uuid": "c37a64d54b52608d8e100e68a1aae6b45497321e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226724851&w=1200&r=LYNXMPEE0T1IN", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-mexico-tequila/soaring-agave-prices-give-mexican-tequila-makers-a-headache-idUSKBN1FJ2Y9", "country": "US", "domain_rank": 408, "title": "Soaring agave prices give Mexican tequila makers a headache", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T23:44:00.000+02:00", "replies_count": 0, "uuid": "c37a64d54b52608d8e100e68a1aae6b45497321e"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-tequila/soaring-agave-prices-give-mexican-tequila-makers-a-headache-idUSKBN1FJ2Y9", "ord_in_thread": 0, "title": "Soaring agave prices give Mexican tequila makers a headache", "locations": [], "entities": {"persons": [{"name": "sha", "sentiment": "negative"}, {"name": "lizbeth diaz", "sentiment": "negative"}, {"name": "angulo", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "amatitan", "sentiment": "none"}, {"name": "jalisco", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 45 PM / in 6 minutes Soaring agave prices give Mexican tequila makers a headache Lizbeth Diaz , Sharay Angulo 6 Min Read \nAMATITAN, Mexico (Reuters) - In the heartland of the tequila industry, in Mexico’s western state of Jalisco, a worsening shortage of agave caused by mounting demand for the liquor from New York to Tokyo has many producers worried. \nThe price of Agave tequilana, the blue-tinged, spikey-leaved succulent used to make the alcoholic drink, has risen six-fold in the past two years, squeezing smaller distillers’ margins and leading to concerns that shortages could hit even the larger players. \nIn front of a huge metal oven that cooks agave for tequila, one farmer near the town of Amatitan said he had been forced to use young plants to compensate for the shortage of fully grown agave, which take seven to eight years to reach maturity. \nHe asked not to be identified because he did not want his clients to know he was using immature plants. \nThe younger plants produce less tequila, meaning more plants have to be pulled up early from a limited supply - creating a downward spiral. \n“They are using four-year-old plants because there aren’t any others. I can guarantee it because I have sold them,” said Marco Polo Magdaleno, a worried grower in Guanajuato, one of the states allowed to produce tequila according to strict denomination of origin rules. \nMore than a dozen tequila industry experts interviewed by Reuters said that the early harvesting will mean the shortage is even worse in 2018. \nAlready, the 17.7 million blue agaves planted in 2011 in Mexico for use this year fall far short of the 42 million the industry needs to supply 140 registered companies, according to figures from the Tequila Regulatory Council (CRT) and the National Tequila Industry Chamber (CNIT). \nThe shortages are likely to continue until 2021, as improved planting strategies take years to bear fruit, according to producers. \nThe result is agave prices at 22 pesos ($1.18) per kilo - up from 3.85 pesos in 2016. \nThose higher prices mean that low-cost tequila producers, which make a cheaper, less pure drink that once dominated the market, find it harder to compete with premium players. \n“It doesn’t make sense for tequila to be a cheap drink because agave requires a big investment,” said Luis Velasco, CNIT’s president. \nSmall-scale distillers of quality tequilas are also feeling the pinch and some warn that drinkers are seeking alternative tipples. \n“At more than 20 pesos per kilo, it’s impossible to compete with other spirits like vodka and whisky,” said Salvador Rosales, manager of smaller producer Tequila Cascahuin, in El Arenal, a rural town in Jalisco. \n“If we continue like this a lot of companies will disappear,” he said. \nExports to the United States of pure tequila jumped by 198 percent over the past decade, while cheaper blended tequila exports rose by just 11 percent, CNIT data shows. \nOver the same time, Mexican production declined 4 percent, with blended tequila leading the fall. Slideshow (2 Images) GLOBAL DEMAND \nAs it sheds its image as a fiery booze drunk by desperados and fratboys, while moving into the ranks of top-shelf liquors, the tequila industry has seen a flurry of deals in recent years. \nIn January, Bacardi Ltd [BACLTD.UL] said it would buy fine tequila maker Patron Spirits International for $5.1 billion. [nL4N1PI3N9] \nIn 2017, after years of speculation, Mexico’s Beckmann family launched an initial public offering of Jose Cuervo ( CUERVO.MX ), raising more than $900 million. [nL4N1PI3N9] \nAnd Britain’s Diageo Plc ( DGE.L ) swapped its Bushmills Irish whiskey label for full ownership of the high-end Don Julio tequila in 2014. \nThe question posed by many distillers is how to keep pace with tequila’s success. \n“The growth has overtaken us. It’s a crisis of success of the industry,” said Francisco Soltero, director of strategic planning at Patron, which buys agave under various contracts. \n“We thought that we were going to grow a certain amount, and we’re growing double,” he said. \nLarge sellers such as Patron and Tequila Sauza say they have not experienced problems paying for agave, and forecast that their inventories will keep growing. \n“If you sell value, the costs don’t worry you,” Soltero said. \nTequila Sauza, which mostly grows its own agave, does not foresee supply problems, chief executive Servando Calderon said. \nBut some think it is simply a matter of time before the higher production costs and scarcity pressures bigger players. \n“We are sure this will have a strong impact on the big firms such as Cuervo or Sauza,” said Raul Garcia, President of the National Committee for Agave Production in Tequila, a group that includes most agave producers in the country. \n“We don’t see that the problem will be resolved soon, and that’s what worries us.” \nDemand is also being driven by other, fashionable agave-derived products, including agave syrup and health supplement inulin, which use the equivalent of 20 percent of the plants needed in 2018, the CRT said. \nAnd rising prices are leading to growing theft, driving out smaller producers, said Jose de Jesus, a producer of blue agave in Tepatitlan. Criminals come to the area with large trucks in the middle of the night to steal agave, he said. \nAccording to the CRT last year 15,000 plants were reported stolen, more than triple the number in 2016. \n($1 = 18.7096 Mexican pesos)", "external_links": [], "published": "2018-01-30T23:44:00.000+02:00", "crawled": "2018-01-30T23:53:29.013+02:00", "highlightTitle": ""}