{"organizations": [], "uuid": "996f7f0e28901b56ac76f241fb82cd38f6cd6e27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-qbe-north-america-appoints-daniel-franzetti-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "QBE North America Appoints Daniel Franzetti Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:30:00.000+02:00", "replies_count": 0, "uuid": "996f7f0e28901b56ac76f241fb82cd38f6cd6e27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-qbe-north-america-appoints-daniel-franzetti-chief-operating-officer.html", "ord_in_thread": 0, "title": "QBE North America Appoints Daniel Franzetti Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "daniel franzetti", "sentiment": "negative"}, {"name": "dan", "sentiment": "none"}, {"name": "franzetti", "sentiment": "none"}, {"name": "russell johnston", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "qbe north america", "sentiment": "none"}], "organizations": [{"name": "qbe north america", "sentiment": "negative"}, {"name": "qbe north america executive management board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 5, 2018 /PRNewswire/ -- QBE North America, an integrated specialist insurer, today announced the appointment of Daniel Franzetti as Chief Operating Officer, effective immediately. Mr. Franzetti continues his role as Chief Claims Officer for QBE North America, and will add to these responsibilities by overseeing all North American operations, systems, architecture, communications and branding. He will remain a member of the QBE North America Executive Management Board, reporting to QBE North America Chief Executive Officer Russell Johnston.\nWith over thirty years of experience in the insurance industry, Mr. Franzetti has deep experience in and knowledge of the business. Leveraging his experience working across the organization through claims, the combined role will be integral to executing QBE North America's strategy as an integrated specialist insurer, helping to maximize enterprise-wide opportunities that will enable the company to solidify its brand within the marketplace.\n\"We are thrilled Dan has accepted a new role within the company. Dan's experience working across the organization, including a proven and disciplined record of claims management will be instrumental as we work to transform our business model to deliver long-term value for our customers, agents and shareholders,\" said Johnston. \"The opportunity to leverage our strengths – applied expertise, experience of excellence, and global strength – has never been greater.\"\nBefore joining QBE North America, Mr. Franzetti, who succeeds Bob James, was Chief Claims Officer for Zurich Australia Insurance Limited and Senior Vice President, leading Zurich's Claims Technical Shared Services in North America. Mr. Franzetti received a Juris Doctor degree from New York Law School, a Masters of Business Administration degree from Rutgers University-Newark, and a Bachelor of Arts degree from Colgate University.\nAbout QBE\nQBE North America is part of QBE Insurance Group Limited, one of the largest insurers and reinsurers worldwide. QBE NA reported Gross Written Premiums in 2016 of $4.6 billion. QBE Insurance Group's 2016 results can be found at www.qbena.com . Headquartered in Sydney, Australia, QBE operates out of 37 countries around the globe, with a presence in every key insurance market. The North America division, headquartered in New York, conducts business through its property and casualty insurance subsidiaries. The actual terms and coverage for all lines of business are subject to the language of the policies as issued. QBE insurance companies are rated \"A\" (Excellent) by A.M. Best and \"A+\" by Standard & Poor's. Additional information can be found at www.qbena.com , or by following QBE North America on Twitter .\nView original content: http://www.prnewswire.com/news-releases/qbe-north-america-appoints-daniel-franzetti-chief-operating-officer-300578240.html\nSOURCE QBE North America", "external_links": ["https://twitter.com/QBENorthAmerica", "http://www.qbena.com/", "http://www.prnewswire.com/news-releases/qbe-north-america-appoints-daniel-franzetti-chief-operating-officer-300578240.html"], "published": "2018-01-05T18:30:00.000+02:00", "crawled": "2018-01-05T20:23:35.018+02:00", "highlightTitle": ""}