{"organizations": [], "uuid": "7a11da9e712617916ebb16243f3d32416f860a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226879217&w=1200&r=LYNXMPEE0U0H0", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-india-budget-markets/india-budget-to-test-investors-faith-in-modis-government-idUSKBN1FK0XO", "country": "US", "domain_rank": 408, "title": "India budget to test investors' faith in Modi's government", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:41:00.000+02:00", "replies_count": 0, "uuid": "7a11da9e712617916ebb16243f3d32416f860a0a"}, "author": "", "url": "https://www.reuters.com/article/us-india-budget-markets/india-budget-to-test-investors-faith-in-modis-government-idUSKBN1FK0XO", "ord_in_thread": 0, "title": "India budget to test investors' faith in Modi's government", "locations": [], "entities": {"persons": [{"name": "modi", "sentiment": "negative"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "suvashree choudhury", "sentiment": "none"}, {"name": "abhirup roy", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "min read  mumbai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - Since his election four years ago, Indian markets have welcomed Prime Minister Narendra Modi’s campaign to mend patchy public finances and develop new areas of growth in Asia’s third largest economy.\nTo keep investors’ confidence, however, Modi’s government will need to be seen containing the fiscal deficit, while also increasing spending in key areas of the slowing economy.\nMarkets will be focused on how much India widens its fiscal deficit beyond the 3 percent of gross domestic product projected for 2018/19.\nA Reuters poll showed most economists expect a 3.2 percent deficit as the government looks to increase investments in key areas such as agriculture to bolster its re-election prospects in elections due by 2019.\nA modest widening of that nature would calm investors worried that the government may slip away from its judicious spending. Traders say bond yields could fall 10 to 15 basis points, while shares could hit new record highs. Gains could be more pronounced if India sticks to its 3.0 percent target.\nBut a deficit above 3.2 percent could hit shares and send bond yields up by 20-25 basis points, depending on the size of the blowout, on fears of populist policy ahead of next year’s elections.\nMarkets remain nervous after the government’s annual economic survey on Monday suggested “a pause” in fiscal consolidation, sending bonds plummeting.\n“I think the budget will be focused on both investors as well as the common man,” said A. Balasubramanian, chief executive officer at Aditya Birla Sun Life Asset Management, adding he expects a deficit of 3.2 percent.\n“The government will take care so that the budget is neither inflationary nor fiscally less prudent.”\nA prudent budget could also soothe the Reserve Bank of India, which holds a policy review on Feb. 6-7 amid worries it could raise rates in coming months after inflation hit a 17-month high in December, well above its 4 percent target.\nCRITICAL JUNCTURE Benchmark 10-year bond yields have fallen 135 bps and the NSE share index has surged 55 percent since Modi took power in May 2014.\nBut a recent spike in inflation, tightening cash conditions, and worries about fiscal slippage have sent the 10-year bond yield up more than 80 basis points since July, the biggest move since the 2013 rupee crisis.\nStocks have been more resilient, gaining 4.9 percent this year and hitting records amid signs earnings are recovering after years of poor performance.\nWhile investors expect some spending to support an economy that’s expected to post its weakest growth in four years, they will want to see such stimulus is well-financed.\nGrowth has been hampered by a chaotic rollout of a goods and service tax last year and a shock move to ban high value currency notes in late 2016, which hit tax revenues and increased the chances the fiscal deficit shortfall would hit 3.2 percent target for the year to March.\nAn expected pickup in growth next fiscal year and state asset sales estimated to raise 1 trillion rupees ($15.74 billion) should boost tax revenues.\nDespite an expected revenue increase, investors don’t believe India will swing to profligacy, with a rally in oil prices likely to constrain government spending.\nIndia imports 80 percent of its energy requirements, and the government may need to respond to higher crude prices like it did in October, by cutting fuel duties. The risk that such a contingency is needed could keep the government in check.\n“I believe that there is a high chance that fiscal discipline is more likely to be maintained in this budget,” said Lakshmi Iyer, fixed income head at Kotak Mutual Fund.\n($1 = 63.5200 Indian rupees)\nReporting by Suvashree Dey Choudhury and Abhirup Roy; Editing by Rafael Nam and Sam Holmes\n ", "external_links": [], "published": "2018-01-31T10:41:00.000+02:00", "crawled": "2018-01-31T11:23:35.003+02:00", "highlightTitle": ""}