{"organizations": [], "uuid": "26d614aad8340d64dcaa578218736f6e1e91c95c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226703843&w=1200&r=LYNXMPEE0T1GA", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-usa-drilling-offshore/alaska-becomes-latest-state-to-request-limits-on-u-s-offshore-drilling-idUSKBN1FJ2QY", "country": "US", "domain_rank": 408, "title": "Alaska becomes latest state to request limits on U.S. offshore drilling", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.306, "site_type": "news", "published": "2018-01-31T04:13:00.000+02:00", "replies_count": 0, "uuid": "26d614aad8340d64dcaa578218736f6e1e91c95c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-drilling-offshore/alaska-becomes-latest-state-to-request-limits-on-u-s-offshore-drilling-idUSKBN1FJ2QY", "ord_in_thread": 0, "title": "Alaska becomes latest state to request limits on U.S. offshore drilling", "locations": [], "entities": {"persons": [{"name": "bill walker", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "anchorage", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "beaufort", "sentiment": "none"}, {"name": "cook inlet", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "chukchi", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:13 PM / in an hour Alaska becomes latest state to request limits on U.S. offshore drilling Yereth Rosen 3 Min Read \nANCHORAGE, Alaska (Reuters) - Alaska Governor Bill Walker said on Tuesday he has asked U.S. Interior Secretary Ryan Zinke to pare back a Trump administration plan for oil and gas leasing off the state’s coast. \nWhile Walker supports offshore oil development, he said the Interior Department should focus on the most prospective areas off Alaska – the Beaufort and Chukchi seas in the Arctic and Cook Inlet in southern Alaska – and drop all others from the leasing plan. \nIn asking for proposed lease sales to be dropped, Walker, an independent, joins governors of several other coastal states after Zinke’s unexpected move to exempt Florida from the department’s plans soon after the initial announcement. [nL1N1P624Z] \n”Interior Secretary Ryan Zinke is a partner with Alaska in many resource development projects, but a key threat in the effort to achieve a vibrant offshore program in Alaska is creating the false impression that there is an imminent attempt to foster development along our entire coast,” Walker said in a statement. \nProposed lease sales for other offshore regions in Alaska, in areas spanning the Bering Sea and Gulf of Alaska, should be removed from the plan, Walker said. The Interior Department should also maintain long-established buffers for Native Inupiat whalers and a traditional 25-mile no-leasing buffer along the Chukchi coast, the statement said. \nWalker’s comments echo those of the all-Republican Alaska Congressional delegation, which in a letter to Zinke on Friday asked the department to keep the Chukchi, Beaufort and Cook Inlet sales in the plan but cut the 11 proposed sales in the Bering Sea and Gulf of Alaska. \n“Such a program will maximize agency resources and reflect the areas with the broadest support for development among Alaskans,” Senators Lisa Murkowski, Dan Sullivan and Don Young said in the letter. \nThe Beaufort Sea off Alaska’s northern coast is the federal offshore Alaska area with the most exploration drilling to date, but there is no producing oil field located entirely in federal Beaufort waters. \nThe more remote Chukchi Sea, off northwestern Alaska and believed to hold vast amounts of oil and gas, was targeted by Royal Dutch Shell in the multibillion-dollar exploration program that the company scrapped in 2015. The Cook Inlet basin is Alaska’s oldest oil-producing region, but all production to date has been on state territory. Reporting By Yereth Rosen in Anchorage, Alaska; editing by Grant McCool", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T04:13:00.000+02:00", "crawled": "2018-01-30T22:52:51.010+02:00", "highlightTitle": ""}