{"organizations": [], "uuid": "1ef72f5aab7f32b51aa47ee6e5778a5d2ef9652c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/27/104802500-RTX3I43E-xi-jinping.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/08/dont-fight-china-just-stop-huge-us-wealth-and-technology-transfers--commentary.html", "country": "US", "domain_rank": 767, "title": "Don't fight China: Just stop huge US wealth and technology transfers - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T02:35:00.000+02:00", "replies_count": 0, "uuid": "1ef72f5aab7f32b51aa47ee6e5778a5d2ef9652c"}, "author": "Dr. Michael Ivanovitch", "url": "https://www.cnbc.com/2018/01/08/dont-fight-china-just-stop-huge-us-wealth-and-technology-transfers--commentary.html", "ord_in_thread": 0, "title": "Don't fight China: Just stop huge US wealth and technology transfers - commentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Jason Lee | Reuters China's President Xi Jinping claps after his speech as he and other new Politburo Standing Committee members meet with the press at the Great Hall of the People in Beijing, China October 25, 2017. \nIn the first 11 months of last year, China cashed in a cool $344.4 billion surplus on its U.S. trades. That's an 8 percent increase from the same period of 2016. \nFancy any technology with that? Of course, the Chinese would say. \nBeijing estimates that about 40 percent of its sales to the U.S. are generated by American companies operating in China. Those companies have been allowed to set up shop in China under joint-venture agreements requiring continuous technology transfers from the U.S. parent company. That's the only way exports from China could stay competitive in America's sophisticated consumer markets. \nThis briefly sums up the huge economic, political and security problems America created for itself with its wholesale outsourcing of manufacturing to China. \nAnd here is more: When the December trade numbers get in, the U.S. deficit with China for all of last year will probably end up close to $400 billion, a whopping 15 percent increase from 2016. \nIt will be interesting to hear what President Donald Trump will have to say about that because, in his long-held view, America was being ripped off by China. The irony is that the fiscal stimulus from Trump's tax reform will quickly drive China's trade surplus with the U.S. to half a trillion dollars. Don't blame China \nBut, sadly, that's now water under the bridge. A more interesting question would be to see how those trade surpluses are being used by China to strengthen its position as America's \"strategic competitor.\" \nThe numbers game there is very simple. The likely $400 billion China got from the U.S. last year will increase an already huge pool of Chinese net foreign assets and foreign currency reserves. At the last count, China's net foreign investment position stood at about $2 trillion, and its foreign reserves were at an astounding $3.14 trillion. That is by far the world's largest investment potential. \nAnd here is an example you might see this week of how those funds are used. \nRumors have it that the Chinese could pass an order of billions of dollars for Airbus planes to please the visiting French President Emmanuel Macron . That would grease the wheels of Sino-French relations, and it would set the right mood for a state visit Beijing considers as being of \"great significance.\" \nSome of that mood music has been played up already. In preparation for Macron's visit, the Chinese bought one more French jewel: Château Bellefont-Belcier, grand cru classé in the wine region of Saint-Emilion. And to drink that in style, the Chinese also recently bought the world-famous Baccarat crystal company. \nBut China and France want to do more. Macron will be setting up an EU-China \"trade axis\" that will include Russia . That, in fact, represents an extension of the China-Russia agreement to integrate China's \"Belt and Road\" projects with development programs from the Russia-led Eurasian Economic Union. \nIf you are keeping the \"strategic competition\" scores, chalk up a big one for China here. Some people call it a European stab in America's back, but as 19th Century French politician Charles-Maurice de Talleyrand-Périgord famously said of betrayal: \"Sire, it is a question of date.\" \nBut let's go back to Asia. China is meeting this week some of its neighbors — Cambodia, Laos, Myanmar, Thailand and Vietnam — for a Lancang-Mekong River Cooperation summit in Phnom-Penh, Cambodia, to plan big, China-led infrastructure \"connectivity\" projects. Beijing is extending its high-speed train lines to Laos, Vietnam, Thailand, Myanmar Malaysia and Singapore. Don't get mad, get even \nChina is also building a $50 billion \"economic corridor\" in Pakistan , connecting Xinjiang to Arabian Sea port cities of Gwadar and Karachi with a network of highways and high-speed rail services. Pakistani ports are supposed to keep open China's access to the Middle East and Africa — and beyond — in case, as some Chinese strategists fear, the Straits of Malacca are blocked by the U.S. and its allies. \nThat Arabian Sea access is opening a key lane to China's strategic locations in the Mediterranean. The most important such point is the Greek port of Piraeus, the largest in South Europe, where China purchased a majority ownership for 280.5 million euros. That creates a springboard for billions of dollars of Chinese investments in high-speed rail connections to Central and Eastern Europe through Macedonia, Serbia and Hungary. \nAlong with the North Sea Route to Europe, jointly developed with Russia, those are all investments of great strategic importance to China. Closer to home, China also announced a number of similar — dual-use and military — investments last week. \nMore than 40 space launches are expected this year, including the heavy-lift Long March 5 rocket, far side Moon missions by Chang'e 4 lunar lander and rover, and new Beidou navigation satellites. \nThe country's armed forces, funded last year by an officially declared military budget of $215.7 billion, are now primed to get better and to win wars with power projection assets like aircraft carriers. The construction of a third such vessel is currently under way, and a total of four battle groups are planned over the next 10 years. \nLet's stop the litany here to see what all that means for Washington's dealings with its chief \"strategic competitor.\" \nFirst, a lesson should be drawn from a dreadfully wrong strategic assessment that promoted investments in China and opened American markets to goods and services from China's low-cost production facilities on the idea that the Middle Kingdom would soon shake off its Communist ideology to create a \"Chimerica\" wonderland — a capitalist, U.S.-compatible economic and political ally. \nSecond, that U.S. policy blunder allowed China to build a readily deployed treasure chest of more than $3 trillion, and an additional $2 trillion in short- and long-term international investments. \nThird, the U.S. should stop chasing after China's global initiatives. That is a useless waste of time and resources. Leave it to American defense experts to protect the country's security and its vital national interests. They have plenty of money and power projection instruments to do that. \nFourth, stay away from blatant trade protectionism and dumb protectionist rhetoric. Get a smart economic diplomacy by following World Trade Organization - and International Monetary Fund -compatible principles of fair and reciprocal trade to correct systematic (beggar-thy-neighbor) and excessive trade imbalances. \nHere is a hypothetical example of what that policy would do if the U.S.-China trade were to be balanced. Taking the trade numbers for the first 11 months of last year, such a trade equilibrium would imply tripling the current U.S. exports to China — if China insisted on exports of $460 billion to the U.S. Investment thoughts \nExports can be a powerful engine of U.S. economic growth. Based on data for the past seven years, a 1 percent increase in export volumes was associated with a 0.5 percent increase in GDP growth. \nIt follows, then, that a significant push toward a more balanced U.S.-China ", "external_links": ["http://www.twitter.com/CNBCopinion"], "published": "2018-01-09T02:35:00.000+02:00", "crawled": "2018-01-09T09:40:45.658+02:00", "highlightTitle": ""}