{"organizations": [], "uuid": "3af2fe86c6d9cc58f211a61591404b4e67ff4369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226329775&w=1200&r=LYNXMPEE0S14L", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-soccer-miami-mls-beckham/beckham-set-to-be-formally-handed-miami-mls-franchise-idUSKBN1FI1W8", "country": "US", "domain_rank": 408, "title": "Beckham set to be formally handed Miami MLS franchise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:11:00.000+02:00", "replies_count": 0, "uuid": "3af2fe86c6d9cc58f211a61591404b4e67ff4369"}, "author": "", "url": "https://www.reuters.com/article/us-soccer-miami-mls-beckham/beckham-set-to-be-formally-handed-miami-mls-franchise-idUSKBN1FI1W8", "ord_in_thread": 0, "title": "Beckham set to be formally handed Miami MLS franchise", "locations": [], "entities": {"persons": [{"name": "beckham", "sentiment": "negative"}, {"name": "david beckham", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "miami mls", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "mls", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ex-manchester united and real madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Florida (Reuters) - Former England captain David Beckham was officially awarded a Major League Soccer (MLS) franchise in Miami on Monday.\n”It is with tremendous pride that we welcome Miami to Major League Soccer,” said MLS Commissioner Don Garber at a public rally on Monday attended by local officials and fans.\n“We know the right people are in place and the time is right for Miami to become a great Major League Soccer city,” he added.\nBeckham first announced his plan for a team in the South Florida city four years ago but he has faced a series of problems in finding a suitable venue and has adjusted the consortium backing his plan.\nAlong with Beckham, the club will be owned by Marcelo Claure, CEO of telecommunications company Sprint, Jorge and Jose Mas, Miami-based leaders of telecommunications and construction company MasTec; Masayoshi Son, founder and CEO of SoftBank; and entertainment entrepreneur Simon Fuller.\n“This is something that has been a dream for many, many years,” Beckham said.\n“When I was awarded the team there was only one city for me and it was here. I was drawn to this city for the same reasons millions of people are - the diversity, the culture, the people, the weather, the beaches,” he said.\nHowever there was little detail given of the precise plans for the club.\n“Additional news and information on the club – including its debut season in MLS, team name, logo and staff – will be announced in the future,” the league said in a statement.\nBeckham, the ex-Manchester United and Real Madrid midfielder, had the right to a discounted franchise as part of the deal which brought him to play in MLS in 2007.\nPAINFUL PROCESS “It has been a process. It’s been painful at times,” Beckham told Miami’s Local 10 News station.\n“I think the fact that it has taken this long, the fact that it’s taken four years actually has worked as a positive,” he added, saying he has been able to develop a deeper understanding of the city and its fans.\n”I’ve always believed in the project. That’s why, for me, I never gave up. I knew Miami was the city. I knew this was going to be special.\n“There have been many (hurdles),” Beckham said. “I‘m a persistent person and I don’t like to lose.”\nThe Beckham group had two different plans for waterside stadium venues defeated and were unable to secure a deal for a third location close to the Miami Marlins baseball arena.\nThe latest proposed site is in the Overtown neighborhood where the group has purchased six acres of land and has an agreement for three more acres after a deal with Miami Dade County authorities.\nThat plan has also faced local opposition, including a legal challenge from businessman Bruce Matheson, and must still gain zoning approval, but Beckham said there was no doubt the Overtown site was the one his team will call home.\n“This is our site,” Beckham said. “This is a site we have paid for. This is a site we plan on using.”\nThe franchise rights will cost Beckham $25 million, according to multiple reports - well below the market rate.\nThe owners of Los Angeles FC, which joins the league in March, are reported to have paid over $100 million for their franchise rights.\nReporting by Simon Evans, editing by Ed Osmond/Pritha Sarkar/Ken Ferris\n ", "external_links": [], "published": "2018-01-29T17:11:00.000+02:00", "crawled": "2018-01-29T17:26:04.029+02:00", "highlightTitle": ""}