{"organizations": [], "uuid": "5395c93341b816b92a0a508f2dfbd21e6fd1877e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223344811&w=1200&r=LYNXMPEE0I0SR", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mexico-election-usa/far-from-home-mexican-migrants-eager-to-influence-presidential-race-idUSKBN1F81GD", "country": "US", "domain_rank": 408, "title": "Far from home, Mexican migrants eager to influence presidential race", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:33:00.000+02:00", "replies_count": 0, "uuid": "5395c93341b816b92a0a508f2dfbd21e6fd1877e"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-election-usa/far-from-home-mexican-migrants-eager-to-influence-presidential-race-idUSKBN1F81GD", "ord_in_thread": 0, "title": "Far from home, Mexican migrants eager to influence presidential race", "locations": [], "entities": {"persons": [{"name": "martinez", "sentiment": "none"}, {"name": "david ayon", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lizbeth diaz", "sentiment": "none"}, {"name": "daina beth solomon", "sentiment": "none"}], "locations": [{"name": "tijuana", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "min read  mexico city", "sentiment": "none"}, {"name": "loyola marymount university", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - Tijuana native Alma Martinez will cast her first-ever vote for a Mexican president this July, but from across the country’s northern border, where she is among hundreds of thousands of co-nationals whose participation could be decisive in a close race. \nSeven times as many Mexicans in the United States have received voting credentials under new rules that let citizens sign up at local consulates rather than in Mexico, compared with the last presidential election six years ago. \nMany are first time voters. \n“It could potentially decide the election,” said David Ayon, a senior fellow at Loyola Marymount University in Los Angeles. \nOregon resident Martinez, 39, who moved to the United States two decades ago and works as a hotel cleaner, said she was particularly motivated to cast her ballot because of the uncertainty for migrants under U.S. President Donald Trump. \n“Things haven’t gotten ugly with Trump just yet, but you never know if you’ll be deported,” she said. “You always live with a part of your heart in Mexico.” \nMexico’s National Electoral Institute (INE) says it has already approved more than 460,000 credentials for voters abroad, and is processing thousands more applications, ahead of a March 31 deadline to register. \nAndres Manuel Lopez Obrador, a former mayor of Mexico City who now leads the leftist National Regeneration Movement (MORENA), is the front-runner ahead of the vote, an opinion poll showed this week. [nL1N1PC0Q8] \nRicardo Anaya of the conservative National Action Party (PAN) was in second place. Jose Antonio Meade, who is seeking the nomination of the ruling Institutional Revolutionary Party (PRI), came in third. \nPRI PLAGUED BY SCANDALS In a tight race, all votes could be crucial. \n\nA sign encouraging Mexicans to register to vote is seen in the Mexican Consulate in Los Angeles, California U.S. January 16, 2018. REUTERS/Lucy Nicholson In 2006, former President Felipe Calderon won by fewer than 244,000 votes, or less than 1 percentage point, the first time that Mexicans could vote for president outside the country. \nIn that race, INE counted 40,876 voters abroad, of which 80 percent voted, followed by 59,115 in the next election cycle, of which 70 percent voted. \nThis year’s race is also shaping up to be hotly contested given the numerous corruption scandals plaguing the PRI, which has held power for most of the past nine decades. \n“It’s very early to say what percent of them will vote, but in a tight election, these votes could make a difference,” said Benito Nacif, an INE official. \n\nSlideshow (3 Images) During the last two elections, Mexican voters based in the United States largely favored the PAN, followed by Lopez Obrador, who is now making his third presidential bid. Last year, he drew crowds as he visited major U.S. cities on what he described as a tour to support “our countrymen, the migrants.” \nAdrian Felix, a University of California Santa Cruz professor, said he expects more U.S. votes to be cast than in previous elections. But he said the multi-step registration process, plus skepticism, could limit the increase among the estimated 12 million Mexicans living abroad. \n“There are a number of institutional impediments that need to be changed to democratize the process,” he said. \nMost Mexican political parties have been staying quiet in the United States, restricted from campaigning abroad under INE rules although news and social media flow across borders. \nSome Mexican politicians are recognizing the burgeoning influence of voters far from home. \n“Mexicans in the United States could directly influence the result in this election,” said Enrique Alfaro, a former mayor of Guadalajara who is running for governor in Jalisco state. “I‘m seeing a lot of spirit among the community from Jalisco in various U.S. cities.” \nAndrew Selee, president of the Migration Policy Institute in Washington, said the impact from Mexico’s diaspora in the United States could be greater in future elections if politicians seize on growing participation. \n“At some point there will be a candidate that wants to take advantage of the vote abroad, and that will be a game changer,” he said. \nReporting by Daina Beth Solomon and Lizbeth Diaz; Additional reporting by Noe Torres; Editing by Dave Graham and Daniel Wallis\n ", "external_links": [], "published": "2018-01-19T15:33:00.000+02:00", "crawled": "2018-01-19T16:12:56.002+02:00", "highlightTitle": ""}