{"organizations": [], "uuid": "7ed5a6d0a5aa8a4007f77ebb05ab9f1fd06af0fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/news/wealth", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-money-tax-estates/your-estate-plan-needs-an-update-even-if-it-is-new-idUSKBN1F71VX", "country": "US", "domain_rank": 408, "title": "Your estate plan needs an update, even if it is new", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.121, "site_type": "news", "published": "2018-01-18T22:02:00.000+02:00", "replies_count": 0, "uuid": "7ed5a6d0a5aa8a4007f77ebb05ab9f1fd06af0fe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-money-tax-estates/your-estate-plan-needs-an-update-even-if-it-is-new-idUSKBN1F71VX", "ord_in_thread": 0, "title": "Your estate plan needs an update, even if it is new", "locations": [], "entities": {"persons": [{"name": "leon labrecque", "sentiment": "none"}, {"name": "labrecque", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "troy", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 2:02 PM / Updated 4 hours ago Your estate plan needs an update, even if it is new Beth Pinsker 4 Min Read \nNEW YORK (Reuters) - Got a dusty old binder with your will and estate plan? Even if you had your paperwork set up a few years ago, all of your documents are now out of date, thanks to new tax laws that went into effect at the turn of the year. \n“Blow the dust off and see if it’s even needed anymore,” said certified financial planner Leon LaBrecque, who is also a tax attorney, a certified public accountant and a chartered financial analyst in Troy, Michigan. \nStrategies that financial planners and trust attorneys have been using for years to help families avoid paying estate taxes may now fall by the wayside, because the exemption for the size of estates has doubled to $22 million for couples, from $11 million. It was just $600,000 in 1997. \n”Not a lot of planners have clients worth more than $22 million, said LaBrecque. \nThose who have ultra-high-net-worth clients can still employ the same playbook of trusts to avoid taxes, but those with estates worth less than $22 million will not need to bother with things like credit-bypass trusts, qualified terminable interest property trusts and many life insurance trusts. \nBut that does not mean trusts will fade away and that all estate planning can just cease. The most important parts of the process have to do with your financial health while you are still alive: You need power of attorney forms and healthcare proxies in case you are incapacitated. \nYou also need to make sure your beneficiaries are updated on all your accounts, especially life insurance policies and 401(k)s from old jobs. \n“It’s still staggering how many people with real means have no documents. Now that they don’t need to pay tax, we worry they won’t do the things they need to do,” said Jill Schlesinger, a personal finance expert who serves as the Senior CFP Board Ambassador. REASONS TO PLAN \nEstate planning at its core is about keeping control over your assets even after you die. \n“Maybe you want to make sure that your kids receive your money in a certain way,” said Schlesinger. “Maybe you don’t want sister-in-law or daughter-in-law to be involved. Maybe you want it to jump a generation. Maybe you need a special needs trust. There are all sorts of rationales for creating a document.” \nAustin Frye, a financial planner based in Aventura, Florida, said his practice does more trusts now than ever, and he expects that to continue. \n“They are for protective reasons and not for tax savings,” Frye said. “A rise in the diagnosis of autism, special needs, drug and alcohol addictions, Alzheimer‘s, and other problems including multiple marriages and non-traditional relationships - these have kept our trust department busier than ever.” \nAnother reason for trusts is to keep the state out of your affairs after you die. Property that is not jointly owned or set up to transfer directly to a beneficiary - like a bank account- can end up being evaluated in an expensive and time-consuming probate process. This often includes things like a vacation property in another state, a piece of expensive art or a stamp collection, or a stock portfolio with no named beneficiary. \n“Everything needs to be in some kind of trust,” Frye said. GIVING IT AWAY \nEven with the doubling of the estate tax limit, charitable trusts can help with your tax burden. \nHouston financial planner Scott Bishop said that by leaving a substantial IRA to charity through a trust you can avoid the taxes your heirs would pay when they liquidate the account. \nGiving appreciated stock to a charity through a trust or a donor-advised fund can bypass capital gains taxes and still offset income in the year you donate if you itemize deductions, Bishop added. \nWith all of these changes, planners said to keep in mind the new law sunset in 2025. \nFrye’s pro tip for riding the roller coaster: “Simplify and review.” Editing by Bernadette Baum", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T22:02:00.000+02:00", "crawled": "2018-01-18T16:15:04.010+02:00", "highlightTitle": ""}