{"organizations": [], "uuid": "961140e2c412326ffb0da6719f8be62eb76118b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-romania-government/romanias-president-nominates-defense-minister-fifor-as-interim-pm-idUSKBN1F515I", "country": "US", "domain_rank": 408, "title": "Romania's president nominates defense minister Fifor as interim PM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T12:55:00.000+02:00", "replies_count": 0, "uuid": "961140e2c412326ffb0da6719f8be62eb76118b5"}, "author": "", "url": "https://www.reuters.com/article/us-romania-government/romanias-president-nominates-defense-minister-fifor-as-interim-pm-idUSKBN1F515I", "ord_in_thread": 0, "title": "Romania's president nominates defense minister Fifor as interim PM", "locations": [], "entities": {"persons": [{"name": "fifor", "sentiment": "negative"}, {"name": "mihai tudose", "sentiment": "none"}, {"name": "catherine evans", "sentiment": "none"}, {"name": "iohannis", "sentiment": "none"}, {"name": "klaus iohannis", "sentiment": "none"}, {"name": "mihai fifor", "sentiment": "none"}, {"name": "radu marinas", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUCHAREST (Reuters) - Romania’s Social Democrat Party (PSD) proposed a close ally of party leader Liviu Dragnea as prime minister on Tuesday to succeed Mihai Tudose, who quit after falling out with Dragnea.\nEuropean Parliament lawmaker Viorica Dancila, 54 could back efforts to dilute the penalties for corruption, which would help pave the way for Dragnea, barred from government by a vote-rigging conviction and on trial for abuse of office, to return to front-line politics.\nHowever, President Klaus Iohannis, a bitter critic of the government, is not obliged to nominate Dancila to parliament.\nTudose resigned suddenly on Monday after only seven months in the job after failing to force the resignation of Interior Minister Carmen Dan, also close to Dragnea, who serves as the speaker of the lower house.\nThe argument over how hard to fight corruption in Romania, one of Europe’s most graft-prone states, has dominated its politics since the ex-communist state joined the European Union just over a decade ago.\nDragnea, a former deputy prime minister, has been pulling strings behind the scenes since his conviction in 2016.\nIn June, his PSD pushed out its previous prime minister, Sorin Grindeanu, less than six months into his term after he failed to relax anti-graft rules in the face of widespread public protests.\nLast month, a group of PSD lawmakers published a draft bill last month proposing that abuse of office offences that cause financial damage of less than 200,000 euros ($237,000) should no longer be punishable.\nIf approved, the bill would halt a trial in which Dragnea is accused of abuse of office when he was chair of a county council.\n“‘Save soldier Dragnea’ would be the theme of the year 2018. His political fate and that of his other colleagues depends crucially on amending judicial legislation,” said independent political commentator Cristian Patrasconiu.\n“Dancila has been a vehement supporter of the need to amend justice laws and she is regarded as an advocate of Dragnea’s thinking. She is 100 percent controllable and accountable.”\nPRESIDENT‘S CHOICE\nComplicating the outlook, Iohannis on Monday appointed Defence Minister Mihai Fifor, also president of PSD’s national Council, as interim prime minister, leading to speculation that Fifor was Iohannis’s preferred replacement for Tudose.\nIohannis is due to nominate the next prime minister on Wednesday, who will then face a parliamentary vote of confidence. Under Romanian law, he has leeway in his selection and is expected to pick a candidate from the biggest party.\n“I want us to have a swift procedure that will lead to a new government because ... I want to avoid ... potential negative economic consequences,” he said.\nAnalysts said Iohannis, an outspoken critic of the government and its anti-corruption record, might nominate Fifor in the hope that, by winning a vote of confidence in parliament, he would undermine Dragnea within the PSD.\n“The president may be seeking to dilute Dragnea’s power and impose a new balance of power in the party,” said Adrian Basaraba, professor of political sciences at West Timisoara University.\nDancila is a vice-chair of the European parliament’s Committee on Agriculture and Rural Development.\nAn oil and gas drilling engineer, she was born in the same county as Dragnea and served under him on the Teleorman County Council.\nFifor, 47, has overseen the large-scale acquisition of military equipment and hardware to modernise Romania’s army, including Patriot missiles from the United States.\nThere was little market reaction on Tuesday, with investors preferring to focus on the economy, which grew at 8.8 percent in the third quarter, the fastest rate in the EU.\nAdditional reporting by Luiza Ilie; Editing by Kevin Liffey\n ", "external_links": [], "published": "2018-01-16T12:55:00.000+02:00", "crawled": "2018-01-16T13:08:39.002+02:00", "highlightTitle": ""}