{"organizations": [], "uuid": "f8cdc186516ec53bb6a54747dbf98029405e8e3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-fiduciary-expert-blaine-aikin-takes-expanded-cefexa-role-as-executive-chairman-as-company-enhances-its-investment-advisor.html", "country": "US", "domain_rank": 767, "title": "Fiduciary Expert Blaine Aikin Takes Expanded CEFEX® Role As Executive Chairman As Company Enhances Its Investment Advisor Certification To Verify Conformity To DOL Fiduciary Rule Provisions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:15:00.000+02:00", "replies_count": 0, "uuid": "f8cdc186516ec53bb6a54747dbf98029405e8e3a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-fiduciary-expert-blaine-aikin-takes-expanded-cefexa-role-as-executive-chairman-as-company-enhances-its-investment-advisor.html", "ord_in_thread": 0, "title": "Fiduciary Expert Blaine Aikin Takes Expanded CEFEX® Role As Executive Chairman As Company Enhances Its Investment Advisor Certification To Verify Conformity To DOL Fiduciary Rule Provisions", "locations": [], "entities": {"persons": [{"name": "blaine aikin", "sentiment": "neutral"}, {"name": "blaine f. aikin", "sentiment": "none"}, {"name": "c. frederick reish", "sentiment": "none"}, {"name": "aikin", "sentiment": "none"}], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "neutral"}, {"name": "dol", "sentiment": "none"}, {"name": "cefex", "sentiment": "none"}, {"name": "partner drinker biddle & reath", "sentiment": "none"}, {"name": "cfp", "sentiment": "none"}, {"name": "department of labor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 16, 2018 /PRNewswire/ -- CEFEX, the Centre for Fiduciary Excellence, LLC, a Fi360 company, is pleased to announce the appointment of Blaine F. Aikin, AIFA ®, CFA, CFP® as Executive Chairman of the company. In conjunction with this industry leader appointment, CEFEX is enhancing its Investment Advisor certification program. CEFEX's independent assessment assures institutional and individual investors that certified advisory firms have policies and procedures in place to apply fiduciary best practices and comply with the new regulation.\nCEFEX is hosting a webinar on Thursday, February 1 at 1:30PM, ET to highlight what Aikin calls the \"key to compliance\" with the Department of Labor's Fiduciary Rule – conformity to Impartial Conduct Standards. The webinar will feature C. Frederick Reish, Partner Drinker Biddle & Reath, who guided the CEFEX assessment methodology, along with Mr. Aikin. To join in the webinar: Securing Your Grip on the Key to Compliance with Fiduciary Regulations: CEFEX Now Verifies Conformity with DOL's Impartial Conduct Standards, please register at https://register.gotowebinar.com/register/3142565148851535619 .\nIn joining CEFEX, Blaine Aikin shares, \"I am extremely excited to be taking a larger and more direct role in CEFEX. Institutional and individual investors are increasingly attuned to the importance of selecting financial service providers who adhere to the highest standards of ethics and competence. Moreover, there are mounting regulatory, legal, and competitive pressures that are making it imperative for financial services firms to embed best fiduciary practices in the way they serve clients.\" Aikin continues, \"For more than a decade, CEFEX has been certifying top financial services firms to publicly verify and recognize them for their fiduciary excellence and to help them mitigate regulatory, litigation, and reputational risks. It has never been more important for firms to earn the CEFEX mark of distinction to tangibly demonstrate that they are worthy of trust and confidence.\"\nIn his new role at CEFEX, Mr. Aikin will provide fiduciary expertise, strategic guidance and product leadership to the program. He has served on the CEFEX Advisory Council and Board of Directors since inception. Most recently, Mr. Aikin was the 2017 Chair of the Board of Directors for the CFP Board of Standards. He is a well-known speaker and writer, including author of the monthly Fiduciary Corner column in InvestmentNews magazine. He also continues in his role as Executive Chairman of Fi360, Inc.\nCEFEX is also pleased to advance its mission to promote and verify fiduciary excellence in the field of financial advice by directly addressing conformity to the DOL Rule in a legal opinion associated with the Investment Advisor certification process. The DOL's new definition of fiduciary advice means that almost any investment recommendation to a plan, participant or IRA is a fiduciary act. If these recommendations result in non-level or third party compensation to an advisor, a prohibited transaction generally occurs. To address this situation, the DOL has introduced a Best Interest Contract Exemption (BICE) that allows an advisor to comply with the Rule by implementing Impartial Conduct Standards that require the advisor to a) adhere to the best interest standard of care; b) receive no more than reasonable compensation, and; c) make no materially misleading statements.\n\"The DOL BICE regulation imposes important requirements upon Investment Advisors and the CEFEX certification process provides an excellent basis for concluding that an advisor meets or exceeds the fiduciary requirements of ERISA and of the Impartial Conduct Standards,\" stated Fred Reish, managing partner, Drinker, Biddle & Reath, LLP (DBR) of Los Angeles, CA.\nThe CEFEX assessment has been revised to meet and in some cases exceed the legal requirements that became effective June 9, 2017. The detailed analysis was performed by DBR and follows previous legal reviews. Firms certified by CEFEX in the United States will continue to receive a legal opinion letter issued by DBR, now stating that they have practices and procedures in place that satisfy the Impartial Conduct Standards, including the best interest standard of care in the DOL's BICE or Prohibited Transaction Exemption 2016-01.\nAbout CEFEX ® :\nCEFEX ® , Centre for Fiduciary Excellence, LLC, a Fi360 ® company, is an independent certification organization. CEFEX works closely with industry experts to provide comprehensive assessment programs to improve the fiduciary practices of investment stewards, advisors, recordkeepers, administrators and managers. CEFEX is based in Pittsburgh, PA. Learn more at www.cefex.org via Twitter or on LinkedIn .\nCEFEX has certified almost 200 organizations to the standards for Investment Advisors, Investment Stewards, Investment Managers, Support Services, Recordkeepers and Third Party Administration in 6 countries. These firms manage more than $400B fiduciary assets. In existence since 2006, the CEFEX mark is an indication of excellence and accountability in an industry that values the role of a fiduciary. CEFEX's independent annual certification program involves a detailed assessment of operational data and procedures, including on-site interviews and verification. Certified firms are registered for public review here .\nCEFEX certification assessments are performed by professionals who have received the Accredited Investment Fiduciary Analyst ® (AIFA) designation from Fi360.\nAbout Fi360 ® :\nFi360, a fiduciary education, training and technology company, helps financial intermediaries use prudent fiduciary practices to profitably gather, grow and protect investors' assets. Since 1999, the firm has provided financial professionals with the tools necessary to act as a fiduciary in their work with investors. Headquartered in Pittsburgh, PA, Fi360 is the home of the Accredited Investment Fiduciary® (AIF®) designation, the Fiduciary Focus Toolkit™ and the Fi360 Fiduciary Score®. Fi360 is also the parent company of CEFEX. Learn more at www.Fi360.com , via Twitter or on LinkedIn\nContact:\nLeslie Padilla\nT: (267) 800-4316\nE: LPPR@icloud.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/fiduciary-expert-blaine-aikin-takes-expanded-cefex-role-as-executive-chairman-as-company-enhances-its-investment-advisor-certification-to-verify-conformity-to-dol-fiduciary-rule-provisions-300582458.html\nSOURCE CEFEX", "external_links": ["https://www.cefex.org/RegisteredCompanyList/", "http://www.fi360.com/", "https://www.linkedin.com/company/cefex/", "https://twitter.com/fi360", "https://www.linkedin.com/company/fi360", "https://twitter.com/cefex1", "http://www.cefex.org/", "http://www.prnewswire.com/news-releases/fiduciary-expert-blaine-aikin-takes-expanded-cefex-role-as-executive-chairman-as-company-enhances-its-investment-advisor-certification-to-verify-conformity-to-dol-fiduciary-rule-provisions-300582458.html", "https://register.gotowebinar.com/register/3142565148851535619"], "published": "2018-01-16T16:15:00.000+02:00", "crawled": "2018-01-16T16:18:28.000+02:00", "highlightTitle": ""}