{"organizations": [], "uuid": "97df2e8200d2e85bd68c58e111e7a5284e463c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-santa-fe-gold-completes-acquisition-of-bullards-peak-corporation-and-black-hawk-consolidated-mines-adding-a-world-class.html", "country": "US", "domain_rank": 767, "title": "Santa Fe Gold Completes Acquisition of Bullard's Peak Corporation And Black Hawk Consolidated Mines Adding A World Class Premium Silver Mine And In Addition, A Potential Major Porphyry Silver Discovery Nearby To Its Rapidly Growing Portfolio Of Lucrative", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T17:16:00.000+02:00", "replies_count": 0, "uuid": "97df2e8200d2e85bd68c58e111e7a5284e463c9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-santa-fe-gold-completes-acquisition-of-bullards-peak-corporation-and-black-hawk-consolidated-mines-adding-a-world-class.html", "ord_in_thread": 0, "title": "Santa Fe Gold Completes Acquisition of Bullard's Peak Corporation And Black Hawk Consolidated Mines Adding A World Class Premium Silver Mine And In Addition, A Potential Major Porphyry Silver Discovery Nearby To Its Rapidly Growing Portfolio Of Lucrative", "locations": [], "entities": {"persons": [{"name": "bullard", "sentiment": "neutral"}, {"name": "sant", "sentiment": "none"}], "locations": [{"name": "pinos altos district of grant county", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "n.m.", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}], "organizations": [{"name": "lucrative santa fe gold corp", "sentiment": "neutral"}, {"name": "santa fe gold completes acquisition of bullard's peak corporation and black hawk consolidated mines", "sentiment": "neutral"}, {"name": "santa fe gold", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Santa Fe Gold Corp has completed 100% of Purchase of Silver Mines: Bullard's Peak Corporation and Black Hawk Consolidated Mines Comprising The AG1 Premier Silver Mine, A Potential Major Silver Porphyry Discovery, All Other Related Mining Assets And Massive Amounts of Documentation Currently Completing Transfer To Santa Fe Gold, Which Will Provide A Definitive Updated Report On Valuation Expected To Be Released Soon. Preparations For Early Production Are Already Well Underway And Are Expected To Accelerate With All Possible Haste As Soon As Practicable.\nCompany Has Also Completed Acquisition Of Another Highly Prospective Gold And Silver Deposit Within The Vicinity Of The AG1 Property, Known As: The Sunset Lode and the Sunset Placer Deposits in the Pinos Altos District of Grant County, New Mexico, Comprising Twenty Acres Each Of Potentially Similar Above Average High Grade Territory, Is Now Also Added To Santa Fe Gold's Precious Metals Mining Portfolio, Acquired On Exceptionally Favorable Terms With Further Acquisitions Pending.\nALBUQUERQUE, N.M., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Santa Fe Gold Corporation (OTC:SFEG), a U.S. based mining and exploration enterprise with emphasis on Gold, Silver, Copper, Precious, Industrial and Base metals and owner of multiple claims, including the Malone Mines complex incorporating 20 associated mine sites, the Playas Lake Bed area of Hidalgo County, New Mexico and now: Bullard's Peak Corporation and Black Hawk Consolidated Mines incorporating AG1 Silver mine along with a potential major Porphyry Silver discovery and additional deposits of Cobalt, Lithium, Manganese and Nickel along with the Sunset Lode and Placer Lode Gold and Silver Deposits located in Pinos Altos Gold, is pleased to announce it has completed the purchase of the aforementioned properties and two companies containing all related assets and documentation currently under transfer to Santa Fe Gold Corporation and expected to be completed forthwith.\nPresident and CEO Tom Laws Comments\n\"We are very pleased to announce the final payment of $500,000 has been made to complete the $3 Million purchase of Bullard's Peak Corporation and Black Hawk Consolidated Mines incorporating AG1 Silver mine along with a potential major Porphyry Silver discovery and additional deposits of Cobalt, Lithium, Manganese and Nickel, with all assets, research and final documentation currently under transfer to Santa Fe Gold Corporation. From the historical data thus far reviewed, we can confidently make the assumption that the AG1 Silver Mine is worth substantially more than what we paid for it. We look forward to providing additional details on why we are really excited about Bullard's Peak and Black Hawk and other new acquisitions that we expect to announce in coming weeks. We were also particularly fortunate to avail of the very promising nearby Sunset Lode and Sunset Placer deposits in the Pinos Altos District of Grant County, New Mexico on excellent terms.\nFuture announcements in which we will soon reveal additional details, will show these acquisitions have the potential to be game changers for Santa Fe shareholders. We remain confident in our overall strategy and are redoubling our efforts to acquire additional very attractive properties and make complementary investments and joint ventures that will continue to reflect favorably on our capacity to identify, research, qualify and secure the exceptional additional acquisitions we are currently working on: With the recent record breaking up moves in Gold and Silver and increasingly bullish predictions on precious metals, we continue to believe 2018 will be a very exciting year for Santa Fe shareholders.\"\nAbout Santa Fe Gold\nSanta Fe Gold is a U.S.-based mining and exploration enterprise and owns the following mining assets: The Knight’s Peak region of Grant County, New Mexico comprising the Malone Mines, Patanka, Hillcrest, Barranca and Principal Mines, altogether incorporating some twenty mine sites and all located at Knight’s Peak, together with an expanded area surrounding the Malone Mines in the southern region of Burro Mountains, New Mexico. The company also owns very significant holdings in the Playas Lake Bed Area of Hidalgo County that includes the presences of Titanium ore and rare earth minerals and deposits. It also recently completed acquisition of Bullard's Peak Corporation and Black Hawk Consolidated Mines incorporating AG1 Silver mine along with a potential major Porphyry Silver discovery and additional deposits of Cobalt, Lithium, Manganese and Nickel. The Company coincidentally added the Sunset Lode and Sunset Placer Gold and Silver Deposits located in the Pinos Altos District of Grant County, New Mexico to its growing portfolio of precious and base metals and mineral assets. Substantial amounts of historical data outlining exceptional grade Silver and Gold Mines with surrounding and nearby deposits along with significant occurrences of Cobalt, Lithium, Manganese, Nickel and other Rare Earth Discoveries are currently being analyzed, surveyed and evaluated in order to develop an up to date assessment and estimate of valuations expected to be released soon.\nSanta Fe Gold’s Exploration and Development Team continues to be very active regarding exploration, surveillance, research, acquisition of multiple additional properties as it finalizes analysis of a number of attractive and economically viable new prospects.\nThe company continues to execute on its aggressive acquisition program that is totally focused on positioning Santa Fe Gold to resume mining and production operations from multiple sources expected in the near to medium term.\nFor more information and to register for updates:\nPlease visit www.santafegoldcorp.com .\nForward Looking Statements\nPlease refer to the Forward-Looking Statements link at the bottom left of Santa Fe Gold's website for all relevant disclosures.\nContact:\nSanta Fe Gold Corporation\nFrank Mueller, CFO\n(505) 255-4852\nSource:Santa Fe Gold Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=P5_kUGVEih--unpkrlqayQoF1VtfYv4Mmg_-4X7zkOYrraConco90dWvhlrFzGWHbLvR0bxoxsKsLkh6aE0xUjtW4Ox0PuqTrGoH6msIY3E="], "published": "2018-01-10T17:16:00.000+02:00", "crawled": "2018-01-10T18:51:41.014+02:00", "highlightTitle": ""}