{"organizations": [], "uuid": "28726e823fb364f20e03ffbc9b7ce72dbbc61838", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 65, "shares": 65, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104929190-GettyImages-154498284.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/reports-of-chinese-construction-in-indian-state-of-arunachal-pradesh.html", "country": "US", "domain_rank": 767, "title": "Reports of Chinese construction in Indian state of Arunachal Pradesh", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.039, "site_type": "news", "published": "2018-01-05T05:22:00.000+02:00", "replies_count": 0, "uuid": "28726e823fb364f20e03ffbc9b7ce72dbbc61838"}, "author": "Nyshka Chandran", "url": "https://www.cnbc.com/2018/01/04/reports-of-chinese-construction-in-indian-state-of-arunachal-pradesh.html", "ord_in_thread": 0, "title": "Reports of Chinese construction in Indian state of Arunachal Pradesh", "locations": [], "entities": {"persons": [{"name": "doklam", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "arunachal pradesh", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "bhutan", "sentiment": "none"}, {"name": "donglang", "sentiment": "none"}, {"name": "upper siang", "sentiment": "none"}, {"name": "tibet", "sentiment": "none"}], "organizations": [{"name": "press trust of india", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Four months after India and China deescalated a Himalayan border spat, Beijing appears to be ramping up the pressure in another territory disputed by both countries.\nIndia considers Arunachal Pradesh, lying east of Bhutan, to be one of its 29 states, but China claims the area as part of southern Tibet. The territory, a key focus of a 1962 war fought between the Asian giants, lies along the Sino-Indian border, which is represented by a demarcation line called the Line of Actual Control.\nBIJU BORO/AFP/Getty Images The India-China border in Arunachal Pradesh In the final days of December, Chinese personnel crossed that line and began road construction in Arunachal Pradesh's Upper Siang district, several Indian media outlets reported this week. The Chinese team had advanced around 1 kilometer and then returned after being confronted by Indian troops, who seized the construction equipment, Press Trust of India and The Indian Express reported on Wednesday.\nLast year, Chinese construction in another disputed border area — a plateau known as Donglang in China and Doklam in India — resulted in a tense stand-off involving troops from both countries . The confrontation lasted from June until late August and weighed heavily on bilateral ties.\nshow chapters It looks like the India-China rivalry is spreading to another front      9:17 AM ET Thu, 28 Dec 2017 | 00:51 Indian media have said there was \"no face off\" between the two parties and that the issue was being resolved in meetings. In response, Chinese Foreign Ministry Spokesperson Geng Shuang said on Wednesday that he was \"not aware\" of the matter, adding that his country has \"never recognized the so-called Arunachal Pradesh.\"\nAnother Himalayan realm hotly contested by both countries is Aksai Chin, which New Delhi considers part of its Jammu and Kashmir state while China believes the zone belongs to its Xinjiang Uighur Autonomous Region. Territorial disputes aside, Beijing and New Delhi are also competing for political and economic influence in the region.", "external_links": [], "published": "2018-01-05T05:22:00.000+02:00", "crawled": "2018-01-05T05:51:50.008+02:00", "highlightTitle": ""}