{"organizations": [], "uuid": "47e40f7f044f2bf1a1f35313d69958edfda41bb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/africa-currencies/update-1-africa-fx-kenya-shilling-zambia-kwacha-to-firm-ugandan-shilling-to-weaken-idUSL8N1P64NQ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-AFRICA FX - Kenya shilling, Zambia kwacha to firm, Ugandan shilling to weaken", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:14:00.000+02:00", "replies_count": 0, "uuid": "47e40f7f044f2bf1a1f35313d69958edfda41bb2"}, "author": "", "url": "https://www.reuters.com/article/africa-currencies/update-1-africa-fx-kenya-shilling-zambia-kwacha-to-firm-ugandan-shilling-to-weaken-idUSL8N1P64NQ", "ord_in_thread": 0, "title": "UPDATE 1-AFRICA FX - Kenya shilling, Zambia kwacha to firm, Ugandan shilling to weaken", "locations": [], "entities": {"persons": [], "locations": [{"name": "zambia", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "nairobi", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:15 PM / Updated 38 minutes ago UPDATE 1-AFRICA FX - Kenya shilling, Zambia kwacha to firm, Ugandan shilling to weaken Reuters Staff 4 Min Read \n(Adds Nigeria) \nNAIROBI, Jan 11 (Reuters) - Kenya’s shilling and Zambia’s kwacha are expected to strengthen against the dollar over the week to next Thursday, while the Ugandan and Tanzanian shillings are forecast to weaken, traders said. KENYA \nThe Kenyan shilling is expected to strengthen due to improved dollar inflows from remittances and horticulture, while general importer demand is also seen increasing. \nCommercial banks quoted the shilling at 103.15/35 per dollar, the same as last Thursday’s close. \n“It could gain against the dollar because of improved inflows from remittances from overseas,” said a senior trader from a commercial bank. UGANDA \nThe Ugandan shilling is expected to weaken and probably go past 3,700 in the coming days due to demand for dollars from manufacturing and energy companies and offshore investors selling government securities. \nCommercial banks quoted the shilling at 3,655/3,665, weaker than last Thursday’s close of 3,640/3,650. On Wednesday Bank of Uganda sold an undisclosed amount of dollars to relieve the downward pressure on the shilling. \n“We anticipate that the central bank will be quite active ... and manage the depreciation but if they stay out we’ll hit 3,700,” Faisal Bukenya, head of treasury at Exim Bank, said. NIGERIA \nThe naira is expected to be largely unchanged for foreign investors next week after a slow start of trading at the beginning of the year. \nThe naira traded at 360 to the dollar for investors, compared with last Thursday’s close of 362. \nTraders said volumes were low but foreign investors have resumed selling which would help boost dollar liquidity on the currency market. \nOn the official market, it was quoted at 305.80, supported by central bank’s regular intervention. Nigeria has at least five exchange rates for the naira. TANZANIA \nThe Tanzanian shilling is expected to weaken slightly, weighed down by dollar demand from oil companies and subdued agriculture exports. \nCommercial banks quoted the shilling at 2,240/2,245 to the dollar on Thursday, weaker than 2,239/2,244 a week ago. \n“The shilling will likely weaken next week due to increased demand for dollars from oil importers,” said a trader at CRDB Bank. GHANA \nGhana’s cedi is expected to remain stable on improving liquidity, helped by positive market sentiment and targeted central bank support. \nThe local unit was trading at 4.5490 to the dollar compared with 4.5407 at last Thursday’s close. \n“We do not expect a significant departure in the dollar/cedi trend in the coming week due to slow activities in the early weeks of the year,” said Raphael Adubila, Treasury officer of the Accra-based Northstar Home Finance. ZAMBIA \nThe kwacha is expected to strengthen, helped by companies selling dollars to pay taxes. \nCommercial banks quoted the currency of Africa’s second-largest copper producer at 9.8200 per dollar, up from 10.1000 a week ago. \n“The local unit is expected to remain bullish in the interim should supply continue to outweigh demand,” Cavmont Bank said in a note. (Reporting by John Ndiso, Fumbuka Ng‘wanakilala, Elias Biryabarema, Chris Mfula, Kwasi Kpodo and Chijioke Ohuocha; Compiled by George Obulutsa Editing by Jeremy Gaunt)", "external_links": [], "published": "2018-01-11T17:14:00.000+02:00", "crawled": "2018-01-11T17:46:52.029+02:00", "highlightTitle": ""}