{"organizations": [], "uuid": "ca74f51a7217dadeecd73683613e0ba2f0b4e05f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-meredith-board-of-directors-elects-steve-lacy-executive-chairman-and-tom-harty-president-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Meredith Board Of Directors Elects Steve Lacy Executive Chairman And Tom Harty President And Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:45:00.000+02:00", "replies_count": 0, "uuid": "ca74f51a7217dadeecd73683613e0ba2f0b4e05f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-meredith-board-of-directors-elects-steve-lacy-executive-chairman-and-tom-harty-president-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "Meredith Board Of Directors Elects Steve Lacy Executive Chairman And Tom Harty President And Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "tom harty", "sentiment": "negative"}, {"name": "steve lacy", "sentiment": "none"}, {"name": "harty", "sentiment": "none"}, {"name": "joe ceryanec", "sentiment": "none"}, {"name": "john zieser", "sentiment": "none"}, {"name": "lacy", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}], "organizations": [{"name": "meredith board of directors elects steve lacy executive", "sentiment": "negative"}, {"name": "mdp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "meredith corporation", "sentiment": "negative"}, {"name": "meredith", "sentiment": "none"}, {"name": "time inc.", "sentiment": "none"}, {"name": "meredith's finance", "sentiment": "none"}, {"name": "local media groups", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DES MOINES, Iowa, Jan. 29, 2018 /PRNewswire/ -- Meredith Corporation (NYSE:MDP; www.meredith.com ) announced today that its Board of Directors has elected Steve Lacy Executive Chairman and Tom Harty President and Chief Executive Officer, effective February 1, 2018. Lacy is currently Chairman and Chief Executive Officer and Harty is President and Chief Operating Officer.\nIn his new role, Lacy, 63, will work with Harty to determine Meredith's strategic agenda; continue to represent Meredith to the investment and financial communities; lead all Board activities; and play a greater role in media industry association activities, particularly legislative initiatives.\nIn his new role, Harty, 55, will continue to lead Meredith's National and Local Media Groups, and direct the integration of the Time Inc. acquisition. He will add responsibility for Meredith's Finance and Legal functions, which are led by Chief Financial Officer Joe Ceryanec and Chief Development Officer & General Counsel John Zieser, respectively.\nOn November 26, 2017, Meredith announced its acquisition of Time Inc., creating a powerful portfolio of leading multiplatform media brands that will reach more than 200 million American consumers, including more than 85 percent of U.S. Millennial women. Meredith will become a Top 10 digital player in the media space with 170 million monthly unique visitors and $700 million of digital advertising revenues. Meredith has secured regulatory approvals and completed all financing requirements, and the transaction is expected to close later this week.\n\"This is a pivotal time for Meredith Corporation and our Board believes we have the right leadership team and a well-defined plan to successfully integrate the Time Inc. acquisition and increase shareholder value,\" said Mell Meredith, Vice Chair of the Meredith Board of Directors. \"Steve and Tom have outstanding track records of achieving acquisition goals and growing Total Shareholder Return over time – and together with the best employees in the media industry – I am extremely confident in their ability to deliver for all our stakeholders, including consumers, advertisers, investors and employees alike.\"\n\"I look forward to working closely with Tom as we create an even more powerful media and marketing company,\" Lacy said. \"These new roles are the next phase in a well-planned succession process that began when Tom was promoted to President and COO in 2016. He has done an excellent job leading our operating groups, including a major role in our acquisition of Time Inc.\"\n\"I'm excited to lead the best team in the media and marketing industry,\" Harty said. \"Here at Meredith, we are well-known for a collaborative culture that is highly effective in the marketplace. With our tremendous media portfolio – bolstered by the acquisition of the Time Inc. brands – we are extremely well-positioned to continue expanding our connection to consumers and helping advertisers who want to reach them.\"\nLacy joined Meredith in 1998 as Chief Financial Officer. He was promoted to National Media Group President in 2000, and named President and CEO in 2006. He became Chairman and CEO in 2010. Lacy has been instrumental in transforming Meredith into the multiplatform company it is today. He oversaw the aggressive expansion of its media portfolio; the launch of its digital business; and the growth of its brand licensing activities. Lacy is Chairman of the Board of The Association of Magazine Media, and serves on the Boards of The Advertising Council and The International Federation of the Periodical Press. He also serves on the Boards of Hormel Foods Corporation and Great Western Bank Corp.\nHarty joined Meredith in 2004 as its Chief Revenue Officer and President of Consumer Magazines. He was named National Media Group President in 2010. Under Harty's leadership, Meredith greatly expanded its media portfolio, adding brands such as Allrecipes.com , Shape, and Martha Stewart Living – along with the incoming Time Inc. brands. He created the innovative Meredith Sales Guarantee, which proves that advertising on Meredith's media platforms directly leads to an increase of product sales at retail. Immediately prior to Meredith, Harty was Senior Vice President for The Golf Digest Companies, a division of Advance Publications. His 30-plus years of media experience include senior leadership positions with several of the industry's largest companies. He currently serves as Treasurer and on the Board of The Association of Magazine Media and the Alliance for Audited Media.\nABOUT MEREDITH CORPORATION\nMeredith Corporation (NYSE: MDP; www.meredith.com ) has been committed to service journalism for more than 115 years. Today, Meredith uses multiple distribution platforms – including broadcast television, print, digital, mobile and video – to provide consumers with content they desire and to deliver the messages of its advertising and marketing partners.\nMeredith's National Media Group reaches 100 million unduplicated women every month, including 70 percent of U.S. Millennial women. Meredith is the leader in creating and distributing content across platforms in key consumer interest areas such as food, home, parenting and health through well-known brands such as Better Homes & Gardens, Allrecipes, Parents and Shape. Meredith also features robust brand licensing activities, including more than 3,000 SKUs of branded products at 5,000 Walmart stores across the U.S. and on Walmart.com . Meredith Xcelerated Marketing is an award-winning, strategic and creative agency that provides fully integrated marketing solutions for many of the world's top brands.\nMeredith's Local Media Group includes 17 television stations reaching 11 percent of U.S. households. Meredith's portfolio is concentrated in large, fast-growing markets, with seven stations in the nation's Top 25 – including Atlanta, Phoenix, St. Louis and Portland – and 13 in Top 50 markets. Meredith's stations produce over 700 hours of local news and entertainment content each week, and operate leading local digital destinations.\nMeredith's balanced portfolio consistently generates substantial free cash flow, and the Company is committed to growing Total Shareholder Return through dividend payments, share repurchases and strategic business investments. Meredith has paid a dividend for 71 straight years and increased it for 25 consecutive years, most recently to $2.18 per share on January 28, 2018.\nView original content with multimedia: http://www.prnewswire.com/news-releases/meredith-board-of-directors-elects-steve-lacy-executive-chairman-and-tom-harty-president-and-chief-executive-officer-300589557.html\nSOURCE Meredith Corporation", "external_links": ["http://www.meredith.com/", "http://www.prnewswire.com/news-releases/meredith-board-of-directors-elects-steve-lacy-executive-chairman-and-tom-harty-president-and-chief-executive-officer-300589557.html"], "published": "2018-01-29T19:45:00.000+02:00", "crawled": "2018-01-29T20:55:11.002+02:00", "highlightTitle": ""}