{"organizations": [], "uuid": "6710c396a8c7109c26867beab5619491936bf7f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222112058&w=1200&r=LYNXMPEE0E0KR", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/brilliant-kohli-leads-india-resistance-against-south-africa-idUKKBN1F4150", "country": "US", "domain_rank": 408, "title": "Brilliant Kohli leads India resistance against South Africa", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T12:20:00.000+02:00", "replies_count": 0, "uuid": "6710c396a8c7109c26867beab5619491936bf7f5"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/brilliant-kohli-leads-india-resistance-against-south-africa-idUKKBN1F4150", "ord_in_thread": 0, "title": "Brilliant Kohli leads India resistance against South Africa", "locations": [], "entities": {"persons": [{"name": "kohli", "sentiment": "negative"}, {"name": "virat kohli", "sentiment": "none"}, {"name": "sachin tendulkar", "sentiment": "none"}, {"name": "don brad", "sentiment": "none"}, {"name": "reuters/james oatway  kohli", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "centurion stadium", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}], "organizations": [{"name": "south africa reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 10:24 AM / Updated 3 hours ago Kohli shines, but South Africa on top in second test Reuters Staff 3 Min Read \nPRETORIA (Reuters) - India captain Virat Kohli blazed a magnificent century, but South Africa hold the upper hand after reaching 60 for two in their second innings on a difficult wicket at tea on day three of the second test on Monday. Cricket - India v South Africa - Second Test match - Centurion Stadium, Pretoria, South Africa - January 15, 2018. India’s Virat Kohli celebrates his century. REUTERS/James Oatway \nThe home side lead by 88 runs after they bowled India out for 307 after lunch, despite a classy 153 from Kohli, who played almost a lone hand in scoring half his side’s runs. \nAB de Villiers (33 not out) has taken the attack to the Indian bowlers after South Africa had sunk to three for two in their second innings on a wicket that is more Pune than Pretoria, keeping low and taking massive turn for the spinners. \nDe Villiers will resume after the interval with opener Dean Elgar (23 not out), who has battled for rhythm but hung around in an unbeaten third wicket partnership of 57 from 81 balls. \nSouth Africa had been rocked earlier by a double-strike from Indian seamer Jasprit Bumrah, who trapped both Aiden Markram (1) and Hashim Amla (1) leg before wicket with deliveries that skidded through after keeping low. \nThere would have been plenty of panic in the South African dressing room at that point, but De Villiers started playing attacking shots from the moment he reached the wicket to transfer the pressure back onto the tourists. Cricket - India v South Africa - Second Test match - Centurion Stadium, Pretoria, South Africa - January 15, 2018. India’s Virat Kohli celebrates his century. REUTERS/James Oatway \nKohli had spoken before the match about showing more “intent” against South Africa’s seam attack and he duly delivered, compiling a brilliant 153 not out from 217 balls. \nHe now has 21 test tons to go with 15 half-centuries, a conversion rate when passing 50 that is only bettered in the game by Australian great Don Brad man, who made 29 hundreds and 13 fifties. \nIndia had resumed on their overnight score of 183 for five, but lost Hardik Pandya (15) to a farcical run out as the all-rounder ambled into his crease and failed to put his bat down, only to be undone by a direct hit from Vernon Philander. \nKohli and Ravichandran Ashwin (38) shared a quick-fire seventh wicket stand of 71 in 14.2 overs, before the latter fell to Philander (1-46). \nMohammed Shami (1) edged a Morne Morkel (4-60) delivery to slip, while the latter also accounted for Ishant Sharma (3) when he was caught at short-leg. \nKohli was the last batsman out as he tried to attack the bowling, caught at deep mid-on to be become Morkel’s fourth victim of the innings. Reporting by Nick Said, editing by Ed Osmond and Christian Radnedge", "external_links": [], "published": "2018-01-15T12:20:00.000+02:00", "crawled": "2018-01-15T12:46:50.014+02:00", "highlightTitle": ""}