{"organizations": [], "uuid": "92419cfb8452a83e9caa55d4f6fb3354e3bf54ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226913778&w=1200&r=LYNXMPEE0U0P6", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-oil-prices/oil-could-struggle-to-top-70-as-u-s-output-offsets-opec-cuts-reuters-poll-idUSKBN1FK1DD", "country": "US", "domain_rank": 408, "title": "Oil could struggle to top $70 as U.S. output offsets OPEC cuts: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:10:00.000+02:00", "replies_count": 0, "uuid": "92419cfb8452a83e9caa55d4f6fb3354e3bf54ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-oil-prices/oil-could-struggle-to-top-70-as-u-s-output-offsets-opec-cuts-reuters-poll-idUSKBN1FK1DD", "ord_in_thread": 0, "title": "Oil could struggle to top $70 as U.S. output offsets OPEC cuts: Reuters poll", "locations": [], "entities": {"persons": [{"name": "cailin birch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "non-opec", "sentiment": "none"}, {"name": "economist intelligence unit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Oil prices are unlikely to advance much higher than $70 a barrel in 2018, with the market caught between the opposing forces of OPEC-led production cuts and surging U.S. output, a Reuters poll showed on Wednesday.\nThe survey of 34 economists and analysts forecast that Brent crude will average $62.37 a barrel in 2018, up from the $59.88 forecast in the previous monthly poll.\n“Steady demand growth, a clear commitment to supply restraint by key OPEC producer Saudi Arabia and persistent geopolitical risks will all help to keep a floor under oil prices,” said Cailin Birch, an analyst at the Economist Intelligence Unit.\n“However, we expect strong production growth from the U.S., as well as some opportunistic selling by both OPEC and non-OPEC members later in the year, to prevent prices from rising much higher than $70 per barrel on average.”\nBrent crude is on track for a fifth straight monthly gain, having averaged about $69 so far in January, but analysts said the rally is unlikely last beyond the first quarter.\nThey said U.S. production, which has risen more than 17 percent since mid-2016, could top 10 million bpd -- a level surpassed only by Saudi Arabia and Russia.\nRahul Prithiani, director at CRISIL Research, expects oil prices to range between $62 and $67 a barrel in 2018, citing rising U.S. oil output.\nMeanwhile, the world’s biggest oil consuming region, Asia, has recently started to import U.S. crude and could show increased appetite to draw more shipments east, analysts said.\nThe higher production has paved the way for a widening gap between U.S. crude prices (WTI) and both the Brent and Dubai benchmarks, making it is cheaper for Asian countries to import U.S. crude despite high freight costs.\n“As long as WTI continues to trail other regional crude benchmarks, U.S. oil should continue to find its way towards Asia,” said Giorgos Beleris, analyst at Thomson Reuters Oil Research and Forecasts.\nU.S. light crude is forecast to average $58.11 a barrel in 2018, up from the $55.78 predicted in the December poll. The contract has averaged about $63.63 thus far in 2018.\nAlongside the growth in U.S. oil output, the $65-plus price environment is encouraging other non-OPEC exporters, such as Brazil and Canada, to ramp up production through new projects.\nAnalysts said it was too early to predict whether OPEC would make changes to the duration of the pact to cut output by 1.8 million barrels per day, which is due to expire at the end of this year.\n“The output-cut agreement is unlikely to be extended beyond 2018 in its present form as the market will rebalance this year,” said Abhishek Kumar, senior energy analyst at Interfax Energy’s Global Gas Analytics in London.\n“Nevertheless, calls to formulate an exit strategy from the deal will gather pace. This, in turn, could see a gradual withdrawal from the agreement in 2019.”\nThe poll forecast Brent crude to average $61.62 in the fourth quarter and $61.29 in 2019.\nReporting by Koustav Samanta and Arpan Varghese in Bengaluru; Editing by Amanda Cooper and David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T19:10:00.000+02:00", "crawled": "2018-01-31T16:06:54.014+02:00", "highlightTitle": ""}