{"organizations": [], "uuid": "b4f931f91b1df11dbf472613c0a395a07b4b8755", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225192683&w=1200&r=LYNXMPEE0O18W", "site_section": "http://feeds.reuters.com/reuters/UKDomesticNews/", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-fracking-rules/britain-to-tighten-financial-checks-on-fracking-firms-idUKKBN1FE2AB", "country": "US", "domain_rank": 408, "title": "Britain to tighten financial checks on fracking firms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:45:00.000+02:00", "replies_count": 0, "uuid": "b4f931f91b1df11dbf472613c0a395a07b4b8755"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-fracking-rules/britain-to-tighten-financial-checks-on-fracking-firms-idUKKBN1FE2AB", "ord_in_thread": 0, "title": "Britain to tighten financial checks on fracking firms", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:47 PM / Updated an hour ago Britain to tighten financial checks on fracking firms Reuters Staff 3   Britain is tightening controls on firms hoping to carry out hydraulic fracking in parts of the country by adding a financial health check to the application process, the government said on Thursday. \nSubstantial amounts of shale gas are estimated to be trapped in underground rocks and the British government wants to exploit them to help offset declining North Sea oil and gas output, create jobs and boost economic growth. \nNo fracking - which involves extracting gas obtained from rocks broken up or fractured at high pressure with water and chemicals - has taken place in the country in the past 7 years after operations were halted at the first British site following earth tremors. \nThe government has since imposed several environmental and technical requirements which must be met before any company can carry out the process. Energy minister Greg Clark said on Thursday that additional financial criteria must also be met. \n“An equivalent assessment should be undertaken of the financial resilience of companies proposing to carry out hydraulic fracturing operations so that stakeholders can have confidence in the company’s ability to meet its commitments,” he said in a in a written statement on parliament’s website. \n“We will therefore look at the financial resilience of all companies wishing to carry out hydraulic fracturing operations alongside their application for Hydraulic Fracturing Consent,” he said. \nThird Energy, 95-percent-owned by Barclays is waiting for final sign off by Clark, to begin test fracking at its Kirby Misperton site in Ryedale, Yorkshire, northern England. \nClark said he was satisfied Third Energy had met the technical requirements but is seeking further financial information about the company to help make his final decision. \nClark said Third Energy had not yet submitted financial accounts for the period ending in December 2016, despite a statutory deadline of 30 September 2017 for them to do so. \nNo one from Third Energy was immediately available to comment. \nSeveral firms hope to use hydraulic fracking in Britain, including shale gas developer Cuadrilla and petrochemicals group Ineos. \nEnvironmental groups continue to be strongly opposed to fracking, concerned about the potential seismic activity and water contamination. Reporting By Susanna Twidale; Editing by Keith Weir", "external_links": [], "published": "2018-01-25T17:45:00.000+02:00", "crawled": "2018-01-25T18:17:13.001+02:00", "highlightTitle": ""}