{"organizations": [], "uuid": "d207650ff7a182f7da0a1c391ae86cf737e9efc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-692676170.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/apple-homepod-february-9-launch/", "country": "US", "domain_rank": 1196, "title": "Apple HomePod Ships February 9, Pre-Orders Start Jan. 26 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-23T11:36:00.000+02:00", "replies_count": 0, "uuid": "d207650ff7a182f7da0a1c391ae86cf737e9efc6"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/23/apple-homepod-february-9-launch/", "ord_in_thread": 0, "title": "Apple HomePod Ships February 9, Pre-Orders Start Jan. 26 | Fortune", "locations": [], "entities": {"persons": [{"name": "siri", "sentiment": "none"}, {"name": "homepod", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "apple music", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:36 AM EST \nAfter a brief delay, Apple’s HomePod is hitting store shelves next month. \nApple on Tuesday announced that it will release its HomePod wireless smart speaker on February 9. The company will begin taking pre-orders on the device on Friday, January 26. When HomePod hits store shelves, it’ll cost customers $349. It’ll be available in two colors: white and space gray. \nThe tech giant unveiled its HomePod last year . While it comes with support for its virtual personal assistant Siri, putting it in direct competition with devices like Amazon’s Echo and Google’s Home, Apple has touted its sound quality. In a statement on Tuesday, in fact, it was the device’s “stunning audio quality” and “incredible music listening experience” that took top billing. \nApple’s HomePod comes with support for Apple Music, the company’s streaming music service. It also can be used in stereo with another HomePod and if users want to put HomePods throughout the home to listen to audio in different rooms, they can. \nGet Data Sheet , Fortune’s technology newsletter \nOn the smart home side, Apple’s HomePod can be used to control everything from thermostats to lights through Apple’s HomeKit service. \nApple’s virtual personal assistant Siri stands at the center of the HomePod experience. Siri can be asked to do everything from playing music to setting reminders. It’s also by asking Siri that users can control the smart home gadgets around the house. \nTo boost the HomePod’s features, Apple has released a software development kit called SiriKit. The feature allows developers to integrate their apps with Siri, so they can be controlled via the HomePod. \nApple had hoped to release the HomePod in December, but announced in November that it would need more time. Apple didn’t say why it was forced to delay the device, but a report last week said that the company needed more time to ensure the HomePod’s software worked with the hardware. \nThe HomePod will be available in the United States at Apple’s stores and Best Buy . It’ll also be available in the U.K. and Australia on February 9. Other European countries will get HomePod in the spring. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T11:36:00.000+02:00", "crawled": "2018-01-23T20:29:27.032+02:00", "highlightTitle": ""}