{"organizations": [], "uuid": "08f5f8ff2a5bf11f81e30903ae4db64f96e37646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-obesity-joint-surgery/obesity-linked-with-disability-after-joint-surgery-idUKKBN1EY2MF", "country": "US", "domain_rank": 408, "title": "Obesity linked with disability after joint surgery", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T23:24:00.000+02:00", "replies_count": 0, "uuid": "08f5f8ff2a5bf11f81e30903ae4db64f96e37646"}, "author": "", "url": "https://uk.reuters.com/article/us-health-obesity-joint-surgery/obesity-linked-with-disability-after-joint-surgery-idUKKBN1EY2MF", "ord_in_thread": 0, "title": "Obesity linked with disability after joint surgery", "locations": [], "entities": {"persons": [{"name": "timothy gaulton", "sentiment": "none"}, {"name": "gaulton", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "obesity", "sentiment": "negative"}, {"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "university of pennsylvania", "sentiment": "none"}, {"name": "british journal of anaesthesia", "sentiment": "none"}, {"name": "perelman school of medicine", "sentiment": "none"}, {"name": "shereen lehman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 9:26 PM / Updated 21 minutes ago Obesity linked with disability after joint surgery Shereen Lehman 5 Min Read \n(Reuters Health) - People who undergo joint surgery, such as joint replacements for arthritis, are more likely to become dependent in the years following surgery if they are obese, researchers say. \nFurther research is needed to know why this happens and how to prevent it, the study team writes in British Journal of Anaesthesia. \n“I think there’s been a lot of research on mortality and a lot of research on complications, but not too much on how people actually get back to how they perform at home,” lead author Dr. Timothy Gaulton told Reuters Health. \n“That was a part of the reason that we wanted to look at the outcome, and in general obese patients,” said Gaulton, of the Perelman School of Medicine at the University of Pennsylvania in Philadelphia. \nIt’s important for potential joint surgery patients to know that in some circumstances, because of their age, weight or preoperative functional dependence, they may be at higher risk of getting worse after surgery, he said in a telephone interview. \n“It’s something that needs to be considered both for the patient and for the surgeon when they make this decision about moving forward with getting a joint surgery,” he said. \nThe researchers studied 2,519 adults over age 61 who had joint surgery for arthritis. About two-thirds of participants had joint replacements. And 45 percent were obese, meaning they had a body mass index (BMI) - a measure of weight relative to height - of 30 or above at the time of their surgery. \nBefore surgery and during the following two years, participants were asked if they had any physical, mental, emotional or memory problems that affected their activities of daily living. These activities could include things like getting out of bed, toileting, bathing and eating. Needing help for any of these tasks was labeled as a dependence disability. \nAbout 22 percent of participants reported new or worsening dependence approximately two years after their surgery - including more than one in four obese patients and one in five non-obese patients. Researchers calculated that obese joint surgery patients had a 35 percent higher risk of dependence after surgery compared to non-obese patients. \n“We weren’t surprised by the association between obesity and outcomes, but I think we were surprised that the percentage of patients who had a new disability after surgery was so high. It wasn’t just obese patients, I think it was elderly patients in general,” Gauton said. \nPhysicians may need to pay a little more attention to, and maybe counsel, not just obese patients but elderly patients in general. “They come in for surgery and an expectation of getting better. That might not always be the case,” he said. \nIt is important to note that improvement was seen for most obese and non-obese participants, said Dr. Michael Parks, an orthopedic surgeon with the Hospital for Special Surgery in New York City who wasn’t involved in the study. \n“So, the point is, joint surgery is still helpful whether patients are obese or not, but it shows that we need to do something for them more than just replace their joint,” Parks said in a phone interview. \n“One of the things that we do here at HSS, and that I hope is becoming more prevalent nationally, is we work collaboratively with our medical colleagues to try to address obesity,” he said. \nIt’s also important for patients to become involved in their own health care, Parks added. \n“Whether you go to your primary care doctor, whether you go to a nutritionist, whether you go next door to a center for weight loss that’s medical or whether you go to our center for weight loss that’s surgical, the point is, become involved in your health and do something to lose weight to make yourself a better candidate because that has implications on your surgical outcome, your risk, and this study shows that it has a long-term outcome on your dependence and your ability to be independent and your mobility,” he said. \nSOURCE: bit.ly/2BKQf1d British Journal of Anaesthesia, online December 13, 2017.", "external_links": [], "published": "2018-01-09T23:24:00.000+02:00", "crawled": "2018-01-09T23:48:10.012+02:00", "highlightTitle": ""}