{"organizations": [], "uuid": "09ffec32ca73ec7c588c351637b63c99757c1fdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222754923&w=1200&r=LYNXMPEE0G144", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-congress-shutdown/republicans-eye-another-short-term-bill-to-fund-government-idUSKBN1F61WX", "country": "US", "domain_rank": 408, "title": "Republicans eye another short-term bill to fund government", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:07:00.000+02:00", "replies_count": 0, "uuid": "09ffec32ca73ec7c588c351637b63c99757c1fdd"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-shutdown/republicans-eye-another-short-term-bill-to-fund-government-idUSKBN1F61WX", "ord_in_thread": 0, "title": "Republicans eye another short-term bill to fund government", "locations": [], "entities": {"persons": [{"name": "john kelly", "sentiment": "none"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "congressional hispanic caucus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:08 PM / Updated 24 minutes ago White House backs short-term government funding bill Richard Cowan 5 Min Read \nWASHINGTON (Reuters) - The White House threw its support on Wednesday behind a Republican proposal to pass a stopgap bill that would fund the U.S. government through Feb. 16 and avert a shutdown, dealing a blow to Democrats who want such a measure to include immigration protections. \n“We do support the short-term CR,” White House spokeswoman Sarah Sanders told reporters, referring to a so-called continuing resolution to fund government operations temporarily. \nCongress has been struggling for months on funding legislation and the government currently is running on its third temporary bill since the 2018 fiscal year began on Oct. 1. The latest funding measure expires on Friday. \nChances of including a deal on the status of “Dreamers” - young adults brought to the country illegally as children - in the next government spending bill dimmed after the White House sent chief of staff John Kelly to meet with Hispanic lawmakers. \nThe meeting was described as cordial but it became clear the two sides were as far apart as ever. \nAs hopes for an immigration agreement with the White House ebbed, Republicans moved forward on another short-term spending bill, which they want to pass and send to President Donald Trump’s desk by Friday. \nThe funding measure does not include a legislative shield for Dreamers but it does grant Democrats an unrelated, high-priority measure: a six-year reauthorization of the Children’s Health Insurance Program (CHIP). \nThe White House promised to be engaged in DACA negotiations next week if Democrats would support the new stopgap measure. Trump, seeking a legislative immigration fix, ordered the program begun under Democratic President Barack Obama to expire in March. \n“Let’s make a budget deal by Friday and let’s come back to work aggressively on Monday and make a deal on DACA and responsible immigration reform,” Sanders said. \nSenate Majority Leader Mitch McConnell said the Senate would take up the short-term funding bill as soon as the House of Representatives approves it. \nHowever, the Republican leader said he was waiting to find out what Trump would support before devoting floor time to any immigration bill. \n“I‘m looking for something that President Trump supports and he has not yet indicated what measure he is willing to sign,” McConnell said. “As soon as we figure out what he is for, then I would be convinced that we were not just spinning our wheels.” Speaker of the House Paul Ryan (R-WI) walk with House Majority Leader Kevin McCarthy (R-CA) during a news conference after a House Republican caucus meeting on Capitol Hill in Washington, U.S., January 17, 2018. REUTERS/Joshua Roberts \nEarlier, White House legislative liaison Marc Short emerged from a meeting with Kelly and House Majority Leader Kevin McCarthy and would not say when any sort of immigration deal might be reached. \n”There’s still a lot to do,” Short said. \nAfter the Congressional Hispanic Caucus met with Kelly, Democratic U.S. Senator Bob Menendez said the White House made demands on immigration that went far beyond the scope of border security or the Deferred Action for Childhood Arrivals (DACA) program that would shield Dreamers from deportation. \nMenendez said he hoped it was clear to Kelly that “they’re going to have to come more to the center if they truly want a fix.” Slideshow (8 Images) \n“ENOUGH IS ENOUGH” \nAgreement on a spending bill also is complicated by disagreements within the Republican Party, which holds majorities in both the Senate and House of Representatives. \nSenator Lindsey Graham, a Republican who helped craft a bipartisan immigration deal that Trump rejected last week, said he would not vote for another stopgap measure. “Enough is enough,” he said. \nIt was unclear whether the conservative House Freedom Caucus would back the new plan. A Freedom Caucus source told Reuters the group, at a meeting on Tuesday night, “generally did not support leadership’s current strategy” on the stopgap bill although they did not take an official position. Related Coverage Senate Democratic leader says senators revulsed by spending bill \nIt was also not clear whether Democrats would support another continuing resolution spending measure - especially if it does not contain the immigration provision. The Republicans’ slim majority in the Senate means they need some Democratic support to pass a funding measure. \nSenate Democratic Leader Chuck Schumer dismissed the Republican stopgap proposal as “a loser” that doesn’t help veterans, opioid addicts and retirees or meet defense needs. He said an “overwhelming number” of Democratic senators do not support it. \n“We don’t know whether the House will send us this bill, but the revulsion toward that bill was broad and strong,” Schumer said. \nHouse Speaker Paul Ryan criticized Democrats for using DACA as leverage for helping pass a government funding measure. \n“I think cool heads hopefully will prevail on this,” he said. Reporting by Richard Cowan and Susan Cornwell; Additional reporting by Makini Brice, Katanga Johnson, Lisa Lambert, Susan Heavey, Blake Brittain; Writing by Doina Chiacu; Editing by Bill Trott", "external_links": [], "published": "2018-01-17T17:07:00.000+02:00", "crawled": "2018-01-17T17:24:25.004+02:00", "highlightTitle": ""}