{"organizations": [], "uuid": "683d12de2c24f9393ecba577940cc236cca53c8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104977962-GettyImages-912415548.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/31/state-of-the-union-analysis-trumps-speech-was-remarkable-for-what-he-didnt-say.html", "country": "US", "domain_rank": 767, "title": "State of the Union analysis: Trump's speech was remarkable for what he didn't say", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:13:00.000+02:00", "replies_count": 0, "uuid": "683d12de2c24f9393ecba577940cc236cca53c8f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/state-of-the-union-analysis-trumps-speech-was-remarkable-for-what-he-didnt-say.html", "ord_in_thread": 0, "title": "State of the Union analysis: Trump's speech was remarkable for what he didn't say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "He bragged about the achievements of his administration so far and proposed ambitious legislative initiatives ahead. He hailed ordinary Americans who had done extraordinary things and called for new sense of national unity.\nIn other words, the most unconventional president in modern times, governing at a time of historic turbulence, delivered a conventional State of the Union that with some policy tweaks could have been given by any number of his recent predecessors.\nThe most remarkable thing about President Trump 's first State of the Union address Tuesday night may be that it wasn't particularly remarkable. That, and the fact that the most perilous challenge he faces went unmentioned.\nMore than any legislative proposal, Trump's future is likely to be shaped by the conclusions of special counsel Robert Mueller's probe into Moscow's meddling in the 2016 election. At issue is whether Trump's campaign colluded with Russia's illegal efforts to boost his candidacy, and whether Trump as president tried to obstruct the investigation into what had happened.\nMueller is now negotiating with Trump's lawyers for the ground rules to question him, a signal that at least some parts of the inquiry are nearly completed. What's more, the president may spark a firestorm within the next few days by approving the release of a classified House Intelligence Committee memo, disputed by Democrats, that raises questions about the origins of the inquiry.\nRead more from USA Today:\nTrump campaign: Send us $1 and we'll scroll your name during State of the Union live stream\nTrump clapping for himself becomes a thing\nWe fact checked 15 Trump State of the Union points. Some rang true, others mostly false or exaggerated\nBut that wasn't what Trump focused on from the well of the House, reading from the Teleprompter and generally sticking to the script. Gone was the dark rhetoric he had used in his inaugural address a year ago, when he decried \"American carnage.\" The chord he sought to strike Tuesday was more akin to the optimistic tone when he spoke to Congress a month after his inaugural.\n\"This is our new American moment,\" the president declared Tuesday. \"There has never been a better time to start living the American dream.\"\nThat may have seemed like an ironic turn of phrase for the DREAMers in the audience — young people brought illegally to the United States as children whose fate is caught in limbo during the debate over immigration. Some Democratic members of Congress invited DREAMers from their districts as their guests to watch the speech from the gallery, a not-so-subtle reminder of their plight.\nThere was another unspoken protest on the House floor among Democratic women in Congress. Most wore black to show solidarity with the #MeToo movement, as Hollywood women did at the Golden Globes awards earlier this month. Their message was both expansive and targeted: About 20 women have accused Trump of sexual misconduct in the past, allegations he has denied.\n(In what seems to be an emerging War of the Wardrobes, some Republican women in Congress wore red, white and blue in what they called a show of solidarity with the U.S. military. And some members of the Congressional Black Caucus, including Rep. Jim Clyburn of South Carolina, wore kente scarves and ties to rebuke Trump's vulgar characterization of African countries.)\nIn his speech, Trump adopted the language his White House predecessors have favored. The last five presidents, from Ronald Reagan to Barack Obama, had declared that the state of the union was \"strong.\" So did Trump. \"The state of our union is strong because our people are strong,\" he said.\nHe took credit for the nation's good economy , saying his administration had rolled back regulations, \"ended the war on American energy\" and \"turned the page on decades of unfair trade deals.\" He said the $1.5 trillion tax bill he signed in December, the only major legislation enacted last year, had brought \"tremendous relief for the middle class and small businesses.\"\nHe called for bipartisan action on his administration's immigration plan , which would offer a path to citizenship for 1.8 million Dreamers, build a wall along the nation's southern border, and curb some legal immigration. \"A down-the-middle compromise,\" he called it. Those on both sides apparently disagree: Immigration hardliners call the citizenship provision unacceptable, and there were scattered boos from Democrats when he extolled new limits on \"chain migration,\" which allows legal immigrants to sponsor family members.\nTrump also urged Democrats to join him in approving a $1.5 trillion infrastructure plan, including changes in environmental and other regulations to streamline the approval process for road, bridge and sewage projects. \"America is a nation of builders,\" he said. \"We built the Empire State Building in just one year. Isn't it a disgrace that it can now take 10 years just to get a permit approved for a simple road?\"\nBut there were limits to Trump's bipartisanship tone. Among the loudest applause lines was his declaration that the individual mandate in the Affordable Care Act had been repealed; Republicans cheered while Democrats sat stone-faced. Trump alluded to the debate over NFL players taking a knee during the national anthem to protest police brutality and racism by singling out for praise a 12-year-old boy who led an effort to place flags on veterans' graves. He \"reminds us...why we proudly stand for the national anthem,\" Trump said.\nAnd he declared, \"Americans are dreamers, too,\" in a section that blamed immigrants for violence against citizens. That undoubtedly dismayed DREAMers and their allies.\nTo be sure, the prospects for passage of any big bills this year seem long. Democrats see little incentive to give the president legislative victories in advance of what they hope will be an election \"wave\" in November, one that could give them control of the House. The GOP majority in the Senate has narrowed to 51 seats. Even the most skilled legislative tactician would find this political landscape difficult.\nNo modern president at this early point in his term has addressed an American public that is so unhappy about and divided by his leadership. Trump has the lowest job-approval rating of any modern president at this point in his term, and it has been uncommonly stable. Since last March, Trump's approval rating in the RealClearPolitics average of public national polls has consistently been below 45%; his disapproval rating has consistently been above 50%.\nSome presidents have gotten a bump in their approval rating after their first State of the Union address. But it seems unlikely that any speech is going to shake up an electorate that already seems so firmly set for and against Trump. The resonance of this State of the Union was reduced by the political situation of the day and the other, unprecedented ways the 45th president has devised to communicate with Americans and the world.\nFor that, watch the @realdonaldtrump Twitter feed on Wednesday morning.", "external_links": [], "published": "2018-01-31T16:13:00.000+02:00", "crawled": "2018-01-31T20:31:00.737+02:00", "highlightTitle": ""}