{"organizations": [], "uuid": "30dbab7c625486608cd39a949e14235d3e5c8322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/iran-nuclear-usa/u-s-sanctions-five-entities-tied-to-irans-missiles-program-idINKBN1ET2I2", "country": "US", "domain_rank": 408, "title": "U.S. sanctions five entities tied to Iran's missiles program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:42:00.000+02:00", "replies_count": 0, "uuid": "30dbab7c625486608cd39a949e14235d3e5c8322"}, "author": "", "url": "https://in.reuters.com/article/iran-nuclear-usa/u-s-sanctions-five-entities-tied-to-irans-missiles-program-idINKBN1ET2I2", "ord_in_thread": 0, "title": "U.S. sanctions five entities tied to Iran's missiles program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. senators and Trump administration officials met at the White House on Thursday, hoping to hammer out compromise legislation to tighten restrictions on Iran while keeping Washington in an international nuclear deal with Tehran.\nSenators Bob Corker, the Republican chairman of the Senate Foreign Relations Committee, and Ben Cardin, the panel’s top Democrat, had an evening meeting with President Donald Trump’s national security adviser, H.R. McMaster, to discuss possible legislation, Senate and White House aides said.\nThe stakes have risen in the past week with anti-government protests in several Iranian cities over economic hardships and corruption, the boldest challenge to Iran’s leadership in a decade.\nWorrying European allies who co-signed the 2015 accord, Trump has railed against the deal to limit Iran’s nuclear program in exchange for loosening sanctions reached under his Democratic predecessor, Barack Obama. In October, the Republican president announced that he would not certify that staying in the pact was in the U.S. national security interest, and threatened to pull out if lawmakers did not act to toughen it.\nMembers of Congress have been working since to come up with a bipartisan compromise that would give Trump enough political cover not to reimpose sanctions on Iranian oil before a deadline next week, an action that would kill the pact.\nAides said they were looking at measures including ending the requirement that Trump re-certify the agreement every 90 days and changing some of the so-called sunset provisions to allow the reimposition of U.S. sanctions, with no timetable, if Iran’s nuclear program reaches certain thresholds.\nAhead of the meeting, Corker said he hoped enough progress had been made that Trump might not restore the sanctions.\n“My sense is there’s a little momentum right now, and it doesn’t feel to me like we’re in a place where the president might do that, but who knows,” he told reporters at the Capitol.\nCONCERN OVER PROTESTS Corker said the protests in Iran made it more important that Washington not do anything to shift the focus from Iran’s government. “The last thing we need to do from my perspective would be to turn that attention to us,” he said.\nThe United Nations Security Council is scheduled to meet Friday at 3 p.m. (2000 GMT) to discuss Iran, days after U.S. Ambassador to the UN Nikki Haley called for an emergency session to discuss the protests.\nThe U.S. proposal was dismissed by Russia, another participant in the nuclear deal, as “harmful and destructive,” with “no role for the United Nations Security Council in this issue.”\nA procedural vote which no council member can veto could be used to stop the meeting. If nine of the 15 countries on the council vote to stop the meeting that would end the discussion.\n“This is a matter of fundamental human rights for the Iranian people, but it is also a matter of international peace and security,” said Haley in a statement late on Thursday.\n“It will be telling if any country tries to deny the Security Council from even having this discussion.”\nSeparately, the U.S. Treasury Department on Thursday sanctioned five Iranian-based entities it said were owned or controlled by an industrial firm responsible for developing and producing Iran’s solid-propellant ballistic missiles.\n“These sanctions target key entities involved in Iran’s ballistic missile program, which the Iranian regime prioritizes over the economic well-being of the Iranian people,” U.S. Treasury Secretary Steven Mnuchin said in a statement.\nThe department said the sanctioned entities - the Shahid Eslami Research Center, Shahid Kharrazi Industries, Shahid Moghaddam Industries, Shahid Sanikhani Industries and Shahid Shustari Industries - were subordinated to the Shahid Bakeri Industrial Group.\nThe sanctions freeze any property the entities hold in the United States and prohibit Americans from dealing with them.\nReporting by Patricia Zengerle; additional reporting by Tim Ahmann, Jonathan Landay and Steve Holland in Washington and Rodrigo Campos at the United Nations; Editing by Tom Brown and Grant McCool\n ", "external_links": [], "published": "2018-01-05T00:42:00.000+02:00", "crawled": "2018-01-05T01:05:02.002+02:00", "highlightTitle": ""}