{"organizations": [], "uuid": "b6a7cab25af66638b45e33f0e1b8bce4e8377603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-kosovo-pollution-protests/kosovos-pollution-draws-protesters-as-city-bans-cars-from-town-center-idUSKBN1FK1ZW", "country": "US", "domain_rank": 408, "title": "Kosovo's pollution draws protesters as city bans cars from town center", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:58:00.000+02:00", "replies_count": 0, "uuid": "b6a7cab25af66638b45e33f0e1b8bce4e8377603"}, "author": "", "url": "https://www.reuters.com/article/us-kosovo-pollution-protests/kosovos-pollution-draws-protesters-as-city-bans-cars-from-town-center-idUSKBN1FK1ZW", "ord_in_thread": 0, "title": "Kosovo's pollution draws protesters as city bans cars from town center", "locations": [], "entities": {"persons": [{"name": "fatos bytyci", "sentiment": "none"}, {"name": "vullnet krasniqi", "sentiment": "none"}], "locations": [{"name": "kosovo", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRISTINA (Reuters) - Hundreds of people wearing white masks gathered in Pristina on Wednesday as authorities banned cars from driving in city center to counter pollution so bad it sometimes exceeds the pollution in Chinese cities.\nProtest organizers played a sound of a person breathing deeply. The crowd chanted “Don’t poison us”, “Help” and “Let’s save Pristina”.\nAt noon on Wednesday, the air quality index measured by the U.S. embassy in Pristina was 262, a level deemed unhealthy and worse than Shanghai and Hangzhou in China. In recent days, it has reached 400, or hazardous, and people were told to stay indoors.\nA 2013 World Bank study showed air pollution in Kosovo was estimated to cause 852 premature deaths and 318 new cases of chronic bronchitis each year.\nThe Kosovar parliament is due to hold an emergency session to discuss long-term measures.\nPolice officers wear white masks during a protest against air pollution in Pristina January 31, 2018. REUTERS/Hazir Reka “We want air, clean air,” said Vullnet Krasniqi one of the organizers of the protest. “It is late to organize meetings. We don’t want you to talk - we want you to act.”\nExperts say Pristina was always polluted, but the smog only got serious attention in the past two years, when the U.S. embassy began measuring it and put all its data on the internet.\nSlideshow (3 Images) The pollution is caused mainly by two power plants on the outskirts of Pristina. Kosovo has the world’s fifth-largest lignite reserves and relies on coal to produce power. Many households use it for heating because it is the cheapest fuel available\n“Stopping cars in the center is nonsense, because they are driving them in other streets just outside the center. They have to put filters at power plants and stop people burning coal,” said Gjejlane Hoxha a Pristina resident.\nSarajevo, Tuzla and Zenica in Bosnia and Macedonia’s capital, Skopje, suffer from similar levels of pollution.\nRecent study by the Health and Environment Alliance found 16 aging, communist-era lignite plants in the former Yugoslavia emit as much pollution as all of the European Union’s 296 power plants combined.\nReporting by Fatos Bytyci, editing by Larry King\n ", "external_links": [], "published": "2018-01-31T15:58:00.000+02:00", "crawled": "2018-01-31T16:08:50.012+02:00", "highlightTitle": ""}