{"organizations": [], "uuid": "16f0c72e0ed1c1789aa867d2088e06ab0f42f79a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224720579&w=1200&r=LYNXMPEE0N0EB", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren/tennis-angry-sandgren-says-demonised-by-sensationalist-media-idUKKBN1FD0KE", "country": "US", "domain_rank": 408, "title": "Tennis - Angry Sandgren says 'demonised' by 'sensationalist' media", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:05:00.000+02:00", "replies_count": 0, "uuid": "16f0c72e0ed1c1789aa867d2088e06ab0f42f79a"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-sandgren/tennis-angry-sandgren-says-demonised-by-sensationalist-media-idUKKBN1FD0KE", "ord_in_thread": 0, "title": "Tennis - Angry Sandgren says 'demonised' by 'sensationalist' media", "locations": [], "entities": {"persons": [{"name": "sandgren", "sentiment": "negative"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "chung", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 7:05 AM / Updated 2 hours ago Tennis - Angry Sandgren says 'demonised' by 'sensationalist' media Ian Ransom 4 Min Read \nMELBOURNE (Reuters) - An angry Tennys Sandgren slammed journalists for “demonising” him with “sensationalist” reporting on his social media links to right-wing activists but said the controversy had not affected him during his Australian Open quarter-final loss to South Korea’s Chung Hyeon. \nThe 26-year-old world number 97 deleted several years of posts on his Twitter account on Tuesday as he sought to draw a line under the controversy with a “version of a cleaner start”. \nAfter losing 6-4 7-6(5) 6-3 to Chung on Wednesday, the avowed Christian read a prepared statement and refused to take questions on anything but the tennis. \n“You seek to put people in these little boxes so that you can order the world in your already assumed preconceived ideas,” Sandgren read from the statement. \n”You strip away any individuality for the sake of demonising by way of the collective. \n”With a handful of follows and some likes on Twitter, my fate has been sealed in your minds. \n”To write an edgy story, to create sensationalist coverage, there are a few lengths you wouldn’t go to to mark me as the man you desperately want me to be. \n”You would rather perpetuate propaganda machines instead of researching information from a host of angles and perspectives while being willing to learn, change, and grow. \n“You dehumanize with pen and paper and turn neighbour against neighbour. In so doing, you may actually find you’re hastening the hell you wish to avoid, the hell we all wish to avoid.” \nSandgren has been accused of homophobia and racism in recent days on social media, and queried about following right-wing nationalists on Twitter and other online platforms. \nAfter his fourth round win over Dominic Thiem, he denied he shared beliefs with alt-right figures but said some of their content was “interesting”. \n“It is my firm belief that the highest value must be placed on the virtue of each individual, regardless of gender, race, religion or sexual orientation,” he added from the statement. \n“It’s my job to continue on this journey with the goal of becoming the best me I can and to embody the love Christ has for me, for I answer to Him and Him alone.” \nHaving never won three Tour-level matches in a row prior to the tournament, Tennessee native Sandgren reached his maiden grand slam quarter-final at Melbourne Park. \nHis stunning achievement was completely overshadowed by the controversy, though it had not thrown him off when playing Chung, he insisted. \nHe said he looked forward to heading home to spend time with family and would turn his phone off. \n“Just really reflect on the last two weeks, reflect where my life has gone to, where I‘m at, where I am in this stage at 26, who I am as a person, who I want to continue trying to be, where I want to go in the sport, where I want to go as a man,” he said. \n”I constantly try to be introspective as to what’s going on in my life. \n“This has been a lot of information to digest in the last few weeks. So I need to take ample time to do so so I can move forward correctly.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-24T09:05:00.000+02:00", "crawled": "2018-01-24T09:16:45.003+02:00", "highlightTitle": ""}