{"organizations": [], "uuid": "a8eac79e2aaf927a0a3e1807df7e48faeeb717c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-sherritt-announces-pricing-of-115-million-unit-offering.html", "country": "US", "domain_rank": 767, "title": "Sherritt Announces Pricing of $115 Million Unit Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-17T20:30:00.000+02:00", "replies_count": 0, "uuid": "a8eac79e2aaf927a0a3e1807df7e48faeeb717c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-sherritt-announces-pricing-of-115-million-unit-offering.html", "ord_in_thread": 0, "title": "Sherritt Announces Pricing of $115 Million Unit Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "sherritt", "sentiment": "negative"}, {"name": "sherritt international corporation", "sentiment": "negative"}, {"name": "sheritt", "sentiment": "none"}, {"name": "united states newswire", "sentiment": "none"}, {"name": "united states sherritt international corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- Sherritt International Corporation (“Sherritt”) (TSX:S):\nNOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES\nSherritt International Corporation (“Sherritt”) (TSX:S) today announced the pricing and increase in size of its previously announced unit offering of $100 million to $115 million. The offering will be comprised of 82,143,000 units (the “Units”) issued at a price of $1.40 per Unit, for gross proceeds of approximately $115,000,000. Each Unit shall consist of one Sheritt common share (a “Common Share”) and one-half of one common share purchase warrant linked to the price of cobalt (each full warrant, a “Cobalt-Linked Warrant”). Each full Cobalt-Linked Warrant will be exercisable at an exercise price of $1.95 for a period of 36 months following the closing of the Offering.\nA total of 82,143,000 Common Shares and 41,071,500 Cobalt-Linked Warrants shall be issued in connection with the Offering. In addition, the Agents have been granted an over-allotment option, exercisable in whole or in part at any time until the date that is 30 days after the initial closing of the Offering, to offer for sale up to an additional 12,321,400 Units. Assuming the completion of the Offering in full and the exercise in full of the over-allotment, the total gross proceeds of the offering will be approximately $132,000,000.\nThe Company has entered into an agency agreement with Paradigm Capital, Eight Capital and National Bank Financial, who are acting as co-lead agents and joint-bookrunners on behalf of a syndicate that includes TD Securities (collectively, the “Agents”).\nEach Cobalt-Linked Warrant will be exercisable to acquire between 1.00 and 1.25 Common Shares of Sherritt, determined based on the Applicable Cobalt Reference Price (as defined below). The Units have been structured to provide investors with increased leverage to upwards movement in the price of cobalt.\nEach Cobalt-Linked Warrant will entitle the holder thereof to acquire that number of Common Shares that is equal to the Common Shares per Warrant Ratio (as set out in the table below). The initial Common Shares per Warrant Ratio will be one share to one warrant based on an initial Applicable Reference Cobalt Price of US$34.99 per pound or lower.\nThe Common Shares per Warrant Ratio will be determined and published monthly based on the Applicable Reference Cobalt Price per Pound in accordance with the following table:\nApplicable Reference Cobalt Price per Pound\nCommon Shares per Warrant Ratio\nUS$34.99 or lower\nUS$35.00 – US$39.99\nUS$40.00 – US$44.99\nUS$45.00 – US$49.99\nUS$50.00 – US$54.99\nUS$55.00 and higher\n1.00\n1.05\n1.10\n1.15\n1.20\n1.25\nThe “Applicable Cobalt Reference Price per Pound” will be calculated and published by Sherritt monthly, based on a rolling average of the prior three months cobalt price using the midpoint of the Metal Bulletin High Price and the Metal Bulletin Low Price 1 , expressed in US dollars per pound, for each month in such three-month period.\nThe net proceeds of the Offering shall be used to reduce Sherritt’s outstanding indebtedness, for general corporate purposes and to fund future growth initiatives. Sherritt intends to use up to $75 million of the proceeds of the Offering and its existing cash balance to repurchase a portion of one or more of its senior unsecured debentures (the “Debentures”). The Debentures will be repurchased under the terms of a modified Dutch auction tender offer (the “Tender Offer”). For further details of the Tender Offer, investors are advised to consult Sherritt’s press release dated January 16, 2018, entitled Sherritt Announces Dutch Auction to Purchase up to $75 Million of Outstanding Debentures.\nThe Offering is subject to satisfaction of customary closing conditions, including the receipt of all necessary regulatory and TSX approvals. The Offering is expected to close on January 25, 2018.\nThe securities described herein have not been, and will not be, registered under the U.S. Securities Act, or any state securities laws, and accordingly, may not be offered or sold to, or for the account or benefit of, persons in the United States or to U.S. Persons (as such term is defined in Regulation S under the U.S. Securities Act), except in compliance with the registration requirements of the U.S. Securities Act and applicable state securities requirements or pursuant to exemptions therefrom. This press release does not constitute an offer to sell or a solicitation of an offer to buy any of Sherritt’s securities to, or for the account or benefit of, persons in the United States or U.S. Persons.\nAbout Sherritt\nSherritt is a world leader in the mining and refining of nickel and cobalt from lateritic ores with projects and operations in Canada, Cuba and Madagascar. The Corporation is the largest independent energy producer in Cuba, with extensive oil and power operations across the island. Sherritt licenses its proprietary technologies and provides metallurgical services to mining and refining operations worldwide. The Corporation’s common shares are listed on the Toronto Stock Exchange under the symbol “S”.\nwww.sherritt.com\nForward-Looking Statements\nThis press release contains certain forward-looking statements. Forward-looking statements can generally be identified by the use of statements that include such words as “believe”, “expect”, “anticipate”, “intend”, “plan”, “forecast”, “likely”, “may”, “will”, “could”, “should”, “suspect”, “outlook”, “projected”, “continue” or other similar words or phrases. Specifically, forward-looking statements in this document include, but are not limited to, statements set out in this press release relating to estimated costs and future funding requirements.\nForward-looking statements are not based on historic facts, but rather on current expectations, assumptions and projections about future events, including matters relating to the transaction disclosed herein; availability of governmental, regulatory and third party approvals; and the ability to achieve corporate objectives, goals and plans for 2018. By their nature, forward-looking statements require the Corporation to make assumptions and are subject to inherent risks and uncertainties. There is significant risk that predictions, forecasts, conclusions or projections will not prove to be accurate, that those assumptions may not be correct and that actual results may differ materially from such predictions, forecasts, conclusions or projections.\nThe Corporation cautions readers of this press release not to place undue reliance on any forward-looking statement as a number of factors could cause actual future results, conditions, actions or events to differ materially from the targets, expectations, estimates or intentions expressed in the forward-looking statements. These risks, uncertainties and other factors include, but are not limited to the risks and uncertainties set out in the Management’s Discussion & Analysis of the Corporation for the period ending September 30, 2017 and the Corporation’s Annual Information Form dated March 28, 2017, each of which are available on SEDAR at www.sedar.com . Readers are cautioned that the foregoing list of factors is not exhaustive and should be considered in conjunction with the risk factors described in this press release and in the Corporation’s other documents filed with the Canadian securities auth", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedar.com&esheet=51744732&newsitemid=20180117006160&lan=en-US&anchor=www.sedar.com&index=2&md5=fc0530e9da4bf5e687506866c90ee03c", "http://www.businesswire.com/news/home/20180117006160/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sherritt.com&esheet=51744732&newsitemid=20180117006160&lan=en-US&anchor=www.sherritt.com&index=1&md5=4f115c0206062496266bd0a16da2c976"], "published": "2018-01-17T20:30:00.000+02:00", "crawled": "2018-01-17T21:28:57.000+02:00", "highlightTitle": ""}