{"organizations": [], "uuid": "6a4e6651dc397955e89d7a3f164158c8f0e5f51a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-dova-pharmaceuticals-announces-the-appointment-of-mark-w-hahn-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Dova Pharmaceuticals Announces the Appointment of Mark W. Hahn as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T15:00:00.000+02:00", "replies_count": 0, "uuid": "6a4e6651dc397955e89d7a3f164158c8f0e5f51a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-dova-pharmaceuticals-announces-the-appointment-of-mark-w-hahn-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Dova Pharmaceuticals Announces the Appointment of Mark W. Hahn as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "mark w. hahn", "sentiment": "negative"}, {"name": "cempra", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "hahn", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "cempra", "sentiment": "none"}, {"name": "ernst", "sentiment": "none"}], "organizations": [{"name": "dova pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "inc.", "sentiment": "none"}, {"name": "bayer cropscience", "sentiment": "none"}, {"name": "melinta therapeutics, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DURHAM, N.C., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Dova Pharmaceuticals, Inc. (NASDAQ:DOVA) today announced the appointment of Mark W. Hahn as the company’s Chief Financial Officer. A veteran Chief Financial Officer of the biotech industry, Mr. Hahn previously served as the Chief Financial officer of Cempra, Inc. from 2010 until it was acquired by Melinta Therapeutics, Inc. in November 2017. While at Cempra, Mark spearheaded all financing activities including the company’s initial public offering and follow on offerings raising over $500MM over a seven-year period. Prior to joining Cempra, from 2008 to 2009, Mark was the Chief Financial Officer for Athenix, a rapidly growing agricultural biotech company which merged with Bayer CropScience in 2010. Before taking on operating roles at corporations, Mark spent twelve years at Ernst and Young where he assisted in the IPO process for many software, manufacturing, and consumer product companies. Mark will officially commence in his role as Chief Financial Officer of Dova on January 31 st , 2018.\n“Having Mark join the Dova team at this time significantly adds to our executive team’s capabilities. His experience as a public company biotech CFO are the skills that are needed as Dova continues its trajectory as a growing biotech company,” said Alex C. Sapir, Dova’s President and Chief Executive Officer.\n“I am delighted to be joining Dova during this exciting time in the company’s growth. With a potential PDUFA date in May and several clinical trials underway that have the potential to increase the number of indications for avatrombopag, Dova is poised for its transition to a commercial stage biopharmaceutical company with potential for significant growth. It’s an honor to help contribute to that growth,” said Mark Hahn.\nDoug Blankenship, Dova’s previous Chief Financial Officer, has agreed to step down, and Dova expresses its deep gratitude for many contributions during his time at Dova including his assistance in the company’s Nasdaq listing in 2017.\nAbout Dova Pharmaceuticals, Inc.\nDova is a pharmaceutical company focused on acquiring, developing, and commercializing drug candidates for rare diseases where there is a high unmet need, with an initial focus on addressing thrombocytopenia. Dova’s lead drug candidate, avatrombopag, has successfully completed two pivotal Phase 3 clinical trials for the treatment of thrombocytopenia in patients with CLD scheduled to undergo a procedure, and an NDA has been accepted for priority review by FDA for this initial indication with a PDUFA goal date of May 21, 2018.\nCautionary Note Regarding Forward-Looking Statements\nAny statements contained in this press release that do not describe historical facts may constitute forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These statements may be identified by words such as “anticipated”, “believe”, “expect”, “may”, “plan”, “potential”, “will”, and similar expressions, and are based on Dova’s current beliefs and expectations. These forward-looking statements include expectations regarding the potential transition of the company to a commercial stage biopharmaceutical company and potential significant growth of Dova. These statements involve risks and uncertainties that could cause actual results to differ materially from those reflected in such statements. Risks and uncertainties that may cause actual results to differ materially include uncertainties inherent in the conduct of clinical trials, increased regulatory requirements, Dova’s reliance on third parties over which it may not always have full control, and other risks and uncertainties that are described in Dova’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, filed with the U.S. Securities and Exchange Commission (SEC) on November 9, 2017, and Dova’s other periodic reports filed with the SEC. Any forward-looking statements speak only as of the date of this press release and are based on information available to Dova as of the date of this release, and Dova assumes no obligation to, and does not intend to, update any forward-looking statements, whether as a result of new information, future events or otherwise.\nContacts\nAlex C. Sapir\n(919) 748-5975\nasapir@dova.com\nWestwicke Partners\nJohn Woolford (443) 213-0506\njohn.woolford@westwicke.com\nSource:Dova Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=TOybvS008f6Ce-PTy7oHo1pWpSxtJwfEP-WvdVAb-1DxGmNNE7c2OBTKX-3tXT0hNKpyfOOn9JD0fTKLZq-uQjcxNe0jhVFmyiZT28uXp26YHnWV8Ljhjcr6UN9E4KIJ", "https://www.globenewswire.com/NewsRoom/AttachmentNg/47d57cbc-f8e0-41d8-920c-7f703dc16f0c", "https://www.globenewswire.com/Tracker?data=MdRxZ85CV-Uq_MVBDWBcaGjhHKAW30nv-B6nKzkf9yIQb_8z-ATLwPfwWcb_GZkjlxupkSfVlzv_2Kdl6eAzHA=="], "published": "2018-01-30T15:00:00.000+02:00", "crawled": "2018-01-30T15:21:27.055+02:00", "highlightTitle": ""}