{"organizations": [], "uuid": "4a96f409aacdaf5e1c4312c4321841b287e1423e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-trimetals-mining-inc-appoints-new-president-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "TriMetals Mining Inc. Appoints New President & Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "4a96f409aacdaf5e1c4312c4321841b287e1423e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-trimetals-mining-inc-appoints-new-president-chief-executive-officer.html", "ord_in_thread": 0, "title": "TriMetals Mining Inc. Appoints New President & Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "eric h. edwards", "sentiment": "none"}, {"name": "robert van doorn", "sentiment": "none"}, {"name": "ralph", "sentiment": "none"}, {"name": "edwards", "sentiment": "none"}, {"name": "van doorn", "sentiment": "none"}, {"name": "ralph fitch", "sentiment": "none"}, {"name": "fitch", "sentiment": "none"}, {"name": "eric edwards", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "gold springs", "sentiment": "none"}], "organizations": [{"name": "trimetals mining inc", "sentiment": "negative"}, {"name": "trimetals mining inc.", "sentiment": "negative"}, {"name": "tmi", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 16, 2018 (GLOBE NEWSWIRE) -- TriMetals Mining Inc. (\"TriMetals\" or \"the Company\") (TSX:TMI) is pleased to announce the appointment of Eric H. Edwards as its President & Chief Executive Officer and a director of the Company. The Company also announces the retirement of Company founder Ralph Fitch as a director and officer of the Company after a 53 year career as a geologist. Mr. Fitch has led the Company and its predecessors since inception in 1994. These changes were effective January 15, 2018.\nRobert van Doorn, Chairman of the Board of TMI said, “We express our thanks to Ralph Fitch for his service to the Company through the years. Ralph’s contributions were vital in acquiring our exciting Gold Springs and Escalones projects. We wish Ralph the best in his retirement.”\nMr. van Doorn further stated, “We welcome Eric Edwards to the Company and look forward to the next stages of growth and development at Gold Springs and Escalones. Mr. Edwards brings more than 30 years of professional experience in gold exploration, mine operations, corporate development and finance to TriMetals. The Company remains well positioned with an experienced international exploration team, energetic management and diversity of directors to capitalize on gold exploration and strategic growth.”\nMr. Edwards has worked for major and junior public companies with projects in Canada, the United States, Ecuador, Myanmar, Kazakhstan, Argentina and Peru. He most recently served as President & CEO of Lupaka Gold Corp. where he directed that company through its IPO, and guided growth through its strategic corporate acquisition of Andean American Gold Corp.\nMr. Edwards other past corporate positions include President of Ventura Gold Corp. that was acquired by International Minerals Inc., Vice President & CFO of Andean Resources which was acquired by Goldcorp, Vice President & CFO of Queenstake Resources which was acquired by Yukon Nevada Gold. Mr. Edwards was CFO for Ivanhoe Mines, joining the company while still private and taking it through its IPO on the TSX, project debt financing, copper offtake and corporate acquisitions.\nMr. Edwards professional experience includes more than 15 years in open-pit and underground mines in various operations capacities with Kinross, TVX Gold, Minorco, Rio Tinto, and Nerco Minerals. including Mine Manager at the underground TVX Gold Mineral Hill Mine in Montana.\nMr. Edwards has a B.S. (Honours) in Geology from Utah State University and an Masters in Business Administration from University of Utah\nAbout TriMetals Mining Inc.\nTriMetals Mining Inc. is a growth focused mineral exploration company creating value through the exploration and development of the prospective Gold Springs gold-silver project in Utah and Nevada USA, and the Escalones copper-gold porphyry deposit in Chile. The Company combines a track record of discovery and advancement of large projects, mining and exploration supportive jurisdictions, low political risk areas, key operational and process expertise, and a focus on community relations and sustainable development. Management has extensive experience in the global exploration and mining industry.\nThe Company’s common shares and Class B shares are listed on the Toronto Stock Exchange under the symbols “TMI” and “TMI.B” and the common shares and Class B (1) shares also trade on the OTCQX market under the symbol “TMIAF” and “TMIBF”. Additional information related to TriMetals Mining Inc. is available at www.TriMetalsmining.com and on SEDAR at www.sedar.com .\nNote that the Class B shares have no interest in the properties or assets of the Company other than a collective entitlement to 85% of the net cash, if any, (after deducting all costs, taxes and expenses and the third-party funder’s portion thereof) received by TMI from award or settlement in relation to the Company’s subsidiary South American Silver Limited’s arbitration proceeding against Bolivia for the expropriation of the Malku Khota project in 2012 (the “Bolivia Arbitration”).\nForward Looking Statements\nCertain statements contained herein constitute “forward-looking information” under applicable Canadian securities laws (“forward-looking statements”). Forward-looking statements look into the future and provide an opinion as to the effect of certain events and trends on the business. Forward-looking statements may include words such as “creating”, “continue”, “will” and similar expressions and include the Company’s expectation for an award in respect of the Bolivia Arbitration to be announced in the first quarter of 2018. These forward-looking statements are based on current expectations and entail various risks and uncertainties. Actual results may materially differ from expectations if known and unknown risks or uncertainties affect our business or if our estimates or assumptions prove inaccurate. Factors that could cause results or events to differ materially from current expectations expressed or implied by the forward-looking statements, include, but are not limited to, risks of the mineral exploration industry which may affect the advancement of the Gold Springs project, including possible variations in mineral resources, grade, recovery rates, metal prices, capital and operating costs, and the application of taxes; availability of sufficient financing to fund planned or further required work in a timely manner and on acceptable terms; risks related to the international arbitration process; availability of equipment and qualified personnel, failure of equipment or processes to operate as anticipated, changes in project parameters, including water requirements for operations, as plans continue to be refined; regulatory, environmental and other risks of the mining industry more fully described in the Company’s Annual Information Form and continuous disclosure documents, which are available on SEDAR at www.sedar.com . The assumptions made in developing the forward-looking statements include: the accuracy of current resource estimates and the interpretation of drill, metallurgical testing and other exploration results; the continuing support for mining by local governments in Nevada and Utah; the availability of equipment and qualified personnel to advance the Gold Springs project; execution of the Company’s existing plans and further exploration and development programs for Gold Springs, which may change due to changes in the views of the Company or if new information arises which makes it prudent to change such plans or programs.\nReaders are cautioned not to place undue reliance on the forward-looking statements contained in this press release. Except as required by law, TMI assumes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or any other reason. Unless otherwise indicated, forward-looking statements in this press release describe the Company’s expectations as of January 16, 2018.\nTriMetals Mining Inc. Contact:\nEric Edwards\nPresident\needwards@trimetalsmining.com\nRobert van Doorn\nChairman\nvandoorn.robert@gmail.com\nSource: TriMetals Mining Inc", "external_links": ["http://www.trimetalsmining.com/", "http://www.sedar.com/"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T16:42:19.004+02:00", "highlightTitle": ""}