{"organizations": [], "uuid": "eef989025794232f836b6502e279c0cef0a647e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-graco-reports-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Graco Reports 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:10:00.000+02:00", "replies_count": 0, "uuid": "eef989025794232f836b6502e279c0cef0a647e6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-graco-reports-2017-financial-results.html", "ord_in_thread": 0, "title": "Graco Reports 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "graco", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Finishes Year with Double-digit Percentage Annual Sales Growth\nMINNEAPOLIS--(BUSINESS WIRE)-- Graco Inc. (NYSE: GGG) today announced results for the fourth quarter and year ended December 29, 2017.\nSummary\n$ in millions except per share amounts\nThree Months Ended Twelve Months Ended Dec 29,\n2017\nDec 30,\n2016\n%\nChange\nDec 29,\n2017\nDec 30,\n2016\n%\nChange\nNet Sales $ 374.9 $ 349.1 7 % $ 1,474.7 $ 1,329.3 11 % Operating Earnings 76.2 (106.9 ) 171 % 360.4 113.9 217 % Net Earnings 36.4 (104.2 ) 135 % 252.4 40.7 521 % Diluted Net Earnings per Common Share\n$ 0.21 $ (0.61 ) 134 % $ 1.45 $ 0.24 504 % Adjusted (non-GAAP) (1): Operating Earnings, adjusted $ 88.3 $ 85.1 4 % $ 372.5 $ 305.9 22 % Net Earnings, adjusted 59.4 57.2 4 % 249.4 202.1 23 % Diluted Net Earnings per Common Share, adjusted\n$ 0.34 $ 0.33 3 % $ 1.43 $ 1.18 21 % (1) Excludes impacts of non-recurring income tax adjustments, changes in accounting for stock compensation, and pension restructuring in 2017. Also excludes the effects of impairment charges recorded in 2016. See Financial Results Adjusted for Comparability below for a reconciliation of adjusted non-GAAP financial measures to GAAP.\nSales for the quarter increased in all segments and regions. There were 14 weeks in the fiscal fourth quarter of 2016 compared to 13 weeks in 2017. All segments finished with double-digit percentage growth for the year. Gross margin rates for the quarter and year remained strong. Increases in sales and earnings-based incentives, spending on growth initiatives and the pension settlement loss contributed to higher operating expenses in the fourth quarter of 2017. Diluted earnings per share in 2017 include a benefit of $0.09 for the quarter and $0.21 for the year from a required change in accounting for stock compensation. Non-recurring income tax adjustments reduced diluted earnings per share in 2017 by $0.17 for the quarter and $0.14 for the year. 2016 results included impairment charges that reduced diluted earnings per share for the quarter and year by $0.94.\n“Outstanding execution throughout 2017 by Graco’s employees, suppliers, channel partners and end users drove record quarterly sales in each quarter of 2017 and double-digit growth for the year,” said Patrick J. McHale, Graco’s President and CEO. “Our investments in product development, new markets and geographic expansion are producing nice returns. Contractor segment growth was particularly strong in the fourth quarter, which resulted in rebate and growth incentives that pressured gross and operating margins for the segment as well as an unfavorable mix for the overall Company in the quarter. The tiers for these incentives are reset at the beginning of each year based on sales levels achieved in the prior year and have a history of driving growth, so we are happy to pay for these programs.”\nConsolidated Results\nSales for the quarter increased 7 percent, with increases of 5 percent in the Americas, 11 percent in EMEA (4 percent at consistent translation rates) and 11 percent in Asia Pacific (9 percent at consistent translation rates). Sales for the year increased 11 percent, with increases of 9 percent in the Americas, 10 percent in EMEA and 16 percent in Asia Pacific. Changes in currency translation rates increased sales by approximately $7 million (2 percentage points) for the quarter and did not have a significant impact on sales for the year.\nGross profit margin rates improved slightly for both the quarter and the year. Favorable effects from currency translation, higher production volume and realized pricing were partially offset by the unfavorable impact of product mix.\nThe Company restructured its funded U.S. pension plan in 2017. The restructuring resulted in a $12 million pension settlement loss that was included in general and administrative expense in the fourth quarter and reduced diluted earnings per share by $0.04. Total operating expenses for 2016 included an impairment charge of $192 million in the fourth quarter.\nTotal operating expenses for the quarter increased $25 million (25 percent) compared to the fourth quarter before impairment charges last year. The increase includes the $12 million pension settlement loss, $3 million of increases in sales and earnings-based incentives and $1 million of incremental spending on growth initiatives. Operating expenses for the year increased $30 million (8 percent), with volume and rate-related increases and the pension settlement loss accounting for most of the increase.\nThe effective income tax rate was 51 percent for the quarter and 27 percent for the year. Adoption of a new accounting standard, requiring excess tax benefits related to stock option exercises to be credited to the income tax provision (formerly credited to equity), reduced the tax provision by $16 million for the quarter and $36 million for the year, decreasing the effective tax rate for the quarter and year by 21 and 10 percentage points, respectively. U.S. federal income tax reform legislation passed at the end of 2017 required a revaluation of net deferred tax assets and instituted a toll charge on unrepatriated foreign earnings that increased the tax provision by a total of $36 million, increasing the effective tax rate by 48 percentage points for the quarter and 10 percentage points for the year. Effects of tax planning and other non-recurring tax changes decreased the effective rate by 6 percentage points for the quarter and 3 percentage points for the year.\nSegment Results\nManagement assesses performance of segments by reference to operating earnings excluding unallocated corporate expenses and asset impairments. For a reconciliation of segment operating earnings to consolidated operating earnings, refer to the Segment Information table included in the financial statement section of this release. Certain measurements of segment operations are summarized below:\nThree Months Ended Twelve Months Ended Industrial Process Contractor Industrial Process Contractor Net Sales (in millions) $ 182.3 $ 77.6 $ 115.0 $ 692.0 $ 294.7 $ 488.1 Percentage change from last year Sales 4 % 10 % 11 % 10 % 11 % 13 % Operating earnings 1 % 27 % 3 % 15 % 46 % 24 % Operating earnings as a percentage of sales\n2017\n33 % 17 % 18 % 34 % 18 % 23 % 2016\n34 % 15 % 19 % 33 % 13 % 21 % Components of net sales change by geographic region for the Industrial segment were as follows:\nThree Months Ended Twelve Months Ended Volume\nand Price\nAcquisitions Currency Total Volume\nand Price\nAcquisitions Currency Total Americas (1)% 0% 1% 0% 6% 0% 0% 6% EMEA (2)% 0% 8% 6% 6% 1% 1% 8% Asia Pacific 10% 0% 2% 12% 18% 1% (1)% 18% Consolidated 1% 1% 2% 4% 9% 1% 0% 10% Industrial segment sales growth in the fourth quarter was limited by a decline in sales of finishing systems compared to a record quarter for finishing systems in the prior year. Increased spending on product and regional growth initiatives resulted in a 1 percentage point decrease in operating margin compared to last year. For the year, higher sales volume, including strong finishing systems growth, and expense leverage drove a 1 percentage point increase in operating margin rate.\nComponents of net sales change by geographic region for the Process segment were as follows:\nThree Months Ended Twelve Months Ended Volume\nand Price\nAcquisitions Currency Total Volume\nand Price\nAcquisitions Currency Total Americas 4% 1% 0% 5% 10% 0% 0% 10% EMEA 14% 1% 5% 20% 9% 0% (2)% 7% Asia Pacific 15% 1% 2% 18% 17% 0% (1)% 16% Consolidated 7% 1% 2% 10% 11% 0% 0% 11% The Process segment had solid sales growth for the quarter in all product applications. For the year, legacy product applications had double-digit percentage growth while Oil and Natural Gas sales were flat for the year. Operating margin rates for this segment increased 2 percentage points for the quarter and 5 percentage points for the year, driven by higher sales volume, favorable expense leverage and a decrease in intangible amortization related to the impairment recorded in the fourth quarter of 2016.\nComponents of net sales change by geographic region for the Contractor segment were as follows:\nThree Months Ended Twelve Months Ended Volume\nand Price\nAcquisitions Currency Total\nVolume\nand Price\nAcquisitions Currency Total Americas 10% 0% 0% 10% 12% 0% 0% 12% EMEA 11% 0% 7% 18% 17% 0% 2% 19% Asia Pacific (2)% 0% 2% 0% 9% 0% 0% 9% Consolidated 9% 0% 2% 11% 12% 0% 1% 13% Contractor segment sales for the quarter and year increased in all channels. Increases in volume-based customer incentives, product launch and promotion costs and changes in product mix drove the operating margin rate for the quarter 1 percentage point lower than last year. Contractor segment operating margin rate for the year increased 2 percentage points compared to last year due to higher sales volume, improved gross margin rate and favorable expense leverage.\nOutlook\n“We are initiating an outlook for the full-year 2018 of mid single-digit growth on an organic, constant currency basis, with growth expected in every region and reportable segment,” said McHale. “Demand levels in the fourth quarter remained solid and provide a foundation for our full-year outlook. While Industrial segment sales growth in the fourth quarter was low, bookings were better than billings and indicative of a capital equipment environment that remains stable-to-improving.”\nFinancial Results Adjusted for Comparability\nThere were multiple events in the last two years that caused significant fluctuations in financial results, including impairment charges recorded in 2016, changes in accounting for tax benefits related to stock compensation, federal income tax reform and pension plan restructuring in 2017. Excluding the impacts of those events presents a more consistent basis for comparison of financial results. A calculation of the non-GAAP measurements of adjusted operating earnings, earnings before income taxes, income taxes, effective income tax rates, net earnings and diluted earnings per share follows (in millions except per share amounts):\nThree Months Ended Twelve Months Ended Dec 29,\n2017\nDec 30,\n2016 Dec 29,\n2017 Dec 30,\n2016 Operating earnings, as reported $ 76.2 $ (106.9 ) $ 360.4 $ 113.9 Pension settlement loss 12.1 — 12.1 — Impairment — 192.0 — 192.0 Operating earnings, adjusted $ 88.3 $ 85.1 $ 372.5 $ 305.9 Earnings before income taxes $ 73.5 $ (111.0 ) $ 347.1 $ 96.7 Adjustments 12.1 192.0 12.1 192.0 Earnings before income taxes, adjusted $ 85.6 $ 81.0 $ 359.2 $ 288.7 Income taxes, as reported $ 37.1 $ (6.8 ) $ 94.7 $ 56.0 Excess tax benefit from option exercises 15.8 — 36.3 — Income tax reform (35.6 ) — (35.6 ) — Other non-recurring tax changes 4.5 — 10.0 — Tax effects of adjustments 4.4 30.6 4.4 30.6 Income taxes, adjusted $ 26.2 $ 23.8 $ 109.8 $ 86.6 Effective income tax rate As reported 51 % 6 % 27 % 58 % Adjusted 31 % 29 % 31 % 30 % Net Earnings, as reported $ 36.4 $ (104.2 ) $ 252.4 $ 40.7 Impairment, net — 161.4 — 161.4 Pension settlement loss, net 7.7 — 7.7 — Excess tax benefit from option exercises (15.8 ) — (36.3 ) — Income tax reform 35.6 — 35.6 — Other non-recurring tax changes (4.5 ) — (10.0 ) — Net Earnings, adjusted $ 59.4 $ 57.2 $ 249.4 $ 202.1 Weighted Average Diluted Shares 175.7 171.3 174.3 170.9 Diluted Earnings per Share As reported $ 0.21 $ (0.61 ) $ 1.45 $ 0.24 Adjusted $ 0.34 $ 0.33 $ 1.43 $ 1.18 Cautionary Statement Regarding Forward-Looking Statements\nThe Company desires to take advantage of the “safe harbor” provisions regarding forward-looking statements of the Private Securities Litigation Reform Act of 1995 and is filing this Cautionary Statement in order to do so. From time to time various forms filed by our Company with the Securities and Exchange Commission, including our Form 10-K, Form 10-Qs and Form 8-Ks, and other disclosures, including our 2016 Overview report, press releases, earnings releases, analyst briefings, conference calls and other written documents or oral statements released by our Company, may contain forward-looking statements. Forward-looking statements generally use words such as “expect,” “foresee,” “anticipate,” “believe,” “project,” “should,” “estimate,” “will,” and similar expressions, and reflect our Company’s expectations concerning the future. All forecasts and projections are forward-looking statements. Forward-looking statements are based upon currently available information, but various risks and uncertainties may cause our Company’s actual results to differ materially from those expressed in these statements. The Company undertakes no obligation to update these statements in light of new information or future events.\nFuture results could differ materially from those expressed due to the impact of changes in various factors. These risk factors include, but are not limited to: our Company’s growth strategies, which include making acquisitions, investing in new products, expanding geographically and targeting new industries; economic conditions in the United States and other major world economies; changes in tax rates and interpretation of related tax regulations; changes in currency translation rates; changes in laws and regulations; compliance with anti-corruption and trade laws; new entrants who copy our products or infringe on our intellectual property; risks incident to conducting business internationally; the ability to meet our customers’ needs and changes in product demand; supply interruptions or delays; security breaches; the possibility of asset impairments if acquired businesses do not meet performance expectations; political instability; results of and costs associated with litigation, administrative proceedings and regulatory reviews incident to our business as well as indemnification claims under our asset purchase agreement with Carlisle Companies Incorporated, Carlisle Fluid Technologies, Inc., and Finishing Brands Holdings Inc.; the possibility of decline in purchases from a few large customers of the Contractor segment; variations in activity in the construction, automotive, mining and oil and natural gas industries; our ability to attract, develop and retain qualified personnel; and catastrophic events. Please refer to Item 1A of our Annual Report on Form 10-K for fiscal year 2016 (and most recent Form 10-Q) for a more comprehensive discussion of these and other risk factors. These reports are available on the Company’s website at www.graco.com and the Securities and Exchange Commission’s website at www.sec.gov . Shareholders, potential investors and other readers are urged to consider these factors in evaluating forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements.\nInvestors should realize that factors other than those identified above and in Item 1A might prove important to the Company’s future results. It is not possible for management to identify each and every factor that may have an impact on the Company’s operations in the future as new factors can develop from time to time.\nConference Call\nGraco management will hold a conference call, including slides via webcast, with analysts and institutional investors on Tuesday, Jan. 30, 2018, at 11 a.m. ET, 10 a.m. CT, to discuss Graco’s fourth quarter results.\nA real-time webcast of the conference call will be broadcast live over the Internet. Individuals wanting to listen and view slides can access the call at the Company’s website at www.graco.com . Listeners should go to the website at least 15 minutes prior to the live conference call to install any necessary audio software.\nFor those unable to listen to the live event, a replay will be available soon after the conference call at Graco’s website, or by telephone beginning at approximately 2 p.m. ET on Jan. 30, 2018, by dialing 888-203-1112, Conference ID #1103021, if calling within the U.S. or Canada. The dial-in number for international participants is 719-457-0820, with the same Conference ID #. The replay by telephone will be available through Feb. 3, 2018.\nAbout Graco\nGraco Inc. supplies technology and expertise for the management of fluids and coatings in both industrial and commercial applications. It designs, manufactures and markets systems and equipment to move, measure, control, dispense and spray fluid and powder materials. A recognized leader in its specialties, Minneapolis-based Graco serves customers around the world in the manufacturing, processing, construction and maintenance industries. For additional information about Graco Inc., please visit us at www.graco.com or on Twitter @GracoInc.\nGRACO INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS (Unaudited)\n(In thousands except per share amounts)\nThree Months Ended Twelve Months Ended Dec 29,\n2017 Dec 30,\n2016 Dec 29,\n2017 Dec 30,\n2016 Net Sales $ 374,859 $ 349,063 $ 1,474,744 $ 1,329,293 Cost of products sold 174,489 164,359 681,695 621,054 Gross Profit 200,370 184,704 793,049 708,239 Product development 15,891 15,642 60,106 60,606 Selling, marketing and distribution 64,550 57,147 233,462 215,253 General and administrative 43,709 26,771 139,034 126,481 Impairment — 192,020 — 192,020 Operating Earnings (Loss) 76,220 (106,876 ) 360,447 113,879 Interest expense 4,092 4,122 16,202 17,590 Other expense (income), net (1,395 ) (28 ) (2,849 ) (366 ) Earnings (Loss) Before Income Taxes 73,523 (110,970 ) 347,094 96,655 Income taxes 37,131 (6,757 ) 94,682 55,981 Net Earnings (Loss) $ 36,392 $ (104,213 ) $ 252,412 $ 40,674 Net Earnings (Loss) per Common Share Basic $ 0.22 $ (0.62 ) $ 1.50 $ 0.24 Diluted $ 0.21 $ (0.61 ) $ 1.45 $ 0.24 Weighted Average Number of Shares Basic 168,924 167,234 167,925 166,850 Diluted 175,738 171,308 174,318 170,876 SEGMENT INFORMATION (Unaudited)\n(In thousands)\nThree Months Ended Twelve Months Ended Dec 29,\n2017 Dec 30,\n2016 Dec 29,\n2017 Dec 30,\n2016 Net Sales Industrial $ 182,259 $ 174,603 $ 691,978 $ 629,581 Process 77,568 70,562 294,652 266,630 Contractor 115,032 103,898 488,114 433,082 Total $ 374,859 $ 349,063 $ 1,474,744 $ 1,329,293 Operating Earnings Industrial $ 60,579 $ 59,764 $ 237,700 $ 207,183 Process 13,247 10,445 52,216 35,750 Contractor 20,649 20,137 113,898 91,837 Unallocated corporate (expense) (18,255 ) (5,202 ) (43,367 ) (28,871 ) Impairment — (192,020 ) — (192,020 ) Total $ 76,220 $ (106,876 ) $ 360,447 $ 113,879 GRACO INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS (Unaudited)\n(In thousands)\nDec 29,\n2017 Dec 30,\n2016 ASSETS Current Assets Cash and cash equivalents $ 103,662 $ 52,365 Accounts receivable, less allowances of $14,000 and $12,700 256,421 218,365 Inventories 239,349 201,609 Other current assets 32,494 31,023 Total current assets 631,926 503,362 Property, Plant and Equipment, net 204,298 189,596 Goodwill 278,789 259,849 Other Intangible Assets, net 183,056 178,336 Deferred Income Taxes 50,916 86,653 Other Assets 30,220 25,313 Total Assets $ 1,379,205 $ 1,243,109 LIABILITIES AND SHAREHOLDERS’ EQUITY Current Liabilities Notes payable to banks $ 6,578 $ 8,913 Trade accounts payable 48,748 39,988 Salaries and incentives 55,884 37,109 Dividends payable 22,260 20,088 Other current liabilities 100,956 71,887 Total current liabilities 234,426 177,985 Long-term Debt 226,035 305,685 Retirement Benefits and Deferred Compensation 172,411 159,250 Deferred Income Taxes 17,253 17,672 Other Non-current Liabilities 6,017 8,697 Shareholders’ Equity Common stock 169,319 55,834 Additional paid-in-capital 499,934 453,394 Retained earnings 181,599 206,820 Accumulated other comprehensive income (loss) (127,789 ) (142,228 ) Total shareholders’ equity 723,063 573,820 Total Liabilities and Shareholders’ Equity $ 1,379,205 $ 1,243,109 GRACO INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited)\n(In thousands)\nYear Ended Dec 29,\n2017 Dec 30,\n2016 Cash Flows From Operating Activities Net Earnings $ 252,412 $ 40,674 Adjustments to reconcile net earnings to net cash\nprovided by operating activities Impairment — 192,020 Depreciation and amortization 45,583 48,290 Deferred income taxes 34,446 (35,561 ) Share-based compensation 23,652 21,134 Change in Accounts receivable (28,010 ) 4,506 Inventories (32,011 ) (693 ) Trade accounts payable 4,588 553 Salaries and incentives 11,431 (6,809 ) Retirement benefits and deferred compensation 6,920 10,995 Other accrued liabilities 23,909 3,298 Other (5,056 ) (2,401 ) Net cash provided by operating activities 337,864 276,006 Cash Flows From Investing Activities Property, plant and equipment additions (40,194 ) (42,113 ) Acquisition of businesses, net of cash acquired (27,905 ) (48,946 ) Change in restricted assets (12 ) 288 Other (348 ) (164 ) Net cash provided by (used in) investing activities (68,459 ) (90,935 ) Cash Flows From Financing Activities Borrowings (payments) on short-term lines of credit, net (3,026 ) (5,995 ) Borrowings on long-term line of credit 315,920 648,134 Payments on long-term line of credit (395,570 ) (735,144 ) Payments of debt issuance costs — (860 ) Common stock issued 60,685 35,796 Common stock repurchased (90,160 ) (50,497 ) Taxes paid related to net share settlement of equity awards (24,448 ) (3,165 ) Cash dividends paid (80,477 ) (73,434 ) Net cash provided by (used in) financing activities (217,076 ) (185,165 ) Effect of exchange rate changes on cash (1,032 ) 164 Net increase (decrease) in cash and cash equivalents 51,297 70 Cash and Cash Equivalents Beginning of year 52,365 52,295 End of year $ 103,662 $ 52,365\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006128/en/\nGraco Inc.\nFinancial Contact:\nChristian Rothe, 612-623-6205\nor\nMedia Contact:\nCharlotte Boyd, 612-623-6153\nCharlotte_M_Boyd@graco.com\nSource: Graco Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51750413&newsitemid=20180129006128&lan=en-US&anchor=www.sec.gov&index=2&md5=ffd74a1d6a6b698135d554a5df9b1c84", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.graco.com&esheet=51750413&newsitemid=20180129006128&lan=en-US&anchor=www.graco.com&index=3&md5=a4f88def96c7bbe3548892f2024c462e", "http://www.businesswire.com/news/home/20180129006128/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.graco.com&esheet=51750413&newsitemid=20180129006128&lan=en-US&anchor=www.graco.com&index=1&md5=17df167d1da4b624a1396c74e0fb05e0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.graco.com&esheet=51750413&newsitemid=20180129006128&lan=en-US&anchor=www.graco.com&index=4&md5=c65cd4eda2e951ec44934370f2f2a3be"], "published": "2018-01-30T00:10:00.000+02:00", "crawled": "2018-01-30T04:47:40.041+02:00", "highlightTitle": ""}