{"organizations": [], "uuid": "e7891069599810a98fe221e84c1da32b78284b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-northern-technologies-international-corporationareports-financial-results-for-first-quarter-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "Northern Technologies International Corporation Reports Financial Results for First Quarter Fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.633, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "e7891069599810a98fe221e84c1da32b78284b67"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-northern-technologies-international-corporationareports-financial-results-for-first-quarter-fiscal-2018.html", "ord_in_thread": 0, "title": "Northern Technologies International Corporation Reports Financial Results for First Quarter Fiscal 2018", "locations": [], "entities": {"persons": [{"name": "g. patrick lynch", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "northern technologies international corporation", "sentiment": "negative"}, {"name": "nasd", "sentiment": "negative"}, {"name": "northern technologies international corporation reports financial results", "sentiment": "negative"}, {"name": "ntic", "sentiment": "none"}, {"name": "consolidated", "sentiment": "none"}, {"name": "ntic china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Northern Technologies International Corporation (NASDAQ:NTIC), a leading developer of corrosion inhibiting products and services, as well as bio-based and biodegradable polymer resin compounds, today reported its financial results for the first quarter of fiscal 2018.\nFirst quarter fiscal 2018 financial and operating highlights include (with growth rates compared to first quarter of fiscal 2017):\nConsolidated net sales increased 19.0% to a quarterly record $11,543,000 ZERUST® product net sales increased 17.8% to $9,528,000 ZERUST® product sales include sales of $2,912,000 from NTIC China, which represents an increase of 88.2% Natur-Tec® product net sales increased 24.6% to a quarterly record $2,015,000 Joint venture operating income increased 25.4% to $3,248,000 Net income attributable to NTIC increased 264.1% to $1,084,000 Net income attributable to NTIC was $0.24 per diluted share an increase of 242.9%\n“Our positive momentum allowed NTIC to achieve both record sales and our most profitable first quarter ever,” said G. Patrick Lynch, President and Chief Executive Officer of NTIC. “Healthy global demand continued to drive sales of ZERUST® corrosion inhibiting solutions in North America, China, and throughout most of our joint venture countries. NTIC's global ZERUST® and Natur-Tec® sales, including all joint venture sales, passed $40 million for the first time in the history of the company in the first quarter of fiscal 2018. Sales at NTIC China were up 88.2% in the first quarter compared to the same period last fiscal year, and were up 30.3% from the fiscal 2017 fourth quarter. We are extremely pleased with the performance at NTIC China, but it is important to note NTIC China’s second quarter sales may be slightly off first quarter levels as a result of the Chinese New Year holiday period. Natur-Tec first quarter sales exceeded $2,000,000, as sales were up 24.6% during the fiscal 2018 first quarter compared to the same quarter last fiscal year. We are encouraged by this strong start to the year, as we enjoyed increased demand for our core corrosion inhibiting solutions, favorable currency exchange rates, and the positive contribution of our emerging businesses.”\nNTIC’s consolidated net sales increased 19.0% to $11,543,000 during the three months ended November 30, 2017, compared to $9,702,000 for the three months ended November 30, 2016. The increase in consolidated net sales was primarily a result of an increase in sales of ZERUST® rust and corrosion inhibiting packaging products, the contribution of NTIC China, and sales of Natur-Tec® products.\nThe following table sets forth NTIC’s net sales by product category for the three months ended November 30, 2017 and 2016, by segment:\nThree Months Ended November 30,\n2017\n% of Net\nSales\nNovember 30,\n2016\n% of Net\nSales\n%\nChange\nZERUST® industrial net sales $ 8,736,264 75.7 % $ 6,518,289 67.2 % 34.0 % ZERUST® joint venture net sales 507,631 4.4 % 820,058 8.4 % (38.1 )% ZERUST® oil & gas net sales 283,842 2.4 % 746,331 7.7 % (62.0 )% Total ZERUST® net sales $ 9,527,737 82.5 % $ 8,084,678 83.3 % 17.8 % Total Natur-Tec® sales 2,015,301 17.5 % 1,617,345 16.7 % 24.6 % Total net sales $ 11,543,038 100.0 % $ 9,702,023 100.0 % 19.0 % NTIC’s joint venture operating income increased 25.4% to $3,248,000 during the three months ended November 30, 2017, compared to joint venture operating income of $2,590,000 during the three months ended November 30, 2016. The increase was attributable to the corresponding increase in total sales of the joint ventures as fees for services provided to joint ventures are a function of the net sales of NTIC’s joint ventures, which were $28,499,000 during the three months ended November 30, 2017, compared to $24,200,000 for the three months ended November 30, 2016.\nOperating expenses, as a percent of net sales, for the first quarter of fiscal 2018 were 48.7%, compared to 53.1% for the same period last fiscal year. This reduction was primarily a result of higher personnel and research and development expenses, partially offset by lower general and administrative expenses.\nNTIC incurred legal expenses of $350,000 and $320,000 during the first quarter ended November 30, 2017 and 2016, respectively, related to the litigation against Cortec Corporation. On September 20, 2017, the United States District Court for the Northern District of Ohio dismissed with prejudice all claims asserted by NTIC in litigation against Cortec Corporation. At this time, NTIC does not anticipate any meaningful legal expenses going forward related to the litigation against Cortec Corporation.\nThe company reported net income attributable to NTIC for the first quarter of fiscal 2018 of $1,084,000, or $0.24 per diluted share, compared to net income attributable to NTIC of $298,000, or $0.07 per diluted share for the same period last fiscal year.\nNTIC’s balance sheet remains strong, with no debt, and working capital of $20,383,000 at November 30, 2017, including $4,627,000 in cash and cash equivalents and $3,770,000 in available for sale securities, compared to $21,173,000 at August 31, 2017, including $6,360,000 in cash and cash equivalents and $3,767,000 in available for sale securities.\nAt November 30, 2017, the company had $21,702,000 of investments in joint ventures, of which over $13,300,000 or 61% is cash, with the remaining balance mostly made up of other working capital.\nMr. Lynch added, “While oil and gas net sales were down in the first quarter, we expect oil and gas sales to improve in the second quarter. The anticipated higher oil and gas sales should further increase profitability in the second quarter, despite the slight impact of anticipated lower NTIC China sales due to Chinese New Year. In addition, profitability in the second half of the fiscal year should be better than the first half of the fiscal year, as NTIC historically experiences higher seasonal sales in the later part of the fiscal year.”\nOutlook\nFor the fiscal year ending August 31, 2018, NTIC continues to expect its net sales to be in the range of $46.0 million to $47.0 million. The company also continues to anticipate net income attributable to NTIC to be in the range of $5.0 million to $5.3 million, or $1.10 to $1.15 per diluted share. NTIC’s annual net income guidance does not take into consideration any non-cash write down to its deferred tax asset that NTIC expects will occur in the second quarter of fiscal 2018 as a result of the recent enactment of the Tax Cuts and Jobs Act.\nThese estimates are subject to significant risks and uncertainties, including those described below under the heading “Forward-Looking Statements.”\nConference Call and Webcast\nNTIC will host a conference call today at 8:00 a.m. Central Time to review its results of operations for the first quarter of 2018 and its future outlook, followed by a question and answer session. The conference call will be available to interested parties through a live audio webcast available through NTIC’s website", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ceba6823-74fc-472d-9fd4-ae0fad7b884a", "http://ir.ntic.com/events.cfm"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:34:57.004+02:00", "highlightTitle": ""}