{"organizations": [], "uuid": "11d85788f6f4be1e7dcec2a994788986073a74fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/883850646.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/stocks-tech-index-funds/", "country": "US", "domain_rank": 1196, "title": "Stocks: Why Your Index Funds Have Too Much Tech | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.703, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "11d85788f6f4be1e7dcec2a994788986073a74fd"}, "author": "Shawn Tully", "url": "http://fortune.com/2018/01/05/stocks-tech-index-funds/", "ord_in_thread": 0, "title": "Stocks: Why Your Index Funds Have Too Much Tech | Fortune", "locations": [], "entities": {"persons": [{"name": "shawn tully", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Shawn Tully January 5, 2018 \nIn recapping the stock market’s strong performance in 2017, the bulls invariably laud the tech titans as the force that, more than any other, propelled the S&P 500 and the Nasdaq to record after record. It’s chiefly the power of these world champions , the Wall Street crowd crows, that will make 2018 another double-digit winner for shareholders. \nFor the tens of millions of Americans who rely on index funds, however, the tech explosion may well prove the just the opposite—a heavy drag on their future returns. \nHere’s why. Most index funds, whether ETFs or mutual funds, are what’s called “cap weighted.” In an S&P 500 fund, if a stock or group of stocks in the same industry way outpaces the overall index, you as an investor will suddenly own far more of that company, or that industry, as a share of your holdings. As the prices of high flyers soar—and with them, their market capitalization—the index fund automatically gorges on those hot stocks. Your portfolio gets heavily weighted in the priciest companies, while sloughing off the laggards. \nThe problem is that, over time, doubling down on the most expensive companies generally hammers future performance. “Decades of research shows that a methodology that lowers exposure to the most expensive stocks, and favors cheaper shares, produces the best returns,” says Vitali Kalesnik of Research Affiliates, a firm that oversees investment strategies for $200 billion in mutual funds and ETFs. That’s the familiar “value” strategy pioneered by Benjamin Graham and championed by Warren Buffett. By contrast, the cap-weighted approach tilts heavily towards growth stocks sporting high PE multiples that reflect big expectations for future earnings, and shuns the “dogs” that can produce strong returns just by being mediocre—and over long periods, do a lot better. How your index fund became a tech fund \nIt’s hard to find a better case study on how index funds load up on hot, expensive stocks than the tech bonanza of 2017. What we’ll call the FAAMG companies, Facebook (fb) , Apple (aapl) , Amazon (amzn) , Microsoft (msft) , and Google (owned by Alphabet) (goog) , posted average gains of 47.3% last year . Those five players alone accounted for 5.2 percentage points of the S&P’s total gain of 23.7%. \nLet’s look at the FAAMGs as one big company, and examine how the gigantic jump in their combined value raised their weight in one S&P index fund. \nAt the start of 2017, FAAMG Inc.’s total market cap was $2.09 trillion, and it accounted for 11.06% of the iShares Core S&P 500 ETF managed by Blackrock. By the close of last year, its value had surged to $3.01 trillion, or 44%, raising its weight in the ETF to 13.36%. In other words, your investment in FAAMG rose by one-fifth last year, and the portion of your total ETF portfolio sitting in FAAMG increased by 2.3 percentage points. \nThat wouldn’t be so troublesome if FAAMG’s earnings had risen as much, or almost as much, as the astounding spike in its price. But that didn’t happen. By Fortune ‘s reckoning, FAAMG earned a total of $93.9 billion in 2016, and finished the year with a PE multiple of 22. In 2017, its combined profits rose 21.8%, but its “stock price” more than doubled, raising its PE to 27, effectively making FAAMG more than one-fifth more expensive. That PE was four points higher than the S&P 500’s overall multiple at year end. It’s important to note that FAAMG’s biggest earning unit by far, Apple, is showing no pattern of growing earnings . \nRaising the holding in one enterprise from 11.1% to 13.4% of a portfolio may not sound like much. But it can have a significant impact on future returns because of the phenomenon of “mean reversion,” or the tendency of trends, after they veer off in one direction, to return to normal. Let’s say our goal is a gain of 10% next year for our S&P index fund. Now imagine that FAAMG returns to its 2017 weight of 11%. In that case, FAAMG would drop 10.3%, giving back one-quarter of its gain for 2017. So to reach our 10% target, the rest of the S&P would need to rise almost 13%. \nPut another way, if the performance of the FAAMG hotshots ever returns to something like normal, the rest of your portfolio will have to work that much harder. A better way to index? \nFortunately, a better option exists. Research Affiliates has pioneered an approach known as “fundamental indexing.” Instead of weighting companies by their market cap, fundamental indexing establishes their share of the index based on their economic footprint. That heft is determined by a combination of four factors: sales; dividends plus buybacks; book value; and cash flows. Hence, if a company’s stock-market value soars far above its economic weight, indicating that it’s relatively expensive, the fund will lower its holdings in the pricey stock and boost its holdings in stocks whose value lags their overall size. \nResearch Affiliates’ RAFI U.S. Index uses the four-point criteria for economic heft rather than market cap. It’s used in a variety of funds covering different universes of stocks, including the PowerShares FTSE RAFI U.S. 1000, Almost all of the S&P 500 stocks would be included in that and other funds using the RAFI index. And as a result, the way it weights those big caps stocks is starkly different than that of a typical S&P index fund. \nAt year end, the share of the RAFI U.S. index in FAAMG was just 6%, less than half the proportion in the iShare Core S&P 500. Its Apple holding was 2.3%, versus 3.8% in the iShares fund. \nThe RAFI index features a far bigger proportion of low market cap stocks, and a lot less of the high-flyers. For example, tech and healthcare, the two priciest sectors, accounted for just 25.7% of the RAFI U.S. at the close of 2017, almost ten points below the 35% share for the iShares Core S&P. \nSo how has it performed? Precisely because such a small number of stocks accounted for so much of the 2017 rally, the RAFI U.S. index lagged the S&P 500 over the past year, by 3.7 points (18.1% to 21.8%, including dividends). Over the past five years, though, the two were roughly even. And backtesting the RAFI method, you’ll find that it would have beaten the S&P by an average of 2.24 pts, 9.44% to 7.20%, over the past 20 years. Those extra percentage points would add up to a lot: After 20 years, a theoretical RAFI investor would have had about 50% more money in her portfolio than someone who stuck with a cap-weighted S&P fund. \nIndex funds, including ETFs and mutual funds, are a great, low-cost choice for investors . But the chase-the-pricey stuff, sell-what’s-cheap mechanics present a challenge. The solution for someone with a long time horizon: Go contrarian. Fundamental indexing, which by its very nature dumps what’s hot and buys what’s unloved, fits that bill. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-08T21:34:09.005+02:00", "highlightTitle": ""}