{"organizations": [], "uuid": "d945f31cbb015bd9f5fb691a2a03873b5a9f9a89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104905632-RTX3M3VV.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/what-you-need-to-know-about-wednesdays-trump-news.html", "country": "US", "domain_rank": 767, "title": "What you need to know about Wednesday's Trump news", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.118, "site_type": "news", "published": "2018-01-03T23:54:00.000+02:00", "replies_count": 0, "uuid": "d945f31cbb015bd9f5fb691a2a03873b5a9f9a89"}, "author": "Terri Cullen", "url": "https://www.cnbc.com/2018/01/03/what-you-need-to-know-about-wednesdays-trump-news.html", "ord_in_thread": 0, "title": "What you need to know about Wednesday's Trump news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The first week of the new year for President Donald Trump 's administration got off to an explosive start Wednesday after excerpts from a forthcoming book on the early days of the Trump presidential candidacy produced shocking allegations from former campaign CEO Steve Bannon.\nNot unexpectedly, the president immediately responded with a similar level of vitriol to Bannon's comments in the book.\nshow chapters Upcoming book excerpt ignites feud between Trump, Bannon 22 Hours Ago | 02:42 Also, not to be overlooked amid the turmoil, Trump's former campaign chairman Paul Manafort sued special counsel Robert Mueller , Deputy Attorney General Rod Rosenstein and the Department of Justice in U.S. federal court alleging that the investigation has strayed beyond the scope of the original probe Mueller was authorized to pursue.\nNeed to get up to speed? Here is a summary of Wednesday's whirlwind news cycle:\n10 wild claims about Trump's White House from the upcoming book 'Fire and Fury'\nTrump did not want to win the election. First lady Melania Trump wept with sorrow on election night. Former Trump campaign advisor Sam Nunberg tried to explain the Constitution to the candidate, but only made it to the Fourth Amendment before Trump got bored.\n'Idiot' and 'dope': Book claims Trump's own advisors mocked him\nTop White House officials derided Trump for his intelligence, according to claims in an upcoming book, \"Fire and Fury: Inside the Trump White House,\" seen by NBC News.\nTrump attacks Steve Bannon: 'He not only lost his job, he lost his mind'\nTrump savaged former campaign CEO and White House chief strategist Bannon on Wednesday, contending that \"he not only lost his job\" but also \"lost his mind\" when he left the White House.\nRead Trump's full statement on Bannon\nHere is Trump 's full statement regarding Bannon .\nWhite House denies Donald Trump Jr. committed treason\nWhite House press secretary Sarah Huckabee Sanders on Wednesday called Bannon's claim that Donald Trump Jr.'s meeting with Russians in June 2016 was \"treasonous\" a \"ridiculous assertion.\"\nBannon says he's certain that Donald Trump met with Russians who were at Trump Tower in 2016\nBannon said he's certain that Donald Trump Jr. brought attendees of the June 2016 Trump Tower meeting to meet his father .\nOh, and...\nTrump ex-campaign manager Manafort sues special counsel Mueller, Deputy AG Rosenstein and the DOJ\nFormer Trump campaign chairman Manafort has sued special counsel Mueller, Deputy Attorney General Rosenstein and the Department of Justice in U.S. federal court, alleging that Mueller has strayed beyond the scope of the investigation he was authorized to pursue.\nWATCH: Manafort sues Mueller show chapters Trump ex-campaign chair Manafort sues Mueller, Rosenstein and Department of Justice 21 Hours Ago | 00:58", "external_links": [], "published": "2018-01-03T23:54:00.000+02:00", "crawled": "2018-01-04T00:19:38.003+02:00", "highlightTitle": ""}