{"organizations": [], "uuid": "db27bea10b4b5d1446fda7e54016c29d35414b57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224644344&w=1200&r=LYNXMPEE0N01A", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-surf-global-growth-wave-dollar-sinks-idUSKBN1FD03M", "country": "US", "domain_rank": 408, "title": "Asia shares surf global growth wave, dollar sinks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T02:56:00.000+02:00", "replies_count": 0, "uuid": "db27bea10b4b5d1446fda7e54016c29d35414b57"}, "author": "", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-surf-global-growth-wave-dollar-sinks-idUSKBN1FD03M", "ord_in_thread": 0, "title": "Asia shares surf global growth wave, dollar sinks", "locations": [], "entities": {"persons": [{"name": "wayne c", "sentiment": "negative"}, {"name": "chris weston", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 12:58 AM / Updated 4 hours ago Dollar extends weakness on Mnuchin remarks; bond prices down Caroline Valetkevitch 4 Min Read \nNEW YORK (Reuters) - The U.S. dollar extended recent weakness, hitting three-year lows again, and U.S. bond prices eased on Wednesday after U.S. Treasury Secretary Steven Mnuchin said he welcomed its weakness in the currency. \nFear of protectionism from the U.S. economy, the world’s largest, had already pushed the greenback to a three-year low, but Mnuchin’s remark at the annual Davos summit of business and political leaders pushed it down further. [nL8N1PJ1EG] \nAdding to those fears, Commerce Secretary Wilbur Ross said U.S. trade authorities are investigating whether there is a case for taking action over China’s infringements of intellectual property. [nL8N1PJ5HI] \nU.S. President Donald Trump had slapped steep tariffs on imported washing machines and solar panels on Monday. [nL2N1PH1WV] \nThe dollar index .DXY, which measures the greenback against a basket of six major currencies, was down 0.93 at 89.283, slipping below 90 for the first time since December 2014. [nL8N1PJ4FN] \n“It’s quite significant given that this is the first time in a very long time that a Treasury secretary has spoken against a strong dollar,” said Sireen Harajli, FX strategist at Mizuho. \nThe S&P 500 was flat, paring gains after the Ross comments, which fueled trade war fears. The dollar’s weakness, however, was providing some support since it helps U.S. multinationals’ earnings. [nL4N1PJ4ZF] FILE PHOTO: The London Stock Exchange Group offices are seen in the City of London, Britain, December 29, 2017. REUTERS/Toby Melville \n“To the extent that global growth is solid and a sizable portion of S&P earnings are earned overseas, I don’t look at this as being dollar negative at all,” said Joseph LaVorgna, chief economist for Americas at Nations in New York. \nAlso weighing on the S&P 500, GE ( GE.N ) shares were down 2.7 percent. In the latest blow to the largest U.S. industrial conglomerate, U.S. securities regulators are probing a massive insurance charge GE announced last week. GE also forecast more weakness at its power business this year, a unit that produced 60 percent of profits as recently as 2016. [nL4N1PJ43B] \nThe Dow Jones Industrial Average .DJI rose 51.4 points, or 0.2 percent, to 26,262.21, the S&P 500 .SPX lost 3.03 points, or 0.11 percent, to 2,836.1 and the Nasdaq Composite .IXIC dropped 43.40 points, or 0.58 percent, to 7,416.89. \nThe pan-European FTSEurofirst 300 index .FTEU3 lost 0.51 percent and MSCI's gauge of stocks across the globe .MIWD PUS gained 0.12 percent. [nL8N1PJ1VY] \nEuro zone businesses enjoyed a much better start to 2018 than anyone polled by Reuters expected, ramping up activity at the fastest rate since the middle of 2006, a survey showed on Wednesday. [nL9N1LS01D] \nU.S. Treasury debt prices slumped, also after Mnuchin’s comments. [nL2N1PJ136] \nBenchmark 10-year notes US10YT=RR last fell 8/32 in price to yield 2.6502 percent, from 2.622 percent late on Tuesday. \nIn the oil market, U.S. crude CLcv1 rose 0.51 percent to $64.80 per barrel and Brent LCOcv1 was last at $69.85, down 0.16 percent on the day. [nL4N1PJ1GE] Additional reporting by Abhinav Ramnarayan and Marc Jones in London, and Saqib Iqbal Ahmed in New York and Sruthi Shankar in Bengaluru; Editing by Mark Heinrich and Nick Zieminski", "external_links": [], "published": "2018-01-24T02:56:00.000+02:00", "crawled": "2018-01-24T03:10:32.007+02:00", "highlightTitle": ""}