{"organizations": [], "uuid": "1387099257791f06547bacccf5a94a50ed6a513f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224517231&w=1200&r=LYNXMPEE0M1BM", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/awards-oscars-reactions/factbox-oscar-nominations-greeted-with-pride-gratitude-and-delight-idINKBN1FC256", "country": "US", "domain_rank": 408, "title": "Factbox: Oscar nominations greeted with pride, gratitude and delight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:58:00.000+02:00", "replies_count": 0, "uuid": "1387099257791f06547bacccf5a94a50ed6a513f"}, "author": "", "url": "https://in.reuters.com/article/awards-oscars-reactions/factbox-oscar-nominations-greeted-with-pride-gratitude-and-delight-idINKBN1FC256", "ord_in_thread": 0, "title": "Factbox: Oscar nominations greeted with pride, gratitude and delight", "locations": [], "entities": {"persons": [{"name": "meryl streep", "sentiment": "none"}, {"name": "sally hawkins", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Nominees for the Academy Awards, which will be presented on March 4, greeted the honours with surprise, gratitude and some serious thoughts about making movies.\nThe following are some reactions - through statements, telephone calls and social media - to the Oscar nominations announced on Tuesday by the Academy of Motion Picture Arts and Sciences.\n- Meryl Streep, best actress for “The Post,” her 21st nomination\n”I am honoured beyond measure by this nomination for a film I love, a film that stands in defence of press freedom, and inclusion of women’s voices in the movement of history - Proud of the film, and all her filmmakers. Thank you from a full heart.”\n- Guillermo del Toro, nominated for director and original screenplay for “The Shape of Water,” which led the nominations with 13 nods including for best picture\n“I feel incredibly happy and grateful and the best part is to be nominated with the team and see the craftmanship and artistry of the movie rewarded. For 25 years, I’ve been preaching that the dark poetry and emotion of my stories are fairytales for modern times. I truly believe they resonate with an audience in way that can only be accessible by saying ‘once upon a time.'”\n- Jordan Peele, nominated for director and original screenplay for “Get Out,” which is also up for best picture\n“It feels amazing to know that people not only have seen the film but really feel the film, and feel the experience I was trying to illustrate that’s really important to a lot of people. For so long, I’ve just wanted to be a director, my dream has been to make films, and for so long, I just thought the biggest and best reward that could even come from my first movie is that I might get to make another one. I still feel that way, but this is going to help with that.”\n- Sally Hawkins, nominated for best actress for “The Shape of Water”\n“I am so delighted for us all. To be honoured by the acknowledgement of my colleagues of fellow actors, filmmakers, writers, crew members is truly humbling. It is a privilege to tell such stories and to be able to make films that show there is a life beyond the life that people know – one that is not always seen.”\n- Christopher Plummer, best supporting actor nominee for “All the Money in the World”\n“I am absolutely thrilled to have received this nomination by the Academy. It was quite unexpected but incredibly gratifying. Everything has happened so quickly of late that I am still a trifled stunned but excited by it all.”\n- Gary Oldman, best actor nominee for “Darkest Hour”\n“To have the chance to play an iconic leader like Winston Churchill at this point in my career, was the opportunity of a lifetime and I am so happy that my colleagues and partners on this wonderful film have also been honoured with nominations. I am overjoyed to be nominated, and proud to be part of this wonderful thing known as movie making!”\n- Lesley Manville, best supporting actress nominee for “Phantom Thread”\nActor Doug Sally Hawkins attends the premiere of \"The Shape of Water\" in Los Angeles, California, U.S. November 15, 2017. REUTERS/David McNew/Files ”I am rather giddy with excitement at the wonderful news and extremely thankful ... It is also quite a day for my son Alfie Oldman - having both parents nominated in the same year.”\n- Greta Gerwig, nominated for best director and best original screenplay for “Lady Bird,” which is also up for best picture\n“This is an unbelievable honour and I am beside myself with joy and gratitude. The entire team who made ‘Lady Bird’ poured their heart and soul into it, and I am so deeply grateful to the Academy for their recognition.”\n- Saoirse Ronan, best actress nominee for “Lady Bird”\n“To have been a part of a film like ‘Lady Bird’ was a true privilege and I am incredibly grateful to the Academy for recognising this wonderful story about the beauty and strength of women.”\nDirector Martin McDonagh arrives for the UK premiere screening of 'Three Billboards Outside Ebbing, Missouri', on the closing night of the British Film Institute (BFI) London Film Festival at the Odeon, Leicester Square in central London, Britain October 15, 2107. REUTERS/Luke MacGregor/Files - Laurie Metcalf, best supporting actress nominee for “Lady Bird”\n“It feels surreal. I never thought that this would ever happen. My career is not focussed on movies, I just didn’t see that this would ever be a possibility and so I owe that to Greta and Saoirse.”\n- Richard Jenkins, best supporting actor nominee for “The Shape of Water”\n“I’m so excited and thrilled by the nomination and for “The Shape of Water” team lead by Guillermo the Great. It is rare and humbling to be part of something so special.”\n- Kumail Nanjiani and Emily V. Gordon, nominated for original screenplay for “The Big Sick”\n“It was an incredibly unique challenge to take some of the most vulnerable, painful, and beautiful moments from our life together and turn it into a movie. At times we worried it would be insurmountable, or would rip us apart, or even worse- that no one would like it. The fact that it connected with audiences is exhilarating, and this nomination proves that our love is real. We have decided to stay married.”\n- Martin McDonagh, director of “Three Billboards Outside Ebbing, Missouri,” which received seven nominations including best picture, best actress and best supporting actor\n“I‘m thrilled that our film has received seven nominations from the Academy, and that the beautiful work of our editor Jon Gregory, our composer Carter Burwell, my gentle brothers-in-arms Woody Harrelson and Sam Rockwell, and our fearless leader Frances McDormand, have all been recognized so wonderfully.”\n- Octavia Spencer, best supporting actress nominee for “The Shape of Water”\n“My heart is bursting with pure elation for the cast and crew of ‘The Shape Of Water.’ Guillermo has given us all a dream job and to be recognized by the Academy is so deeply moving.”\nCompiled by Patricia Reaney; Additional reporting by Piya Sinha-Roy and Jill Serjeant; Editing by Frances Kerry\n ", "external_links": [], "published": "2018-01-23T17:58:00.000+02:00", "crawled": "2018-01-23T18:39:44.012+02:00", "highlightTitle": ""}