{"organizations": [], "uuid": "c87e7d88cc821fd7e1aace6738993de845fc29bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-tactile-systems-technology-inc-reports-preliminary-full-year-and-fourth-quarter-2017-revenue-results.html", "country": "US", "domain_rank": 767, "title": "Tactile Systems Technology, Inc. Reports Preliminary Full Year and Fourth Quarter 2017 Revenue Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.978, "site_type": "news", "published": "2018-01-08T14:45:00.000+02:00", "replies_count": 0, "uuid": "c87e7d88cc821fd7e1aace6738993de845fc29bf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-tactile-systems-technology-inc-reports-preliminary-full-year-and-fourth-quarter-2017-revenue-results.html", "ord_in_thread": 0, "title": "Tactile Systems Technology, Inc. Reports Preliminary Full Year and Fourth Quarter 2017 Revenue Results", "locations": [], "entities": {"persons": [{"name": "flexit", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "tactile systems technology, inc", "sentiment": "neutral"}, {"name": "tactile systems technology, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Tactile Systems Technology, Inc. (“Tactile Medical”) (Nasdaq:TCMD), a medical technology company focused on developing medical devices for the treatment of chronic diseases at home, today reported preliminary revenue results for the full year and fourth quarter ended December 31, 2017.\nPreliminary Full Year 2017 Revenue Summary:\nFull year 2017 revenue is expected to be in the range of $108.5 million to $109.0 million, representing growth of approximately 28% to 29% year-over-year. 2017 revenue is expected to be comprised of: Flexitouch system revenue in the range of $99.6 million to $100.1 million, representing growth of approximately 36% year-over-year Entre and Actitouch systems revenue of approximately $8.9 million, representing a decrease of approximately 20% year-over-year\nPreliminary Fourth Quarter Revenue Summary:\nFourth quarter total revenue is expected to be in the range of $34.1 million to $34.6 million, representing growth of approximately 20% to 21% year-over-year. Fourth quarter revenue is expected to be comprised of: Flexitouch system revenue in the range of $31.7 million to $32.1 million, representing growth of approximately 25% to 26% year-over-year Entre and Actitouch systems revenue of approximately $2.4 million, representing a decrease of approximately 20% year-over-year\n“We are pleased to end the year with another quarter of exceptional performance marked by strong sales of our Flexitouch system,” said Gerald R. Mattys, Chief Executive Officer of Tactile Medical. “Our Flexitouch sales this quarter – and throughout 2017 – reflect the Company’s strong execution with respect to our primary growth drivers: sales team expansion, focused account targeting and increased in-network coverage with payers. These drivers also serve to increase market awareness of chronic swelling conditions and how Tactile Medical’s innovative solutions can improve the quality of life for people suffering from them. In 2018, we will remain focused on these core elements of our strategy and we continue to target 20% plus revenue growth with improving profitability.”\nThis financial information is preliminary and subject to completion of the company’s year-end financial reporting processes and audit. Tactile Medical intends to report its full year and fourth quarter 2017 financial results in February and will provide the anticipated report date in a subsequent press release.\nAbout Tactile Systems Technology, Inc. (DBA Tactile Medical)\nTactile Medical is a leader in developing and marketing at-home therapy devices that treat chronic swelling conditions such as lymphedema and chronic venous insufficiency. Our mission is to help people suffering from chronic diseases live better and care for themselves at home. Our unique offering includes advanced, clinically proven pneumatic compression devices, as well as continuity of care services provided by a national network of product specialists and trainers, reimbursement experts, patient advocates, and clinical staff. This combination of products and services ensures that tens of thousands of patients annually receive the at-home treatment necessary to better manage their chronic conditions. Tactile Medical takes pride in the fact that our solutions help increase clinical efficacy, reduce overall healthcare costs and improve the quality of life for patients with chronic conditions.\nLegal Notice Regarding Forward-Looking Statements:\nThis release contains forward-looking statements. Forward-looking statements are generally identifiable by the use of words like “may,” “will,” “should,” “could,” “expect,” “anticipate,” “estimate,” “believe,” “intend,” “confident,” or “project” or the negative of these words or other variations on these words or comparable terminology. The reader is cautioned not to put undue reliance on these forward-looking statements, as these statements are subject to numerous factors and uncertainties outside of the Company’s control that can make such statements untrue, including, but not limited to, the adequacy of the Company’s liquidity to pursue its complete business objectives; the Company’s ability to obtain reimbursement from third party payers for its products; loss or retirement of key executives; adverse economic conditions or intense competition; loss of a key supplier; entry of new competitors and products; adverse federal, state and local government regulation; technological obsolescence of the Company’s products; technical problems with the Company’s research and products; the Company’s ability to expand its business through strategic acquisitions; the Company’s ability to integrate acquisitions and related businesses; price increases for supplies and components; or the inability to carry out research, development and commercialization plans. In addition, other factors that could cause actual results to differ materially are discussed in the Company’s filings with the SEC. Investors and security holders are urged to read these documents free of charge on the SEC’s website at http://www.sec.gov . The Company undertakes no obligation to publicly update or revise its forward-looking statements as a result of new information, future events or otherwise.\nInvestor Inquiries: Mike Piccinino, CFA Managing Director Westwicke Partners 433-213-0500 investorrelations@tactilemedical.com\nSource:Tactile Systems Technology, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5e528ddc-facb-41f2-b232-4bb7a34511ba"], "published": "2018-01-08T14:45:00.000+02:00", "crawled": "2018-01-08T15:33:51.006+02:00", "highlightTitle": ""}