{"organizations": [], "uuid": "ea4254d0a1d08c24a5c60217a94fe4ddbdb1181f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-oncomed-announces-chairman-president-and-chief-executive-officer-paul-j-hastings-has-resigned.html", "country": "US", "domain_rank": 767, "title": "OncoMed Announces Chairman, President and Chief Executive Officer Paul J. Hastings has Resigned", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:02:00.000+02:00", "replies_count": 0, "uuid": "ea4254d0a1d08c24a5c60217a94fe4ddbdb1181f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-oncomed-announces-chairman-president-and-chief-executive-officer-paul-j-hastings-has-resigned.html", "ord_in_thread": 0, "title": "OncoMed Announces Chairman, President and Chief Executive Officer Paul J. Hastings has Resigned", "locations": [], "entities": {"persons": [{"name": "paul j. hastings", "sentiment": "negative"}, {"name": "sunil patel", "sentiment": "none"}, {"name": "jack lasersohn", "sentiment": "none"}, {"name": "perry karsen", "sentiment": "none"}, {"name": "john lewicki", "sentiment": "none"}], "locations": [{"name": "redwood city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "resigned board of directors", "sentiment": "negative"}, {"name": "research and development", "sentiment": "none"}, {"name": "oncomed pharmaceuticals, inc.", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Board of Directors has initiated search to identify successor\nOffice of the President continues to perform the duties of President and CEO\nPerry Karsen appointed as Chairman of the Board\nREDWOOD CITY, Calif., OncoMed Pharmaceuticals, Inc. (NASDAQ:OMED), a clinical-stage biopharmaceutical company focused on discovering and developing novel anti-cancer therapeutics, today announced that Chairman, President and Chief Executive Officer Paul J. Hastings resigned from OncoMed to pursue new career opportunities, effective January 1st, 2018.\nThe board of directors has retained an executive search firm and has initiated a search for a fulltime successor. In the interim, The Office of the President, comprised of Executive Vice President, Research and Development, John Lewicki, and Executive Vice President and Chief Financial Officer, Sunil Patel, will continue to perform the duties of President and CEO. In addition, the Board of Directors has appointed Perry Karsen as Chairman of the Board while Jack Lasersohn, formerly Lead Director, remains a Board Member.\n“After twelve fulfilling and successful years of service, it is time for me to step-down from my responsibilities at OncoMed and move to the next stage of professional opportunities available to me,” said Mr. Hastings. “I look forward to watching the company and its high caliber team continue to grow and evolve into a late-stage development organization serving the needs of patients with cancer.”\n“We are thankful for Paul’s many years of leadership,” said Perry Karsen, Chairman of the Board, “We are grateful for the fundamental role Paul has played in driving forward OncoMed’s differentiated platform technology, and positioning the company to be a leader in discovering and developing the next-generation immuno-oncology and anti-cancer therapeutics. We thank Paul for his leadership and accomplishments during his tenure at OncoMed and wish him the best in his future endeavors.”\nMr. Hastings joined OncoMed as Chief Executive Officer in 2006. During his tenure, OncoMed has successfully advanced a broad pipeline of candidates against a diverse array of anti-cancer stem cell and immuno-oncology targets, including wholly-owned GITRL-Fc, and multiple programs partnered with Celgene Corporation. Looking ahead, with numerous clinical trials underway and updates from the navicixizumab and anti-TIGIT programs anticipated in 2018, OncoMed is well positioned to deliver value in 2018 and beyond.\nAbout OncoMed Pharmaceuticals\nOncoMed Pharmaceuticals is a clinical-stage biopharmaceutical company focused on discovering and developing novel anti-cancer therapeutics. OncoMed has internally discovered a broad pipeline of investigational drugs intended to address the fundamental biology driving cancer's growth, resistance, recurrence and metastasis. Navicixizumab (anti-DLL4/VEGF bispecific, OMP-305B83), rosmantuzumab (anti-RSPO3, OMP131-R10) and anti-TIGIT (OMP-313M32) are part of OncoMed’s strategic alliance with Celgene Corporation. OncoMed is independently developing GITRL-Fc (OMP-336B11), as well as continuing to pursue new drug discovery research. For further information about OncoMed Pharmaceuticals, please see www.oncomed.com .\nForward Looking Statements\nTo the extent that statements contained in this press release are not descriptions of historical facts regarding OncoMed Pharmaceuticals, they are forward-looking statements reflecting the current beliefs and expectations of management made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including, without limitation, OncoMed's intentions and expectations regarding how well OncoMed is positioned to deliver value in 2018 or beyond; the timing of updates on OncoMed’s programs; and OncoMed's ability to grow and evolve into a late-stage development organization serving the needs of patients with cancer. Such forward-looking statements involve substantial risks and uncertainties that could cause OncoMed's clinical development programs, future results, performance or achievements to differ significantly from those expressed or implied by the forward-looking statements. Such risks and uncertainties include, among others, the uncertainties inherent in the preclinical and clinical development process; OncoMed's dependence on its collaboration partner Celgene for the funding of its partnered programs; OncoMed's ability to raise additional capital to support the development of its unpartnered programs; OncoMed's reliance on third parties to conduct certain preclinical studies and all of its clinical trials; OncoMed's reliance on single source third-party contract manufacturing organizations to manufacture and supply its product candidates; and OncoMed's dependence on its key executives. OncoMed undertakes no obligation to update or revise any forward-looking statements. For a further description of the risks and uncertainties that could cause actual results to differ from those expressed in these forward-looking statements, as well as risks relating to OncoMed's business in general, see OncoMed's Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission (SEC) on March 9, 2017, OncoMed's Quarterly Report on Form 10-Q filed with the SEC on November 2, 2017, and OncoMed's other current and periodic reports filed with the SEC.\nInvestor Relations Contact:\nPeter Rahmer\nTrout Group\nprahmer@troutgroup.com\n(646) 378-2973\nMike Zanoni\nTrout Group\nmzanoni@troutgroup.com\n(646) 378-2924\nSource:OncoMed Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/250c7064-4e3c-489e-ae1b-9daf1a471d06", "https://www.globenewswire.com/Tracker?data=GegXA1ESbT5fcbr5RISyecrg8YeHKVZ1ajTiZEt5qzWlTVycBijs64LkgktZqzuKDP8b3V6kaDYi_kef_LI2zclAiG126paytcWsvYa-kYs=", "https://www.globenewswire.com/Tracker?data=yM_xh0ODNGE61HySuRhvI76jlTbCSYi0yDc6om0BsapPn4Y9Lk4J1-3f98NKpO6fKcwO3RNZm_uZiNUfr3lA1w==", "https://www.globenewswire.com/Tracker?data=B9WvhdWucYFtCOCasyUajIo0rXiGOrmfiBsz13N-dDkKvWLTNEuXFEGIHvSlCXetfYwDSk75JJQ5BgPKflcdcukxHOm6_f104UQxhLrE7mA="], "published": "2018-01-05T00:02:00.000+02:00", "crawled": "2018-01-05T01:21:01.006+02:00", "highlightTitle": ""}