{"organizations": [], "uuid": "0067c7aa2cafac9be30c9cea0ac891b5513432f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225271500&w=1200&r=LYNXMPEE0O1MO", "site_section": "https://www.reuters.com/home", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-labour/davoss-unlikely-man-british-socialist-puts-alpine-elite-on-notice-idUSKBN1FE2ZH", "country": "US", "domain_rank": 408, "title": "Davos's unlikely man: British socialist puts Alpine elite on notice", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-26T05:11:00.000+02:00", "replies_count": 0, "uuid": "0067c7aa2cafac9be30c9cea0ac891b5513432f8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-labour/davoss-unlikely-man-british-socialist-puts-alpine-elite-on-notice-idUSKBN1FE2ZH", "ord_in_thread": 0, "title": "Davos's unlikely man: British socialist puts Alpine elite on notice", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "john mcdonnell", "sentiment": "negative"}, {"name": "daniel", "sentiment": "none"}, {"name": "karl marx", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - John McDonnell, a proud socialist who wants to run Britain’s economy and tear up the rules of capitalism, isn’t the kind of guy you expect to find rubbing shoulders with the global elite at a Swiss ski resort.\nBut at the World Economic Forum in Davos this week, that is exactly what he’ll be doing: telling bankers, investors and chief executives that the current capitalist system is living on borrowed time.\n“It’s a bit like being Daniel in the lion’s den, but someone has to come here and just give them a bit of a shake,” McDonnell, who cites Karl Marx among his key economic influences, told Reuters in Davos.\nGrey-haired and soft-spoken, belying decades of experience rallying crowds for Britain’s hitherto fringe hard-left movement, McDonnell said people in Britain and other countries couldn’t relate to the economic optimism expressed in Davos.\n“When they are told wealth is being restored, the economy is growing, and they do not share in that growth ... that’s when people get alienated. People need to wake up and listen to that,” he said.\nMcDonnell, 66, has been at the vanguard of a left-wing revival within Britain’s opposition Labour Party. He has promised sweeping nationalization, higher public spending and an overhaul of the banking system.\nLed by his fellow veteran leftist Jeremy Corbyn, Labour captured the imagination of young voters at last year’s election, depriving center-right Prime Minister Theresa May of an outright victory and weakening her position as she negotiates Britain’s exit from the European Union.\nAlthough no election is due until 2022, investors, already looking askance at Britain because of Brexit, are asking: Will May’s government collapse? Will Labour win power? And what would that mean for the British economy?\n“What we’re looking for, so people are clear, is to transform our society. We want a society that’s radically more equal, radically fairer, radically more democratic,” McDonnell said.\nThe man who would be Corbyn’s finance minister said he had been approached by energy firms and tech companies keen to meet him at Davos and had already spoken to other corporate leaders. He was due to speak in two panel debates on Friday.\nLast year, Morgan Stanley cautioned investors that the risk of Corbyn winning power and dismantling what was once seen as one of the world’s most stable free-market economies was a bigger political risk in Britain than Brexit.\nBut McDonnell said the message is simple for anyone who has concerns: “Pay your workers a decent wage, make sure they share in the profits, make sure they have a say in the company, make sure you pay your taxes and at the same time, make sure you’re investing for the long-term future.”\nRADICAL REFORM? Labour has promised to end austerity, seizing on the fatigue among voters with seven years of Conservative attempts to reign in Britain’s huge budget deficit.\nFILE PHOTO - Britain's Shadow Finance Minister John McDonnell speaks at the Labour Party Post-Budget Rally in West Bromwich, Britain, November 23, 2017. REUTERS/Darren Staples McDonnell, who once theatrically offered in parliament to lend his copy of Chairman Mao’s “Little Red Book” to then- finance minister George Osborne, has big plans for Britain’s economy.\nAmong the policies in last year’s election campaign was a pledge to invest 250 billion pounds ($286.50 billion) in capital projects such as roads and hospitals over a decade, bypassing London’s financial center.\nThat would add to an already soaring 1.6 trillion-pound national debt and push back the elimination of a budget deficit, which the government expects will take until the mid-2020s to wipe out.\nAware that voters worry about Labour’s plans for the economy, McDonnell has stressed the need to control spending.\nHe has promised to close the deficit in day-to-day spending over five years and observe a “fiscal credibility rule” that Labour can borrow only for capital projects which will pay for themselves over time.\nLabour also wants to return infrastructure like rail and water to the public sector and end the outsourcing of government functions to private companies such as Carillion, which went bust earlier this month.\nRather than rushing into forced acquisitions, Labour would phase in state ownership that might only bring Britain into line with European rivals, France and Germany, which have higher levels of state involvement in industry and finance.\nRATHER BE AT HOME But for an island nation with a centuries-long laissez-faire tradition, it would represent a major change, reversing three decades of almost uninterrupted economic liberalization started by Conservative Margaret Thatcher and continued under more centrist Labour governments.\nNevertheless, McDonnell says the public is ready to hear Labour’s message, predicting an early election and a win for his party.\nLabour is tied with the Conservatives in opinion polls - a far better position than before last year’s election was called, when they trailed by over 20 percentage points.\nBut while many in May’s Conservative Party have doubts about her leadership, the risk of losing power to Labour is seen as a deterrent to any attempt to topple her.\nEver the campaigner, McDonnell said that he’d prefer be at home in his west London constituency talking to voters rather than in the Swiss mountains, but that it had been his “duty” to come to Davos and set out Labour’s position.\n“It’s part of my job. I’d rather be back in Hayes and Harlington to be honest ... or I’d rather be at a public meeting somewhere up north in England,” he said. “This is beautiful, but I haven’t got time for the view.”\n($1 = 0.6981 pounds)\nWriting by William James, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T05:11:00.000+02:00", "crawled": "2018-01-25T23:19:09.000+02:00", "highlightTitle": ""}