{"organizations": [], "uuid": "74942d080f1b12f62ea8bfdd1c20c545282bc57c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-cryptocurrency-arisebank/u-s-halts-arisebanks-initial-coin-offering-alleges-fraud-idUSKBN1FJ222", "country": "US", "domain_rank": 408, "title": "U.S. halts AriseBank's initial coin offering, alleges fraud", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:57:00.000+02:00", "replies_count": 0, "uuid": "74942d080f1b12f62ea8bfdd1c20c545282bc57c"}, "author": "", "url": "https://www.reuters.com/article/us-usa-cryptocurrency-arisebank/u-s-halts-arisebanks-initial-coin-offering-alleges-fraud-idUSKBN1FJ222", "ord_in_thread": 0, "title": "U.S. halts AriseBank's initial coin offering, alleges fraud", "locations": [], "entities": {"persons": [{"name": "chizu nomiyama", "sentiment": "none"}, {"name": "susan heaveyediting", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "arisebank", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:58 PM / in 32 minutes U.S. SEC halts AriseBank's initial coin offering, alleges fraud Gertrude Chavez-Dreyfuss , Susan Heavey 3 Min Read \nNEW YORK/WASHINGTON (Reuters) - The U.S. Securities and Exchange Commission has halted what it alleged was a fraudulent initial coin offering by Dallas-based AriseBank to raise $1 billion for its “AriseCoin” cryptocurrency, the agency said in a statement on Tuesday. \nThe SEC said it had obtained a court order to halt AriseBank’s efforts to target investors, and alleged that the entity had “falsely stated that it purchased an FDIC-insured bank” and had “allegedly omitted to disclose the criminal background of key executives.” \n“We allege that AriseBank and its principals sought to raise hundreds of millions from investors by misrepresenting the company as a first-of-its-kind decentralized bank offering its own cryptocurrency to be used for a broad range of customer products and services,” said Stephanie Avakian, co-director of the SEC’s Enforcement Division, in the statement. \n“We sought emergency relief to prevent investors from being victimized by what we allege to be an outright scam,” she added. \nThe court also has ordered that AriseBank’s assets be frozen and approved the appointment of a receiver for those assets in connection with an ICO fraud. \nRepresentatives for AriseBank could not be immediately reached for comment. \n“This is what we expect from the SEC and other regulators in 2018: they aggressively enforce existing laws, as well as investigate, and prosecute those that violate the law,” said Texas-based Arnold Spencer, general counsel of Coinsource, which operates bitcoin ATM machines. \nAriseCoin’s public sale began around Dec. 26, 2017, and was originally scheduled to conclude on Jan. 27, 2018, with distribution to investors on Feb. 10, 2018. It was founded by Jared Rice Sr. and Stanley Ford. \nEarlier, the Texas Department of Banking issued a consumer alert that identified Arise Bank as unauthorized and unregulated. The department issued a cease and desist order on AriseBank earlier this year, according to its website. \nIn a letter to the Texas financial regulator seen by Reuters, AriseBank founder Rice said the company refuses to comply with the cease-and-desist order. \n“It is absolutely clear we are here to end legacy banking as we know it or at least make them honest, transparent and able to commingle with the cryptocurrency banks of the future,” said Rice in the letter. \n“I respectfully oppose your mission to enable slavery amongst Texas residents and I will stand with force in regards to my mission to free Texas residents from the slavery you choose to further.” Reporting by Gertrude Chavez-Dreyfuss in New York and Susan Heavey in Washington; Editing by Chizu Nomiyama and David Gregorio", "external_links": [], "published": "2018-01-30T16:57:00.000+02:00", "crawled": "2018-01-30T17:13:33.006+02:00", "highlightTitle": ""}