{"organizations": [], "uuid": "4595be53f9747a44a19480a43391443c756fbcb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-girls-who-invest-names-janet-cowell-former-north-carolina-state-treasurer-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Girls Who Invest Names Janet Cowell, Former North Carolina State Treasurer, as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:04:00.000+02:00", "replies_count": 0, "uuid": "4595be53f9747a44a19480a43391443c756fbcb6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-girls-who-invest-names-janet-cowell-former-north-carolina-state-treasurer-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "Girls Who Invest Names Janet Cowell, Former North Carolina State Treasurer, as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "janet cowell", "sentiment": "negative"}, {"name": "cowell", "sentiment": "negative"}, {"name": "janet", "sentiment": "none"}, {"name": "kathleen powers dunlap", "sentiment": "none"}, {"name": "seema r. hingorani", "sentiment": "none"}], "locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "north carolina state treasurer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cowell’s leadership to harness group’s momentum, accelerate progress toward ‘30 by 30’ goal\nNEW YORK--(BUSINESS WIRE)-- Girls Who Invest (“GWI”), a non-profit organization dedicated to increasing the number of women in portfolio management and executive leadership in the asset management industry, today announced that Janet Cowell, former North Carolina State Treasurer, has joined as Chief Executive Officer. Cowell takes over from Kathleen Powers Dunlap, who is retiring from the position.\n“I am excited to welcome Janet to her new position as Chief Executive of Girls Who Invest. Janet is a highly accomplished industry professional, and she will propel our organization and its mission to the next level of growth,” said Seema R. Hingorani, Founder and Chair of Girls Who Invest. “I look forward to working with Janet along with my fellow Board members as we continue to deliver on our goal to have 30% of the world’s investable capital managed by women by the year 2030.”\nMs. Cowell brings executive leadership experience in finance, public service and education to the CEO role. She held publicly elected office in North Carolina for fifteen years, including eight as North Carolina State Treasurer. The first woman elected to that position, Ms. Cowell managed more than $100 billion in assets, and health and retirement benefits, for more than 900,000 members. During her tenure, Ms. Cowell consistently achieved exceptional results and national recognition. Prior to public service, she was a securities analyst for Lehman Brothers and HSBC in Hong Kong and Southeast Asia.\nIn addition, Ms. Cowell chairs the Executive Education Board of The Wharton School at the University of Pennsylvania. During her tenure as North Carolina State Treasurer, she was a member of the North Carolina Community College Board and State School Board and was successful in integrating financial literacy into the state’s core curriculum. Ms. Cowell, who began her new role on January 2, 2018, earned a BA in Non-Western History from the University of Pennsylvania and an MBA from The Wharton School.\n“It is an honor to work with some of the most respected leaders in the asset management business and academic community to help bring transformational change to the financial industry,” said Ms. Cowell. “I am excited and look forward to engaging with the GWI board, advisory board and staff – as well as all of the talented young women whom we serve – to ensure that we continue to build upon the tremendous impact that Girls Who Invest has already had in a short period of time.”\n“Over the past two and a half years, Kathleen Powers Dunlap has helped us execute on a bold vision to create a significant pipeline of talented and diverse young women prepared to succeed on investment teams in the asset management industry, and I thank her for her incredible passion and dedication to making this happen,” said Ms. Hingorani.\n“It has been tremendously fulfilling to empower the future leaders of an industry that I’ve been privileged to work in for 40 years,” said Ms. Dunlap. “I’m thankful for our incredible team, the GWI board, our advisory board, our partners and the scholar community for coming together to right the gender imbalance problem. It is an honor to pass the mantle to Janet as she takes Girls Who Invest—and the industry’s transformation—forward.”\nAbout Janet Cowell\nJanet Cowell is the Chief Executive Officer of Girls Who Invest. From 2009 to 2016, she served as the State Treasurer of North Carolina, the first woman to hold that position. As State Treasurer, Ms. Cowell successfully managed more than $100 billion in assets and health and retirement benefits for 900,000 members. Previously she was a two-term member of the Raleigh City Council and a two-term Democratic member of the North Carolina Senate, representing Wake County.\nMs. Cowell earned her BA in Non-Western History from the University of Pennsylvania and her MBA from The Wharton School.\nAbout Seema R. Hingorani\nSeema R. Hingorani is the Founder and Chair of Girls Who Invest. She is also the Founder and Chief Investment Officer of SevenStep Capital, an opportunistic alternatives seeding platform that has a focus on investing in women and minority portfolio managers. Previously Ms. Hingorani served as Chief Investment Officer for the New York City Retirement Systems, which had assets of $160 billion.\nShe earned her BA in Psychology/Philosophy from Yale College and her MBA in Finance from The Wharton School at the University of Pennsylvania.\nAbout Girls Who Invest\nGirls Who Invest is a non-profit organization founded in April 2015 to inspire and empower young women to pursue careers in asset management—a field challenged by a lack of diversity. With the help of our industry and academic partners, we are developing a pipeline of highly qualified young women to take on substantial roles in the asset management industry. Our goal is to see 30% of the world’s investable capital managed by women by 2030 (’30 by 30’). Our approach is simple and practical: Create a pipeline of talented, motivated young women through an intensive educational program, a meaningful paid internship experience and a robust ongoing community. For more information, visit www.girlswhoinvest.org .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005597/en/\nRubenstein\nCarolyn Sargent, 212-843-8030\ncsargent@rubenstein.com\nSource: Girls Who Invest", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fgirlswhoinvest.org&esheet=51740729&newsitemid=20180110005597&lan=en-US&anchor=Girls+Who+Invest&index=1&md5=bf7b5fe9658e18076fde6eb09ec05cd6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.girlswhoinvest.org&esheet=51740729&newsitemid=20180110005597&lan=en-US&anchor=www.girlswhoinvest.org&index=2&md5=7d69975e1e9967028b3f61d103cb2ede", "http://www.businesswire.com/news/home/20180110005597/en/"], "published": "2018-01-10T16:04:00.000+02:00", "crawled": "2018-01-10T19:15:49.007+02:00", "highlightTitle": ""}