{"organizations": [], "uuid": "000c0150f279dc9f255091973635fa3ce43f0851", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-zapp360-appoints-new-leadership-following-rapid-growth-in-2017-as-a-local-saas-advertising-disruptor.html", "country": "US", "domain_rank": 767, "title": "Zapp360 Appoints New Leadership Following Rapid Growth in 2017 as a Local SaaS Advertising Disruptor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-25T16:35:00.000+02:00", "replies_count": 0, "uuid": "000c0150f279dc9f255091973635fa3ce43f0851"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-zapp360-appoints-new-leadership-following-rapid-growth-in-2017-as-a-local-saas-advertising-disruptor.html", "ord_in_thread": 0, "title": "Zapp360 Appoints New Leadership Following Rapid Growth in 2017 as a Local SaaS Advertising Disruptor", "locations": [], "entities": {"persons": [{"name": "rosie o'meara", "sentiment": "negative"}, {"name": "o'meara", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "verve mobile", "sentiment": "none"}], "organizations": [{"name": "itn digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 25, 2018 /PRNewswire/ -- Zapp360 has named Rosie O'Meara as Chief Executive Officer, elevating her from her previous role as COO. Zapp360, the leading force in local mobile advertising solutions, continues to expand its industry leading SaaS Platform.\nMrs. O'Meara is a digital media visionary, guiding advertisers and publishers to adopt and implement new technologies to drive more revenue from local markets. Having started her career at ITN Digital and Verve Mobile, she joined Zapp360 in 2013, leading their business development initiative. She has been instrumental in growing the AdMessenger platform since its origin through its reseller partnerships. Her leadership during Zapp360's evolution and growth makes her uniquely qualified to assume this vital role.\n\"Zapp360 is working everyday to make local advertising more effective and powerful for all involved,\" said O'Meara. \"It's that mission that I am committed to and passionate about. I am fortunate to be part of the Zapp360 organization that has such a profound impact on the local advertising space.\"\nAn additional appointment is Nicole Benvenuti as Zapp360's Chief Financial Officer, elevated from her previous role as Controller. Ms. Benvenuti joined in early 2017 and has contributed greatly to the financial and organizational structure of the company during a period of rapid growth. Together they will now lead Zapp360's strategic and operational mission.\n\"As co-founders, Jamie Estrin and I are pleased to have the opportunity to work with such competent talent within our growing organization,\" said Jerome FitzGibbons. He adds, \"Now is the time, within our company and our industry, to acknowledge and promote leaders that demonstrate the knowledge, tireless work, and commitment to grow Zapp360 to the next level. We look forward to continued success under this leadership.\"\nAbout Zapp360\nFounded in 2013, Zapp360 is a technology company that has developed a proprietary SaaS solution for local advertisers and sellers. Zapp360's AdMessenger is a proven solution for local advertisers to effectively engage with consumers on their mobile devices and drive traffic to their events, stores and services. We have developed proprietary algorithms, processes, distribution, ad formats and attribution methods that make us the market leader in mobile ad messaging.\nMedia Contact:\nNicole Benvenuti\nnicole@zapp360.com\n(516) 847-4806\nwww.zapp360.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/zapp360-appoints-new-leadership-following-rapid-growth-in-2017-as-a-local-saas-advertising-disruptor-300587759.html\nSOURCE Zapp360", "external_links": ["http://www.zapp360.com/", "http://www.prnewswire.com/news-releases/zapp360-appoints-new-leadership-following-rapid-growth-in-2017-as-a-local-saas-advertising-disruptor-300587759.html"], "published": "2018-01-25T16:35:00.000+02:00", "crawled": "2018-01-25T18:14:18.014+02:00", "highlightTitle": ""}