{"organizations": [], "uuid": "1f633a1153c8ce5416992474ab342977cc97ecc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220904782&w=1200&r=LYNXMPEE091CT", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-nuclear-trump-sanctions/trump-reluctant-to-waive-iran-sanctions-eyes-more-curbs-on-businesses-official-idUSKBN1EZ2H9", "country": "US", "domain_rank": 408, "title": "Trump reluctant to waive Iran sanctions, eyes more curbs on businesses: official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:47:00.000+02:00", "replies_count": 0, "uuid": "1f633a1153c8ce5416992474ab342977cc97ecc0"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear-trump-sanctions/trump-reluctant-to-waive-iran-sanctions-eyes-more-curbs-on-businesses-official-idUSKBN1EZ2H9", "ord_in_thread": 0, "title": "Trump reluctant to waive Iran sanctions, eyes more curbs on businesses: official", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jonathan oatis", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Donald Trump is being urged by some top advisers not to bring back U.S. economic sanctions on Iran this week, a move by the president that would effectively end a 2015 deal to limit Tehran’s nuclear ambitions.\nA senior administration official told Reuters on Wednesday that Trump’s top advisers were recommending that he not reimpose sanctions on Iran that were lifted under the agreement between Iran, the United States and other world powers.\nBut Trump, who has previously vowed to scrap the nuclear pact, is privately expressing reluctance to heed the advisers, the official said.\nThe U.S. Congress requires the president to decide periodically whether to certify Iran’s compliance with the deal and issue a waiver to allow U.S sanctions on Iran to remain suspended. The next deadline is Friday.\nTrump will seek to make a final decision on the sanctions during a meeting with national security aides on Thursday, a senior administration official told Reuters.\nIf Trump did waive the sanctions, the official said, the administration would nevertheless impose new, targeted measure on Iranian businesses and people.\nAnother U.S. official said Trump was expected by some officials to renew the sanctions waivers but stressed that no final decision had been made.\nTrump has gnashed his teeth at having to waive the sanctions again, believing his predecessor, Democratic President Barack Obama, negotiated a bad deal for the United States in agreeing to the accord, known as the Joint Comprehensive Plan of Action (JCPOA).\nHailed by Obama as key to stopping Iran from building a nuclear bomb, the deal lifted economic sanctions in exchange for Tehran limiting its nuclear ambitions. It was also signed by China, France, Russia, Britain, Germany and the European Union.\nIran says its nuclear program is only for peaceful purposes. It has said it will stick to the accord as long as the other signatories respect it, but will “shred” the deal if Washington pulls out.\nTrump in October chose not to certify that Tehran is complying with the deal and warned he might ultimately terminate it. He accused Iran of “not living up to the spirit” of the nuclear agreement even though the International Atomic Energy Agency says Tehran is in fact in compliance.\nThe first official said a decision not to waive the sanctions would leave the United States in violation of the agreement.\n“You either waive the sanctions or you don’t and if you don’t you’re in breach of the JCPOA,” the official said.\nTrump and his top advisers have been negotiating with U.S. lawmakers on Capitol Hill to try to change sanctions legislation so that he does not face a deadline on whether to recertify Iranian compliance with the nuclear deal every 90 days.\nSenate Foreign Relations Committee Chairman Bob Corker has been working on amending a U.S. law to include “trigger points” that if crossed by Iran would automatically bring back U.S. sanctions.\nThe trigger points would address strengthening nuclear inspections, Iran’s ballistic missile program and eliminate the deal’s “sunset clauses” under which some of the restrictions on Iran’s nuclear program expire over time.\nAdditional reporting by Arshad Mohammed and Jeff Mason; Editing by Lisa Shumaker and Alistair Bell\n ", "external_links": [], "published": "2018-01-10T20:47:00.000+02:00", "crawled": "2018-01-10T20:51:57.011+02:00", "highlightTitle": ""}