{"organizations": [], "uuid": "9fa37022dfb636ef6ca21bc070e3d7aab5db8cc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC947_316Ll_TOP_20180123060342.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/oil-boosted-by-imf-growth-expectations-1516705809", "country": "US", "domain_rank": 387, "title": "Oil Boosted by IMF Growth Expectations", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.079, "site_type": "news", "published": "2018-01-23T17:28:00.000+02:00", "replies_count": 0, "uuid": "9fa37022dfb636ef6ca21bc070e3d7aab5db8cc0"}, "author": "wsjcom", "url": "https://www.wsj.com/articles/oil-boosted-by-imf-growth-expectations-1516705809", "ord_in_thread": 0, "title": "Oil Boosted by IMF Growth Expectations", "locations": [], "entities": {"persons": [{"name": "donald morton", "sentiment": "none"}, {"name": "morton", "sentiment": "none"}, {"name": "herbert j. sims", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "new york mercantile exchange", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Oil prices were buoyed Tuesday by hopes that the global economy will keep humming, boosting demand for oil in a market that has been growing steadily tighter.\nU.S. crude futures recently rose 53 cents, or 0.83%, to $64.10 a barrel on the New York Mercantile Exchange. Brent, the global benchmark , rose 61 cents, or 0.88%, to $69.64 a barrel on ICE Futures Europe.\n“Everything is just playing the bull song,” said Donald Morton, senior vice president at Herbert J. Sims, who oversees an energy trading desk. Efforts by the Organization of the Petroleum Exporting Countries to restrain production have helped work off a supply glut, and the group is talking about extending its cooperation beyond this year. Speculators have amassed a record net bullish position in crude futures, helping bolster the market.\n“Every speculator and his brother continues to want to buy, buy, buy,” Mr. Morton said.\nAnd global economy looks set to continue surging this year, continuing a trend from 2017 when countries around the world began to grow in sync. Oil’s move higher Tuesday came after the International Monetary Fund raised its forecasts for global economic growth on Monday, which could extend last year’s greater-than-expected increase in oil demand for another year.\nThe global economy should grow by 3.9% a year in 2018 and 2019, up 0.2% from a previous estimate—driven in large part by the recently approved U.S. tax-code changes , the IMF said Monday.\n“It is not a far-fetched thought to expect global oil demand and oil-demand growth to follow suit shortly,” Tamas Varga, an analyst at brokerage PVM Oil Associates Ltd., said in response to the IMF estimates.\nA Permian Basin oil rig in Andrews County, Texas. Photo: ann saphir/Reuters Crude prices also found support from Vice President Mike Pence’s speech to Israel’s Knesset Monday, during which he said the U.S. would pull out of the 2015 international agreement to curb Iran’s nuclear program without significant changes to the accord.\nIf the U.S. were to exit from the deal, it would likely result in the re-imposition of economic sanctions on Iran that would limit its oil exports and reduce global supply, analysts said.\nOther bullish factors included an expected tenth-consecutive weekly drawdown in U.S. stockpiles last week when the U.S. Energy Information Administration releases data Wednesday, as well as signals over the weekend from Saudi Arabia that OPEC could extend its production cuts beyond 2018, according to Ole Hansen, head of commodity strategy at Saxo Bank.\n“It’s probably a mix of the whole lot” of factors, Mr. Hansen said. But he cautioned that prices were unlikely to rise much higher, as the market “settles into a range.”\nBut some say there are risks on the horizon. Bullish positioning can become a threat, if some trigger sends investors rushing to sell at the same time. Barclays analysts said in a research note Tuesday that some of the factors that pushed oil higher may fizzle out.\n“The market is dangerously focused on newly published backwards-looking data and, in our view, is not paying attention to the stockbuilds that are likely to emerge later this year and in 2019,” they wrote.\nPrices retreated at the end of last week after the International Energy Agency said it expected U.S. crude production to rise to over 10 million barrels a day this year, surpassing Saudi Arabia’s output and rivaling that of Russia.\nGasoline futures traded 0.99% to $1.8987 a gallon. Diesel futures rose 0.53% to $2.0678 a gallon.\nWrite to Alison Sider at alison.sider@wsj.com and Christopher Alessi at christopher.alessi@wsj.com", "external_links": [], "published": "2018-01-23T17:28:00.000+02:00", "crawled": "2018-01-23T19:26:46.002+02:00", "highlightTitle": ""}