{"organizations": [], "uuid": "7197c0d02b5bde67cd6798cc8b1065dca69508fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-philippines-extends-losses-thailand-posts-best-mth-in-1-1-2-yrs-idUSL4N1PQ44Y", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Philippines extends losses; Thailand posts best mth in 1-1/2 yrs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:31:00.000+02:00", "replies_count": 0, "uuid": "7197c0d02b5bde67cd6798cc8b1065dca69508fa"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-philippines-extends-losses-thailand-posts-best-mth-in-1-1-2-yrs-idUSL4N1PQ44Y", "ord_in_thread": 0, "title": "SE Asia Stocks-Philippines extends losses; Thailand posts best mth in 1-1/2 yrs", "locations": [], "entities": {"persons": [{"name": "karthika suresh namboothiri jan", "sentiment": "none"}, {"name": "lexter azurin", "sentiment": "none"}], "locations": [{"name": "asia stocks-philippines", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "philippin", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "ab capital securities", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:34 AM / in 36 minutes SE Asia Stocks-Philippines extends losses; Thailand posts best mth in 1-1/2 yrs Reuters Staff 4 Min Read * Philippines sheds 1.6 pct, retreating further from record * Asian shares ex-Japan on course for best month since March 2016 * Vietnam marks fifth consecutive monthly gain By Karthika Suresh Namboothiri Jan 31 (Reuters) - Philippine shares extended losses to a second session on Wednesday, pulling further away from an all-time high hit earlier this week, while Thailand ended steady, marking its best month in 1-1/2 years. Asian stocks steadied after sliding on rising global bond yields, with MSCI's broadest index of Asia-Pacific shares outside Japan on course for a 6.6 percent monthly gain, its biggest since March 2016. However, the U.S. Federal Reserve's monetary policy statement due later in the day kept investors on guard. \"Bond yields in the U.S. are rising, so there is a shift in funds from emerging markets back to the U.S,\" said Lexter Azurin from AB Capital Securities. Foreign Institutional Investor (FII) net outflows for Philippines was $39.4 million on Tuesday, while Indonesia recorded $88.9 million net outflows. Thailand's net outflows stood at $81 million in the previous session. Philippine shares ended 1.6 percent lower, after the previous session's 1.6 percent drop, as industrials fell, with SM Investment Corp shedding 6 percent. The index, however, climbed 2.4 percent in January, its second straight monthly gain. Thai shares ended flat, but rose 4.2 percent this month, its best since July 2016. Energy stocks PTT Pcl and PTT Exploration and Production PCL gained 1.6 percent each after Royal Dutch Shell said it would sell its Bongkot gas field stake to PTT Exploration & Production for $750 million before tax. Meanwhile, data showed Thai private consumption contracted in December from the previous month while investment rose slightly, implying that a recovery in Southeast Asia's second-largest economy is still patchy. Indonesian shares firmed 0.5 percent, bringing the monthly gain to 3.9 percent after December's 6.8 percent surge. Lender PT Bank Pan Indonesia climbed to a record close, while Telekom Indonesia finished 2.3 percent higher. The index of the country's 45 most liquid stocks ended 0.2 percent higher. Singapore shares closed 0.4 percent lower, with heavyweight Keppel Corp shedding 1.1 percent. The index, however, gained 3.9 percent this month after a 0.9 percent decline in December. Vietnam shares finished flat, marking a fifth consecutive monthly gain, with Petrovietnam Gas Joint Stock rising to a three-year closing high. Malaysia was closed for a public holiday. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change on the day Market Current Previous close Pct Move Singapore 3533.99 3548.74 -0.42 Bangkok 1826.86 1826.61 0.01 Manila 8764.01 8910.48 -1.64 Jakarta 6605.631 6575.492 0.46 Ho Chi Minh 1110.36 1110.56 -0.02 Change on year Market Current End 2017 Pct Move Singapore 3533.99 3402.92 3.85 Bangkok 1826.86 1753.71 4.17 Manila 8764.01 8558.42 2.40 Jakarta 6605.631 6355.654 3.93 Ho Chi Minh 1110.36 984.24 12.81 (Reporting by Karthika Suresh Namboothiri; Additional reporting by Gaurav S. Dogra; Editing by Amrutha Gayathri)", "external_links": [], "published": "2018-01-31T12:31:00.000+02:00", "crawled": "2018-01-31T13:05:32.023+02:00", "highlightTitle": ""}