{"organizations": [], "uuid": "3c4738c275002f456fa76aa9046dcb3dc6088c95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928245-Tara_AI_CTO_Syed_Ahmed_CEO_Iba_Masood.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/tara-ai-raised-3-million-to-match-companies-with-top-freelance-coders.html", "country": "US", "domain_rank": 767, "title": "Tara AI raised $3 million to match companies with top freelance coders", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.608, "site_type": "news", "published": "2018-01-04T18:29:00.000+02:00", "replies_count": 0, "uuid": "3c4738c275002f456fa76aa9046dcb3dc6088c95"}, "author": "Lora Kolodny", "url": "https://www.cnbc.com/2018/01/04/tara-ai-raised-3-million-to-match-companies-with-top-freelance-coders.html", "ord_in_thread": 0, "title": "Tara AI raised $3 million to match companies with top freelance coders", "locations": [], "entities": {"persons": [{"name": "iba masood", "sentiment": "negative"}, {"name": "syed ahmed", "sentiment": "negative"}, {"name": "tara", "sentiment": "negative"}, {"name": "forrester", "sentiment": "none"}, {"name": "tara intelligence", "sentiment": "none"}], "locations": [{"name": "github", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "shares tara intelligence", "sentiment": "negative"}, {"name": "cto", "sentiment": "negative"}, {"name": "cisco", "sentiment": "none"}, {"name": "orange telecomm", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hiring full-time programmers remains a competitive and lengthy process for businesses. That's one reason demand for freelancers and consultants is rising. Forrester predicts that spending on outsourced software help will accelerate by 6 percent in 2018.\nTo find the best possible contractors for the job, large firms, including Cisco , Ford and Orange Telecom, are using artificial intelligence from a San Jose start-up called Tara Intelligence.\nTara AI matches projects with freelance programmers who have the exact skills required to complete them. To do this, the start-up developed a \"scraping engine\" that constantly scours the open web, figuring out who worked on code that resembles a project that a business needs to get done.\nAccording to Tara AI CEO and co-founder Iba Masood: \"Developers give us access to their Github. We see projects similar in nature to what you are trying to build. And then we connect you to the right and available talent.\"\nTara AI's software also helps businesses automatically scope out and manage projects with freelancers, monitoring the pace and quality of their work, and making sure contractors are paid on-time for their code commits, for example.\nDevelopers who score work via Tara AI are paid flat rates, which are set automatically and correspond with a project's level of difficulty. Whether they're men, women, retirees or twenty-somethings with a fresh undergraduate degree, developers get paid the same wages for the same work.\n\"Some people are better at negotiating,\" Masood said. \"But we think developers should be paid based on their actual abilities and the work they deliver.\"\nTara AI faces competition from large tech consultancies like Tata or Insight Global, and freelancer and developer marketplaces online like Upwork, Codementor and Gigster.\nMasood says her company has just raised $3 million in seed funding to make its platform the go-to resource for businesses in need of contractors with specialized programming skills, especially in data analytics, machine learning and mobile.\nInvestors in Tara AI include: Y Combinator, Moment Ventures, GSV, Lattice VC and Skype co-founder Jaan Tallinn, among others.\nThe new funding will help Tara AI grow from about a dozen full-time employees today to 30 or more in the next year, and to establish a new office in Buffalo, New York. The company is also developing a set of bug prediction algorithms that can augment the skills of programmers, and help them cut down the time it takes to finalize their code.", "external_links": [], "published": "2018-01-04T18:29:00.000+02:00", "crawled": "2018-01-04T18:29:35.003+02:00", "highlightTitle": ""}