{"organizations": [], "uuid": "3db8983348f11748c450304c502678bf01a62167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-seres-therapeutics-announces-appointment-of-eric-d-shaff-to-additional-role-of-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Seres Therapeutics Announces Appointment of Eric D. Shaff to Additional Role of Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:01:00.000+02:00", "replies_count": 0, "uuid": "3db8983348f11748c450304c502678bf01a62167"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-seres-therapeutics-announces-appointment-of-eric-d-shaff-to-additional-role-of-chief-operating-officer.html", "ord_in_thread": 0, "title": "Seres Therapeutics Announces Appointment of Eric D. Shaff to Additional Role of Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "eric d. shaff", "sentiment": "negative"}, {"name": "eric", "sentiment": "none"}, {"name": "roger j. pomerantz", "sentiment": "none"}, {"name": "shaff", "sentiment": "none"}, {"name": "seres", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "seres therapeutics", "sentiment": "negative"}, {"name": "seres therapeutics, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Seres Therapeutics, Inc. , (NASDAQ:MCRB) today announced the appointment of Eric D. Shaff to the additional role of Chief Operating Officer. Mr. Shaff has been Executive Vice President and Chief Financial Officer since joining the Company in November 2014, and he will continue to retain both positions.\nRoger J. Pomerantz, M.D., President, CEO and Chairman of Seres, commented: “Eric has made outstanding contributions to many aspects of the Company. In addition to effectively leading Seres’ finance team, Eric has made key contributions in business development, portfolio strategy, investor relations and general company operations. During this period, Seres’ microbiome therapeutics pipeline has substantially matured, and now includes the SER-109 Phase 3 program for recurrent C. difficile infection, SER-287 for ulcerative colitis, and SER-262 for primary C. difficile infection, as well as several preclinical stage programs, including SER-401 to enhance immuno-oncology checkpoint inhibitor therapy. As COO, Eric will assist me in leading Seres’ microbiome pipeline candidates toward further late stage development and commercialization.”\n“Seres is the leader in the development of microbiome therapeutics, an entirely new treatment modality with potential to transform many areas of medicine, and I am delighted to support Seres’ efforts to bring innovative therapies to patients in need,” said Eric Shaff, Executive Vice President, Chief Operating Officer and Chief Financial Officer.\nMr. Shaff has served as Seres’ Chief Financial Officer, Executive Vice President and Treasurer since November 2014. Mr. Shaff also serves on the Board of Directors for Sigilon Therapeutics and has extensive experience in the biotechnology field, having worked at Momenta Pharmaceuticals and Genzyme Corporation, where he was Vice President of Finance for the Personalized Genetic Health division. Mr. Shaff received his B.A. from the University of Pennsylvania and his MBA from Cornell University.\nAbout Seres Therapeutics\nSeres Therapeutics, Inc., is a leading microbiome therapeutics platform company developing a novel class of biological drugs that are designed to treat disease by restoring the function of a dysbiotic microbiome, where the natural state of bacterial diversity and function is imbalanced. Seres’ lead program, SER-109, has obtained Breakthrough Therapy and Orphan Drug designations from the U.S. Food and Drug Administration and is in Phase 3 development for multiply recurrent C. difficile infection. Seres’ clinical candidate SER-287 has successfully completed a Phase 1b study in patients with mild-to-moderate Ulcerative Colitis and has obtained Orphan Drug designation for pediatric Ulcerative Colitis. Seres is also developing SER-262, the first ever synthetic microbiome therapeutic candidate, in a Phase 1b study in patients with primary C. difficile infection and is developing SER-401 to enhance the efficacy of checkpoint inhibitors in patients with certain tumors.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005135/en/\nIR or PR Contact\nSeres Therapeutics\nCarlo Tanzi, Ph.D., 617-203-3467\nHead of Investor Relations and Corporate Communications\nctanzi@serestherapeutics.com\nSource: Seres Therapeutics, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180131005135/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.serestherapeutics.com%2F&esheet=51751114&newsitemid=20180131005135&lan=en-US&anchor=Seres+Therapeutics%2C+Inc.&index=1&md5=95d13c9e4684f71993d2e84d023f1dcb"], "published": "2018-01-31T15:01:00.000+02:00", "crawled": "2018-01-31T17:13:22.039+02:00", "highlightTitle": ""}