{"organizations": [], "uuid": "dfc94927f5e4eb5c8d286d9b8c44432fad7482b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-semiconductor-stocks-research-reports-released-on-macom-technology-solutions-maxim-integrated-products-nxp-semiconductors-and.html", "country": "US", "domain_rank": 767, "title": "Semiconductor Stocks' Research Reports Released on MACOM Technology Solutions, Maxim Integrated Products, NXP Semiconductors, and Vishay Intertechnology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-23T14:45:00.000+02:00", "replies_count": 0, "uuid": "dfc94927f5e4eb5c8d286d9b8c44432fad7482b9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-semiconductor-stocks-research-reports-released-on-macom-technology-solutions-maxim-integrated-products-nxp-semiconductors-and.html", "ord_in_thread": 0, "title": "Semiconductor Stocks' Research Reports Released on MACOM Technology Solutions, Maxim Integrated Products, NXP Semiconductors, and Vishay Intertechnology", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}], "organizations": [{"name": "macom technology solutions", "sentiment": "neutral"}, {"name": "nxp semiconductors", "sentiment": "neutral"}, {"name": "maxim integrated products", "sentiment": "neutral"}, {"name": "vishay intertechnology", "sentiment": "neutral"}, {"name": "semiconductor broad line", "sentiment": "none"}, {"name": "macom technology solutions holdings lowell", "sentiment": "none"}, {"name": "maxim integrated products inc.", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "nxp semiconductors n.v.", "sentiment": "none"}, {"name": "mtsi", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "mxim", "sentiment": "none"}, {"name": "vishay intertechnology inc.", "sentiment": "none"}, {"name": "taipei times", "sentiment": "none"}, {"name": "macom technology solutions holdings inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 23, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on MTSI, MXIM, NXPI, and VSH which can be accessed for free by signing up to www.wallstequities.com/registration . This morning, WallStEquities.com monitors four Semiconductor Broad Line stocks, particularly, MACOM Technology Solutions Holdings Inc. (NASDAQ: MTSI), Maxim Integrated Products Inc. (NASDAQ: MXIM), NXP Semiconductors N.V. (NASDAQ: NXPI), and Vishay Intertechnology Inc. (NYSE: VSH). Taipei Times reported that the global Semiconductor industry will likely see its revenue increase by 8% this year on the back of increasing shipments of memory chips, according to statistics released by trade group SEMI on January 03 rd , 2017. All you have to do is sign up today for this free limited time offer by clicking the link below. www.wallstequities.com/registration\nMACOM Technology Solutions Holdings\nLowell, Massachusetts headquartered MACOM Technology Solutions Holdings Inc.'s stock finished Monday's session 1.88% lower at $32.83 with a total trading volume of 665,106 shares. The stock is trading below their 50-day moving average by 3.05%. Shares of the Company, which together with its subsidiaries, designs and manufactures analog radio frequency, microwave, millimeterwave, and photonic semiconductor solutions in the US, Asia/Pacific, and internationally, have a Relative Strength Index (RSI) of 41.22.\nOn January 05 th , 2018, research firm DA Davidson upgraded the Company's stock rating from 'Neutral' to 'Buy' while revising its previous target price from $32 a share to $43 a share.\nOn January 09 th , 2018, MACOM Technology announced that it will release Q1 FY18 financial results on February 06 th , 2018, after the market close. Following the press release, John Croteau, President and CEO; and Bob McMullan, Senior Vice President and CFO, will host a live audio webcast and conference call at 5:00 p.m. ET. Get the full research report on MTSI for free by clicking below at: www.wallstequities.com/registration/?symbol=MTSI\nMaxim Integrated Products\nShares in San Jose, California headquartered Maxim Integrated Products Inc. ended at $57.39, up 1.43% from the last trading session. The stock recorded a trading volume of 2.23 million shares, which was above its three months average volume of 1.83 million shares. The Company's shares have gained 7.94% in the last month, 14.57% in the previous three months, and 38.66% over the past year. The stock is trading 7.66% above its 50-day moving average and 18.64% above its 200-day moving average. Moreover, shares of the Company, which designs, develops, manufactures, and markets a range of linear and mixed-signal integrated circuits in the US, China, rest of Asia, Europe, and internationally, have an RSI of 69.40.\nOn January 02 nd , 2018, Maxim Integrated Products announced that it will release its Q2 FY18 results after market close on January 25 th , 2018. A conference call and live webcast will follow at 2:00 p.m. PT, which can be accessed under the investor page of the Company's website.\nOn January 18 th , 2018, research firm Stifel reiterated its 'Buy' rating on the Company's stock with an increase of the target price from $57 a share to $61 a share. Gain free access to the research report on MXIM at: www.wallstequities.com/registration/?symbol=MXIM\nNXP Semiconductors\nEindhoven, the Netherlands headquartered NXP Semiconductors N.V.'s stock ended yesterday's session 0.52% higher at $121.08 with a total trading volume of 2.03 million shares. The Company's shares have advanced 3.98% in the past month, 4.84% over the previous three months, and 23.80% over the past year. The stock is trading 4.03% and 8.16% above its 50-day and 200-day moving averages, respectively. Additionally, shares of NXP Semiconductors have an RSI of 81.62.\nOn January 19 th , 2018, NXP Semiconductors announced that it will release its Q4 and full-year 2017 financial results on February 07 th , 2018, EDT after the close of extended trading on the NASDAQ Global Select Market. The Company will not hold an earnings call nor provide forward guidance for Q1 2018, due to its pending acquisition by Qualcomm. Signing up today on Wall St. Equities will give you access to the latest report on NXPI at: www.wallstequities.com/registration/?symbol=NXPI\nVishay Intertechnology\nOn Monday, shares in Malvern, Pennsylvania-based Vishay Intertechnology Inc. recorded a trading volume of 1.21 million shares. The stock finished 2.73% lower at $23.20. The Company's shares have advanced 7.91% in the last month, 9.69% in the previous three months, and 40.18% over the past year. The stock is trading above its 50-day and 200-day moving averages by 7.12% and 24.04%, respectively. Furthermore, shares of Vishay Intertechnology, which manufactures and supplies discrete semiconductors and passive components in the US, Europe, and Asia, have an RSI of 61.39.\nOn January 11 th , 2018, Vishay Intertechnology announced that it will release its results for Q4 FY17 and year ended December 31 st , 2017 on February 06 th , 2018 before the NYSE opens. A conference call to discuss the results is scheduled at 9:00 a.m. ET that same day. Register now for today's free coverage on VSH at: www.wallstequities.com/registration/?symbol=VSH\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\nView original content: http://www.prnewswire.com/news-releases/semiconductor-stocks-research-reports-released-on-macom-technology-solutions-maxim-integrated-products-nxp-semiconductors-and-vishay-intertechnology-300586565.html\nSOURCE Wall St. Equities", "external_links": ["https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=MTSI", "http://www.prnewswire.com/news-releases/semiconductor-stocks-research-reports-released-on-macom-technology-solutions-maxim-integrated-products-nxp-semiconductors-and-vishay-intertechnology-300586565.html", "http://www.wallstequities.com/registration/?symbol=NXPI", "http://www.wallstequities.com/registration/?symbol=VSH", "http://www.wallstequities.com/registration/?symbol=MXIM", "http://www.wallstequities.com/registration"], "published": "2018-01-23T14:45:00.000+02:00", "crawled": "2018-01-23T14:15:55.019+02:00", "highlightTitle": ""}