{"organizations": [], "uuid": "12b177bdcd287207a349a9dda795597c5e55d06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-tantech-acquires-interest-in-a-marble-mining-operation.html", "country": "US", "domain_rank": 767, "title": "Tantech Acquires Interest in a Marble Mining Operation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-11T01:00:00.000+02:00", "replies_count": 0, "uuid": "12b177bdcd287207a349a9dda795597c5e55d06f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-tantech-acquires-interest-in-a-marble-mining-operation.html", "ord_in_thread": 0, "title": "Tantech Acquires Interest in a Marble Mining Operation", "locations": [], "entities": {"persons": [{"name": "libo haokun", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai shicai", "sentiment": "none"}, {"name": "lishui xincai", "sentiment": "none"}, {"name": "lishui xincai", "sentiment": "none"}, {"name": "guizhou", "sentiment": "none"}], "organizations": [{"name": "tantech acquires interest", "sentiment": "negative"}, {"name": "tantech holdings ltd.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "shanghai shicai", "sentiment": "none"}, {"name": "libo haokun stone co., ltd.", "sentiment": "none"}, {"name": "liaoning nuclear geological survey institute", "sentiment": "none"}, {"name": "shanghai shicai minerals co., ltd.", "sentiment": "none"}, {"name": "lishui xincai industrial co., ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LISHUI, China, Jan. 10, 2018 /PRNewswire/ -- Tantech Holdings Ltd. (NASDAQ: TANH) (\"Tantech\" or the \"Company\"), a clean energy company in China, announced today that the Company has signed a share purchase agreement (the \"Agreement\") with Shanghai Shicai Minerals Co., Ltd. (\"Shanghai Shicai\") to acquire all of the shares of Lishui Xincai Industrial Co., Ltd. (\"Lishui XinCai\"), a wholly-owned subsidiary of Shanghai Shicai, at a price of RMB120 million, or $18.2 million. Lishui Xincai owns 18% of the equity interest in Libo Haokun Stone Co., Ltd. (\"Libo Haokun\"). Following the completion of the acquisition, the Company would indirectly hold a 18% stake in Libo Haokun.\nLibo Haokun holds a government-issued permit and has the exclusive right to mine a 0.11-square-kilometer marble quarry in the southwestern province of Guizhou, China. According to a geological report issued by Liaoning Nuclear Geological Survey Institute in June 2016, the quarry had estimated reserves of approximately 4.02 million cubic meters of ores. As of the date of the valuation conducted in December 2016, the quarry had estimated reserves of approximately 3.74 million cubic meters of ores and the corresponding mining right was valued at RMB664.74 million. Libo Haokun obtained the permit to mine the quarry from the local government in September 2016. The current mining permit has a term of two years and eight months valid from September 2016 to May 2019. The mining permit may be renewed for consecutive additional three-year terms, subject to certain conditions, such as filing renewal applications, paying license fees, and the satisfaction of environmental protection standards, among other things.\nMs. Weina Qu, Legal Representative of Shanghai Shicai, said that the acquisition of the mining interest by Tantech could help Libo Haokun improve shareholder structure and increase revenue by capitalizing on Tantech's sales network.\nMr. Zhengyu Wang, Chairman and Chief Executive Officer of Tantech, commented, since its establishment, Tantech has accumulated rich customer resources and built a strong brand image in home decoration and indoor air purification. With China's growing economy and rising household income, marble has become a favored choice for commercial construction and home decoration uses because of its endurance and environmentally friendly fabrication process. Marble has been widely used in iconic landmarks in China, such as the Great Hall of the People, as well as major urban construction projects, such as hospitals, premium hotels and buildings, airports and subways. As Tantech is transitioning its business towards the development and manufacturing of diversified sustainable energy and environmentally friendly products, the investment is aligned with its commitment to contributing to a greener world.\nPursuant to the Agreement, Tantech agrees to acquire all issued and outstanding common shares of Lishui Xincai for a total consideration of RMB120 million in cash to be paid in two installments. The first installment of RMB25 million will be paid within five business days following the execution of the Agreement. The second and final installment of RMB95 million will be paid within thirty days after the signing of the Agreement. Shanghai Shicai agrees to complete the registration process with the industrial and commerce administration of the local government before January 31, 2018, for transfer of the share ownership of Lishui Xincai to Tantech. Tantech will be legally recognized as the shareholder of Lishui Xincai upon the completion of the share ownership transfer registration.\nThe acquisition will be funded from Tantech's existing cash resources and cash to be received on its accounts receivable.\nAbout Tantech Holdings Ltd.\nEstablished in 2001 and headquartered in Lishui City, Zhejiang Province, China, Tantech Holdings Ltd., together with its subsidiaries, develops and manufactures bamboo-based charcoal products, including a variety of branded consumer products and electric double-layer capacitor (\"EDLC\") carbon products for industrial energy applications. The Company aims to transform itself from a bamboo-based charcoal products producer to a vertically integrated company with a focus on diversified sustainable energy products including new energy vehicles. As part of the transition, the Company is in the process of divesting its EDLC carbon business. For more information please visit: http://www.tantechholdings.com .\nAbout Suzhou E Motors Co., Ltd.\nEstablished in April 2011 Suzhou E Motors Co., Ltd. (\"Suzhou E Motors\") is an innovative leader in the design, manufacture and distribution of electric vehicles (\"EVs\"). With outstanding quality and reliable battery production, our system enables to effectively integrate renewable and conventional energy sources across all our product lines. Suzhou E Motors offers a wide range of EVs, including urban sanitary vehicles, electric logistics vehicles and mini tourist buses with current annual capacity of approximately 5,000 EVs. For more information please visit: http://www.emotorsbus.com .\nForward-Looking Statements\nThis news release contains forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements that are other than statements of historical facts. These statements are subject to uncertainties and risks including, but not limited to, product and service demand and acceptance, changes in technology, economic conditions, the impact of competition and pricing, government regulations, and other risks contained in reports filed by the company with the Securities and Exchange Commission. All such forward-looking statements, whether written or oral, and whether made by or on behalf of the Company, are expressly qualified by this cautionary statement and any other cautionary statements which may accompany the forward-looking statements. In addition, the Company disclaims any obligation to update any forward-looking statements to reflect events or circumstances after the date hereof.\nFor more information please contact:\nTantech Holdings Ltd.\nMs. Ye Ren\nIR Manager\n+86-578-261-2869\nir@tantech.cn\nView original content: http://www.prnewswire.com/news-releases/tantech-acquires-interest-in-a-marble-mining-operation-300580962.html\nSOURCE Tantech Holdings Ltd.", "external_links": ["http://www.emotorsbus.com/", "http://www.tantechholdings.com/", "http://www.prnewswire.com/news-releases/tantech-acquires-interest-in-a-marble-mining-operation-300580962.html"], "published": "2018-01-11T01:00:00.000+02:00", "crawled": "2018-01-11T03:21:59.029+02:00", "highlightTitle": ""}