{"organizations": [], "uuid": "265ac2bedc54ae94243ddd35b729da61b9a5b8e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/gettyimages-509007636.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/facebook-max-schrems-privacy-cjeu/", "country": "US", "domain_rank": 1196, "title": "Facebook Both Wins and Loses Max Schrems Privacy Case at CJEU | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.49, "site_type": "news", "published": "2018-01-25T07:32:00.000+02:00", "replies_count": 0, "uuid": "265ac2bedc54ae94243ddd35b729da61b9a5b8e4"}, "author": "David Meyer", "url": "http://fortune.com/2018/01/25/facebook-max-schrems-privacy-cjeu/", "ord_in_thread": 0, "title": "Facebook Both Wins and Loses Max Schrems Privacy Case at CJEU | Fortune", "locations": [], "entities": {"persons": [{"name": "david meyer", "sentiment": "negative"}, {"name": "schrems", "sentiment": "none"}, {"name": "max schrems", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "safe harbor", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "am est  facebook", "sentiment": "neutral"}, {"name": "u.s. national security agency", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer 5:32 AM EST \nFacebook has lost an important EU court case to its nemesis, the Austrian lawyer Max Schrems, who wants to be able to sue the company in his home country over privacy violations. \nHowever, Schrems was not entirely successful, failing to win the right to sue Facebook on behalf of thousands of other consumers. \nSchrems is both a Facebook user and a long-running thorn in the social network’s side—he was the one whose suit against the firm in Ireland led to the scrapping of Safe Harbor , a key EU-U.S. deal allowing for the transfer of people’s data across the Atlantic. \nBack in 2014, Schrems also tried to sue Facebook (fb) in Austria over its participation in the U.S. National Security Agency’s PRISM program, and what’s more, he tried to sue the company on behalf of 25,000 other Facebook users from around the world. \nFacebook claimed Schrems was a “professional litigant” rather than a consumer, so he had no right to sue it in Austria under that country’s law—Facebook’s European headquarters are in Ireland, so the company said he had to sue there instead. \nOn Thursday, the Court of Justice of the European Union (CJEU), the bloc’s highest court, said that Schrems was indeed able to sue Facebook as a consumer in Austria—despite his activities publishing books, giving lectures, fundraising and trying to act as an avatar for thousands of other Facebook users. \nThe point, the court said, is that Schrems has always used his Facebook profile for primarily personal reasons. \nHowever, the CJEU said he could not bring the claims of all those other people along with him into his Austrian case. That essentially crushes Schrems’s hope of making pan-EU class actions a thing. \nIn a statement, Facebook concentrated on that side of the ruling. \n“Today’s decision by the European Court of Justice supports the previous decisions of two courts that Mr. Schrems’s claims cannot proceed in Austrian courts as ‘class action’ on behalf of other consumers,” a spokesperson said, adding that Facebook now looks forward to “resolving this matter.” First quick video statement on the #CJEU judgment on the Facebook lawsuit.. 😉 pic.twitter.com/IxnFylBhlt \n— Max Schrems (@maxschrems) January 25, 2018 \nSchrems, meanwhile, said in a video reaction that he and his legal team would now be able to debate Facebook’s privacy policies with the company, including its transfer of personal data to the NSA, and its tracking of people’s online activities. \nRegarding the other side of the judgement, Schrems said the rejection of class-actions suits as a concept was not problematic for him, as he would now just bring a “model case” against Facebook, but it was an issue for other cases involving mass corporate wrongdoings. \nSchrems also has another case against Facebook, over similar issues, pending before the CJEU—though that one went via the Irish route . If he prevails in that case, Facebook may no longer be allowed to import anyone’s personal data from the EU to the U.S. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T07:32:00.000+02:00", "crawled": "2018-01-25T16:45:41.015+02:00", "highlightTitle": ""}