{"organizations": [], "uuid": "8101e94617b62fd6b51c6885e6db65905bad9bcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 53, "shares": 53, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222890181&w=1200&r=LYNXMPEE0H049", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-autoshow-detroit-peugeot/peugeot-ceo-all-psa-vehicles-will-electrified-by-2025-idUKKBN1F706J", "country": "US", "domain_rank": 408, "title": "Peugeot CEO outlines ambitious plan to re-enter U.S., go electric", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:53:00.000+02:00", "replies_count": 0, "uuid": "8101e94617b62fd6b51c6885e6db65905bad9bcc"}, "author": "", "url": "https://uk.reuters.com/article/us-autoshow-detroit-peugeot/peugeot-ceo-all-psa-vehicles-will-electrified-by-2025-idUKKBN1F706J", "ord_in_thread": 0, "title": "Peugeot CEO outlines ambitious plan to re-enter U.S., go electric", "locations": [], "entities": {"persons": [{"name": "jo", "sentiment": "negative"}, {"name": "carlos tavares", "sentiment": "none"}, {"name": "tavares", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "peugeot", "sentiment": "negative"}, {"name": "peugeot sa", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european opel", "sentiment": "none"}, {"name": "opel", "sentiment": "none"}, {"name": "automotive news world congress", "sentiment": "none"}, {"name": "psa group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 43 AM / Updated 23 minutes ago Peugeot CEO outlines ambitious plan to re-enter U.S., go electric Joseph White 4 Min Read \nDETROIT (Reuters) - Peugeot SA ( PEUP.PA ) Chief Executive Carlos Tavares said on Wednesday the French automaker is using the know-how of former Opel engineers acquired from General Motors Co ( GM.N ) to develop vehicles to re-enter the U.S. market, and said Peugeot will offer electrification as an option on all its vehicles by 2025. \nTavares used a speech at the Automotive News World Congress in Detroit, an event packed with auto industry executives, to outline an ambitious agenda for pushing his company into the front row of the industry’s technology race. He plans to use the 2017 acquisition of GM’s European Opel and Vauxhall operations as the springboard for global expansion. \nTavares said in his speech that by 2025 “the PSA Group will be 100 percent electrified,” which can mean all electric or hybrid. Tavares and a company spokesman clarified that electrification will be an option on all the automaker’s vehicles by that time. Global automakers have announced $90 billion in investments to electrify future vehicles to comply with regulations to curb carbon dioxide emissions. \nBy 2030, Tavares said, 80 percent of the automaker’s vehicles will offer the ability to pilot themselves under limited conditions, and 10 percent will be capable of autonomous driving. \nPeugeot exited the U.S. market more than 20 years ago, run out by Japanese competition and shifting customer tastes. Tavares, the former Renault-Nissan executive who took over the company in 2014, has previously outlined plans to slowly re-enter the U.S. market, starting with ride services. \nLast year, Tavares acquired GM’s European Opel operation after GM decided to divest the money-losing operation. \nTavares on Wednesday outlined a three-step process for re-establishing Peugeot in the U.S. market, the world’s second largest, and compete on GM’s home turf. \nPeugeot already is beginning to offer ride services in the United States through its Free2Move brand, using other companies’ cars. \n“Mobility…is at the heart of our strategic plan,” Tavares said. \nNext, Tavares said, will come ride services using Peugeot cars. The third step will be to sell Peugeot vehicles in the United States designed by Opel engineers who worked for GM. \nOpel engineers can “ensure the future products for this market will be fully U.S. compliant” not just from a regulatory standpoint, but also with consumer tastes, Tavares said. \nPeugeot has “people working on cars now” for the U.S. market, Tavares said. \nIn addition, Tavares said Peugeot will announce soon a deal to establish additional manufacturing capacity in Southeast Asia. He did not elaborate during a question and answer session. \nTavares also sidestepped a question from Crain Communications group publisher KC Crain about whether he would be interested in acquiring brands from Fiat Chrysler Automobiles NV. Tavares joked that Fiat Chrysler Chief Executive Sergio Marchionne should call him, but then said that he has enough on his plate “for the time being.” Reporting by Joe White; Editing by Sandra Maler and Lisa Shumaker", "external_links": [], "published": "2018-01-18T04:53:00.000+02:00", "crawled": "2018-01-18T05:30:43.002+02:00", "highlightTitle": ""}