{"organizations": [], "uuid": "77b38afc432522a2211157efd311bcb7b92c74e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-adients-q1-results-impacted-by-headwinds-in-seat-structures-mechanisms-ssm-business.html", "country": "US", "domain_rank": 767, "title": "Adient's Q1 results impacted by headwinds in Seat Structures & Mechanisms (SS&M) business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:01:00.000+02:00", "replies_count": 0, "uuid": "77b38afc432522a2211157efd311bcb7b92c74e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-adients-q1-results-impacted-by-headwinds-in-seat-structures-mechanisms-ssm-business.html", "ord_in_thread": 0, "title": "Adient's Q1 results impacted by headwinds in Seat Structures & Mechanisms (SS&M) business", "locations": [], "entities": {"persons": [{"name": "r. bruce mcdonald", "sentiment": "none"}, {"name": "jeff stafeil", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "adient", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLYMOUTH, Mich., Jan. 29, 2018 /PRNewswire/ -- Adient (NYSE: ADNT), a global leader in automotive seating, today announced first quarter earnings.\nQ1 GAAP net income and EPS diluted of $(216) million and $(2.32), respectively; Q1 adjusted-EPS diluted of $1.06 Q1 Adjusted-EBIT of $163 million (margin of 3.9%) Cash and cash equivalents of $390 million at December 31, 2017 Gross debt and net debt of $3,501 million and $3,111 million, respectively, at December 31, 2017 FY2018 outlook revised to reflect SS&M headwinds and Q1 performance\nFor complete details and to see reconciliations of non-GAAP measures to their most directly comparable GAAP measures, click here to download the full press release, or visit the events section of the Adient investor website at www.investors.adient.com/events-and-presentations/events .\nInvestor analyst conference call:\nAdient's Chairman and Chief Executive Officer, R. Bruce McDonald, and Executive Vice President and Chief Financial Officer, Jeff Stafeil, will host a conference call today at 8:30 a.m. Eastern to discuss the results. To participate by telephone, please dial 800-779-1454 (U.S.) or 312-470-7220 (international) 15 minutes prior to the start time of the call and ask to be connected to the Adient conference call. The conference passcode is ADIENT.\nAbout Adient:\nAdient is a global leader in automotive seating. With 85,000 employees operating in 238 manufacturing/assembly plants in 34 countries worldwide, we produce and deliver automotive seating for all vehicle classes and all major OEMs. From complete seating systems to individual components, our expertise spans every step of the automotive seat-making process. Our integrated, in-house skills allow us to take our products from research and design all the way to engineering and manufacturing – and into more than 50 million vehicles every year. For more information on Adient, please visit adient.com .\nCautionary Statement Regarding Forward-Looking Statements:\nAdient plc has made statements in this document that are forward-looking and, therefore, are subject to risks and uncertainties. All statements in this document other than statements of historical fact are statements that are, or could be, deemed \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In this document, statements regarding Adient's future financial position, sales, costs, earnings, cash flows, other measures of results of operations, capital expenditures or debt levels and plans, objectives, outlook, targets, guidance or goals are forward-looking statements. Words such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe,\" \"should,\" \"forecast,\" \"project\" or \"plan\" or terms of similar meaning are also generally intended to identify forward-looking statements. Adient cautions that these statements are subject to numerous important risks, uncertainties, assumptions and other factors, some of which are beyond Adient's control, that could cause Adient's actual results to differ materially from those expressed or implied by such forward-looking statements, including, among others, risks related to: the ability of Adient Aerospace to successfully implement its strategic initiatives or realize the expected benefits of the joint venture, the impact of tax reform legislation through the Tax Cuts and Jobs Act, the ability of Adient to meet debt service requirements, the ability and terms of financing, general economic and business conditions, the strength of the U.S. or other economies, automotive vehicle production levels, mix and schedules, energy and commodity prices, the availability of raw materials and component products, currency exchange rates, the ability of Adient to effectively integrate the Futuris business, and cancellation of or changes to commercial arrangements. A detailed discussion of risks related to Adient's business is included in the section entitled \"Risk Factors\" in Adient's Annual Report on Form 10-K for the fiscal year ended September 30, 2017 filed with the SEC on November 22, 2017 (\"FY17 Form 10-K\") and quarterly reports on Form 10-Q filed with the SEC, available at www.sec.gov . Potential investors and others should consider these factors in evaluating the forward-looking statements and should not place undue reliance on such statements. The forward-looking statements included in this document are made only as of the date of this document, unless otherwise specified, and, except as required by law, Adient assumes no obligation, and disclaims any obligation, to update such statements to reflect events or circumstances occurring after the date of this document.\nIn addition, this document includes certain projections provided by Adient with respect to the anticipated future performance of Adient's businesses. Such projections reflect various assumptions of Adient's management concerning the future performance of Adient's businesses, which may or may not prove to be correct. The actual results may vary from the anticipated results and such variations may be material. Adient does not undertake any obligation to update the projections to reflect events or circumstances or changes in expectations after the date of this document or to reflect the occurrence of subsequent events. No representations or warranties are made as to the accuracy or reasonableness of such assumptions or the projections based thereon.\nADNT-FN\nView original content: http://www.prnewswire.com/news-releases/adients-q1-results-impacted-by-headwinds-in-seat-structures--mechanisms-ssm-business-300589400.html\nSOURCE Adient", "external_links": ["http://investors.adient.com/events-and-presentations/events", "http://www.prnewswire.com/news-releases/adients-q1-results-impacted-by-headwinds-in-seat-structures--mechanisms-ssm-business-300589400.html", "http://investors.adient.com/~/media/Files/A/Adient-IR/documents/q1-2018-earnings-release.pdf"], "published": "2018-01-29T15:01:00.000+02:00", "crawled": "2018-01-29T16:51:38.015+02:00", "highlightTitle": ""}