{"organizations": [], "uuid": "5bc54ef39e7a0b0226f31c5d03ab8fb34cab0643", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-dtn-names-jerre-stead-and-sheryl-von-blucher-as-co-ceos.html", "country": "US", "domain_rank": 767, "title": "DTN Names Jerre Stead and Sheryl von Blucher as Co-CEOs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T15:40:00.000+02:00", "replies_count": 0, "uuid": "5bc54ef39e7a0b0226f31c5d03ab8fb34cab0643"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-dtn-names-jerre-stead-and-sheryl-von-blucher-as-co-ceos.html", "ord_in_thread": 0, "title": "DTN Names Jerre Stead and Sheryl von Blucher as Co-CEOs", "locations": [], "entities": {"persons": [{"name": "jerre stead", "sentiment": "negative"}, {"name": "sheryl von blucher", "sentiment": "negative"}, {"name": "von blucher", "sentiment": "none"}, {"name": "kip pendleton", "sentiment": "none"}, {"name": "jerre", "sentiment": "none"}, {"name": "sheryl", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "dtn", "sentiment": "negative"}, {"name": "dtn board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 25, 2018 /PRNewswire/ -- DTN, an independent source of insight and analysis, and decision-support solutions to customers worldwide in agriculture, energy, commodity and financial analytics, and weather-sensitive industries, has announced that DTN Executive Chairman Jerre Stead and DTN Board Member Sheryl von Blucher have been named co-chief executive officers of the company. They replace former CEO Kip Pendleton, who left the company for personal reasons.\n\"Sheryl and I are very excited to assume the role of co-CEOs for DTN,\" Stead said. \"Since completing the acquisition of DTN in May 2017, so much has been accomplished in transitioning ownership and establishing a vision and strategy for DTN's future, and we look forward to continuing to support DTN's progress in our expanded roles.\"\nMs. von Blucher said: \"Jerre and I look forward to working even more directly with our DTN colleagues to provide ever better solutions to our customers, and ensure the continued growth and success of the company. We will focus on the many opportunities we have to expand our efforts in empowering our customers with intelligent, actionable insights that enable their success on a daily basis.\"\nStead most recently served as chairman and CEO of IHS Markit since its formation in July 2016 through December 2017. Previously, he was executive chairman of IHS Inc., starting December 1, 2000 and served as both chairman and CEO of IHS from September 2006 until June 2013, and from June 2015 through December 2017. Besides IHS Markit and IHS, he has served as CEO and/or Chairman of seven other highly successful technology and information companies: Honeywell-Phillips Medical Electronics, Square D, AT&T Global Business Communications Systems, AT&T Global Information Solutions (NCR Corporation), NCR Japan, Legent Corporation and Ingram Micro. Mr. Stead has served on 35 corporate boards during his career and in 2017 received the B. Kenneth West Lifetime Achievement Award from the National Association of Corporate Directors. He is a graduate of the University of Iowa and the Harvard University Advanced Management Program.\nMs. von Blucher has executive leadership experience in a variety of roles in the global integrated energy, information services, and public and non-profit sectors. From 2008, Ms. von Blucher worked in private-equity portfolio management and as a partner and managing director for the JMJS Group, a private equity partnership. Ms. von Blucher currently serves on the Board of Directors of Washington Prime Group, Inc.; DTN LLC; Capital Canyon Club and Golf Development LLC; Epic Research & Diagnostics, Inc.; and on the Board of Trustees for the not-for-profits Guideposts; IWF, a museum and designated U.S. National Historic Site; and UAHT, United Against Human Trafficking. Ms. von Blucher holds a bachelor's degree from Rice University and a master's degree from Harvard University.\nAbout DTN\nDTN is the independent, trusted source of actionable insights for 600,000 customers focused on feeding, protecting and fueling the world. Customer-focused and employee-driven, DTN focuses on empowering customers worldwide with decision-support solutions in agriculture, energy, commodity and financial analytics, and weather-sensitive industries through continuous, leading-edge innovation. The company produces The Progressive Farmer magazine, the premier publication in agriculture. DTN is based in Minneapolis with offices globally.\nView original content: http://www.prnewswire.com/news-releases/dtn-names-jerre-stead-and-sheryl-von-blucher-as-co-ceos-300588160.html\nSOURCE DTN", "external_links": ["http://www.prnewswire.com/news-releases/dtn-names-jerre-stead-and-sheryl-von-blucher-as-co-ceos-300588160.html"], "published": "2018-01-25T15:40:00.000+02:00", "crawled": "2018-01-25T17:33:39.007+02:00", "highlightTitle": ""}