{"organizations": [], "uuid": "7354d4e6ffe9431be58dc44a948b5195e85d0fef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-medicine-man-technologies-presentation-now-available-for-on-demand-viewing.html", "country": "US", "domain_rank": 767, "title": "Medicine Man Technologies Presentation Now Available for On-Demand Viewing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.693, "site_type": "news", "published": "2018-01-23T16:35:00.000+02:00", "replies_count": 0, "uuid": "7354d4e6ffe9431be58dc44a948b5195e85d0fef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-medicine-man-technologies-presentation-now-available-for-on-demand-viewing.html", "ord_in_thread": 0, "title": "Medicine Man Technologies Presentation Now Available for On-Demand Viewing", "locations": [], "entities": {"persons": [{"name": "brett roper", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}], "organizations": [{"name": "medicine man technologies presentation now available for on-demand viewing company", "sentiment": "negative"}, {"name": "medicine man", "sentiment": "none"}, {"name": "medicine man technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company invites individual and institutional investors as well as advisors to log-on to VirtualInvestorConferences.com to view presentation\nDENVER, Jan. 23, 2018 /PRNewswire/ -- Medicine Man Technologies ( OTCQB: MDCL), one of the country's leading cannabis branding and consulting companies, today announced that the January 18 presentation from Brett Roper, Chief Executive Officer, is now available for on-demand viewing at VirtualInvestorConferences.com .\nLINK: https://tinyurl.com/0118postpr\nMedicine Man Technologies presentation will be available 24/7 for 90 days. Investors and advisors may download shareholder materials from the \"virtual trade booth\" for the next three weeks.\nRecent Company Highlights\nIn December 2017, Medicine Man Technologies closed a $1.54 million equity raise, allowing it to have sufficient capital to retire its remaining convertible debt at year end as well as to invest in its near-term growth initiatives In November 2017, Medicine Man reported Q3 2017 earnings, highlighted by 292% year-over-year revenue growth In October 2017, Medicine Man Technologies secured a German tender client, marking Medicine Man's first European-based medical cultivation client, and established a relationship with Orion GMP Solutions\nLearn more about the event at www.VirtualInvestorConferences.com .\nTo be added to the distribution list please email MDCL@kcsa.com with 'Medicine Man' in the subject line.\nAbout Medicine Man Technologies\nEstablished in March 2014, the Company secured its first client/licensee in April 2014. To date, the Company has provided guidance for several clients that have successfully secured licenses to operate cannabis businesses within their state. The Company currently has sixty-two active clients in California, Oregon, Colorado, Nevada, Illinois, Michigan, Arkansas, Pennsylvania, Florida, Ohio, Maryland, Massachusetts, Puerto Rico, Australia, Canada, Germany, and South Africa. We continue to focus on working with clients to 1) utilize its experience, technology, and training to help secure a license in states with newly emerging regulations, 2) deploy the Company's highly effective variable capacity constant harvest cultivation practices through its deployment of Cultivation MAX, and eliminate the liability of single grower dependence, 3) avoid the costly mistakes generally made in start-up, 4) stay engaged with an ever expanding team of licensees and partners, all focused on quality and safety that will \"share\" the ever-improving experience and knowledge of the network, and 5) continuing the expansion of its Brands Warehouse concept.\nAbout VirtualInvestorConferences.com\nSince 2010, VirtualInvestorConferences.com , created by BetterInvesting (NAIC) and PRNewswire , has been the only monthly virtual investor conference series that provides an interactive forum for presenting companies to meet directly with investors using a graphically-enhanced online platform.\nDesigned to replicate the look and feel of location-based investor conferences, Virtual Investor Conferences unites PR Newswire's leading-edge online conferencing and investor communications capabilities with BetterInvesting's extensive retail investor audience network.\nView original content with multimedia: http://www.prnewswire.com/news-releases/medicine-man-technologies-presentation-now-available-for-on-demand-viewing-300586487.html\nSOURCE Medicine Man Technologies", "external_links": ["http://www.betterinvesting.org/", "http://www.prnewswire.com/news-releases/medicine-man-technologies-presentation-now-available-for-on-demand-viewing-300586487.html", "http://www.virtualinvestorconferences.com/", "http://www.prnewswire.com/", "https://tinyurl.com/0118postpr"], "published": "2018-01-23T16:35:00.000+02:00", "crawled": "2018-01-23T17:46:39.031+02:00", "highlightTitle": ""}