{"organizations": [], "uuid": "f17574a739d5c688a494f41b6552c4b1a03b4a4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/08/dropbox1.gif", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/12/dropbox-ipo-good/", "country": "US", "domain_rank": 1196, "title": "Why It 's a Good Thing That Dropbox Is Going Public - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:45:00.000+02:00", "replies_count": 0, "uuid": "f17574a739d5c688a494f41b6552c4b1a03b4a4b"}, "author": "", "url": "http://fortune.com/2018/01/12/dropbox-ipo-good/", "ord_in_thread": 0, "title": "Why It 's a Good Thing That Dropbox Is Going Public - Fortune", "locations": [], "entities": {"persons": [{"name": "adam lashinsky", "sentiment": "negative"}, {"name": "drew houston", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "securities and exchanges commission", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why It's a Good Thing That Dropbox Is Going Public Photograph by Getty Images By Adam Lashinsky 12:47 PM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nThree cheers for patience: Dropbox is going public. \nHardly a startup anymore, the San Francisco company is 11 years old. Reports Thursday said it has filed confidentially to list its shares, a benefit the Securities and Exchanges Commission affords companies with less than $1 billion in sales. Drew Houston, Dropbox’s co-founder and CEO has said the company is on a path to achieve that level and also that it makes money—if you strip out the annoying accounting stuff that dents bottom lines. \nA Dropbox IPO would be a good thing at multiple levels. It would give employees and investors an opportunity to cash out a bit. It also would show customers of Dropbox, which offers online storage services, that Dropbox is for real. \nA public filing also would offer entrepreneurs a good case study in perseverance and a reminder that everything about a startup isn’t always up and to the right. Dropbox took several unsuccessful detours along its decade-plus existence, including an unfortunate diversion into a photo-sharing app. It also has been smacked by the most fearsome startup-killer of all, competition from titans of tech with more money than the 10 top VC firms combined. Google (googl) and Apple (aapl) are aggressively in the storage game as mere sidelights to their main businesses. \nThe great Wall Street philosopher Andy Kessler recently wrote a paean to the virtues of going public . More information is better, Kessler argued. But he also warned, sagely, that just because lots of companies go public doesn’t mean they’re all going to do well. For every Roku there’s a Snap. \nStill, the only true way for a venture-backed company, young or old, to prove it’s for real is to let public investors have their say. Soon it will be Dropbox’s turn. \n*** \nGary Shapiro, head of the Consumer Electronics Association, took umbrage to my noting Thursday that he gave a rah-rah speech about diversity while none of the CES keynotes this week were headlined by women. He says it’s wrong to focus on only the three large-company keynotes: Intel , Ford , and Huawei. In all, 242 of 900 speakers at CEA-hosted presentations were women, he said. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-12T19:45:00.000+02:00", "crawled": "2018-01-12T20:28:04.004+02:00", "highlightTitle": ""}