{"organizations": [], "uuid": "24896146af7b56c5f8d3323a7892de9d31374672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-vietnam-security-crackdown-explainer/explainer-whats-behind-vietnams-corruption-crackdown-idUSKBN1EX0U7", "country": "US", "domain_rank": 408, "title": "Explainer: What's behind Vietnam's corruption crackdown?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:27:00.000+02:00", "replies_count": 0, "uuid": "24896146af7b56c5f8d3323a7892de9d31374672"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-vietnam-security-crackdown-explainer/explainer-whats-behind-vietnams-corruption-crackdown-idUSKBN1EX0U7", "ord_in_thread": 0, "title": "Explainer: What's behind Vietnam's corruption crackdown?", "locations": [], "entities": {"persons": [{"name": "trinh xuan thanh", "sentiment": "none"}, {"name": "dinh la thang", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}, {"name": "chi minh city", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "petrovietnam", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HANOI (Reuters) - Vietnam brought 22 executives to court over losses at the state oil firm on Monday, in the most important trial of a widening crackdown on corruption. Among those being tried was the first politburo member to be arrested in decades.\nIn a separate trial in Ho Chi Minh City, a banking fraud case began with 46 defendants.\nAs well as shedding light on graft, mismanagement and nepotism within state firms at a time privatization is accelerating, the arrests show the ascendancy of a more conservative faction within the ruling Communist Party.\nHow many people are involved?\nScores have been arrested across PetroVietnam and the banking sector. Some have been tried and sentenced already. The most senior figure arrested is former PetroVietnam Chairman Dinh La Thang, among those whose trial started on Monday. Neither he nor his lawyer was available for comment. Germany has accused Vietnam of kidnapping one PetroVietnam suspect, Trinh Xuan Thanh, who was also among the 22 in court. More than 100 other officials are also under threat of prosecution or have been demoted or fired. In another case linked to the corruption crackdown, a Vietnamese tycoon was arrested last week after being sent home from Singapore.\nWhat is PetroVietnam?\nPetroVietnam is a tangled enterprise of 15 direct units, 18 subsidiaries and 46 affiliates in which it owns smaller stakes. Hundreds of millions of dollars in losses have been racked up at units ranging from banks to construction firms and power plants to textile mills.\nThe scandals at PetroVietnam are connected to the banking sector through a deal in which the oil firm lost $35 million in an investment in Ocean Bank. The lender’s former chief executive - a previous PetroVietnam chairman - was sentenced to death.\nWhat does the crackdown mean politically?\nIt shows a concerted effort to rein in large-scale corruption through which some officials had secured massive personal wealth and tarnished the ruling party’s image.\nBut it has also allowed the current Communist Party leadership to strengthen its hand under General Secretary Nguyen Phu Trong after winning out in a power struggle with former prime minister Nguyen Tan Dung last year.\nWhether or not the arrests go even higher, Trong’s supremacy is assured through a term that lasts until 2021 and the faction is better placed to maintain its dominance even beyond.\nWhat divides the different groups in the ruling party?\nAlthough the party presents a public image of unity, there are diverse views on everything from the pace and openness of reforms to Vietnam’s delicate diplomatic balancing between China, the United States and other powers.\nWhat best characterizes the current leadership is conservatism in preserving the party’s absolute authority in close alignment with the security establishment.\nIt marks a change of style from the leadership under Dung and his allies, some of whom emerged as personalities in their own right and shown signs of readiness for greater political openness.\nAlongside the corruption arrests, Vietnam has also arrested more bloggers, activists and other critics this year than in any other since a 2011 crackdown on youth activists.\nHow popular is the corruption crackdown?\nFew tears are shed in Vietnam over the arrests of former officials, but there is also scepticism over the real motives. The day-to-day corruption of low-level officials and police is still a factor of Vietnamese life.\nWhat impact has this had on PetroVietnam?\nPetroVietnam’s net profit margin in 2016 was its lowest in at least seven years at just over 7 percent from over 15 percent in 2009. The company told Reuters the oil price was the biggest factor, but it has also said failed projects, wrongdoing by officials and the investigations themselves had an impact.\nPetroVietnam’s shares are not listed on a stock exchange, but some of its units have underperformed its Thai peer PTT since 2009.\nWhat does this mean for reform and privatization?\nAlthough the crackdown points to the political strengthening of the party, the leadership has shown less sign of delaying economic reform than the previous administration.\nFacing pressure because of its budget deficit, the government has accelerated plans to sell major stakes in the most attractive assets - including the sale of a majority stake in brewery Sabeco late last year. It is also selling stakes in three units of PetroVietnam.\nSome economic and business analysts believe the fear among officials of being branded corrupt could further hold up bureaucratic decision making in state-run firms and ministries.\nEditing by Simon Cameron-Moore\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T18:27:00.000+02:00", "crawled": "2018-01-08T14:09:47.001+02:00", "highlightTitle": ""}