{"organizations": [], "uuid": "b9109a58b189833d70fe9cf5b680f5ab610ef353", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225455767&w=1200&r=LYNXMPEE0P0MN", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-concussions-fe/super-bowl-a-high-stakes-test-for-nfls-effort-to-tackle-concussions-idUSKBN1FF1B2", "country": "US", "domain_rank": 408, "title": "Super Bowl a high-stakes test for NFL's effort to tackle concussions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:11:00.000+02:00", "replies_count": 0, "uuid": "b9109a58b189833d70fe9cf5b680f5ab610ef353"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-concussions-fe/super-bowl-a-high-stakes-test-for-nfls-effort-to-tackle-concussions-idUSKBN1FF1B2", "ord_in_thread": 0, "title": "Super Bowl a high-stakes test for NFL's effort to tackle concussions", "locations": [], "entities": {"persons": [{"name": "tom savage", "sentiment": "none"}, {"name": "frank pingue", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "national football league", "sentiment": "none"}, {"name": "houston texans", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 11:11 AM / Updated 4 hours ago Super Bowl a high-stakes test for NFL's effort to tackle concussions Frank Pingue 5 Min Read \n(Reuters) - At next month’s Super Bowl, the National Football League is aiming to avoid a repeat of a December incident when fans watched Houston Texans quarterback Tom Savage return to the game just minutes after convulsing on the field from a brutal hit. \nThe NFL has changed rules ahead of the Feb. 4 championship in Minneapolis pitting the New England Patriots against the Philadelphia Eagles, requiring players who show signs of a seizure to be pulled from the game. The league has come under criticism that it tolerated injuries as part of the sport. \nAt future games, athletes who stumble to the ground when trying to stand will be examined in their team locker room, the league said last month. More neurotrauma consultants not affiliated with specific teams will be on the field and at the NFL’s command center to monitor player. \nHits to the head on the field are shown to contribute to a degenerative brain condition known as chronic traumatic encephalopathy, or CTE. The condition has been diagnosed in dead players, including Hall of Fame linebacker Junior Seau and Pro Bowl safety Dave Duerson, who both committed suicide. \n“NFL policy is very clear about what it wants. Any player that has a concussion is a ‘no go,'” said Philip Stieg, a doctor who serves as a consultant at New York Giants home games and worked the 2014 Super Bowl. “What gets decided on the sideline, as to whether it was a concussion or not, they can’t control. But their policy is crystal clear.” \nCritics contend that cases like Savage‘s, who returned to the field before doctors reviewed video that showed signs of a potential concussion, demonstrate that the highest-grossing U.S. professional sports league is not serious about concussions. \n“The veil has been lifted on the NFL concussion protocol, that it’s not the gold standard,” said Chris Nowinski, chief executive of the Concussion Legacy Foundation, a Boston-based nonprofit which aims to reduce the risk of concussions in young athletes. \n“The protocol is weak, and weak on purpose,” Nowinski - a Ph.D in behavioral neuroscience, former Harvard University football player and former pro wrestler - said in a phone interview. \nThe NFL has rejected the criticism, saying its recent tweaks to its rules on head injuries are based on science and are intended to protect the players’ safety. \n“Our protocols are not dependent on game situations or on the player’s identity,” Dr. Allen Sills, who serves as the league’s chief medical officer, said in a phone interview. “Health and safety concerns are going to trump any competitive concerns, no matter who the player is or when it is.” FILE PHOTO: Houston Texans quarterback Tom Savage (3) runs with the ball during the first quarter against the San Francisco 49ers in Houston, Texas, U.S., December 10, 2017. Mandatory Credit: Troy Taormina-USA TODAY Sports/File Photo \nAs evidence, he noted that the Patriots are still waiting to learn whether star tight end Rob Gronkowski will be allowed to play in the Super Bowl after a Jan. 21 helmet-to-helmet hit. \nDOCTORS ‘CRINGING’ \nCTE can lead to aggression and dementia, and currently can be diagnosed only by taking brain tissue from a dead subject. A January study in the scientific journal Brain found more evidence that all hits to the head, not just those that cause concussions, can contribute to CTE. \nSome of the doctors who work the sidelines of NFL games to assess potential concussions admit that the sheer force of the hits on the field make them uneasy. \n“There is a little bit of cringing, but I also understand the benefits of team sports and football in particular,” Brionn Tonkin, a doctor who serves as a neurotrauma consultant at Minnesota Vikings home games, said in a phone interview. \nA review of the Tom Savage incident by the NFL and the NFL Players Association, the athletes’ union, found the medical staff did not see slow-motion video showing Savage’s “fencing posture,” an unnatural position of the arms that is a sign of concussion, in their initial evaluation. The team’s actions were in compliance with the concussion protocol at the time, the league found. \nAn NFL review completed on Wednesday found the Carolina Panthers did not violate the concussion protocol by allowing quarterback Cam Newton to re-enter a playoff game when he seemed dazed after a hit and dropped to the ground en route to the sidelines. \nJust one team has been disciplined for violating the concussion protocol. The NFL fined the Seattle Seahawks $100,000 after an investigation determined that quarterback Russell Wilson was allowed back on the field after being hit in the jaw during a November game before a required sideline evaluation. \nThe medical researcher who discovered CTE, Bennet Omalu of the University of California at Davis, said he is skeptical that football can ever be safe for the brain. \n“Saying that you can make football safer is like telling me you can make fire safer,” said Omalu. “You cannot make football safe. It’s an inherently dangerous sport.” Reporting by Frank Pingue in Toronto; Editing by Scott Malone and Jonathan Oatis", "external_links": [], "published": "2018-01-26T13:11:00.000+02:00", "crawled": "2018-01-26T13:26:30.002+02:00", "highlightTitle": ""}