{"organizations": [], "uuid": "4055d34f7a409ad0f633a32920d2a124f8be92fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223345299&w=1200&r=LYNXMPEE0I0UQ", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-swedenfinland/sweden-finland-to-renew-fierce-ice-hockey-rivalry-idUSKBN1F81J0", "country": "US", "domain_rank": 408, "title": "Sweden, Finland to renew fierce ice hockey rivalry", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:36:00.000+02:00", "replies_count": 0, "uuid": "4055d34f7a409ad0f633a32920d2a124f8be92fb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-swedenfinland/sweden-finland-to-renew-fierce-ice-hockey-rivalry-idUSKBN1F81J0", "ord_in_thread": 0, "title": "Sweden, Finland to renew fierce ice hockey rivalry", "locations": [], "entities": {"persons": [{"name": "loob", "sentiment": "none"}, {"name": "forsberg", "sentiment": "none"}, {"name": "peter forsberg", "sentiment": "none"}, {"name": "hakan loob", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "lillehammer", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eurosport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM (Reuters) - The rivalry between Sweden and Finland in men’s ice hockey burns with an incredible intensity, and the Nordic neighbors are set to ignite their feud once again in the group stage at the Pyeongchang Olympics.\nThe Swedes have twice won the Olympic gold medal, first in 1994 and famously beating their bitter rivals 3-2 in the 2006 final in Turin.\nNo Finnish hockey fan needs reminding that their team has never won the Olympic tournament.\n“For us Swedes, we just cannot lose to Finland - that would never work,” Sweden’s two-time Olympic champion Peter Forsberg told Reuters.\n“It’s powerful,” explains Hakan Loob, who was a team mate of Forsberg’s when Sweden won gold at Lillehammer in 1994, and the two are set to pair up again as experts for Eurosport’s hockey broadcasts in Sweden during the Games.\n“A long time ago, the Finns saw us as the big brother and felt sorry for themselves, but recently they have become very good, so now it’s a more even rivalry,” Loob said.\nFor the Finns, it is no different.\n“Of course you want to win all games, but there’s a special atmosphere every time you play Sweden,” current Finland general manager and former player Jere Lehtinen said.\n“When I played those games it was always a little more physical on the ice, to show you wanted to win. Those were special games.”\nSEMI-FINAL DEFEAT The two sides meet in the final qualifying game in group C on February 18, with the Finns determined to avenge their semi-final defeat in Sochi four years ago when they ended up with the bronze medal and the Swedes went one better by winning silver.\nThe historical roots of the Swedish-Finnish rivalry are long and deep, with Finland part of Sweden for almost 700 years until it became an autonomous part of Russia for more than a century, eventually declaring independence in 1917.\nThe two countries share a border and Swedish is still one of Finland’s official languages, but the relationship is not without its problems, and never is this more apparent than when the two sides clash on the ice.\nThe players Reuters spoke to all recall the rivalry beginning for them while they were still in the junior ranks, continuing through their international careers and even onto the rinks of North America, where most of them plied their trade.\n“There were good rivalries in the NHL against players like Forsberg and (Nicklas) Lidstrom - good, honest battles,” remembers Lehtinen, who spent 14 seasons with the Dallas Stars.\n“Forsberg was tough and he came hard at you, but in the same way he was honest, and you could go hard at him too. It was a tough rivalry.”\nThe creative force at the heart of the Swedish team, Forsberg was often given a hard time by the Finns, not least when the two countries clashed.\n“I always had to play against Saku Koivu, Teemu Selanne, Jere Lehtinen and a few other big players. Every single tournament you knew you’d have to play against them, and you knew it was going to be tough,” Forsberg said.\n“But there was something, we just had to win.”\nSHOCK VICTORY With Forsberg in the team the Swedes secured their fair share of victories but as time went on Finland improved, even pulling off a shock victory against the then-Olympic champions in the World Championship final in Stockholm in 1995.\nFor Lehtinen, who played in that winning side, the victory was a watershed in the rivalry.\n“It changed things, because Sweden had been beating us most of the time, so that was a big moment for us. There was a lot of Finnish fans there too, so it was very loud when we took the lead,” the 44-year-old said.\nThe scenes of joy were not limited to Finnish players and fans in Stockholm’s Globen arena.\n“I was a young boy back then, and it was a huge thing at that time, it was an unbelievable victory for the whole nation,” defenseman Sami Lepisto, who will be a key part of Finland’s team in Pyeongchang, told Reuters.\nLepisto went on to be in the Finnish squad that hammered the Swedes 6-1 in the 2011 World Championship final, and he now hopes they can improve their Olympic record against the Swedes and finally make it to the top step of the podium.\n“Of course, we have those two World Championship finals that we won, but at the Olympics it’s been mainly Sweden that has been winning those battles,” he said, adding that he will be keeping an eye on the Swedes when the knockout stages begin.\n“We feel like we have a good team and a good chance to win, and I think we have a strong chance - just like Sweden.”\nReporting by Philip O'Connor, editing by Ed Osmond\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T21:36:00.000+02:00", "crawled": "2018-01-20T17:33:33.000+02:00", "highlightTitle": ""}