{"organizations": [], "uuid": "7556399809d0cb4c35d980b428cc528393d104f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-79562895.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/five-big-business-trends-to-watch-in-2018/", "country": "US", "domain_rank": 1196, "title": "Five Big Business Trends to Watch in 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.81, "site_type": "news", "published": "2018-01-02T08:00:00.000+02:00", "replies_count": 0, "uuid": "7556399809d0cb4c35d980b428cc528393d104f7"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/02/five-big-business-trends-to-watch-in-2018/", "ord_in_thread": 0, "title": "Five Big Business Trends to Watch in 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "alan murray", "sentiment": "negative"}, {"name": "kim jong-un", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Alan Murray 6:00 AM EST \nAfter a restful holiday break I’m ready for what is sure to be an eventful New Year. \nHere are five big business trends I’ll be watching: \n1: Recession Watch. Apologies for being contrary; all signs point to a solid economy in 2018, with tax cuts boosting growth. But that’s precisely the reason to start worrying. The economic expansion is eight and a half years old, and this spring, it becomes the second longest on record. Unemployment is at all-time lows in 13 states . Wages are (finally) starting to rise. As a result, there’s a steadily growing danger that something will happen to end the streak—a spike in interest rates powered by the Fed; a collapse in the stock market caused by a re-valuation of tech companies; a trade war sparked by the President; or a nuclear standoff with Kim Jong-un, to name a few. None of these, by themselves, is a likely event; but together they represent an impressive flock of potential black swans circling an aging economic expansion. \n2: AI advances. 2017 was the year AI leapt to the forefront of CEO consciousness. 2018 may be the year that the hype starts to become reality. At CEO Daily, we believe the explosion of connected devices spewing out data that can be transformed into intelligence by ever smarter machine-learning algorithms eventually will spark a new industrial revolution. But we also recognize there are long and variable lags. If you missed this smart piece by Greg Ip of the Wall Street Journal last week, take time to read it now. A belated burst of business productivity in 2018, if it happened, could help prolong the expansion and provide a much-needed boost to living standards. \n3: The tech backlash builds. Expect to see this on multiple fronts in 2018, as retailers worry about Amazon’s growing dominance, media companies struggle in the Facebook-Google-Netflix vice grip, Congress continues its quest for information on how Russia, ISIS and other bad actors benefit from social networks, and concerns about cyber security and data privacy grow. One area to watch is antitrust enforcement, where the government’s suit to block the AT&T-Time Warner merger could presage a new approach to vertical integration that could ultimately threaten the FAANG firms. \n4: The CEO Statesman is on the rise. For a host of reasons, CEOs are increasingly taking on social issues. Driving the trend: socially-conscious millennial workers, ineffective governments, and the need to build public trust in business. Expect to see more CEOs stepping up in 2018 . With the labor market tight, they need to show that their companies are doing good in the world to attract the best talent. \n5: A changing workplace for women. The #MeToo movement has caused an abrupt shift in acceptable workplace behavior. Some worry that could result in a backlash, but I’m betting 2018 will mark a turning point for women in the workplace. \nThis essay was originally published in CEO Daily, Fortune’s morning newsletter for must-read business news. Subscribe here . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T08:00:00.000+02:00", "crawled": "2018-01-02T20:03:53.032+02:00", "highlightTitle": ""}