{"organizations": [], "uuid": "60b5af0670d21e48470fb57d2ddf8e1672419e33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/health-cancer-virus/immune-boosting-virus-could-be-used-to-treat-brain-tumours-idINKBN1ET0AQ", "country": "US", "domain_rank": 408, "title": "Immune boosting virus could be used to treat brain tumors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:01:00.000+02:00", "replies_count": 0, "uuid": "60b5af0670d21e48470fb57d2ddf8e1672419e33"}, "author": "", "url": "https://in.reuters.com/article/health-cancer-virus/immune-boosting-virus-could-be-used-to-treat-brain-tumours-idINKBN1ET0AQ", "ord_in_thread": 0, "title": "Immune boosting virus could be used to treat brain tumors", "locations": [], "entities": {"persons": [{"name": "kate kelland", "sentiment": "none"}, {"name": "adel samson", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "science transla", "sentiment": "none"}], "organizations": [{"name": "university of leeds’ institute of cancer and pathology", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 3:13 AM / Updated 3 hours ago Immune boosting virus could be used to treat brain tumours Kate Kelland 3 Min Read \nLONDON (Reuters) - A trial of a potential new brain cancer treatment has shown that a virus injected directly into the bloodstream can reach tumours deep inside the brain and switch on the body’s own defence system to attack them. \nThe trial involved just nine patients, but scientists said that if the results could be replicated in larger studies, the naturally occurring ‘reovirus’ could be developed into an effective immunotherapy for people with aggressive brain tumours. \n“This is the first time it has been shown that a therapeutic virus is able to pass through the brain-blood barrier,” said Adel Samson, a medical oncologist at the University of Leeds’ Institute of Cancer and Pathology who co-led the work. \nHe said their trial had shown not only that a virus could be delivered to a tumour deep in the brain, but that when it reached its target, “it stimulated the body’s own immune defences to attack the cancer”. \nPublished in the journal Science Translational Medicine on Wednesday, the trial involved nine patients with tumours that had either spread to the brain from other areas or were fast-growing gliomas, an aggressive type of brain cancer. \nAll the patients were due to have their tumours removed surgically, but in the days beforehand they were each given a single dose of the reovirus administered via intravenous drip into the bloodstream. \nOnce the tumours were removed, the scientists analysed samples to see if the virus had been able to reach the cancer, which in some cases was deep within the brain. \nIn all nine patients, there was evidence that the virus had reached its target, they said. There were also signs that the replicating virus had stimulated the immune system, with white blood cells or so-called “killer” T-cells being drawn to the tumour to attack it. \nBecause the virus only infects cancer cells and leaves healthy cells alone, patients who received the experimental treatment reported only mild side-effects such as slight flu-like symptoms. \nUntil these positive results, scientists had been doubtful about whether the virus would be able to pass into the brain because of the protective blood-brain barrier membrane. \nHowever, injecting the virus directly into the brain would be difficult and potentially dangerous. \nAlan Melcher of Britain’s Institute of Cancer Research, who also co-led the study, said the results pointed a way forward for more trials using this virus, including testing whether it can harness the immune system to super-charge the effect of existing chemotherapy and radiotherapy treatments. \n“Now we know we can get reovirus across the blood-brain barrier, we have begun clinical studies to see just how effective this viral immunotherapy can be,” he said. Reporting by Kate Kelland; Editing by Gareth Jones", "external_links": [], "published": "2018-01-03T21:01:00.000+02:00", "crawled": "2018-01-04T08:11:47.004+02:00", "highlightTitle": ""}