{"organizations": [], "uuid": "072cb9ae53dfc31ace0a83c0a088d0a58e4701a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-viz-ai-hires-world-renowned-stroke-executive-as-chief-commercial-officer.html", "country": "US", "domain_rank": 767, "title": "Viz.ai Hires World-Renowned Stroke Executive as Chief Commercial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.398, "site_type": "news", "published": "2018-01-12T02:28:00.000+02:00", "replies_count": 0, "uuid": "072cb9ae53dfc31ace0a83c0a088d0a58e4701a9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-viz-ai-hires-world-renowned-stroke-executive-as-chief-commercial-officer.html", "ord_in_thread": 0, "title": "Viz.ai Hires World-Renowned Stroke Executive as Chief Commercial Officer", "locations": [], "entities": {"persons": [{"name": "yiu", "sentiment": "none"}, {"name": "raul g. nogueira", "sentiment": "none"}, {"name": "conrad", "sentiment": "none"}, {"name": "mansi", "sentiment": "none"}, {"name": "conrad yiu", "sentiment": "none"}, {"name": "chris mansi", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- Viz.ai , a revolutionary Direct-to-Intervention healthcare company, today announced that Conrad Yiu has been named as its Chief Commercial Officer (CCO). As CCO, Yiu has responsibility for all customer-facing activities, including global sales, marketing, product development, clinical research, business development, and customer support. Yiu will report directly to Chris Mansi, M.D., Viz.ai’s President and CEO.\nDr. Mansi said, “Conrad brings more than 28 years of high-level experience across a broad range of industries, including medical device, consumer, and technology with a proven track record of developing and executing aggressive growth strategies in white space markets. His leadership in developing breakthrough improvements in stroke care, especially the interventional treatment for AIS [acute ischemic stroke], combined with his relationships with physicians, societies, and companies offers Viz.ai a tremendous opportunity for awareness and integration in this emerging treatment area.”\nRaul G. Nogueira, M.D., advisor to Viz.ai and internationally acclaimed interventional neurologist, expressed his appreciation at Yiu joining the healthcare company. He said, “Viz.ai is on the cutting edge of innovative stroke care, and Conrad brings a level of expertise that complements the forward direction and progress of this visionary company.”\nYiu is an 11-year veteran in the neurovascular space having been with Medtronic through the Covidien and ev3 acquisitions where he has served in multiple sales, marketing, and strategy roles. He has been Global Stroke Market Development Director responsible for driving the adoption of interventional stroke treatment including managing partnerships with the American Heart Association/American Stroke Association (AHA/ASA), World Stroke Organization (WSO), Neurohospitalist Society (NHS) and Chinese Stroke Association (CSA).\nYiu was responsible for the launch of the Solitaire Revascularization device, which was the first stent-retriever that revolutionized Acute Ischemic Stroke (AIS) treatment for large vessel occlusions. Under Yiu’s leadership in the adoption of this technology, 5 seminal global studies in 2015 demonstrated clear benefits for mechanical thrombectomy for patients suffering from AIS. The results of these studies changed the AHA/ASA, European Stroke Organization (ESO) and CSA treatment guidelines.\nPrior to Medtronic, Yiu had sales and marketing roles at Thermage, Abbott, TheraSense, eScore.com , American Express and Baxter Healthcare. Yiu received his Masters of Business Administration from Pepperdine University and his Bachelors of Science in Biochemistry from Texas A&M University.\n“I am excited about the opportunity that Viz.ai brings to acute stroke care and the potential for addressing all time-sensitive diseases,” said Yiu. “With so many therapies available for patients, the integration of deep learning, communication and workflow optimization will be critical factors to driving patient access and improving outcomes. The Viz.ai platform can help drive value-based healthcare initiatives around time-sensitive therapies.”\nViz.ai is a revolutionary Direct-to-Intervention healthcare company pioneering deep learning technology that can identify diseases automatically, notify the right doctor directly, and enable faster communication, selection, transportation and intervention. Viz.ai has received funding from Alphabet Chairman Eric Schmidt’s Innovation Endeavors and Danhua Capital (DHVC), as well as AME Cloud Ventures and Susa Ventures.\nViz.ai’s Direct-to-Intervention Stroke System will usher in a new era of intelligent stroke care by identifying disease automatically, notifying the right doctor directly, and enabling faster patient selection, communication, transportation and intervention. Viz.ai’s mobile stroke workflow system with intelligent LVO detection and automated CT perfusion technology is awaiting FDA clearance. Viz.ai is introducing a new era of intelligent stroke care at the 2018 International Stroke Conference in Los Angeles, CA.\nFor more information, visit www.Viz.ai , follow us on Twitter at twitter.com/Viz_AI , or find us on LinkedIn at www.linkedin.com/company/viz.ai/ .\nAbout Viz.ai\nViz.ai is a Direct-to-Intervention healthcare company that uses artificial intelligence (AI) and deep learning algorithms to analyze medical data and improve medical workflow. Direct-to-Intervention care leverages AI to communicate information about treatable patients straight to a specialist. Viz.ai removes much of the friction in today’s stroke workflow by providing the right information to the right doctor at the right time.\nViz.ai is based in San Francisco and Tel Aviv, and is backed by former Google CEO Eric Schmidt’s venture capital (VC) firm, Innovation Endeavors and DHVC. Viz.ai is the first company to apply the CE Mark in this category and the first to offer an Artificial Intelligence Direct-to-Intervention System in Europe.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006220/en/\nScott Public Relations\nJulia Natasha Watthey, MBA\nVice President\n818-610-0270\nJulia@scottpublicrelations.com\nSource: Viz.ai", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FViz_AI&esheet=51742265&newsitemid=20180111006220&lan=en-US&anchor=twitter.com%2FViz_AI&index=3&md5=c74224a55344a21acd5c20460d7a407e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.viz.ai%2F&esheet=51742265&newsitemid=20180111006220&lan=en-US&anchor=Viz.ai&index=1&md5=0b9ab0d00179bb0e408450b8dbe301f8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Viz.ai&esheet=51742265&newsitemid=20180111006220&lan=en-US&anchor=www.Viz.ai&index=2&md5=730289207845d6913d31704d2e445cfd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fviz.ai%2F&esheet=51742265&newsitemid=20180111006220&lan=en-US&anchor=www.linkedin.com%2Fcompany%2Fviz.ai%2F&index=4&md5=757f9002bcfab26d60fb153e662123b3", "http://www.businesswire.com/news/home/20180111006220/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.viz.ai%2F&esheet=51742265&newsitemid=20180111006220&lan=en-US&anchor=Viz.ai&index=5&md5=d488247f69b7d273163f49d707c73cf0"], "published": "2018-01-12T02:28:00.000+02:00", "crawled": "2018-01-12T01:58:16.003+02:00", "highlightTitle": ""}