{"organizations": [], "uuid": "344e4a68937c95e8ec37315ef5a1d33cdc3076fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-counsyl-appoints-ann-rhoads-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Counsyl Appoints Ann Rhoads to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-04T19:00:00.000+02:00", "replies_count": 0, "uuid": "344e4a68937c95e8ec37315ef5a1d33cdc3076fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-counsyl-appoints-ann-rhoads-to-board-of-directors.html", "ord_in_thread": 0, "title": "Counsyl Appoints Ann Rhoads to Board of Directors", "locations": [], "entities": {"persons": [{"name": "ann rhoads", "sentiment": "negative"}, {"name": "ann", "sentiment": "none"}, {"name": "ramji srinivasan", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "counsyl", "sentiment": "none"}, {"name": "zogenix", "sentiment": "none"}], "organizations": [{"name": "globus", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif.--(BUSINESS WIRE)-- Counsyl today announced the appointment of Ann Rhoads, former executive vice president and chief financial officer at pharmaceutical company, Zogenix, to the company’s board of directors.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104005166/en/\nCounsyl Appoints Ann Rhoads to Board of Directors (Photo: Business Wire)\n“We’re eager to have Ann officially join our board as her financial expertise in scaling high growth companies will be a tremendous asset to Counsyl,” said Ramji Srinivasan, co-founder and chief executive officer of Counsyl. “She understands the value of giving doctors and patients the most accurate information regarding their health and I am confident in her ability to help us make genetic screening routine for women and their families.”\nAs a healthcare veteran with more than 25 years of experience in finance and business development, Ann brings valuable insight to Counsyl. She currently serves as a board member and chair of the audit committee for Globus Medical, a leading musculoskeletal company, and Evoke Pharma, a specialty pharmaceutical company focused on gastrointestinal disease. In addition, Ann is a board member and chair of the compensation committee for ophthalmic laser company Iridex Corporation. She most recently served as executive vice president and chief financial officer at Zogenix, a pharmaceutical company developing therapies for central nervous system disorders and rare diseases. Prior to Zogenix, Ann served as chief financial officer and senior vice president at Premier, a healthcare improvement company, helping the business grow from $300 million to $650 million in revenue. She was previously an investment professional with venture capital firm, Sprout Group, and before that a management consultant at Bain & Company. Ann earned a masters in business administration from Harvard Graduate School of Business Administration and a bachelors of science in business administration from the University of Arkansas.\n“I’m thrilled to join Counsyl’s board and lend my expertise to help Counsyl broaden awareness about genetic screening and counseling and advise on maximizing growth opportunities in the evolving healthcare industry,” said Ann Rhoads. “As an industry-leading genetic screening company, Counsyl is poised to transform women’s healthcare and family planning and I look forward to being a part of a business that’s at the forefront of dramatically improving lives through advanced technology.”\nSince the company’s founding in 2007, Counsyl has championed advances in genetic screening for women and their families and has screened more than 850,000 patients, served more than 17,000 health care providers and provided more than 60,000 genetic counseling sessions.\nCounsyl’s suite of products includes:\nCounsyl Foresight™ Carrier Screen : Identifies carrier status of couples to determine risk of hereditary conditions. Counsyl Prelude™ Prenatal Screen : As early as the tenth week of pregnancy, this non-invasive screening detects a fetus’ risk for chromosomal conditions such as Down syndrome. Counsyl Reliant™ Cancer Screen : Analyzes genes associated with an increased risk of 10 common cancers, including breast, ovarian and pancreatic cancer. Counsyl Complete™ : Our complete practice workflow solution, including pre-test education, billing support, clear results reporting and on-demand genetic counseling.\nAbout Counsyl\nCounsyl is committed to improving lives by providing actionable information that guides women and their families in making critical and timely health decisions. Whether it’s starting a family or evaluating risk for cancer, Counsyl's genetic screens provide patients with early awareness about genetic conditions, so they can live informed and prepare for the future. Counsyl has screened more than 850,000 patients and served more than 17,000 healthcare professionals. For more information, visit www.counsyl.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005166/en/\nCounsyl\nDonelle M. Gregory\npress@counsyl.com\nSource: Counsyl", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.counsyl.com%2Fclinic%2F&esheet=51737459&newsitemid=20180104005166&lan=en-US&anchor=Counsyl+Complete%E2%84%A2&index=4&md5=9206e2b6762f0f398be950eeec60e8fd", "http://www.businesswire.com/news/home/20180104005166/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.counsyl.com%2Fservices%2Fforesight%2Fclinical-info%2F&esheet=51737459&newsitemid=20180104005166&lan=en-US&anchor=Counsyl+Foresight%E2%84%A2+Carrier+Screen&index=1&md5=bde1843c79b98e6de13b4414ff106b40", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.counsyl.com&esheet=51737459&newsitemid=20180104005166&lan=en-US&anchor=www.counsyl.com&index=5&md5=cddfcbda26a5bb9128444e5b2e5225f8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.counsyl.com%2Fservices%2Freliant%2Fclinical-info%2F&esheet=51737459&newsitemid=20180104005166&lan=en-US&anchor=Counsyl+Reliant%E2%84%A2+Cancer+Screen&index=3&md5=90f557a4e888717cc39e9445472d4ec0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.counsyl.com%2Fservices%2Fprelude%2Fclinical-info%2F&esheet=51737459&newsitemid=20180104005166&lan=en-US&anchor=Counsyl+Prelude%E2%84%A2+Prenatal+Screen&index=2&md5=703c183be57d0edac4073f4438827b75"], "published": "2018-01-04T19:00:00.000+02:00", "crawled": "2018-01-04T19:23:04.009+02:00", "highlightTitle": ""}