{"organizations": [], "uuid": "500dc4b0abdebda0845d9a6e6608378a2f1d77c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/12/09/101257967-128847668.1910x1000.", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/trump-news-white-house-explains-jay-z-black-unemployment-tweet.html", "country": "US", "domain_rank": 767, "title": "Trump news: White House explains Jay-Z black unemployment tweet", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.068, "site_type": "news", "published": "2018-01-29T22:23:00.000+02:00", "replies_count": 0, "uuid": "500dc4b0abdebda0845d9a6e6608378a2f1d77c3"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/29/trump-news-white-house-explains-jay-z-black-unemployment-tweet.html", "ord_in_thread": 0, "title": "Trump news: White House explains Jay-Z black unemployment tweet", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jay-z", "sentiment": "negative"}, {"name": "jim mcisaac", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sarah huckabee sanders", "sentiment": "none"}], "locations": [], "organizations": [{"name": "white house", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Jim McIsaac | Getty Images \nThe White House again promoted the unemployment rate for black Americans on Monday, a day after President Donald Trump used the statistic to respond to criticism from music icon Jay-Z . \nThis month, the president has repeatedly touted a record low unemployment rate for black Americans — 6.8 percent as of December. He has cited the figure in an apparent effort to show that his economic agenda is working for black Americans, from whom he has struggled to win support. \nTrump can hardly take all the credit for the drop in the unemployment rate for black Americans. The decline is part of a gradual trend that has occurred since 2011, when the job market suffered in the wake of the Great Recession. \nThe job market continues to be tougher for black Americans than other groups. In December, the unemployment rates for Hispanic, white and Asian-Americans were 4.9 percent, 3.7 percent and 2.4 percent, respectively. Asked Monday whether the Trump administration has done anything to address black unemployment specifically, press secretary Sarah Huckabee Sanders argued that Trump's pushes to overhaul the tax system and cut regulations on businesses helped all Americans. \n\"Look, I think you can see from the steps that we've already taken that we're trying to fix unemployment for all Americans,\" she said. \"That's the point that the president has made time and time again, is that he wants it to be better for everybody.\" \nAsked why Trump took issue with Jay-Z after the rapper criticized the president's racially charged remarks, Sanders expressed the same sentiment. \n\"Because [the unemployment numbers are] better than they have been. And we're certainly making progress and we want to continue to do that,\" she said. \nOn Saturday, Jay-Z criticized Trump's reported comments questioning whether the U.S. needed immigrants from \"s---hole\" African countries. In an interview with CNN, he called Trump's remarks \"hurtful\" and said he appeared to be \"looking down on a whole population of people.\" \nJay-Z, whose real name is Shawn Carter, added that Trump's comments about the labor market \"are missing the whole point.\" \n\"Because it's not about money at the end of the day. Money doesn't equate to happiness. It doesn't,\" he said. \"You treat people like human beings. That's the main point.\" \nOn Sunday morning, Trump tweeted: \"Somebody please inform Jay-Z that because of my policies, Black Unemployment has just been reported to be at the LOWEST RATE EVER RECORDED!\" Trump tweet \nTrump's tweet came ahead of his first State of the Union address on Tuesday night, when he is expected to take a more conciliatory tone about priorities he shares with Democrats and political rivals. The president's first year was marked by public jabs at celebrities, top U.S. law enforcement officials and lawmakers on both sides of the aisle. \nSanders suggested Trump could again mention the unemployment rate for black Americans on Tuesday night.", "external_links": [], "published": "2018-01-29T22:23:00.000+02:00", "crawled": "2018-01-29T22:36:38.053+02:00", "highlightTitle": ""}