{"organizations": [], "uuid": "88e748573feaef90597be5d0734252024cc655d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-jetblue-announces-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "JetBlue Announces Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:30:00.000+02:00", "replies_count": 0, "uuid": "88e748573feaef90597be5d0734252024cc655d4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-jetblue-announces-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "JetBlue Announces Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "jetblue airways corporation", "sentiment": "negative"}, {"name": "jetblue", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- JetBlue Airways Corporation (NASDAQ: JBLU) today reported its results for the fourth quarter 2017:\nOperating income of $189 million, a decrease of 36.0% from the fourth quarter of 2016, principally due to higher fuel prices. Pre-tax income of $170 million, a decrease of 38.0% from the fourth quarter of 2016. Fourth quarter net income of $672 million, or $2.08 per diluted share. Adjusted earnings per share of $0.32, which excludes a benefit of $1.76 associated with the revaluation of our deferred tax liabilities to reflect the impact of the enactment of the Tax Cuts and Jobs Act of 2017. This compares to JetBlue’s fourth quarter 2016 net income of $172 million, or $0.50 per diluted share.\nFinancial Performance\nJetBlue reported fourth quarter operating revenues of $1.8 billion. Revenue passenger miles for the fourth quarter increased 3.1% to 11.5 billion on a capacity increase of 5.1%, resulting in a fourth quarter load factor of 83.1%, a 1.6 point decrease year over year.\nYield per passenger mile in the fourth quarter was 13.57 cents, up 2.8% compared to the fourth quarter of 2016. Passenger revenue per available seat mile (PRASM) for the fourth quarter of 2017 increased 0.8% year over year to 11.28 cents and operating revenue per available seat mile (RASM) increased 1.8% year over year to 12.66 cents.\nCompared with last year, operating expenses for the quarter increased 16.5%, or $222 million. Interest expense for the quarter declined 12.4%, or $4 million, as JetBlue continued to reduce its debt. JetBlue’s operating expense per available seat mile (CASM) for the fourth quarter increased 10.8% year over year to 11.29 cents. CASM Ex-Fuel 1 for the fourth quarter increased 8.1% to 8.63 cents.\n“I’d like to thank our 21,000 Crewmembers, who rose to each and every challenge during 2017. Our fourth quarter results were driven by solid demand across our network, our successful ancillary platform and recovery in the Caribbean that exceeded our expectations, following a historic hurricane season. We continue to make progress to achieve our margin commitments and to compete successfully as a low-cost carrier,” said Robin Hayes, JetBlue’s President and CEO.\nFuel Expense and Hedging\nIn the fourth quarter of 2017 JetBlue had hedges in place for approximately 10% of its fuel consumption. The realized fuel price in the quarter was $1.89 per gallon, a 21.6% increase versus fourth quarter 2016 realized fuel price of $1.56.\nJetBlue does not presently have any forward fuel derivative contracts to hedge its fuel consumption. Based on the fuel curve as of January 12 th , JetBlue expects an average price per gallon of fuel of $2.16 in the first quarter of 2018, an increase of approximately 28% over the realized fuel price in the first quarter of 2017.\nLiquidity and Cash Flow\nJetBlue ended the quarter with approximately $693 million in unrestricted cash and short term investments, or about 10% of trailing twelve month revenue. In addition, JetBlue maintains approximately $625 million in undrawn lines of credit.\nDuring the fourth quarter, JetBlue repaid $57 million in regularly scheduled debt and capital lease obligations. JetBlue anticipates paying approximately $59 million in regularly scheduled debt and capital lease obligations in the first quarter and approximately $202 million for the full year 2018.\n“In the fourth quarter and 2017 we took actions to navigate a complex external environment, while striving to protect and enhance our margins. These actions included capacity adjustments and redeployments following a challenging summer and to mitigate the impact of hurricanes. We continue to demonstrate our ability to make progress in our commitments to all our stakeholders and to lay the foundation that will ultimately achieve superior margins,” said Steve Priest, JetBlue’s EVP Chief Financial Officer.\nFirst Quarter and Full Year 2018 Outlook\nFor further details see the Investor Update and the Fourth Quarter 2017 Earnings Presentation available via the internet at http://investor.jetblue.com .\nCapacity is expected to increase between 3.5% and 5.5% year over year in the first quarter 2018. For the full year 2018, JetBlue expects capacity to increase between 6.5% and 8.5%.\nRASM growth is expected to range between 2.5% and 5.5% for the first quarter 2018 compared to the same period in 2017.\nCASM Ex-Fuel is expected to grow between 2.0% and 4.0% for the first quarter of 2018. For the full year 2018, JetBlue expects year over year CASM Ex-Fuel to be between (1.0)% and 1.0%.\nJetBlue will conduct a conference call to discuss its quarterly earnings today, January 25, at 10:00 a.m. Eastern Time. A live broadcast of the conference call will also be available via the internet at http://investor.jetblue.com .\nAbout JetBlue\nJetBlue is New York's Hometown Airline®, and a leading carrier in Boston, Fort Lauderdale - Hollywood, Los Angeles (Long Beach), Orlando, and San Juan. JetBlue carries more than 40 million customers a year to 101 cities in the U.S., Caribbean, and Latin America with an average of 1,000 daily flights. For more information please visit www.jetblue.com .\nNotes\n(1) Consolidated operating cost per available seat mile, excluding fuel and related taxes, and operating expenses related to other non-airline expenses (CASM Ex-Fuel) is a non-GAAP financial measure that we use to measure our core performance. Note A provides a reconciliation of non-GAAP financial measures used in this release and provides the reasons management uses those measures.\nForward Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 which represent our management's beliefs and assumptions concerning future events. When used in this document and in documents incorporated herein by reference, the words “expects,” “plans,” “anticipates,” “indicates,” “believes,” “forecast,” “guidance,” “outlook,” “may,” “will,” “should,” “seeks,” “targets” and similar expressions are intended to identify forward-looking statements. Forward-looking statements involve risks, uncertainties and assumptions, and are based on information currently available to us. Actual results may differ materially from those expressed in the forward-looking statements due to many factors, including, without limitation, our extremely competitive industry; volatility in financial and credit markets which could affect our ability to obtain debt and/or lease financing or to raise funds through debt or equity issuances; volatility in fuel prices, maintenance costs and interest rates; our ability to implement our growth strategy; our significant fixed obligations and substantial indebtedness; our ability to attract and retain qualified personnel and maintain our culture as we grow; our reliance on high daily aircraft utilization; our dependence on the New York and Boston metropolitan markets and the effect of increased congestion in these markets; our reliance on automated systems and technology; our being subject to potential unionization, work stoppages, slowdowns or increased labor costs; our reliance on a limited number of suppliers; our presence in some international emerging markets that may experience political or economic instability or may subject us to legal risk; reputational and business risk from information security breaches or cyber-attacks; changes in or additional domestic or foreign government regulation; changes in our industry due to other airlines' financial condition; acts of war or terrorism; global economic conditions or an economic downturn leading to a continuing or accelerated decrease in demand for air travel; the spread of infectious diseases; adverse weather conditions or natural disasters; and external geopolitical events and conditions. It is routine for our internal projections and expectations to change as the year or each quarter in the year progresses, and therefore it should be clearly understood that the internal projections, beliefs and assumptions upon which we base our expectations may change prior to the end of each quarter or year.\nGiven the risks and uncertainties surrounding forward-looking statements, you should not place undue reliance on these statements. You should understand that many important factors, in addition to those discussed or incorporated by reference in this press release, could cause our results to differ materially from those expressed in the forward-looking statements. Potential factors that could affect our results include, in addition to others not described in this press release, those described in Item 1A of our 2016 Form 10-K under \"Risks Related to JetBlue\" and \"Risks Associated with the Airline Industry\". In light of these risks and uncertainties, the forward-looking events discussed in this press release might not occur.\nJETBLUE AIRWAYS CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except per share amounts)\n(unaudited)\nThree Months Ended Twelve Months Ended December 31, Percent December 31, Percent 2017 2016 Change 2017 2016 Change OPERATING REVENUES\nPassenger $ 1,564 $ 1,477 5.9 $ 6,288 $ 6,013 4.6 Other 192 164 16.9 727 619 17.3 Total operating revenues 1,756 1,641 7.0 7,015 6,632 5.8 OPERATING EXPENSES Aircraft fuel and related taxes 368 291 26.4 1,363 1,074 26.9 Salaries, wages and benefits 490 427 14.6 1,887 1,698 11.1 Landing fees and other rents 96 81 17.8 397 357 11.1 Depreciation and amortization 119 103 15.1 446 393 13.7 Aircraft rent 25 27 (6.4) 100 110 (9.0) Sales and marketing 72 63 14.6 267 259 2.9 Maintenance materials and repairs 155 136 14.3 622 563 10.5 Other operating expenses 242 217 11.8 933 866 7.6 Total operating expenses 1,567 1,345 16.5 6,015 5,320 13.1 OPERATING INCOME 189 296 (36.0) 1,000 1,312 (23.8) Operating margin 10.8 % 18.0 % (7.2) pts. 14.3 % 19.8 % (5.5) pts. OTHER INCOME (EXPENSE) Interest expense (22) (26) (12.4) (95) (111) (15.0) Capitalized interest 2 2 4.1 10 8 20.0 Interest income and other 1 2 (42.9) 6 7 (14.9) Total other income (expense) (19) (22) (12.0) (79) (96) (18.0) INCOME BEFORE INCOME TAXES 170 274 (38.0) 921 1,216 (24.2) Pre-tax margin 9.7 % 16.7 % (7.0) pts. 13.1 % 18.3 % (5.2) pts. Income tax (benefit) expense (502) 102 (593.8) (226) 457 (149.5) NET INCOME $ 672 $ 172 291.2 $ 1,147 $ 759 51.2 EARNINGS PER COMMON SHARE: Basic $ 2.09 $ 0.51 $ 3.49 $ 2.32 Diluted $ 2.08 $ 0.50 $ 3.47 $ 2.22 WEIGHTED AVERAGE SHARES OUTSTANDING: Basic 321.6 335.1 328.7 326.5 Diluted 323.2 341.6 330.4 342.2 JETBLUE AIRWAYS CORPORATION\nCOMPARATIVE OPERATING STATISTICS\n(unaudited)\nThree Months Ended Twelve Months Ended December 31, Percent December 31, Percent 2017 2016 Change 2017 2016 Change Revenue passengers (thousands) 9,787 9,532 2.7 40,038 38,263 4.6 Revenue passenger miles (millions) 11,527 11,185 3.1 47,240 45,619 3.6 Available seat miles (ASMs) (millions) 13,876 13,198 5.1 56,007 53,620 4.5 Load factor 83.1 % 84.7 % (1.6) pts. 84.3 % 85.1 % (0.8) pts. Aircraft utilization (hours per day) 11.2 11.6 (3.0) 11.7 12.0 (2.4) Average fare $ 159.85 $ 154.94 3.2 $ 157.07 $ 157.14 (0.0) Yield per passenger mile (cents) 13.57 13.20 2.8 13.31 13.18 1.0 Passenger revenue per ASM (cents) 11.28 11.19 0.8 11.23 11.21 0.1 Revenue per ASM (cents) 12.66 12.43 1.8 12.53 12.37 1.3 Operating expense per ASM (cents) 11.29 10.19 10.8 10.74 9.92 8.2 Operating expense per ASM, excluding fuel (cents) (1) 8.63 7.98 8.1 8.30 7.92 4.8 Departures 87,701 83,976 4.4 353,681 337,302 4.9 Average stage length (miles) 1,071 1,077 (0.6) 1,072 1,093 (1.9) Average number of operating aircraft during period 239.0 222.4 7.5 233.5 218.9 6.7 Average fuel cost per gallon, including fuel taxes $ 1.89 $ 1.56 21.6 $ 1.72 $ 1.41 21.8 Fuel gallons consumed (millions) 194 187 3.9 792 760 4.2 Average number of full-time equivalent crewmembers 17,118 15,696 9.1 (1) Refer to Note A, Consolidated operating cost per available seat mile, excluding fuel (CASM Ex-Fuel) at the end of our Earnings Release for more information on this non-GAAP measure. CASM Ex-Fuel excludes fuel and related taxes, and operating expenses related to other non-airline expenses. JETBLUE AIRWAYS CORPORATION\nSELECTED CONSOLIDATED BALANCE SHEET DATA\n(in millions)\nDecember 31, December 31, 2017 2016 (unaudited) Cash and cash equivalents $ 303 $ 433 Total investment securities 392 628 Total assets 9,781 9,487 Total debt 1,199 1,384 Stockholders' equity 4,834 4,013 Note A – Non-GAAP Financial Measures\nJetBlue sometimes uses non-GAAP measures that are derived from the Consolidated Financial Statements, but that are not presented in accordance with generally accepted accounting principles (“GAAP”). JetBlue believes these metrics provide a meaningful comparison of our results to others in the airline industry and our prior year results. Under the U.S. Securities and Exchange Commission rules, non-GAAP financial measures may be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for or superior to GAAP results. The table below shows a reconciliation of non-GAAP financial measures used in this press release to the most directly comparable GAAP financial measures. It should be noted as well that our non-GAAP information may be different from the non-GAAP information provided by other companies.\nConsolidated operating cost per available seat mile, excluding fuel and related taxes, and operating expenses (“CASM Ex-Fuel”). CASM is a common metric used in the airline industry. We exclude aircraft fuel and related taxes and operating expenses related to other non-airline expenses, such as JetBlue Technology Ventures, from operating cost per available seat mile to determine CASM Ex-Fuel. We believe CASM Ex-Fuel provides investors the ability to measure financial performance excluding items beyond our control such as fuel costs, which are subject to many economic and political factors beyond our control or not related to the generation of an available seat mile, such as operating expenses related to other non-airline expenses. We believe this measure is more indicative of our ability to manage costs and is more comparable to measures reported by other major airlines.\nNON-GAAP FINANCIAL MEASURE\nRECONCILIATION OF OPERATING EXPENSE PER ASM, EXCLUDING FUEL\n(in millions, per ASM data in cents)\n(unaudited)\nThree Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 $ per ASM $ per ASM $ per ASM $ per ASM Total operating expenses $ 1,567 $ 11.29 $ 1,345 $ 10.19 $ 6,015 $ 10.74 $ 5,320 $ 9.92 Less: Aircraft fuel and related taxes 368 2.65 291 2.21 1,363 2.43 1,074 2.00 Other non-airline expenses 1 0.01 - - 4 0.01 1 - Operating expenses, excluding fuel and related taxes $ 1,198 $ 8.63 $ 1,054 $ 7.98 $ 4,648 $ 8.30 $ 4,245 $ 7.92 Return On Invested Capital (“ROIC”). ROIC is a non-GAAP financial measure we believe provides useful supplemental information for management and investors by measuring the effectiveness of our operations' use of invested capital to generate profits. We use ROIC to track how much value we are creating for our shareholders as it represents an important financial metric we believe provides meaningful information as to how well we generate returns relative to the capital invested in our business.\nNON-GAAP FINANCIAL MEASURE Reconciliation of Return on Invested Capital (Non-GAAP) (in millions) (unaudited) Twelve Months Ended December 31, 2017 2016 Numerator Operating Income $ 1,000 $ 1,312 Add: Interest income and other 6 7 Add: Interest component of capitalized aircraft rent (a) 53 58 Subtotal 1,059 1,377 Less: Income tax expense impact 395 520 Operating Income After Tax, Adjusted 664 857 Denominator Average Stockholders' equity $ 4,424 $ 3,611 Average total debt 1,291 1,606 Capitalized aircraft rent (a) 702 771 Invested Capital 6,417 5,988 Return on Invested Capital 10.3% 14.3% (a) Capitalized Aircraft Rent Aircraft rent, as reported 100 110 Capitalized aircraft rent (7 * Aircraft rent) (b) 702 771 Interest component of capitalized aircraft rent (Imputed interest at 7.5%) 53 58 (b) In determining the Invested Capital component of ROIC we include a non-GAAP adjustment for aircraft operating leases, as operating lease obligations are not reflected on our balance sheets but do represent a significant financing obligation. In making the adjustment we used a multiple of seven times our aircraft rent as this is the multiple which is routinely used with in the airline community to represent the financing component of aircraft operating lease obligations.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005349/en/\nJetBlue Investor Relations\nTel: +1 718-709-2202\nir@jetblue.com\nor\nJetBlue Corporate Communications\nTel: +1 718-709-3089\ncorpcomm@jetblue.com\nSource: JetBlue Airways Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.jetblue.com&esheet=51748682&newsitemid=20180125005349&lan=en-US&anchor=http%3A%2F%2Finvestor.jetblue.com&index=1&md5=ebd0ee106f701691aeead4316f21f785", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.jetblue.com&esheet=51748682&newsitemid=20180125005349&lan=en-US&anchor=http%3A%2F%2Finvestor.jetblue.com&index=2&md5=b3036b65503d29d0ff19b819591ab553", "http://www.businesswire.com/news/home/20180125005349/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jetblue.com&esheet=51748682&newsitemid=20180125005349&lan=en-US&anchor=www.jetblue.com&index=3&md5=44df1bb84716c732a54bb1330f4da149"], "published": "2018-01-25T15:30:00.000+02:00", "crawled": "2018-01-25T16:58:51.037+02:00", "highlightTitle": ""}