{"organizations": [], "uuid": "b0aa02bd23875973f7a9723559480726e5bf0dd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225639856&w=1200&r=LYNXMPEE0Q01I", "site_section": "https://www.reuters.com/places/mexico", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-mexico-election-nafta/nafta-revamp-should-wait-until-after-mexico-vote-frontrunner-idUSKBN1FG01A", "country": "US", "domain_rank": 408, "title": "NAFTA revamp should wait until after Mexico vote: frontrunner", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.042, "site_type": "news", "published": "2018-01-27T08:39:00.000+02:00", "replies_count": 0, "uuid": "b0aa02bd23875973f7a9723559480726e5bf0dd5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mexico-election-nafta/nafta-revamp-should-wait-until-after-mexico-vote-frontrunner-idUSKBN1FG01A", "ord_in_thread": 0, "title": "NAFTA revamp should wait until after Mexico vote: frontrunner", "locations": [], "entities": {"persons": [{"name": "andres manuel lopez obrador", "sentiment": "none"}, {"name": "lopez obrador", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "cintalapa", "sentiment": "none"}, {"name": "united st", "sentiment": "none"}, {"name": "chiapas", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINTALAPA, Mexico (Reuters) - The leftist frontrunner in Mexico’s presidential race said on Friday that the renegotiation of the North American Free Trade Agreement (NAFTA) should wait until after the July election.\nU.S., Canadian and Mexican officials are in Montreal for a sixth round of negotiations to rework the 1994 pact that underpins much of Mexico’s international trade.\nMexican presidential hopeful Andres Manuel Lopez Obrador, who has a strong lead in polls, told reporters that no deal should be struck until a new administration is in place.\n“It’s better that renegotiation of the treaty is carried out after the elections, because right now the forces at play are unfavorable to Mexico,” the veteran leftist said at a rally in the town of Cintalapa in the southern state of Chiapas.\nHe has argued that the next government he aims to lead must have a say in the future shape of NAFTA.\nLopez Obrador has staked out the most nationalistic ground in the campaign, vowing to cut Mexico’s economic dependence on foreign powers. The most important of those countries to Mexico is the United States.\n“President Donald Trump has been very rude with President (Enrique Pena Nieto), and it’s not beneficial for him to sign a treaty that affects Mexico,” Lopez Obrador said.\nTrade officials had previously said they wanted the renegotiation finished by the end of March, when the Mexican election campaign formally begins.\nOn Friday, Mexican Economy Minister Ildefonso Guajardo said there was a “window of opportunity” extending from February through the end of July for the NAFTA revamp.\nSome businesses worry that a deal struck by the government before the election would be attacked by Lopez Obrador and exploited for electoral ends.\nThe current administration is worried that termination of the pact before the election could hurt the economy and play into Lopez Obrador’s hands.\nTrump has repeatedly threatened to withdraw from the pact unless it is reworked to benefit U.S. interests.\nHe has also suggested tying the NAFTA overhaul to making Mexico pay for a southern border wall. The Mexican government has steadfastly ruled out paying for the wall.\nReporting by Mexico City Newsroom; Writing by Daina Beth Solomon; Editing by Dave Graham\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T08:39:00.000+02:00", "crawled": "2018-01-27T13:07:43.017+02:00", "highlightTitle": ""}