{"organizations": [], "uuid": "21f3665e43a80a298c4f4a301558ba3076a7e0d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224561945&w=1200&r=LYNXMPEE0M1O0", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-davos-meeting-protests/thousands-march-against-trump-in-swiss-financial-capital-idUKKBN1FC2OK", "country": "US", "domain_rank": 408, "title": "Thousands march against Trump in Swiss financial capital", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:01:00.000+02:00", "replies_count": 0, "uuid": "21f3665e43a80a298c4f4a301558ba3076a7e0d3"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-protests/thousands-march-against-trump-in-swiss-financial-capital-idUKKBN1FC2OK", "ord_in_thread": 0, "title": "Thousands march against Trump in Swiss financial capital", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "bern", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "alpine", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:02 PM / Updated 22 minutes ago Thousands march against Trump in Zurich, other Swiss cities Reuters Staff 3 Min Read \nZURICH (Reuters) - Thousands of anti-capitalist protesters marched through Zurich on Tuesday and other major Swiss cities to demonstrate against a planned visit by U.S. President Donald Trump to the World Economic Forum’s annual meeting this week. \nLeftists organisers had called for protests under the mottos “Trump Not Welcome” and “Smash WEF!” \nTrump is due to speak on Friday at the WEF meeting in the Alpine town of Davos, an annual meeting of global business and political leaders where protests have been banned. \nFlag-waving demonstrators, whom Zurich police estimated at 2,000, carried anti-globalist and environmentalist placards such as “No Trump, no coal, no gas, no fossil fuels” as they marched toward Zurich’s financial district, where bankers had been warned to stay clear of the approved demonstration. \nSwiss television RSR showed a sign that read “Who was the Shithole?”, in reference to reported remarks by Trump about Haiti and African countries, which he has denied. \nSimilar protests took place, with several hundred protesters each, in public squares in Geneva, Lausanne and Fribourg. Geneva signs read “World Economic Fiasco”, “racist sexist capitalist” and “Don’t touch women’s rights”. People attend an Anti-Trump demonstration to protest U.S. President's coming to the World Economic Forum of Davos, in Geneva, Switzerland January 23, 2018. REUTERS/Pierre Albouy \nPaolo Gilardi, Geneva demonstrator organiser, told Reuters TV: “While the Swiss Federal Council (Swiss cabinet) is about to welcome and unroll the red carpet for Mister Trump, well we think that the population has something to say.” \n“... this policy is unacceptable because the goal of this policy is to reduce the planet to fire and blood and to assure the powerful people’s domination over the rest of the world.” Slideshow (6 Images) \nEarlier in Geneva, protesters laid a wreath at the entrance of the U.S. diplomatic mission in memory of Heather Heyer, who was killed in Charlottesville, Virginia amid clashes between hundreds of white supremacists and counter-protesters last August. \nAfter the rally, Trump inflamed tensions by saying there were “very fine people” on both sides, drawing condemnation from some Republican leaders and praise from white supremacists. \nEarlier this month, demonstrators also protested against Trump’s visit in the Swiss capital of Bern. \nThat march went off peacefully, unlike violent anti-WEF protests in several Swiss citities in the early 2000s. \nMore than 4,000 Swiss soldiers have deployed to guard Davos alongside 1,000 police, while a no-fly zone was put in place to protect delegates. Reporting by Michael Shields in Zurich and Cecile Mantovani in Geneva; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-23T21:01:00.000+02:00", "crawled": "2018-01-23T21:23:06.000+02:00", "highlightTitle": ""}