{"organizations": [], "uuid": "b02a4be080b0886cd66ceb97ad392d153e3fef63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222130283&w=1200&r=LYNXMPEE0E0QJ", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-saudi-arrests-hotel/saudi-hotel-to-reopen-after-being-used-as-prison-in-corruption-purge-idUSKBN1F41FE", "country": "US", "domain_rank": 408, "title": "Saudi hotel to reopen after being used as prison in corruption purge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T14:02:00.000+02:00", "replies_count": 0, "uuid": "b02a4be080b0886cd66ceb97ad392d153e3fef63"}, "author": "", "url": "https://www.reuters.com/article/us-saudi-arrests-hotel/saudi-hotel-to-reopen-after-being-used-as-prison-in-corruption-purge-idUSKBN1F41FE", "ord_in_thread": 0, "title": "Saudi hotel to reopen after being used as prison in corruption purge", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "ritz-carlton riyadh", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:02 PM / Updated 19 minutes ago Saudi hotel to reopen after being used as prison in corruption purge Reuters Staff 3 Min Read \nRIYADH (Reuters) - The luxury Riyadh hotel used as a prison during Saudi Arabia’s crackdown on corruption will reopen for business next month, according to a company employee and its website, suggesting authorities are close to settling the cases of many suspects. \nDozens of princes, senior officials and top businessmen were detained and confined in the opulent Ritz-Carlton Riyadh as the government launched the purge in early November. The hotel was closed to normal business. \nOn Monday, an employee at the office taking bookings for the hotel, who declined to be named, told Reuters by telephone that bookings by the public would be accepted from Feb. 14. \nThe hotel’s website now accepts bookings from Feb. 14, quoting a nightly rate for its cheapest room of 2,439 riyals ($650). \nOfficial sources told Reuters earlier that Saudi authorities were close to winding up a major part of the crackdown, which would allow them to return the Ritz-Carlton to normal operations. \nIn a statement, a spokesperson for the Marriott hotel group, which owns the Ritz-Carlton brand, said: “The hotel is operating under the directive of local authorities and not as a traditional hotel for the time being.” The spokesperson declined to elaborate or discuss when the hotel might reopen. \nSaudi authorities have said they expect the vast majority of suspects to agree to financial settlements of charges against them, and that Riyadh hopes to recover about $100 billion of illicit funds. A small number are expected to be prosecuted. \nConstruction giant Saudi Binladin Group said on Saturday that some of its shareholders might transfer part of their holdings to the state in a settlement with authorities. Chairman Bakr Bin Laden and several family members were detained in the crackdown. \nIn late November, senior Saudi Prince Miteb bin Abdullah, once seen as a leading contender to the throne, was freed after reaching a settlement with authorities that involved paying more than $1 billion, according to a Saudi official. \nAnother top businessman who has been held at the Ritz-Carlton is billionaire Prince Alwaleed bin Talal, chairman and owner of global investment firm Kingdom Holding. A Saudi official told Reuters this week that he was negotiating a possible settlement but so far had not agreed on terms. \nThe hotel has 492 guest rooms and suites and 52 acres (21 hectares) of landscaped gardens, according to its website. Reporting by Marwa Rashad and Sarah Dadouch; Writing by Andrew Torchia; Editing by Ralph Boulton", "external_links": [], "published": "2018-01-15T14:02:00.000+02:00", "crawled": "2018-01-15T14:20:52.000+02:00", "highlightTitle": ""}