{"organizations": [], "uuid": "eb8fd5d7c11512363198cc436d1846bda9a0ce05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-adaptive-medias-completes-divestiture-of-non-performing-assets-and-restructures-balance-sheet-as-it-repositions-company.html", "country": "US", "domain_rank": 767, "title": "Adaptive Medias Completes Divestiture of Non-Performing Assets and Restructures Balance Sheet as it Repositions Company Into Pure Play Cannabis Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.1, "site_type": "news", "published": "2018-01-12T22:43:00.000+02:00", "replies_count": 0, "uuid": "eb8fd5d7c11512363198cc436d1846bda9a0ce05"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-adaptive-medias-completes-divestiture-of-non-performing-assets-and-restructures-balance-sheet-as-it-repositions-company.html", "ord_in_thread": 0, "title": "Adaptive Medias Completes Divestiture of Non-Performing Assets and Restructures Balance Sheet as it Repositions Company Into Pure Play Cannabis Company", "locations": [], "entities": {"persons": [{"name": "john b. strong", "sentiment": "none"}], "locations": [{"name": "irvine", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "repositions company into pure play cannabis company", "sentiment": "neutral"}, {"name": "adaptive medias", "sentiment": "neutral"}, {"name": "adaptive medias, inc.", "sentiment": "neutral"}, {"name": "restructures balance sheet", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, CA , Jan. 12, 2018 (GLOBE NEWSWIRE) -- Adaptive Medias, Inc. (OTC: ADTM), formerly an ad-tech company, today issued the following Special Letter to Shareholders from its Chairman and Chief Executive Officer, John B. Strong:\n“Dear Fellow Shareholder:\nNearly two years ago, on April 14, 2016, we announced financial results for the fiscal year ended December 31, 2015 of over $4.6 million in revenue. Revenue and margins were trending positively with a fourth quarter gross profit that more than doubled year over year to $457,340 on $1.68 million in revenue.\nConcurrently, we were also working to close a merger with another ad tech company that had developed a state-of-the-art ad blocker bypass software program. However, market conditions did not support financing and closing that transaction, and the effort’s extensive expenditure of cash and management resources left the Company under-capitalized to invest in an aggressive ad-tech business plan.\nYou can be assured, as one of the Company’s largest shareholders at the time, no one was more disappointed than I at this turn of events. However, rather than perform a large toxic financing that would have been highly dilutive to all shareholders, we decided to ‘go dark,’ cut staff and suspend public reporting company activities to conserve cash in hopes that we could develop a new, streamlined business plan that could be executed with minimal capital requirements.\nHighlights:\nCompany has secured approximately $50 million from a mix of domestic hedge funds and foreign institutional investors to be redeployed to the most promising companies in the cannabis industry. Expects to rapidly become one of the leading providers of growth capital to the cannabis industry, based primarily on its two key competitive advantages: immediate access to capital and the turnaround time in approving and funding new loans New management team used last two years to streamline operations, eliminate majority of long-term obligations to prepare for its debut Expects to announce new management team, company name and ticker symbol shortly as part of transition\nCompany Begins Transition into Pure Cannabis Play\nInterestingly, during this transition period, a historic phenomenon began to take place - - the legalization of cannabis in both the United States and Canada for both medicinal and recreational uses. This single event, which essentially was responsible for the creation of a multi-billion-dollar market overnight, will prove to become one of the most important events in the history of the United States. It will also prove to become one of the greatest financial opportunities offered to the thousands of entrepreneurs that this nation was built on since the days of the gold rush and the dot com era.\nGiven the industry’s rapid emergence as one of the fastest growing markets in the United States, it is also no dark secret that the companies that had first-mover advantage would always be leap years ahead of their competition. And our situation is no different. After a comprehensive analysis of the market and its potential opportunities, we felt that the most lucrative for us would be to help finance and grow what would no doubt develop into thousands of new entrants into the market.\nAccordingly, we formed a Special In-house Committee and delegated one and only one task to them: to develop and begin the implementation of a new business plan that was achievable in the short-run, sustainable in the long-run and had the potential to generate the highest return on invested capital for our shareholders. After a thorough due diligence and vetting process, we unanimously decided that it would be in our best interest to divest the Company of its existing assets to generate the needed cash to pay down nearly all of our debt obligations and even provide for some initial working capital to support our entry into the rapidly growing and very exciting legal cannabis industry, an opportunity that we will no doubt experience only once in a lifetime. However, please do keep in mind that we had to overcome many obstacles to ensure our ability to carve ourselves a small but very lucrative and growing niche in the cannabis industry. These obstacles ranged from the settling of lawsuits stemming from the Company’s former regime to what personally was the most difficult for me - - the laying-off of some of the most loyal and talented employees I have had the pleasure of working with when I initially joined Adaptive Medias. Unfortunately, these were not easy decisions to make but were necessary if we had any hope or aspirations that our shareholders could one day begin recouping their losses from their investment, which based on the market’s reaction is already beginning to show a positive reaction to our new business strategy.\nU.S. Legal Cannabis Market Expected to Exceed $21 Billion by 2021\nAccording to Arcview Market Research , a third-party provider of unbiased research to the cannabis industry, consumer spending on legal cannabis in the U.S. grew by over 34% in 2016 over 2015 and is expected to grow to a new high of over $6.7 billion in 2021. As additional states legalize the use of cannabis, an increasing number of Americans will have access to cannabis. Democratic member, representative Earl Blumenauer noted that, \"More than two-thirds of Americans now live in jurisdictions that have legalized either the medical or adult use of marijuana.\" In addition to dealing with chronic pain, the report indicated that states with legalized medical cannabis have a very easily measurable amount of deaths due to overdosing on other drugs such as opioid painkillers. The report also stated that, \"in November, the journal of the American Association for the Advancement of Science published a study finding that the annual rate of deaths due to overdose on opioid painkillers was nearly 25% lower in states that permitted medical marijuana, and that the effect had grown stronger in the five years after states approved medical marijuana.\"\nAccordingly, we decided to completely shift our business strategy from one that focused on ad-tech to one that would help meet an absolute necessity for any new entrant into this market: access to capital and access at a quicker pace than our competition. While it is very true that the financing of the cannabis industry is not the sexiest or most exciting proposition, it is one of the safest and most secure investments one can make, particularly when considering the almost daily changes and evolving legislations relating to the industry. However, we didn’t stop there. We wanted to make sure that we not only capitalized on this market opportunity but capitalized on it in a significant manner and that’s when we decided to completely divest what was left of Adaptive Medias and form an entirely new entity, which will be announced next week, that should rather quickly solidify its position in the market as a “one-stop-shop” for services ranging from financing to merchandising. And again, the two factors that will enable us to capture the largest percentage of the industry’s market share will be due to immediate access to growth capital and the speed that we can close a loan from inception to funding - - which we believe can be done in as quickly as 20-30 days compared to the industry’s current average pace of over 90 days.\nThrough the implementation of the First Phase of our business plan this month, we a", "external_links": ["https://www.globenewswire.com/Tracker?data=TXdllkRyt9jO15bXoxbG27HuQ_upD-8KpLT310-kV9oVqsdY9jyo34EWvFx6s9VvzeQWUUqWdhD6F-8BKVoncBYM100cRuon-2gZDFrHu5Y=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5a306e11-b881-4406-9190-08c10cb4207a"], "published": "2018-01-12T22:43:00.000+02:00", "crawled": "2018-01-13T01:17:47.001+02:00", "highlightTitle": ""}