{"organizations": [], "uuid": "08d7efe2d746b1b6d3e073dad748bd0146547491", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/indonesia-coal/update-1-indonesia-completes-contract-amendments-with-coal-miners-idUSL3N1PC3GG", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Indonesia completes contract amendments with coal miners", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:48:00.000+02:00", "replies_count": 0, "uuid": "08d7efe2d746b1b6d3e073dad748bd0146547491"}, "author": "", "url": "https://www.reuters.com/article/indonesia-coal/update-1-indonesia-completes-contract-amendments-with-coal-miners-idUSL3N1PC3GG", "ord_in_thread": 0, "title": "UPDATE 1-Indonesia completes contract amendments with coal miners", "locations": [], "entities": {"persons": [{"name": "adaro", "sentiment": "none"}, {"name": "wilda asmarini", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "pt pendopo energi batubara", "sentiment": "none"}, {"name": "pt santan batubara", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pt adaro indonesia", "sentiment": "none"}, {"name": "indika energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:49 AM / Updated 14 minutes ago UPDATE 1-Indonesia completes contract amendments with coal miners Reuters Staff \n(Adds details, context) \nBy Wilda Asmarini \nJAKARTA, Jan 17 (Reuters) - Indonesia’s mining ministry on Wednesday signed amended contracts with 18 coal mining companies, including PT Adaro Indonesia, as part of a shift towards a new mining permit system it expects to boost government revenue. \nIndonesia, the world’s biggest thermal coal exporter, has now amended the contracts of all of its 68 coal mining companies, marking a victory for the government after earlier resistance from some miners to adopt the new terms. \nIndonesia’s 2009 mining law requires companies to transfer from so-called contracts of work, long-term agreements with specific rules including on taxes, to newer special mining permits that generally follow the prevailing law. \nAlong with Adaro, Indonesia’s second-biggest coal miner, the other companies that signed included PT Santan Batubara, a unit of Indika Energy, and PT Pendopo Energi Batubara, a unit of Bumi Resources. \n“With these amendments companies will also benefit in the long run, if we sign while the coal price is high. If (prices are) low, it’s harder to sign,” Minister for Energy and Mineral Resources Ignasius Jonan said at the signing ceremony. \nUnder the amendments, coal mining companies agreed to pay 13.5 percent royalties on coal sales as a cash lump sum. \nWith the amendments, miners will also be able to secure a continuation of rights to their operations up to two years before their current contracts expire, after which they will transfer to special mining permits. \nAmendments for so-called “generation 1” contracts of work also increase land rent to $4 per hectare from $1 per hectare. \nState revenue is expected to rise by around $27 million per year after the amendments of the 18 coal companies and one gold miner PT Indo Muro Kencana, the ministry said. \nIndonesia’s transition from contracts to permits has been rocky and complex, at times throwing the mining sector into turmoil. The changes have sparked several lengthy disputes, including with U.S. giant Freeport Freeport-McMoRan Inc over divestment and other issues related to the new permit. \nFreeport Indonesia, which owns the majority rights to Grasberg, the world’s second-biggest copper mine, has now reached a framework agreement on a new mining permit although issues still need to be ironed out. \nBambang Gatot Ariyono, director general of coal and minerals, said on Wednesday that nine other companies holding contracts of work had yet to sign amendments because there was still no deal yet on state revenue and divestment. (Writing by Ed Davies; Editing by David Evans)", "external_links": [], "published": "2018-01-17T13:48:00.000+02:00", "crawled": "2018-01-17T14:13:16.044+02:00", "highlightTitle": ""}