{"organizations": [], "uuid": "a705c4c4ce3a0679f8db9ee60d6f07f2ec0a8c16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-htc-vive-raises-the-bar-for-premium-vr-with-new-vive-pro-upgrade-and-vive-wireless-adaptor.html", "country": "US", "domain_rank": 767, "title": "HTC VIVE Raises The Bar For Premium VR With New Vive Pro Upgrade And Vive Wireless Adaptor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-09T00:30:00.000+02:00", "replies_count": 0, "uuid": "a705c4c4ce3a0679f8db9ee60d6f07f2ec0a8c16"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-htc-vive-raises-the-bar-for-premium-vr-with-new-vive-pro-upgrade-and-vive-wireless-adaptor.html", "ord_in_thread": 0, "title": "HTC VIVE Raises The Bar For Premium VR With New Vive Pro Upgrade And Vive Wireless Adaptor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Hardware Sets Standard for High-End VR Market, While All-New Viveport VR and Vive Video Dramatically Improves the way you Browse, Discover and Acquire VR Content\nLAS VEGAS, HTC VIVE™, the leader in room-scale Virtual Reality (VR), today announced new hardware upgrades that deliver premium VR experiences to consumers and enterprises with the introduction of Vive Pro and Vive Wireless Adaptor. In addition, the company debuted new improvements in how VR users discover, experience and acquire VR content through a radical redesign of Viveport VR and Vive Video. These advancements deliver on VR users' desire for higher resolution, improved audio, greater comfort, wireless freedom and immersive content discovery.\nVive Pro\nVive Pro is a new HMD upgrade from Vive, built for VR enthusiasts and enterprise users who want the best display and audio for their VR experiences. Vive Pro includes dual-OLED displays for a crisp picture resolution of 2880 x 1600 combined, a 78% increase in resolution over the current Vive HMD.\nThis premium resolution enhances immersion for VR enthusiasts, and the improved clarity means text, graphics and overall experience all come into sharper view. Vive Pro also features integrated, high-performance headphones with a built-in amplifier to offer a heightened sense of presence and an overall richer sound. Vive Pro's new headstrap was built with enhanced ergonomics and comfort, including a sizing dial for a more balanced headset that decreases weight on the front of the headset. Additional improvements include dual microphones with active noise cancellation and dual front-facing cameras designed to empower developer creativity.\n\"There's a clear need in the VR market for a premium VR experience with high resolution display, integrated audio and the best components available today in a headset,\" said Daniel O'Brien, GM U.S., VIVE. \"Vive Pro offers an immediate upgrade for both VR enthusiasts and enterprises that want to utilize the best VR experience.\"\nMore details on Vive Pro availability and price will be made available soon.\nVive Wireless Adaptor\nAlso unveiled today, the Vive Wireless Adaptor will be the first to market with a truly wireless VR headset integration for both Vive and Vive Pro.\nThe Vive Wireless Adaptor features Intel's WiGig technology and offers a premium VR wireless experience that operates in the interference-free 60Ghz band, which means lower latency and better performance. The Vive Wireless Adaptor will ship in Q3 to customers worldwide.\n\"Wireless VR has been on nearly every VR user's wishlist since the technology was unveiled,\" said Frank Soqui, General Manager Virtual Reality Group at Intel Corporation. \"By collaborating with HTC to commercialize Intel's WiGig technology, we will guarantee that wireless VR meets the most discerning quality bar for home users and business VR customers.\"\nViveport VR\nIn the largest upgrade to the Viveport customer experience since launch, Viveport VR redefines how users discover, experience and acquire VR content. Instead of a traditional 2D catalog, Viveport VR content is delivered in fully immersive interactive previews. Viveport is embracing a VR first approach by including VR enabled \"VR Previews,\" which are interactive glimpses of content that give customers a room-scale preview of an experience and the opportunity to interact with content before purchasing or subscribing.\n\"Viveport is moving to a VR first experience model, and with the all-new Viveport VR, we are changing the way consumers discover, experience and acquire VR content,\" said Rikard Steiber, president, Viveport. \"Until now, there has not been a shopping and browsing experience that takes advantage of the full functionality of VR. Available in early access today, Viveport VR increases interaction with content and offers developers a preview that showcases the quality of their titles and experiences.\"\nEarlier this year, Viveport launched the world's first VR subscription service to provide a whole new way to access the best VR experiences for a great price. With more than 1,000 titles available on Viveport today, and more than 325 available for subscription, Vive is changing the way users browse and discover content through Viveport VR.\nVive Video Includes Vimeo\nToday HTC Creative Labs also rolled out an upgrade to its native VR video player, Vive Video. Vive Video solves the discovery and acquisition problem for VR video content by delivering a large catalog of high quality streaming video directly to VR headsets. In addition to new features and UI upgrades, Vive Video has integrated content from Vimeo, the world's largest ad-free open video platform home to millions of creators worldwide.\nIn the new Vive Video experience, a curated selection of Vimeo content will be made available to browse and view in a highly optimized native VR experiences within Vive Video-compatible headsets.\n\"Whether we're building our own tools in-house or partnering with other innovative platforms, Vimeo is committed to the future of storytelling and finding new ways to support our creators,\" said Christophe Gillet, GM of Vimeo's Creator Platform. \"Not only does the integration with Vive Video showcase some of Vimeo's highest quality, human-curated content within the VR experience, but it also gives those creators an exciting new way to expose their work and engage with audiences.\"\nVive Video has consistently been one of the most-downloaded and highest-rated apps on the SteamVR platform, enabling users to view 180 and 360-degree video content. Vive Video is available today for both Vive and Google Daydream platforms, and will arrive on Vive Wave in the near future.\nFor press images and assets for all Vive CES News, please visit: bitly.com/VIVEatCES.\nAbout HTC VIVE\nHTC Vive is the creator of the unprecedented PC-based virtual reality system, the Vive, which was built and optimized for room-scale VR and true-to-life interactions. The Vive ecosystem has evolved around its premium VR product portfolio, supported by Vive X, the most active global VR/AR accelerator that has invested in over 80 start-ups, Viveport, a global content platform with the world's first VR subscription model that operates in more than 60 countries, and Vive Studios, Vive's VR content development and publishing initiative. Vive is delivering on the promise of VR with game-changing technology and best-in-class content, bringing VR to consumers, developers and enterprises alike.\nFor more information on Vive, please visit www.vive.com .\nHTC, the HTC logo are the trademarks of HTC Corporation. All other names of companies and products mentioned herein may be the trademarks of their respective owners.\n with multimedia: releases/htc-vive-raises-the-bar-for-premium-vr-with-new-vive-pro-upgrade-and-vive-wireless-adaptor-300579223.html\nSOURCE HTC VIVE", "external_links": ["http://www.prnewswire.com/news-releases/htc-vive-raises-the-bar-for-premium-vr-with-new-vive-pro-upgrade-and-vive-wireless-adaptor-300579223.html", "http://www.vive.com/", "http://www.bitly.com/VIVEatCES"], "published": "2018-01-09T00:30:00.000+02:00", "crawled": "2018-01-09T09:40:14.890+02:00", "highlightTitle": ""}