{"organizations": [], "uuid": "916f30e4e9871ced94102f9b0e1737e8769e4ea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/26/104242222-GettyImages-492843005.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/dicks-sporting-goods-could-be-a-survivor-like-best-buy.html", "country": "US", "domain_rank": 767, "title": "Dick's Sporting Goods could be a 'survivor' like Best Buy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.953, "site_type": "news", "published": "2018-01-03T18:33:00.000+02:00", "replies_count": 0, "uuid": "916f30e4e9871ced94102f9b0e1737e8769e4ea1"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/03/dicks-sporting-goods-could-be-a-survivor-like-best-buy.html", "ord_in_thread": 0, "title": "Dick's Sporting Goods could be a 'survivor' like Best Buy", "locations": [], "entities": {"persons": [{"name": "dick", "sentiment": "negative"}, {"name": "craig warga", "sentiment": "negative"}, {"name": "boruchow", "sentiment": "none"}, {"name": "ike boruchow", "sentiment": "none"}], "locations": [{"name": "west nyack", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "gander mountain", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "sporting goods", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "dick's sporting goods", "sentiment": "none"}, {"name": "sports authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The sporting goods sector in retail isn't shaping up to be all doom and gloom in 2018, despite some nasty headlines last year.\nWells Fargo on Wednesday upgraded Dick's Sporting Goods to outperform, also raising the firm's price target on shares to $35 apiece, up from $26. The stock closed Tuesday at $29.49, having fallen about 43 percent over the past 12 months.\nWednesday morning, though, shares of Dick's Sporting Goods were up more than 5 percent.\nWells Fargo analyst Ike Boruchow wrote in a note to clients that the outlook for the sporting goods retailer is only \"improving\" from here, as industry trends from a higher level appear to be \"stabilizing\" after a rough few months. And that would be a good thing for Dick's Sporting Goods, the largest retailer in the space, Boruchow explained.\n\"With the consolidation occurring in the sporting goods industry (note recent bankruptcies of Sports Authority, Gander Mountain, etc.), DKS can continue to gobble up market share from struggling brick-and-mortar competitors and be the 'survivor' of the industry's consolidation (bringing to mind Best Buy in the electronics space),\" he added.\nIt's true that, similar to how the consumer electronics space has slimmed down in recent years (with names such as RadioShack and Circuit City going bankrupt), retailers that sell athletic apparel and accessories are now being forced to rethink their strategies, as more brands (such as Nike ) opt to sell directly to consumers, bypassing third-party retailers completely.\nThat's exactly why retailers including Finish Line , Hibbett Sports and Foot Locker were hit so hard in 2017, with Wall Street questioning their ability to survive as brands pull back.\nThere's also the threat of Amazon , which is quietly rolling out more of its own athletic apparel lines and is trying to become more of an online destination for such goods.\nDick's Sporting Goods CEO Edward Stack went as far as saying his sector was in \"panic mode\" toward the end of 2017. \"We are intentionally joining the [retail] battle, and we will aggressively be promoting our business to drive market share to our stores and online,\" Stack told analysts and investors at the time.\nNonetheless, Boruchow, along with a handful of other analysts, is confident Dick's Sporting Goods could be the so-called last man standing, especially as some of the company's longer-term investments take hold. This includes investments in e-commerce and the private-label business, management said on a recent conference call.\n\"We continue to think that DKS will prove to be one of the few retailers to emerge from the digital disintermediation superstorm currently roiling the athletic retail sector, but that 'future DKS' will likely have a lower margin profile and earnings base as the company competes in a much more price transparent world with much higher expectations around consumer experience,\" Evercore ISI analyst Omar Saad wrote in November.\n\"Management is clearly pulling all the levers it deems necessary to secure the long-term viability of the Dick's Sporting Goods franchise,\" Saad added.", "external_links": [], "published": "2018-01-03T18:33:00.000+02:00", "crawled": "2018-01-03T18:34:31.021+02:00", "highlightTitle": ""}