{"organizations": [], "uuid": "bdb50f758fe0ad3aec753847a040107eaa6ef7d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226993264&w=1200&r=LYNXMPEE0U18A", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/trade-nafta-canada/canada-pm-doesnt-think-trump-will-pull-u-s-out-of-nafta-idINKBN1FK2BN", "country": "US", "domain_rank": 408, "title": "Canada PM says doesn't think Trump will pull U.S. out of NAFTA", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:50:00.000+02:00", "replies_count": 0, "uuid": "bdb50f758fe0ad3aec753847a040107eaa6ef7d2"}, "author": "", "url": "https://in.reuters.com/article/trade-nafta-canada/canada-pm-doesnt-think-trump-will-pull-u-s-out-of-nafta-idINKBN1FK2BN", "ord_in_thread": 0, "title": "Canada PM says doesn't think Trump will pull U.S. out of NAFTA", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "justin trudeau", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "trudeau", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "winnipeg", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "canada pm", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  ottawa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - Canadian Prime Minister Justin Trudeau on Wednesday said he did not think U.S. President Donald Trump would pull out of NAFTA, despite slow progress at negotiations to update the $1.2 trillion trade pact.\nTrudeau’s comments were among the most positive made by any Canadian official since talks started last year to revamp the North American Free Trade Agreement, which Trump calls a disaster that killed off many U.S. manufacturing jobs.\nScrapping NAFTA would badly hurt U.S. workers and industries, Trudeau told Winnipeg radio station 680 CJOB.\n“I‘m confident that the President is going to see that and choose to not terminate because it’s not in his or Americans’ best interests to walk away from NAFTA,” he said.\nTrump’s trade chief, speaking on Monday after the sixth of eight rounds of talks, rejected proposals for unblocking the negotiations but promised to seek quick breakthroughs.\nForeign ministers from the United States, Canada and Mexico will meet in Mexico on Friday to discuss the talks and other issues, Ottawa said on Wednesday.\nWork on renegotiating the deal began soon after Trump took office a year ago. He said if it could not be overhauled to better favour U.S. interests and American workers, Washington would pull out.\nThe Trump administration is demanding big changes to the pact, and this has caused tensions with Canada and Mexico.\nTrudeau told 680 CJOB that “there are multiple issues at which point” Canada would not accept a deal.\n“We’ve pushed our American partners on this and they understand that right now,” he said.\nIn his State of the Union speech on Tuesday, Trump said “America has also finally turned the page on decades of unfair trade deals,” but did not mention NAFTA by name.\nTrudeau told the Canadian Broadcasting Corp that Canada has multiple contingency plans in the event Washington does announce it plans to withdraw.\nGovernment sources told Reuters on Jan 10 that Ottawa was increasingly convinced Washington would give notice of withdrawal. The news hit stock markets and the Canadian and Mexican currencies.\nAsked about contingency plans, Trudeau told the CBC “not only do we have a Plan B, we have a Plan C and D and E and F”. He declined to give details.\nTrade Minister Francois-Philippe Champagne says his “Plan B” is diversification. Canada currently sends around 75 percent of all goods exports to the United States.\nReporting by David Ljunggren; Editing by Frances Kerry and Andrew Hay\n ", "external_links": [], "published": "2018-01-31T21:50:00.000+02:00", "crawled": "2018-01-31T22:16:12.037+02:00", "highlightTitle": ""}