{"organizations": [], "uuid": "d873562f571e0e103bf59ba3375795170beb0c0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-power-explainer/explainer-german-electricity-costliest-in-europe-en-route-to-decarbonisation-idUSL8N1PE3TG", "country": "US", "domain_rank": 408, "title": "EXPLAINER-German electricity costliest in Europe en route to decarbonisation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:46:00.000+02:00", "replies_count": 0, "uuid": "d873562f571e0e103bf59ba3375795170beb0c0e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-power-explainer/explainer-german-electricity-costliest-in-europe-en-route-to-decarbonisation-idUSL8N1PE3TG", "ord_in_thread": 0, "title": "EXPLAINER-German electricity costliest in Europe en route to decarbonisation", "locations": [], "entities": {"persons": [], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN, Jan 23 (Reuters) - Germany’s utility industry is gathering between Tuesday and Thursday in Berlin for its annual sector conference, the Handelsblatt energy event, as the country pursues its goal of becoming mostly carbon-free by the middle of the century.\nA major concern is the high cost to consumers. In electricity, the greenest segment with a one-third share of renewables to date, bills are the highest in Europe. Retail prices gained 3 percent last year to set records.\nHOW IS A POWER BILL CONSTRUCTED? The share of state taxes and fees in an end-customer’s bill stands at 55 percent. Within this, the surcharge to fund wind and solar installations under the renewable energy act (EEG) constitutes the biggest element, amounting to half that share.\nOperators last year received 24 billion euros ($29.3 billion) in payments under the EEG in an effort to make them competitive versus conventional energy generation.\nNetwork companies charge consumers 26 percent for investment in and management of networks. They are upping their fees as the share of green power expands and must be expensively transmitted, capped, or supplemented.\nJust under 20 percent of the price can be influenced by competitive factors such as production and retail costs.\nWHY DOES IT MATTER? Industry association BDI sees negative effects on growth, employment and supply security if energy innovation costs continue to spiral higher.\nEnergy-intensive companies competing at a global level say they may switch location if costs become prohibitive.\nSome in the energy industry agree, saying it makes no sense to afford two systems in the long run - one free-floating wholesale power price for fossil fuels and, on the other hand, subsidies.\nUtility group BDEW said the government should “relieve the power price from the ballast of state-induced charges”. But it is split between partial interest groups.\nWHAT CAN/WILL BE DONE ABOUT IT? Not much and nothing soon.\nGovernment reforms are forcing companies bidding for new wind and solar construction permits to compete in auctions, but units constructed in recent years still fall under a rolling 20-year price guarantee.\nThe new government will not immediately do more because it earns value-added taxes from energy for its budget.\nAnalysts warn there must be a system change to redirect billions of euros in subsidies towards carbon savings in areas such as heat provision and road transport. ($1 = 0.8179 euros) (Reporting by Vera Eckert; Editing by Dale Hudson)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T18:46:00.000+02:00", "crawled": "2018-01-24T15:46:06.005+02:00", "highlightTitle": ""}