{"organizations": [], "uuid": "65d6ce05442dd1a596ac903d26cdcbe7408b0a7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218997469&w=1200&r=LYNXMPEE020AZ", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/usa-weather/eastern-u-s-braces-for-winter-storm-as-bitter-cold-remains-idINKBN1ES0GS", "country": "US", "domain_rank": 408, "title": "Eastern U.S. braces for winter storm as bitter cold remains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T10:34:00.000+02:00", "replies_count": 0, "uuid": "65d6ce05442dd1a596ac903d26cdcbe7408b0a7d"}, "author": "", "url": "https://in.reuters.com/article/usa-weather/eastern-u-s-braces-for-winter-storm-as-bitter-cold-remains-idINKBN1ES0GS", "ord_in_thread": 0, "title": "Eastern U.S. braces for winter storm as bitter cold remains", "locations": [], "entities": {"persons": [{"name": "brendan o'brien", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "eastern u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s southeast", "sentiment": "none"}, {"name": "southern virginia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york state thruway", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLESTON, S.C. (Reuters) - A rare winter storm hit the U.S. Southeast on Wednesday, bringing Florida’s capital its first snow in three decades and snarling travel, while New England braced for a “bombogenesis” whopper forecast to bring heavy accumulations on Thursday.\nA woman stops to photograph the frozen Josephine Shaw Lowell Memorial Fountain in New York, U.S., January 3, 2018. REUTERS/Lucas Jackson Governors in states from Florida to Virginia warned residents to expect icy roads and unseasonable freezing temperatures. Georgia Governor Nathan Deal declared a state of emergency in part of the state, while Florida Governor Rick Scott ordered warming shelters opened for residents.\nIn historic Charleston, South Carolina, the winter storm shuttered carriage horse tour companies on Wednesday, city spokesman Jack O‘Toole said. A day earlier, a carriage horse slipped and fell on a patch of ice during a tour.\nResidents in nearby Mount Pleasant, South Carolina, on Tuesday headed to grocery stores in droves to stock up on food and supplies at local groceries, according to Nicholas Nichols, an employee at Publix grocery store.\n“They did restock last night. They were here until 4 in the morning,” Nichols said.\nThe wintry mix and low wind chills could cause widespread power outages and leave roads icy, making commuting treacherous for millions of Americans from northern Florida to southern Virginia, the National Weather Service said in a series of warnings.\nSome schools and universities in those states were closed on Wednesday in anticipation of the storm. Many flights out of the Savannah/Hilton Head International Airport in Georgia and Tallahassee Airport in Florida were canceled.\nThe weather service said its Tallahassee office measured a snow and sleet accumulation of 0.1 inch (2.5mm) on its roof early in the day, the first time Florida’s capital has had snow in nearly 30 years.\nA pedestrian crosses a street on a frigid morning as the sun rises in New York, U.S., January 3, 2018. REUTERS/Lucas Jackson Two to 3 inches (5-8 cm) of snow were expected in northeastern Florida, coastal Georgia and South Carolina, according to early morning forecasts, said weather service meteorologist Bob Oravec.\nSome Florida and Georgia residents shared images on social media of light snow accumulating.\nSlideshow (4 Images) ‘BOMBOGENESIS’\nThe weather service had blizzard warnings in effect from Virginia to Maine, with areas around Boston expected to see about a foot (30 cm) of snow on Thursday. Forecasters warned that snow would fall quickly, at a rate of several inches per hour, during the day, with the storm intensified by the “bombogenesis” effect, according to private forecaster Accuweather.\nThat effect, also known as a “bomb cyclone,” was first described in a 1980 scientific paper by the late Fred Sanders, a professor at the Massachusetts Institute of Technology. It occurs when a storm’s barometric pressure drops by 24 millibars in 24 hours, greatly strengthening the storm.\nFlorida Governor Scott said cold weather shelters have either opened or would be opened in 22 of the state’s 67 counties.\nSome coastal areas of Georgia, South Carolina, North Carolina and Virginia could ultimately receive up to 6 inches (15 cm) of snow and ice, while parts of New England could see 12 to 15 inches (30-38 cm) of snow and wind gusts of 35 miles per hour (55 km per hour) by the end of week, the weather service said.\nAn arctic air mass will remain entrenched over the eastern two-thirds of the United States through the end of the week, forecasters said. The record-low temperatures were to blame for at least eight deaths in Texas, Wisconsin, West Virginia, North Dakota and Michigan over the past several days, officials said.\nReporting by Brendan O'Brien in Milwaukee and Harriet McLeod in Charleston, South Carolina; Additional reporting by Gina Cherelus in New York and Scott Malone in Boston; Editing by Jeremy Gaunt and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-03T10:34:00.000+02:00", "crawled": "2018-01-03T10:54:36.004+02:00", "highlightTitle": ""}