{"organizations": [], "uuid": "9a10f08d16b1cb5ac9f1bf0aa755ba634f14c05d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/carillion-restructuring-hs2/britain-reassures-on-high-speed-rail-project-after-carillions-collapse-idUSL8N1PA3YT", "country": "US", "domain_rank": 408, "title": "Britain reassures on high-speed rail project after Carillion's collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T17:43:00.000+02:00", "replies_count": 0, "uuid": "9a10f08d16b1cb5ac9f1bf0aa755ba634f14c05d"}, "author": "", "url": "https://www.reuters.com/article/carillion-restructuring-hs2/britain-reassures-on-high-speed-rail-project-after-carillions-collapse-idUSL8N1PA3YT", "ord_in_thread": 0, "title": "Britain reassures on high-speed rail project after Carillion's collapse", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "negative"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 3:43 PM / Updated 25 minutes ago Britain reassures on high-speed rail project after Carillion's collapse Reuters Staff \n* Decision to award Carillion HS2 contract criticised \n* Joint-venture partners to deliver rail contract - PM spokesman \n* High speed rail has already seen costs rise \nLONDON, Jan 15 (Reuters) - Britain said on Monday that the country’s multi-billion pound rail project High Speed 2 would be delivered despite the collapse of Carillion, one of the contractors charged with its delivery. \nCarillion’s failure creates a fresh problem for HS2, which has been beset by rising costs and vehement opposition from environmental campaigners and some lawmakers. \nCarillion entered compulsory liquidation on Monday in one of the biggest British corporate failures in recent years, marking the end of the road for an infrastructure giant which held hundreds of public contracts. \nThe government drew sharp criticism for awarding two major HS2 contracts to joint ventures that featured Carillion last July, just a week after the firm issued the first of three profit warnings in 2017. \nA spokesman for Prime Minister Theresa May said the government had been told by Carillion’s joint venture partners, Kier Group and Eiffage, that both firms remained committed to the project. \n“The companies’ boards have both given assurances and confirmed that they will underwrite the performance of each other in delivering the contract,” May’s spokesman told reporters. “HS2 is not at risk as a result of this, it will be delivered.” \nThe high-speed train line will run through the countryside to connect London to Birmingham in central England and the northern cities of Manchester and Leeds. \nKier said that contingency plans were in place to deliver HS2 and it did not expect to suffer an adverse financial impact as a result of Carillion’s liquidation. Officials at Eiffage were not immediately available for comment. \nHowever, critics of the infrastructure programme said that the failure of Carillion would inevitably lead to higher costs and a delay to the project. \nThe expected cost of HS2 has already increased by over 20 billion pounds ($27.6 bln) since 2012, and is now expected to cost 56 billion pounds. \n“You cannot conceivably see how a contractor that was awarded the project on a low-cost basis is going to be replaced by someone who is going to do it for the same price or cheaper,” Joe Rukin, campaign manager for pressure group Stop HS2, said. \n“The award was symptomatic of the mismanagement of HS2 from the start. Carillion should never have got this award in the first place ... everyone in the construction industry knew that they were in trouble.” $1 = 0.7247 pounds Reporting by Alistair Smout and Elizabeth Piper; Additional reporting by Sudip Kar-Gupta; Editing by Susan Fenton", "external_links": [], "published": "2018-01-15T17:43:00.000+02:00", "crawled": "2018-01-15T18:05:20.024+02:00", "highlightTitle": ""}