{"organizations": [], "uuid": "36a4740d2117fe4952f7b4cd3bf76b5cbdd259d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-btig-expands-fixed-income-credit-expertise-with-new-hires.html", "country": "US", "domain_rank": 767, "title": "BTIG Expands Fixed Income Credit Expertise with New Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "36a4740d2117fe4952f7b4cd3bf76b5cbdd259d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-btig-expands-fixed-income-credit-expertise-with-new-hires.html", "ord_in_thread": 0, "title": "BTIG Expands Fixed Income Credit Expertise with New Hires", "locations": [], "entities": {"persons": [{"name": "richard siegel", "sentiment": "negative"}, {"name": "scott gourlay", "sentiment": "negative"}, {"name": "christopher ellis", "sentiment": "negative"}, {"name": "michael zitani", "sentiment": "negative"}, {"name": "anton leroy", "sentiment": "none"}, {"name": "zitani", "sentiment": "none"}, {"name": "siegel", "sentiment": "none"}, {"name": "ellis", "sentiment": "none"}, {"name": "gourlay", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "btig fixed income credit", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Firm Adds Christopher Ellis, Scott Gourlay, Richard Siegel and Michael Zitani\nNEW YORK--(BUSINESS WIRE)-- BTIG, LLC announced today that Christopher Ellis , Scott Gourlay , Richard Siegel and Michael Zitani have joined the firm in New York to further bolster its Fixed Income Credit team of sales, trading, sourcing and strategy professionals. As an experienced sourcer, Mr. Ellis will capitalize on client opportunities across bankruptcies, restructurings and liquidations, including trade claims and other special situations. Mr. Siegel and Mr. Gourlay will enhance BTIG’s high-yield sales force. Mr. Zitani will focus on offering liability management for fixed income clients.\n“Richard, Chris, Michael and Scott are welcome additions and important hires for the firm,” said Anton LeRoy, Chief Operating Officer of BTIG. “With their considerable sales, sourcing and liability management experience, they will strengthen BTIG’s Fixed Income Credit platform.”\nMr. Ellis joins BTIG Fixed Income Credit as a Managing Director. He has more than a decade of industry experience, sourcing and trading distressed credit. Prior to BTIG, Mr. Ellis was an Executive Director within Global Event-Driven Credit at UBS. He spent a majority of his career at Goldman Sachs within the Distressed and Bank Loans Proprietary divisions.\nMr. Gourlay joins BTIG Fixed Income Credit as a Director. Prior to BTIG, he spent five years as a Managing Director within Fixed Income Credit at Seaport Global. Previously, Mr. Gourlay held similar Fixed Income Credit roles including Director at FBR, and Analyst at GMP Securities.\nMr. Siegel joins BTIG Fixed Income Credit as a Managing Director. Prior to BTIG, he was a Managing Director within Distressed and High-Yield Sales and Trading at Stifel. Previously, Mr. Siegel held a similar position at Knight Capital. Earlier in his career, he held several senior sales and trading roles at Credit Suisse, UBS and Bear Stearns.\nMr. Zitani joins BTIG Fixed Income Credit as a Director. Prior to BTIG, he was a Vice President within High-Yield Credit Sales at Jefferies, where he spent more than seven years. Mr. Zitani began his career in Fixed Income Operations at UBS.\n“Over the last year, we have aggressively expanded the team, and our footprint in the fixed income credit marketplace,” commented Darren Haines, Co-Head of Fixed Income Credit at BTIG. “BTIG continues to attract quality professionals across trading, sales and banking. In the months ahead, we plan to hire several more individuals to enhance the credit business.”\nBTIG focuses on increasing issue flow and improving execution quality for an array of corporate and institutional investor clients across the credit spectrum.\nAbout BTIG\nBTIG is a global financial services firm specializing in institutional trading, investment banking, research and related brokerage services. With an extensive global footprint and more than 550 employees, BTIG, LLC and its affiliates operate out of 17 cities throughout the U.S., and in Europe, Asia and Australia. BTIG offers execution, expertise and insights for equities, equity derivatives, ETFs and fixed income, currency and commodities (futures, commodities, foreign exchange, interest rates, credit, and convertible and preferred securities). The firm’s core capabilities include global execution, portfolio, electronic and outsource trading, transition management, investment banking, prime brokerage, capital introduction, corporate access, research and strategy, commission management and more.\nTo learn more about BTIG, visit https://www.btig.com/ .\nDisclaimer: https://www.btig.com/Disclaimer.aspx\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005666/en/\nFor BTIG\nMedia:\nJill Gordon, 212.279.3115 x226\njgordon@prosek.com\nor\nAmanda Gold, 212.738.6134\nagold@btig.com\nSource: BTIG", "external_links": ["http://www.businesswire.com/news/home/20180117005666/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.btig.com%2F&esheet=51744506&newsitemid=20180117005666&lan=en-US&anchor=https%3A%2F%2Fwww.btig.com%2F&index=2&md5=6315e8b781bae0c3f736b1be59d8a10a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.btig.com%2FDisclaimer.aspx&esheet=51744506&newsitemid=20180117005666&lan=en-US&anchor=https%3A%2F%2Fwww.btig.com%2FDisclaimer.aspx&index=3&md5=21e9ea7baad9651278f3962ce3c88d62", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.btig.com%2F&esheet=51744506&newsitemid=20180117005666&lan=en-US&anchor=BTIG%2C+LLC&index=1&md5=c3c9bcca6a2f44e80771e970a15e073a", "https://www.btig.com/Disclaimer.aspx", "https://www.btig.com/"], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:36:41.002+02:00", "highlightTitle": ""}