{"organizations": [], "uuid": "d841992316f019a5eb821d91755af0030ce3c3fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-xoma-strengthens-leadership-team-with-appointments-of-chief-business-officer-and-general-counsel.html", "country": "US", "domain_rank": 767, "title": "XOMA Strengthens Leadership Team with Appointments of Chief Business Officer and General Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "d841992316f019a5eb821d91755af0030ce3c3fe"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-xoma-strengthens-leadership-team-with-appointments-of-chief-business-officer-and-general-counsel.html", "ord_in_thread": 0, "title": "XOMA Strengthens Leadership Team with Appointments of Chief Business Officer and General Counsel", "locations": [], "entities": {"persons": [{"name": "danny", "sentiment": "none"}, {"name": "previousl", "sentiment": "none"}, {"name": "danny hart", "sentiment": "none"}, {"name": "dee datta", "sentiment": "none"}, {"name": "datta", "sentiment": "none"}, {"name": "hart", "sentiment": "none"}, {"name": "jim neal", "sentiment": "none"}], "locations": [{"name": "emeryville", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "xoma", "sentiment": "negative"}, {"name": "xoma corporation", "sentiment": "negative"}, {"name": "forty seven, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EMERYVILLE, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- XOMA Corporation (Nasdaq:XOMA), a pioneer in the discovery, development and licensing of therapeutic antibodies, today announced the appointments of Dee Datta, Ph.D., as Chief Business Officer and Danny Hart as Vice President, General Counsel. Dr. Datta and Mr. Hart will report to XOMA’s Chief Executive Officer, Jim Neal.\n“Dee and Danny bring significant value to XOMA’s team as we continue to execute on our transformation into a royalty aggregator,” stated Jim Neal, Chief Executive Officer of XOMA. “Their expertise and experience will be invaluable as we expand our portfolio to drive revenue growth and create value for shareholders. We are excited they have chosen to join our team.”\nDr. Datta brings extensive leadership experience in business development, alternative financing strategies and corporate strategy. Prior to joining XOMA, Dr. Datta served as Vice President of Corporate Development at Forty Seven, Inc., where she managed business development, strategy and transactions, company financing and investor relations. Previously, Dr. Datta was the Senior Director of Business Development at XOMA. During her time at XOMA, she successfully closed multiple transactions, including licensing deals with Novartis and Novo Nordisk. Earlier in her career, Dr. Datta was a venture capitalist at The Column Group and Longitude Capital. As an investor, she has experience in alternative financing strategies, such as royalty monetization, in addition to formation and management of portfolio companies. Dr. Datta received her Ph.D. from California Institute of Technology and M.B.A. from Stanford University Graduate School of Business.\nMr. Hart brings a breadth of knowledge in corporate governance, securities law compliance, and mergers and acquisitions. Prior to joining XOMA, Mr. Hart was Vice President, Business Development at PDL BioPharma, Inc. (PDL), where he focused on the company’s investment activity by identifying, evaluating, structuring and completing alternative, non-dilutive financing investments (structured debt, synthetic royalty, royalty monetization) for late-stage pharmaceutical, device and diagnostic companies. Mr. Hart also served in various legal capacities at PDL, where he led PDL’s transactional efforts, completing over $1 billion in investment transactions during his tenure at PDL. Previously, Mr. Hart was an associate with Hogan & Hartson LLP (now Hogan Lovells US LLP), where his practice focused on securities, corporate governance and mergers and acquisitions, and he started his legal career at Skadden, Arps, Slate, Meagher & Flom LLP. Mr. Hart received his J.D. from Vanderbilt Law School and B.A. from the University of Washington in Seattle.\nAbout XOMA Corporation\nXOMA has built a portfolio of over two dozen products that are licensed to and being developed by other biotech and pharmaceutical companies. The Company’s portfolio of fully-funded programs spans multiple stages of the drug development process and across various therapeutic areas. Many of these licenses are the result of the Company's pioneering efforts in the discovery and development of antibody therapeutics. XOMA’s license portfolio has the potential to generate significant milestone payments and royalty revenue in the future. For more information, visit www.xoma.com .\nCertain statements contained in this press release are within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, including statements regarding the potential of XOMA’s portfolio of partnered programs and licensed technologies generating substantial milestone and royalty proceeds over time. These statements are based on assumptions that may not prove accurate, and actual results could differ materially from those anticipated due to certain risks inherent in the biotechnology industry and for companies engaged in the development of new products in a regulated market. Potential risks to XOMA meeting these expectations are described in more detail in XOMA's most recent filing on Form 10-K and in other SEC filings. Consider such risks carefully when considering XOMA's prospects. Any forward-looking statement in this press release represents XOMA's views only as of the date of this press release and should not be relied upon as representing its views as of any subsequent date. XOMA disclaims any obligation to update any forward-looking statement, except as required by applicable law.\nInvestor contact:\nLuke Heagle\nPure Communications\n+1 910-726-1372\nlheagle@purecommunications.com\nMedia contact:\nJulie Normart\nPure Communications\n+1 415-946-1087\njnormart@purecommunications.com\nSource:XOMA Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=AbujXHAQKjPegKqAL4fYIjhy3F2LsyWqUxJUuL9m9BW88JDwPnBmI_W_NwNPcVmxufFA8zpHh9T_KST33NQn7u5Ybrj764oCZGxMl_kkeTwYZPseaK4wDxDOjQZPoaTLwFm_FDrwzwCRJrMW70-JVbderCcoiFAVVPQd5Xj-2VS38Re1EwXcsVct43JcueNViELMx3EwVBKTuz-Qi4lkrYGqJSOt_2iOU5Q28c8vvz4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/34238cc4-fde6-4d9b-baba-b210eb5123a1"], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:19:27.001+02:00", "highlightTitle": ""}