{"organizations": [], "uuid": "a6f6a614e8a9fd387ffa55152aa0f333981c98dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224373264&w=1200&r=LYNXMPEE0M08N", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-latam-economy-poll/trust-in-latin-americas-growth-outlook-strengthens-poll-idUSKBN1FC0HB", "country": "US", "domain_rank": 408, "title": "Trust in Latin America's growth outlook strengthens: poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T13:58:00.000+02:00", "replies_count": 0, "uuid": "a6f6a614e8a9fd387ffa55152aa0f333981c98dd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-latam-economy-poll/trust-in-latin-americas-growth-outlook-strengthens-poll-idUSKBN1FC0HB", "ord_in_thread": 0, "title": "Trust in Latin America's growth outlook strengthens: poll", "locations": [], "entities": {"persons": [{"name": "alberto ramos", "sentiment": "none"}], "locations": [{"name": "brasilia", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA (Reuters) - Economists’ confidence in Latin America’s prospects is strengthening ahead of major elections in the region as global growth accelerates, the latest Reuters survey found.\nFor all but one of the region’s major economies, respondents either increased or maintained their growth forecasts from the previous poll in October.\nThe sole exception was Mexico, where interest rates are likely to remain high for longer than previously anticipated. Concerns over U.S. protectionism and a nationalist presidential candidate have weighed on the peso, stoking fears of faster inflation.\nOverall, however, loose monetary policies in rich countries have been lifting global growth estimates, despite geopolitical tensions in North Korea and the Middle East.\n“Growth momentum had previously been restricted to developed economies, but now emerging economies are joining in,” Goldman Sachs economist Alberto Ramos said. “While local factors, particularly elections, should still matter a great deal, the baseline for growth now seems higher.”\nTake Brazil, for instance.\nLatin America’s largest economy is likely to grow 2.5 percent in 2018, up from a previous median forecast of 2.3 percent, according to the survey conducted between Jan. 9 and 22.\nFor 2019, the economists raised their outlook for gross domestic product growth to 2.8 percent from 2.5 percent.\nThat optimism follows a faster-than-expected recovery in Brazil last year as record-low interest rates and slow inflation propped up consumer spending.\nMost economists expected the upswing to continue in coming years, with investment slowly increasing after last year’s much-awaited revival as companies fill up idle capacity.\nBut sustained growth also hinges on policymakers’ ability to tackle public debt, cut social security spending and implement unpopular pro-market policies, the respondents said.\nWith President Michel Temer’s approval rating at single digits, that burden will largely fall on the winner of the most wide-open and hard-to-predict presidential elections in decades.\n“We cannot rule out an alternative scenario where political and fiscal risks materialize, bringing the recovery to an end and perhaps even generating a new economic crisis,” BBVA economists led by Juan Manuel Ruiz wrote in a report.\nFormer President Luiz Inácio Lula da Silva has been leading polls, but he could be barred from running if a higher court upholds his conviction for corruption this week.\nBelow him, the field is split among various potential candidates, from law-and-order Congressman Jair Bolsonaro to businessman-turned-mayor João Doria and nationalist Ciro Gomes.\nCAUTION ABOUT MEXICO Expectations of solid economic growth seem to be widespread throughout the region. The poll showed Chile and Colombia both expanding 3.0 percent in 2019, in line with the previous survey, while respondents raised their forecast for Peru’s growth next year to 4.0 percent from 3.8 percent.\nBut economists cut their outlook for Mexico’s GDP increase to 2.1 percent in 2018 and 2.3 percent for 2019, down 0.1 percentage point from the previous polls for both years.\nThis would be the first time the region’s No. 2 economy would lag Brazil’s since 2013 and suggests it is more vulnerable to local problems than its peers.\nUncertainty surrounding negotiations of the North American Free Trade Agreement and the 2018 elections appear to be driving caution among economists.\nA Reuters poll showed most economists expected NAFTA to undergo only marginal changes despite threats by U.S. President Donald Trump to scrap the treaty that underpins more than $1 trillion per year in trade among the United States, Canada and Mexico.\nStill, Mexico’s peso is likely to suffer as the negotiations drag on, lifting inflation and forcing the central bank to keep rates high.\nConcerns that front-runner candidate Andres Manuel López Obrador’s nationalist platform stokes tensions with Trump’s administration should also prompt investors to seek protection in the U.S. dollar, economists said.\nIn a recent survey of foreign exchange strategists, Grupo Banorte forecast the peso would probably weaken ahead of the presidential vote then rebound in a relief rally.\n(For other stories from the Reuters global long-term economic outlook polls package:)\nReporting by Bruno Federowski; Editing by Lisa Von Ahn\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T13:58:00.000+02:00", "crawled": "2018-01-24T15:23:09.019+02:00", "highlightTitle": ""}