{"organizations": [], "uuid": "14fd5b4cb8f8e65545b7dcdc8a87c45cca8c3517", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-asure-software-closes-three-strategic-acquisitions-and-provides-2018-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "Asure Software Closes Three Strategic Acquisitions and Provides 2018 Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.185, "site_type": "news", "published": "2018-01-02T17:00:00.000+02:00", "replies_count": 0, "uuid": "14fd5b4cb8f8e65545b7dcdc8a87c45cca8c3517"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-asure-software-closes-three-strategic-acquisitions-and-provides-2018-financial-guidance.html", "ord_in_thread": 0, "title": "Asure Software Closes Three Strategic Acquisitions and Provides 2018 Financial Guidance", "locations": [], "entities": {"persons": [{"name": "pat goepel", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "telepayroll inc.", "sentiment": "none"}, {"name": "savers administrative services, inc.", "sentiment": "none"}, {"name": "asure software", "sentiment": "none"}, {"name": "human capital management", "sentiment": "none"}, {"name": "pay systems of america, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Asure Software, Inc. (NASDAQ:ASUR), a leading provider of Human Capital Management (HCM) and workplace management software, has closed three strategic acquisitions and provided financial guidance for the fiscal year ending December 31, 2018.\nOn January 2, 2018, Asure Software closed three strategic acquisitions: TelePayroll Inc., a Southern California-based provider of HR, payroll and employee benefits services; Pay Systems of America, Inc., a provider of HR, payroll and employee benefits services; and Savers Administrative Services, Inc., a certified third-party administrator of payroll and HR services. All three companies are current resellers of Asure's leading Human Resource Information System platform, Evolution.\n“These acquisitions are consistent with our strategy to augment our solid organic topline growth with select accretive acquisitions of service bureaus already using our software,” said Asure CEO, Pat Goepel. “In addition to building on our momentum of successfully taking advantage of the multi-million-dollar service bureau consolidation opportunity, these new acquisitions provide us with significant customer, product and financial synergies. In particular, they expand Asure’s footprint across the U.S., giving us greater coverage nationwide, especially on the West Coast with our acquisition of TelePayroll. Savers Administrative marks our entry into the Carolinas, while our acquisition of Pay Systems of America solidifies our expansion into the Southeast, a region where we’ve had increasing success. Given that all three service bureaus have been resellers of our leading HCM solutions, we are confident that we can quickly and effectively integrate these acquisitions into our business, and be able to achieve meaningful revenue and EBITDA improvements in 2018.”\nThe acquisitions are expected to generate approximately $13 million of revenue, in aggregate, in 2018.\nFinancial Outlook\n“We finished 2017 on a strong note and have established good momentum to start the new year,” added Goepel. “Following these acquisitions, we are updating and expanding the 2018 financial construct that we reaffirmed in November, which was to reach between $70.0 million and $80.0 million of revenue, with non-GAAP EBITDA, excluding one-time items, of between $16.0 million and $20.0 million. For fiscal 2018, we now expect to achieve revenue of between $78.0 million and $81.0 million, and non-GAAP EBITDA, excluding one-time items, of between $18.0 million and $20.0 million.\n“Looking ahead, we are focused on our key growth initiatives, including accelerating the velocity of our cross-selling opportunities and scaling our business both organically and through strategic acquisitions. Thanks to our overall growth and profitable track record, we are ideally positioned to capitalize on the robust pipeline of opportunities in front of us and remain focused on achieving our mid-term goal of surpassing $100 million in revenue along with non-GAAP EBITDA margins of between 22% to 25%.”\n*Non-GAAP Financial Measures\nThis press release includes the following financial measure defined as non-GAAP financial measures by the Securities and Exchange Commission: EBITDA, excluding one time expenses. This supplemental financial measure is not required by GAAP, nor is the presentation of this financial information intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP. Management recognizes that non-GAAP financial measures have limitations in that they do not reflect all of the expenses associated with Asure's earnings results as determined in accordance with GAAP. However, for the reasons described below, management uses these non-GAAP measures to evaluate the performance of Asure's business. Asure's management believes that it is important to provide investors with these same tools, together with reconciliation to GAAP, for evaluating the performance of Asure's business, as it may provide additional insight into Asure's financial results. See the \"Reconciliation of GAAP Net Income/(Loss) to EBITDA Excluding One-Time Expenses\" table included in this press release for further information regarding these non-GAAP financial measures. In addition, these measures are presented because management believes they are frequently used by securities analysts, investors and others in the evaluation of companies.\nEBITDA, excluding one time expenses, is calculated by adding income taxes, interest expense, depreciation and amortization and stock compensation expense to net earnings and excluding certain expenses that management believes to be one time in nature and are not expected to recur on a dollar or per share basis. EBITDA is not defined under GAAP and should not be considered in isolation or as a substitute for net earnings and other consolidated earnings data prepared in accordance with GAAP or as a measure of Asure's profitability.\nGuidance\nReconciliation of GAAP Net Income (Loss) to EBITDA Excluding One-time Expenses:\n$000s Fiscal 2018 Net Income (Loss) $ (1,500 ) to $ (2,000 ) Interest 7,500 to 8,000 Tax 500 to 1,000 Depreciation and Amortization 2,400 to 2,800 Amortization of Acquisition Related Intangibles 6,400 to 6,800 Stock Compensation 700 to 900 EBITDA 16,000 to 17,500 One-time expenses 2,000 to 2,500 EBITDA excluding one-time expenses $ 18,000 to $ 20,000 About Asure Software\nAsure Software, Inc., headquartered in Austin, Texas, offers intuitive and innovative solutions designed to help organizations of all sizes and complexities build companies of the future. Our cloud platforms enable more than 80,000 clients worldwide to better manage their people and space in a mobile, digital, multi-generational, and global workplace. Asure Software’s offerings include a fully-integrated HCM platform, flexible benefits and compliance administration, HR consulting, and time and labor management as well as a full suite of workspace management solutions for conference room scheduling, desk sharing programs, and real estate optimization. For more information, please visit www.asuresoftware.com\nForward-Looking Statements\nThe forward-looking statements in this press release are made under the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Actual results could differ materially from those indicated by forward-looking statements because of various risks and uncertainties, including those described in Asure’s filings and reports with the Securities and Exchange Commission. When used in this press release, the words “believes,” “plans,” “expects,” “will,” “intends,” “estimates” and “anticipates” and similar expressions are intended to identify forward-looking statements. Except as required by law, Asure is not obligated to update any forward-looking statements to reflect events or circumstances that occur after the date of this press release or to reflect the occurrence of unanticipated events.\nCompany Contact:\nStacy Zellner, Director of Marketing\n888-323-8835 x 3111\nszellner@asuresoftware.com\nInvestor Contact:\nMatt Glover\nLiolios Group, Inc.\n949-574-3860\nASUR@liolios.com\nSource:Asure Software Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=ol_YWZY-TZrsxMEpB8BXFfvpJd9tOJIjzBfUheFjWyYLNa-695_TbsbzeWoUXyN5rCfmntTfwj5gaN9wBwg7_wac97MC0E3yWby7dpdqIn7PrdzjmvGHZoylEco2P799", "https://www.globenewswire.com/Tracker?data=h-IJtzgMz6hrcqBlaHKPIcffNh4-XjC7A87Hdwpbh8N1J8G6k-T1h4-6xtMwPmeK8F7M-8FcOjHvCVbTkUEtwwEY2YM3Eivq-JrvcX8xrq0=", "https://www.globenewswire.com/Tracker?data=zhJMDr2bpaEAj1g9w7tDXCLv3C88o1BlXbkdMXMGkFKcwRkgMuZvsEKmv94Xl8ALAFx1BkJjhDHrU2tueQUOPthQZCmX3J_I4dovKYeoz94=", "https://www.globenewswire.com/Tracker?data=a2Pgj2_qFN90XYuJrgznBLG8tk7JQo5n_x5qlRAQFtwhjCOjqDzQAkAyr2VH2uRcqVmRYNpcRaIkMHkK7Dxtrg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f0d54d70-d9a3-484b-ae82-9a5fe9935c75"], "published": "2018-01-02T17:00:00.000+02:00", "crawled": "2018-01-02T16:23:01.010+02:00", "highlightTitle": ""}