{"organizations": [], "uuid": "5439840c1a6e1a43eaa28a6e8c8cc5f5824b37c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-plexus-announces-fiscal-first-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Plexus Announces Fiscal First Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.32, "site_type": "news", "published": "2018-01-18T00:15:00.000+02:00", "replies_count": 0, "uuid": "5439840c1a6e1a43eaa28a6e8c8cc5f5824b37c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-plexus-announces-fiscal-first-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "Plexus Announces Fiscal First Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "neenah", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "negative"}, {"name": "roic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fiscal first quarter 2018 record revenue of $677 million GAAP diluted loss per share of $2.93; non-GAAP adjusted diluted EPS of $0.75, excluding $3.59 per share of tax expense due to the estimated impact of the U.S. Tax Cuts & Jobs Act (“U.S. Tax Reform”) Initiates fiscal second quarter 2018 revenue guidance of $670 to $710 million with GAAP diluted EPS of $0.68 to $0.78, excluding any additional impact related to U.S. Tax Reform\nNEENAH, Wis., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Plexus (NASDAQ:PLXS) today announced financial results for its fiscal first quarter ended December 30, 2017, and guidance for its fiscal second quarter ending March 31, 2018.\nThree Months Ended Dec 30, 2017 Dec 30, 2017 Mar 31, 2018 Q1F18 Results Q1F18 Guidance Q2F18 Guidance Summary GAAP Items Revenue (in millions) $677 $665 to $705 $670 to $710 Operating margin 4.7 % 4.6% to 5.0% 4.3% to 4.7% Diluted (loss) earnings per share (1) $(2.93 ) $0.75 to $0.85 $0.68 to $0.78 Summary Non-GAAP Items (2) Adjusted diluted EPS (3) $0.75 Return on invested capital (ROIC) 16.2 % Economic Return 6.7 % (1 ) Includes stock-based compensation expense of $0.11 for Q1F18 results and $0.13 for Q2F18 guidance and $3.59 per share of tax expense in Q1F18 related to the effects of U.S. Tax Reform\n(2 ) Refer to Non-GAAP Supplemental Information in Tables 1 and 2 for non-GAAP financial measures discussed in this release, such as adjusted diluted EPS, ROIC and Economic Return, and a reconciliation of these measures to GAAP\n(3 ) Includes stock-based compensation expense of $0.11 and excludes $3.59 per share of tax expense related to the effects of U.S. Tax Reform\nFiscal First Quarter 2018 Information\nWon 44 manufacturing programs during the quarter representing approximately $200 million in annualized revenue when fully ramped into production Trailing four quarter wins total approximately $794 million in annualized revenue when fully ramped into production Purchased $9.5 million of our shares at an average price of $60.25 per share $125 million of estimated tax expense related to U.S. Tax Reform\nTodd Kelsey, President and CEO, commented, “We achieved record revenue of $677 million in our fiscal first quarter of 2018. We again delivered operating margin within our target range of 4.7% to 5.0%, resulting in fiscal first quarter 2018 non-GAAP EPS of $0.75. We incurred $125 million of tax expense as a consequence of U.S. Tax Reform, negatively impacting our GAAP diluted EPS. Despite the large tax charge, we view the reform as immensely beneficial for Plexus as it provides us the opportunity to efficiently access our global cash. Therefore, we are refining our capital allocation philosophy and plan, which we will share within the coming months.”\nPatrick Jermain, Senior Vice President and CFO, commented, “During the fiscal first quarter we generated $52 million in free cash flow, a result well above our projections. Fiscal first quarter cash cycle of 67 days was favorable to our expectations as we benefitted from progress on our working capital initiatives. As we look forward to the fiscal second quarter, we expect cash outflows of $30 to $50 million to support higher capital spending and working capital investments necessary for anticipated growth. With this in mind, we still project free cash flow for fiscal 2018 to exceed $100 million.” Mr. Jermain concluded, “We ended the quarter with a cash balance of $507 million, of which approximately 90% is held offshore. With the recent U.S. Tax Reform, we look forward to deploying this cash in the best interests of our stakeholders.”\nMr. Kelsey continued, “Looking forward, we anticipate continued sequential revenue growth as we benefit from new program ramps and improving end markets. As a result, we are guiding fiscal second quarter 2018 revenue in the range of $670 to $710 million. While we are working diligently to maintain our operating margin within our target range, we expect our margins to be under pressure in the current quarter due to multiple program ramps and seasonal payroll headwinds. We are guiding GAAP EPS in the range of $0.68 to $0.78 for the fiscal second quarter 2018, exclusive of any additional impact related to U.S. Tax Reform.”\nMr. Kelsey concluded, “Our revenue outlook for the remainder of fiscal 2018 continues to strengthen. We currently expect growth across each of our market sectors, which would lead to double-digit revenue growth overall. In addition, we anticipate operating margin within our target range for each of the final two quarters of the fiscal year.”\nQuarterly Comparison Three Months Ended Dec 30, 2017 Sept 30, 2017 Dec 31, 2016 (in thousands, except EPS) Q1F18 Q4F17 Q1F17 Revenue $ 677,294 $ 669,852 $ 635,019 Gross profit 63,523 66,514 64,356 Operating income 31,557 33,965 33,903 Net (loss) income (98,493 ) 29,009 28,179 Diluted (loss) earnings per share $ (2.93 ) $ 0.84 $ 0.82 Adjusted net income* 26,019 29,009 28,179 Adjusted diluted EPS* $ 0.75 $ 0.84 $ 0.82 Gross margin 9.4 % 9.9 % 10.1 % Operating margin 4.7 % 5.1 % 5.3 % ROIC* 16.2 % 16.2 % 17.3 % Economic Return* 6.7 % 5.7 % 6.8 % *Refer to Non-GAAP Supplemental Information Tables 1 and 2 for a reconciliation to GAAP measures. Business Segment and Market Sector Revenue\nThe Company measures operational performance and allocates resources on a geographic segment basis. Plexus also reports revenue based on the market sector breakout set forth in the table below, which reflects the Company’s global market sector focused business development strategy. Top 10 customers comprised 58% of revenue during the quarter, up three percentage points from the fiscal fourth quarter of 2017.\nBusiness Segments ($ in millions) Three Months Ended Dec 30, 2017 Sept 30, 2017 Dec 31, 2016 Q1F18 Q4F17 Q1F17 Americas $ 299 314 $ 315 Asia-Pacific 346 334 310 Europe, Middle East, and Africa 64 55 39 Elimination of inter-segment sales (32 ) (33 ) (29 ) Total Revenue $ 677 $ 670 $ 635\nMarket Sectors ($ in millions) Three Months Ended Dec 30, 2017 Sept 30, 2017 Dec 31, 2016 Q1F18 Q4F17 Q1F17 Healthcare/Life Sciences $ 237 35% $ 233 35% $ 211 33% Industrial/Commercial 207 30% 189 28% 206 32% Communications 133 20% 140 21% 131 21% Aerospace/Defense 100 15% 108 16% 87 14% Total Revenue $ 677 $ 670 $ 635 Non-GAAP Supplemental Information\nPlexus provides non-GAAP supplemental information, such as ROIC, Economic Return, and free cash flow, because such measures are used for internal management goals and decision making, and because they provide management and investors additional insight into financial performance. In addition, management uses these and other non-GAAP measures, such as adjusted net income, adjusted earnings per share and adjusted operating margin, to provide a better understanding of core performance for purposes of period-to-period comparisons. Plexus believes that these measures are also useful to investors because they provide further insight by eliminating the effect of items, such as the effects of U.S. Tax Reform, that are not reflective of continuing operations. For a full reconciliation of non-GAAP measures to comparable GAAP measures, please refer to Non-GAAP Supplemen", "external_links": ["https://plexus.gcs-web.com/events-and-presentations/upcoming-events", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e08ffcce-3e4d-499a-8341-7f56f971157d", "https://www.globenewswire.com/Tracker?data=eGBlEwXBL0qSkZREqLUqM1pNK2-OGg6nSLEjGn1_1ES1RXDL7y8txBy3OgCyzOJSUjbUH3GVhBZziXcT9nr9_intCk_wwylwlxbJW_HA2ZE="], "published": "2018-01-18T00:15:00.000+02:00", "crawled": "2018-01-18T00:37:48.002+02:00", "highlightTitle": ""}