{"organizations": [], "uuid": "0350bf29e7a9df8c86fe2c278fddb8f15c317949", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-mafia-china/italy-breaks-up-chinese-crime-ring-involved-in-drugs-prostitution-idUSKBN1F724K", "country": "US", "domain_rank": 408, "title": "Italy breaks up Chinese crime ring involved in drugs, prostitution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:33:00.000+02:00", "replies_count": 0, "uuid": "0350bf29e7a9df8c86fe2c278fddb8f15c317949"}, "author": "", "url": "https://www.reuters.com/article/us-italy-mafia-china/italy-breaks-up-chinese-crime-ring-involved-in-drugs-prostitution-idUSKBN1F724K", "ord_in_thread": 0, "title": "Italy breaks up Chinese crime ring involved in drugs, prostitution", "locations": [], "entities": {"persons": [{"name": "zhang nai zhong", "sentiment": "none"}, {"name": "zhong", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "neuss", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "prato", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "padua", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 3:33 PM / Updated 7 minutes ago Italy breaks up Chinese crime ring involved in drugs, prostitution Reuters Staff 3 Min Read \nFLORENCE, Italy (Reuters) - Italy ordered the arrest of 33 people on Thursday on suspicion of running a Chinese mafia group involved in gambling, prostitution, and drugs and which dominated the transport of Chinese goods across Europe. \nThe group’s base was in Prato, near Florence, a hub for the textile industry where many factories are owned and run by Chinese, police said in a statement. \nBut the network had members in other parts of Italy and across Europe, with arrests sought in Rome, Milan, Padua, Paris, Madrid and Neuss, Germany, the statement said. Police did not say how many had been arrested so far. \nThey are accused of being members of a mafia organization and other crimes. \nThe suspected boss, Zhang Nai Zhong, was based in Rome. He used profit from illegal activities to build a massive transport company that dominated the trucking of goods for thousands of Chinese companies, police said. \nZhong had won a near-monopoly in distribution through threats and violence against Chinese company owners, anti-mafia prosecutors said. The investigation, called “China Truck”, began in 2011. \nThe operation broke up “a dangerous organization that had used force to take control of trucking, and was financed by its illegal activities,” Italian Interior Minister Marco Minniti said in a statement. \nItaly has a long history of home-grown organized crime, including the Sicilian Mafia and the Calabrian ‘Ndrangheta, but immigration to Europe has opened the way for foreign crime groups to take root, including the Nigerian and Chinese mafias. \n“Being able to shed light on mafia character of this group is almost incredible,” Federico Cafiero De Raho, Italy’s chief anti-mafia prosecutor, told a news conference. “It’s quite unusual to be able to identify a complex Chinese mafia organization.” \nInvestigators said Zhong emerged the winner of a conflict between rival Chinese gangs in which some 40 people were thought to have been murdered between 2005-2010. They estimated the group’s business activities were worth “hundreds of millions of euros”. \nApart from the arrests, prosecutors seized eight companies and an equal number of vehicles and “a few” millions of euros. Reporting by Silvia Ognibene in Florence, Writing by Steve Scherer in Rome, Editing by Angus MacSwan", "external_links": [], "published": "2018-01-18T17:33:00.000+02:00", "crawled": "2018-01-18T17:49:29.004+02:00", "highlightTitle": ""}