{"organizations": [], "uuid": "cce3507324fd569d84071e5ca4502f524044c568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-recros-medica-closes-9m-financing-strengthens-board.html", "country": "US", "domain_rank": 767, "title": "Recros Medica Closes $9M Financing, Strengthens Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:50:00.000+02:00", "replies_count": 0, "uuid": "cce3507324fd569d84071e5ca4502f524044c568"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-recros-medica-closes-9m-financing-strengthens-board.html", "ord_in_thread": 0, "title": "Recros Medica Closes $9M Financing, Strengthens Board", "locations": [], "entities": {"persons": [{"name": "mark kerslake", "sentiment": "none"}, {"name": "westphal", "sentiment": "none"}, {"name": "christoph westphal", "sentiment": "none"}, {"name": "tom albright", "sentiment": "none"}, {"name": "verastem", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "recros medica", "sentiment": "negative"}, {"name": "recros medica, inc.", "sentiment": "neutral"}, {"name": "longwood fund", "sentiment": "none"}, {"name": "alnylam", "sentiment": "none"}, {"name": "momenta", "sentiment": "none"}, {"name": "sirtris", "sentiment": "none"}, {"name": "acceleron pharmaceuticals", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 4, 2018 /PRNewswire/ -- Recros Medica, Inc., a development stage medical aesthetic device company focused on reducing skin laxity and focal contouring, announced today that it has closed a $9M financing. Additionally, the company is strengthening its Board of Directors with the additions of Christoph Westphal, MD, PhD and Mark Kerslake.\n\"We are grateful for the additional financial resources to expand our company and accelerate our product and clinical development programs. This financing, which includes an investment from the prestigious Longwood Fund, underscores the potential of our technology platforms in the rapidly growing aesthetics market,\" stated Tom Albright, President and CEO of Recros Medica.\nDr. Westphal is a co-founder and Partner of the Longwood Fund. Dr. Westphal was co-founder, CEO, and lead investor of six biotech companies that have completed IPOs: Momenta, Alnylam, Acceleron Pharmaceuticals, Sirtris (acquired by GSK), Verastem, and Flex. He co-founded two additional companies that completed IPOs: Concert Pharmaceuticals, and OvaScience. He also co-founded Alnara (acquired by Lilly), and Axial. Dr. Westphal's companies have created substantial shareholder value, with aggregate market capitalizations of over $15 billion, and have contributed to the creation of over 1,000 jobs. Dr. Westphal earned his M.D. from Harvard Medical School and Ph.D. in genetics from Harvard University.\nMr. Kerslake is Principal of the Province Group, a Newport Beach, CA real estate development and investment company active in the acquisition, entitlement, management, and disposition of residential and mixed-use real estate projects in multiple states. Mr. Kerslake has considerable experience in transactional structuring, financial engineering and high-level negotiations with buyers, sellers, lenders and institutional financial partners. Mr. Kerslake holds a MBA from UCLA.\n\"Adding Christoph and Mark to our Board, with their significant business expertise and financial acumen, will enhance our ability to properly execute the strategic vision of this innovative company,\" said David F. Hale, Chairman of the Board of Recros Medica.\nAbout Recros Medica, Inc.\nRecros Medica was co-founded in 2014 by Dr. Edward Knowlton, the board-certified plastic surgeon who invented and founded Thermage. Dr. Knowlton's newest invention, Rotational Fractional Resection, is a platform technology for use by Dermatologists, Plastic Surgeons and other aesthetic physicians that treat skin laxity and focal aesthetic contour deformities. Recros Medica is the winner of the 2017 OCTANe Launchpad award as the most compelling medical device startup in S. California. http://www.marketwired.com/press-release/octane-sees-record-attendance-at-medical-technology-innovation-forum-2239312.htm .\nAbout Longwood Fund\nLongwood Fund is one of the top-performing healthcare venture capital firms that founds, manages, and builds healthcare companies. Longwood's mission is to identify technologies and found companies that make a difference in the lives of patients, and also create significant value for investors. The Longwood team has a consistent, long history of successfully launching and building leading healthcare companies and providing operational leadership and strategic guidance. Christoph Westphal MD, PhD, has served as co-founder, CEO, and lead investor of six companies (including Alnylam, Acceleron, Sirtris, and Momenta) that have completed IPOs, yielding an aggregate, sustained, value of over $15 billion. Rich Aldrich was a co-founder of Vertex Pharmaceuticals, which currently has a market capitalization of over $36 billion. www.longwoodfund.com\nContact:\nKathy Scott\nCFO\n858-252-6434\nkscott@recrosmedica.com\nView original content: http://www.prnewswire.com/news-releases/recros-medica-closes-9m-financing-strengthens-board-300576731.html\nSOURCE Recros Medica", "external_links": ["http://www.prnewswire.com/news-releases/recros-medica-closes-9m-financing-strengthens-board-300576731.html", "http://www.longwoodfund.com/", "http://www.marketwired.com/press-release/octane-sees-record-attendance-at-medical-technology-innovation-forum-2239312.htm"], "published": "2018-01-04T16:50:00.000+02:00", "crawled": "2018-01-04T16:44:50.036+02:00", "highlightTitle": ""}