{"organizations": [], "uuid": "68f08c64c211be548496538c3a35bafcdd5cef5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937164-GettyImages-899453118.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/asia-markets-focus-on-currencies-and-china-inflation.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Focus on currencies and China inflation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T02:44:00.000+02:00", "replies_count": 0, "uuid": "68f08c64c211be548496538c3a35bafcdd5cef5e"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/09/asia-markets-focus-on-currencies-and-china-inflation.html", "ord_in_thread": 0, "title": "Asia markets: Focus on currencies and China inflation", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most major Asian markets trade lower, but Hong Kong shines Major Asian markets edged lower on Wednesday, despite a solid lead from Wall Street Hong Kong's Hang Seng Index closed higher for the 12th straight day The yield on the 10-year U.S. Treasury note rose to a nine-month high after the Bank of Japan trimmed its bond purchases on Tuesday China's consumer inflation rose 1.8 percent on-year in December while producer prices climbed 4.9 percent, Reuters reported CNBC.com SHARES \nMajor Asian markets closed mostly lower on Wednesday despite a solid lead from Wall Street overnight, but Hong Kong stocks bucked the trend and closed higher for a 12th straight day. \nIn Japan, the Nikkei 225 declined 0.26 percent, or 61.79 points, to close at 23,788.2, despite broad gains across auto stocks and financial plays. Major automakers closed with gains: Toyota rose 2.19 percent, Honda was up 2.29 percent and Mitsubishi Motors added 2.54 percent. Banking stocks were also up with Sumitomo Mitsui Financial Group adding 1.71 percent and Mitsubishi UFJ up 1.55 percent on the day. Energy names also traded higher with Inpex shares gaining 2.09 percent. \nBut shares of SoftBank and Fast Retailing — two heavily-weighted names on the Nikkei stock average — closed down 0.5 percent and 1.24 percent, respectively. Symbol CNBC 100 --- \nOver in Seoul, the benchmark Kospi index edged down 0.42 percent to end at 2,499.75. Shares of tech giant Samsung Electronics fell 3.1 percent Wednesday by the end of the session. The stock declined on Tuesday on the back of a weaker-than-expected fourth-quarter profit guidance , prompting concerns about the business outlook for its semiconductor business. Rival memory chip maker SK Hynix tumbled 5.2 percent. \nAustralia's S&P/ASX 200 shed 0.64 percent to finish at 6,096.7 as most sectors recorded losses. The gold subindex saw the steepest decline, down 2.04 percent, as miners struggled: Newcrest shares fell 2.33 percent, Evolution Mining was down 1.97 percent and Kingsgate tumbled 5.06 percent. Major miners also saw losses on the day, with Rio Tinto closing 0.76 percent lower. \nMajor banking stocks closed mixed as ANZ shares slipping 0.48 percent and Westpac shares rising 0.16 percent. \nHong Kong's Hang Seng index rose 0.2 percent to close at 31,073.72, its 12th straight session of gains. The index was also less than 900 points away from its all-time high of 31,958.41, which was set in 2007. \nThe Shanghai composite ended the session higher by 0.24 percent at 3,422.14. Meanwhile, the Shenzhen composite traded down 0.33 percent to end at 1,945.66. \nThe moves followed price data out of the country : Consumer inflation in China rose 1.8 percent on-year in December, which was a touch lower than the market's expectations, while the producer price index topped predictions to climb 4.9 percent on-year, according to Reuters. \nU.S. stocks closed higher on Tuesday in the lead up to earnings season kicking off later this week, with investors positive about the upcoming release of fourth-quarter results. Major U.S. banks, including J.P. Morgan , are set to report on Friday. \nThe Dow Jones industrial average rose 0.41 percent, or 102.8 points, to close at 25,385.8. U.S. Treasury yields higher \nThe yield on the 10-year U.S. Treasury note rose to a nine-month high overnight after the Bank of Japan on Tuesday moved to slightly reduce its long-dated Japanese government bond purchases . \n\"Although the decrease [from the BOJ] was modest, it broadens the number of global policymakers stepping away from the markets,\" Kathy Lien, managing director of FX strategy at BK Asset Management, said in a note. \nThe 10-year yield last stood at 2.56 percent. Yen firmer after BOJ trims purchases \nIn currencies, the Japanese yen traded at 111.90 to the dollar at 4:03 p.m. HK/SIN. That compared to levels around the 113 handle seen earlier this week before the BOJ's Tuesday move to slightly trim its purchases of Japanese government bonds. \nMeanwhile, the dollar index traded at 92.435 against a basket of currencies. \nOn the commodities front, oil prices extended gains seen on Tuesday. U.S. crude futures rose 0.73 percent to trade at $63.42 a barrel and Brent crude added 0.42 percent to $69.11. Corporate news \nToyota announced in a Tuesday statement that it would recall around 601,300 more vehicles in the U.S. due to safety issues related to Takata air bag inflators. The affected air bags have already been associated with at least 20 deaths, Reuters said. \nMeanwhile, dealings in shares of Glencore on the Hong Kong market are set to cease on Wednesday after the miner announced last year it would de-list from the Hong Kong Exchange. In a statement last October, Glencore said its Hong Kong-listed shares accounted for 0.3 percent of its total issued share capital. The de-listing is expected to be effective Jan. 31.", "external_links": [], "published": "2018-01-10T02:44:00.000+02:00", "crawled": "2018-01-10T02:01:22.000+02:00", "highlightTitle": ""}