{"organizations": [], "uuid": "cdf151bb203aef176bf6c99ac7392e64cf8b3108", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222432788&w=1200&r=LYNXMPEE0F0Y0", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange-report/indonesia-exchange-walkway-collapse-due-to-building-failure-initial-report-idUSKBN1F51NL", "country": "US", "domain_rank": 408, "title": "Indonesia exchange walkway collapse due to 'building failure': initial report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:51:00.000+02:00", "replies_count": 0, "uuid": "cdf151bb203aef176bf6c99ac7392e64cf8b3108"}, "author": "", "url": "https://www.reuters.com/article/us-indonesia-stock-exchange-report/indonesia-exchange-walkway-collapse-due-to-building-failure-initial-report-idUSKBN1F51NL", "ord_in_thread": 0, "title": "Indonesia exchange walkway collapse due to 'building failure': initial report", "locations": [], "entities": {"persons": [{"name": "tabita diela", "sentiment": "none"}], "locations": [{"name": "indonesia", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "min read  jakarta", "sentiment": "none"}, {"name": "agustinus beo da costa", "sentiment": "none"}, {"name": "indonesian stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:51 PM / Updated 10 minutes ago Indonesia exchange walkway collapse due to 'building failure': initial report Tabita Diela , Agustinus Beo Da Costa 5 Min Read \nJAKARTA (Reuters) - Loose or corroded joints may have caused the sudden collapse of a mezzanine floor at the Indonesian Stock Exchange building this week that sent visiting students plunging to the ground, a preliminary report by the public works ministry has found. \nMore than 70 people were injured in Monday’s incident, which was captured on dramatic CCTV footage that showed a walkway giving way under the students, some of whom were trapped beneath slabs of concrete and other debris. \nThe accident in Jakarta’s plush financial district has shocked even a country that is used to natural and manmade disasters and where safety standards are often loosely enforced. \nThe ministry’s report said the suspended walkway fell because several cables broke away from the ceiling due to a “concentration of weight” in one spot where nearly 100 university students visiting the exchange had gathered. \n“The burden could not be borne by the ... structure and triggered a building failure,” said the report, which was reviewed by Reuters on Tuesday. \nThe initial conclusion was that the collapse may have been caused by “loose or corroded bolts” or “shearing joints”. \nThe report said the walkway was part of the original structure, built in the late 1990s, and not added later. \nThe public works ministry said its report was based on interviews with building management, visual observations and analysis of CCTV footage on social media, but added that its team did not have direct access to the site. \n“Further and closer observation is required on-site, and of construction documents,” it said. \nThe public works ministry’s press department said in a statement: “We would like to convey that this report is a preliminary report of the results of a review by ministry staff, that is unofficial.” \nThe high-rise building is part of a two-tower complex owned and developed by PT Danayasa Arthatama Tbk, part of Artha Graha group. It houses dozens of offices, including the World Bank’s Indonesia branch. \nA company spokesman had earlier declined to comment on the incident. No one from the company could immediately be reached for comment on the findings of the preliminary report. \n“NO WARNING” \nFor some of the 92 accounting students, who had arrived hours earlier from Palembang city on the island of Sumatra to take a study tour of the stock exchange, it felt like a powerful earthquake. \nOne said that the students, aware of Jakarta’s notorious traffic jams, arrived early and were looking for a Muslim prayer room before beginning their tour. Many had plans to fly to the resort island of Bali for a holiday after their trip to Jakarta. \n“I thought it was an earthquake and I screamed when I saw many of my friends bleeding and covered with dust,” said Betride Septiani, 21. “We didn’t feel any signs like the floor swaying or anything, it was all just so sudden.” \nCCTV footage that was aired on television and spread widely on social media showed a floor shearing away in a few seconds under the group. \nSeptiani landed on her back one-story below but suffered only minor injuries. Other students fainted or suffered broken bones and concussion and are being treated in hospital. COMBING THE SITE \nA forensics police team was combing the site for clues about why the walkway collapsed and interviewing building management on Tuesday. \nThe complex was the target of a car bombing by Islamist militants in September 2000. Police have ruled out a bomb as a cause of Monday’s collapse. \nThe second tower was reopened for business on Tuesday and authorities were aiming to reopen the tower where the incident happened on Wednesday. \nOne expert said the preliminary report had “reasonable conclusions” and that such incidents can be difficult to predict. \n“It may be because of degradation of materials over time and because of earthquakes, and to prevent that we would have to develop more foolproof materials and connections,” said Davy Sukamta, head of the Indonesian society of civil and structural engineers. \n“If a building has a special construction like this, it must be inspected more regularly for wear and tear.” Reporting by Tabita Diela and Agustinus Beo Da Costa; Additional reporting by Fransiska Nangoy and Kanupriya Kapoor; Writing by Kanupriya Kapoor; Editing by Ed Davies and Alex Richardson", "external_links": [], "published": "2018-01-16T15:51:00.000+02:00", "crawled": "2018-01-16T16:08:13.017+02:00", "highlightTitle": ""}