{"organizations": [], "uuid": "135ce9a8a31b2ecc3097642d13b26747bb88873c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/rtx327wf.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/mitt-romney-responds-sen-orrin-hatch-retirement-2018/", "country": "US", "domain_rank": 1196, "title": "Mitt Romney Responds to Sen. Orrin Hatch Retirement Announcement | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "135ce9a8a31b2ecc3097642d13b26747bb88873c"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/02/mitt-romney-responds-sen-orrin-hatch-retirement-2018/", "ord_in_thread": 0, "title": "Mitt Romney Responds to Sen. Orrin Hatch Retirement Announcement | Fortune", "locations": [], "entities": {"persons": [{"name": "sarah gray", "sentiment": "negative"}, {"name": "orrin hatch", "sentiment": "negative"}, {"name": "mitt romney", "sentiment": "negative"}, {"name": "orrin g. hatch", "sentiment": "none"}, {"name": "hatch", "sentiment": "none"}, {"name": "romney", "sentiment": "none"}], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 2, 2018 \nSen. Orrin Hatch (R-Utah) announced on Tuesday that he would retire at the end of his term this year, leaving the door open to former Massachusetts governor and Republican presidential nominee Mitt Romney to seek the open seat. \nRomney, who has not revealed his plans, responded on Facebook to Hatch’s announcement, saying, “I join the people of Utah in thanking my friend, Senator Orrin Hatch for his more than forty years of service to our great state and nation.” \nSen. Hatch made his announcement in a video posted to Twitter, where he listed moments he was proud of from his tenure in the Senate, including passing the massive tax overhaul last month. Hatch, 83, is the longest-serving Senate Republican. \n“I’ve always been a fighter,” Hatch said in the statement. “I was an amateur boxer in my youth, and I brought that fighting spirit with me to Washington. But every good fighter knows when to hang up the gloves.” An announcement from Senator Orrin G. Hatch. #utpol pic.twitter.com/UeItaLjR3j \n— Senator Hatch Office (@senorrinhatch) January 2, 2018 \nIn a scathing op-ed published at the end of 2017, the Salt Lake Tribune ‘s editorial board named him “Utahn of the Year,” a distinction that the paper awards to a person who, “has made the most news. Has had the biggest impact. For good or for ill.” \nBeyond criticizing him for the reduction of the Bears Ears and Grand Staircase-Escalante National Monuments in Utah and for his role in the tax bill, the editorial also took issue with the fact that he was rumored to be running again in 2018, calling it “basically a theft from the Utah electorate.” \nPresident Donald Trump had encouraged Hatch to run again, possibly to block Romney from seeking the seat. Romney was critical of Trump during the 2016 campaign, during which he called Trump “a phony, a fraud,” but later someone reconciled while briefly being considered for Secretary of State. \nRomney’s full statement is below: \n“I join the people of Utah in thanking my friend, Senator Orrin Hatch for his more than forty years of service to our great state and nation. As Chairman of the Senate Finance and Judiciary Committees and as the longest-serving Republican Senator in U.S. history, Senator Hatch has represented the interests of Utah with distinction and honor. Ann and I wish Senator Orrin Hatch and his loving wife Elaine all the best in their future endeavors.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T02:00:00.000+02:00", "crawled": "2018-01-03T04:11:58.003+02:00", "highlightTitle": ""}