{"organizations": [], "uuid": "d909ed04c40f7b9a23a88b9e7833659d2990f023", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 35, "shares": 35, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221537120&w=1200&r=LYNXMPEE0B1FK", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-cocoa-cameroon/cameroon-farmers-abandon-cocoa-plantations-amid-crackdown-idUSKBN1F11T2", "country": "US", "domain_rank": 408, "title": "Cameroon farmers abandon cocoa plantations amid crackdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T03:42:00.000+02:00", "replies_count": 0, "uuid": "d909ed04c40f7b9a23a88b9e7833659d2990f023"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cocoa-cameroon/cameroon-farmers-abandon-cocoa-plantations-amid-crackdown-idUSKBN1F11T2", "ord_in_thread": 0, "title": "Cameroon farmers abandon cocoa plantations amid crackdown", "locations": [], "entities": {"persons": [], "locations": [{"name": "cameroon", "sentiment": "none"}, {"name": "southwest region", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "northwest", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MAMFE, Cameroon (Reuters) - Thousands of cocoa farmers have fled violence between separatists and security forces in Cameroon’s Southwest Region, which grows more than 100,000 tonnes of beans, nearly half of the country’s output, farmers and buyers told Reuters.\nThey said the clashes could put a dent in output from the world’s fifth largest cocoa producer, which is already seeing production dip compared to last season due to poor weather.\nThe crisis in Francophone-dominated Cameroon’s minority English-speaking Southwest and Northwest regions has worsened over the past year in reaction to a violent government crackdown on demonstrations by the Anglophones.\nThe government ordered residents of 16 villages in the region to leave their homes early last month as it launched a military operation against the separatists.\nOthers have fled on their own, often to larger towns. More than 15,000 have fled to Nigeria, the United Nations refugee agency and Nigerian government officials said on Thursday.\nThe repression has breathed new life into a once-fringe separatist movement that in October unilaterally declared independence for a breakaway state known as Ambazonia.\n“In the beginning, I thought the situation would calm down. But the shooting continued. I abandoned two hectares of cocoa and I fled,” said Peter, a farmer from the village of Kembong who declined to give his surname out of fear of reprisals.\nPeter fled Kembong, a stronghold of the independence movement hours after separatists killed four paramilitary gendarmes there last month.\nWorkers fill a sack with cocoa beans in Ntui village, Cameroon, December 16, 2017. Picture taken December 16, 2017. REUTERS/Ange Aboa He spoke to Reuters in Mamfe, one of the main towns in the area, where he had sought refuge.\n“I’d already dried nine sacks of cocoa. I left everything to flee, even the cocoa pods are still on my plantation,” John Mfor, another farmer, told Reuters.\nThe Southwest Region is home to Cameroon’s most productive growing zones, producing just under half of the Central African nation’s 230,000 tonnes a year output.\nFour farmers, an upcountry buyer and an exporter told Reuters that output from areas affected by the violence had dropped, but gave no figures.\nTotal cocoa arrivals at the port of Douala, Cameroon’s main export point, were down around 20 percent by mid-December compared to last season, exporters said.\nWhile they said poor weather conditions were largely to blame, they also pointed to the separatist unrest as likely compounding the shortfall.\n“Since the start of the crisis, the buyers are afraid to come here. The farmers have fled,” said Etienne Tanyi, an Olam purchasing agent based in the village of Omogoko.\n“The cocoa is rotting in the bush.”\nWriting by Ange Aboa and Joe Bavier; Editing by Tim Cocks\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T03:42:00.000+02:00", "crawled": "2018-01-13T06:47:56.052+02:00", "highlightTitle": ""}