{"organizations": [], "uuid": "75e391ed949104842f4b7ed41b275f924e16df85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-1-new-york-new-jersey-connecticut-to-sue-over-federal-tax-law.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-New York, New Jersey, Connecticut to sue over federal tax law", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:28:00.000+02:00", "replies_count": 0, "uuid": "75e391ed949104842f4b7ed41b275f924e16df85"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-1-new-york-new-jersey-connecticut-to-sue-over-federal-tax-law.html", "ord_in_thread": 0, "title": "UPDATE 1-New York, New Jersey, Connecticut to sue over federal tax law", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "cuomo", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "jerry brown", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments from governors, context, background)\nNEW YORK, Jan 26 (Reuters) - The governors of New York, New Jersey and Connecticut said on Friday that they had formed a coalition to sue the federal government to challenge the constitutionality of the federal tax overhaul signed into law in December.\nThe governors said during a call with reporters that the bill unfairly affects their states with its repeal of state and local tax deductibility, the first federal double taxation in U.S. history.\nNew York Governor Andrew Cuomo said there were \"very strong\" arguments that the bill violates states' rights as well as the Equal Protection clause in the U.S. Constitution.\n\"The top 12 states that get hurt (by the bill) coincidentally all happen to be Democratic states,\" Cuomo said, adding he had spoken with California Governor Jerry Brown about potential actions against the bill.\nThe sweeping Republican tax bill signed into law by U.S. President Donald Trump introduced a $10,000 cap on deductions of state and local income and property taxes, known as SALT.\nThe SALT provision will affect many taxpayers in states with high incomes, property values and taxes, including New York, New Jersey, Connecticut and California.\nNew Jersey Governor Phil Murphy, a Democrat sworn in earlier this month, said the states' lawsuit against the bill could be filed in a \"matter of a couple weeks.\"\n\"We believe substantively there is a very strong case and the more like-minded states who join us I think the better our shot,\" Murphy said.\nJoseph Callahan, a tax and business attorney with the law firm Mackay, Caswell & Callahan in New York, said the states have a strong argument against the federal government.\n\"The concept of banding together in a multi-state coalition has been utilized in the past,\" Callahan said. \"The vehicle they are using is an appropriate vehicle, and the constitutional arguments that they raise are solid arguments.\"\nDavid Kamin, a professor at New York University's School of Law, said a court case of this kind was \"unlikely to succeed.\"\n\"Courts have often said that deductions come at the grace of Congress,\" Kamin said. \"Until now courts have in general given relatively broad discretion to Congress as to how to measure income in an income tax system.\"\nSELLING THE CONCEPT\nBesides legal action, Cuomo has outlined other ways New York State could offset the new tax law, including creating opportunities for charitable deductions and shifting the state to a payroll tax.\nCalifornia, Illinois, Nebraska, Virginia and Washington are considering legislation that would allow taxpayers to donate to state funds and receive a dollar-for-dollar tax credit in return.\nStates are also considering repealing their state income taxes and replacing them with an employer-paid payroll tax. The payroll taxes are still deductible by companies under the new federal tax law.\nThe expectation is employers would essentially pay taxes for their employees, and lower wages by the same amount, Cuomo explained in a speech earlier this month.\nNew Jersey Governor Murphy called the potential switch to a payroll tax \"quite compelling\" and added that using charitable deductions has \"real merit.\"\n(Reporting by Stephanie Kelly; Editing by Daniel Bases and Lisa Shumaker)", "external_links": [], "published": "2018-01-27T00:28:00.000+02:00", "crawled": "2018-01-27T07:45:56.015+02:00", "highlightTitle": ""}