{"organizations": [], "uuid": "0132c4d404cd18dd56038d6d3221a2947c5172e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-camping-world-holdings-announces-initial-list-of-gander-outdoors-retail-store-locations-scheduled-to-open-in-2018.html", "country": "US", "domain_rank": 767, "title": "Camping World Holdings Announces Initial List of Gander Outdoors Retail Store Locations Scheduled to Open in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.807, "site_type": "news", "published": "2018-01-04T16:15:00.000+02:00", "replies_count": 0, "uuid": "0132c4d404cd18dd56038d6d3221a2947c5172e9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-camping-world-holdings-announces-initial-list-of-gander-outdoors-retail-store-locations-scheduled-to-open-in-2018.html", "ord_in_thread": 0, "title": "Camping World Holdings Announces Initial List of Gander Outdoors Retail Store Locations Scheduled to Open in 2018", "locations": [], "entities": {"persons": [{"name": "marcus lemonis", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "gander mountain", "sentiment": "none"}, {"name": "bloomington", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}, {"name": "camping world holdings, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LINCOLNSHIRE, Ill.--(BUSINESS WIRE)-- Gander Outdoors, formerly known as Gander Mountain, today announced the initial list of retail stores that are scheduled to open in 2018. Camping World Holdings, Inc. (NYSE: CWH) (“Camping World”), was chosen as the winning bidder at a bankruptcy auction for certain acquired assets of Gander Mountain and the sale was approved in a bankruptcy court hearing in May 2017. Camping World is beginning to reopen many of the Gander Outdoors stores to serve customers who are passionate about hunting, fishing, marine and water sports, camping, and active and shooting sports, and will provide outdoor enthusiasts with regionally and seasonally relevant products and services that are competitively priced.\n“It was important to me to bring Gander Outdoors back to many wonderful communities across the country because the employees are top notch and the stores provide great products and services for the community,” said Marcus Lemonis, Chairman of Camping World Holdings. “Our great team at the headquarters in Bloomington, MN has been working tirelessly over the past 6 months to get the locations prepared and we are extremely excited to begin the rapid opening process and hope to open all locations this spring.”\nLemonis previously stated his intention of operating stores with a clear path to profitability. He also shared the goal of operating seventy or more locations subject to, among other things, the ability to negotiate acceptable lease terms with landlords. Following months of negotiations and remodeling existing locations, the company plans to open 69 locations by May 2018. The following locations will reopen under the new Gander Outdoors brand with a fresh offering of Gander Outdoors, Overton’s and Camping World products and services. (In order by state, not reopening sequence):\n1. Florence, AL\n2. Opelika, AL\n3. Parker, CO\n4. Ocala, FL\n5. Pensacola, FL\n6. St. Augustine, FL\n7. Tampa, FL\n8. Albany, GA\n9. Cedar Rapids, IA\n10. O’Fallon, IL\n11. Peoria, IL\n12. Rockford, IL\n13. Springfield, IL\n14. Ft. Wayne, IN\n15. Greenfield, IN\n16. Indianapolis (Castleton), IN\n17. Wichita, KS\n18. Bowling Green, KY\n19. Paducah, KY\n20. Coldwater, MI\n21. Flint, MI\n22. Kalamazoo, MI\n23. Marquette, MI\n24. Port Huron, MI\n25. Saginaw, MI\n26. Traverse City, MI\n27. Utica, MI\n28. Baxter, MN\n29. Bemidji, MN\n30. Forest Lake, MN\n31. Hermantown (Duluth), MN\n32. Lakeville, MN\n33. Chesterfield, MO\n34. Fayetteville, NC\n35. Gastonia, NC\n36. Greensboro, NC\n37. Monroe, NC\n38. Mooresville, NC\n39. Winston-Salem, NC\n40. Kingston, NY\n41. Syracuse, NY\n42. Tonawanda, NY\n43. Mentor, OH\n44. Niles, OH\n45. Chambersburg, PA\n46. Greensburg, PA\n47. Johnstown, PA\n48. Scranton, PA\n49. Williamsport, PA\n50. York, PA\n51. N. Charleston, SC\n52. Jackson, TN\n53. Amarillo, TX\n54. Ft. Worth, TX\n55. Spring, TX\n56. Tyler, TX\n57. Fredericksburg, VA\n58. Roanoke, VA\n59. Appleton, WI\n60. Baraboo, WI\n61. Deforest (Madison), WI\n62. Eau Claire, WI\n63. Green Bay, WI\n64. Janesville, WI\n65. Kenosha, WI\n66. Onalaska (Lacrosse), WI\n67. Sheboygan, WI\n68. Waukesha, WI\n69. Wausau (Rothschild), WI\nLemonis continued, “We feel this list of locations is very solid and ready to be up and running in the coming months. Two locations have already opened, two more are slated to open next week and others will begin opening at a very rapid pace over the next few months.”\nIn addition to the locations identified above, Gander Outdoors is currently pursuing more locations for expansion and expects to announce additional locations and markets in the near term. Details on specific Grand Opening events and the official ribbon cutting ceremonies at the various locations will follow.\nGander Outdoors is always looking for seasoned and professional sales associates, specialists, technicians, and retail support team members to assist with locations across the country. Individuals interested in applying for a position with Gander Outdoors and those looking for more information are encouraged to visit http://www.ganderoutdoors.com/ .\nAbout Gander Outdoors\nGander Outdoors is an outdoor retailer that operates in local communities and online, dedicated to servicing the hunting, camping, fishing, shooting, and active sports markets. With seasonally and regionally relevant products, Gander Outdoors will have the best selection of gear at a great value to help you get outdoors and explore.\nAbout Camping World Holdings, Inc.\nCamping World Holdings, headquartered in Lincolnshire, Illinois, is the leading outdoor and camping retailer, offering an extensive assortment of recreational vehicles for sale, RV and camping gear, RV maintenance and repair and the industry’s broadest and deepest range of services, protection plans, products and resources. Since the Company's founding in 1966, Camping World has grown to become the most well-known destination for everything RV, with over 135 retail locations in 36 states and comprehensive e-commerce platform. Coupled with an unsurpassed portfolio of industry-leading brands including Gander Outdoors, Good Sam, Overton’s, The House, Uncle Dan’s and Windward/W82, Camping World Holdings has become the synonymous with outdoor experiences. Camping World’s stock is traded on the New York Stock Exchange under the symbol \"CWH\".\nFor more information, visit www.CampingWorld.com .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 concerning Camping World and other matters. All statements other than statements of historical facts contained in this press release may be forward-looking statements. Statements regarding our future results of operations and financial position, business strategy and plans and objectives of management for future operations are forward-looking statements. In some cases, you can identify forward-looking statements by terms such as ‘‘may,’’ ‘‘will,’’ ‘‘should,’’ ‘‘expects,’’ ‘‘plans,’’ ‘‘anticipates,’’ ‘‘could,’’ ‘‘intends,’’ ‘‘targets,’’ ‘‘projects,’’ ‘‘contemplates,’’ ‘‘believes,’’ ‘‘estimates,’’ ‘‘predicts,’’ ‘‘potential’’ or ‘‘continue’’ or the negative of these terms or other similar expressions. The forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. You should carefully consider the risks and uncertainties that affect our business, including those described in our filings with the Securities and Exchange Commission. These forward-looking statements speak only as of the date of this communication. Except as required by applicable law, we do not plan to publicly ", "external_links": ["http://www.ganderoutdoors.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.CampingWorld.com&esheet=51737750&newsitemid=20180104005466&lan=en-US&anchor=www.CampingWorld.com&index=2&md5=fa885111ff75447b318dce526157041c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ganderoutdoors.com%2F&esheet=51737750&newsitemid=20180104005466&lan=en-US&anchor=http%3A%2F%2Fwww.ganderoutdoors.com%2F&index=1&md5=dae67f3bbc73412eee145ad75ae6b5af", "http://www.businesswire.com/news/home/20180104005466/en/"], "published": "2018-01-04T16:15:00.000+02:00", "crawled": "2018-01-04T16:42:35.008+02:00", "highlightTitle": ""}