{"organizations": [], "uuid": "b3db4de125a489a6ddcd4708e05f6f623d49f674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-indonesia-parliament-speaker/indonesias-golkar-party-appoints-new-parliamentary-speaker-amid-graft-probe-idUKKBN1F4067", "country": "US", "domain_rank": 408, "title": "Indonesia to swear in new parliament speaker after huge graft case", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:35:00.000+02:00", "replies_count": 0, "uuid": "b3db4de125a489a6ddcd4708e05f6f623d49f674"}, "author": "", "url": "https://uk.reuters.com/article/uk-indonesia-parliament-speaker/indonesias-golkar-party-appoints-new-parliamentary-speaker-amid-graft-probe-idUKKBN1F4067", "ord_in_thread": 0, "title": "Indonesia to swear in new parliament speaker after huge graft case", "locations": [], "entities": {"persons": [{"name": "kanupriya kapoor", "sentiment": "none"}, {"name": "soesatyo", "sentiment": "none"}, {"name": "agustinus beo da costa", "sentiment": "none"}, {"name": "widodo", "sentiment": "none"}, {"name": "joko widodo", "sentiment": "none"}, {"name": "endy bayuni", "sentiment": "none"}, {"name": "setya novanto", "sentiment": "none"}, {"name": "jokowi", "sentiment": "none"}], "locations": [{"name": "indonesia", "sentiment": "none"}, {"name": "bambang soesatyo", "sentiment": "none"}], "organizations": [{"name": "min read  jakarta", "sentiment": "none"}, {"name": "jakarta post", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "golkar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 2:13 AM / Updated 32 minutes ago Indonesia to swear in new parliament speaker after huge graft case Agustinus Beo Da Costa , Kanupriya Kapoor 3 Min Read \nJAKARTA (Reuters) - Indonesia’s parliament will swear in Bambang Soesatyo as its new speaker on Monday, his party said, a critic of President Joko Widodo’s government who was appointed after the previous speaker was indicted in a $170 million graft scandal. \nSoesatyo is a long-time member of Golkar, the second-largest party in Widodo’s coalition and which controls leadership of the house. Golkar appointed Soesatyo to replace previous speaker Setya Novanto, who was forced to resign late last year. \nAnalysts say Soesatyo’s appointment could mean tougher negotiations in parliament for Widodo’s government as it tries to push through reforms in the last year of his term before legislative and presidential elections in 2019. \n“Jokowi may not have full control over the house like he did with the previous speaker,” said Endy Bayuni, senior editor at The Jakarta Post newspaper. Jokowi is the president’s widely used nickname. \n“Politicians switch loyalty depending on where the wind blows, but Soesatyo’s support is not automatic. Jokowi has to ensure that Golkar remains loyal to him,” Bayuni said. \nDespite Golkar being part of the ruling coalition, Soesatyo has previously criticised the president’s handling of the economy, highlighting bureaucratic inefficiency and slow budget disbursement. \nHe also criticised Widodo’s appointment of Finance Minister Sri Mulyani Indrawati, a former World Bank director, saying it showed that Widodo’s government was vulnerable to foreign influences. \n“Soesatyo knows the party’s position as a supporter of Jokowi,” said Golkar deputy secretary general Muhamad Sarmuji. “Even though he has been critical, it has only been because of his desire to contribute to the government’s success.” \nSoesatyo, a former businessman and journalist, would be sworn in during a plenary session later on Monday, Sarmuji said. The new speaker could not be reached immediately for comment. \nGolkar had also come under pressure to elect a speaker to clean up the party’s image and improve the standing of parliament, long regarded by Indonesians as riddled with entrenched corruption. \nPrevious speaker Novanto is accused of orchestrating a scheme to plunder $173 million from a government contract to introduce a national electronic identity card - almost 40 percent of the project’s entire budget. \nNovanto has denied wrongdoing in a case that has shocked Indonesians who are already used to large corruption scandals. \nSome see Soesatyo’s appointment as a missed opportunity for institutional reform. Soesatyo previously served on the parliamentary commission for legal affairs, where he lobbied for the popular anti-corruption agency’s powers to be restricted. \n“(The appointment) continues the ... strong position of politicians with webs of influence to fill in leadership positions in parliament,” said Tobias Basuki, a Jakarta-based political analyst. Editing by Michael Perry and Paul Tait", "external_links": [], "published": "2018-01-15T07:35:00.000+02:00", "crawled": "2018-01-15T08:11:35.010+02:00", "highlightTitle": ""}