{"organizations": [], "uuid": "2336896d38f1cccabd1d3fd0279c19be249b2b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219292736&w=1200&r=LYNXMPEE030LL", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-drones-drunken/as-drone-demand-soars-new-jersey-poised-to-bar-drunken-droning-idUSKBN1ET15A", "country": "US", "domain_rank": 408, "title": "As drone demand soars, New Jersey poised to bar drunken droning", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T13:05:00.000+02:00", "replies_count": 0, "uuid": "2336896d38f1cccabd1d3fd0279c19be249b2b23"}, "author": "", "url": "https://www.reuters.com/article/us-usa-drones-drunken/as-drone-demand-soars-new-jersey-poised-to-bar-drunken-droning-idUSKBN1ET15A", "ord_in_thread": 0, "title": "As drone demand soars, New Jersey poised to bar drunken droning", "locations": [], "entities": {"persons": [{"name": "barbara goldberg", "sentiment": "none"}, {"name": "john sullivan", "sentiment": "none"}], "locations": [{"name": "new jersey", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - U.S. drone sales in 2017 topped $1 billion for the first time ever, but don’t raise a glass too quickly if you are in New Jersey, where lawmakers are poised to outlaw drunken droning next week.\nIt is one of a wave of U.S. states moving to bring the unmanned aircrafts’ high-flying fun back to earth.\nNew Jersey’s Assembly is slated to vote on a bill approved by the state Senate to ban inebriated or drugged droning, as well as to outlaw flying unmanned aircraft systems over prisons and in pursuit of wildlife. The vote was set for Thursday but postponed until Monday because of a severe snowstorm that triggered a state of emergency in New Jersey.\n“It’s basically like flying a blender,” said John Sullivan, 41, of New York, a drone buff and aerial cinematographer. He said he opposed drunk droning but also fretted about regulatory overreach. “If I had like one drink, I’d be hesitant to even fly it.”\nA 2015 drone crash on the White House lawn fueled debate in the U.S. Congress over the need for drone regulations.\nIt was a drunken, off-duty employee of the National Geospatial-Intelligence Agency who flew the 2-foot-by-2-foot (60 cm by 60 cm) “quadcopter” from a friend’s apartment balcony and lost control of it over the grounds surrounding the White House, the New York Times reported.\nFILE PHOTO: A small drone helicopter flies over Coney Island in New York, U.S., August 29, 2013. REUTERS/Carlo Allegri/File Photo New statistics set for release next week show 3.1 million drones were sold in the United States last year, up 28 percent from 2016, said Richard Kowalski, manager for the Consumer Technology Association.\n“This was the first year that drone revenues reached $1 billion,” Kowalksi said in an email.\nAt least 38 states are considering restrictions on the devices this legislative year, including Illinois, Maryland, Michigan, New Hampshire, New Jersey, New York, Pennsylvania, and South Carolina, said Amanda Essex, senior policy specialist for the National Conference of State Legislatures.\n“Like any technology, drones have the ability to be used for good, but they also provide new opportunities for bad actors,” said Assemblywoman Annette Quijano of Elizabeth, New Jersey. She backed the bill, which would impose a punishment of up to six months prison and a $1,000 fine for drunk droning.\nIf the Assembly passes the bill, Governor Chris Christie must sign it into law before he leaves office in less than two weeks or the legislation is dead, said Quijano’s Chief of Staff Shane Derris.\nAlready, nine states prohibit drones from operating near or over prisons, including Arizona, Louisiana, Nevada, North Carolina, Oregon, South Dakota, Tennessee, Texas and Wisconsin, Essex said.\nA drone carrying wire cutters and a cell phone likely aided a prisoner’s escape in July from a maximum security prison in South Carolina, officials said.\nReporting by Barbara Goldberg; Editing by Scott Malone, David Gregorio and Frances Kerry\n ", "external_links": [], "published": "2018-01-04T13:05:00.000+02:00", "crawled": "2018-01-04T13:18:22.000+02:00", "highlightTitle": ""}