{"organizations": [], "uuid": "baba72402dae5f41911c4f8252370fb232456f04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/awards-goldenglobes-oprah/update-1-oprah-winfrey-claims-lifetime-golden-globe-calls-for-a-new-day-idUSL1N1P303X", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Oprah Winfrey claims lifetime Golden Globe, calls for 'a new day'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-08T12:21:00.000+02:00", "replies_count": 0, "uuid": "baba72402dae5f41911c4f8252370fb232456f04"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/awards-goldenglobes-oprah/update-1-oprah-winfrey-claims-lifetime-golden-globe-calls-for-a-new-day-idUSL1N1P303X", "ord_in_thread": 0, "title": "UPDATE 1-Oprah Winfrey claims lifetime Golden Globe, calls for 'a new day'", "locations": [], "entities": {"persons": [{"name": "nichola groom", "sentiment": "negative"}, {"name": "oprah winfrey", "sentiment": "negative"}, {"name": "winfrey", "sentiment": "negative"}, {"name": "cecil b. de mille", "sentiment": "none"}, {"name": "sophia loren", "sentiment": "none"}, {"name": "meryl streep", "sentiment": "none"}, {"name": "steven spielberg", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "golden globe", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "hollywood", "sentiment": "none"}, {"name": "own", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: , byline)\nBy Nichola Groom\nLOS ANGELES, Jan 7 (Reuters) - Oprah Winfrey became the first black woman to be awarded a Golden Globe for lifetime achievement on Sunday, delivering an impassioned speech in support of those who have exposed sexual misconduct in Hollywood and beyond.\nActress, movie and television producer, and chief executive of her OWN cable channel, Winfrey, 63, was celebrated as a role model for women and a person who has promoted strong female characters.\nHer honor came in a year when the awards show, Hollywood’s first leading up to the Oscars, was dominated by a scandal that has seen the downfall of dozens of powerful men as women break years of silence.\nWinfrey, who along with most of the show’s other attendees donned a black gown to show support for victims of sexual misconduct, was the first black woman to receive the annual Cecil B. De Mille award, joining the likes of Meryl Streep, Steven Spielberg, Barbra Streisand and Sophia Loren.\nWinfrey used her speech to praise women who have shared their stories of sexual harassment and abuse, and to declare that “a new day is on the horizon” for girls and women.\n“And when that new day finally dawns it will be because of a lot of magnificent women, many of whom are in this room tonight, and some pretty phenomenal men, fighting hard to make sure they become leaders that take us to the time where nobody has to say ‘me too’ again,” Winfrey said, referencing the social media movement raising awareness about sexual harassment.\nWinfrey was raised in poverty by a single mother and went on host the top-rated talk show “The Oprah Winfrey Show” for 25 years before ending it in 2011.\n“I want to express gratitude to all the women who have endured years of abuse and assault because they, like my mother, had children to feed and bills to pay and dreams to pursue.”\nDuring her speech, she recalled being inspired as a child by previous Cecil B. DeMille award winner Sidney Poitier, the first black actor to win a best actor Oscar.\n“It is not lost on me that at this moment there are some little girls watching as I become the first black woman to be given the same award,” Winfrey said.\nShe produced and acted in the 2014 civil rights movie “Selma,” and 2017’s “The Immortal Life of Henrietta Lacks” and was Oscar nominated in 1986 for her role in “The Color Purple” which she later helped finance as Broadway musical.\nEven after ending her daily talk show, her influence on popular culture remains strong.\nForbes last year estimated her net worth at $3 billion and placed her third on its list of the America’s richest self-made women. (Reporting by Jill Serjeant; Editing by Sandra Maler)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T12:21:00.000+02:00", "crawled": "2018-01-08T14:11:01.008+02:00", "highlightTitle": ""}