{"organizations": [], "uuid": "10fc41571aad546111a684ef02ba54b34ba9efa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/24/104728415-RTS1DKDN-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/german-coalition-breakthrough-in-talks-to-form-a-government.html", "country": "US", "domain_rank": 767, "title": "German coalition party leaders reportedly reach breakthrough in talks to form a government", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-12T09:45:00.000+02:00", "replies_count": 0, "uuid": "10fc41571aad546111a684ef02ba54b34ba9efa5"}, "author": "Kai Pfaffenbach", "url": "https://www.cnbc.com/2018/01/12/german-coalition-breakthrough-in-talks-to-form-a-government.html", "ord_in_thread": 0, "title": "German coalition party leaders reportedly reach breakthrough in talks to form a government", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "christian democratic union", "sentiment": "none"}, {"name": "csu", "sentiment": "none"}, {"name": "cdu", "sentiment": "none"}, {"name": "christian social union", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "mins ago kai pfaffenbach | reuters christian democratic union cdu", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Political leaders in Germany have reached a breakthrough in talks to form a new coalition government, following months of uncertainty after elections in September failed to produce an overall majority for any party.\nGermany's Chancellor Angela Merkel entered into talks with a rival party earlier this week in a last-ditch effort to form a government. This after a political deadlock in the euro zone's largest economy that had shed some doubt on the future of Merkel's leadership.\nAfter 24 hours of grueling discussions — that reportedly ran all through the night — a new blueprint for more formal coalition talks was presented to party members on Friday morning. At best, a government will still not be sworn in by late March or early April, according to some experts. Nonetheless, the euro surged higher Friday morning on the news and German bond yields hit fresh five-month highs.\nMerkel, the head of a conservative alliance made up of the Christian Democratic Union (CDU) and its Bavarian sister-party the Christian Social Union (CSU), met with Martin Schulz, the head of the Social Democratic Party (SPD), for the preliminary talks. The SPD had previously refused to enter into another coalition government given that its voters punished it in the last election for its previous alliance. But after coalition talks between Merkel and two other parties failed to find an agreement , the SPD changed its stance.\nThe blueprint The blueprint for the next round of talks features a range of points, according to Reuters who cited sources close to the negotiations. It is still subject to change but says that there will be no new tax rises, according to the document, and both parties are committed to strengthening the euro zone in close partnership with France. Both parties also reportedly want to transform a rescue fund that was used during the euro zone sovereign debt crises and are prepared to boost Germany's contributions to the EU.\nReuters also reported that the blueprint showed that the new German government could look to cap, at 1,000 a month, the number of people who will be allowed to join their family who are already living as refugees in the country.\nMerkel sounded optimistic ahead of the talks, commenting last Sunday that she believed an agreement \"can be done,\" but the SPD's Schulz vowed to extract concessions from the CDU/CSU on many of its key policies. On Friday Monday, the German leader said she had recommended to her party to begin formal talks with the Social Democrats. She also highlighted a push for reforms on Europe alongside France.\nKai Pfaffenbach | Reuters Christian Democratic Union CDU party leader and German Chancellor Angela Merkel Even though the parties do seem to have found enough common ground this week to proceed, the SPD must then get backing for the deal from its members at the party's congress later in January. If that succeeds, then the parties will proceed to full-blown coalition talks.\nElection last September Talks between Germany's political parties have taken place since an election last September failed to produce an overall majority for any party, although coalition governments are common in Germany.\nThe latest talks come after months of failed negotiations between Merkel's conservative alliance and smaller parties, the Greens and pro-business Free Democrats, failed to form a coalition government.\nThe stakes for the latest talks were high given the changing political landscape in Germany. The election in September saw the far-right Alternative for Germany (AfD) become the country's third largest party and enter the German Bundestag for the first time, unsettling the political establishment and many voters .\nThe center-left SPD has been reluctant to re-enter a coalition with Merkel's conservative bloc as its previous alliance seems to have put voters off with the party garnering just 20 percent of the vote in the September election, its worst result since World War II.", "external_links": [], "published": "2018-01-12T09:45:00.000+02:00", "crawled": "2018-01-12T09:57:15.010+02:00", "highlightTitle": ""}