{"organizations": [], "uuid": "c3df21e06c26c96d956afe5b4f415ba9a0b70a83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/amazon-healthcare-stocks/health-investors-roll-out-unwelcome-mat-for-amazons-arrival-idUSL2N1PP1JG", "country": "US", "domain_rank": 408, "title": "Health investors roll out unwelcome mat for Amazon's arrival", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:15:00.000+02:00", "replies_count": 0, "uuid": "c3df21e06c26c96d956afe5b4f415ba9a0b70a83"}, "author": "", "url": "https://www.reuters.com/article/amazon-healthcare-stocks/health-investors-roll-out-unwelcome-mat-for-amazons-arrival-idUSL2N1PP1JG", "ord_in_thread": 0, "title": "Health investors roll out unwelcome mat for Amazon's arrival", "locations": [], "entities": {"persons": [{"name": "jeff jonas", "sentiment": "none"}, {"name": "lewis krauskopf", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:15 PM / in 36 minutes Health investors roll out unwelcome mat for Amazon's arrival Lewis Krauskopf 4 Min Read \nNEW YORK, Jan 30 (Reuters) - As press releases go, it was vague and brief - six paragraphs, 394 words in all. In general terms, it described the beginnings of an effort by three big U.S. companies to team up to improve their employees’ healthcare services and save money. \nBut it delivered a $69 billion body blow to stocks across the healthcare sector, driven in large part because of the first word: “Amazon.” \nThe day long feared by executives and investors alike in the $3.47 trillion U.S. healthcare sector had arrived. And with an unsettling lack of specificity. \n“Everyone is still terrified of Amazon,” said Jeff Jonas, a portfolio manager focusing on healthcare for Gabelli Funds. \nEarlier on Tuesday, Amazon.com Inc, Berkshire Hathaway and JPMorgan Chase & Co announced they will form a healthcare company aimed at cutting costs for their more than 500,000 U.S. employees. \nInvestors for months have fretted over a potential Amazon entry into healthcare delivery, particularly selling prescription drugs, with stocks periodically selling off on headlines anticipating a move by the massive online retailer. \nBut Tuesday’s news was short on details, creating the potential for the uncertainty over Amazon’s healthcare aims to linger over the sector. \n“The release that we have today is very cryptic and broad,” said John Schroer, U.S. healthcare sector head for Allianz Global Investors in San Francisco. \n“This is just one move amongst perhaps many more that Amazon could take in moving into the retail chain of drug delivery. I doubt it’s the only thing they are going to do,” he said. \nAmong stocks in the drug supply chain, pharmacy benefit manager Express Scripts Holding Co was down 3.3 percent in midafternoon, drug-store chain CVS Health Corp was down 4.1 percent, and pharmaceutical distributor McKesson Corp was down 3 percent. \nHealth insurers, which had been relatively immune from previous Amazon-related jitters, were clobbered. Cigna Corp was down 7.2 percent, Anthem Inc slumped 5.3 percent and UnitedHealth Group declined 4.2 percent, making it the biggest single drag on the blue-chip Dow Jones Industrial Average. \nThe news sent the S&P 500 healthcare sector down 2 percent in Tuesday afternoon trading, putting the group on pace for its biggest single-day decline since October 2016 and blunting the sector’s strong momentum to start the year. \nThrough Monday, healthcare had risen 10.5 percent already in 2018, the best performance among all major sectors and well ahead of the 6.7 percent rise for the overall S&P 500. \n”Healthcare had been outperforming the market, at least year to date,“ Jonas said. ”It’s always a good excuse to sell and take some profit.” \nJonas and others pointed to reasons the healthcare sector should be able to move past the Amazon threat, including a healthy climate for dealmaking that has particularly boosted biotech shares, benefits from U.S. tax reform, and a solid economy leading to use of medical services. \nOthers shrugged off the Amazon announcement. RBC Capital Markets analyst George Hill, who covers drug distributors, said the initiative at first glance seems to have little market clout to impact healthcare costs and did not seem to be able to displace established players. \n“If this was the Amazon announcement drug supply chain investors have been fearing since early 2017,” Hill wrote in a research note, “consider us relieved.” Reporting by Lewis Krauskopf; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-30T22:15:00.000+02:00", "crawled": "2018-01-30T23:02:32.009+02:00", "highlightTitle": ""}