{"organizations": [], "uuid": "f47e9f94ddd14bf88f9059ec1939f3cf9d035904", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-quality-systems-inc-reports-fiscal-2018-third-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Quality Systems, Inc. Reports Fiscal 2018 Third Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "f47e9f94ddd14bf88f9059ec1939f3cf9d035904"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-quality-systems-inc-reports-fiscal-2018-third-quarter-results.html", "ord_in_thread": 0, "title": "Quality Systems, Inc. Reports Fiscal 2018 Third Quarter Results", "locations": [], "entities": {"persons": [{"name": "rusty frantz", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "quality systems, inc", "sentiment": "neutral"}, {"name": "eagle dream", "sentiment": "none"}, {"name": "gen healthcare", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Quality Systems, Inc. (NASDAQ: QSII), known to its clients as NextGen Healthcare, announced today results for its fiscal 2018 third quarter ended December 31, 2017.\n“Our fiscal third quarter marked one of solid financial results and continued demonstration of execution on our strategic plan. I believe the structural changes we’ve put in place, including the new additions to our sales team, allow for greater predictability in our business and I’m pleased to report a sequential increase in bookings and great receptivity to Eagle Dream during the quarter. The positive indications we’re seeing in cross-selling are still early, but I believe the new solutions we’ve added have greatly helped to develop our well-rounded platform. This continued progress makes us confident in our outlook for the longer-term as we continue to deliver value for our clients and position ourselves to deliver future growth,” commented Rusty Frantz, President and Chief Executive Officer of Quality Systems, Inc.\nRevenues for the fiscal 2018 third quarter of $131.7 million compared to $127.9 million a year-ago. On a GAAP basis, net income for the 2018 third quarter was $1.5 million, compared with $10.5 million in the 2017 third quarter. Non-GAAP net income for the 2018 third quarter was $9.4 million compared with non-GAAP net income of $14.4 million in the 2017 third quarter.\nOn a GAAP basis, fully diluted earnings per share was $0.02 in the fiscal 2018 third quarter compared with $0.17 per share for the same period a year ago. On a non-GAAP basis, fully diluted earnings per share for the fiscal 2018 third quarter was $0.15 versus $0.23 reported in the third quarter a year ago.\nFiscal 2018 Financial Outlook\nFor the fiscal year 2018, the Company is reiterating its revenue outlook of a range of $522 million to $530 million. The Company is also reiterating its non-GAAP EPS from a range of $0.64 and $0.68.\nConference Call Information\nQuality Systems will host a conference call to discuss its fiscal 2018 third quarter results on Thursday, January 25, 2018 at 5:00 PM ET (2:00 PM PT). Shareholders and interested participants may listen to a live broadcast of the conference call by dialing 866-750-8947 or 720-405-1352 for international callers, and referencing participant code 9176097 approximately 15 minutes prior to the call. A live webcast of the conference call will be available on the investor relations section of the company's web site and an audio file of the call will also be archived for 90 days at investor.qsii.com . After the conference call, a replay will be available until February 8, 2018 and can be accessed by dialing 800-585-8367 or 404-537-3406 for international callers, and referencing participant code 9176097.\nAbout Quality Systems, Inc.\nQuality Systems, Inc., known to its clients as NextGen Healthcare, provides a range of software, services, and analytics solutions to medical and dental group practices. The company's portfolio delivers foundational capabilities to empower physician success, enrich the patient care experience, and enable the transition to value-based healthcare. Visit www.qsii.com and www.nextgen.com for additional information.\nSAFE HARBOR PROVISIONS FOR FORWARD-LOOKING STATEMENTS\nThis news release may contain forward-looking statements within the meaning of the federal securities laws, including but not limited to, statements regarding future events, developments in the healthcare sector and regulatory framework, the Company's future performance, as well as management's expectations, beliefs, intentions, plans, estimates or projections relating to the future (including, without limitation, statements concerning revenue, net income, and earnings per share). Risks and uncertainties exist that may cause the results to differ materially from those set forth in these forward-looking statements. Factors that could cause the anticipated results to differ from those described in the forward-looking statements and additional risks and uncertainties are set forth in Part I, Item A of our most recent Annual Report on Form 10-K and subsequently filed Quarterly Reports on Form 10-Q, including but not limited to: the volume and timing of systems sales and installations; length of sales cycles and the installation process; the possibility that products will not achieve or sustain market acceptance; seasonal patterns of sales and customer buying behavior; impact of incentive payments under The American Recovery and Reinvestment Act on sales and the ability of the Company to meet continued certification requirements; uncertainties related to the future impact of U.S. tax reform; the impact of governmental and regulatory agency investigations; the development by competitors of new or superior technologies; the timing, cost and success or failure of new product and service introductions, development and product upgrade releases; undetected errors or bugs in software; product liability; changing economic, political or regulatory influences in the health-care industry; changes in product-pricing policies; availability of third-party products and components; competitive pressures including product offerings, pricing and promotional activities; the Company's ability or inability to attract and retain qualified personnel; possible regulation of the Company's software by the U.S. Food and Drug Administration; changes of accounting estimates and assumptions used to prepare the prior periods' financial statements; disruptions caused by acquisitions of companies, products, or technologies; and general economic conditions. A significant portion of the Company's quarterly sales of software product licenses and computer hardware is concluded in the last month of a fiscal quarter, generally with a concentration of such revenues earned in the final ten business days of that month. Due to these and other factors, the Company's revenues and operating results are very difficult to forecast. A major portion of the Company's costs and expenses, such as personnel and facilities, are of a fixed nature and, accordingly, a shortfall or decline in quarterly and/or annual revenues typically results in lower profitability or losses. As a result, comparison of the Company's period-to-period financial performance is not necessarily meaningful and should not be relied upon as an indicator of future performance. These forward-looking statements speak only as of the date hereof. The Company undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise.\nUSE OF NON-GAAP FINANCIAL MEASURES\nThis news release contains certain non-GAAP (Generally Accepted Accounting Principles) financial measures, which are provided only as supplemental information. Investors should consider these non-GAAP financial measures only in conjunction with the comparable GAAP financial measures. These non-GAAP measures are not in accordance with or a substitute for U.S. GAAP. Pursuant to the requirements of Regulation G, the Company has provided a reconciliation of non-GAAP financial measures to the most directly comparable financial measure in the accompanying financial tables. Other companies may calculate non-GAAP measures differently than Quality Systems, which limits comparability between companies. The Company believes that its presentation of non-GAAP diluted earnings per share provides useful supplemental information to investors and management regarding the Company's financial condition and results. The presentation of non-GAAP financial information is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. The Company calculates non-GAAP diluted earnings per share by excluding net acquisition costs, amortization of acquired intangible assets, amortization of deferred debt issuance costs, restructuring costs, net securities litigation defense costs, share-based compensation, and other non-run-rate expenses from GAAP income before provision for income taxes. The Company utilizes a normalized non-GAAP tax rate to provide better consistency across the interim reporting periods within a given fiscal year by eliminating the effects of non-recurring and period-specific items, which can vary in size and frequency, and which are not necessarily reflective of the Company’s longer-term operations.\nThe normalized non-GAAP tax rate applied to each quarter of fiscal year 2017 and each quarter of fiscal 2018 through December 31, 2017 is 30.5%. The determination of this rate is based on the consideration of both historic and projected financial results. The Company has not adjusted its non-GAAP tax rate for the three and nine months ended December 31, 2017 following the enactment of the new tax reform legislation on December 22, 2017. We have not yet fully assessed the impact of the tax reform legislation on the fiscal 2018 non-GAAP tax rate and may adjust it in the fiscal 2018 fourth quarter as additional information becomes available and further analysis is completed based on the expected long-term impact of the tax reform legislation in conjunction with any other significant events occur that may materially affect this rate, such as merger and acquisition activity, changes in business outlook, or other changes in expectations regarding tax regulations.\nThe Company’s future period guidance in this release includes adjustments for items not indicative of the Company’s core operations. Such adjustments are generally expected to be of a nature similar to those adjustments applied to the Company’s historic GAAP financial results in the determination of the Company’s non-GAAP diluted earnings per share. Such adjustments, however, may be affected by changes in ongoing assumptions and judgments as to the items that are excluded in the calculation of non-GAAP adjusted net income and adjusted diluted earnings per share, as described in this release. The exact amount and probable significance of these adjustments, including net acquisition costs, net securities litigation defense costs, and other non-run-rate expenses, are not currently determinable without unreasonable efforts, but may be significant. These items cannot be reliably quantified or forecasted due to the combination of their historic and expected variability. It is therefore not practicable to reconcile this non-GAAP guidance to the most comparable GAAP measures.\nQUALITY SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(In thousands, except per share data) (Unaudited) Three Months Ended\nDecember 31,\nNine Months Ended\nDecember 31,\n2017 2016 2017 2016 Revenues: Software license and hardware $ 13,131 $ 16,995 $ 40,198 $ 48,966 Software related subscription services 24,690 22,546 73,584 63,911 Total software, hardware and related 37,821 39,541 113,782 112,877 Support and maintenance 40,362 39,924 123,171 116,905 Revenue cycle management and related services 21,922 20,048 64,327 62,037 Electronic data interchange and data services 23,136 21,790 69,446 65,527 Professional services 8,474 6,565 24,518 19,893 Total revenues 131,715 127,868 395,244 377,239 Cost of revenue: Software license and hardware 5,726 5,680 15,947 19,227 Software related subscription services 11,693 9,345 32,822 27,107 Total software, hardware and related 17,419 15,025 48,769 46,334 Support and maintenance 7,525 7,299 22,583 20,903 Revenue cycle management and related services 15,401 13,462 45,615 42,052 Electronic data interchange and data services 13,581 12,662 40,313 38,232 Professional services 7,708 5,904 22,278 19,643 Total cost of revenue 61,634 54,352 179,558 167,164 Gross profit 70,081 73,516 215,686 210,075 Operating expenses: Selling, general and administrative 43,563 37,542 127,517 120,913 Research and development costs, net 20,645 19,714 60,161 56,230 Amortization of acquired intangible assets 1,956 2,568 6,015 7,889 Restructuring costs 130 231 130 4,685 Total operating expenses 66,294 60,055 193,823 189,717 Income from operations 3,787 13,461 21,863 20,358 Interest income 15 - 36 9 Interest expense (733 ) (629 ) (2,250 ) (2,445 ) Other expense, net (41 ) (4 ) (48 ) (146 ) Income before provision for income taxes 3,028 12,828 19,601 17,776 Provision for income taxes 1,487 2,342 6,134 3,950 Net income $ 1,541 $ 10,486 $ 13,467 $ 13,826 Net income per share: Basic $ 0.02 $ 0.17 $ 0.21 $ 0.22 Diluted $ 0.02 $ 0.17 $ 0.21 $ 0.22 Weighted-average shares outstanding: Basic 63,706 62,093 63,287 61,645 Diluted 63,708 62,093 63,296 61,900 QUALITY SYSTEMS, INC.\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except per share data) (Unaudited) December 31, 2017 March 31, 2017 ASSETS Current assets: Cash and cash equivalents $ 23,359 $ 37,673 Restricted cash and cash equivalents 3,393 4,916 Accounts receivable, net 79,416 83,407 Inventory 154 158 Income taxes receivable 4,082 2,679 Prepaid expenses and other current assets 17,944 17,969 Total current assets 128,348 146,802 Equipment and improvements, net 27,137 27,426 Capitalized software costs, net 23,209 13,607 Deferred income taxes, net 7,197 11,265 Intangibles, net 80,663 69,213 Goodwill 216,530 185,898 Other assets 18,299 19,010 Total assets $ 501,383 $ 473,221 LIABILITIES AND SHAREHOLDERS' EQUITY Current liabilities: Accounts payable $ 3,069 $ 4,618 Deferred revenue 52,843 52,383 Accrued compensation and related benefits 21,898 24,513 Income taxes payable — 405 Other current liabilities 30,153 46,775 Total current liabilities 107,963 128,694 Deferred revenue, net of current 853 1,394 Deferred compensation 6,473 6,629 Line of credit 39,000 15,000 Other noncurrent liabilities 16,354 16,461 Total liabilities 170,643 168,178 Commitments and contingencies Shareholders' equity: Common stock $0.01 par value; authorized 100,000 shares; issued and outstanding 63,712 and 62,455 shares at December 31, 2017 and March 31, 2017, respectively 637 625 Additional paid-in capital 240,584 228,549 Accumulated other comprehensive loss (235 ) (358 ) Retained earnings 89,754 76,227 Total shareholders' equity 330,740 305,043 Total liabilities and shareholders' equity $ 501,383 $ 473,221 QUALITY SYSTEMS, INC.\nNON-GAAP FINANCIAL MEASURES\n(In thousands, except per share data) RECONCILIATION OF NON-GAAP DILUTED EARNINGS PER SHARE\nThree Months Ended\nDecember 31,\nNine Months Ended\nDecember 31,\n2017 2016 2017 2016 Income before provision for income taxes - GAAP $ 3,028 $ 12,828 $ 19,601 $ 17,776 Non-GAAP adjustments: Acquisition and disposition costs, net 387 (1,337 ) 1,569 5,147 Amortization of acquired intangible assets 6,083 5,575 17,351 16,953 Amortization of deferred debt issuance costs 269 269 807 807 Restructuring costs 130 231 130 4,685 Securities litigation defense costs, net of insurance 152 356 716 1,483 Share-based compensation 3,453 2,001 8,585 5,067 Other non-run-rate expenses* - 739 263 2,865 Total adjustments to GAAP income before provision for income taxes: 10,474 7,834 29,421 37,007 Income before provision for income taxes - Non-GAAP 13,502 20,662 49,022 54,783 Provision for income taxes 4,118 6,302 14,952 16,709 Net income - Non-GAAP $ 9,384 $ 14,360 34,070 $ 38,074 Diluted net income per share - Non-GAAP $ 0.15 $ 0.23 $ 0.54 $ 0.62 Weighted-average shares outstanding (diluted): 63,708 62,093 63,296 61,900 * Other non-run-rate expenses consist primarily of professional services costs not related to core operations.\n //www.businesswire.com/news/home/20180125006242/en/\nQuality Systems, Inc.\nJamie Arnold, Chief Financial Officer\n949-255-2600\nJArnold@nextgen.com\nor\nInvestor Contact:\nWestwicke Partners\nBob East or Asher Dewhurst\n443-213-0500\nSource: Quality Systems, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nextgen.com&esheet=51749138&newsitemid=20180125006242&lan=en-US&anchor=www.nextgen.com&index=3&md5=ea964d86820098c54c893f1021813538", "http://www.businesswire.com/news/home/20180125006242/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.qsii.com&esheet=51749138&newsitemid=20180125006242&lan=en-US&anchor=www.qsii.com&index=2&md5=89fa73b96885286049f834d4dc1b1f1c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.qsii.com&esheet=51749138&newsitemid=20180125006242&lan=en-US&anchor=investor.qsii.com&index=1&md5=0a40780dd32bec634c03b9c106201034"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:31:16.006+02:00", "highlightTitle": ""}