{"organizations": [], "uuid": "293045659422652b84668f100f5a40359d4abd1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218798004&w=1200&r=LYNXMPEE010FH", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/iran-rallies-explainer/explainer-what-has-brought-iranian-protesters-onto-the-streets-idINKBN1ER0UR", "country": "US", "domain_rank": 408, "title": "EXPLAINER - What has brought Iranian protesters onto the streets?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T14:06:00.000+02:00", "replies_count": 0, "uuid": "293045659422652b84668f100f5a40359d4abd1d"}, "author": "", "url": "https://in.reuters.com/article/iran-rallies-explainer/explainer-what-has-brought-iranian-protesters-onto-the-streets-idINKBN1ER0UR", "ord_in_thread": 0, "title": "EXPLAINER - What has brought Iranian protesters onto the streets?", "locations": [], "entities": {"persons": [{"name": "bozorgmehr sharafedin", "sentiment": "none"}, {"name": "khamenei", "sentiment": "none"}, {"name": "mahmoud ahmadinejad", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "explainer", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 12:11 PM / in 9 hours EXPLAINER - What has brought Iranian protesters onto the streets? Bozorgmehr Sharafedin 6 Min Read \nLONDON (Reuters) - Iran is stepping up a crackdown against anti-government protests that pose the most audacious challenge to its clerical leadership since 2009. Following are factors that have brought Iranians to the streets and the challenges the authorities face. People protest in Tehran, Iran December 30, 2017 in this still image from a video obtained by REUTERS. HOW SERIOUS ARE THE PROTESTS? \nThe demonstrations, which began last week, are the most serious since unrest in 2009 that followed the disputed re-election of then-President Mahmoud Ahmadinejad. \nPolitical protests are rare in Iran, where security services are pervasive. And yet tens of thousands of people have protested across the country since Thursday. \nIn a sign that Iran is taking the protests more seriously, Supreme Leader Ayatollah Ali Khamenei accused what he called enemies of the Islamic Republic on Tuesday of stirring unrest. \nKhamenei, the ultimate authority in a cumbersome system of dual clerical and republican rule, said he would address the nation about the recent events “when the time is right”. \nUnlike the pro-reform demonstrations of 2009, the latest protests appear more spontaneous and don’t seem to be orchestrated by leaders who can be identified and rounded up by the authorities. \nCalls made across the country for an end to economic hardship and alleged corruption are especially sensitive because Iranian leaders often portray the 1979 Islamic revolution which overthrew the U.S.-backed Shah as a revolt by the poor against exploitation and oppression. \nAlthough there are a variety of demands from different classes of society, videos posted on social media suggest young, working class people make up the biggest numbers. \nThat could be more dangerous for the authorities because they have regarded the less well-off as loyal to the Islamic republic, as opposed to the more middle class protesters who took to the streets nine years ago. \nAccording to official figures, 90 percent of those arrested were under 25 years old. Many young people are much more interested in jobs and change than in the Islamist idealism and anti-west sentiment that the old guard clings to. \nSecurity forces may be calculating that they can still contain the unrest as no political group inside the country has put its weight behind the movement, and the workers lack strong unions to support them. \nWHY CAN‘T THE GOVERNMENT FIND A QUICK SOLUTION? \nThe government’s main challenge is to find a way to suppress the protests without provoking more anger as demonstrators attack police stations, banks and mosques. \nSo far, while the authorities have threatened strong measures, in practice they have largely been restrained, arresting hundreds of people but holding back elite forces that have crushed past unrest. \nHardline measures could agitate those Iranians who have been calling for the downfall of the clerical leadership, including Khamenei. \nAuthorities want to take control while avoiding a repeat of 2009. In June that year, a video showing protester Neda Agha-Soltan’s last moments after being shot in the chest made her an icon of the opposition movement. \nThe state has a powerful security apparatus but so far it has refrained from sending in the elite Revolutionary Guards, the Basij militia and plain-clothed security forces which crushed the 2009 uprising and killed dozens of protesters. \nStill, prolonged demonstrations could force the government to act. Iran’s leaders believe they can count on support from many of the generation that took part as youths in the 1979 revolution because of their ideological commitment and the economic gains they have made under the Islamic government, analysts say. WHAT ARE THE MAIN DEMANDS OF THE PROTESTERS? \nIranians across the country want higher wages and an end to alleged graft. But as the unrest has spread, protestors have directed their anger at the religious establishment. \nMany also question the wisdom of Iran’s foreign policy in the Middle East, where it has intervened in Syria and Iraq in a battle for influence with rival Saudi Arabia. \nThe country’s financial support for Palestinians and the Lebanese Shi‘ite group Hezbollah also angered Iranians, who want their government to focus on domestic economic problems instead. \nSome demonstrators even shouted “Reza Shah, bless your soul” - a reference to Iran’s ruler from 1925 to 1941, and his Pahlavi dynasty which was overthrown by Ayatollah Ruhollah Khomeini, the Islamic Republic’s first leader. \nWHAT ARE IRAN‘S ECONOMIC PROSPECTS? \nPresident Hassan Rouhani championed a deal struck with world powers in 2015 to curb Iran’s nuclear programme in return for the lifting of most international sanctions. However, he has failed to deliver on promises of prosperity in the OPEC oil producer where youth unemployment reached 28.8 percent this year. \nStill, the economy has improved under Rouhani’s government and it is no longer in dire straits. \nInflation dropped into single digits for the first time in about a quarter century in June, 2016. Gross domestic product growth soared to 12.5 percent in the year to March 20, 2017, although this was almost entirely due to a leap in oil exports. \nHowever, growth has been too slow for the overwhelmingly youthful population. \nIran’s recovery has been curbed by tensions with the United States. President Donald Trump has raised the possibility that sanctions could be reimposed or new ones introduced. Reporting by Bozorgmehr Sharafedin; Editing by Michael Georgy and David Stamp", "external_links": [], "published": "2018-01-02T14:06:00.000+02:00", "crawled": "2018-01-02T15:04:11.001+02:00", "highlightTitle": ""}