{"organizations": [], "uuid": "4e2c66be1c79fe1fe878a0379765bd36df14e714", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958724-GettyImages-890941902.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/atlantic-equities-gives-apple-its-second-downgrade-in-a-week.html", "country": "US", "domain_rank": 767, "title": "Atlantic Equities gives Apple its second downgrade in a week", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-22T14:34:00.000+02:00", "replies_count": 0, "uuid": "4e2c66be1c79fe1fe878a0379765bd36df14e714"}, "author": "Tae Kim", "url": "https://www.cnbc.com/2018/01/22/atlantic-equities-gives-apple-its-second-downgrade-in-a-week.html", "ord_in_thread": 0, "title": "Atlantic Equities gives Apple its second downgrade in a week", "locations": [], "entities": {"persons": [{"name": "sergii kharchenko", "sentiment": "negative"}, {"name": "james cordwell", "sentiment": "none"}, {"name": "cordwell", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "atlantic equities", "sentiment": "negative"}, {"name": "longbow research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IPhone demand will disappoint this year, according to another Wall Street analyst.\nAtlantic Equities lowered its rating for Apple shares to neutral from overweight on Monday, predicting weaker-than-expected sales for the company's March quarter. This follows a downgrade of the popular stock last week by Longbow Research.\nWe see \"signs that iPhone demand is starting to soften, limited visibility into the potential for future iPhone cycles and emerging challenges to the smartphone's dominance at the centre of consumer technology, we believe the stock's multiple will compress, limiting upside potential,\" analyst James Cordwell wrote in a note to clients. We are \"lowering our March qtr revenue estimates and are now below consensus for Q2-Q418.\"\nCordwell reaffirmed his $190 price target for Apple shares, representing 6.5 percent upside to Friday's close.\nThe analyst said recent supply-chain data points from Apple's suppliers have \"turned negative.\" He also said the comments from the suppliers were much more optimistic during the iPhone 6 launch at this point in the cycle.\n\"Tougher ASP [average selling price] comps and the lack of a volume 'supercycle' with the iPhone X will leave it difficult to build conviction in future cycles,\" Cordwell wrote. \"Meanwhile, there also appears potential that concerns could increase over Apple's position at the centre of consumer technology, particularly given the growing consumer interest and rapid innovation in voice-based devices.\"\nLongbow Research on Wednesday lowered its rating for Apple shares to neutral from buy, predicting the company will ship fewer iPhones than expected in fiscal 2018.\nWe are \"seeing only a good, not great iPhone cycle,\" Longbow analyst Shawn Harrison wrote in a note to clients.\nApple was down 0.8 percent in early trading Monday. The company's stock is up 49 percent the last 12 months.\nApple is still overwhelmingly recommended on Wall Street. It has 28 buy ratings, nine hold ratings and zero sell ratings among analysts, according to FactSet.\n— CNBC's Michael Bloom contributed to this story. \nWATCH: Apple iPhone 6 battery: What happened when I tried to get it replaced \n\nshow chapters Apple iPhone 6 battery: what happened when I tried to get it replaced      6:17 PM ET Fri, 19 Jan 2018 | 01:11 Disclaimer", "external_links": [], "published": "2018-01-22T14:34:00.000+02:00", "crawled": "2018-01-22T14:52:42.009+02:00", "highlightTitle": ""}