{"organizations": [], "uuid": "ad0f7e910aa735d0b61cf4d1a8d64a2428964651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222980885&w=1200&r=LYNXMPEE0H0NU", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/czech-politics/czech-pm-babis-wary-of-who-becomes-president-rushes-to-form-new-government-idINKBN1F7121", "country": "US", "domain_rank": 408, "title": "Czech PM Babis, wary of who becomes president, rushes to form new government", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T11:31:00.000+02:00", "replies_count": 0, "uuid": "ad0f7e910aa735d0b61cf4d1a8d64a2428964651"}, "author": "", "url": "https://in.reuters.com/article/czech-politics/czech-pm-babis-wary-of-who-becomes-president-rushes-to-form-new-government-idINKBN1F7121", "ord_in_thread": 0, "title": "Czech PM Babis, wary of who becomes president, rushes to form new government", "locations": [], "entities": {"persons": [{"name": "babis", "sentiment": "negative"}, {"name": "andrej babis", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jason hovet", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  prague", "sentiment": "none"}, {"name": "ano party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mlada fronta dnes", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - New Czech Prime Minister Andrej Babis is rushing to form a new government, possibly by the end of February, before a new presidential term begins.\nThe two candidates on the run-off presidential vote on Jan. 26-27 have diametrically opposed views on Babis’ fitness for the premiership.\nBabis’ minority cabinet lost a parliamentary confidence vote this week, mainly because he faces allegations that, as a businessman a decade ago, he abused European Union subsidies. He denies this.\nBabis, whose ANO party won three times as many votes as its nearest rival in a parliamentary election last October, said in an interview with the daily Mlada Fronta Dnes on Thursday that a political crisis could arise if he does not get a second chance.\nThe situation is complicated by a run-off presidential vote on Jan. 26-27 in which incumbent Milos Zeman, who has promised to allow Babis a second attempt, faces a tough challenger in academic Jiri Drahos, who says it would be unacceptable to have a prime minister facing police charges.\nBabis was charged in the case but regained immunity from prosecution when he was re-elected to parliament. Lawmakers will vote on Friday whether to lift that immunity and are expected to do so.\n“Certainly if we do not get a second attempt from President Zeman and the winner was Mr Drahos, who has said he would not nominate me, destabilisation and a crisis could arise,” Babis told the newspaper.\nIn a separate interview with the daily Pravo, published on Thursday, Drahos said he would advise Babis to step aside to help resolve the standoff and would consult leaders of political parties to find out what government could be formed with majority backing in parliament.\nBabis said ANO was holding talks with three parties about a coalition - the Civic Democrats, Social Democrats and Christian Democrats - all of whom insist the ANO leader stand aside. Babis has said such a coalition is a possibility but his party rejects the stepping-down option.\nBabis said he would also lead talks with the far-right, anti-NATO and anti-EU SPD party and the far-left Communists for potential support of an ANO minority cabinet.\nThe anti-establishment ANO won elections with pledges to fight political corruption, raise public investment, modernise government and run the state more efficiently.\nBabis and Zeman - among the most popular politicians in the largely eurosceptic country that has battled the EU over its rejection of taking in migrants - have formed an uneasy alliance.\nBabis backs Zeman in the presidential vote but after the first round said the president should distance himself from some advisers and clearly state he is not aiming to re-orientate the country to eastern powers at the expense of western allies.\nZeman has been a polarising figure in his first term for his leanings to far-right views on migration, brash style and focus on building relations with China and Russia.\nReporting by Jason Hovet\n ", "external_links": [], "published": "2018-01-18T11:31:00.000+02:00", "crawled": "2018-01-18T11:50:35.053+02:00", "highlightTitle": ""}