{"organizations": [], "uuid": "14816cd43a4e878aaa357dfe9827b1a60a601d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-colombia-rebels-ecuador/ceasefire-with-colombias-eln-rebels-expires-talks-continue-idUSKBN1EZ1CG", "country": "US", "domain_rank": 408, "title": "Ceasefire with Colombia's ELN rebels expires, talks continue", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:19:00.000+02:00", "replies_count": 0, "uuid": "14816cd43a4e878aaa357dfe9827b1a60a601d3b"}, "author": "", "url": "https://www.reuters.com/article/us-colombia-rebels-ecuador/ceasefire-with-colombias-eln-rebels-expires-talks-continue-idUSKBN1EZ1CG", "ord_in_thread": 0, "title": "Ceasefire with Colombia's ELN rebels expires, talks continue", "locations": [], "entities": {"persons": [{"name": "juan manuel santos", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "quito", "sentiment": "none"}], "organizations": [{"name": "eln", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "national liberation army", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 12:20 PM / Updated 17 minutes ago Colombia's ELN rebels resume attacks as ceasefire expires Helen Murphy , Luis Jaime Acosta 4 Min Read \nBOGOTA/QUITO (Reuters) - Colombia’s Marxist ELN rebels resumed attacks on oil installations and the armed forces on Wednesday, threatening the future of peace talks just hours after the expiration of a ceasefire agreement with the government. \nThe talks in Quito, Ecuador, had been scheduled to restart on Wednesday after a recess between the National Liberation Army (ELN) and the government of center-right President Juan Manuel Santos. \nSantos said he ordered his chief negotiator back to Bogota after the attacks, however, to weigh the future of a process that began early last year in a bid to end more than 53 years of fighting. \nThe rebels carried out three bomb attacks in the early hours against the Cano Limon oil pipeline, which takes crude from the Cano Limon oil field, operated by Occidental Petroleum Corp, to the Caribbean port of Covenas. The bombings against the pipeline, which is Colombia’s second most important, forced the suspension of pumping operations, the government said. \nThe ELN also staged a grenade attack on a naval base in Arauca province, injuring two soldiers. \nSeparately, state oil company Ecopetrol reported an attack on one of its facilities in a rural area Casanare province. \n“I deplore the decision by the ELN to reactivate its terrorist attacks,” Santos said in a televised address. \n“The government was always willing to extend the ceasefire. Inexplicably, the ELN refused. Under the circumstances I have ordered the return of our chief negotiator to evaluate the future of talks.” \nThe group’s first-ever ceasefire, which began in October, ended overnight. The ELN has said it will not extend the truce under the original terms and wants a new deal. \nPablo Beltran, chief ELN negotiator in Quito, said the group had adhered to the conditions of the ceasefire and that the two sides had always agreed to evaluate new terms after the 101-day truce expired. \nHe said Wednesday’s attacks occurred in “complex situations” of war and that the group maintained its intention to negotiate a new ceasefire. \n“We’re seeking a response from the government to see if it’s interested in finding a way out of this incident. If there’s a positive response, the ELN delegation will remain in Quito,” Beltran said. \n“But if there’s no positive response we will have to return to Colombia.” \nDuring the ceasefire, reached on Sept. 4, the insurgent group promised to suspend hostage-taking, attacks on roads and oil installations, the use of landmines and the recruitment of minors. In turn, the government agreed to improve protection for community leaders and conditions for about 450 jailed rebels. \nThe 2,000-strong ELN has hurt the oil industry with its regular bombings of infrastructure and has taken numerous oil workers hostage over the years. \nSantos, who leaves office this year, signed a peace deal with the larger Revolutionary Armed Forces of Colombia (FARC) in late 2016 after negotiations in Cuba that lasted four years. \nThe FARC is now a political party with a candidate for president in May elections. \nThe ELN, founded by radical Roman Catholic priests in 1964, has sought peace with the government before but made little progress. It is considered a terrorist group by the United States and European Union. Reporting by Helen Murphy and Luis Jaime Acosta; Additional reporting by Alexandra Valencia in Quito; Editing by Bill Trott and Tom Brown", "external_links": [], "published": "2018-01-10T14:19:00.000+02:00", "crawled": "2018-01-10T14:31:48.013+02:00", "highlightTitle": ""}