{"organizations": [], "uuid": "4affbc65f4343739d4552b8f4aa70418c24fcdb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-israel-jordan-diplomacy/israel-wont-prosecute-embassy-guard-over-jordan-shootings-sources-idUKKBN1FA0F9", "country": "US", "domain_rank": 408, "title": "Israel won't prosecute embassy guard over Jordan shootings - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T12:53:00.000+02:00", "replies_count": 0, "uuid": "4affbc65f4343739d4552b8f4aa70418c24fcdb4"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-jordan-diplomacy/israel-wont-prosecute-embassy-guard-over-jordan-shootings-sources-idUKKBN1FA0F9", "ord_in_thread": 0, "title": "Israel won't prosecute embassy guard over Jordan shootings - sources", "locations": [], "entities": {"persons": [{"name": "benjamin netan", "sentiment": "none"}, {"name": "dan williams", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "shin bet", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}], "organizations": [{"name": "foreign ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  jerusalem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 10:55 AM / Updated 10 minutes ago Israel won't prosecute embassy guard over Jordan shootings - sources Dan Williams 4 Min Read \nJERUSALEM (Reuters) - Israel will not prosecute a guard from its embassy in Amman who killed two Jordanians in July, as had long been demanded by the kingdom, two Israeli sources said on Sunday. \nInstead, the Foreign Ministry and Shin Bet security agency will review protocols surrounding the actions taken by the guard, and his conduct, “and share the results with the Jordanians”, a diplomatic source said. \nThe killings led to a rift between the countries, which both said last week had been mended. \nJordan said Israel had apologised for the embassy deaths, would compensate the victims’ next of kin and “implement and follow up legal measures” in the case. \nJordanian officials were not immediately available to comment on the diplomatic source’s account. Israel’s Foreign Ministry spokesman declined comment. \nAmman had previously demanded a homicide trial for the guard, whose repatriation under diplomatic immunity and hero’s welcome by Prime Minister Benjamin Netanyahu angered Jordanians. \nIsrael said in the aftermath of the incident that the guard had acted in self-defence, shooting a workman who stabbed and wounded him lightly, and that the second Jordanian was killed by stray fire. \nAsked on Sunday whether criminal prosecution of the guard was possible, a second Israeli official told Reuters on condition of anonymity: “No way.” \nThe guard’s prospects of remaining in the Israeli secret service may be in doubt, however, after a Jordanian newspaper published his name and photograph. \nOther fine-print elements of the reconciliation deal were designed to limit legal culpability for Israel, the diplomatic source said. \nIsrael would not pay damages to the next of kin directly, but instead provide a $5 million lump sum for the Jordanian government to disburse as compensation, that source said. The money is also meant to cover the needs of the family of a Jordanian shot dead by an Israeli border guard in 2014. \nTwo sources close to the families confirmed the payout sum. \nThe Israeli diplomatic source said the Netanyahu government had not apologised for the shooting of the alleged assailant but rather “voiced regret”. \nOn Thursday, a Jordanian government spokesman said Israel had sent a memorandum stating its “deep regrets and apologies”. \nYet Israel distinguishes between the two expressions of contrition, seeing in the latter a potential admission of guilt. \nA deal reconciling Israel and Turkey over the killing of 10 pro-Palestinian Turks who tried to breach the Gaza blockade in 2010 included Israel voicing regret and paying $20 million into a Turkish fund that compensated the bereaved and injured. \nIn return, Ankara agreed not to seek the criminal prosecution of Israeli marines who raided the activists’ ship. \nJordan signed a peace treaty with Israel in 1994. \nThree years later, during Netanyahu’s first term as prime minister, relations were strained when Israeli secret agents were caught spraying poison into the ear of Palestinian Hamas leader Khaled Meshaal on an Amman street. \nThe assassination team was repatriated in return for an antidote for Meshaal and the release of Hamas’s spiritual leader, Ahmed Yassin, from an Israeli jail. \nOn Saturday night in a Twitter posting, Netanyahu expressed appreciation for behind-the-scenes efforts by U.S. envoys Jared Kushner and Jason Greenblatt to help end the crisis with Jordan. Additional reporting by Suleiman Al-Khalidi in Amman; Editing by Jeffrey Heller and John Stonestreet", "external_links": [], "published": "2018-01-21T12:53:00.000+02:00", "crawled": "2018-01-21T13:11:16.001+02:00", "highlightTitle": ""}