{"organizations": [], "uuid": "6e8f70dfabc7ebac77e9974b2c1643ff3d4b3aed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-tarveda-therapeutics-appoints-brian-roberts-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Tarveda Therapeutics Appoints Brian Roberts as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.881, "site_type": "news", "published": "2018-01-04T17:30:00.000+02:00", "replies_count": 0, "uuid": "6e8f70dfabc7ebac77e9974b2c1643ff3d4b3aed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-tarveda-therapeutics-appoints-brian-roberts-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Tarveda Therapeutics Appoints Brian Roberts as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "brian roberts", "sentiment": "negative"}, {"name": "brian", "sentiment": "none"}, {"name": "drew fromkin", "sentiment": "none"}, {"name": "roberts", "sentiment": "none"}, {"name": "tarveda", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "watertown", "sentiment": "none"}, {"name": "tarveda", "sentiment": "none"}], "organizations": [{"name": "tarveda therapeutics, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WATERTOWN, Mass.--(BUSINESS WIRE)-- Tarveda Therapeutics, Inc. , a clinical stage biopharmaceutical company discovering and developing Pentarins™ as a new class of potent and selective cancer medicines, today announced the appointment of Brian Roberts as Chief Financial Officer. Mr. Roberts has nearly 25 years of finance, capital markets and operations experience spanning the life sciences, medtech and media industries with a proven track record of delivering positive results, financing companies and driving shareholder value.\n“Brian brings a unique balance of deep healthcare industry experience in pre- and post-revenue as well as private and public companies coupled with proven financial and operating expertise. His breadth of abilities and experiences make him the ideal choice to help guide Tarveda toward our business and financial objectives as we enter our next phase of growth,” said Drew Fromkin, President and Chief Executive Officer of Tarveda. “This is an exciting and important year for our company and we are thrilled to welcome Brian to the executive team.”\n“Tarveda is at a pivotal stage as it advances two novel, clinical stage oncology drug programs through Phase 1/2a clinical trials and further explores the unique role that Pentarins can play in the treatment of patients with solid tumors,” said Mr. Roberts. “I was truly impressed with the rapid, material progress and value creation that has been realized over the last 24 months and look forward to leveraging my experience and network to help Tarveda achieve its corporate and financial goals in support of advancing patient care in oncology.”\nPrior to joining Tarveda, Mr. Roberts served as Chief Financial and Operating Officer at Avedro, Inc., a privately held biotechnology and medical device company. During his tenure, he acted as interim Chief Executive Officer, leading the company through FDA approval, manufacturing readiness and commercial launch of its lead combination drug, Photrexa, and its device, the KXL System. Previously, he served as Chief Financial Officer (CFO) at Insulet Corporation, a leader in tubeless insulin pump technology. During his tenure, Insulet grew rapidly from approximately $30 million to nearly $300 million in revenue, increased its market capitalization to over $2 billion and achieved operating profitability. Prior to Insulet, Brian served as CFO for Jingle Networks, a leader in mobile voice-ad services that was acquired by Marchex, Inc. Previously, Mr. Roberts was CFO for Digitas, a leading publicly traded digital marketing and media services firm where he was instrumental in building the organization to nearly $400 million in revenue resulting in the successful sale of the company for $1.3 billion to Publicis Groupe. Mr. Roberts also held finance positions at Idiom Technologies, Inc., the Monitor Group and served as an auditor with Ernst & Young LLP.\nAbout Pentarins™\nTarveda is developing Pentarins™, potent and selective miniature drug conjugates with high affinity for specific cell surface and intracellular targets in solid tumors. Pentarins are engineered to bind to their tumor cell targets, accumulate and provide sustained release of their potent therapeutic payloads deep into solid tumor tissue. Comprised of a targeting ligand conjugated to a potent cancer cell-killing agent through a tuned chemical linker, Pentarins are designed to overcome the deficits of both larger antibody drug conjugates and small molecules that limit their therapeutic effectiveness against solid tumors. Together, the components of Tarveda’s Pentarins have distinct, yet synergistic, anticancer attributes: the small size of Pentarins allows for rapid and deep penetration into solid tumors, the ligand’s targeting ability allows for high affinity, selective binding and retention in tumor cells, the chemical linker is tuned to optimize the release and accumulation of the potent, cell-killing payload inside the cancer cells for efficacy, and the design of the unique components together provide for the pharmacokinetics required for the critical level Pentarin concentrations in the tumor.\nAbout Tarveda Therapeutics, Inc.\nTarveda Therapeutics, Inc. discovers and develops Pentarins™, a new class of potent and selective miniature drug conjugates with enhanced targeting capabilities and pharmacokinetics for the treatment of patients with a wide range of solid tumor cancers. Tarveda’s lead Pentarin clinical drug candidate, PEN-221, targets the somatostatin receptor 2 (SSTR2) for treatment of patients with tumors that express SSTR2 including neuroendocrine, small cell lung and other cancers that express SSTR2. PEN-221 comprises a peptide, which is highly selective for SSTR2 conjugated to the potent cytotoxic DM1 through a tuned cleavable linker. Tarveda is also advancing its HSP90 drug conjugate platform with lead drug candidate PEN-866, which is a miniature drug conjugate that selectively binds to the intracellular target, Heat Shock Protein 90 (HSP90), and is linked to the payload SN-38. Tarveda’s strategy includes developing its own proprietary Pentarins as well as applying the Pentarin platform to enhance the effectiveness of novel payloads of pharmaceutical collaborators. www.tarveda.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005345/en/\nMacDougall Biomedical Communications\nGeorge E. MacDougall, 781-235-3060\ngeorge@macbiocom.com\nSource: Tarveda Therapeutics, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tarveda.com&esheet=51737671&newsitemid=20180104005345&lan=en-US&anchor=www.tarveda.com&index=2&md5=c5e401ddb094463f9bed1fbe29319d7e", "http://www.businesswire.com/news/home/20180104005345/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tarveda.com%2F&esheet=51737671&newsitemid=20180104005345&lan=en-US&anchor=Tarveda+Therapeutics%2C+Inc.&index=1&md5=ffc7d32b486d4bb1b1f9ba2d0472a5cb"], "published": "2018-01-04T17:30:00.000+02:00", "crawled": "2018-01-04T19:19:52.004+02:00", "highlightTitle": ""}