{"organizations": [], "uuid": "81eee16bba4d05a59f56f7edf0e5b45e8aaa9905", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223038950&w=1200&r=LYNXMPEE0H110", "site_section": "https://www.reuters.com/places/russia", "section_title": "Russia", "url": "https://www.reuters.com/article/us-newsnow-jan18/thursday-morning-briefing-idUSKBN1F71S0", "country": "US", "domain_rank": 408, "title": "Thursday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:37:00.000+02:00", "replies_count": 0, "uuid": "81eee16bba4d05a59f56f7edf0e5b45e8aaa9905"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan18/thursday-morning-briefing-idUSKBN1F71S0", "ord_in_thread": 0, "title": "Thursday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "netanyahu", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "united states reuters", "sentiment": "none"}, {"name": "north american free trade agreement", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Turkey flexes its muscles on the Syrian border, Apple plans a new U.S. campus and in an exclusive interview Trump talks NAFTA, the Israeli embassy and his exercise schedule.\nUnited States\nReuters reporters sat down to an exclusive interview with U.S. President Donald Trump. Here are the highlights:\nTrump denied that the planned relocation of the U.S. embassy in Israel to Jerusalem would take place within a year, after Prime Minister Benjamin Netanyahu said he expected the controversial move to happen by then. Netanyahu has since taken a step back from his comments.\nTrump said the United States was considering a big “fine” as part of a probe into China’s alleged theft of intellectual property, the clearest indication yet that his administration will take retaliatory trade action against China.\nTrump said that terminating the North American Free Trade Agreement would result in the “best deal” to revamp the 24-year-old trade pact with Canada and Mexico in favor of U.S. interests.\nTrump complained that Russia was helping North Korea to evade international sanctions , signaling frustration with a country he had hoped to forge friendly relations with after his 2016 election win.\nDo not expect Trump to hit the gym, despite his doctor’s orders. He gets plenty of exercise on the golf course and at the White House complex, the president told Reuters .\nWorld\nTurkey said it would not hesitate to take action in Syria’s Afrin district and other areas unless the United States withdrew support for a Kurdish-led force there, but Washington denied such plans and said “some people misspoke”.\nAn agreement between South and North Korea to march under a unity flag and field a joint ice hockey team at next month’s Olympics was met with sharp criticism by many in the South, highlighting changing attitudes toward the country’s northern neighbor.\nHaitians will no longer be eligible for U.S. visas given to low-skilled workers, the Trump administration said, bringing an end to a small-scale effort to employ Haitians in the United States after a catastrophic 2010 earthquake.\nZimbabwe will hold elections in four to five months, a newspaper Quote: d President Emmerson Mnangagwa as saying, the first time since independence the southern African state will conduct a vote that does not involve Robert Mugabe.\nBackstory\nIn our connected world, alerts sent directly to people’s phones or computers are part of everyday life. For news publishers, alerts are a major competitive battleground, presenting an opportunity to be first to break news, but Reuters did not publish the Hawaii alert, after realizing it was sent in error by an employee. Read the Backstory on how we break news by mobile alerts.\nA person enter in sauna on the peak of Mount Lagazuoi in Cortina D'Ampezzo, Italy January 16, 2018. Picture taken January 16, 2018. REUTERS/Stefano Rellandini Tech\nApple will open a new campus as part of a five-year, $30 billion U.S. investment plan and will make about $38 billion in one-time tax payments on its overseas cash, one of the largest corporate spending plans announced since the passage of a tax cut signed by Trump.\nBreakingviews : Tim Cook goes as American as Apple’s pie\nData center computers with Intel’s newer chips might reboot more often than normal because of problems with the patches issued to fix the so-called Spectre and Meltdown security flaws, the company said.\nGoldman Sachs has led a $38 million investment round by large banks in Visible Alpha, a young New York-based company that helps investment managers better value the equity research services they receive from brokers.\nReuters TV : Your future self-driving car may still be far away\nBusiness\nAmazon, which has made waves in recent years buying art-house movies at the Sundance Film Festival, is heading to the prestigious event this week with a long-term change in the works: It plans to shift resources from independent films to more commercial projects, people familiar with the matter told Reuters.\nAn alleged oil heist in Singapore that has already led to 20 arrests, the seizure of at least one tanker and allegations that thieves siphoned thousands of tonnes of fuel from Shell’s biggest refinery is shining a spotlight on an illegal trade worth tens of billions of dollars worldwide.\nEmirates announced a deal for up to 36 Airbus A380 aircraft worth as much as $16 billion at list prices, saving the world’s biggest passenger jet from death row and securing its future for at least another decade.\nThreats of a potential cryptocurrency trading ban in South Korea have scared many investors away, but some veterans of the young market are defiant , saying restrictions would be relatively easy to circumvent.\nCommentary\nFifth-generation wireless networks will be far faster and more reliable than existing 4G connections, writes former FCC chief economist Thomas W. Hazlett. However, rollout is impeded by an antiquated approach to regulation. Under the Radio Act of 1927, each slice of the airwaves must be allocated according to “public interest, convenience or necessity,” a bureaucracy-enforcing meme that remains a devil’s playground for insiders. “Auctioning spectrum rights and eliminating needless restrictions is the better way,” says Hazlett.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.reuters.tv/v/fdD/2018/01/18/your-future-self-driving-car-may-still-be-far-away"], "published": "2018-01-18T21:37:00.000+02:00", "crawled": "2018-01-19T00:54:45.012+02:00", "highlightTitle": ""}