{"organizations": [], "uuid": "d90a7bde3a5079a4b363bb4d2c694104f7327f9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/06/104882636-Tarana_Burke.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/19/metoo-founder-tarana-burke-has-big-plans-for-the-movement-in-2018.html", "country": "US", "domain_rank": 767, "title": "#MeToo founder Tarana Burke has big plans for the movement in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:25:00.000+02:00", "replies_count": 0, "uuid": "d90a7bde3a5079a4b363bb4d2c694104f7327f9a"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/19/metoo-founder-tarana-burke-has-big-plans-for-the-movement-in-2018.html", "ord_in_thread": 0, "title": "#MeToo founder Tarana Burke has big plans for the movement in 2018", "locations": [], "entities": {"persons": [{"name": "tarana burke", "sentiment": "negative"}, {"name": "burke", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "alyssa milano", "sentiment": "none"}, {"name": "milano", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "just be inc.", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Photo courtesy of Getty SHARES \nAfter hearing numerous stories about trauma from sexual assault and violence, Tarana Burke knew she had to do something to help the many survivors, like herself, heal. And so in 2006, Burke co-founded an organization called Just Be Inc. , where she focused on improving the health and well-being of young women of color. \n\"I had always wanted to do work around sexual violence in the community,\" Burke tells CNBC Make It . \"As a survivor I started thinking about what that would look like and what I needed at that age. That's when we came up with 'me too.'\" \nMore than a decade later, the words 'me too' started trending on social media when actress Alyssa Milano tweeted them in an effort to give voice to sexual abuse survivors as allegations against Harvey Weinstein mounted. Within 24 hours the words became a viral hashtag, with many women sharing their personal experiences of sexual violence. Reportedly , there were more than 12 million #metoo Facebook posts and reactions within a day of Milano's tweet. Twitter \nWhen the actress learned of Burke's long-time efforts around the issue, she sent her a direct message on Twitter to find out how she could lend further support. \n\"We just started talking from there and then I was invited to come on Good Morning America with her and you know from the moment she found out she acknowledged that the work existed,\" says Burke. \nWhile she's happy that many people have joined the movement, Burke says her plan now is to make sure that conversations around the issue continue beyond the trending headlines. \n\"There are a number of people who are anxious to leave #metoo behind and move on, but I don't think people realize how short of a time we have been discussing this issue compared to how long this has been an issue,\" she says. \"There is still work we have to do to expand our conversation around sexual violence and just the range of people who experience it and how they experience it.\" Chelsea Guglielmino | FilmMagic | Getty Images Take Back The Workplace March And #MeToo Survivors March & Rally on November 12, 2017 in Hollywood, California. \nRecently, Burke kicked off the Time's Square New Year's Eve ball drop in New York City, which she says was symbolic of how she plans to move #metoo forward in the new year, and earlier this month, she accompanied actress Michelle Williams to the Golden Globes. \n\"We're here because of Tarana,\" People reports Williams saying. \"You might think I'm here because I'm nominated for something, but that's not the case. Tarana started a movement. She planted a seed years ago and it's grown and caught fire.\" \nBurke, along with several other supporters of #metoo, was named Time magazine 2017 Person of the Year. Following the the cover story, Burke appeared on NBC's TODAY , alongside Milano, to emphasize that this is only the beginning of the work that needs to be done. \n\"This is just the start,\" she said. \"I've been saying from the beginning it's not just a moment, it's a movement. Now the work really begins.\" \nIn 2018, Burke plans to make the #metoo site a greater tool for both survivors and supporters of the issue. \n\"Our website will be a more comprehensive website and a community resource for people around sexual violence,\" she says. \"It will be a destination for people who are looking for support and those who want to do work around sexual violence in their own community both offline and online. As the year goes on we hope to offer training and workshops around the topic.\" \nLike this story? Like CNBC Make It on Facebook . \nDon't miss: ", "external_links": ["http://justbeinc.wixsite.com/justbeinc/home", "http://time.com/time-person-of-the-year-2017-silence-breakers/", "http://people.com/movies/golden-globes-2018-michelle-wlliams-daughter-me-too-tarana-burke/", "https://twitter.com/Alyssa_Milano/status/919659438700670976", "https://www.cbsnews.com/news/metoo-more-than-12-million-facebook-posts-comments-reactions-24-hours/", "https://www.today.com/video/metoo-creator-tarana-burke-it-s-not-just-a-moment-it-s-a-movement-1110556739965", "https://www.facebook.com/CNBCMakeIt/", "https://metoomvmt.org/"], "published": "2018-01-20T01:25:00.000+02:00", "crawled": "2018-01-20T00:34:39.007+02:00", "highlightTitle": ""}