{"organizations": [], "uuid": "cbf2b00f9155e67f96e53e7ee527e9c9bd86a23b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-flexport-hires-education-industry-veteran-gayle-allen-to-expand-people-operations.html", "country": "US", "domain_rank": 767, "title": "Flexport Hires Education Industry Veteran Gayle Allen to Expand People Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T17:00:00.000+02:00", "replies_count": 0, "uuid": "cbf2b00f9155e67f96e53e7ee527e9c9bd86a23b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-flexport-hires-education-industry-veteran-gayle-allen-to-expand-people-operations.html", "ord_in_thread": 0, "title": "Flexport Hires Education Industry Veteran Gayle Allen to Expand People Operations", "locations": [], "entities": {"persons": [{"name": "gayle allen", "sentiment": "negative"}, {"name": "flexport", "sentiment": "none"}, {"name": "flexp", "sentiment": "none"}, {"name": "allen", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "flexport hires education industry veteran", "sentiment": "negative"}, {"name": "massachusetts institute of technology", "sentiment": "none"}, {"name": "columbia university", "sentiment": "none"}, {"name": "teachers college", "sentiment": "none"}, {"name": "new york university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 15, 2018 /PRNewswire/ -- Flexport , a leading technology-enabled freight forwarder and customs broker, today announced that Gayle Allen will join the company as vice president of people operations, to further build out employee learning, growth, and development programs. Flexport's core offerings include consultative expertise in the outdated freight forwarding industry, driving the investment in workplace learning starting on the first day of work.\nGayle Allen is the founder of The Innovator's Circle, an organization that partners with company leaders to improve organizational performance. Prior to that, she served as chief learning officer at BrightBytes, an educational technology startup. Allen also served as an adjunct professor at Columbia University and New York University. She is the author of the book \"The New Pillars of Modern Teaching\" and also hosts a podcast called \"Curious Minds.\" Allen earned an M.B.A. in global innovation and leadership from the Massachusetts Institute of Technology and her doctorate from Teachers College, Columbia University.\nFlexport has more than doubled its headcount in the last year and expanded its footprint globally, with offices in Amsterdam, Atlanta, Hong Kong, Los Angeles, New York, San Francisco, and Shenzhen. Allen will be based in the company's San Francisco headquarters.\nAllen will be partnering with Flexport management to lift its culture of learning to new heights by creating a corporate university to encourage learning across the employee lifecycle. This global initiative will enhance existing programs within the company, such as Flexport Academy, an intensive new hire training program for global employees designed to bring industry newcomers up to speed in the complex world of freight logistics. Allen's role will also involve creating new learning tracks such as leadership courses for managers, and skill-building classes for employees of all levels.\n\"Flexport's mission is to fix global trade and our employees are fiercely passionate about how they contribute to our mission. Gayle's passion and experience for workplace learning make her a natural fit as we continue to hire and grow the very best talent around the world,\" said Sanne Manders , chief operating officer at Flexport. \"Top performers in any organization consider themselves lifelong students, and we're pleased to offer our employees a way to accelerate their careers while making an impact on the outdated supply chain industry.\"\n\"Corporate learning can serve as a remarkable competitive advantage, and it was clear to me that Flexport is committed to learning and performance improvement,\" said Gayle Allen , vice president of people operations. I'm excited to help Flexport employees around the world to grow the knowledge and skills they need to drive the company's remarkable growth, as well as their careers. My prior roles have taught me that the best teams work hard on how they collaborate, plan, and communicate, and that data holds the key to measuring significant outcomes.\"\nAbout Flexport\nFlexport is a technology-enabled freight forwarder and customs broker that provides companies with real-time data on the locations of their goods and unparalleled visibility into their supply chains. Flexport offers an online dashboard for businesses to easily understand, purchase, manage, and track services required by global trade. Founded in 2013, Flexport is backed by leading investors including DST Global, Founders Fund and Felicis Ventures. The company is headquartered in San Francisco, with offices in Amsterdam, Atlanta, Hong Kong, Los Angeles, New York, and Shenzhen. To learn more, visit flexport.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/flexport-hires-education-industry-veteran-gayle-allen-to-expand-people-operations-300582266.html\nSOURCE Flexport", "external_links": ["http://www.prnewswire.com/news-releases/flexport-hires-education-industry-veteran-gayle-allen-to-expand-people-operations-300582266.html"], "published": "2018-01-15T17:00:00.000+02:00", "crawled": "2018-01-15T18:51:15.011+02:00", "highlightTitle": ""}