{"organizations": [], "uuid": "a10430bcdedeee07099a4325f1351a6ee0ffacf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-zimbabwe-landrights-farmers/mugabes-demise-brings-hope-to-zimbabwes-ousted-white-farmers-idUSKBN1FJ1WX", "country": "US", "domain_rank": 408, "title": "FEATURE-Mugabe's demise brings hope to Zimbabwe's ousted white farmers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:51:00.000+02:00", "replies_count": 0, "uuid": "a10430bcdedeee07099a4325f1351a6ee0ffacf6"}, "author": "", "url": "https://www.reuters.com/article/us-zimbabwe-landrights-farmers/mugabes-demise-brings-hope-to-zimbabwes-ousted-white-farmers-idUSKBN1FJ1WX", "ord_in_thread": 0, "title": "FEATURE-Mugabe's demise brings hope to Zimbabwe's ousted white farmers", "locations": [], "entities": {"persons": [{"name": "mugabe", "sentiment": "negative"}, {"name": "robert mugabe", "sentiment": "none"}, {"name": "chris mahove", "sentiment": "none"}], "locations": [{"name": "zimbabwe", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "none"}, {"name": "min read  harare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 1:59 PM / Updated an hour ago Mugabe's demise brings hope to Zimbabwe's ousted white farmers Chris Mahove 5 Min Read \nHARARE (Thomson Reuters Foundation) - A new political dawn in Zimbabwe has sparked talk among farmers of land reform and the return of some whites who lost their land and livelihoods to President Robert Mugabe during a 37-year rule that drove the economy to collapse. \nMugabe, 93, resigned in November after the army and his ZANU-PF party turned against him, prompting optimism among some of the thousands of white farmers ousted in the early 2000s on the grounds of redressing imbalances from the colonial era. \nFor colonialists seized some of the best agricultural land that remained in the hands of white farmers after independence in 1980 leaving many blacks effectively landless and making land ownership one of Zimbabwe’s most sensitive political topics. \nNow some white landowners hope the post-Mugabe regime may address the land issue, either through compensation or returning land, and try to resuscitate a once vibrant agricultural sector boosting an economy once seen as one of Africa’s great hopes. \n“We are convinced positive signals will come quickly in terms of property rights,” Ben Purcel Gilpin, director of the Commercial Farmers Union (CFU), which represents white and black farmers, told the Thomson Reuters Foundation. \n“It would send a good signal to people outside Zimbabwe.” \nNew president and long-time Mugabe ally, Emmerson Mnangagwa, has promised a raft of changes since he took office, including a return to the rule of law and respect for property rights. \nLand ownership has been a key issue for decades in Zimbabwe dating back to British colonial rule in what was then Rhodesia. \nAt independence, white farmers owned more than 70 percent of the most fertile land and generated 80 percent of the country’s agricultural output, according to academics. \nReforms began after independence with a “willing buyer, willing seller” system aimed at redistributing land to poor black subsistence farmers. In the 1990s, compulsory acquisition of land began with some funding provided by Britain. \nBut for many Zimbabweans change was too slow and Mugabe approved radical land reforms that encouraged occupation of some 4,000 white-owned farms. Land went to his supporters with no knowledge of farming and thousands of white farmers fled. \nThe violent farm seizures saw Zimbabwe forfeit its status as the bread basket of Africa and led to a collapse of many industries that depended on agriculture. Among those were paper mills, textile firms, leather tanners and clothing companies. \nAs a result the country failed to generate foreign currency, resulting in the central bank printing money which led to unprecedented levels of hyper-inflation and high unemployment. NEW START \nNow some white farmers are starting to reclaim their land. \n“White commercial farmers, like all other Zimbabweans, could apply for land from the Government and join the queue or go into joint ventures,” Mnangagwa told a former white commercial farmer during a recent visit to Namibia. \nThe CFU’s Gilpin - who quit farming and moved to Harare after his farm was compulsorily acquired by the government in 2005 - said sound policies from the new team could win support and help the economy. \nHe said compensation rather than putting people back into their properties might be the best route as many farmers are now too old to farm, some had died and others migrated. \nThe current situation - where resettled farmers had 99-year leases - was also untenable as the leases were not accepted by banks as collateral against borrowing. \nGilpin said this effectively made the land dead capital, as banks could not sell if farmers failed to pay back loans, so the government should instead offer farmers freehold titles. \nProperty rights expert Lloyd Mhishi, a senior partner in the law firm Mhishi Nkomo Legal Practice, said although Mnangagwa spoke about compensating farmers whose land was expropriated, he did not give specifics and title deeds of the former white farmers had no legal force after repossession. POLITICAL WAY OUT \n“As far as the law of the country is concerned, the title deeds that the former white commercial farmers hold do not guarantee them title,” Mhishi said in an interview. \nBut the lawyer said there were positive signs that the new administration realized land was a vital cog in the economy. \n“I see there will be an attempt to make land useful, productive,” he said. “The land tenure side needs to be addressed to make land useful.” \nIndependent economist John Robertson, a former Advisor to the Reserve Bank of Zimbabwe, said, however, that any idea of compensation should be dropped and former white commercial farmers should get back to their land and resume work. \n“I’d rather see them get back their land and start farming again than paid out and emigrating. We need their skills. If people who oppose that idea could be just successful, where have they been for the past 20 years?” he said. Reporting by Chris Mahove,Editing by Lyndsay Griffiths and Belinda Goldsmith; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": [], "published": "2018-01-30T15:51:00.000+02:00", "crawled": "2018-01-30T16:23:28.000+02:00", "highlightTitle": ""}