{"organizations": [], "uuid": "61a931d71b6b3a0e863a01e8ca722eb7a14ae363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/saudi-arrests-corruption/update-1-saudi-closes-hotel-detention-centre-as-corruption-purge-winds-down-idUSL8N1PP0X1", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Saudi closes hotel detention centre as corruption purge winds down", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:45:00.000+02:00", "replies_count": 0, "uuid": "61a931d71b6b3a0e863a01e8ca722eb7a14ae363"}, "author": "", "url": "https://www.reuters.com/article/saudi-arrests-corruption/update-1-saudi-closes-hotel-detention-centre-as-corruption-purge-winds-down-idUSL8N1PP0X1", "ord_in_thread": 0, "title": "UPDATE 1-Saudi closes hotel detention centre as corruption purge winds down", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "ritz-carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}, {"name": "ritz-carlton hotel", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ritz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 7:47 AM / in 8 minutes UPDATE 1-Saudi closes hotel detention centre as corruption purge winds down Reuters Staff 3 Min Read \n(Adds context, analysis) \nRIYADH, Jan 30 (Reuters) - Saudi Arabian authorities have released all remaining detainees from Riyadh’s opulent Ritz-Carlton Hotel, which had been used as an interrogation centre in a crackdown on corruption, a Saudi official said on Tuesday. \nThe news signalled that the three-month-old purge, in which dozens of top officials and businessmen were detained by investigators who said they aimed to seize some $100 billion of illicit assets, was drawing to a close. \n“There are no longer any detainees left at the Ritz-Carlton,” the official told Reuters, speaking on condition of anonymity under briefing rules. \nHe did not say how many suspects remained in detention at other locations in Saudi Arabia. Some are believed to have been moved from the Ritz to prison after refusing to admit wrongdoing and reach financial settlements with the authorities. \nLast week, the attorney general said that countrywide most detainees had agreed to settlements, 90 had been released after charges were dropped, and 95 remained in custody. Some cases will go to trial. \nAmong top businessmen caught up in the purge were Prince Alwaleed, owner of global investor Kingdom Holding, and Waleed al-Ibrahim, who controls influential regional broadcaster MBC. \nMBC said the investigation found Ibrahim completely innocent of wrongdoing and Prince Alwaleed has insisted he is innocent, although Saudi officials said both men agreed to settlements after admitting unspecified “violations”. \nIn an interview with Reuters at his suite in the Ritz-Carlton hours before he was released on Saturday, Prince Alwaleed said he had been well-treated in custody and described his case as the result of a misunderstanding. \nHe showed off the comforts of his suite’s gold-accented private office, a dining room and a kitchen which was fully stocked with his preferred vegetarian meals. \nThe hotel has 492 guest rooms and suites and 52 acres (21 hectares) of landscaped gardens, according to its website. It has said it will reopen to the public in mid-February, with a nightly rate for its cheapest room of 2,439 riyals ($650). (Reporting by Samia Nakhoul and Stephen Kalin; Writing by Andrew Torchia; Editing by Michael Georgy and Peter Graff)", "external_links": [], "published": "2018-01-30T09:45:00.000+02:00", "crawled": "2018-01-30T09:57:17.005+02:00", "highlightTitle": ""}