{"organizations": [], "uuid": "b44c76a391cefcb4cd8ec0994ea62bd6bf4a4ebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221521642&w=1200&r=LYNXMPEE0B1E4", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur-benteke/inconsistent-benteke-at-a-career-crossroads-idUKKBN1F12CJ", "country": "US", "domain_rank": 408, "title": "Inconsistent Benteke at a career crossroads", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T20:28:00.000+02:00", "replies_count": 0, "uuid": "b44c76a391cefcb4cd8ec0994ea62bd6bf4a4ebd"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur-benteke/inconsistent-benteke-at-a-career-crossroads-idUKKBN1F12CJ", "ord_in_thread": 0, "title": "Inconsistent Benteke at a career crossroads", "locations": [], "entities": {"persons": [{"name": "benteke", "sentiment": "negative"}, {"name": "neil", "sentiment": "negative"}, {"name": "robinson", "sentiment": "none"}, {"name": "hodgson", "sentiment": "none"}, {"name": "roy hodgson", "sentiment": "none"}, {"name": "christian benteke", "sentiment": "none"}, {"name": "frank de boer", "sentiment": "none"}], "locations": [{"name": "southampton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "st mary's stadium", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "crystal palace", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "reuters/peter cziborra", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:30 PM / Updated 15 minutes ago Inconsistent Benteke at a career crossroads Neil Robinson 3 Min Read \nLONDON (Reuters) - While Roy Hodgson has succeeded in kickstarting a Crystal Palace revival, the manager has failed to get Christian Benteke scoring again - and time appears to be running out for the Belgian. FILE PHOTO - Soccer Football - Premier League - Southampton vs Crystal Palace - St Mary's Stadium, Southampton, Britain - January 2, 2018 Crystal Palace's Christian Benteke. Action Images via Reuters/Peter Cziborra \nWhen Hodgson succeeded Frank de Boer last September, it was widely believed that his back to basics 4-4-2 approach might bring the best out of the mercurial striker. \nAlthough Palace have risen from bottom to 14th place in the Premier League, Benteke has only managed one goal and two assists in 16 appearances this season. \nThat is hardly an acceptable return for a striker Palace invested 27 million pounds ($36.91 million) in August 2016. \nAlthough Hodgson remains publicly supportive, other observers have made clear their views on the striker. \n“Crystal Palace have bought a £30million pup!” outspoken former chairman Simon Jordan told radio station talkSport earlier this season. \n“He has lost his appetite from back in the day when he was a top player at Villa.” \nThe statistics support Jordan’s assessment with Benteke’s goal-to-game ratio in the league falling from one in two (42 in 89) at Aston Villa to below one in three at Liverpool (nine in 29) and Palace (16 in 52). \nThe 27-year-old hit a new low earlier this season when he pulled rank over team mate Luka Milivojevic to take -- and then miss -- a crucial penalty against Bournemouth. \nAlthough Benteke subsequently impressed in scoring in the 3-0 win over Leicester City, the Belgian has flat-lined again and British media report that Hodgson has lost patience and is now casting around for a replacement in the transfer window. \nIt is hard to avoid the view that he is approaching a pivotal moment in a stop-start six-year Premier League career. \nFormer Liverpool midfielder Danny Murphy is among those who retains the faith. \n“Benteke is a highly effective striker in the Premier League, as he has shown with Palace and Aston Villa,” he wrote in his Evening Standard column. \n“If you can bring the best from him, he will score - and if you have a prolific forward, it is a hell of an asset if you are trying to stay in the division.” \nThat explains why other clubs continue to be linked with a striker who up to this season has usually delivered goals, many from outrageous positions. \nThe problem has been finding the consistency required at Premier League level and eradicating the mistakes, often in defence, that have hampered his game. \nIt is hard to escape the conclusion that the turnaround needs to start quickly if he is to retain Hodgson’ faith. Reporting by Neil Robinson, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-12T20:28:00.000+02:00", "crawled": "2018-01-12T20:55:54.031+02:00", "highlightTitle": ""}