{"organizations": [], "uuid": "dc9dbb81a9d55890c7d3f195003af1d88ccb2cd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/01/globe-newswire-national-commerce-corporation-announces-closing-of-merger-with-firstatlantic-financial-holdings-inc.html", "country": "US", "domain_rank": 767, "title": "National Commerce Corporation Announces Closing of Merger with FirstAtlantic Financial Holdings, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T19:00:00.000+02:00", "replies_count": 0, "uuid": "dc9dbb81a9d55890c7d3f195003af1d88ccb2cd2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/01/globe-newswire-national-commerce-corporation-announces-closing-of-merger-with-firstatlantic-financial-holdings-inc.html", "ord_in_thread": 0, "title": "National Commerce Corporation Announces Closing of Merger with FirstAtlantic Financial Holdings, Inc.", "locations": [], "entities": {"persons": [{"name": "richard murray", "sentiment": "none"}, {"name": "paul grube", "sentiment": "none"}, {"name": "mitch hunt", "sentiment": "none"}, {"name": "mitch", "sentiment": "none"}, {"name": "mitchell w. hunt", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "ala.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "national commerce corporation announces closing of merger", "sentiment": "negative"}, {"name": "national commerce corporation", "sentiment": "negative"}, {"name": "firstatlantic financial holdings, inc", "sentiment": "neutral"}, {"name": "national bank of commerce", "sentiment": "none"}, {"name": "firstatlantic financial holdings", "sentiment": "none"}, {"name": "firstatlantic bank", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "ncc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BIRMINGHAM, Ala., Jan. 01, 2018 (GLOBE NEWSWIRE) -- National Commerce Corporation (Nasdaq:NCOM) (“NCC”), the parent company of National Bank of Commerce (“NBC”), headquartered in Birmingham, Alabama, announced today the completion of the merger of FirstAtlantic Financial Holdings, Inc. (OTCQX:FFHD) (“FirstAtlantic”), the parent company of FirstAtlantic Bank, with and into NCC. Concurrently with the merger, FirstAtlantic Bank merged with and into NBC, but its offices will continue to operate under the “FirstAtlantic Bank” trade name, and its management team will continue with NBC.\n“We are extremely pleased to partner with the team at FirstAtlantic,” said Richard Murray, IV, President and Chief Executive Officer of NCC. “Mitch Hunt and his team have built a great bank, and we believe they are an excellent fit for our company. We welcome the clients, shareowners and employees of FirstAtlantic Bank to NCC. We look forward to working together with Mitch and Paul Grube as they lead our growth in the greater Jacksonville market.”\nMitchell W. Hunt, Jr., President and Chief Executive Officer of FirstAtlantic, also spoke about the merger, saying, “We are very pleased to join with our friends at NCC, and we look forward to our partnership. We believe we will be in an even better position to serve our customers as a part of National Bank of Commerce.”\nIn connection with the merger, Thomas H. Coley, a director of FirstAtlantic and FirstAtlantic Bank, has been appointed to the Boards of Directors of both NCC and NBC. Coley has previously served as Executive Vice President, Head of Southern Banking Group at Wachovia Corporation and as Vice Chairman of SouthTrust Corporation.\nKeefe, Bruyette & Woods, Inc. acted as financial adviser to NCC, and Maynard, Cooper & Gale, P.C. acted as its legal adviser. FIG Partners, LLC acted as financial adviser to FirstAtlantic, and Troutman Sanders LLP acted as its legal adviser.\nAbout National Commerce Corporation\nNational Commerce Corporation (Nasdaq:NCOM), a Delaware corporation, is a financial holding company headquartered in Birmingham, Alabama. Substantially all of the operations of National Commerce Corporation are conducted through the company’s wholly owned subsidiary, National Bank of Commerce. National Bank of Commerce currently operates seven full-service banking offices in Alabama, twenty-two full-service banking offices in central and northeast Florida (including under the trade names United Legacy Bank, Reunion Bank of Florida, Patriot Bank and FirstAtlantic Bank) and two full-service banking offices in the Atlanta, Georgia metro area (including under the trade names Private Bank of Buckhead, Private Bank of Decatur and PrivatePlus Mortgage). National Bank of Commerce provides a broad array of financial services for commercial and consumer customers.\nAdditionally, National Bank of Commerce owns a majority stake in Corporate Billing, LLC, a transaction-based finance company based in Decatur, Alabama that provides factoring, invoicing, collection and accounts receivable management services to transportation companies and automotive parts and service providers throughout the United States and parts of Canada.\nNational Commerce Corporation files periodic reports with the U.S. Securities and Exchange Commission (the “SEC”). Copies of its filings may be obtained through the SEC’s website at www.sec.gov or at www.nationalbankofcommerce.com . More information about National Commerce Corporation and National Bank of Commerce may be obtained at www.nationalbankofcommerce.com .\nForward-Looking Statements\nCertain statements contained in this press release that are not statements of historical fact constitute forward-looking statements for which NCC claims the protection of the safe harbor provisions contained in the Private Securities Litigation Reform Act of 1995 (the “Act”), notwithstanding that such statements are not specifically identified as such. In addition, certain statements may be contained in NCC’s future filings with the SEC, in press releases and in oral and written statements made by NCC or with NCC’s approval that are not statements of historical fact and that constitute forward-looking statements within the meaning of the Act. Words such as “believes,” “anticipates,” “expects,” “intends,” “targeted,” “continue,” “remain,” “will,” “should,” “may” and other similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements.\nForward-looking statements (including oral representations) involve risks and uncertainties that may cause actual results to differ materially from any future results, performance or achievements expressed or implied by such statements. These risks and uncertainties include difficulties, delays and unanticipated costs in integrating NBC’s and FirstAtlantic Bank’s businesses or realizing expected cost savings and other benefits; business disruptions as a result of the integration of the merging organizations, including possible loss of customers; diversion of management time to address transaction-related issues; and changes in asset quality and credit risk as a result of the merger. These risks also include a number of factors related to the business of NCC and the banking business generally, including various risks to stockholders of not receiving dividends; risks to NCC’s ability to pursue growth opportunities; various risks to the price and volatility of NCC’s common stock; NCC’s ability to incur additional financial obligations in the future; risks associated with NCC’s possible pursuit of future acquisitions; economic conditions in NCC’s current service areas, including the new service areas created by the merger; system failures; losses of large customers; disruptions in relationships with third-party vendors; losses of key management personnel and the inability to attract and retain highly qualified management and personnel in the future; changes in the extensive governmental legislation and regulations governing banking; high costs of regulatory compliance; the impact of legislation and regulatory changes, including changes in the tax laws, on the banking industry; and liability and compliance costs regarding banking regulations.\nForward-looking statements made by NCC in this press release or elsewhere speak only as of the date on which the statements were made. You are advised to read the risk factors in NCC’s most recently filed Annual Report on Form 10-K and subsequent filings with the SEC, which are available through the website maintained by the SEC at www.sec.gov or by accessing information available at www.nationalbankofcommerce.com . New risks and uncertainties arise from time to time, and it is impossible for NCC to predict these events or how they may affect it or its anticipated results. NCC has no duty to, and does not intend to, update or revise the forward-looking statements in this press release, except as may be required by law. In light of these risks and uncertainties, readers should keep in mind that any forward-looking statement made in this press release may not occur. All information presented herein is as of the date of this release unless otherwise noted.\nContact Information\nRichard Murray, IV\nPresident and Chief Executive Officer\nNational Commerce Corporation\n(205) 313-8100\nSource:National Commerce Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/15aab92d-5b97-468c-9a2a-9d4ee6435248"], "published": "2018-01-01T19:00:00.000+02:00", "crawled": "2018-01-01T18:50:18.062+02:00", "highlightTitle": ""}