{"organizations": [], "uuid": "699196ade3c07b25ef44b5e92099cdd36c03fe95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-peak-resorts-declares-quarterly-cash-dividend-of-0-point-07.html", "country": "US", "domain_rank": 767, "title": "Peak Resorts Declares Quarterly Cash Dividend of $0.07", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T00:35:00.000+02:00", "replies_count": 0, "uuid": "699196ade3c07b25ef44b5e92099cdd36c03fe95"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-peak-resorts-declares-quarterly-cash-dividend-of-0-point-07.html", "ord_in_thread": 0, "title": "Peak Resorts Declares Quarterly Cash Dividend of $0.07", "locations": [], "entities": {"persons": [{"name": "timothy d. boyd", "sentiment": "none"}], "locations": [{"name": "wildwood", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILDWOOD, Mo., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Peak Resorts, Inc. (NASDAQ:SKIS) (“Peak” or the “Company”), a leading owner and operator of high-quality, individually branded U.S. ski resorts, announced today that its Board of Directors has declared a quarterly cash dividend of $0.07 per outstanding share of its common stock. The cash dividend is payable on February 9, 2018 to common shareholders of record as of January 25, 2018 and represents an annualized yield of 5.3% based on the $5.25 per share closing price of the Company’s stock on January 9, 2018.\nTimothy D. Boyd, President and Chief Executive Officer, commented, “We are pleased to continue our commitment to provide competitive returns to our shareholders through a quarterly cash dividend, reflecting Peak Resorts’ confidence in our financial performance and our focus on delivering long-term shareholder value. We are excited by the opportunities ahead to continue to invest in the growth of our business through return-focused expansion projects across our existing resort portfolio and via the pursuit of additional mountain acquisitions. We believe we remain well-positioned to succeed on both fronts going forward.”\nAbout Peak Resorts\nHeadquartered in Missouri, Peak Resorts is a leading owner and operator of high-quality, individually branded ski resorts in the U.S. The company operates 14 ski resorts primarily located in the Northeast and Midwest, 13 of which are company owned.\nThe majority of the resorts are located within 100 miles of major metropolitan markets, including New York City, Boston, Philadelphia, Cleveland and St. Louis, enabling day and overnight drive accessibility. The resorts under the company's umbrella offer a breadth of activities, services and amenities, including skiing, snowboarding, terrain parks, tubing, dining, lodging, equipment rentals and sales, ski and snowboard instruction and mountain biking and other summer activities. To learn more, visit the company’s website at ir.peakresorts.com or follow Peak Resorts on Facebook for resort updates.\nFor further information, or to receive future Peak Resorts news announcements via e-mail, please contact JCIR, at 212-835-8500 or skis@jcir.com .\nForward Looking Statements\nThis news release contains forward-looking statements regarding the future outlook and performance of Peak Resorts, Inc., within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from current expectations. These risks and uncertainties are discussed under the caption “Risk Factors” in the company’s Annual Report on Form 10-K for the year ended April 30, 2017, filed with the Securities and Exchange Commission (the “SEC”), and as updated from time to time in the company’s filings with the SEC. Peak Resorts undertakes no obligation to release publicly the result of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\nInvestor Contact:\nNorberto Aja, Jim Leahy, Joseph Jaffoni\nJCIR\n212-835-8500 or skis@jcir.com\nSource:Peak Resorts, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/0a806960-268d-42cf-95fb-7301c602c725"], "published": "2018-01-10T00:35:00.000+02:00", "crawled": "2018-01-10T02:26:29.000+02:00", "highlightTitle": ""}