{"organizations": [], "uuid": "0219e93a0906b9c9c94f293457463b524057e8db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-blackstone-mortgage-trust-announces-tax-treatment-of-2017-dividends.html", "country": "US", "domain_rank": 767, "title": "Blackstone Mortgage Trust Announces Tax Treatment Of 2017 Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T01:00:00.000+02:00", "replies_count": 0, "uuid": "0219e93a0906b9c9c94f293457463b524057e8db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-blackstone-mortgage-trust-announces-tax-treatment-of-2017-dividends.html", "ord_in_thread": 0, "title": "Blackstone Mortgage Trust Announces Tax Treatment Of 2017 Dividends", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "blackstone mortgage trust", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "blackstone mortgage trust, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 26, 2018 /PRNewswire/ -- Blackstone Mortgage Trust, Inc. (NYSE: BXMT) today announced the tax treatment of its 2017 class A common stock dividends. The following table summarizes Blackstone Mortgage Trust's class A common stock dividend payments for the tax year ended December 31, 2017:\nRecord\nPayment\nCash\nOrdinary\nQualified\nCapital Gain\nDate\nDate\nDistribution\nAdjustment\nDividend (1)\nDividends\nDividends\nDividends\n3/31/2017\n4/17/2017\n$ 0.62\n$ 0.00\n$ 0.62\n$0.602641\n$0.\n$0.017359\n6/30/2017\n7/14/2017\n$ 0.62\n$ 0.00\n$ 0.62\n$0.602641\n$0.\n$0.017359\n9/29/2017\n10/13/2017\n$ 0.62\n$ 0.00\n$ 0.62\n$0.602641\n$0.\n$0.017359\n12/29/2017\n1/16/2018\n$ 0.62\n$ (0.21)\n$ 0.41\n$0.398521\n$0.\n$0.011479\n$ 2.48\n$ (0.21)\n$ 2.27\n$2.206444\n$0.\n$0.063556\n(1) Pursuant to IRC Section 857(b)(9), cash distributions made on January 16, 2018 with a record date of December 29, 2017 are treated as received by shareholders on December 29, 2017 to the extent of 2017 earnings and profits. As the Company's aggregate 2017 cash distributions exceeded its 2017 earnings and profits, a portion of the January 2018 cash distribution declared in the fourth quarter of 2017 was treated as a 2018 distribution for federal income tax purposes and not included on the 2017 Form 1099. If you were a stockholder of record as of December 31, 2017, $0.41 is reported on your 2017 Form 1099 and $0.21 will be reported on your 2018 Form 1099.\nAbout Blackstone Mortgage Trust\nBlackstone Mortgage Trust (NYSE: BXMT) is a real estate finance company that originates senior loans collateralized by commercial real estate in North America and Europe. Our investment objective is to preserve and protect shareholder capital while producing attractive risk-adjusted returns primarily through dividends generated from current income from our loan portfolio. We are externally managed by BXMT Advisors L.L.C., a subsidiary of Blackstone. Further information is available at www.bxmt.com .\nAbout Blackstone\nBlackstone (NYSE: BX) is one of the world's leading investment firms. Blackstone seeks to create positive economic impact and long-term value for its investors, the companies it invests in, and the communities in which it works. Blackstone does this by using extraordinary people and flexible capital to help companies solve problems. Blackstone's asset management businesses, with over $385 billion in assets under management, include investment vehicles focused on private equity, real estate, public debt and equity, non-investment grade credit, real assets and secondary funds, all on a global basis. Further information is available at www.blackstone.com . Follow Blackstone on Twitter @Blackstone .\nForward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"indicator,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates\" or the negative version of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties. Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. Blackstone Mortgage Trust believes these factors include but are not limited to those described under the section entitled \"Risk Factors\" in its Annual Report on Form 10-K for the fiscal year ended December 31, 2016, as such factors may be updated from time to time in its periodic filings with the Securities and Exchange Commission (\"SEC\") which are accessible on the SEC's website at www.sec.gov . These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this release and in the filings. Blackstone Mortgage Trust assumes no obligation to update or supplement forward‐looking statements that become untrue because of subsequent events or circumstances.\nView original content: http://www.prnewswire.com/news-releases/blackstone-mortgage-trust-announces-tax-treatment-of-2017-dividends-300588993.html\nSOURCE Blackstone Mortgage Trust, Inc.", "external_links": ["http://www.bxmt.com/", "https://twitter.com/blackstone", "http://www.sec.gov/", "http://www.blackstone.com/", "http://www.prnewswire.com/news-releases/blackstone-mortgage-trust-announces-tax-treatment-of-2017-dividends-300588993.html"], "published": "2018-01-27T01:00:00.000+02:00", "crawled": "2018-01-27T02:07:41.002+02:00", "highlightTitle": ""}