{"organizations": [], "uuid": "423574e277c5bddd409d7261246631ab0a54de9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/us", "section_title": "US Stock Market News - Dow Jones, Nasdaq, S&amp;P 500 | Reuters.com", "url": "https://www.reuters.com/article/diary-emrg-econ/diary-emerging-markets-economic-events-to-feb-23-idUSL4N1OT3MA", "country": "US", "domain_rank": 408, "title": "DIARY-Emerging Markets Economic Events to Feb 23", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T08:04:00.000+02:00", "replies_count": 0, "uuid": "423574e277c5bddd409d7261246631ab0a54de9f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/diary-emrg-econ/diary-emerging-markets-economic-events-to-feb-23-idUSL4N1OT3MA", "ord_in_thread": 0, "title": "DIARY-Emerging Markets Economic Events to Feb 23", "locations": [], "entities": {"persons": [{"name": "politi", "sentiment": "negative"}], "locations": [{"name": "philippines - philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "sofitel philippines plaza", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "diary-emerging markets economic events", "sentiment": "negative"}, {"name": "santiago - central bank of chile", "sentiment": "none"}, {"name": "general news events index of all diaries guide to economic indicators", "sentiment": "none"}, {"name": "budapest - hungarian central bank", "sentiment": "none"}, {"name": "warsaw - national bank of poland", "sentiment": "none"}, {"name": "prague - czech national bank", "sentiment": "none"}, {"name": "belgrade - national bank of serbia", "sentiment": "none"}, {"name": "cape town - south africa reserve bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 1 (Reuters) -\nFor other diaries, please see:\nTop Economic Events\nGovernment Debt Auctions\nPolitical and General News Events\nIndex of All Diaries\nGuide to Economic Indicators This Diary is filed daily.\nTUESDAY, JANUARY 2 SANTIAGO - Central Bank of Chile to publish minutes of November policy meeting.\nWEDNESDAY, JANUARY 3 PRAGUE - Czech National Bank will release the minutes of its December 2017 Monetary Policy Meeting.\nTUESDAY, JANUARY 9 WARSAW - National Bank of Poland holds monetary policy council meeting (to Jan. 10).\nWEDNESDAY, JANUARY 10 BUDAPEST - Hungarian Central Bank to publish the minutes of its November rate-setting meeting – 1300 GMT.\nTHURSDAY, JANUARY 11 BELGRADE - National Bank of Serbia interest rate decision.\nWEDNESDAY, JANUARY 17 CAPE TOWN - South Africa Reserve Bank starts its two-day monetary policy committee meeting – (to Jan. 18).\nTHURSDAY, JANUARY 18 ** MANILA, Philippines - Philippines finance and socioeconomic planning ministers, and central bank deputy governor at the 1st Global Forum on Infrastructure Strategies, at the Sofitel Philippines Plaza, Manila.\nWEDNESDAY, JANUARY 24 TBILISI - National Bank of Georgia holds its monetary policy committee meeting.\nTHURSDAY, JANUARY 25 KIEV - National Bank of Ukraine holds monetary policy meeting.\nTUESDAY, JANUARY 30 WARSAW - National Bank of Poland holds Monetary Policy Council Meeting (No Interest rate announcement).\nBUDAPEST - Hungarian Central Bank holds its rate-setting meeting - 1300 GMT\nSUNDAY, JANUARY 31 SANTIAGO - Central Bank of Chile holds monetary policy meeting (to Feb. 1).\nTHURSDAY, FEBRUARY 1 PRAGUE - Czech National Bank holds monetary policy meeting. Statement and presentation will be published. WARSAW - National Bank of Poland releases the minutes of its monitory policy meeting.\nTUESDAY, FEBRUARY 6 SYDNEY - Reserve Bank of Australia (RBA) holds interest rate meeting - 0330 GMT. BRASILIA- Central Bank of Brazil holds monetary policy committee meeting (to Feb. 7). WARSAW - National Bank of Poland holds monetary policy council meeting (to Feb. 7).\nTHURSDAY, FEBRUARY 8 BELGRADE - National Bank of Serbia interest rate decision. MEXICO - Central Bank of Mexico publishes Monetary policy statement. SYDNEY - Speech by RBA Governor Philip Lowe at A50 Australian Economic Forum dinner, Sydney.\nFRIDAY, FEBRUARY 9 PRAGUE - Czech National Bank will release the minutes of its February 2018 monetary policy meeting. SYDNEY - Reserve Bank of Australia issues statement on monetary policy – 0030 GMT. MOSCOW - Central Bank of Russia announces interest rate decision - 1030 GMT.\nMONDAY, FEBRUARY 12 SYDNEY - Speech by Luci Ellis, RBA Assistant Governor (Economic) at ABE Forecasting conference, Sydney – 2030 GMT.\nWEDNESDAY, FEBRUARY 14 BANGKOK - Bank of Thailand monetary policy committee meeting. KAMPALA - Bank of Uganda announces interest rate decision. BUDAPEST - Hungarian Central Bank to publish the minutes of its January 2018 rate-setting meeting – 1300 GMT.\nTHURSDAY, FEBRUARY 15 CAIRO - Central Bank of Egypt holds monetary policy committee meeting.\nMONDAY, FEBRUARY 19 SYDNEY - Speech by Michele Bullock, RBA Assistant Governor (Financial System) at Responsible Lending and Borrowing Summit, Sydney – 2215 GMT.\nTUESDAY, FEBRUARY 20 SYDNEY - Reserve Bank of Australia (RBA) will release the minutes of February Monetary Policy Meeting – 0030 GMT. WARSAW - National Bank of Poland holds monetary policy council meeting (no interest rate announcement).\nTHURSDAY, FEBRUARY 22 WARSAW - National Bank of Poland releases the minutes of its monitory policy meeting. MEXICO - Mexico Central Bank issues the minutes of its monetary policy meeting. FRIDAY, FEBRUARY 23 SYDNEY - Reserve Bank of Australia Payments System Board Meeting.", "external_links": [], "published": "2018-01-01T08:04:00.000+02:00", "crawled": "2018-01-01T04:01:00.002+02:00", "highlightTitle": ""}