{"organizations": [], "uuid": "ef4dfe53b303d0dbde982612af7ec1b7bf9305f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-mexico-economy-consumer/warning-light-mexican-car-sales-slump-ahead-of-election-idUSKBN1F52LP", "country": "US", "domain_rank": 408, "title": "Warning light: Mexican car sales slump ahead of election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:10:00.000+02:00", "replies_count": 0, "uuid": "ef4dfe53b303d0dbde982612af7ec1b7bf9305f6"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-economy-consumer/warning-light-mexican-car-sales-slump-ahead-of-election-idUSKBN1F52LP", "ord_in_thread": 0, "title": "Warning light: Mexican car sales slump ahead of election", "locations": [], "entities": {"persons": [{"name": "sharay angulo", "sentiment": "negative"}, {"name": "jaime asrael", "sentiment": "none"}, {"name": "anthony esposito", "sentiment": "none"}], "locations": [{"name": "guerrero", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "chevrolet", "sentiment": "none"}, {"name": "min read  mexico city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " Car dealerships in Mexico City have kicked off the new year offering “clearance sales” and free insurance as 2017 models collect dust on their lots, a reminder that consumer nerves over high interest rates could slow the economy ahead of elections.\nThe first drop in auto sales in eight years is the most visible sign the great Mexican shopper, the heart and soul of Latin America’s second largest economy, is feeling the pinch of inflation at a 16-1/2-year high and a battered peso.\nA government decision to scrap fuel subsidies last year has made running a car more expensive, while the central bank’s battle with inflation has put car loans out of reach for many.\n“If I‘m going to buy a new car and then not be able to fill it up with gasoline, then it’s better to sit tight,” said Jaime Asrael, as he window shopped outside a Chevrolet dealership in the central Guerrero neighborhood of the capital city.\nBeyond cars, consumer confidence is slipping more broadly. The consumer confidence index declined to 88.4 in December from 88.8 the previous month, the statistics agency said last week.\nThis has worried government officials who are trying to convince voters to re-elect the ruling Institutional Revolutionary Party (PRI) in July. Experts doubt increased public spending in the campaign will be enough to boost confidence much in Mexico, where private consumption accounts for a whopping two-thirds of gross domestic product.\nLeftist opposition candidate Andres Manuel Lopez Obrador has enjoyed a double digit poll lead over his ruling party rival in recent surveys.\n“It certainly helps his case. The fact that we’ve seen this jump in inflation squeezing real incomes, that all (goes) into the mix,” said Neil Shearing, chief emerging markets economist at Capital Economics.\nA blow such as an eventual collapse of talks to renegotiate the North American Free Trade Agreement could make more consumers snap their wallets shut.\nSlideshow (8 Images) “I wouldn’t be surprised if we see a more significant deceleration of private consumption” considering inflation’s impact on wages, tighter credit conditions and NAFTA and election concerns, said Goldman Sachs economist Alberto Ramos.\n“Instead of going on vacation for two weeks, they go one week, instead of buying the automobile this year they wait a little bit to see how things go ... That is serious in the sense that private consumption has been so far the main engine of growth,” said Ramos.\nDomestic car sales in 2017 fell 4.6 percent from a year earlier, according to data from the Mexican Auto Industry Association (AMIA). It was the first drop in annual auto sales since the global financial crisis of 2008-2009.\n“Inflation is what hit us the most. And most people want to buy with credit and financial institutions and banks weren’t able to cover the market,” said Jose Luis Salas, general manager at Grupo Surman, which runs 13 General Motors ( GM.N ) dealerships in the country.\n“That’s what caused the drop in new car sales,” he added.\nWider retail sales slowed to growth of 7.7 percent through November, not far above the 2017 inflation rate of 6.77 percent and below the average growth of some 10 percent the prior two years.\nFor years, stable prices compensated for Mexico’s sluggish economic growth, so accelerating inflation has caused outrage. Sporadic looting broke out earlier this month after reports that gasoline and food prices were about to be hiked, and angry posts filled social media, echoing unrest last year after the government liberalized fuel prices.\nThe central bank in November revised down its 2017 economic growth forecast, blaming the NAFTA talks, the impact of storms and two major earthquakes in September, and a drop in domestic oil production to the lowest in more than 20 years.\nIt forecast economic growth of 1.8 percent to 2.3 percent in 2017 and 2 to 3 percent in 2018.\nThe bank, which in December hiked its key rate to a consumption-sapping, nearly nine-year high of 7.25 percent, said it expected a “nascent deceleration” in consumer spending. It is widely expected to raise rates again in February, according to bets in the interest rate swap market BOMWATCH2.\nReporting by Sharay Angulo and Anthony Esposito; Editing by David Gregorio\n ", "external_links": [], "published": "2018-01-16T22:10:00.000+02:00", "crawled": "2018-01-16T22:30:34.000+02:00", "highlightTitle": ""}