{"organizations": [], "uuid": "243a359d145e77bd4babd51afc3d031e49f7c4f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-banks/italian-banking-commission-fails-to-approve-joint-findings-sources-idUSL8N1PP31V", "country": "US", "domain_rank": 408, "title": "Italian banking commission fails to approve joint findings -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:43:00.000+02:00", "replies_count": 0, "uuid": "243a359d145e77bd4babd51afc3d031e49f7c4f7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-banks/italian-banking-commission-fails-to-approve-joint-findings-sources-idUSL8N1PP31V", "ord_in_thread": 0, "title": "Italian banking commission fails to approve joint findings -sources", "locations": [], "entities": {"persons": [{"name": "matteo renzi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rome", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "democratic party", "sentiment": "none"}, {"name": "northern league", "sentiment": "none"}, {"name": "bank of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME, Jan 30 (Reuters) - A cross-party parliamentary commission set up to look into the collapse of 10 Italian banks in the past two years has failed to agree on joint findings, political sources said on Tuesday.\nThe commission only started work in September and quickly became a focal point of political campaigning ahead of a national election on March 4.\nOpposition parties, led by the anti-establishment 5-Star Movement and the right-wing Northern League, have attacked the ruling Democratic Party (PD) for the banking scandals in which thousands of Italians lost their savings.\nFormer prime minister Matteo Renzi, whose PD looks set to lose power, says the responsibility lies with bank supervisors, especially the Bank of Italy. The central bank denies any blame.\nPolitical sources said this month the commission might approve various recommendations, including that the Bank of Italy be given more investigative powers and that market watchdogs should share information more freely.\nThe commission was also expected to call for the creation of a national prosecutors’ office focused on financial crimes.\nIt was not immediately clear why there was no final accord. The political parties are now expected to present their own separate findings and recommendations.\nThe government spent more than 20 billion euros ($24.8 billion) last year to prop up the banking sector, injecting 5.4 billion euros to salvage Italy’s fourth-biggest bank, Monte dei Paschi di Siena, and offering billions of euros in guarantees as it wound down two major banks in the Veneto region.\nFour other smaller banks were wound down in 2015, hitting small savers.\nUnderscoring the sensitivity of the issue, the 5-Star Movement announced on Monday it would field a businessman who lost money in the banking scandals as its candidate to challenge Prime Minister Paolo Gentiloni in his Rome constituency.\n5-Star’s Angiolino Cirulli lost his savings when the small Banca Etruria collapsed. The bank became a lightning rod for opposition fury because one of its board members was the father of a close Renzi ally and cabinet minister. ($1 = 0.8065 euros) (Reporting by Giuseppe Fonte, writing by Crispian Balmer, editing by Gavin Jones)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T18:43:00.000+02:00", "crawled": "2018-01-31T16:35:20.034+02:00", "highlightTitle": ""}