{"organizations": [], "uuid": "9127646fa75b37e915d5af9037850146a7f4f038", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-ballard-announces-narrowed-focus-and-further-cost-reductions-at-protonex-subsidiary.html", "country": "US", "domain_rank": 767, "title": "Ballard Announces Narrowed Focus and Further Cost Reductions at Protonex Subsidiary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T06:30:00.000+02:00", "replies_count": 0, "uuid": "9127646fa75b37e915d5af9037850146a7f4f038"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-ballard-announces-narrowed-focus-and-further-cost-reductions-at-protonex-subsidiary.html", "ord_in_thread": 0, "title": "Ballard Announces Narrowed Focus and Further Cost Reductions at Protonex Subsidiary", "locations": [], "entities": {"persons": [{"name": "ballard", "sentiment": "negative"}], "locations": [{"name": "ma", "sentiment": "none"}, {"name": "southborough", "sentiment": "none"}], "organizations": [{"name": "protonex subsidiary vancouver", "sentiment": "negative"}, {"name": "bldp", "sentiment": "negative"}, {"name": "ballard power systems", "sentiment": "negative"}, {"name": "protonex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER and SOUTHBOROUGH, MA, Jan. 3, 2018 /PRNewswire/ - Ballard Power Systems (NASDAQ: BLDP; TSX: BLDP) today announced that, as a result of its strategic review in 2017 of its Protonex subsidiary, the Company has recently implemented certain changes at Protonex, including to narrow and sharpen the focus of its business by divesting certain non-core assets. This divestiture is expected to yield annualized cost savings of $1.4 million per year. This action is in addition to steps taken in August 2017 to reduce and align the Protonex cost base. Together, these actions are expected to yield annualized cost savings of $2.6 million, better positioning Protonex to deliver future profitability.\nThe Protonex business had three businesses: Power Manager, Unmanned Aerial Vehicles (UAV's), and Solid Oxide Fuel Cells (SOFC). In 2017 Ballard conducted a strategic review of each of these business activities to determine the most effective strategic course for each business.\nPower Manager:\nThe Power Manager business has underperformed against expectations, primarily due to unexpected delays in achieving a certain procurement milestone in the U.S. Army's Program of Record. Ballard initially expected to achieve this milestone in 2016; however, the milestone was not achieved until September 2017. This Program of Record includes a number of new devices focused on improving power and energy management on and around the soldier, including Protonex' Squad Power Manager Kit (SPM-622), conformal wearable batteries, and man-worn power and data distribution devices, such as the Protonex Vest Power Manager family. As a result of this milestone, which enables full rate production status, Ballard now expects growth in the Power Manager business beginning in 2018.\nUAV:\nProtonex has made significant progress in the UAV business, both in the military market and the commercial market, including key business planning, field trials and business development activities. Ballard plans to re-brand the commercial UAV business with the Ballard brand under the leadership of Phil Robinson, previously Vice President, Defense Power Systems at Protonex, who was appointed as Vice President, UAV.\nSOFC:\nWith respect to the SOFC business, Protonex had been engaged in certain product development and commercialization programs for small-scale SOFC stationary power products. In 2017 it was determined that these assets were not core to Ballard's proton exchange membrane (PEM) fuel cell business, and the company decided to divest these non-core assets. As a result, certain SOFC assets were transferred to a private, start-up company, Upstart Power Inc., effective December 31, 2017, for nominal consideration. Initially, 10 Protonex employees have moved to Upstart Power Inc., with an additional 6 employees expected to be transferred later this year on completion of certain Technology Solutions contracts. As part of this transfer of employees, Dr. Paul Osenar, previously President of Protonex, has moved to Upstart Power Inc. as CEO. This action has enabled Ballard to significantly reduce the cost structure at Protonex. Ballard has no ownership interest or liabilities associated with Upstart Power Inc.\nWith Dr. Osenar's departure, Dave Long, previously Vice President, Electronics and Systems at Protonex, has been appointed interim General Manager at Protonex.\nAbout Ballard Power Systems\nBallard Power Systems (NASDAQ: BLDP; TSX: BLDP) provides clean energy products that reduce customer costs and risks, and helps customers solve difficult technical and business challenges in their fuel cell programs. To learn more about Ballard, please visit www.ballard.com .\nThis release contains forward-looking statements concerning anticipated product performance, customer benefits and market demand for our products. These forward-looking statements reflect Ballard's current expectations as contemplated under section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Any such forward-looking statements are based on Ballard's assumptions relating to its financial forecasts and expectations regarding its product development efforts, manufacturing capacity, and market demand.\nThese statements involve risks and uncertainties that may cause Ballard's actual results to be materially different, including general economic and regulatory changes, detrimental reliance on third parties, successfully achieving our business plans and achieving and sustaining profitability. For a detailed discussion of these and other risk factors that could affect Ballard's future performance, please refer to Ballard's most recent Annual Information Form. Readers should not place undue reliance on Ballard's forward-looking statements and Ballard assumes no obligation to update or release any revisions to these forward looking statements, other than as required under applicable legislation.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy securities. The Ballard Common Shares have not been registered under the United States Securities Act of 1933, as amended, or the securities laws of any other jurisdiction and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.\nSOURCE Ballard Power Systems Inc.", "external_links": ["http://www.ballard.com/"], "published": "2018-01-04T06:30:00.000+02:00", "crawled": "2018-01-04T07:15:11.029+02:00", "highlightTitle": ""}