{"organizations": [], "uuid": "ee5095ddb70d2608c407f7fc025b25456d4a916e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-wealthengine-creates-advisory-board-and-appoints-mike-sullivan.html", "country": "US", "domain_rank": 767, "title": "WealthEngine Creates Advisory Board and Appoints Mike Sullivan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:00:00.000+02:00", "replies_count": 0, "uuid": "ee5095ddb70d2608c407f7fc025b25456d4a916e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-wealthengine-creates-advisory-board-and-appoints-mike-sullivan.html", "ord_in_thread": 0, "title": "WealthEngine Creates Advisory Board and Appoints Mike Sullivan", "locations": [], "entities": {"persons": [{"name": "mike sullivan", "sentiment": "negative"}, {"name": "dennis ainge", "sentiment": "negative"}, {"name": "mike", "sentiment": "none"}, {"name": "sullivan", "sentiment": "none"}, {"name": "wealthengine", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "wealthengine creates advisory board", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 24, 2018 /PRNewswire/ -- WealthEngine, under the new leadership of Dennis Ainge, has created an executive advisory board. The purpose of the advisory board is to provide strategic guidance to the business as it continues to lead the nonprofit market and accelerate its expansion into commercial markets, bringing world-class wealth intelligence to fundraising, sales, and marketing professionals. The board will bring in data industry experts with diverse backgrounds to offer objective, creative, and strategic points of view to the WealthEngine leadership team.\nWealthEngine has selected Mike Sullivan as the first member of the advisory board. Sullivan is a seasoned financial and operating executive with nearly 30 years of experience in the data and software industries.\nDennis Ainge, interim CEO, stated, \"We are thrilled to have Mike join us as a strategic advisor to the company. His expertise will be crucial to our continued push into the financial services, luxury, real estate, travel, and other industry market segments.\"\nSullivan has served as a CFO for various technology companies since 1999 including E-centives, Inc., Viaken Systems, NexTone Communications Corp., TARGUS Information Corporation, and Lotame Solutions, Inc. His financial expertise in the data industry will provide WealthEngine with invaluable insight into growth strategies and will help accelerate WealthEngine's presence, expansion and execution in the commercial market.\nSullivan stated, \"It's great to be teamed up with Dennis again. Together, and with other members of TARGUSinfo, we built one of the most successful marketing and analytics companies in the U.S. I see similar potential in WealthEngine – unique data assets and niche data solutions to those companies looking to target individuals with the capacity to give or spend more. I'm confident we'll be able to help WealthEngine grow in both the nonprofit and commercial markets and I'm eager to jump in.\"\nAbout WealthEngine\nWealthEngine is a leading provider of predictive marketing analytics, audience development, and wealth intelligence services. Named a Cool Vendor in Data-Driven Marketing by Gartner, sales, marketing and fundraising professionals use WealthEngine's comprehensive insights to find, understand, and engage with their clients and prospects. Headquartered in Bethesda, MD, WealthEngine provides clients in the United States with solutions that provide a more complete picture of the people they already know and tools to find new people they need to know. WealthEngine provides solutions and services to financial services firms, luxury organizations, nonprofits, hospitals, institutions of higher education, political campaigns, advocacy groups of all sizes, and any other organization looking to use wealth data to enhance their efforts. For more information, please visit wealthengine.com .\nContact\nRebecca Remy, Marketing Coordinator – 240.722.4370 or rremy@wealthengine.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/wealthengine-creates-advisory-board-and-appoints-mike-sullivan-300586869.html\nSOURCE WealthEngine", "external_links": ["http://www.wealthengine.com/", "http://www.prnewswire.com/news-releases/wealthengine-creates-advisory-board-and-appoints-mike-sullivan-300586869.html"], "published": "2018-01-24T15:00:00.000+02:00", "crawled": "2018-01-24T14:56:38.000+02:00", "highlightTitle": ""}