{"organizations": [], "uuid": "ca290791aab1486a057391aa22b822395b9b5407", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-sobi-names-holly-may-vice-president-of-sales-and-marketing-in-united-states.html", "country": "US", "domain_rank": 767, "title": "Sobi Names Holly May Vice President of Sales and Marketing in United States", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.279, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "ca290791aab1486a057391aa22b822395b9b5407"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-sobi-names-holly-may-vice-president-of-sales-and-marketing-in-united-states.html", "ord_in_thread": 0, "title": "Sobi Names Holly May Vice President of Sales and Marketing in United States", "locations": [], "entities": {"persons": [{"name": "sobi", "sentiment": "negative"}, {"name": "holly may", "sentiment": "none"}], "locations": [{"name": "united states waltham", "sentiment": "none"}, {"name": "mass.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "sobi", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "sobi inc.", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass.--(BUSINESS WIRE)-- Sobi, a pioneering international biopharmaceutical company dedicated to rare and difficult-to-treat diseases, announced today that experienced commercial leader Holly May has joined the company as vice president of sales and marketing for the United States.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180125005014/en/\nHolly May, Vice President, Sales and Marketing, United States, Sobi Inc. (Photo: Business Wire)\nMay will lead the commercial team in bringing Sobi’s multiple approved medicines to patients in the U.S. She will collaborate with the operations and patient access team to ensure the medicines Sobi provides are optimally accessible to as many appropriate patients as possible. Additionally, she will support the launch of new products in the U.S. derived from Sobi’s pipeline of proprietary medicines or from external sources of innovation.\nMay’s more than 20 years of experience in biopharmaceutical sales and marketing includes previous positions focusing on patients suffering from rare diseases. Most recently she served as vice president and head of U.S. marketing for Fabry disease and lysosomal storage disorders at Sanofi Genzyme, and prior to that she served as vice president and head of the U.S. Fabry disease, responsible for both the commercial activities and teams at Genzyme Corp. May held multiple sales and marketing positions during her 17 year career at Sanofi, including director of marketing operations and strategic planning for Sanofi’s Global Oncology Division and regional sales director for Sanofi’s cardiovascular business unit. Prior to joining Sanofi, May held various sales and marketing positions at DuPont Pharmaceuticals Co., DuPont Merck Pharmaceutical Co. and Endo LLC.\n“Sobi has a 30 year legacy in the rare disease field, and globally we market 35 medicines across 67 countries. As we look to increase our footprint specifically in North America, where more than 33 million patients are estimated to suffer from a rare disease, Holly’s experience will be incredibly valuable,” said Rami Levin, president of Sobi in North America.\n“I have been privileged to work in the rare disease field, leading commercial teams in providing education to patients, caregivers and physicians around important rare disease issues such as diagnosis, disease symptoms and treatment options, while always seeking to better understand the patient journey and improve the patient experience,” said May. “I look forward to applying my expertise to help Sobi bring its existing and future products to patients who need them.”\nAbout Sobi™\nSobi is an international specialty healthcare company dedicated to rare diseases. Sobi’s mission is to develop and deliver innovative therapies and services to improve the lives of patients. The product portfolio is primarily focused on Haemophilia, Inflammation and Genetic diseases. Sobi also markets a portfolio of specialty and rare disease products across Europe, the Middle East, North Africa and Russia for partner companies. Sobi is a pioneer in biotechnology with world-class capabilities in protein biochemistry and biologics manufacturing. In 2016, Sobi had total revenues of SEK 5.2 billion (USD 608 M) and about 760 employees. The share (STO: SOBI) is listed on Nasdaq Stockholm. More information is available at www.sobi.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005014/en/\nSobi Inc.\nTrista Morrison, 781-810-0490\ntrista.morrison@sobi.com\nSource: Sobi Inc.", "external_links": ["http://www.businesswire.com/news/home/20180125005014/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sobi.com%2F&esheet=51746349&newsitemid=20180125005014&lan=en-US&anchor=www.sobi.com&index=1&md5=069dd1fa5b86b47f0e30249cb05b0fcd"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:34:34.000+02:00", "highlightTitle": ""}