{"organizations": [], "uuid": "a89f925635d0c800f629c14a0e10203523e294fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-japan-economy-wages/japans-top-business-lobby-calls-on-members-to-raise-wages-by-3-percent-idUSKBN1F50ZU", "country": "US", "domain_rank": 408, "title": "Japan's top business lobby calls on members to raise wages by 3 percent", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:00:00.000+02:00", "replies_count": 0, "uuid": "a89f925635d0c800f629c14a0e10203523e294fc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-japan-economy-wages/japans-top-business-lobby-calls-on-members-to-raise-wages-by-3-percent-idUSKBN1F50ZU", "ord_in_thread": 0, "title": "Japan's top business lobby calls on members to raise wages by 3 percent", "locations": [], "entities": {"persons": [{"name": "shinzo abe", "sentiment": "none"}, {"name": "abe", "sentiment": "none"}, {"name": "yasumi kudo", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "keidanren", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japan’s top business lobby on Tuesday called on companies to raise wages by 3 percent during annual salary negotiations with unions this spring, a boost to the government’s efforts to encourage inflation.\nPrime Minister Shinzo Abe has been pushing Japanese companies to raise wages by 3 percent or more to support consumer spending. The government will introduce tax breaks from April for companies that comply with the call.\nThe Keidanren business lobby represents only the country’s largest firms, but its vocal endorsement of wage hikes could encourage more mid-sized firms to follow suit.\n“It is becoming more important to not only raise wages but also improve total compensation,” Yasumi Kudo, a vice chairman at Keidanren, told reporters.\n“Earnings are better than last fiscal year, and (a 3 percent wage increase) is part of a social mandate, meaning we should actively consider this.”\nSince taking office in late 2012, Abe has appealed directly to the largest business lobbies to raise wages at annual negotiations with unions that take place in the spring.\nAbe’s overriding goal is to make sure consumers have enough money in their pockets to keep spending - vanquishing the threat of deflation and making it easier to finally meet the Bank of Japan’s 2 percent inflation target.\nIn November, the core consumer price index, which includes oil products but excludes fresh food, rose only 0.9 percent from the same period a year earlier.\nLast year, the average wage increase among 312 major companies was 2.11 percent before bonuses, according to labor ministry figures.\nSuccessive years of tiny, or even zero, wage increases may be coming to an end at some companies at least – which in turn could provide consumer spending and inflation with a welcome boost this year.\nAbe’s government plans to introduce legislation to the regular session of parliament beginning later this month that will lower the corporate tax rate to 25 percent from around 30 percent for companies that raise wages by 3 percent or more.\nThe proposed legislation, which is almost certain to pass, would also cut taxes for companies that invest in cutting-edge technology.\nReporting by Izumi Nakagawa; Writing by Stanley White; Editing by Richard Borsuk\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T18:00:00.000+02:00", "crawled": "2018-01-16T13:10:09.010+02:00", "highlightTitle": ""}