{"organizations": [], "uuid": "d142620d0326a36751a319c68994b4526c7872eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-intouch-health-enters-agreement-to-acquire-truclinic-entering-direct-to-consumer-telehealth.html", "country": "US", "domain_rank": 767, "title": "InTouch Health Enters Agreement to Acquire TruClinic, Entering Direct-to-Consumer Telehealth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.861, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "d142620d0326a36751a319c68994b4526c7872eb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-intouch-health-enters-agreement-to-acquire-truclinic-entering-direct-to-consumer-telehealth.html", "ord_in_thread": 0, "title": "InTouch Health Enters Agreement to Acquire TruClinic, Entering Direct-to-Consumer Telehealth", "locations": [], "entities": {"persons": [{"name": "joseph m. devivo", "sentiment": "none"}], "locations": [{"name": "santa barbara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "intouch health", "sentiment": "negative"}, {"name": "klas", "sentiment": "none"}, {"name": "intouch health platform", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA BARBARA, Calif., InTouch Health , the leading enterprise telehealth platform, today announced that it has entered into a definitive agreement to acquire TruClinic , a web-based telemedicine provider based in Salt Lake City, Utah, specializing in direct-to-consumer virtual care solutions. Through the acquisition, InTouch Health expands its existing portfolio to deliver a full range of virtual care programs to healthcare providers, enabling continuity of care between physicians and patients. Terms of the transaction were not disclosed.\n\"We are thrilled to welcome TruClinic to the InTouch Health family. TruClinic is the perfect addition to the InTouch Health Platform, which will soon offer health systems home-to-home virtual care solutions,\" said Joseph M. DeVivo, InTouch Health Chief Executive Officer. \"By bringing InTouch Health and TruClinic together – already two of the top-rated telehealth companies according to KLAS – we will reshape the way healthcare systems look at virtual care and ultimately the way they can interact with their patients. This acquisition puts InTouch Health firmly in a leadership position with a breadth of technologies and a Network unrivaled by any other telehealth provider.\"\nHistorically, telehealth providers offer only a solution for a segment of the patient care continuum. This has forced health systems to acquire and integrate solutions from multiple vendors, often creating interoperability challenges for physicians to care for their patients as well as data management continuity for health systems. InTouch Health will incorporate TruClinic's software into its offering such that patients can now initiate and receive a consult with their health system physician from their home, further extending InTouch Health's unified telehealth solution across the continuum of care, and solving this frustrating problem for physicians.\nThe combined solution from InTouch Health and TruClinic will empower health systems to provide virtual care using their own internal physicians or by leveraging InTouch Health's national network of contracted physicians if needed, offering healthcare systems a choice and full control in how they virtually care for patients.\n\"TruClinic is a configurable and modular telehealth software platform designed with the flexibility to be applied in any physician's office. TruClinic allows healthcare providers to stand up a virtual clinic that conforms to their own unique workflows,\" said Justin Kahn, TruClinic founder and chief executive officer. \"TruClinic's software is easy to use, affordable and scalable – which allows our customers to use the technology to conform to any use case, workflow, or subset of patients. We are thrilled to become part of InTouch Health to provide a comprehensive option to customers looking to expand into direct-to-consumer solutions.\"\nTruClinic will be merged with InTouch Health and brought to market under the leadership of Steve Cashman, recently appointed EVP of Marketing and Consumer Solutions .\n\"TruClinic is commercially available and we look forward to working immediately with health systems to implement virtual clinics worldwide,\" Cashman said.\nAbout InTouch Health\nInTouch Health, the top-rated vendor in KLAS Research's Telehealth Virtual Care Platforms 2017 performance report, provides its world class, 24/7 monitored InTouch Telehealth Network, comprised of regulated telehealth systems, clinical workflow solutions and software, and managed services to hospitals and healthcare systems for the delivery of clinical care, anytime, anywhere. Today, InTouch Health supports more than 130 healthcare systems, 7,700 registered network users, and 1,780 care locations around the world as they deploy telehealth programs across their enterprises. InTouch Health has surpassed 1,680,000 network sessions, which includes 940,000 telehealth virtual care sessions over the InTouch Telehealth Network, and is forecasted to manage more than 300,000 clinical sessions in the next year. To learn more, please visit: www.intouchhealth.com\nAbout TruClinic:\nTruClinic, rated atop KLAS' Telehealth Virtual Care Platforms 2017 performance report, provides web-based telemedicine solutions for providers and organizations in the healthcare industry. The company offers a secure, high definition video communication system, as well as a suite of practice management products that extend the reach of healthcare practices. TruClinic's mission is to make telemedicine available to everyone by providing simple, secure, and convenient solutions.\n with multimedia: releases/intouch-health-enters-agreement-to-acquire-truclinic-entering-direct-to-consumer-telehealth-300577607.html\nSOURCE InTouch Health", "external_links": ["https://na01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.intouchhealth.com&data=02%7C01%7CLiz.Hilton%40edelman.com%7C76f439da56c7411ef63908d51278a6ca%7Cb824bfb3918e43c2bb1cdcc1ba40a82b%7C0%7C0%7C636435231791372629&sdata=dolevQQgj9NmcbgTAQQ6jjq1OsrTcRdAf%2Beqm1QFgcQ%3D&reserved=0", "https://truclinic.com/", "https://intouchhealth.com/about/press-room/2017/steve-cashman-joins-intouch-health.html", "http://www.intouchhealth.com/", "http://www.prnewswire.com/news-releases/intouch-health-enters-agreement-to-acquire-truclinic-entering-direct-to-consumer-telehealth-300577607.html"], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:38:50.000+02:00", "highlightTitle": ""}