{"organizations": [], "uuid": "f96e1d66ed18f72f291a086221dfdc307d56e69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-meridian-bancorp-inc-announces-completion-of-meetinghouse-bancorp-inc-acquisition.html", "country": "US", "domain_rank": 767, "title": "Meridian Bancorp, Inc. Announces Completion of Meetinghouse Bancorp, Inc. Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "f96e1d66ed18f72f291a086221dfdc307d56e69e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-meridian-bancorp-inc-announces-completion-of-meetinghouse-bancorp-inc-acquisition.html", "ord_in_thread": 0, "title": "Meridian Bancorp, Inc. Announces Completion of Meetinghouse Bancorp, Inc. Acquisition", "locations": [], "entities": {"persons": [{"name": "richard j. gavegnano", "sentiment": "none"}, {"name": "anthony a. paciulli", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "roslindale", "sentiment": "none"}, {"name": "dorchester", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "meridian bancorp, inc", "sentiment": "neutral"}, {"name": "announces completion of meetinghouse bancorp, inc", "sentiment": "neutral"}, {"name": "meridian bancorp, inc.", "sentiment": "neutral"}, {"name": "east boston savings bank", "sentiment": "none"}, {"name": "meetinghouse bancorp, inc.", "sentiment": "none"}, {"name": "meetinghouse", "sentiment": "none"}, {"name": "meridian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Meridian Bancorp, Inc. (“Meridian”) (NASDAQ:EBSB), the holding company for East Boston Savings Bank, announced today that, effective December 29, 2017, it has completed its acquisition of Meetinghouse Bancorp, Inc. (“Meetinghouse”). Upon completion of the merger, each Meetinghouse stockholder became entitled to receive $26.00 in cash for each share of Meetinghouse common stock that they held at the effective time of the merger.\n“We are excited to announce the completion of the Meetinghouse acquisition today. We believe that the acquisition will enable us to continue to grow our banking franchise in the Boston metropolitan area and expand our presence in the Dorchester and Roslindale markets,” said Richard J. Gavegnano, President and Chief Executive Officer of Meridian.\nAnthony A. Paciulli, President and Chief Executive Officer of Meetinghouse, said “We are proud to be joining Meridian and East Boston Savings Bank, which has served the Boston market for generations with a similar culture and common commitment to local decision making, exceptional personal service and community support.”\nPiper Jaffray & Co. acted as financial advisor to Meridian, and Kilpatrick Townsend & Stockton LLP served as legal counsel to Meridian. Keefe, Bruyette & Woods, Inc. acted as financial advisor to Meetinghouse and Nutter McClennen & Fish LLP served as legal counsel to Meetinghouse.\nAbout Meridian Bancorp, Inc.\nMeridian Bancorp, Inc. is the holding company for East Boston Savings Bank. East Boston Savings Bank, a Massachusetts-chartered stock savings bank founded in 1848, operates 33 full-service locations in the greater Boston metropolitan area. East Boston Savings Bank offers a variety of deposit and loan products to individuals and businesses located in its primary market, which consists of Essex, Middlesex, Norfolk and Suffolk Counties, Massachusetts. For additional information, visit www.ebsb.com .\nForward Looking Statements\nThis press release contains “forward-looking” statements as defined in the Private Securities Litigation Reform Act of 1995, which are based on Meridian’s current expectations, estimates and projections about future events. This includes statements regarding the integration efforts following the completion of the Meetinghouse acquisition, Meridian’s ability to expand its services and realize growth and efficiencies through the acquisition of Meetinghouse and Meetinghouse Bank, Meridian’s expectations regarding the internal rate of return on the acquisition, merger-related expenses and the impact of the transaction on Meridian’s earnings, market share and capital position. These statements are not historical facts or guarantees of future performance, events or results. Such statements involve potential risks and uncertainties, such as Meridian’s ability to integrate Meetinghouse Bank as planned and the general effects of financial, economic, regulatory and political conditions affecting the banking and financial services industries. Accordingly, actual results may differ materially. Meridian undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, other risks and uncertainties may be described in Meridian’s Annual Report on Form 10-K, its Quarterly Reports on Form 10-Q or its other reports as filed with the Securities and Exchange Commission, which are available through the SEC’s website at www.sec.gov . Should one or more of these risks materialize, actual results may vary from those anticipated, estimated or projected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Except as may be required by applicable law or regulation, Meridian assumes no obligation to update any forward-looking statements.\nContact: Richard J. Gavegnano, Chairman, President and Chief Executive Officer\n(978) 977-2211\nSource:Meridian Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=sfrFHwk8QgOM5XuKoj009JPtxJdsRFknV0j4EG8gqT75Fpo4WhcHIzw_aglc3Co3e3NwabX8XrkeWS2TB-w7Ig==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/91929bb1-1c62-4a0a-9141-4390c3294336"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:31:13.019+02:00", "highlightTitle": ""}