{"organizations": [], "uuid": "70871b845685784765a06e50600d164e91646cdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1P73RI", "country": "US", "domain_rank": 408, "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:54:00.000+02:00", "replies_count": 0, "uuid": "70871b845685784765a06e50600d164e91646cdf"}, "author": "", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1P73RI", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [{"name": "niki", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "new zealand banking group ltd", "sentiment": "none"}, {"name": "carrefour", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "blackstone group lp", "sentiment": "none"}, {"name": "ss&c technologies holdings inc", "sentiment": "none"}, {"name": "hna group", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "showroomprive.com", "sentiment": "none"}, {"name": "carlyle group lp", "sentiment": "none"}, {"name": "dst systems inc", "sentiment": "none"}, {"name": "pitney bowes inc", "sentiment": "none"}, {"name": "puma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:06 AM / Updated 6 minutes ago Deals of the day-Mergers and acquisitions Reuters Staff 4 Min Read \n(Adds Deutsche Bank, Niki, Puma and France on AI takeovers. Updates Carrefour) \nJan 12 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 1345 GMT on Friday: \n** U.S. mail management company Pitney Bowes Inc has received takeover interest from private equity firms Blackstone Group LP and Carlyle Group LP, according to the Financial Times, citing a Bloomberg report. \n** SS&C Technologies Holdings Inc said on Thursday it would buy DST Systems Inc in a $5.4 billion deal, expanding its financial technology software prowess through its largest deal to date. \n** Australia and New Zealand Banking Group Ltd has dropped plans to sell its vehicle finance unit to HNA Group after New Zealand blocked the $460 million deal last month over concerns about the Chinese conglomerate’s ownership structure. \n** Investors welcomed supermarket retailer Carrefour’s acquisition of a stake in online fashion retailer Showroomprive.com, and analysts added they wanted more moves by the company in this area. \n** Deutsche Bank sees a need for the banking industry to consolidate further and sees Germany’s flagship lender well positioned for that development, deputy Chief Executive Marcus Schenck said. \n** An Austrian court decided that airline Niki’s insolvency has to be handled mainly in Austria, a court spokesman said, a move that could unravel the agreed sale to British Airways owner IAG. \n** The French government aims to broaden its powers to block foreign takeovers of French companies deemed as strategic, to also include firms involved in data protection and artificial intelligence (‘AI’), the finance minister said. \n** Puma shares tumbled after French parent Kering said it would spin-off the German sportswear group to its shareholders and focus solely on its luxury fashion and jewellery labels. \n** Puma has no plans to take on other brands such as Kering’s Volcom for the moment, the German sports brand’s chief executive said. \n** The Australian competition regulator said it would begin reviewing of the sale of Reckon Ltd’s accounting practice management software business to MYOB Group which was announced in November last year. \n** Melrose, the British industrials turnaround specialist, plans to continue to pursue its bid for engineering group GKN, according to a source familiar with the matter. \n** GKN has rejected as “entirely opportunistic” a takeover offer from turnaround specialist Melrose and set out plans to split its business to boost profitability, sending shares in the British engineering firm up 25 percent. \n** Mauritius’s SBM Holdings will acquire 75 percent of the value of certain deposits of Kenya’s Chase bank plus matched liabilities, the Kenyan central bank said. \n** Indonesian regional and central government officials signed an agreement with state holding company PT Inalum that lays the foundation for transfer of Freeport-McMoRan Inc’s giant Grasberg copper mine to local control. \n** Venture capitalist Peter Thiel has made an offer for Gawker, hoping to overcome legal hurdles and rival bidders for the online news site the billionaire helped shutter by funding litigation against it, people familiar with the matter said on Thursday. \n** Malaysia’s Top Glove Corp Bhd said it has acquired a surgical glove business owned by Adventa Capital Pte Ltd for 1.37 billion ringgit ($345 million). \n** The Federal Communications Commission said on Thursday it was pausing its review of Sinclair Broadcast Group Inc’s plan to buy Tribune Media Co. (Compiled by Ahmed Farhatha in Bengaluru)", "external_links": [], "published": "2018-01-12T15:54:00.000+02:00", "crawled": "2018-01-12T16:09:17.001+02:00", "highlightTitle": ""}