{"organizations": [], "uuid": "bdf7adcce0a16af2a03963063045812c755cf1b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-advanced-bionics-announces-health-canada-approval-for-the-new-hifocusa-slimj-electrode.html", "country": "US", "domain_rank": 767, "title": "Advanced Bionics Announces Health Canada Approval for the New HiFocus™ SlimJ Electrode", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.569, "site_type": "news", "published": "2018-01-09T21:00:00.000+02:00", "replies_count": 0, "uuid": "bdf7adcce0a16af2a03963063045812c755cf1b0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-advanced-bionics-announces-health-canada-approval-for-the-new-hifocusa-slimj-electrode.html", "ord_in_thread": 0, "title": "Advanced Bionics Announces Health Canada Approval for the New HiFocus™ SlimJ Electrode", "locations": [], "entities": {"persons": [], "locations": [{"name": "munich", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "valencia", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "advanced bionics announces health canada approval", "sentiment": "negative"}, {"name": "technical inspection authority", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "health canada", "sentiment": "none"}, {"name": "advanced bionics (ab", "sentiment": "none"}, {"name": "food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "—The HiFocus™ SlimJ Electrode, the latest electrode on the HiRes™ Ultra cochlear implant platform, offers protection to the delicate structures of the cochlea—\nVALENCIA, Calif.--(BUSINESS WIRE)-- Advanced Bionics (AB) announces Health Canada approval of the HiFocus™ SlimJ electrode . Health Canada approval follows approval by FDA (Food and Drug Administration) in the United States and TÜV (Technical Inspection Authority, Munich, Germany). Built on the proven HiFocus™ platform and developed with numerous surgeons from around the globe, the new SlimJ electrode features a thin, straight design for easy insertion through the round window or cochleostomy. The AB engineering team designed the electrode around the key goal of protecting the delicate structures of the cochlea during electrode insertion. The HiFocus SlimJ electrode, alongside the HiFocus Mid-Scala electrode, provides the surgeon with a choice of electrodes, offering several high-performance features designed to suit individual patient anatomy and surgical preferences for the best possible hearing outcomes.\n“The HiFocus SlimJ electrode addresses the surgeon need for an alternate type of electrode whilst still offering full spectrum coverage and maintaining the performance potential of the individual. And surgeons have commented that it is easy to handle and to insert,” says Mark Downing, Director of Medical Marketing and Product Management at Advanced Bionics.\nThe HiFocus SlimJ electrode is available on the HiRes™ Ultra cochlear implant , the latest generation of HiRes implants.\nThe HiFocus SlimJ electrode is designed to meet the needs of the global market and is currently available in limited markets in Europe.\nHansjuerg Emch, Group Vice President Cochlear Implants (CI), Sonova, says, “I am very pleased with the successful implantations in Europe following the TÜV approval. This marks an important milestone not only for Advanced Bionics but for all future CI candidates.”\nMarketplace availability for all other regions will be based on regulatory approval by sector. When the HiRes Ultra implant is paired with the Naída CI sound processor , the listener realizes the full integration of AB and Phonak technology. The Naída CI, built from the same foundation as the most popular hearing aid line from Phonak, automatically adjusts to the sound environment to improve comfort and speech understanding in noise and automatically handles wireless inputs from streaming devices, giving listeners access to phone calls and other media sources. The Naída CI can also be paired with a second hearing device (another Naída CI, a Phonak Naída Link hearing aid or the wireless Phonak Naída Link CROS transmitter), providing all AB listeners with complete access to sound.\nAbout Advanced Bionics\nAdvanced Bionics is a global leader in developing hearing solutions for individuals with severe-to-profound hearing loss who no longer benefit from hearing aids. Founded in 1993 and a subsidiary of the Sonova Group since 2009, AB develops cutting-edge cochlear implant technology that allows recipients to hear their best. AB joined Phonak as part of the Sonova Group of companies and began a collaboration unlike any other in the industry. Since then, the innovation leaders in cochlear implants and hearing aids have continuously combined technologies to deliver new, unequalled hearing solutions.\nAB offers the most capable cochlear implant system on the market 1 , the HiResolution™ Bionic Ear System designed to help recipients hear in noisy settings and enjoy the full dimensions of music and tonal languages 2,3 . With sales in more than 50 countries and a proven track record for developing high-performing, state-of-the-art products, AB’s talented worldwide group of technologists and professionals are driven to succeed, work with integrity and stay firmly committed to quality.\nTechnical Specifications. HiRes™ Ultra Cochlear Implant with the HiFocus™ Mid-Scala Electrode. 2016. 028-M760-02 RevB. Adams D, Ajimsha KM, Barberá MT, Gazibegovic D, Gisbert J, Gómez J, Raveh E, Rocca C, Romanet P, Seebens Y, Zarowski A., Multicentre evaluation of music perception in adult users of Advanced Bionics cochlear implants Cochlear Implants Int. 2014 Jan;15(1):20-6. doi: 10.1179/1754762813Y. 32. Epub 2013 Nov 25. Chang YT, Yang HM, Lin YH, Liu SH, Wu JL. Tone discrimination and speech perception benefit in Mandarin-speaking children fit with HiRes fidelity 120 sound processing. Otol Neurotol. 2009 Sep;30(6):750-7. doi: 10.1097/MAO.0b013e3181b286b2.\n //www.businesswire.com/news/home/20180109005100/en/\nAdvanced Bionics\nOlivia Duarte, 661-362-1400\nMediaInquiries@AdvancedBionics.com\nSource: Advanced Bionics", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fadvancedbionics.com%2Fcontent%2Fadvancedbionics%2Fca%2Fen%2Fhome%2Fproducts%2Fhires-ultra-cochlear-implant.html&esheet=51738876&newsitemid=20180109005100&lan=en-US&anchor=HiRes%E2%84%A2+Ultra+cochlear+implant&index=2&md5=89d9793ccfecefcb9816abc0ac89847a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fadvancedbionics.com%2Fcontent%2Fadvancedbionics%2Fca%2Fen%2Fhome.html&esheet=51738876&newsitemid=20180109005100&lan=en-US&anchor=Advanced+Bionics&index=1&md5=777e5a381bc9888730ca85ce3b61fee9", "http://www.businesswire.com/news/home/20180109005100/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fadvancedbionics.com%2Fcontent%2Fadvancedbionics%2Fca%2Fen%2Fhome%2Fproducts%2Fprocessors%2Fnaida-ci.html&esheet=51738876&newsitemid=20180109005100&lan=en-US&anchor=Na%C3%ADda+CI+sound+processor&index=3&md5=aa71ce0b68f82671e452a266b1ff0cd0"], "published": "2018-01-09T21:00:00.000+02:00", "crawled": "2018-01-09T23:47:57.003+02:00", "highlightTitle": ""}