{"organizations": [], "uuid": "97abb88944c2f24a7af1fd4436991e205c179067", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mplx-lp-to-announce-2017-fourth-quarter-and-full-year-financial-results-feb-1.html", "country": "US", "domain_rank": 767, "title": "MPLX LP to announce 2017 fourth-quarter and full-year financial results Feb. 1", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:30:00.000+02:00", "replies_count": 0, "uuid": "97abb88944c2f24a7af1fd4436991e205c179067"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mplx-lp-to-announce-2017-fourth-quarter-and-full-year-financial-results-feb-1.html", "ord_in_thread": 0, "title": "MPLX LP to announce 2017 fourth-quarter and full-year financial results Feb. 1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FINDLAY, Ohio, MPLX LP (NYSE: MPLX) a master limited partnership sponsored by Marathon Petroleum Corp. (NYSE: MPC), will host a conference call Thursday, Feb. 1, 2018, at 11 a.m. EST to discuss 2017 fourth-quarter and full-year financial results, which will be released earlier that day, and to provide an update on partnership operations.\nMPLX participants will be Gary R. Heminger, chairman and chief executive officer; Michael J. Hennigan, president; Pamela K.M. Beall, executive vice president and chief financial officer; and other senior executives. The call will be hosted by Lisa Wilson, director of Investor Relations.\nInterested parties may listen to the conference call by dialing (888) 606-5719 (confirmation number 6033306) or by visiting MPLX's website at http://www.mplx.com and clicking on the \"2017 Fourth-Quarter and Full-Year Financial Results\" link in the \"News & Headlines\" section. Financial information, including the earnings release and other investor-related material, also will be available online. Replays of the conference call will be available on the partnership's website through Thursday, Feb. 15.\nAbout MPLX LP\nMPLX is a diversified, growth-oriented master limited partnership formed in 2012 by Marathon Petroleum Corporation to own, operate, develop and acquire midstream energy infrastructure assets. We are engaged in the gathering, processing and transportation of natural gas; the gathering, transportation, fractionation, storage and marketing of NGLs; and the transportation, storage and distribution of crude oil and refined petroleum products through a marine fleet and approximately 10,000 miles of crude oil and light product pipelines. Headquartered in Findlay, Ohio, MPLX's assets consist of a network of crude oil and products pipeline assets located in the Midwest and Gulf Coast regions of the United States; 62 light-product terminals with approximately 24 million barrels of storage capacity; an inland marine business; storage caverns with approximately 2.8 million barrels of storage capacity; crude oil and product storage facilities (tank farms) with approximately 5 million barrels of available storage capacity; a barge dock facility with approximately 78,000 barrels per day of crude oil and product throughput capacity; and gathering and processing assets that include approximately 5.9 billion cubic feet per day of gathering capacity, 8 billion cubic feet per day of natural gas processing capacity and 610,000 barrels per day of fractionation capacity.\n with multimedia: releases/mplx-lp-to-announce-2017-fourth-quarter-and-full-year-financial-results-feb-1-300579186.html\nSOURCE Marathon Petroleum Corporation", "external_links": ["http://www.prnewswire.com/news-releases/mplx-lp-to-announce-2017-fourth-quarter-and-full-year-financial-results-feb-1-300579186.html"], "published": "2018-01-09T00:30:00.000+02:00", "crawled": "2018-01-09T09:40:11.549+02:00", "highlightTitle": ""}