{"organizations": [], "uuid": "9c910b5b684ceb223eb39d024733555ad0f7eccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/pakistan-afghanistan/afghan-spy-chief-visits-pakistan-in-wake-of-kabul-attacks-idUKKBN1FK17E", "country": "US", "domain_rank": 408, "title": "Afghan spy chief visits Pakistan in wake of Kabul attacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:20:00.000+02:00", "replies_count": 0, "uuid": "9c910b5b684ceb223eb39d024733555ad0f7eccb"}, "author": "", "url": "https://uk.reuters.com/article/pakistan-afghanistan/afghan-spy-chief-visits-pakistan-in-wake-of-kabul-attacks-idUKKBN1FK17E", "ord_in_thread": 0, "title": "Afghan spy chief visits Pakistan in wake of Kabul attacks", "locations": [], "entities": {"persons": [{"name": "kabu", "sentiment": "negative"}, {"name": "haqqani", "sentiment": "none"}, {"name": "masoom stanekzai", "sentiment": "none"}, {"name": "wais barmak", "sentiment": "none"}, {"name": "saad sayeed", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national directorate for security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:21 AM / Updated 8 minutes ago Afghan spy chief visits Pakistan in wake of Kabul attacks Saad Sayeed 3 Min Read \nISLAMABAD (Reuters) - Afghanistan’s intelligence chief visited Pakistan on Wednesday, officials said, at a time when tension between the neighbours is simmering over accusations that Pakistan offers a safe haven for Taliban militants. \nThe visit comes amid anger in Afghanistan over an attack on a luxury hotel and a car bomb in the capital, Kabul, that killed more than 120 people, which the government has blamed on Haqqani network militants believed to operate out of Pakistan. \nThe Afghan team will present documentary evidence and phone tap information linking individuals and groups based in Pakistan with the Kabul attacks, a senior Afghan military source told Reuters. \nThe delegation includes Masoom Stanekzai, head of the National Directorate for Security intelligence agency, and Afghan Interior Minister Wais Barmak, officials said. \n“The Afghan government had requested that a high-level delegation would like to visit Pakistan with a message from the Afghan president,” Pakistan’s foreign office spokesman, Mohammad Faisal, said in a Twitter message. \nOn Saturday, a vehicle painted as an ambulance exploded in a Taliban suicide attack in one of the most well-protected parts of Kabul, killing more than 100 people and wounding at least 235. \nIt followed a Taliban-claimed attack a week earlier that killed more than 20 people in a siege of the city’s Intercontinental Hotel. \nTies between the United States and Pakistan are brittle after Washington announced plans this month to suspend up to roughly $2 billion in U.S. security assistance. \nU.S. President Donald Trump tweeted that Pakistan had rewarded past U.S. aid with “nothing but lies & deceit”. \nPakistan, which denies the accusations it allows safe havens for militants, condemned Saturday’s attack and accused Washington of betrayal. \nPakistan is widely blamed in Kabul for the attacks and a senior Afghanistan cleric this week criticized a fatwa against suicide attacks issued by Pakistani religious authorities for not explicitly declaring attacks in Afghanistan haram, or unlawful for Muslims. \nPakistan’s embassy in Kabul rejected the criticism, saying in a statement the fatwa was a message against violence and terrorism anywhere in the name of Islamic injunctions. \nIn November, Pakistan handed to Afghanistan 27 people suspected of belonging to the Afghan Taliban and Haqqani network, a spokesman for the country’s foreign office said on Monday. \nA delegation from Islamabad is to visit Afghanistan on Feb. 3, Pakistan’s embassy in Kabul said. \n“The delegation, led by the foreign secretary, will hold constructive and meaningful discussions with Afghanistan on all issues including counter-terrorism, peace and reconciliation and repatriation of refugees,” the embassy said in a statement.   James Mackenzie; Writing by Saad Sayeed; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-31T12:20:00.000+02:00", "crawled": "2018-01-31T12:36:43.007+02:00", "highlightTitle": ""}