{"organizations": [], "uuid": "3f012716c7abc19a6a02aa328b2d6dede250d63b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-momentum-cyber-releases-comprehensive-inaugural-report-analyzing-cybersecurity-transaction-data-industry-trends-a-reveals.html", "country": "US", "domain_rank": 767, "title": "Momentum Cyber Releases Comprehensive Inaugural Report Analyzing Cybersecurity Transaction Data & Industry Trends – Reveals Record-Breaking Activity in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-29T19:00:00.000+02:00", "replies_count": 0, "uuid": "3f012716c7abc19a6a02aa328b2d6dede250d63b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-momentum-cyber-releases-comprehensive-inaugural-report-analyzing-cybersecurity-transaction-data-industry-trends-a-reveals.html", "ord_in_thread": 0, "title": "Momentum Cyber Releases Comprehensive Inaugural Report Analyzing Cybersecurity Transaction Data & Industry Trends – Reveals Record-Breaking Activity in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "cybersecurity transaction data & industry trends", "sentiment": "neutral"}, {"name": "cybersecurity almanac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Momentum Cyber’s Inaugural ‘Cybersecurity Almanac 2018’ Details 504 Cybersecurity Transactions Valued at Over $25 Billion; Spotlights Key Industry Trends & Record Year for Data Breaches\nSAN FRANCISCO--(BUSINESS WIRE)-- Momentum Cyber , the premier trusted advisor to the cybersecurity industry, today released its inaugural Cybersecurity Almanac for 2018 – the most comprehensive and accurate transaction data available on the industry. Culled from analysis of over 2,500 cybersecurity companies and deal activity including IPOs, merger and acquisitions, and venture capital and private equity financings, the Cybersecurity Almanac chronicles 504 cybersecurity transactions with a cumulative value of $25.5 billion, making 2017 a record-breaking year for the industry.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180129005773/en/\nMomentum Cyber 2018 Cyber Almanac Snapshot (Graphic: Momentum Cyber)\nThe comprehensive 243 page report – the first of its kind for the industry – also tracks key industry trends including the increasing data breach problem with profiles of some of the notorious breaches of 2017, provides a deep dive into specific industry sub-sectors, offers insights into the cybersecurity workforce, and more.\nHighlights of the Cybersecurity Almanac 2018 include:\nM&A : 2017 was a robust year for M&A activity in cybersecurity, with a record 178 transactions for $20.4 billion in aggregate disclosed value. Symantec led all acquirers with 5 disclosed acquisitions completed PE & VC : Nearly $12 billion was put to work in cybersecurity investments in 2017 by private equity ($6.5 billion) and venture capital ($5.1 billion) firms IPO : The cybersecurity IPO market rebounded with three cybersecurity companies going public – Okta, SailPoint and ForeScout – all significantly up over their IPO prices CYBERscape : A completely revamped version of Momentum Cyber’s highly referenced cybersecurity landscape taxonomy updated for today’s evolving market Data Breaches : 2017 was also another record year for breaches, with a total of 1,579 breaches reported in the US – up 44% over 2016 Sector Focus : Detailed perspectives across specific cybersecurity sectors including Cloud Infrastructure Security, Managed Detention & Response, Continuous Security Assessment, Security Analytics, among others Investors : Spotlighted leading Cyber-focused investors that increasingly are playing an integral role in the industry’s most innovative startups Contributors: special guest contributions by Dave DeWalt and Bob Ackerman Jr. Israel : A tailored version of the firm’s CYBERscape for Israeli cyber companies only along with an inclusion of recent ‘ The state of Israel’s cybersecurity market ’ by Yoav Leitersdorg and Ofer Schreiber of YL Ventures\n”2017 was a banner year for cybersecurity in terms of both deal activity and volume, driven by the increasingly costly and ever evolving threat landscape,” said Eric McAlpine, Momentum Cyber co-founder and managing partner. “Based on the 15+ years of unrivaled transaction data we’ve accumulated, synthesized, and studied, we expect an even higher level of strategic activity in 2018 with pure play vendors keeping pace in the arms race, new out of market buyers entering a high-growth sector, private equity’s continued love affair with cyber, and a necessary consolidation within certain categories. As they say, records are meant to be broken.”\nThe Cybersecurity Almanac will make its debut at Cybertech TLV 2018 in Tel Aviv, Israel today, where Eric McAlpine is the keynote speaker for the CyberTech Startup Competition powered by YL Ventures.\nMomentum Cyber: A Shared Vision To Better Serve The Cybersecurity Ecosystem\nMomentum Cyber is the completion of a vision that Michael Tedesco and Eric McAlpine conceived in 2015 when the duo formed Momentum Partners. In just two years, Momentum has emerged to become the ‘go to’ M&A advisor to companies large and small in the dynamic cybersecurity sector. By recently joining forces with Dave DeWalt – a managing director at AllegisCyber and founder of NightDragon Security who sits on the board of directors of leading cybersecurity companies including Optiv, ForeScout, Phantom Cyber, ForgeRock, Claroty, Callsign, Illusive Networks, the two leading cyber start-up studios in Team8 and DataTribe, and Delta Airlines – the three founders and partners leverage their collective 70+ years in cybersecurity as operators and advisors to provide tailored advice and access to companies in the fastest growing sector within technology. Momentum Cyber’s unrivaled track record as operators and advisors having orchestrated over 200 transactions for over $200 billion in total value as advisors and principals.\nFor more information please visit www.momentumcyber.com .\nAbout Momentum Cyber\nMomentum Cyber is the premier trusted advisor to the cybersecurity industry providing bespoke high-impact advice combined with tailored, senior-level access. The firm was founded by world-class operators and advisors and caters to the unique needs of both earlier stage Founders, CEOs, & Boards as well as the complexity of later stage & public companies throughout their lifecycle – Incubation to Exit. Headquartered in San Francisco with operations globally, the founding team has closed over 200 transactions totaling over $200 billion in value. Momentum Cybersecurity Group, LLC conducts its M&A advisory services as an M&A Broker as defined by the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005773/en/\nBlueshirt Group\nKim Hughes, 415-516-6187\nkim@blueshirtgroup.com\nKatie North, 408-506-4568\nKatie@blueshirtgroup.com\nSource: Momentum Cyber", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmomentumcyber.com%2Fcybersecurity-almanac-2018%2F&esheet=51750063&newsitemid=20180129005773&lan=en-US&anchor=Cybersecurity+Almanac+2018&index=2&md5=ac303701b20d08e7c610483178a12d0e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.momentumcyber.com&esheet=51750063&newsitemid=20180129005773&lan=en-US&anchor=www.momentumcyber.com&index=5&md5=1527aace040b5796ed8436d9a8781d0f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.cybertechisrael.com&esheet=51750063&newsitemid=20180129005773&lan=en-US&anchor=Cybertech+TLV+2018&index=4&md5=b35ab59666f3a032ac729c7043d6f836", "http://www.businesswire.com/news/home/20180129005773/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.momentumcyber.com&esheet=51750063&newsitemid=20180129005773&lan=en-US&anchor=Momentum+Cyber&index=1&md5=e6946ff4d21c9941830bf892364d2249", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftechcrunch.com%2F2018%2F01%2F14%2Fthe-state-of-israels-cybersecurity-market%2F&esheet=51750063&newsitemid=20180129005773&lan=en-US&anchor=The+state+of+Israel%27s+cybersecurity+market&index=3&md5=caf8c3be221710116e40ce1c8edd0eb0"], "published": "2018-01-29T19:00:00.000+02:00", "crawled": "2018-01-29T20:52:39.008+02:00", "highlightTitle": ""}