{"organizations": [], "uuid": "feef5a0b6cfd09fb08fb597957ef92a4fb8a86c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-respiratory-compromise-institute-appoints-brent-dunworth-to-clinical-advisory-committee.html", "country": "US", "domain_rank": 767, "title": "Respiratory Compromise Institute Appoints Brent Dunworth to Clinical Advisory Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.863, "site_type": "news", "published": "2018-01-31T15:30:00.000+02:00", "replies_count": 0, "uuid": "feef5a0b6cfd09fb08fb597957ef92a4fb8a86c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-respiratory-compromise-institute-appoints-brent-dunworth-to-clinical-advisory-committee.html", "ord_in_thread": 0, "title": "Respiratory Compromise Institute Appoints Brent Dunworth to Clinical Advisory Committee", "locations": [], "entities": {"persons": [{"name": "brent dunworth", "sentiment": "none"}, {"name": "dunworth", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "rci", "sentiment": "negative"}, {"name": "respiratory compromise institute", "sentiment": "negative"}, {"name": "respiratory compromise institute appoints brent dunworth to clinical advisory committee", "sentiment": "negative"}, {"name": "american association of nurse anesthetists", "sentiment": "none"}, {"name": "aprn", "sentiment": "none"}, {"name": "department of anesthesiology", "sentiment": "none"}, {"name": "crna", "sentiment": "none"}, {"name": "aana", "sentiment": "none"}, {"name": "vanderbilt university medical center", "sentiment": "none"}, {"name": "clinical advisory committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA, Va., Jan. 31, 2018 /PRNewswire/ -- The Respiratory Compromise Institute (RCI) today announced the appointment of Brent Dunworth, DNP, MBA, APRN, CRNA, to its Clinical Advisory Committee. Dr. Dunworth is a member of the American Association of Nurse Anesthetists (AANA), the professional association for more than 52,000 Certified Registered Nurse Anesthetists, and serves as Director of Advanced Practice and Division Chief of Nurse Anesthesia in the Department of Anesthesiology at Vanderbilt University Medical Center (VUMC) in Nashville, Tennessee. He will join a group of thirteen distinguished clinicians who make up the committee, which is dedicated to addressing respiratory compromise across the care continuum via public education, research and advocacy.\nRespiratory compromise is a deterioration of respiratory function that poses a high risk of life-threatening respiratory failure. Respiratory failure is the second leading avoidable patient safety issue. 1 It is one of the top five conditions leading to increasing hospital costs 2 and the third most rapidly increasing hospital inpatient cost in the United States. 3 General care floor patients with respiratory compromise are 29 times more likely to die. 2\nDr. Dunworth is an educator at the Vanderbilt University School of Nursing and lectures nationally on a variety of nurse anesthesia topics. He has received numerous awards, including: the Agatha Hodgins Award, presented to outstanding nurse anesthesia students; the Pennsylvania Association of Nurse Anesthetists' Didactic Instructor of the Year Award; and the University of Pittsburgh School of Nursing's Outstanding Young Alumnus Award. He has given more than 40 presentations on anesthesia-related subjects, such as difficult airway management, anesthesia ventilation, patient safety advocacy in anesthesiology, and problems associated with sleep-disordered breathing. His peer-reviewed publications and abstracts have appeared in AACN Clinical Issues: Advanced Practice in Acute and Critical Care, American Journal of Nursing, AANA Journal and Anesthesia & Analgesia.\n\"As the Respiratory Compromise Institute continues to grow, we are pleased to have someone on our clinical advisory committee of Dr. Dunworth's caliber,\" said, Phillip Porte, Executive Director of RCI. \"We are confident that his nearly 20 years of clinical experience and increasingly responsible leadership at renowned U.S. healthcare centers will enhance our understanding of the impact of anesthesia on respiratory compromise, deepen our advisory talent bench and enrich and expand our research capabilities.\"\nAt VUMC, Dr. Dunworth provides administrative leadership to advanced practice perioperative professionals, including certified registered nurse anesthetists (CRNAs) and certified registered nurse practitioners (CRNPs). His oversight responsibilities include preoperative evaluations, procedural assessments and postoperative recovery monitoring in order to provide safe and efficient patient care delivery. He is responsible for 160 CRNAs, 25 CRNPs and 30 anesthesia technologists. Prior to VUMC, he was Senior Director for Nurse Anesthesia at the University of Pittsburgh Medical Center.\n\"I am excited to join the Respiratory Compromise Institute's clinical advisory committee, where I hope my expertise in nurse anesthesia will add to the committee's already impressive clinical thought leadership,\" said Dr. Dunworth. \"Practitioners at every level should be well versed in how to recognize and respond to respiratory compromise, which, if identified early, may lower healthcare costs and improve patient outcomes.\"\nAbout Respiratory Compromise\nRespiratory compromise, which includes respiratory distress, insufficiency, failure and arrest, can occur across numerous clinical scenarios. For example, respiratory compromise may appear post-operatively or may be drug-induced by the delivery of a sedative, opioid, or analgesic to patients who were not properly assessed or properly monitored.\nAccording to the U.S. Department of Health & Human Services, Agency for Healthcare Research and Quality, respiratory compromise is the third most rapidly increasing hospital inpatient cost in the United States, with $7.8 billion spent on respiratory compromise in U.S. hospitals in 2007. Respiratory compromise increases patient mortality rates by over 30 percent and hospital and ICU stays by almost 50 percent. RCI defines respiratory compromise as a state in which there is a high likelihood of decompensation into respiratory insufficiency, respiratory failure or death that could be prevented or mitigated through specific interventions (enhanced monitoring and/or therapies).\nAbout Respiratory Compromise Institute\nThe Respiratory Compromise Institute brings together a broad-based coalition of organizations, companies, and individuals dedicated to reducing—and eventually eliminating—preventable adverse events and deaths due to respiratory compromise.\nReferences\n1 Healthgrades website, \" Quality Matters: Tackle the Top 3 Patient Safety Issues .\"\n2 Kelley SD, SA, Agarwal S, Parikh N, Erslon M, Morris P. Respiratory insufficiency, arrest and failure among medical patients on the general care floor. Crit Care Med. 2012; 40(12):764.\n3 NAMDRC, National Association for Medical Direction of Respiratory Care. Reducing respiratory compromise and depression. PR Web. Available at http://www.prweb.com/pdfdownload/12615503.pdf .\nMedia Contact\nErich Sandoval\nLazar Partners Ltd.\nTel: +1 917-497-2867\nEmail: esandoval@lazarpartners.com\nView original content: http://www.prnewswire.com/news-releases/respiratory-compromise-institute-appoints-brent-dunworth-to-clinical-advisory-committee-300590819.html\nSOURCE Respiratory Compromise Institute", "external_links": ["http://www.prnewswire.com/news-releases/respiratory-compromise-institute-appoints-brent-dunworth-to-clinical-advisory-committee-300590819.html", "https://app.box.com/s/zsk306sc0jvk7mkdcwdrmqbh1ooznn84", "http://www.prweb.com/pdfdownload/12615503.pdf"], "published": "2018-01-31T15:30:00.000+02:00", "crawled": "2018-01-31T17:18:46.006+02:00", "highlightTitle": ""}