{"organizations": [], "uuid": "185d4e034e0a37324490ac63ae57f0317ce1e4df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226350438&w=1200&r=LYNXMPEE0S19P", "site_section": "http://www.reuters.com/rssFeed/newIssuesNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-saudi-arrests/guilt-fines-remain-hazy-as-saudi-corruption-purge-draws-to-close-idUSKBN1FI24B", "country": "US", "domain_rank": 408, "title": "Guilt, fines remain hazy as Saudi corruption purge draws to close", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:44:00.000+02:00", "replies_count": 0, "uuid": "185d4e034e0a37324490ac63ae57f0317ce1e4df"}, "author": "", "url": "https://www.reuters.com/article/us-saudi-arrests/guilt-fines-remain-hazy-as-saudi-corruption-purge-draws-to-close-idUSKBN1FI24B", "ord_in_thread": 0, "title": "Guilt, fines remain hazy as Saudi corruption purge draws to close", "locations": [], "entities": {"persons": [{"name": "stephen kalin", "sentiment": "none"}, {"name": "reem shamseddine", "sentiment": "none"}, {"name": "ibrahim", "sentiment": "none"}, {"name": "alwaleed bin talal", "sentiment": "none"}, {"name": "waleed al-ibrahim", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "mbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIYADH (Reuters) - Saudi Arabian media magnate Waleed al-Ibrahim was found innocent in an anti-corruption purge, a source at his company said on Monday, part of a wider campaign against graft whose secrecy could hurt the country’s effort to win foreign investment.\nIbrahim, who controls influential regional broadcaster MBC, was one of at least half a dozen top businessmen freed from more than two months of detention at the weekend after being interrogated by officials who said they aimed to recover $100 billion of illicit funds.\nThe officials said all of the men, who included billionaire global investor Prince Alwaleed bin Talal, had agreed to financial settlements after admitting to unspecified “violations”.\nBut the allegations against the men and their settlements have been kept secret, leaving the global investment community to wonder what the penalties are for large-scale corruption in Saudi Arabia - and whether detainees were actually guilty.\nThe mystery is unsettling investors who have closely watched Crown Prince Mohammed bin Salman’s every move since he promised to reform oil superpower Saudi Arabia, surprising citizens who regarded top businessmen and powerful royals as untouchable.\nAside from the crackdown on corruption, those changes are meant to include less dependence on oil, megaprojects to create jobs, and greater transparency and social freedoms.\nThe decision to release some of the most powerful people in the kingdom comes ahead of a planned trip by Prince Mohammed to the United States and European capitals in February and March, according to diplomats.\nHe could face awkward questions there about how the purge was conducted. The releases, and what kind of deals may have been struck, could have huge implications for Saudi Arabia’s image in the international investment community.\nMBC’s Ibrahim “was fully exonerated and declared innocent of any wrongdoing, no corruption charges, no charges actually whatsoever,” a senior executive at MBC group told Reuters.\nIn an email to its staff, MBC management said Ibrahim was “fit and well and eager to get back. He has also been totally exonerated and faces no issues going forward.”\nMURKINESS Saudi officials did not respond to requests for information on the cases of Ibrahim and dozens of other officials and businessmen caught by the purge.\nSaudi Arabia's Crown Prince Mohammed Bin Salman attends the Annual Horse Race ceremony, in Riyadh, Saudi Arabia, December 30, 2017. Bandar Algaloud/Courtesy of Saudi Royal Court/Handout via REUTERS Prince Alwaleed, owner of global investor Kingdom Holding 4280.SE, continued to maintain his innocence in an interview with Reuters hours before his release, although an official said he had agreed to an unspecified financial settlement.\nOn Monday, shares in Kingdom rose back to the level where they were trading when Prince Alwaleed was arrested - a vote of confidence by the market in his future. In the days after his detention, the shares had plunged more than 20 percent, erasing as much as $2.2 billion of his fortune.\nAuthorities have not disclosed how many people are still detained but Riyadh’s grand Ritz-Carlton hotel, where many detainees were held, is to reopen to the public by mid-February.\nLast week, before the latest releases, the attorney general said most detainees had agreed to settlements, 90 were released after charges were dropped, and 95 remained in custody. Some cases will go to trial.\nJason Tuvey, Middle East economist at Capital Economics in London, said the purge had increased uncertainty among potential foreign investors in Saudi Arabia, because it was not clear how they would be treated if they were caught up in corruption allegations.\n“The release of Prince Alwaleed bin Talal and a number of other high-profile individuals may ease some concerns, but we still don’t have any details on what sort of agreement they have reached with the authorities. It just adds to the murkiness surrounding the whole process.”\nHe added that one potential worry for investors was that the purge could one day lead to a backlash against Prince Mohammed, who launched the purge and is leading ambitious reforms.\n”Investors will probably need some reassurance on the exact procedures going forward to deal with corruption allegations,“ Tuvey said. ”But I think political uncertainty will remain a key risk surrounding the Saudi economy for many years to come.”\nPrince Mohammed initially said he wanted to conclude the purge quickly. Foreign bankers dealing with Saudi Arabia said he may have been encouraged to do so by concern that the purge could start to affect foreign investment in the country.\nConstructing complex, watertight legal cases against detainees may have been more challenging than expected - suggesting the government might find it hard to reach its target of recovering $100 billion of illicit funds, analysts said.\nSaudi officials said Ibrahim’s 40 percent stake in MBC would remain unchanged and Prince Alwaleed would stay in control of Kingdom.\nBut construction giant Saudi Binladin Group said earlier this month that family shareholders might transfer part of their holdings to the state in a settlement with authorities.\nAdditional reporting by Alexander Cornwell; Writing by Andrew Torchia; Editing by Michael Georgy, William Maclean\n ", "external_links": [], "published": "2018-01-29T18:44:00.000+02:00", "crawled": "2018-01-29T18:55:52.004+02:00", "highlightTitle": ""}