{"organizations": [], "uuid": "0ec3031b9873dace757aa211572b5022be1cde3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219590915&w=1200&r=LYNXMPEE040OW", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-britain-markets-regulator/banking-crisis-adviser-named-as-head-of-britains-finance-watchdog-idUKKBN1EU15W", "country": "US", "domain_rank": 408, "title": "Banking crisis adviser named as head of Britain's finance watchdog", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:31:00.000+02:00", "replies_count": 0, "uuid": "0ec3031b9873dace757aa211572b5022be1cde3c"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-markets-regulator/banking-crisis-adviser-named-as-head-of-britains-finance-watchdog-idUKKBN1EU15W", "ord_in_thread": 0, "title": "Banking crisis adviser named as head of Britain's finance watchdog", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}, {"name": "randell", "sentiment": "none"}, {"name": "john griffith-jones", "sentiment": "none"}, {"name": "charles randell", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "reuters tv united states", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters TV United States January 5, 2018 / 12:34 PM / a few seconds ago Banking crisis adviser named as head of Britain's finance watchdog Huw Jones 4 Min Read \nLONDON (Reuters) - Charles Randell, an ex-lawyer who advised the British government during the financial crisis, has been appointed chair of Britain’s Financial Conduct Authority, the finance ministry said on Friday. FILE PHOTO - John Griffith-Jones, the former Chairman designate of the Financial Conduct Authority (FCA) attends a Thomson Reuters Newsmaker event, in the Canary Wharf business district of east London October 16, 2012. REUTERS/Andrew Winning \nRandell, formerly a partner at international law firm Slaughter & May, will face the tricky task of helping Britain’s financial services sector to navigate the country’s departure from the European Union, which could potentially put UK finance jobs at risk. \nHe also joins the FCA at a time when its remit has expanded to take in thousands of consumer credit firms, forcing it to review its “mission” and warn that it must prioritize its work. \nRandell takes over in April from John Griffith-Jones who was appointed for a 5-year term in 2013. \nHe already has experience as a regulator as an external member of the Bank of England’s Prudential Regulation Committee (PRC), which oversees its banking supervision arm. \nHe acted as an adviser to the government during the 2007-2009 financial crisis, including on bank rescues such as Northern Rock and Bradford & Bingley. \nHe advised ministers on investments into Royal Bank of Scotland ( RBS.L ) and Lloyds’ ( LLOY.L ) takeover of HBOS. Randell also advised on Portugal’s recapitalization of its banking sector. \n“Charles has a wealth of relevant experience, and I am sure that he will prove to be a strong leader at this very important time,” Britain’s finance minister Philip Hammond said in a statement. \nRandell has resigned from the PRC and will leave before taking up his new three-days-a-week job at the FCA, which is responsible for authorizing exchanges, asset managers and consumer credit companies. IMPORTANT JUNCTURE \nBoE Governor Mark Carney said Randell would be “sorely missed” at the PRC, but he was pleased he was willing to chair the FCA “at this important juncture” for the watchdog and UK financial services. \nThe FCA regulates Europe’s most important financial center and one that has heavily influenced how the EU’s market and banking rules have been shaped. \nBrexit will mean losing influence over EU financial rulemaking and the watchdog could also face pressure from pro-Brexit lawmakers to ease up on regulation to keep the City of London competitive - a move it has so far resisted. \nFCA chief executive, Andrew Bailey, who also came from the BoE where he was deputy governor in charge of banking supervision, welcomed Randell’s appointment. \n“His experience of regulation, both during the financial crisis and more recently as a member of the Prudential Regulation Committee, mean that he has a strong understanding of the challenges that the FCA faces and I look forward to tackling these with him in his new role,” Bailey said in a statement. \nRandell is likely to be grilled by parliament’s Treasury Select Committee about his appointment, though he is likely to face a smoother ride than his predecessor. \nThe FCA’s first chair, Griffith-Jones, was given a rough ride by some lawmakers initially, who said he lacked deep experience in consumer-related conduct issues. \nGriffith-Jones also had to recuse himself from a report by the FCA and BoE on the collapse of HBOS during the financial crisis. Griffith-Jones was UK head of accountants KPMG when the firm audited HBOS in the run up to the collapse. Reporting by Huw Jones; Editing by Elaine Hardcastle and Jane Merriman", "external_links": [], "published": "2018-01-05T14:31:00.000+02:00", "crawled": "2018-01-05T14:41:10.004+02:00", "highlightTitle": ""}