{"organizations": [], "uuid": "4bea3eeef0eca7d5c1aa6d5ff384d46c42ad46bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104966101-GettyImages-908996558.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/asia-markets-dollar-us-protectionism-and-ecb-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Dollar, US protectionism and ECB in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:46:00.000+02:00", "replies_count": 0, "uuid": "4bea3eeef0eca7d5c1aa6d5ff384d46c42ad46bc"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/24/asia-markets-dollar-us-protectionism-and-ecb-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: Dollar, US protectionism and ECB in focus", "locations": [], "entities": {"persons": [{"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most major indexes in Asia closed lower on Thursday as the dollar continued to struggle after tumbling in the last session.\nJapan's benchmark Nikkei 225 declined 1.13 percent, or 271.29 points, to close at 23,669.49, with most sectors — including automakers, technology, manufacturing and financials — finishing the session in negative territory.\nMajor exporters traded lower on the dollar's fall against the yen. Fanuc Manufacturing shed 0.85 percent and Nintendo fell 1.79 percent by the end of the day. Oil-related stocks, however, were a bright spot, outperforming the broader index as oil prices rose to their highest levels since December 2014.\nThe Nikkei 225 had notched a fresh 26-year high earlier in the week.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Over in South Korea, the Kospi rose 0.95 percent to end at 2,562.23, with recent earnings reports in focus.\nShares of SK Hynix rose 4.7 percent after the chipmaker announced Thursday that fourth-quarter operating profit came in at a record high of 4.47 trillion won ($4.42 billion). Annual operating profit for 2017, meanwhile, stood at a record 13.7 trillion won ($12.9 billion), which the company attributed to a rapid growth in overall memory demand.\nMeanwhile, Posco stock reversed early losses to close higher by 1.29 percent after the steelmaker reported earnings on Wednesday.\nDown Under, the S&P/ASX 200 edged down by 0.08 percent to end at 6,050 as gains in the materials sector were offset by losses in utilities and industrials. Gold producers were up 2.82 percent after the metal's prices rose to their highest levels in one and a half years on the softer dollar. The heavily-weighted financials sector traded lower for the most part.\nGreater China markets came under pressure on Thursday. Hong Kong's Hang Seng Index slipped 0.52 percent by 3:06 p.m. HK/SIN after closing higher for the seventh straight session on Wednesday. Financials were broadly lower, with China Construction Bank declining 1.49 percent and HSBC off by 0.35 percent ahead of the market close.\nTechnology names were also in negative territory, with heavyweight Tencent losing 1.62 percent. Energy-related names extended gains as oil prices climbed. Petrochina rose 3.06 percent and CNOOC gained 1.4 percent by 3:09 p.m. HK/SIN.\nMainland markets were more subdued. The Shanghai composite edged down 0.31 percent to close at 3,548.30 and the Shenzhen composite ended the session lower by 0.39 percent. Major mainland-listed banks saw declines, with Industrial and Commercial Bank of China closing down 0.54 percent. Real estate names were also broadly in negative territory: China Vanke fell 2.26 percent and Poly Real Estate lost 4.15 percent by the end of the day.\nDespite the declines on Thursday, the Hang Seng has recorded gains of 9 percent year-to-date. The Shanghai composite was up 7 percent this year.\nU.S. stocks closed mixed on Wednesday despite touching all-time highs earlier in the session. The moves came as markets focused on a mix of corporate earnings, trade war concerns and the broad decline in the U.S. currency.\nDollar struggles The dollar extended losses after tumbling following U.S. Treasury Secretary Steven Mnuchin's comments that a weaker greenback was good for the country. Commerce Secretary Wilbur Ross later told CNBC that Mnuchin's remarks should not be seen as advocacy for a weaker dollar.\nAt 2:42 p.m. HK/SIN, the dollar index , which tracks the U.S. currency against a basket of rivals, slipped to trade at 88.822 after earlier falling to a fresh three-year low. Against the yen, the dollar traded at 108.79, below Wednesday's close of 109.24.\nThose developments came after President Donald Trump approved tariffs against imported solar cells and certain washing machines. The move, while seen as having a small economic impact for now, had raised some concerns over future trade moves in the region. South Korea and China also spoke out against the tariffs earlier in the week.\nThe euro , meanwhile, firmed to trade at $1.2450, above it's overnight high of $1.2415. The move in the euro also came ahead of the European Central Bank's interest rates decision on Thursday during Europe hours.\n\"There's no doubt in our minds that [ECB President Mario] Draghi will try to jawbone the currency by expressing his discontent with its rapid rise, but that may not be enough to reverse the uptrend in the euro,\" BK Asset Management Managing Director of FX Strategy Kathy Lien wrote in a note.\nOn the energy front, oil prices extended gains to touch their highest levels since December 2014 on Thursday. U.S. crude futures advanced 1.05 percent to trade at $66.30 per barrel.\nBrent crude rose 0.72 percent to trade at $71.04, breaking above the $71 mark for the first time in around three years.", "external_links": [], "published": "2018-01-25T01:46:00.000+02:00", "crawled": "2018-01-25T02:09:42.000+02:00", "highlightTitle": ""}