{"organizations": [], "uuid": "e0a8e9f9b5806f1c120e58cec8e8011c2ee4021f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/texas-politics-lgbt/texas-republicans-censure-house-leader-who-blocked-bathroom-bill-idUSL8N1PO5J9", "country": "US", "domain_rank": 408, "title": "Texas Republicans censure House leader who blocked 'bathroom bill'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.351, "site_type": "news", "published": "2018-01-30T05:38:00.000+02:00", "replies_count": 0, "uuid": "e0a8e9f9b5806f1c120e58cec8e8011c2ee4021f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/texas-politics-lgbt/texas-republicans-censure-house-leader-who-blocked-bathroom-bill-idUSL8N1PO5J9", "ord_in_thread": 0, "title": "Texas Republicans censure House leader who blocked 'bathroom bill'", "locations": [], "entities": {"persons": [{"name": "repu", "sentiment": "negative"}, {"name": "joe straus", "sentiment": "none"}, {"name": "mark jones", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "straus", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "texas republican party", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "tea party", "sentiment": "none"}, {"name": "rice university", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "state republican executive committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan 29 (Reuters) - Texas Republican Party leaders have censured the long-serving Republican speaker of the state House of Representatives for thwarting legislation, including blocking bills that sought to limit access to bathrooms for transgender people.\nThe move to reprimand Speaker Joe Straus over legislative priorities was an unheard of step for the party in the most populous Republican-controlled state. Emboldened by President Donald Trump’s success, the conservative Tea Party wing of the party was aiming to stamp out the few remaining centrist Republican members of the Republican-controlled state legislature, an analyst said.\n“That Tea Party wing is not content with marginalizing the centrist, conservative wing,” said Mark Jones, a professor in political science at Rice University in Houston. “It wants to completely destroy it.”\nThe State Republican Executive Committee voted on Saturday to censure Straus, the House speaker since 2009. He announced last year that he would not seek re-election in 2018 after bruising Republican party battles over “bathroom bills,” property taxes and state finances.\nStraus has been at loggerheads with socially conservative Republican Lieutenant Governor Dan Patrick, who controls the legislative agenda in the state Senate and backed bathroom bills.\nStraus used his power to block bills passed in the Senate that would require people to use restrooms in public schools and government-run buildings that correspond with the gender on their birth certificate rather than the gender with which they identify.\n“This is us being committed to supporting the convention, the delegates, Republican voters across Texas in unifying our party to move forward,” party chairman James Dickey said of the censure vote in a statement on Monday.\nBusinesses from Halliburton Co to Apple Inc lined up against the bathroom bills, saying they discriminated against transgender people, would hurt recruiting efforts in Texas and tarnished the state’s image.\nStraus sided with the corporations, called the measures unnecessary and kept them from coming up for a vote.\n“Speaker Straus expected these antics from some people when he opposed their bathroom bill and helped prevent the harm it would have brought to our state,” Jason Embry, a spokesman for Straus, said in an email on Monday.\nMomentum for bathroom bills stalled last year when North Carolina partially repealed a similar law in March. The original law prompted boycotts by sports organizations and businesses that are estimated to have cost the state hundreds of millions of dollars. (Reporting by Jon Herskovitz; Editing by Colleen Jenkins and Susan Thomas)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T05:38:00.000+02:00", "crawled": "2018-01-30T18:50:45.002+02:00", "highlightTitle": ""}