{"organizations": [], "uuid": "8e01992fa73fb0ccde05f76b02dba3cc8fdb34e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225595822&w=1200&r=LYNXMPEE0P1AW", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/u-s-stocks-vix-dance-in-tandem-in-break-with-history-idUSKBN1FF2S7", "country": "US", "domain_rank": 408, "title": "U.S. stocks, VIX dance in tandem in break with history", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T05:08:00.000+02:00", "replies_count": 0, "uuid": "8e01992fa73fb0ccde05f76b02dba3cc8fdb34e4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/u-s-stocks-vix-dance-in-tandem-in-break-with-history-idUSKBN1FF2S7", "ord_in_thread": 0, "title": "U.S. stocks, VIX dance in tandem in break with history", "locations": [], "entities": {"persons": [{"name": "stephen aniston", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cboe volatility index", "sentiment": "none"}, {"name": "black peak capital", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 9:08 PM / in an hour U.S. stocks, VIX dance in tandem in break with history Saqib Iqbal Ahmed 3 Min Read \nNEW YORK (Reuters) - A rising U.S. stock market normally reduces fear among investors, but the blistering pace of the current rally has instead also driven up the anxiety factor in the market. \nThe S&P 500 Index and the Cboe Volatility Index, which is the main gauge for measuring investor fears that benchmark stocks will drop in the near term, have moved in rare tandem form. \nOn nine separate occasions this month, the VIX has matched the direction taken by the S&P 500 on a given day. That marks the most times these two measures have moved concurrently in the same direction in all but two months over the last five years. \nThe VIX is derived from the price of S&P 500 options. When stocks fall, investors rush to buy protection and drive up the level of the VIX. Not so this year. \nEven though the S&P 500 has risen 4.7 percent over the last three weeks, the VIX has gained more that 2 points. \n“Even though the SPX has gone up, because it has gone up in such a parabolic fashion the VIX has gone up as well,” said Stephen Aniston, president of investment adviser Black Peak Capital, in Connecticut. \nIn recent months, U.S. stocks have steadily climbed, taking benchmark indexes to new highs, with nary a sign of volatility. This led some investors to sell S&P 500 call options, on the belief that the rally would lose steam. \nBy selling an index call the seller takes on the obligation to sell the value of the underlying index at a fixed price in the future. \nStocks’ rapid ‘melt-up’ this year has left these call sellers in a weak spot and they have been forced to buy calls to cover their short position, analysts said. This buying of S&P 500 calls tends to boost the VIX even as the market rallies, analysts said. \n“The balance of S&P 500 options demand has moved from puts to calls,” said Matt Thompson, co-head of the Volatility Group at Typhon Capital LLC, in Chicago. \nFor the first four weeks of the year, the average daily trading volume in S&P 500 call options has jumped by 44 percent, compared with a similar period last year, according to options analytics firm Trade Alert. Puts have seen a 32 percent increase. \nTo be sure, some of the call buying may be simply due to investors looking to profit from gains for stocks, Thompson said. \nWhile the VIX’s recent behavior is unusual it does not have any great implications for future stock returns, analysts said. \n“At some point, the market stops rallying so hard, and eventually volatility settles in after ‘overcorrecting’ to the upside,” Pravit Chintawongvanich, head of derivatives strategy at Macro Risk Advisors said in a note. Reporting by Saqib Iqbal Ahmed; Editing by Daniel Bases and Chizu Nomiyama", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T05:08:00.000+02:00", "crawled": "2018-01-26T23:16:36.005+02:00", "highlightTitle": ""}