{"organizations": [], "uuid": "9fe033791f175c616bc6c1752e815edd86735b8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-monster-digital-and-innovate-biopharmaceuticals-extend-outside-closing-date-for-merger.html", "country": "US", "domain_rank": 767, "title": "Monster Digital and Innovate Biopharmaceuticals Extend Outside Closing Date for Merger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "9fe033791f175c616bc6c1752e815edd86735b8f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-monster-digital-and-innovate-biopharmaceuticals-extend-outside-closing-date-for-merger.html", "ord_in_thread": 0, "title": "Monster Digital and Innovate Biopharmaceuticals Extend Outside Closing Date for Merger", "locations": [], "entities": {"persons": [], "locations": [{"name": "ca", "sentiment": "none"}, {"name": "simi valley", "sentiment": "none"}], "organizations": [{"name": "monster digital", "sentiment": "negative"}, {"name": "monster, inc", "sentiment": "none"}, {"name": "monster digital and innovate biopharmaceuticals, inc.", "sentiment": "none"}, {"name": "monster digital, inc.", "sentiment": "none"}, {"name": "innovate biopharmaceuticals, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Monster Digital announces significant corporate developments/potential delisting of common stock/settlement with Monster, Inc.\nSIMI VALLEY, CA, Jan. 04, 2018 (GLOBE NEWSWIRE) -- Monster Digital, Inc. (\"Monster Digital\" or the \"Company\") announced today several material events:\nExtension of Outside Closing Date for Merger. Monster Digital and Innovate Biopharmaceuticals, Inc. (\"Innovate\") today announced that they have agreed to extend the outside closing date (the \"Closing\") of their previously announced reverse merger (\"Merger\"). The Company and Innovate had originally planned to close the transaction by January 3, 2018 but the final preparations for the Closing are taking more time than expected. The Company and Innovate have amended the merger agreement to provide the outside termination date for the Merger will be January 26, 2018.\nAs previously disclosed, following the Closing, Innovate will become a wholly owned subsidiary of Monster Digital, and Monster Digital, as the parent of the surviving company, will be renamed \"Innovate Biopharmaceuticals, Inc.\" Innovate stockholders will own the substantial majority of shares of the combined company after the transaction. The common stock shares of the combined company will trade under the symbol INNT.\nAs previously disclosed, immediately prior to the effective time of the Merger, there will be a spin-off transaction (the \"Spin-Off\"). Previously, all of the business, assets and certain of the liabilities of Monster that are not assumed by Innovate in connection with the Merger were transferred into a wholly-owned subsidiary of the Company, MD Holding Co., Inc. (\"Holdco\"). Further to the Spin-Off, holders of record of the Company's common stock immediately prior to the effective time of the Merger will receive a pro rata distribution of one share of Holdco's private company common stock for each share of Monster common stock held.\n“We are actively engaged with Innovate and remain committed to the reverse merger. We continue to work diligently and cooperatively with Innovate to close the transaction as soon as possible,” said David Clarke, CEO of Monster Digital. Commenting on the Merger, Innovate's CEO Christopher P. Prior, Ph.D., stated: \"We are working closely with Monster Digital towards the Closing.\"\nMonster Digital announces significant corporate developments\nPotential for Common stock to be delisted. Monster Digital today announced that it has determined that it will be unable to regain compliance for continued listing of its common stock on the NASDAQ Capital Market by the previously reported January 3, 2018 deadline set by The NASDAQ Stock Market LLC Hearings Panel (the “Panel”).While the Company has been working diligently with Innovate to complete the Merger, the Company and Innovate, as reported above, have determined that they will be unable to achieve these objectives prior to the January 3, 2018 deadline.\nThe Company has requested that the Panel grant a further extension of the deadline until January 26, 2018. The Company can give no assurance that the Panel will grant such an extension. If the Panel does not grant the Company’s requested extension, based on the listing requirements of NASDAQ, the Company’s common stock will be delisted from the Nasdaq Capital Market. The Company's common stock is currently traded on the NASDAQ Capital Market under the trading symbol “MSDI.” The Company has filed an application and is taking the steps necessary to have its common stock Quote: d for trading in the OTCQB US Market (“OTCQB”), operated by OTC Markets, Inc., under the same trading symbol of “MSDI.” The Company expects to hear back from the Panel by the end of this week, but cannot give any assurance that a decision will be reached by then. If the Panel does not grant an extension and the Company’s common stock is delisted from the NASDAQ Capital Market, trading will commence on the OTCQB the next trading day.\nTo the extent that the Company’s common stock is delisted and following commencement of trading of its common stock on the OTCQB, the Company’s common stock will continue to be registered under the Exchange Act and the Company will continue to file financial reports that will be available on the SEC's website, www.sec.gov .\nSettlement Agreement with Monster, Inc. Monster Digital and Monster Inc., (formally known as Monster Cable Products, Inc.) announced that they have entered into a settlement agreement providing for the early termination of the License Agreement for the “Monster” names and trademarks. Pursuant to the new understanding, Monster Digital will cease using the Monster names and trademarks on or before February 1, 2018. Terms of the settlement were not disclosed.\nAbout Monster Digital, Inc.\nMonster Digital develops, markets and distributes Monster-branded products for use in high-performance consumer electronics, mobile products and computing applications. The Company designs and engineers premium action sports cameras and accessories, in addition to advanced data storage and memory products for professionals and consumers.\nMonster Digital is a registered trademark of Monster Products, Inc. in the U.S. and other countries.\nFor more information about the company, please visit http://www.monsterdigital.com\nAbout Innovate Biopharmaceuticals, Inc.:\nInnovate is a clinical stage biotechnology company focused on developing novel autoimmune/inflammation therapeutic drugs.\nInnovate's lead drug candidate, larazotide acetate (INN-202), has successfully met its primary endpoint in an efficacy clinical trial for celiac disease. Larazotide successfully completed the End of Phase 2 Meeting with the FDA to prepare for expected Phase 3 clinical trials for larazotide in celiac disease in 2018. In clinical studies in more than 800 patients, larazotide demonstrated a favorable safety profile comparable to placebo, due to what Innovate believes is its lack of systemic absorption from the small bowel. Larazotide has received Fast Track designation from the FDA.\nLarazotide, an oral peptide formulated into a capsule, has a mechanism of action that decreases intestinal permeability and regulates tight junctions by reducing antigen trafficking across epithelial cells in the intestines. Innovate believes that larazotide is the only drug in the clinic with this mechanism of action of reducing intestinal permeability. Increased intestinal permeability, sometimes referred to as \"leaky gut,\" has been widely recognized in the literature as a gateway to multiple autoimmune diseases, including celiac disease, irritable bowel syndrome (IBS), inflammatory bowel diseases (IBD, Crohn's and ulcerative colitis), type 1 diabetes mellitus (T1DM), nonalcoholic steatohepatitis (NASH), chronic kidney disease (CKD) and several others.\nFor more information, please visit http://www.innovatebiopharma.com\nForward-Looking Statements:\nSome of the statements in this press release are \"forward-looking\" and are made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995. Actual results and the timing of events could differ materially from those anticipated in such forward-looking statements as a result of risks and uncertainties including: the risk that the Merger may not be completed in the anticipate time frame or at all, which may adversely affect the price of the common", "external_links": ["https://www.globenewswire.com/Tracker?data=ufa9adHn1Xkzd-ywwm1YygWFijdnyxDgKgfk1btBnhFPQ2mLoIT45qZOUIJ8mrTDQkhFQ0QtNovqNca8nv8YtjP5gRO7X_MB_uC0D920C7VvJAIHE-TD6AFNs0rYfb0F", "https://www.globenewswire.com/Tracker?data=zEEORk2Kp1AreYPiZx1UIwlUrjNjoJL55PK9Y8_pwGHTkIJ_isRDFRe5zCYFOV2Jfii4rNw_8hDxOmjdS7YsuRm0i1N0RlmQmFflZXFx-7o=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8a7f00e9-8fb4-4736-9046-119ff24799a9", "https://www.globenewswire.com/Tracker?data=5Q266Jc2nt1HGxbuT7JlFNHqXroul8Ey8gssKD-slfKAIbPCs9W_u-kon9nD5ZsTYRZjYBxaiucOGbR40_Kz4A==", "https://www.globenewswire.com/Tracker?data=ufa9adHn1Xkzd-ywwm1Yyq8-v580C4DcpWOp-AUuTrRPvhjVTNg1eHbVvibQXgQlrsS4ZharZxlJgsMXa9wX7nB2DP9Pv9kgostaqIvBUv9N5-BzvcTBtvCx5CfxgqhX", "https://www.globenewswire.com/Tracker?data=Bn8pn_naRaWPu5XQCT1HPzN4yLRPjSgKhYo87XQ7_s5DSpTaDpUFqWIIdUgn63-JTbAsMiJwEflX5qIEmkl_236Xs53Z_IQySVVbih2Arzc=", "https://www.globenewswire.com/Tracker?data=NMBqtcdEVpacz3gET2O49ofjovRTPmAF35_D6KSaGkKXYUpJgijAzZtB9l70j-piIFK1lZMBoOwAZoIxDdYUmR7HhqdwlWYvBK8_xI603OWy55hEzEPOJJYmv3oxW64k1g_r1guPyQBSYQHi3yskxg=="], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:41:05.027+02:00", "highlightTitle": ""}