{"organizations": [], "uuid": "04ff029161340771fafb639b81245f4a8ea1a2a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 51, "shares": 51, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/us-usa-banks-appraisal/u-s-regulators-ready-to-ease-check-on-property-values-sources-idUSKBN1FF24R", "country": "US", "domain_rank": 408, "title": "U.S. regulators ready to ease check on property values: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T23:57:00.000+02:00", "replies_count": 0, "uuid": "04ff029161340771fafb639b81245f4a8ea1a2a1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-banks-appraisal/u-s-regulators-ready-to-ease-check-on-property-values-sources-idUSKBN1FF24R", "ord_in_thread": 0, "title": "U.S. regulators ready to ease check on property values: sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "federal deposit insurance corporation", "sentiment": "none"}, {"name": "fdic", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "occ", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. bank regulators plan to relax commercial real estate lending rules by allowing more deals to go ahead without an independent appraisal of the property’s value, according to several sources familiar with the discussions.\nThe revised rules will be welcomed by banks that have long-argued that appraisals on small-dollar loans are costly and unnecessary, but consumer advocates have warned it could increase risks.\nUnder existing rules, commercial real estate worth more than $250,000 must have an independent third-party check on the property value before a bank can lend against it.\nThat threshold would double to $500,000 under reforms being drawn up by the Federal Reserve, the Office of the Comptroller of the Currency (OCC) and the Federal Deposit Insurance Corporation (FDIC), according to industry and regulatory sources.\nThe new appraisal standards are expected to be released next month, the sources added.\nThe current threshold was drawn up in 1994 and has not been revised since. Over the summer, regulators proposed increasing the waiver threshold in line with inflation to $400,000 but have since agreed to raise it to $500,000 after lenders and trade groups called for a larger exemption, the sources said.\nThe Mortgage Bankers Association argued in September that there is a shortage of appraisers in rural areas and new technology means that some in-person checks are outdated.\nConsumer advocates, though, say that inflated property values worsened the 2007-2009 financial crash and that appraisals even on small value loans are essential.\n“People have short memories,” said Dennis Kelleher, president of pro-regulation think tank Better Markets. “When you ease these standards, you invite a crisis.”\nThe Fed, OCC and FDIC declined to comment.\nRegulators were due to consider a higher appraisal threshold in their routine review of existing laws. The industry hopes that President Donald Trump will keep his promise to relax more such financial rules.\nThe bank regulators are also discussing easing lending rules on rental developments which must currently satisfy the same appraisal standards as commercial real estate.\nOne idea being discussed would exempt small, new-build rental developments from outside appraisals.\nBanks are also pushing for regulators to loosen appraisal rules on home mortgage loans although this may require the blessing of other regulators, the sources said.\nReporting by Patrick Rucker; Editing by Susan Thomas\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T23:57:00.000+02:00", "crawled": "2018-01-29T01:53:17.012+02:00", "highlightTitle": ""}