{"organizations": [], "uuid": "ac3582fe53ed2c73b43de3fddfdb2776b46b1736", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220817081&w=1200&r=LYNXMPEE090Q6", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-cyber-microchips-nvidia/nvidia-says-some-chipsets-hit-by-spectre-gives-security-patches-idUSKBN1EZ1E9", "country": "US", "domain_rank": 408, "title": "Nvidia says some chipsets hit by Spectre, gives security patches", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:35:00.000+02:00", "replies_count": 0, "uuid": "ac3582fe53ed2c73b43de3fddfdb2776b46b1736"}, "author": "", "url": "https://www.reuters.com/article/us-cyber-microchips-nvidia/nvidia-says-some-chipsets-hit-by-spectre-gives-security-patches-idUSKBN1EZ1E9", "ord_in_thread": 0, "title": "Nvidia says some chipsets hit by Spectre, gives security patches", "locations": [], "entities": {"persons": [{"name": "laharee chatterjee", "sentiment": "none"}, {"name": "savio d'souza", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}], "organizations": [{"name": "nvidia", "sentiment": "negative"}, {"name": "quadro", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nvidia corp", "sentiment": "none"}, {"name": "nvs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 12:38 PM / Updated 9 minutes ago Nvidia updates software, says graphic chips not hit by flaws Joseph White , Aishwarya Venugopal 3 Min Read \n(Reuters) - Nvidia Corp is updating the software for its graphics processors in response to the Spectre security threat, but its chief executive said on Wednesday its chips were not subject to the same risks as those from Intel and other companies. \n“Our GPUs are immune,” Nvidia CEO Jensen Huang said during an event at the Consumer Electronics Show in Las Vegas, referring to graphics processing units, the chip maker’s key product. \n“They are not affected by these security issues.” \nHuang’s comments illustrate how technology sellers from cloud-based datacenter providers to anti-virus companies are scrambling to guard against flaws disclosed last week in chips made by Intel and others. \nSecurity researchers revealed vulnerabilities, dubbed Meltdown and Spectre, that could let hackers steal passwords or encryption keys from central processing units (CPUs) made by Intel and rivals. CPUs are used on personal computers, smartphones, servers and other devices. \nThe security patches unveiled by Nvidia relate to software drivers that let its chips work with operating systems like Windows. While Nvidia said its GPUs are not flawed, it was updating its drivers because they interact with potentially vulnerable CPUs. \nIt said it had no reason to believe the drivers were troubled by the second flaw, dubbed Meltdown. (bit.ly/2DeYzXN) VULNERABLE \nWhile the full extent of devices affected by the flaws is not yet fully known, Cisco Systems Inc has said it has identified 18 vulnerable products and is looking for problems in nearly 30 other products, including switches and routers. \nAdvanced Micro Devices Inc and Softbank’s ARM Holdings have said their central processing units are potentially exposed to Spectre. Advanced Micro also makes graphics chips. \nIntel has been hit by both Spectre and Meltdown and shares in all three chipmakers have been pushed around by the issues. \nRosenblatt Securities analyst Hans Mosesmann said Nvidia’s driver updates could become a problem for data centers and lead corporate customers to hold off on buying servers which have GPUs. \n“This can end up being a potential issue in data centers and enterprise customers can take a pause in buying the servers,” he said. \nIntel and AMD have not disclosed the number of chips affected by the security flaws and AMD has said its products were at “zero risk” from Meltdown. ARM says around 5 percent of more than 120 billion chips using its designs shipped since 1991 were impacted by Spectre, and significantly fewer by Meltdown. \nNvidia shares, down more than 1 percent in early trade, bounced back to gain 0.8 percent on the day after Huang’s comments. Intel shares fell 2.5 percent, while AMD, which investors speculate will benefit from its rivals’ problems, gained 1.2 percent. Additional reporting by Eric Auchard in Frankfurt and Laharee Chatterjee in Bengaluru; editing by Peter Henderson and Tom Brown", "external_links": [], "published": "2018-01-10T14:35:00.000+02:00", "crawled": "2018-01-10T14:50:47.003+02:00", "highlightTitle": ""}