{"organizations": [], "uuid": "931aab915d86492d6bc70add316e9f1a8af39f1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224062360&w=1200&r=LYNXMPEE0L0E0", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-wanda-sports-ipo/chinas-wanda-taps-citigroup-clsa-ubs-for-sports-unit-ipo-sources-idUSKBN1FB0J0", "country": "US", "domain_rank": 408, "title": "China's Wanda taps Citigroup, CLSA, UBS for sports unit IPO - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:02:00.000+02:00", "replies_count": 0, "uuid": "931aab915d86492d6bc70add316e9f1a8af39f1c"}, "author": "", "url": "https://www.reuters.com/article/us-wanda-sports-ipo/chinas-wanda-taps-citigroup-clsa-ubs-for-sports-unit-ipo-sources-idUSKBN1FB0J0", "ord_in_thread": 0, "title": "China's Wanda taps Citigroup, CLSA, UBS for sports unit IPO - sources", "locations": [], "entities": {"persons": [{"name": "wanda", "sentiment": "negative"}, {"name": "liana b.", "sentiment": "negative"}, {"name": "baker", "sentiment": "none"}, {"name": "fiona lau", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "citigroup", "sentiment": "negative"}, {"name": "ubs", "sentiment": "negative"}, {"name": "clsa", "sentiment": "negative"}, {"name": "ubs group ag", "sentiment": "none"}, {"name": "dalian wanda group", "sentiment": "none"}, {"name": "infront sports & media ag", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world triathlon corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO/HONG KONG (Reuters) - Chinese conglomerate Dalian Wanda Group has tapped three banks including Citigroup Inc and UBS Group AG to work on a proposed initial public offering for its sports businesses, four people with knowledge of the matter told Reuters.\nAn IPO would follow a string of asset sales as Wanda works to meet debt repayment deadlines. It was one of several domestic conglomerates to be targeted by a government crackdown last year for aggressive overseas acquisitions, with sources saying banks were told to stop providing funding for some deals.\nThe sprawling property-to-entertainment group has yet to decide which exchange to list on and is considering both Hong Kong and New York, two of the sources said. It hopes to raise up to $1 billion via the share sale, one of them said.\nThe float would likely include Infront Sports & Media AG, a Swiss sports marketing company, and World Triathlon Corp, the organizer and promoter of the Ironman race, Reuters reported this month. The two were acquired in 2015 for $1.2 billion and $650 million, respectively.\nWanda also tapped Hong Kong-based CLSA, the international investment banking arm of China’s CITIC Securities, for a potential IPO, one of the sources said.\nAll plans are still at an early stage and there is no guarantee that Wanda will pursue an IPO, said the people who declined to be named as the information was confidential.\nWanda, Citigroup and CLSA declined to comment. UBS didn’t respond to requests for comment.\nWhile an offshore listing makes more sense as the majority of its sports assets are located overseas, the company would also consider a listing for its domestic sports business in mainland China, according to one of the sources.\nUnlisted Wanda, owned by Chinese billionaire Wang Jianlin, has grown through acquisitions and its businesses now span property, sports and entertainment. Fitch Ratings estimates that Wanda Commercial Properties Co Ltd, its commercial real estate arm, had total debt of around $34 billion as of the end of September.\nSince the crackdown by Beijing, Wanda and other conglomerates such as HNA Group and Fosun International have dialed back some their ambitions abroad.\nLast week, Wanda agreed to sell its interests in a high-profile London property project. It is also expected to announce the sale of two Australian property projects in the coming days.\nThose in turn follow the sale of a portfolio of hotels and 13 tourism assets in China for $9 billion last year.\nIt also said on the weekend that revenue fell 10.8 percent in 2017, the second consecutive year it declined, due to asset sales.\nReporting by Liana B. Baker in San Francisco, Fiona Lau of IFR, and Julie Zhu in Hong Kong; Additional reporting by Kane Wu and Clare Jim in Hong Kong; Editing by Malcolm Foster\n ", "external_links": [], "published": "2018-01-22T08:02:00.000+02:00", "crawled": "2018-01-22T08:31:52.001+02:00", "highlightTitle": ""}