{"organizations": [], "uuid": "e7bb09fe121fa1184dcca0227b8e9fcc9400f0fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936801-GettyImages-903030184.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/president-donald-trump-should-not-submit-to-davos-lectures-commentary.html", "country": "US", "domain_rank": 767, "title": "President Donald Trump should not submit to Davos lectures- commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-22T06:43:00.000+02:00", "replies_count": 0, "uuid": "e7bb09fe121fa1184dcca0227b8e9fcc9400f0fc"}, "author": "Dr. Michael Ivanovitch", "url": "https://www.cnbc.com/2018/01/21/president-donald-trump-should-not-submit-to-davos-lectures-commentary.html", "ord_in_thread": 0, "title": "President Donald Trump should not submit to Davos lectures- commentary", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "getty images donald trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If President Donald Trump has to cancel his trip to Europe — as he should — he would owe a great debt of gratitude to lawmakers who shut down the government and saved him from a major political blunder.\nNobody believing in the sincerity of the passionate \"America First\" advocate would have expected that he would choose Europe to report, on Jan. 26, to his fellow Americans on the execution of his mandate to keep the country safe and prosperous.\nThat report should belong to America — and America alone. And that is what the country is expecting to hear during the president's State of the Union Address to the joint session of Congress on Tuesday, Jan. 30.\nWhat purpose would be served in preempting that solemn occasion by the president's trip to a private meeting in Europe is not clear, especially since the economy and national security will be the central issues he will discuss in his address to Congress.\nPerish the thought, but anybody looking at those dates could suspect that the majestic decorum of Capitol Hill was not enough of a stage to tell America, and the rest of the world, where the country stands on people's welfare, key social issues and homeland security.\nStay home, Florida links are great Those are the questions that will seal the fate of this presidency, and of the GOP's hold on power, in next November's elections. Barring a major war, Europe, and the plethora of its private talking shops, are totally irrelevant to that watershed electoral outcome.\nAnd in case anybody needs reminding, just look to the maxim attributed to late House Speaker Tip O'Neill: \"All politics is local.\"\nTrump is quick to take credit for the fact that the economic activity in the first three quarters of last year accelerated to an annual rate of 2.2 percent from 1.4 percent during the same period of 2016. But that credit belongs to the Federal Reserve for its steady support of household spending, residential investments, business capital outlays and, yes, low costs of public sector funding.\nThat Fed-driven faster growth also underpinned stronger corporate earnings, and a 32 percent gain on the Dow since Trump took the helm a year ago. A 0.6 percent annual decline of unit labor costs also meant that profits, instead of wages, took the lion's share of output growth.\nCertainly, the \"Trump market rally\" was driven by anticipations of corporate and personal tax cuts, but that is now fueling inflation expectations and a sharply steepening yield curve. Since the beginning of this year, the yield on the benchmark 10-year Treasury note rose 25 basis points, closing at 2.66 percent last Friday. That will force the Fed's hand to accelerate rate hikes. And the rising interest rates will increase the cost of government funding at a time when declining tax revenues are boosting budget deficits and public debt.\nThe stage is being set for a clash between inevitably rising credit costs and a programmed expansion of fiscal policy from very unfavorable initial conditions: a high public sector budget deficit of 4.6 percent of GDP and a gross public debt of 105 percent of GDP.\nDon't take a beating on trade That is an ominous policy mix that usually leads to an economic slowdown and recessions of unknown amplitude and duration.\nBut let's not rain on Trump's work anniversary party. The Chinese , the Europeans and the Japanese will do that. They have him stuck — on his watch — with a whopping $564 billion trade deficit in the first 11 months of last year. That's a 6 percent increase from the same period of 2016, and 76 percent of America's total trade gap.\nThat should be hard to swallow for someone who ran for office on the pledge of stopping, and reversing, America's huge and systematic hemorrhage on external accounts, and its steadily deteriorating net foreign debt — $8 trillion at the last count.\nThat, however, is only part of the problem. In a prelude to Trump's participation at that European jamboree, America's CEO is being mocked as a man starting trade wars and preventing the \"healing of a fractured world\" — whatever that means.\nHe is also being lectured on taking the huge trade deficits with equanimity because it's all America's fault: Just a matter of national account imbalances owing to the large savings-investment gap. They want to snow him with sophistry entirely analogous to the brutal retort of a German minister telling Trump to \"build better cars\" if he wanted Chevys on German roads.\nShould American taxpayers be footing the bill for that kind of nonsense while the government is being shut down and hundreds of thousands of public servants are put on unpaid leaves? After all, that trip would cost quite a bit more than a golfing weekend in New Jersey or Florida.\nBoth Democrats and Trump-friendly media would love that trip to Europe: a dream political fodder in the run-up to the \"do-or-die\" mid-term Congressional elections.\nWhat about the issues of war and peace? Here is a short list: The military standoff on the Korean Peninsula, ongoing war hostilities in Syria, Afghanistan, Yemen, Libya, Ukraine, or Iran's nuclear deal and that country's increasingly assertive role in the Middle East, etc.\nThose are the acute security problems that can be solved only if an agreement could be found among the U.S., China and Russia . But that's not done in Alpine ski resorts. The proper formats for that are state visits, or summits on the sidelines of official multilateral events, as was the case during last year's G-20 and APEC meetings. That's where Trump held discussions with the Chinese President Xi Jinping and Russian President Vladimir Putin .\nInvestment thoughts An American president should not submit to lectures at a private meeting in Europe about trade policies and issues of war and peace.\nWith its purchases from the rest of the world exceeding its sales by half a trillion dollars a year, America remains the true locomotive of the world economy. The German-led Europe and China-dominated East Asia are living off America and the rest of the world with their respective trade surpluses currently running at annual rates of $394 billion and $480 billion.\nStay home, Mr. President. The former President Bill Clinton made a relaxing trip to the Alps at the end of his two-term mandate in 2000. That's a far cry from military standoffs, reforms and electoral agenda facing the current presidency.\nIf Trump wants to help the country and lead for another term of office, he may wish to focus on health care, education and vocational training to get some of those 95.5 million Americans back into the labor force for meaningful and productive lives.\nStructural labor market reforms — including manpower training and relocation — are an urgent task if Trump wants to lift America's dismal potential and noninflationary growth from its current 1.8 percent to the 3 to 4 percent range he is talking about. The stock and the quality of human capital is the key determining variable to reach that objective.\nThere is no labor force shortage in America. The last batch of numbers are showing that 4.9 million Americans were working part time because they could not find full-time jobs. And another 1.6 million just quit looking for a job because they could not find any. That puts the actual unemployment rate at 8.2 percent — not the officially reported 4.1 percent — and the number of people out of work at 13.1 million, double the reported number of 6.6 million.\nIf the supply of qualified labor is not increased, an attempt to force faster growth through explosive policy mixes (a combination of cheap money and lower taxes) will quickly run into capacity bottlenecks to cause inflation bursts and recessionary relapses.\nAmerica's growing capacity to create real and sustainable wealth is a key feature of statecraft, and a foundation for leadership in education, science, technology and human development.\nCommentary by Michael Ivanovitch, an independent analyst focusing on world economy, geopolitics and investment strategy. He served as a senior economist at the OECD in Paris, international economist at the Federal Reserve Bank of New York, and taught economics at Columbia Business School.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-22T06:43:00.000+02:00", "crawled": "2018-01-22T06:44:01.001+02:00", "highlightTitle": ""}