{"organizations": [], "uuid": "a66ff81aa3a84bc52c544576776d515a84c2a012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE871_3hA4E_TOP_20180126181920.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/apples-high-bar-1517221800", "country": "US", "domain_rank": 387, "title": "Apple’s High Bar", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:30:00.000+02:00", "replies_count": 0, "uuid": "a66ff81aa3a84bc52c544576776d515a84c2a012"}, "author": "Dan Gallagher", "url": "https://www.wsj.com/articles/apples-high-bar-1517221800", "ord_in_thread": 0, "title": "Apple’s High Bar", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "high bar", "sentiment": "neutral"}, {"name": "apple", "sentiment": "neutral"}, {"name": "apple inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "59 COMMENTS Generally speaking, technology gets a lot cheaper as it ages. Apple Inc. AAPL -2.05% is counting on precisely the opposite.\nThe iPhone X, which made its debut in November , essentially ushers in the second decade of the touch-screen smartphone revolution that Apple kicked off with its original iPhone in 2007. Despite the fanfare christening the device as “the future of smartphones,” the iPhone X differs little in basic function from its recent predecessors. But an expanded display and other bells and whistles encouraged Apple to give the device a premium price tag. The iPhone X starts at $1,000—making it the most expensive base model smartphone ever in the U.S.\nFor Apple, that represents a gamble that customers won’t bolt for cheaper-but-still-premium Android options . In developed markets like the U.S., the company’s market share has stayed largely consistent. Switching is easier than ever in an age of cloud storage and streaming apps, but most smartphone customers by now have picked their platform and seem to stay on it.\nThat doesn’t mean the so-called supercycle many investors are expecting this year will be a sure thing. Several analysts have cited data from Apple’s supply chain pointing to a mixed picture for the new iPhones . Toni Sacconaghi of Bernstein said his analysis suggests total iPhone unit sales for the March quarter could come in at a range of 51 million to 57 million units—well below the 61 million units Wall Street is currently targeting.\nApple’s fiscal second quarter ending in March is particularly important this time around because the company needs iPhone sales to remain strong in order to hit Wall Street’s current prediction of overall revenue growing 19% this fiscal year compared with 6% last year.\nThat means Apple’s forecast for the March quarter will likely overshadow results for the December period that the company will report on Thursday. Analysts currently expect March-quarter revenue to surge 28% year over year to nearly $68 billion—a high mark to hit. And Apple’s stock price, which is up 40% over the last 12 months and near a record 15 times forward earnings, is likely to take a tumble if the company’s outlook disappoints.\nMuch depends on Apple finding enough customers willing to pay up. And higher prices can help the company meet revenue growth targets even if unit sales are weaker. Analysts currently expect the average selling price for the iPhone segment to hit $757 for both the December and March quarters—more than $100 above the average for the last four periods. A thousand bucks will seem ludicrous to many smartphone buyers, and Apple had better hope it has enough devoted fans to help the iPhone X make the connection.\nThe number one new feature on the iPhone X is its facial recognition system. WSJ's Joanna Stern put it to the test with masks, costumes and identical triplets. Photo: Drew Evans/The Wall Street Journal Write to Dan Gallagher at dan.gallagher@wsj.com", "external_links": [], "published": "2018-01-29T12:30:00.000+02:00", "crawled": "2018-01-29T13:08:10.016+02:00", "highlightTitle": ""}