{"organizations": [], "uuid": "a2212fa27a60e4173910d3cab0a1e13a3179a056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223218688&w=1200&r=LYNXMPEE0H1Z1", "site_section": "http://feeds.reuters.com/reuters/INhollywood\r", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-people-cosby/prosecutors-want-testimony-of-19-other-accusers-for-cosby-retrial-idINKBN1F731F", "country": "US", "domain_rank": 408, "title": "Prosecutors want testimony of 19 other accusers for Cosby retrial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:14:00.000+02:00", "replies_count": 0, "uuid": "a2212fa27a60e4173910d3cab0a1e13a3179a056"}, "author": "", "url": "https://in.reuters.com/article/us-people-cosby/prosecutors-want-testimony-of-19-other-accusers-for-cosby-retrial-idINKBN1F731F", "ord_in_thread": 0, "title": "Prosecutors want testimony of 19 other accusers for Cosby retrial", "locations": [], "entities": {"persons": [{"name": "bill cosby", "sentiment": "none"}, {"name": "andrea constand", "sentiment": "none"}, {"name": "constand", "sentiment": "none"}, {"name": "kevin steele", "sentiment": "none"}, {"name": "cosby", "sentiment": "none"}, {"name": "steven o‘neill", "sentiment": "none"}], "locations": [{"name": "cheltenham", "sentiment": "none"}, {"name": "montgomery county", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "temple university", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:07 PM / Updated 17 hours ago Prosecutors want testimony of 19 other accusers for Cosby retrial Reuters Staff 3 Min Read \n(Reuters) - Pennsylvania prosecutors on Thursday asked the judge who will preside over the second sexual assault trial of actor Bill Cosby to allow the testimony of 19 other accusers, including 12 women who were not allowed testify in the entertainer’s first trial. \nCosby, 80, is scheduled go to trial on April 2 on charges that he sexually assaulted Andrea Constand at his home in the Philadelphia suburb of Cheltenham in January 2004, after drugging her and rendering her incapacitated. \nConstand worked with the women’s basketball team at Temple University, where Cosby, a university alumnus, befriended her. \nHis first trial ended in a mistrial last June when a jury was unable to reach a verdict after deliberating for five days. \nIn court papers filed on Thursday, Montgomery County District Attorney Kevin Steele asked Judge Steven O‘Neill to admit evidence from 19 women regarding Cosby’s “prior bad acts,” even though it is not directly related to the alleged assault on Constand. \nThe testimony is relevant, prosecutors argued, because it would enable them to establish that Cosby “who over the course of decades, intentionally intoxicated young women in signature fashion and then sexually assaulted them while they were incapacitated, could not have been mistaken about whether or not Ms. Constand was conscious enough to consent to any sexual contact.” \nCosby, who starred in the 1980s TV series “The Cosby Show” and built a long career on family-friendly comedy, has denied assaulting anyone and has portrayed all of the encounters as consensual. \nSteele asked O‘Neill to allow 13 of the 19 women to testify in the first trial, but the judge denied the request for all but one, Kelley Johnson, who prosecutors said testified to an “eerily similar” encounter with Cosby. \nThe other accusers, whom prosecutors did not identify, would testify to similar encounters, prosecutors said. \nIn general, a defendant’s prior bad acts are not admissible as evidence that he or she committed a particular crime. Prosecutors, however, are allowed on rare occasions to use evidence or witnesses to prove a defendant committed a crime as part of a longstanding pattern of behavior. \nJudges typically weigh the value of such evidence against the possibility that it will unfairly prejudice a jury. Reporting by Peter Szekely in New York; Editing by Frank McGurty and Leslie Adler", "external_links": [], "published": "2018-01-19T05:14:00.000+02:00", "crawled": "2018-01-19T06:01:40.009+02:00", "highlightTitle": ""}