{"organizations": [], "uuid": "f1858776ffa2fc9098b070b85294ec686c8b255b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226975467&w=1200&r=LYNXMPEE0U13B", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/italy-election-meloni/interview-leading-lady-of-italys-right-campaigns-for-a-baby-boom-idINKBN1FK24I", "country": "US", "domain_rank": 408, "title": "Interview: Leading lady of Italy's right campaigns for a baby boom", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:51:00.000+02:00", "replies_count": 0, "uuid": "f1858776ffa2fc9098b070b85294ec686c8b255b"}, "author": "", "url": "https://in.reuters.com/article/italy-election-meloni/interview-leading-lady-of-italys-right-campaigns-for-a-baby-boom-idINKBN1FK24I", "ord_in_thread": 0, "title": "Interview: Leading lady of Italy's right campaigns for a baby boom", "locations": [], "entities": {"persons": [{"name": "giorgia meloni", "sentiment": "none"}, {"name": "silvio berlusconi", "sentiment": "none"}, {"name": "meloni", "sentiment": "none"}, {"name": "isla binnie", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "brothers of italy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:53 PM / Updated an hour ago Interview: Leading lady of Italy's right campaigns for a baby boom Isla Binnie 6 Min Read \nROME (Reuters) - When a seven months-pregnant Giorgia Meloni put herself forward for the post of mayor of Rome in 2016, her ally Silvio Berlusconi told her that a mother could not do such a tough job. \nShe stood anyway and lost, partly because her conservative allies deserted her. \nTwo years later, the pair have linked up in a centre-right coalition to fight a national election on March 4, with Meloni insisting that their joint programme include measures to help working mothers and encourage people to have children. \nHer party, the Brothers of Italy, which traces its roots to the post-Fascist Italian Social Movement, is a small but crucial component in the alliance that polls suggest will win the election, while probably falling short of a working majority. \n“The first thing we asked for was a grand plan to sustain the birth rate and give incentives to become parents, which is a priority in our programme,” Meloni, the only woman to lead a high-profile party into the election, told Reuters in an interview. \n“Too many women have to choose between being a mother and having a job.” \nSince becoming Italy’s youngest ever minister 10 years ago, the 41-year-old has campaigned on a hard-right, nationalist platform with the credo “Italians First”. \nShe says that if Italy’s birth rate keeps on falling, in 30 years more than 35 percent of the population will be over 65 and the welfare system that underpins the euro zone’s third-largest economy will not cope. \nCampaigning for mayor while pregnant, Meloni felt “if this kind of discrimination happens to someone like me, who has opportunity, and can get myself organised when I become a mother, imagine what happens to a girl on a short-term contract at a call centre”. \nBrothers of Italy, which polls at around 5 percent, is the junior partner in the centre-right coalition with Berlusconi’s Forza Italia (Go Italy!) and the far-right Northern League. \nMeloni’s personal popularity dwarfs her party‘s, with an approval rating of over 20 percent putting her roughly in line with her coalition allies in some surveys. \nA combative public speaker, Meloni’s rapid-fire speeches attacking immigration and globalisation are delivered in deep tones easily traceable to the working-class Rome neighbourhood where she was born and raised. \nShe speaks proudly of her history in Italian right-wing politics, emphasising she was born decades after the end of the country’s wartime dictatorship. \nShe says Italians must take precedence over immigrants for access to social services, like the free nursery care she proposes to help boost births, which declined by 100,000 between 2008 and 2016. Leader of the far-right Brothers of Italy party, Giorgia Meloni poses during a political rally in Rome, Italy January 23, 2018. REUTERS/Remo Casilli \nMeloni’s policies are similar to those of League leader Matteo Salvini, but while the League’s power base is in the industrial north, Brothers of Italy is stronger in the centre and under-developed south - where it is proposing a dedicated investment plan with tax breaks for companies. \nShe and Salvini opposed legislation on gay civil unions and citizenship for children of immigrants, and they often attack the European Union. \nTheir nationalist messages have worried financial markets and Brussels, and Berlusconi is responding by casting himself as a moderate who can keep his rambunctious allies in check. \nHe has promised to keep Italy in the euro, to which both Salvini and Meloni are hostile, and to keep Italy’s budget deficit inside EU-imposed limits. But disagreements among the partners are frequent on these and other issues. \nMeloni called the euro “a currency that could collapse”, meaning Italy needs a “plan B”, but should not exit unilaterally. Leader of the far-right Brothers of Italy party, Giorgia Meloni arrives in her car to attend a political rally in Rome, Italy January 23, 2018. REUTERS/Remo Casilli \n“PATRIOTS” \nIf the centre-right wins power, whichever party gets most votes will pick the premier, meaning Meloni is unlikely to be Italy’s first female prime minister, but she expects her group to win more than 50 seats, up from its current tally of 12. \nAs well as the parenting plan, which includes monthly bonuses for parents of children under six, Brothers of Italy wants Muslim religious services to be conducted in Italian not Arabic, and to limit the number of foreign pupils in schoolrooms. \nBorn more than 30 years after the end of the Second World War, Meloni brushes off links with Italy’s Fascist dictatorship, saying this is “waved like a scarecrow” by her opponents. \nAt least two European embassies in Rome would not welcome meetings with Meloni because of her party’s extremist tendencies, officials said, requesting anonymity because of the sensitivity of the issue so close to the election. \nMeloni said she spoke to diplomats from “all Italy’s principal allies”, and had met ambassadors from the United States, Russia and Israel. \nShe says the centre-left government copied her proposals with its plan to stop mass migration across the Mediterranean by supporting the Libyan coast guard. \n“They said we were xenophobes because we asked to strike a deal with the Libyan governments and called for a naval blockade on the Libyan coast to stop the boats, then when the interior minister said it, he was treated like a genius.” \nShe admits the centre-right allies argue, describing their relationship as “up and down”, but she says they have a responsibility to bury their differences. \n“We are the only ones able to give Italy a government of patriots, that looks after the interests of Italians.” Additional reporting by Crispian Balmer; editing by Giles Elgood", "external_links": [], "published": "2018-01-31T16:51:00.000+02:00", "crawled": "2018-01-31T17:19:18.004+02:00", "highlightTitle": ""}