{"organizations": [], "uuid": "9c406e7f861d472d67d7afeb7b14854ff703d21a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-hershey-completes-tender-offer-for-all-outstanding-shares-of-amplify-snack-brands-inc.html", "country": "US", "domain_rank": 767, "title": "Hershey Completes Tender Offer for All Outstanding Shares of Amplify Snack Brands, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:30:00.000+02:00", "replies_count": 0, "uuid": "9c406e7f861d472d67d7afeb7b14854ff703d21a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-hershey-completes-tender-offer-for-all-outstanding-shares-of-amplify-snack-brands-inc.html", "ord_in_thread": 0, "title": "Hershey Completes Tender Offer for All Outstanding Shares of Amplify Snack Brands, Inc.", "locations": [], "entities": {"persons": [{"name": "hershey", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "hershey", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "hershey company", "sentiment": "negative"}, {"name": "hershey completes tender offer for all outstanding shares of amplify snack brands, inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "alphabet merger sub inc.", "sentiment": "none"}, {"name": "amplify snack brands, inc.", "sentiment": "none"}, {"name": "hershey", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "american stock transfer & trust co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERSHEY, Pa. and AUSTIN, Texas, Jan. 31, 2018 (GLOBE NEWSWIRE) -- The Hershey Company (NYSE:HSY) (“Hershey”) today announced the successful completion of the previously announced tender offer by Alphabet Merger Sub Inc., a subsidiary of Hershey (“Purchaser”), for all of the outstanding shares of common stock of Amplify Snack Brands, Inc. (NYSE:BETR) (“Amplify”) at a price of $12.00 per share in cash.\nAmerican Stock Transfer & Trust Co., LLC, the depositary for the tender offer, has advised Hershey that, as of 12:00 midnight, New York City time, at the end of January 30, 2018, the expiration of the tender offer, approximately 71,970,009 shares of common stock of Amplify, representing approximately 95.1391% of Amplify’s currently outstanding shares of common stock, were validly tendered and not withdrawn in the tender offer (including shares tendered pursuant to guaranteed delivery procedures). As a result, the condition to the tender offer that a majority of Amplify’s outstanding shares of common stock on a fully diluted basis be validly tendered and not withdrawn has been satisfied. Purchaser has accepted for payment all shares of common stock of Amplify validly tendered and not withdrawn and will promptly pay for such shares.\nHershey expects to complete the merger of Purchaser into Amplify under Section 251(h) of the General Corporation Law of the State of Delaware today. As a result of the merger, all remaining Amplify shares of common stock issued and outstanding immediately prior to the effective time of the merger (other than any (i) shares held in the treasury of Amplify, (ii) shares owned by Hershey or Purchaser, or their subsidiaries, (iii) shares irrevocably accepted for purchase in the tender offer and (iv) shares held by Amplify stockholders who properly demanded and perfected appraisal rights under Delaware law) will be converted into the right to receive an amount in cash equal to $12.00 per share, net to the seller in cash, without any interest, but subject to and reduced by any required withholding of taxes (i.e., the same price that was paid in the tender offer). As a result of the merger, Amplify will become a wholly owned subsidiary of Hershey, and Amplify common stock will cease to be traded on The New York Stock Exchange.\nSafe Harbor Statement\nThis release contains . Many of these can be identified by the use of words such as “intend,” “believe,” “expect,” “anticipate,” “should,” “planned,” “projected,” “estimated,” and “potential,” among others. These statements are made based upon current expectations that are subject to risk and uncertainty. Because actual results may differ materially from those contained in the , you should not place undue reliance on the when deciding whether to buy, sell or hold Hershey’s securities. Factors that could cause results to differ materially include, but are not limited to: the ability of Hershey to realize the benefits of the transaction; issues or concerns related to the quality and safety of products, ingredients or packaging; changes in raw material and other costs, along with the availability of adequate supplies of raw materials; selling price increases, including volume declines associated with pricing elasticity; market demand for new and existing products; increased marketplace competition; disruption to manufacturing operations or supply chain; failure to successfully execute and integrate acquisitions, divestitures and joint ventures; changes in governmental laws and regulations, including taxes; political, economic, and/or financial market conditions; risks and uncertainties related to international operations; disruptions, failures or security breaches of information technology infrastructure; the ability to hire, engage and retain a talented global workforce; the ability to realize expected cost savings and operating efficiencies associated with strategic initiatives or restructuring programs; complications with the design or implementation of Hershey’s new enterprise resource planning system; and such other matters as discussed in Hershey’s Annual Report on Form 10-K for the year ended December 31, 2016 and Hershey’s Quarterly Report on Form 10-Q for the quarter ended July 2, 2017. All information in this press release is as of January 31, 2018. Hershey does not undertake any duty to update any forward-looking statement to conform the statement to actual results or changes in expectations.\nFINANCIAL CONTACT: MEDIA CONTACT: Mark Pogharian Leigh Horner 717-534-7556 717-508-1247\nSource:The Hershey Company", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/31d8e131-6a9a-4402-a38a-558a43e0166c"], "published": "2018-01-31T16:30:00.000+02:00", "crawled": "2018-01-31T17:52:40.000+02:00", "highlightTitle": ""}