{"organizations": [], "uuid": "0966f5fedca9044d98c0f8c67fb2e958ef8651f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/adidas-bvg-sneaker.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/adidas-shoes-berlin-eqt-support/", "country": "US", "domain_rank": 1196, "title": "Adidas Shoes' Latest Feature Is a Berlin Transit Ticket | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.992, "site_type": "news", "published": "2018-01-16T06:48:00.000+02:00", "replies_count": 0, "uuid": "0966f5fedca9044d98c0f8c67fb2e958ef8651f0"}, "author": "David Meyer", "url": "http://fortune.com/2018/01/16/adidas-shoes-berlin-eqt-support/", "ord_in_thread": 0, "title": "Adidas Shoes' Latest Feature Is a Berlin Transit Ticket | Fortune", "locations": [], "entities": {"persons": [{"name": "david meyer", "sentiment": "negative"}], "locations": [{"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "adidas shoes", "sentiment": "negative"}, {"name": "est  adidas", "sentiment": "neutral"}, {"name": "bvg", "sentiment": "none"}, {"name": "adidas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer 4:48 AM EST \nAdidas has some new sneakers that aren’t just made for walking—they’re for taking public transport, too. \nThe German clothing giant has struck a deal with the Berlin transit authority, BVG, in which Adidas will sell 500 pairs of sneakers that have year-long 2018 tickets sewn into them. An annual BVG ticket for zones A and B, which cover everything within the capital’s borders, costs €761 ($930). The EQT Support 93/Berlin shoes, however, cost just €180. \nThe sneakers go on sale on Tuesday, limited to one pair per customer. According to The Local , people have been lining up outside the two stores selling them since Saturday, and early Tuesday morning 550 people were counted in the lines. \nThe shoes in question are variants on the standard EQT Support 93/17 sneaker. Apart from the fact that they function as transit tickets, they are also distinguished by their inclusion of BVG’s famous (in Berlin, at least) mottled seat fabric design. \nHowever, there are a couple of catches that have generated some criticism for the Adidas-BVG partnership, courtesy of passenger association IGEB. \nThe first issue is that the marketing promotion is discriminatory—the shoes can only be used as tickets when they are worn on the passenger’s feet, so they won’t be of much use to those with foot deformities. \nAccording to Berliner Zeitung , the second problem is that the tickets in the shoes don’t cover all of Berlin’s transit systems. A normal BVG ticket is also accepted on Berlin’s overground S-Bahn trains, and on regional trains within Berlin’s borders—even though these services are not operated by BVG, which only directly handles underground U-Bahn trains and buses. That’s not the case with these sneakers. \nBVG, which gets no revenue at all from the promotion, told the paper it was not worried about passengers getting confused. Indeed, spokeswoman Petra Reetz suggested that “most buyers will put the sneakers in a showcase and not travel with them.” \nAdidas is fond of eye-catching marketing ploys. A few months ago, it released vomit-resistant shoes in honor of Oktoberfest . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T06:48:00.000+02:00", "crawled": "2018-01-16T13:54:47.000+02:00", "highlightTitle": ""}