{"organizations": [], "uuid": "76355c58fc91d5de342cea85452492e7f1bfb9a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224561178&w=1200&r=LYNXMPEE0M1NM", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-davos-meeting-protests/thousands-march-against-trump-in-swiss-financial-capital-idUSKBN1FC2OI", "country": "US", "domain_rank": 408, "title": "Thousands march against Trump in Swiss financial capital", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:59:00.000+02:00", "replies_count": 0, "uuid": "76355c58fc91d5de342cea85452492e7f1bfb9a6"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-protests/thousands-march-against-trump-in-swiss-financial-capital-idUSKBN1FC2OI", "ord_in_thread": 0, "title": "Thousands march against Trump in Swiss financial capital", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "bern", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "alpine", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:00 PM / in 8 minutes Swiss marchers protest against Trump, break through Davos security cordon Michael Shields , Fedja Grulovic 3 Min Read \nZURICH/DAVOS (Reuters) - Anti-capitalists marched through Swiss cities on Tuesday to protest a planned visit by U.S. President Donald Trump to the World Economic Forum (WEF) and broke through a security cordon in Davos. \nLeftists organizers called for the protests under the mottos “Trump Not Welcome” and “Smash WEF!” \nTrump is due to speak on Friday at the WEF in the Alpine town of Davos, an annual meeting of global business and political leaders where protests have been banned. \nAbout 20 demonstrators broke through security to reach the Davos Congress Centre, holding banners and shouting “Wipe out WEF” before they were peacefully disbanded by police. \n“Trump is just one of the other people we disagree with. We’ve been protesting every year now against the World Economic Forum and if Trump comes or not we don’t care. Trump is just, maybe he’s just the best symbol of this world,” protester Alex Hedinger told Reuters TV in Davos. \nMore than 4,000 Swiss soldiers have deployed to guard Davos alongside 1,000 police and a no-fly zone is in place. \nPolice estimated that there were 2,000 demonstrators in Zurich. \nThey carried flags and anti-globalist and environmentalist placards such as “No Trump, no coal, no gas, no fossil fuels” as they marched toward Zurich’s financial district, where bankers had been warned to stay clear of the approved demonstration. People attend an Anti-Trump demonstration to protest U.S. President's coming to the World Economic Forum of Davos, in Geneva, Switzerland January 23, 2018. REUTERS/Pierre Albouy \nSwiss television RSR showed a sign that read “Who was the shithole?”, in reference to reported remarks by Trump about Haiti and African countries, which he has denied. \nSeveral hundred protesters also marched in public squares in Geneva, Lausanne and Fribourg. Geneva signs read “World Economic Fiasco”, “racist sexist capitalist” and “Don’t touch women’s rights”. Slideshow (7 Images) \nGeneva demonstrator organizer Paolo Gilardi told Reuters TV: “While the Swiss Federal Council (Swiss cabinet) is about to welcome and unroll the red carpet for Mister Trump, well we think that the population has something to say.” \n“This policy is unacceptable because the goal ... is to reduce the planet to fire and blood and to assure the powerful people’s domination over the rest of the world.” \nEarlier in Geneva, protesters laid a wreath at the entrance of the U.S. diplomatic mission in memory of Heather Heyer, who was killed in Charlottesville, Virginia, amid clashes between white supremacists and counter-protesters last August. \nAfter the rally, Trump inflamed tensions by saying there were “very fine people” on both sides, drawing condemnation from some Republican leaders and praise from white supremacists. \nEarlier this month, demonstrators also protested against Trump’s visit in the Swiss capital of Bern. \nThat march was peaceful, unlike violent anti-WEF protests in several Swiss cities in the early 2000s. Reporting by Michael Shields in Zurich, Fedja Grulovic in Davos and Cecile Mantovani in Geneva; writing by Michael Shields and Stephanie Nebehay; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-23T20:59:00.000+02:00", "crawled": "2018-01-23T21:13:51.007+02:00", "highlightTitle": ""}