{"organizations": [], "uuid": "d2c720ecce1d34704ea358810441d7978fc4df85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-envista-forensics-announces-definitive-agreement-to-acquire-samac-engineering.html", "country": "US", "domain_rank": 767, "title": "Envista Forensics Announces Definitive Agreement to Acquire SAMAC Engineering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "d2c720ecce1d34704ea358810441d7978fc4df85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-envista-forensics-announces-definitive-agreement-to-acquire-samac-engineering.html", "ord_in_thread": 0, "title": "Envista Forensics Announces Definitive Agreement to Acquire SAMAC Engineering", "locations": [], "entities": {"persons": [{"name": "robert wedoff", "sentiment": "none"}, {"name": "envista", "sentiment": "none"}], "locations": [{"name": "western canada toronto", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}], "organizations": [{"name": "envista forensics", "sentiment": "negative"}, {"name": "forensic consulting capabilities", "sentiment": "negative"}, {"name": "samac engineering ltd", "sentiment": "none"}, {"name": "samac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expands Canadian Forensic Consulting Capabilities in Western Canada\nTORONTO and ATLANTA, Robert Wedoff, President of Envista Forensics (\"Envista\"), announced today the signing of a definitive agreement to acquire SAMAC Engineering Ltd, a leading national provider of failure analysis services to insurance, legal and commercial clients. With this announcement, Envista strengthens its strategic position as the leading forensic consulting provider in Canada.\nFounded over twenty five years ago and based in Calgary, AB, SAMAC's team of experienced and credentialed engineers and experts have assisted clients with thousands of failure investigations. The firm's large loss capabilities, multi-disciplinary engineering teams and metallurgical depth have all assisted in rapidly growing their industry reputation.\nSAMAC's leadership will serve in pivotal roles throughout the acquisition and integration, as well in the resulting combined organization.\n\"The recent growth of our Canadian operations, both organically and strategically through the acquisitions of key leadership and expertise, is one of Envista's many success stories over the last couple of years,\" said Robert Wedoff, President.\nHe went on to add, \"The SAMAC team's excellent reputation in Canada, will undoubtedly enhance our combined team's ability to deliver unprecedented service and certainty for clients in Canada and around the world.\"\nRon Koerth, Envista Senior Vice President of Forensic Consulting for Canadian operations said, \"I have admired the SAMAC team for many years. Their excellent reputation in the Canadian market is a direct result of the outstanding leaders, experts and operational staff that comprise SAMAC, and we are delighted to be welcoming this wonderful team to the Envista Family.\"\n\"On behalf of SAMAC, I am truly excited about becoming part of the Envista family. Since we founded SAMAC in 1992, our team has always worked to provide the highest level of expertise and service for our clients,\" commented Steve MacInnis, Owner/Principal of SAMAC.\nHe continued by saying, \"Without a doubt, SAMAC's most valuable asset is its people, and one of my greatest rewards has been providing our employees with an environment to grow themselves and the company. As we learned more about Envista and their people-centric philosophy, it became clear that Envista was not only a dynamic, growing firm but a great place to work with a similar service mindset. Together, we are a global provider taking our combined services and expertise to an even higher level.\"\nAbout Envista Forensics\nEnvista is a global leader in forensic engineering & recovery solutions, providing failure analysis, fire and explosion investigations, digital forensics, accident reconstruction, building consulting, geotechnical engineering, damage evaluations and equipment restoration services following disasters of all kinds.\nEnvista has served the insurance, legal and risk management industries for over 30 years. Their experts travel globally from over 30 offices located across North America, Latin America, Europe, Asia-Pacific, and Australia.\nFor additional information, please contact:\nJennifer Gaster, Vice President of Marketing\nJennifer.Gaster@envistaforensics.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/envista-forensics-announces-definitive-agreement-to-acquire-samac-engineering-300587496.html\nSOURCE Envista Forensics", "external_links": ["http://www.prnewswire.com/news-releases/envista-forensics-announces-definitive-agreement-to-acquire-samac-engineering-300587496.html"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:36:36.019+02:00", "highlightTitle": ""}