{"organizations": [], "uuid": "e21845174bea9b8af2762dc47a1207e33501e167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221306142&w=1200&r=LYNXMPEE0B03V", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-pollution-beijing/chinas-capital-issues-first-major-smog-alert-of-winter-idUSKBN1F106A", "country": "US", "domain_rank": 408, "title": "China's capital issues first major smog alert of winter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:57:00.000+02:00", "replies_count": 0, "uuid": "e21845174bea9b8af2762dc47a1207e33501e167"}, "author": "", "url": "https://www.reuters.com/article/us-china-pollution-beijing/chinas-capital-issues-first-major-smog-alert-of-winter-idUSKBN1F106A", "ord_in_thread": 0, "title": "China's capital issues first major smog alert of winter", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "shanxi", "sentiment": "none"}, {"name": "shandong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "tianjin", "sentiment": "none"}, {"name": "hebei", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "ministry of environmental protection", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 2:01 AM / in 10 hours China's capital issues first major smog alert of winter Reuters Staff 4 Min Read \nBEIJING (Reuters) - Beijing issued its first major smog alert of the winter for the capital, triggering stringent measures to curb output of heavy industry as plunging temperatures spurred heating demand and the government launched another round of environmental inspections. \nThe orange alert issued late on Thursday, the second-highest on China’s four-level system, comes after Beijing was reported to have made big improvements in air quality last year as industrial activity shifted away from the capital. \nThe Ministry of Environmental Protection (MEP) warned in a statement that heavy air pollution would envelope Beijing, Tianjin, Hebei and the surrounding area from Friday until Jan. 17. \nUnder an orange alert, factories that make furniture, cement and other heavy industry must limit output by between 30 and 50 percent. A list of companies in the capital affected contains more than 700 enterprises. \nAccording to the forecast, southern areas of Beijing, Tianjin, Hebei, southern Shanxi, western Shandong, northern Hebei will suffer from toxic air from Jan. 13 to Jan. 15. On Jan. 15, air pollution is expected to surge above the level that is nominally rated the maximum on the government’s scale, the MEP said. \nThat would mean concentrations of small, breathable particles known as PM2.5 exceeding 250 micrograms per cubic meter, it said. The average concentration across the north in the final three months of 2017 was 71 micrograms. \nSome 130 inspection teams will be sent out to make sure all emergency measures are strictly enforced, according to the MEP. \nBy noon on Friday, a total of 37 cities across northern China had issued pollution alerts - 30 orange alerts and 7 third-level yellow alerts. \nIn one example, the city of Tangshan, China’s steelmaking hub, issued an orange level air pollution alert on Friday morning effective until midnight on Jan. 17. It was its eighth such alert since mid-November. \nMore cities, including Qingdao and Rizhao, were ordered by provincial government to pay “close attention” to air quality and be prepared to issue emergency alerts when pollution arrives, according to statements put out by local authorities. CRANK UP THE HEAT \nThe capital has been largely spared the notoriously bad air that typically blankets the north during the colder winter months when people crank up the heat in their homes in part to the government’s stringent anti-smog measures, including curbing factory output and banning coal burning in homes. \nBut this alert comes a month after the government was forced to reverse its ban on coal for heating as gas shortages left people freezing and after a prolonged bout of freezing weather across the north. \nThe city issued an orange alert in early November before the winter heating season started on Nov. 15. \nOn Wednesday, the government said all 28 Chinese cities in a demanding winter anti-smog campaign met their air quality targets from October to December. \nHowever, in a separate statement late on Thursday the MEP warned of “unfavorable weather conditions” for air quality -warmer temperatures and weak winds - in January and February, keeping up pressure on local authorities to meet the politically important air quality targets. \nThe 28 northern cities were ordered to cut concentrations of PM2.5 by 10-25 percent during October 2017-March 2018. They have been curbing industrial output, thinning traffic and cracking down on coal use in a bid to limit smog build-ups. \n(For a graphic on pollution in Beijing, click bit.ly/2DqdyhK ) Reporting by Josephine Mason, Muyu Xu and Beijing News Monitoring; Editing by Richard Pullin, Kenneth Maxwell and Joseph Radford", "external_links": [], "published": "2018-01-12T03:57:00.000+02:00", "crawled": "2018-01-12T04:20:55.005+02:00", "highlightTitle": ""}