{"organizations": [], "uuid": "5a3485140ca9f6f45713ab32fb4f38b49a180990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-amexs-chenault-on-his-legacy-diversity-joining-facebook.html", "country": "US", "domain_rank": 767, "title": "AmEx's Chenault on his legacy, diversity, joining Facebook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:10:00.000+02:00", "replies_count": 0, "uuid": "5a3485140ca9f6f45713ab32fb4f38b49a180990"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-amexs-chenault-on-his-legacy-diversity-joining-facebook.html", "ord_in_thread": 0, "title": "AmEx's Chenault on his legacy, diversity, joining Facebook", "locations": [], "entities": {"persons": [{"name": "kenneth chenault", "sentiment": "negative"}, {"name": "chenault", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "amex", "sentiment": "negative"}, {"name": "american express", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) — Kenneth Chenault, the chairman and CEO of American Express, is retiring at the end of January after a 17-year run as the head of one of the nation's most well-known brands.\nChenault recently sat down with The Associated Press for his last interview before his retirement. He discussed key moments at AmEx, his legacy and what comes next. Here are excerpts from that interview, which have been edited for length and clarity.\nAP: What do you see as your legacy at the company?\nChenault: This is something I've always felt but, over the last 10 years, has come in to more stark relief. You can generate good company performance over a two-year period or a five-year period. You can go through positive cycles; you can go through down cycles. But what really matters is: How does a company perform over the long term?\nI believe that we've created a culture that will endure. And, for me, my most important legacy is not just the achievements over the last 37 years, but how this company will perform 5, 10, 15, 20 years from now.\nAP: What do you make of the fact your competitors often hire former American Express executives to run their own credit card businesses?\nChenault: What you hear from (people who left) is, 'I haven't been able to replicate the experience that I've had at American Express.' The problem is, they don't have our business model. They don't have an integrated payment platform and what they don't have, from a culture standpoint, is 168 years of this service ethic and this mission.\nWhile we have populated the industry, what people have not been able to export is the uniqueness of our brand which gives us a major advantage. And very importantly, the fact that we have an integrated diversified business model and that's given us a major advantage.\nAP: Did you ever want to work somewhere other than American Express?\nGrowing up, I had no interest in business. I wanted to be a leader. I wanted to make a meaningful difference in people's lives. I grew up in the height of the Civil Rights Movement. I saw myself more in the social/political sector. There was no game plan or roadmap that I developed that I would go into business.\nI can honestly say that I was approached prior to becoming CEO during my tenure as CEO by larger companies. Some people would say, \"Boy, that's a great opportunity,\" but when I thought about the alignment of my personal values with the values of American Express, it wasn't even a question of whether I would stay there. I never seriously considered any other place or any other opportunity.\nAP: Your departure reduces the number of African American CEOs at Fortune 500 companies to three. What legacy would you talk about tied to that role you play in society, and also in business?\nChenault: Here's what's very important and I think I've been very clear is, that's embarrassing. It's embarrassing because there are thousands of people who are just as qualified or more qualified than I am who deserve the opportunity, but haven't been given the opportunity. People overcomplicate this issue. One is you need a pipeline of people coming in. You need to create an environment where people are embraced and engaged rather than just tolerated.\nYou need to, in fact, develop people strategies just as you do for business strategies. And you need to put metrics in place, and hold people accountable for making progress. And I must admit, I was encouraged the first few years that I was CEO because we saw an emergence (of more minority CEOs). You started to see some movement. And that has slowed down.\nCompany boards and management have to say: 'diversity and inclusion is a core priority. And it's not a flavor of the month. It's not something we're just going to try for a year or two. We're going to keep at it until we get it right.' And I think we need that level of intensity and focus.\nAP: You're joining the board of Facebook. What do you hope to bring to the company?\nChenault: I've known Mark (Zuckerberg) for at least eight years. And one of the things that I've talked to Mark about, and I believe he's fully committed to, is to build something that's enduring, that's going to make a meaningful difference in people's lives and a meaningful difference in our society.\nI think that Mark recognizes Facebook's importance of developing communities, but also understands the responsibilities. One of the things that excited me about the Facebook opportunity is the ability to help him achieve that vision.", "external_links": [], "published": "2018-01-29T17:10:00.000+02:00", "crawled": "2018-01-30T02:53:31.011+02:00", "highlightTitle": ""}