{"organizations": [], "uuid": "83ab97f02db91c5bceb9c69a09a4264721482c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943990-GettyImages-903660536.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/18/immigration-policy-tech-giants-call-on-trump-to-preserve-spouse-visas.html", "country": "US", "domain_rank": 767, "title": "Immigration policy: Tech giants call on Trump to preserve spouse visas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:36:00.000+02:00", "replies_count": 0, "uuid": "83ab97f02db91c5bceb9c69a09a4264721482c38"}, "author": "Tony Romm", "url": "https://www.cnbc.com/2018/01/18/immigration-policy-tech-giants-call-on-trump-to-preserve-spouse-visas.html", "ord_in_thread": 0, "title": "Immigration policy: Tech giants call on Trump to preserve spouse visas", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "negative"}, {"name": "information technology industry council", "sentiment": "none"}, {"name": "technet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A broad coalition of businesses including Apple , Facebook , Google and Microsoft urged the Trump administration on Thursday to preserve a program that allows the spouses of some high-skilled immigrants to work in the United States.\nTo these tech giants and their peers, the looming end to such spousal work permits could cause immense trouble for their foreign workers and their families — while prompting many talented scientists, coders and engineers to reconsider working for U.S. companies at all.\n\"We represent employers who are committed to growing the U.S. economy and creating jobs for American workers. However, we cannot achieve these goals unless companies can recruit and retain the most qualified employees,\" wrote a slew of companies, all speaking through their Washington, D.C.-based lobbying groups, including the Information Technology Industry Council.\nOther backers included the U.S. Chamber, TechNet and Fwd.us, the immigration reform advocacy campaign backed by Facebook CEO Mark Zuckerberg.\nUnder President Barack Obama, the U.S. government in 2015 began granting work authorizations to spouses of high-skilled immigrants who are in the process of seeking lawful permanent resident status. Before his administration introduced those rules, these spouses — legally here under another visa program, and mostly women — could not obtain employment.\nMonths after taking office, however, the Trump administration suggested in court filings that it sought to reevaluate the program as part of its broader crackdown on legal immigration. And it appeared to formalize those plans in November, when the Department of Homeland Security said in a statement of its policy priorities that it would soon \"propose to rescind\" its rules.\nAs a result, a full spectrum of top companies — many in tech, which employ high-skilled immigrants whose spouses may benefit from the program — have started to speak out. In the Thursday letter, ITI, the U.S. Chamber and other organizations stressed that spouses are \"eager to work in order to support their families, contribute to their communities by paying taxes, and utilize their skills to help the U.S. economy grow.\"\nMore from Recode: \nInterviewing President Trump is 'meaningless,' NYU's Jay Rosen says Now you can use all that startup stock to get a bank to loan you money SurveyMonkey is expected to go public later this year In the process, the companies' trade groups said the work authorizations have \"limited unnecessary disruptions to businesses by ameliorating economic and personal hardships . . . previously faced by many H-1B employees and their families.\" That's largely because of per-country limits on immigration, for example, and a long backlog in applications for green cards.\nAnd they warned that the end of the program might force talented foreigners to reconsider their plans to come to the United States in the first place.\n\"Employers would also face an increased risk that their valued, long-term employees will choose to leave their companies for other employment opportunities in countries that allow these workers and their families to raise their standard of living,\" the business groups continued.\nIt's hardly the first time that the tech industry has pleaded with the Trump administration to rethink its approach to immigration. Companies have squared off with the White House over the future of H-1B visas, for example, and leading Silicon Valley investors have sued the U.S. government for delaying a program meant to benefit early-stage entrepreneurs. \nDuring Trump's first days in office, his executive order restricting travel from Muslim-majority countries drew sharp condemnations — then, formal legal salvos — from Amazon, Facebook and others. And more recently, the tech industry has led broad array of businesses urging Congress to restore DACA . The program, killed by Trump, protects immigrants brought illegally to the United States as children from being deported.", "external_links": [], "published": "2018-01-18T15:36:00.000+02:00", "crawled": "2018-01-18T17:26:13.021+02:00", "highlightTitle": ""}