{"organizations": [], "uuid": "d6dbef373bbf3f959444db8d85d87f59c53af7f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/10/104646712-GettyImages-644017502.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/microsoft-cant-win-for-losing-commentary.html", "country": "US", "domain_rank": 767, "title": "Microsoft 'can't win for losing' COMMENTARY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:24:00.000+02:00", "replies_count": 0, "uuid": "d6dbef373bbf3f959444db8d85d87f59c53af7f7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/microsoft-cant-win-for-losing-commentary.html", "ord_in_thread": 0, "title": "Microsoft 'can't win for losing' COMMENTARY", "locations": [], "entities": {"persons": [{"name": "hal berenson", "sentiment": "negative"}, {"name": "satya nadella", "sentiment": "none"}], "locations": [{"name": "kinect", "sentiment": "none"}], "organizations": [{"name": "microsoft", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This post originally appeared on Hal Berenson's blog on Jan. 6 and is republished here with permission.\nWhen it comes to the consumer, Microsoft 's history can best be described as, \"I got it. I got it. I got it. <THUMP> I ain't got it.\" Jan. 6 was the fourth anniversary of my Xbox: Fail blog post, and last week Microsoft put the final nail in the coffin of Kinect. So it really is an appropriate point to talk about Microsoft and the consumer. Microsoft is not a consumer-focused company, and never will be despite many attempts over the decades. Recognition of this reality, and an end to tilting at windmills, is one of the things that Satya Nadella seems to have brought to the table.\nFirst let's get something out of the way, we need to refine what we mean by the label \"consumer.\" It isn't simply the opposite of business or organizational users. Microsoft has always done just fine in providing individuals with personal productivity and content creation tools. The Windows-based PC remains at the center of any complex activity. Sure I book some flights on my iPhone or iPad. But when I start putting together a complex multi-leg trip the PC becomes my main tool. Office has done well with consumers, and continues to do so in spite of popular free tools from Google . And over the last few years Microsoft has gained traction with the artistic design crowd that had always gravitated towards the Mac. So when we talk about the consumer we really are talking experiences that are left of center on the content consumption to content creation spectrum. Microsoft will always be a strong player on the right of center content creation scale, be it for individuals, families or organizations. But other than console gaming, they aren't going to be a significant player on the left of center experiences. And Microsoft fans are going to go crazy over that.\nThe end of life for Kinect is the perfect illustration of Microsoft's inability to be a consumer player. The Xbox One with (then mandatory) Kinect was introduced a year before the Amazon Fire TV and a year and half before the Amazon Echo. It was originally tasked with becoming the center of home entertainment and offered a voice interface. Go read my Xbox: Fail piece for how it wasn't ready to live up to that design center. It's pretty typical Microsoft V1 stuff. Unfortunately the Xbox One was also V1 from a console gaming perspective, so Microsoft focused on making it more competitive in that niche and abandoned pushing forward on the home entertainment side. Imagine that: Microsoft had a beachhead of tens of millions of voice-enabled devices in place before Amazon even hinted at the Echo, and failed to capitalize on it. You can repeat that story many times over the last 25 years.\nIt isn't that Xbox One was the perfect device for the coming voice assistant, or streaming TV, revolutions. The need to be a great gaming console gave it much too high a price point for non-gamers. But Microsoft could have continued to evolve both the experience and produced lower priced, non-gaming focused hardware. Contrast what Microsoft did with what Amazon did around the Echo. When the Echo was introduced it was considered a curiosity, a niche voice-operated speaker for playing music. When Amazon started to gain traction with the Echo and Alexa, they went all in, and as a result have a strong lead in today's hottest segment of the consumer technology space. It reminded me a lot of Microsoft's pivot to the Internet back in 1995. But in the Xbox One case, Microsoft had the vision (at least in general direction), but failed to capitalize on it. Failed to even make a serious attempt. Now, at best , it could fight it out for a distant fourth or fifth place in voice assistants and home entertainment. This consumer stuff just isn't in Microsoft's DNA.\nThe death of the Groove Music Service is another example, and maybe more telling on why Microsoft hasn't been able to crack the code on the consumer. Groove is just the latest name for Zune's music service. When MP3 players became popular Microsoft jumped on the bandwagon based on its DNA, it relied on third parties that it supplied with technology (e.g., DRM). When that didn't even turn out to be a speed bump on the iPod's adoption, it finally introduced the Zune as a first party device. To have as good an experience as an iPod, the Zune needed an iTunes equivalent and what we now know as the Groove Music Service was born. Despite the jokes that failure often leads to, the Zune was a quite nice device. But since it couldn't play the music you'd acquired with iTunes there really was no iPod to Zune migration path. By the time Zune came on the market the game was already over. As Zune died other consumer-focused device efforts came to the fore (Kin, Windows Phone 7, Xbox One) and the music service lived on. But since the devices never gained traction neither did the music service. And for Microsoft the music service was never a player on its own, it was just a necessary evil to support its consumer device experience. And with that mindset, the failure to gain traction with consumer devices meant Groove was superfluous. Sure Groove could have owned the segments that Spotify and Pandora now dominate, but that was never what Microsoft was going for. And now, it is too late.\nBeing a content creator or distributor is not in Microsoft's DNA. It has an immune system that rejects it time and time again. Microsoft made a big play on consumer titles in the early to mid '90s, remember Microsoft Dogs and Encarta? Offerings like these are very manpower intensive because they need a lot of content production, editing, frequent updating, sell for very little, are expensive to localize, and often don't even make sense globally. So Microsoft concluded they didn't fit well with its business model and backed away from all but a few major titles such as Encarta. While Encarta was great for its time, the Internet left it competing with Wikipedia. That destroyed what little economic value Encarta had. Other content-oriented efforts, such as Slate, were disposed of to save costs when the Internet Bubble burst. The MSNBC joint venture was allowed to dissolve when its contract came up for renewal. And so on.\nI could even say that great end user experiences are not in Microsoft's DNA, though that one is more debatable. Usually it is thought of as being consistently second to Apple. So rather than saying they aren't in Microsoft's DNA, I'd say that Microsoft user experiences are almost always compromised by more dominant aspects of its DNA. And that keeps it from being a great consumer experience company.\nWhat is Microsoft good at? Creating platforms that others build on. Doing work that is technically hard, and takes a lot of engineering effort, that it can sell over and over again. High fixed cost, very low variable cost, very high volume, globally scalable has been its business model all along. Consumer businesses usually have moderate to high variable costs, so there is problem number one. Only the top two players in a segment usually can achieve very high volume, so unless Microsoft achieves leadership early in a segment it never can get high enough volume to have a successful business model. A head-on charge against the established leaders rarely works, and when it does it is a financial bloodbath. So you may not ne", "external_links": [], "published": "2018-01-08T17:24:00.000+02:00", "crawled": "2018-01-08T17:45:08.015+02:00", "highlightTitle": ""}