{"organizations": [], "uuid": "d27a3f40f5b88318e1e15af5b10bfd586ee8f40f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223628370&w=1200&r=LYNXMPEE0J0G8", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-athletes/north-korea-to-send-22-athletes-to-pyeongchang-compete-in-three-sports-idUSKBN1F90IY", "country": "US", "domain_rank": 408, "title": "North Korea to send 22 athletes to Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-20T20:41:00.000+02:00", "replies_count": 0, "uuid": "d27a3f40f5b88318e1e15af5b10bfd586ee8f40f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-athletes/north-korea-to-send-22-athletes-to-pyeongchang-compete-in-three-sports-idUSKBN1F90IY", "ord_in_thread": 0, "title": "North Korea to send 22 athletes to Pyeongchang", "locations": [], "entities": {"persons": [], "locations": [{"name": "pyeongchang lausanne", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "olympic stadium", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "unification ministry", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAUSANNE (Reuters) - North Korea will send 22 athletes to the Winter Games in the neighbouring South next month and compete in three sports and five disciplines, the International Olympic Committee (IOC) said on Saturday.\nNorth Korea’s planned involvement in Pyeongchang is viewed as a sign of easing tensions over its nuclear and missile programme.\nThe North and South had agreed to march under a single flag at the opening ceremony and would field a united team in the women’s ice hockey, The IOC said in a statement that confirmed earlier reports. The North will send 24 officials and 21 media representatives.\nIt said the united Korean delegation would be led into the Olympic Stadium for the opening ceremony under the Korean Unification Flag which would be carried by two athletes, one from each country.\nSeparately, South Korea’s Unification Ministry said North Korea would send a delegation to the country on Sunday to prepare for a trip by an art troupe during the Games, pushing the visit back a day after earlier cancelling it.\nThe North Korean athletes will be handed quota places, a rarely-used form of wild card, to allow them to compete in ice skating, skiing and ice hockey.\nUntil Saturday, a figure skating pair were the only North Koreans to have secured a spot at the Games through the conventional qualifying competition, although they lost their place after failing to register.\nNorth Korea's International Olympic Committee (IOC) member Chang Ung speaks with a journalist before a meeting at the IOC headquarters in Lausanne, Switzerland, January 20, 2018. REUTERS/Pierre Albouy They were therefore handed one quota place while two male North Korean competitors were given places in the short track speed skating.\nThree North Koreans will compete in the cross-country skiing and another three in the Alpine skiing slalom and giant slalom events.\nTwelve players would be added to the existing South Korean women’s ice hockey squad of 23. At least three North Korean players would be selected for each match.\nInternational Olympic Committee (IOC) President Thomas Bach welcomes Jong-Hwan Do, Minister of Culture, Sports and Tourism of the Republic of Korea (ROK) at the IOC headquarters in Lausanne, Switzerland, January 20, 2018. REUTERS/Pierre Albouy ”Today marks the milestone on a long journey,“ said IOC president Thomas Bach in a prepared declaration. ”Since 2014, the IOC has addressed the special situation of having the Olympic Winter Games on the Korean peninsula.\n“Such an agreement would have seemed impossible only a few weeks ago,” he added. “The Olympic Winter Games are hopefully opening the door to a brighter future on the Korean peninsula.”\nThe IOC said it would provide any necessary equipment for the athletes.\nNorth Korea’s participation in the Olympics has been seen as a win for South Korea president Moon Jae-in, who hopes to use the event to make a diplomatic breakthrough in the standoff over North Korea’s nuclear and missile programme.\nHowever, the decision to field a unified ice hockey team has sparked a sharp backlash in the South, including from younger South Koreans upset that an unchastened North Korea is taking the spotlight.\nWriting by Brian Homewood; Editing by John O'Brien and John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T20:41:00.000+02:00", "crawled": "2018-01-20T16:07:03.017+02:00", "highlightTitle": ""}