{"organizations": [], "uuid": "9cfa2406a6d84ee6b1cb61ed257db81fb84c4713", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104960197-GettyImages-908757404.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/davos-2018-here-are-the-most-memorable-wef-quotes.html", "country": "US", "domain_rank": 767, "title": "Davos 2018: Here are the most memorable WEF quotes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-26T16:52:00.000+02:00", "replies_count": 0, "uuid": "9cfa2406a6d84ee6b1cb61ed257db81fb84c4713"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/26/davos-2018-here-are-the-most-memorable-wef-quotes.html", "ord_in_thread": 0, "title": "Davos 2018: Here are the most memorable WEF quotes", "locations": [], "entities": {"persons": [{"name": "silvia amaro", "sentiment": "negative"}, {"name": "simon dawson", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin  mnuchin", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "carlos barria", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "wef", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who said what at Davos 2018 Simon Dawson | Bloomberg | Getty Images Silvia Amaro | @Silvia_Amaro 48 Mins Ago \nFrom comments on global trade, the depreciation of the dollar and women's rights, the World Economic Forum has made headlines once again. \nCNBC takes a look at the most memorable quotes over the past few days from the snowy Swiss Alpine resort of Davos. Donald Trump \nPresident Donald Trump 's speech was the most widely-anticipated moment at this year's event. It was the first time since Bill Clinton in 2000 that a sitting U.S. leader has joined the Davos elite. \nHe told the audience: \"We cannot have free and open trade if some countries exploit the system at the expense of others.\" \nEarlier in the week, Trump told CNBC that \"the dollar is going to get stronger and stronger, and ultimately I want to see a strong dollar.\" A sharp weakening for the greenback on Wednesday was one of the main discussion topics at Davos, following comments from U.S. Treasury Secretary Steven Mnuchin. Carlos Barria | Reuters Steven Mnuchin \nMnuchin sparked fluctuations in currency markets when saying that a weaker dollar is good for the U.S. During a CNBC panel on Thursday , the U.S. treasury secretary said that dollar weakness in the short term was \"not a concern of mine.\" \nHe added: \"In the longer term, we fundamentally believe in the strength of the dollar.\" Jason Alden | Bloomberg | Getty Images Emmanuel Macron \nPraised by many in the business community, French President Emmanuel Macron vowed to reform France and Europe with a medium-term strategy, in order to provide clarity to investors. \n\"Let us not be naive, globalization is going through a major crisis and this challenge needs to be collectively fought by states and civil society in order to find and implement global solutions,\" Macron said during his keynote speech. FABRICE COFFRINI | AFP | Getty Images Angela Merkel \nGermany is currently going through a political impasse — something that Europe wants to see fixed very soon in order for it to move forward with more integration. \nSpeaking at Davos, German Chancellor Angela Merkel admitted that Germany has problems of its own . \n\"Frankly speaking, the country I have the honor to represent and where I am chancellor has difficulties. And polarization is something that we see in our country as well, which we haven't had for decades,\" she said. Jason Alden | Bloomberg | Getty Images Narendra Modi \nIndian Prime Minister Narendra Modi spoke about a \"worrying trend\" against globalization and towards isolationism. \n\"Forces of protectionism are raising their heads against globalization, their intention is not only to avoid globalization themselves but they also want to reverse its natural flow,\" he said. Fabrice Coffrini | AFP | Getty Images George Soros \nBillionaire investor George Soros believes that the U.S. is on course for a nuclear war with North Korea. \n\"The fact of nuclear war is so horrendous that we are trying to ignore it, but it is real,\" Soros said during a speech on the outskirts of the World Economic Forum. \n\"Indeed, the United States is set on a course towards nuclear war by refusing to accept that (North) Korea has become a nuclear power.\" Jason Alden | Bloomberg | Getty Images Lloyd Blankfein \nThe policies of the U.S. president were under scrutiny, but not everyone is unhappy with the direction Trump is taking. \n\" I'd say I like a lot more stuff than I don't like , and some of the stuff I don't like I really don't like,\" Lloyd Blankfein, CEO of Goldman Sachs, told CNBC during an interview. \n\"But I don't want to be hypocritical, either. I've really liked what he's done for the economy,\" he added. Michael Nagle | Bloomberg | Getty Images Malala Yousafzai \nThe youngest Nobel Prize laureate and activist for education told the World Economic Forum that the only way to ensure women's rights is by educating young boys. \n\"The education of young boys on the subject of women's rights is crucial. When we talk about feminism and women's rights, we are talking to men. We have to teach young boys how to be men,\" Malala Yousafzai said at Davos. Patrick Hertzog | AFP | Getty Images Christine Lagarde \n\"Even without testosterone, we can produce positive, constructive energy,\" the Managing Director of the International Monetary Fund Christine Lagarde said in Davos. \nLagarde was one of seven female co-chairs at this year's forum, drawing attention for women's rights, including equality in the workplace. Denis Balibouse | Reuters Ruth Porat \nRuth Porat, the chief financial officer of Alphabet, had one clear message to business leaders : listen to your employees. \n\"There's one thing we do at Alphabet, at Google, that I would encourage every company in every industry to do and it's our all-company meeting — where everyone is encouraged to ask any question and they do,\" Porat said. Adam Galica | CNBC", "external_links": [], "published": "2018-01-26T16:52:00.000+02:00", "crawled": "2018-01-26T16:52:04.036+02:00", "highlightTitle": ""}