{"organizations": [], "uuid": "b7531f5f66dd2452db6ac9a6c37908954d84915f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-a3-announces-new-hires-and-promotions.html", "country": "US", "domain_rank": 767, "title": "A3 Announces New Hires and Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "b7531f5f66dd2452db6ac9a6c37908954d84915f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-a3-announces-new-hires-and-promotions.html", "ord_in_thread": 0, "title": "A3 Announces New Hires and Promotions", "locations": [], "entities": {"persons": [{"name": "strategi", "sentiment": "negative"}, {"name": "robert huschka", "sentiment": "negative"}, {"name": "ann arbor", "sentiment": "none"}, {"name": "rachel kristensen", "sentiment": "none"}, {"name": "alex shikany", "sentiment": "none"}, {"name": "bob doyle", "sentiment": "none"}, {"name": "huschka", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "detroit free press", "sentiment": "negative"}, {"name": "ria & a3 mexico", "sentiment": "none"}, {"name": "association for advancing automation", "sentiment": "none"}, {"name": "aia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Detroit Free Press Executive Editor Robert Huschka Joins A3 as Director of Education Strategies\nANN ARBOR, Mich.--(BUSINESS WIRE)-- The Association for Advancing Automation (A3), the leading global advocate for the benefits of automating, has hired Robert Huschka as its director of education strategies, a new position within the organization. The association also announced the hiring of Rachel Kristensen in a new sales manager position, along with the promotions of Bob Doyle and Alex Shikany to vice president – RIA & A3 Mexico, and vice president – AIA, respectively.\nRobert Huschka – Director of Education Strategies\nWith more than 25 years in journalism and proven leadership in audience growth, community building, and content strategy, Huschka brings expertise in communicating new, and often complex ideas to vast audiences. An expert at nurturing close-knit teams in a high-pressure, disrupted industry, Huschka spent 18 years in a variety of leadership roles at the Detroit Free Press. Most recently, he led the Free Press’ newsroom as its executive editor.\nHuschka will lead the development of A3’s educational programs and goals. He’ll identify technology trends to integrate into A3’s offerings, while building a network of industry experts and education leaders.\n“As the leading automation trade group, we are proud that A3 members not only have come to rely on us for events and networking opportunities, but also to engage with us to learn about business opportunities, trends and new technologies,” said Jeff Burnstein, president of A3. “These activities are key to the success of our member companies, which makes it essential that the right person lead our educational programs. Robert’s expertise in creating training programs, his focus on audience growth, and his proven track record in creating, growing, and managing new events makes him the perfect director of education strategies for A3.”\n“As someone who has covered manufacturing in Michigan for many years, I have always been impressed by how A3 engages its members – through events, white papers, research reports, and networking meetings,” Huschka said. “I’m excited to join a team that plays such a key role in an industry experiencing amazing growth.”\nRachel Kristensen – Sales Manager\nTo sustain A3’s growth, a new sales manager position was created and filled by Rachel Kristensen. She has worked in higher education for fourteen years and brings with her experience gained at both Henry Ford College and Ferris State University. Most recently, Rachel worked as a Recruitment Specialist, forging partnerships with area high schools, universities and community organizations to increase overall enrollment. Some of her previous roles include Academic Advisor; Coordinator, Southeast Michigan Programs; Program Manager; and Enrollment Services Manager.\nBob Doyle – Vice President - RIA & A3 Mexico\nBob Doyle joined A3 in 2013 as director of communications, taking responsibility for all comprehensive communications efforts for A3 along with helping to launch the A3 brand. Doyle’s role has evolved to running the day to day operations of the Robotic Industries Association (RIA), leading to his promotion to vice president. He also played a lead role in launching the association’s A3 Mexico operations.\nAlex Shikany – Vice President - AIA\nJoining A3 in 2012 as director of market analysis, Alex Shikany researches and reports statistics for the global robotics, machine vision, and motion control markets for A3. Shikany’s role has progressed to managing the day to day operations of AIA, and now takes responsibility for the association as vice president. Shikany also develops market opportunity studies and white papers for the automation industry on key issues such as the impact of robots on employment, and the emergence of collaborative robotics.\n“A3 is now 21 staff members strong, serving the needs of our member companies located across the U.S., North America and around the world,” stated Burnstein. “We’re happy to welcome Robert and Rachel, and promote Bob and Alex into their expanded roles. This is an exciting time for A3. As the membership of our associations grows and the services we provide expand, our staff and capabilities must grow in order to continue supporting the industries we represent.”\nAbout Association for Advancing Automation (A3)\nThe Association for Advancing Automation is the global advocate for the benefits of automating. A3 promotes automation technologies and ideas that transform the way business is done. A3 is the umbrella group for Robotic Industries Association (RIA), AIA - Advancing Vision + Imaging, and Motion Control & Motor Association (MCMA), and A3 Mexico. RIA, AIA, MCMA and A3 Mexico combined represent over 1,070 automation manufacturers, component suppliers, system integrators, end users, research groups, and consulting firms from throughout the world that drive automation forward. For more information, visit: A3 www.A3automate.org . RIA www.robotics.org . AIA www.visiononline.org . MCMA www.motioncontrolonline.org . A3 Mexico https://www.a3mexico.com.mx/ .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005207/en/\nAssociation for Advancing Automation\nBob Doyle\n(734) 994-6088\nbdoyle@a3automate.org\nSource: Association for Advancing Automation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.motioncontrolonline.org&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=www.motioncontrolonline.org&index=5&md5=2745dfa2341b0438fbe0293123ed7158", "https://www.a3mexico.com.mx/", "http://www.businesswire.com/news/home/20180110005207/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.a3mexico.com.mx%2F&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=https%3A%2F%2Fwww.a3mexico.com.mx%2F&index=6&md5=05a652585ee196366258b57070f1d141", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.a3automate.org&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=Association+for+Advancing+Automation&index=1&md5=64f3ad7c6f280cec4dc88730ee9206aa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.visiononline.org&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=www.visiononline.org&index=4&md5=137dcd47b92b2df18d3a4b98d80280a5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.A3automate.org&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=www.A3automate.org&index=2&md5=9da0f3c18be333ff68e362e2065d3a5b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.robotics.org&esheet=51740351&newsitemid=20180110005207&lan=en-US&anchor=www.robotics.org&index=3&md5=b5aceeec465202d785243314baf50c22"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:48:01.026+02:00", "highlightTitle": ""}