{"organizations": [], "uuid": "07be604c07c4d132d2fadc8b31472d96273c68e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-angiodynamics-reports-fiscal-2018-second-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "AngioDynamics Reports Fiscal 2018 Second Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "07be604c07c4d132d2fadc8b31472d96273c68e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-angiodynamics-reports-fiscal-2018-second-quarter-financial-results.html", "ord_in_thread": 0, "title": "AngioDynamics Reports Fiscal 2018 Second Quarter Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "angiodynamics", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fiscal 2018 Second Quarter Highlights\nNet sales of $86.7 million, a decrease of 2.6% year over year U.S. GAAP EPS of $0.01; Adjusted EPS of $0.16 per share Operating cash flow of $10.2 million; free cash flow of $9.4 million\nLATHAM, N.Y.--(BUSINESS WIRE)-- AngioDynamics, Inc. (NASDAQ:ANGO), a leading provider of innovative, minimally invasive medical devices for vascular access, peripheral vascular disease, surgery and oncology, today announced financial results for the second quarter of fiscal year 2018, which ended November 30, 2017.\n“Our top-line performance during the quarter did not meet our expectations and resulted in a reduction to our full-year net sales and free cash flow guidance. While we continue to improve our operating efficiencies and generate significant cash flow, we recognize that revenue growth is key to accomplishing our strategic goals. Our focus on financial discipline and building a high-quality capital structure will allow us to continue making investments in our innovative product portfolio while also pursuing strategic acquisitions, both of which will ensure that we meet our longer-term revenue and strategic expectations,” commented Jim Clemmer, President and Chief Executive Officer of AngioDynamics, Inc.\nSecond Quarter 2018 Financial Results\nNet sales for the second quarter of fiscal 2018 were $86.7 million, a decrease of 2.6%, compared to $89.0 million a year ago, primarily related to declines in the Venous Insufficiency and Core businesses, as well as declines across the majority of the Company’s Vascular Access non-BioFlo products. During the same period of fiscal year 2017, the Company reported a $1.0 million increase in sales attributable to inventory build by its customers for these Angiographic Catheter products as a result of a previously disclosed recall by a competitor. Currency did not have a significant impact on the Company’s sales in the quarter.\nPeripheral Vascular net sales in the second quarter of fiscal 2018 were $51.4 million, a decrease of 4.3% from $53.7 million a year ago, as growth in the Fluid and Thrombus Management product lines was offset by declines in the Venous Insufficiency and Angiographic Catheter businesses, as well as the continued winding down of the Company’s supply agreement with Boston Scientific Corporation. Vascular Access net sales were $22.6 million, a decrease of 4.2% from $23.6 million a year ago, as growth in BioFlo related products was more than offset by declines in the remainder of the product lines. Oncology/Surgery net sales were $12.8 million, an increase of 8.4% from $11.8 million a year ago, driven primarily by incremental sales of the recently launched Solero Microwave Tissue Ablation System.\nU.S. net sales in the second quarter of fiscal 2018 were $68.3 million, a decrease of 4.4% from $71.4 million a year ago, primarily due to declines in the Venous, Core, and PICCs businesses, partially offset by growth in the Oncology/Surgery portfolio. International net sales in the second quarter of fiscal 2018 were $18.4 million, an increase of 4.6% from $17.6 million a year ago, due to robust sales within the Oncology/Surgery business across several key markets.\nGross margin for the second quarter of fiscal 2018 declined 130 basis points to 49.3% from 50.6% a year ago, primarily driven by an inventory write-off related to VOLTA, the Company’s radio frequency ablation product previously sold in Japan. Excluding this inventory write-off, gross margin would have been 51.2%, an increase of 60 basis points year over year.\nThe Company recorded net income of approximately $0.3 million, or $0.01 per share, in the second quarter of fiscal 2018. This compares to net income of $13.7 million, or $0.37 per share, a year ago, which included adjustments to contingent liabilities from revised sales projections, resulting in a gain of $16.5 million as well as operational improvements, partially offset by a decision to discontinue investments in both EmboMedics and the Company’s TiLo product equaling $5.6 million.\nExcluding the items shown in the non-GAAP reconciliation table below, adjusted net income for the second quarter of fiscal 2018 was $5.8 million, or $0.16 per share, compared to adjusted net income of $6.9 million, or $0.19 per share, in the second quarter of fiscal 2017.\nAdjusted EBITDAS in the second quarter of fiscal 2018, excluding the items shown in the reconciliation table below, was $13.3 million, compared to $15.2 million in the second quarter of fiscal 2017.\nIn the second quarter of fiscal 2018, the Company generated $10.2 million in operating cash flow and $9.4 million in free cash flow. As of November 30, 2017, the Company had $51.1 million in cash and cash equivalents and $95.0 million in debt, excluding the impact of deferred financing costs.\nSix Months Financial Results\nFor the six months ended November 30, 2017, net sales were $172.1 million, a decrease of 2.8%, compared to $177.1 million for the same period a year ago. The Company's net income was $0.2 million, or $0.01 per share, compared to net income of $15.0 million, or $0.41 per share, a year ago. Excluding the items shown in the non-GAAP reconciliation table below, adjusted net income for the six months ended November 30, 2017 was $10.4 million, or $0.28 per share, compared to an adjusted net income of $13.3 million, or $0.36 per share, a year ago. Adjusted EBITDAS, excluding the items shown in the reconciliation table below, was $24.6 million, compared to $29.5 million for the same period a year ago.\nFiscal Year 2018 Financial Guidance\nBased on year-to-date business trends, the Company is reducing its previously announced net sales and free cash flow guidance. The Company now expects its fiscal year 2018 net sales in the range of $345 to $350 million, compared to the previous range of $352 to $359 million, and free cash flow in the range of $30 to $35 million down from greater than $35 million, excluding the potential cash payment related to the previously disclosed legal matters for the Department of Justice subpoenas. The Company reaffirms its previously issued adjusted earnings per share guidance range of $0.64 to $0.68, excluding any impact from the recently enacted 2017 Tax Reform Act.\nConference Call\nThe Company’s management will host a conference call today at 8:00 a.m. ET to discuss its second quarter 2018 results.\nTo participate in the conference call, dial 877-407-0784 (domestic) or 201-689-8560 (international) and refer to the passcode 13674426.\nThis conference call will also be webcast and can be accessed from the “Investors” section of the Company’s website at www.angiodynamics.com . The webcast replay of the call will be available at the same site approximately one hour after the end of the call.\nA recording of the call will also be available from 11:00 a.m. ET on Thursday, January 4, 2018, until 11:59 p.m. ET on Thursday, January 11, 2018. To hear this recording, dial 844-512-2921 (domestic) or 412-317-6671 (international) and enter the passcode 13674426.\nUse of Non-GAAP Measures\nManagement uses non-GAAP measur", "external_links": ["http://www.businesswire.com/news/home/20180104005376/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.angiodynamics.com&esheet=51737642&newsitemid=20180104005376&lan=en-US&anchor=www.angiodynamics.com&index=2&md5=7e72aa434a7f8037f93aadf010cfc18e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.angiodynamics.com&esheet=51737642&newsitemid=20180104005376&lan=en-US&anchor=www.angiodynamics.com&index=1&md5=c755aa4bb7333724b424c238ff412f9d"], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T17:13:30.017+02:00", "highlightTitle": ""}