{"organizations": [], "uuid": "f05dfbd0e5dd4d4ae0c5973d4ed00ebe8f9a0e9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-stocks-set-for-fifth-week-of-gains-idUSL8N1P726W", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Emerging stocks set for fifth week of gains", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.922, "site_type": "news", "published": "2018-01-12T18:26:00.000+02:00", "replies_count": 0, "uuid": "f05dfbd0e5dd4d4ae0c5973d4ed00ebe8f9a0e9a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-stocks-set-for-fifth-week-of-gains-idUSL8N1P726W", "ord_in_thread": 0, "title": "EMERGING MARKETS-Emerging stocks set for fifth week of gains", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "anc", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 12 (Reuters) - Emerging market stocks surged almost one percent on Friday and were set for a fifth straight week of gains after a mid-week spike in U.S. Treasury yields abated and oil prices held near 3-year highs.\nMSCI’s emerging equity index rose 0.8 percent back to recent 6-1/2 year highs after a strong showing in Asia where Hong Kong hit new 10-year highs and India surged to a new record.\nMainland Chinese stocks posted their 11th straight day of gains, shrugging off softer trade data.\nIn emerging Europe, Russian stocks hovered just off one-year peaks as Brent crude prices retreated from the $70-per-barrel mark .\nEmerging currencies also broadly firmed against the dollar which pulled back against a basket of currencies, including Brazil’s real which shrugged off an S&P downgrade to the already junk rating.\nThe Turkish lira rose half a percent to the dollar while the Polish and Hungarian currencies surged almost one percent . The rouble and rand rose around 0.2 percent, the latter pressured by the ruling ANC party’s decision this week not to launch proceedings against President Jacob Zuma .\nJPMorgan’s ELMI Plus currency index closed Thursday near three-year highs hit last week, reversing mid-week falls.\nInvestors mostly remain persuaded the market has further to rise, with analysts at ING noting Thursday’s soft U.S. inflation data and expectations of robust retail sales.\n“Such a mix of strong growth and subdued inflation should bode well for emerging currencies, particularly in the context of the somewhat cooling fears about the bond market sell-off,” ING Bank analysts said.\nThey were referring to the rise in U.S Treasury yields, while Bund yields are at 5-1/2-month highs. That briefly knocked local emerging debt markets.\n“The U.S. Federal Reserve is acting according to plans, it’s not as if it is behind the curve on inflation and being forced to hike quickly in panic mode. That would be bad for EM but we are not in this situation,” said Raphael Marechal, portfolio manager at Nikko Asset Management.\n“Real yields in emerging markets are quite juicy compared to the U.S.” he added, referring to inflation-adjusted bond yields.\nFor GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see) (reporting by Sujata Rao)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2dZbdP5", "http://tmsnrt.rs/2e7eoml", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:26:00.000+02:00", "crawled": "2018-01-12T12:32:17.013+02:00", "highlightTitle": ""}