{"organizations": [], "uuid": "33ed24bd7c616f680995c61febe72fc438f34224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/volkswagen-emissions-monkey/vw-supervisory-board-members-demand-inquiry-into-diesel-fume-tests-on-monkeys-idUSL8N1PO1ET", "country": "US", "domain_rank": 408, "title": "VW supervisory board members demand inquiry into diesel fume tests on monkeys", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.705, "site_type": "news", "published": "2018-01-29T17:27:00.000+02:00", "replies_count": 0, "uuid": "33ed24bd7c616f680995c61febe72fc438f34224"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/volkswagen-emissions-monkey/vw-supervisory-board-members-demand-inquiry-into-diesel-fume-tests-on-monkeys-idUSL8N1PO1ET", "ord_in_thread": 0, "title": "VW supervisory board members demand inquiry into diesel fume tests on monkeys", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "vw", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "european research group on environment and health", "sentiment": "none"}, {"name": "daimler", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "eugt", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 29 (Reuters) - Members of Volkswagen’s supervisory board have called for an inquiry into tests in which monkeys were exposed to toxic diesel fumes, German media reported on Monday.\nThe New York Times reported on Friday that German carmakers had used the European Research Group on Environment and Health in the Transport Sector, also known as EUGT, to commission the study, which was designed to defend diesel following revelations that the fuel’s exhaust fumes were carcinogenic.\nReuters could not immediately confirm the details of the study and a representative for EUGT, which was dissolved last year, could not be reached for comment.\nEUGT received all of its funding from Volkswagen, Daimler and BMW, the New York Times said. It remains unclear whether the carmakers were aware of monkeys being used in the experiments.\nVolkswagen and fellow German carmakers Daimler and BMW on Saturday denounced the study, which was conducted in 2014. Revelations about the study are the latest aftershock from the Volkswagen emissions-rigging scandal, which are continuing to rock the auto industry.\nBernd Althusmann, a member of Volkswagen’s supervisory board representing the carmaker’s home state of Lower Saxony, said such experiments were “absurd and inexcusable”, German news agency DPA reported on Monday.\nAlthusmann demanded “harsh consequences” for whoever was responsible for the study, DPA Quote: d him as saying.\nBernd Osterloh, Volkswagen’s works council chief, who is also on the carmaker’s board, called for a detailed investigation into the matter, German daily Die Welt said.\nCommissioning such a study involving live animals did not reflect ethical or moral behaviour, Osterloh said.\n“If the people who were responsible at the time are still on board, then personnel consequences must be considered,” he said.\nOn Sunday, German daily Stuttgarter Zeitung reported that EUGT also sponsored scientific studies testing nitrogen dioxide, a gas found in exhaust fumes, on people. (Reporting by Maria Sheahan; editing by Susan Fenton and Alexander Smith)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T17:27:00.000+02:00", "crawled": "2018-01-30T18:44:50.016+02:00", "highlightTitle": ""}