{"organizations": [], "uuid": "fd06862922bfe11f19705f7a357f3bf9dd280724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222448903&w=1200&r=LYNXMPEE0F11R", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-court-silver/u-s-top-court-rejects-former-new-york-lawmaker-silvers-appeal-idUSKBN1F51T9", "country": "US", "domain_rank": 408, "title": "U.S. top court rejects former New York lawmaker Silver's appeal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:07:00.000+02:00", "replies_count": 0, "uuid": "fd06862922bfe11f19705f7a357f3bf9dd280724"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-silver/u-s-top-court-rejects-former-new-york-lawmaker-silvers-appeal-idUSKBN1F51T9", "ord_in_thread": 0, "title": "U.S. top court rejects former New York lawmaker Silver's appeal", "locations": [], "entities": {"persons": [{"name": "silver", "sentiment": "neutral"}, {"name": "sheldon silver", "sentiment": "none"}, {"name": "andrew chung", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}, {"name": "2nd u.s. circuit court of appeals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The U.S. Supreme Court on Tuesday rejected former New York state Assembly Speaker Sheldon Silver’s bid to avoid a retrial on corruption charges after his 2015 conviction was thrown out by a lower court.\nSilver, a Democrat, had appealed a July 2017 lower court ruling that set aside his conviction because of a 2016 Supreme Court precedent but concluded that prosecutors had “sufficient” evidence to prove the extortion, money laundering and honest services fraud counts on which a jury found Silver guilty.\nSilver’s new trial is tentatively set to begin on April 16 in Manhattan federal court.\nProsecutors accused Silver of collecting close to $4 million of illegal fees for awarding state grants to a top cancer researcher, and steering real estate developers to a friend’s law firm and supporting their interests on rent legislation. After being convicted, he was sentenced in 2016 to 12 years in prison.\nFILE PHOTO: Former New York State Assembly Speaker Sheldon Silver arrives at the Manhattan U.S. District Courthouse in New York, NY, U.S., November 23, 2015. REUTERS/Brendan McDermid/File Photo The 2nd U.S. Circuit Court of Appeals in Manhattan ruled that his conviction for collecting the illegal kickbacks could not stand after the Supreme Court in a case involving Republican former Virginia governor Bob McDonnell narrowed the kind of official conduct that can lead to federal corruption charges.\nThe appeals court, however, rejected Silver’s argument that the prosecution failed to prove the seven counts against him. The court sent the case back the trial court.\nFILE PHOTO: Former New York State Assembly Speaker Sheldon Silver exits the Manhattan U.S. District Courthouse in New York City, U.S., May 3, 2016. REUTERS/Andrew Kelly Silver appealed to the Supreme Court, in particular arguing that the appeals court had wrongly said the prosecution did not have to specifically trace criminally derived money that is mixed in an account together with “clean” funds in order to prove money laundering. Silver said appeals courts around the country are divided on this matter.\nSilver, who represented Manhattan’s Lower East Side, was Assembly speaker from 1994 to 2015. Along with Democratic Governor Andrew Cuomo and Republican former New York Senate Majority Leader Dean Skelos, he was one of the “three men in a room” with effective power to dictate New York legislative priorities.\nSkelos’ separate 2016 corruption conviction also was vacated based on the Supreme Court ruling regarding McDonnell.\nReporting by Andrew Chung; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-16T17:07:00.000+02:00", "crawled": "2018-01-16T17:10:05.003+02:00", "highlightTitle": ""}