{"organizations": [], "uuid": "a60eaa3a5385f661d87d43d87c1a14b650fcd926", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220227775&w=1200&r=LYNXMPEE070JI", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-landrights-tech/using-digital-lego-communities-redesign-indias-slums-idUSKBN1EX0T1", "country": "US", "domain_rank": 408, "title": "Using 'digital Lego', communities redesign India's slums", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T18:13:00.000+02:00", "replies_count": 0, "uuid": "a60eaa3a5385f661d87d43d87c1a14b650fcd926"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-landrights-tech/using-digital-lego-communities-redesign-indias-slums-idUSKBN1EX0T1", "ord_in_thread": 0, "title": "Using 'digital Lego', communities redesign India's slums", "locations": [], "entities": {"persons": [{"name": "trupti vaitla", "sentiment": "neutral"}, {"name": "lotu", "sentiment": "none"}, {"name": "vaitla", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "lotus garden", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "united nations habitat", "sentiment": "none"}, {"name": "mumbai environmental social network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - When urban designer Trupti Vaitla asked residents of a Mumbai slum what new features they’d like to see in their dilapidated public space, she was surprised by one popular answer: a patch of grass.\nThe Lotus Garden is the only open area for about 200,000 people who live in cramped and squalid tenements abutting the city’s biggest landfill. The municipal corporation had done little for its upkeep and it was littered with trash.\nThree years ago, Vaitla and her team were tasked with transforming it into a space that people would actually use. They expected residents to suggest elements like lighting, elaborate landscaping and a gym.\nThe team didn’t expect such enthusiasm for a simple lawn.\n“But they were excited to be involved, and for them, a patch of green was really important - a small oasis in their otherwise drab and congested world,” said Vaitla, chief executive of Mumbai Environmental Social Network (MESN).\nVaitla’s team, backed by funding from United Nations Habitat, which promotes sustainable urban development, spent months cleaning up Lotus Garden. They installed lights and water, planted shrubs and grass, and built an open-air gym.\nFrom the very first day, residents including women and children who had earlier avoided the space, swarmed in, Vaitla said.\nThe appetite for areas like the Lotus Garden is not surprising. In Mumbai, with its population of 18 million and counting, soaring real estate prices and relentless construction, public spaces are shrinking.\n“In a crowded slum, these spaces are particularly relevant, as people have nowhere else to go,” said Pontus Westerberg, digital projects officer at UN-Habitat.\n“These spaces also impact on their health, sanitation, safety, access to emergency services.”\nDIGITAL LEGO Encouraged by their success with Lotus Garden, MESN and UN-Habitat collaborated on another space in the nearby Gautam Nagar neighborhood. This time, they decided to use technology to encourage even more community involvement.\nThe team settled on Minecraft, a video game that allows players to build their own worlds using virtual Lego-like pieces.\nFor the past five years, UN Habitat has used Minecraft in its Block by Block program, which aims to encourage some of the poorest communities in the developing world to participate in upgrading their common spaces.\nThe program is a partnership between UN-Habitat, Mojang, the creator of Minecraft, and Microsoft, which owns Mojang.\n“It can be a challenge to mobilize people in slums - especially the youth - who are resigned to their environment and don’t feel a sense of ownership,” said Westerberg by telephone from Kenya’s capital, Nairobi.\nThe traditional approach, using maps and drawings, often draws little interest from residents, he said.\nA view of Lotus Garden, that was redesigned by residents who desired a clean and safe space for their recreational use, one of a handful of projects featuring community involvement in Mumbai. Handout picture courtesy: Mumbai Environmental Social Network “But with an interactive design tool like this - I call it digital Lego - they are so engaged, and that makes the process more democratic,” he told the Thomson Reuters Foundation.\nThe Block by Block program was launched in Kibera, Nairobi’s largest slum. It has since been used in about 50 locations in more than 20 countries including Indonesia, Nigeria and Mexico.\nOnce UN-Habitat selects a site, a Minecraft model of the site is built using photographs, videos, maps and Google Street View, if it is available. UN-Habitat then holds a workshop.\nResidents are put into groups of mixed ages and genders, and given a laptop with the Minecraft model. They learn the game in a matter of minutes or hours, Westerberg said, and everyone pitches in on the redesign.\nThe designs are then discussed with local officials, one design is chosen, and the project is handed over to a local architect to execute.\nNO SWIMMING POOL When Vaitla brought Minecraft to a workshop in Gautam Nagar, participants used it to create plans including better lighting, seating, trees and play areas for children.\nThe slum’s 6,000 residents live in close quarters, among open drains and common spaces strewn with garbage. They were looking for realistic solutions to improve their lives.\n“The designs they came up with were all sensible,” Vaitla recalled. “No one said, ‘We want a swimming pool.'”\nOther organizations are also putting digital tools like Google Earth and smartphones to work for disadvantaged residents of India’s urban areas.\nShelter Associates, a charity that focuses on slum upgrades, is working with residents to create maps of slums that need amenities like sewage lines, or are at risk of eviction because they are on disputed land.\nThis is particularly relevant as the government’s Smart Cities plan risks hastening slum evictions.\nIn the western state of Maharashtra, where Mumbai is located, Shelter Associates has mapped about 500 settlements of more than 200,000 homes, said Executive Director Pratima Joshi.\n“There are so many low-cost technologies that are easy to use, and we train slum residents to use them as a first step towards mobilizing the communities,” she said.\nAs for Lotus Garden, residents continue to take pride in the space they redesigned, said Vaitla.\n“The lawn is a bit scraggly, but still being maintained, as are other amenities,” she said.\n“If you involve the community, they will participate, and they will take better care of these spaces.”\nReporting by Rina Chandran @rinachandran, Editing by Jared Ferrie. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T18:13:00.000+02:00", "crawled": "2018-01-08T14:03:22.003+02:00", "highlightTitle": ""}