{"organizations": [], "uuid": "a4f888ca2cb9de4a8b0daaad0a71145da4720523", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225884595&w=1200&r=LYNXMPEE0Q0TT", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-new-york-followers/new-york-prosecutor-to-investigate-firm-selling-online-followers-idUKKBN1FG0YG", "country": "US", "domain_rank": 408, "title": "New York prosecutor to investigate firm selling online followers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T01:35:00.000+02:00", "replies_count": 0, "uuid": "a4f888ca2cb9de4a8b0daaad0a71145da4720523"}, "author": "", "url": "https://uk.reuters.com/article/uk-new-york-followers/new-york-prosecutor-to-investigate-firm-selling-online-followers-idUKKBN1FG0YG", "ord_in_thread": 0, "title": "New York prosecutor to investigate firm selling online followers", "locations": [], "entities": {"persons": [{"name": "schneiderman", "sentiment": "none"}, {"name": "pinterest", "sentiment": "none"}, {"name": "eric schneiderman", "sentiment": "none"}, {"name": "devumi", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 11:35 PM / Updated 14 hours ago New York prosecutor to investigate firm selling online followers Reuters Staff 2 Min Read \nNEW YORK (Reuters) - New York’s chief prosecutor will investigate a company that, according to a New York Times article published on Saturday, sold millions of fake followers on social media accounts to celebrities and others wanting to goose their online presence. \nEric Schneiderman, the state’s attorney general, said the company, Devumi, would be undermining the internet’s use as a tool for transparency and democracy if, as the Times reported, it was selling so-called bots using identities stolen from real social media users. \n“Impersonation and deception are illegal under New York law,” Schneiderman wrote on Twitter on Saturday. “The growing prevalence of bots means that real voices are too often drowned out in our public conversation. Those who can pay the most for followers can buy their way to apparent influence.” \nDevumi advertises itself on its website as selling online followers for various social media platforms, including Pinterest and YouTube. It promises Twitter users they can buy up to 500,000 additional followers from the company, which describes itself as “committed to the goal of increasing your social media presence and credibility with guaranteed results.” \nThe company, which did not respond to questions on Saturday, told the Times it did not sell fake users or steal real people’s identities. \nThe Times reported that it bought followers from Devumi and said many of them were evidently fake. It interviewed some of the real social media users whose profile pictures and biographical details had apparently been stolen. \nThe Times said famous actors, television presenters and entrepreneurs were among those who bought Devumi followers. \nTwitter is working to stop Devumi and similar companies, it said in a statement on Saturday. “The tactics used by Devumi on our platform and others as described by today’s NYT article violate our policies and are unacceptable to us,” the statement said. Reporting by Jonathan Allen", "external_links": [], "published": "2018-01-28T01:35:00.000+02:00", "crawled": "2018-01-28T02:01:50.012+02:00", "highlightTitle": ""}