{"organizations": [], "uuid": "c3f2d95493c61122a366754becdc0a942be57e48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-leading-labor-and-employment-litigator-jack-schaedel-joins-scali-law-firm-in-los-angeles.html", "country": "US", "domain_rank": 767, "title": "Leading Labor and Employment Litigator Jack Schaedel Joins Scali Law Firm in Los Angeles", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.929, "site_type": "news", "published": "2018-01-02T21:00:00.000+02:00", "replies_count": 0, "uuid": "c3f2d95493c61122a366754becdc0a942be57e48"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-leading-labor-and-employment-litigator-jack-schaedel-joins-scali-law-firm-in-los-angeles.html", "ord_in_thread": 0, "title": "Leading Labor and Employment Litigator Jack Schaedel Joins Scali Law Firm in Los Angeles", "locations": [], "entities": {"persons": [{"name": "jack schaedel", "sentiment": "negative"}, {"name": "scali law", "sentiment": "none"}, {"name": "schaedel", "sentiment": "none"}, {"name": "jennifer woo burns", "sentiment": "none"}, {"name": "christian scali", "sentiment": "none"}, {"name": "scali", "sentiment": "none"}], "locations": [{"name": "los angeles los angeles", "sentiment": "none"}, {"name": "dykema", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "leading labor and employment litigator jack schaedel joins scali law firm", "sentiment": "negative"}, {"name": "scali law firm", "sentiment": "negative"}, {"name": "labor & employment practice group", "sentiment": "none"}, {"name": "u.s. equal employment opportunity commission", "sentiment": "none"}, {"name": "labor and employment law practice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 2, 2018 /PRNewswire/ -- The Scali Law Firm announced today that Jack Schaedel , one of California's leading labor and employment lawyers, has joined the firm as a partner.\nSchaedel moves over from the Los Angeles office of Dykema, where he was a partner and member of the Labor & Employment Practice Group. His experience includes numerous favorable verdicts and dismissals for clients accused of discrimination or harassment, including a million-dollar reverse fee award in favor of a client wrongly accused of sexual harassment by the U.S. Equal Employment Opportunity Commission.\nAt the Scali firm, Schaedel will co-chair the Labor and Employment Law Practice, with partner Jennifer Woo Burns .\n\"Schaedel is a tremendous litigator and trial attorney who gives us a deeper bench of experience and attorneys and helps cement our reputation as the go-to law firm for labor and employment counsel and litigation and other issues facing the automotive industry,\" said Scali Law Firm founder Christian Scali .\n\"I am so pleased for the opportunity to partner with Schaedel, who brings even more depth and leadership to our employment law practice. His strong reputation as an educator and expert resource through employer associations and professional organizations underscores his commitment to assisting and defending employers,\" added Scali Law Firm Labor and Employment Law Practice Co-Chair, Jennifer Woo Burns .\nIn addition to his litigation and trial experience, Schaedel guides clients through the finer points of discrimination and harassment law, wage and hour regulations, family and medical leave, handbook development and enforcement and other issues that may face a client on any given day. He also frequently speaks to employer groups and bar associations on wage-hour law and other employment-related topics. In 2012, he founded the Employment Law section of the Pasadena Bar Association.\n\"This is a huge win for my clients and for the Scali Law Firm's existing clients. The Scali Firm already has a strong employment law team in place that will benefit my clients. And I am thrilled to work with Jennifer Woo Burns, a career auto dealer labor and employment attorney. Her experience as General Counsel for an auto dealership group and California-based Human Resources/Compliance Manager for one of the largest publically held auto dealer groups in the country will be invaluable. At the same time, I look forward to bringing over two decades of experience and leadership to the team and to employers in the auto industry.\"\nSchaedel obtained his J.D. from UCLA School of Law in 1995 and a Bachelor's in Industrial & Labor Relations from Cornell in 1992.\nThe Scali Law Firm's attorneys are thought leaders in the automotive industry, often called upon to provide their opinions on new and trending issues on auto distribution and franchise, F&I, employment and advertising issues. The firm also drafted the CNCDA's 2015 and 2017 Advertising Law Manuals, providing auto dealers with practical guidance on advertising practices.\nFor more information, visit The Scali Law Firm .\nView original content: http://www.prnewswire.com/news-releases/leading-labor-and-employment-litigator-jack-schaedel-joins-scali-law-firm-in-los-angeles-300576275.html\nSOURCE The Scali Law Firm", "external_links": ["http://scalilaw.com/attorneys/jack-schaedel", "http://scalilaw.com/attorneys/jennifer-burns", "http://scalilaw.com/", "http://scalilaw.com/attorneys/christian-scali", "http://www.prnewswire.com/news-releases/leading-labor-and-employment-litigator-jack-schaedel-joins-scali-law-firm-in-los-angeles-300576275.html"], "published": "2018-01-02T21:00:00.000+02:00", "crawled": "2018-01-02T23:42:11.000+02:00", "highlightTitle": ""}