{"organizations": [], "uuid": "888bce77d337b9a039052d97de59aa2c650a8ba5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/08/104888688-GettyImages-875080564.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/dramatic-stock-market-reversal-signals-more-volatility-ahead--.html", "country": "US", "domain_rank": 767, "title": "Dramatic stock market reversal signals more volatility ahead", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.243, "site_type": "news", "published": "2018-01-17T02:06:00.000+02:00", "replies_count": 0, "uuid": "888bce77d337b9a039052d97de59aa2c650a8ba5"}, "author": "Patti Domm", "url": "https://www.cnbc.com/2018/01/16/dramatic-stock-market-reversal-signals-more-volatility-ahead--.html", "ord_in_thread": 0, "title": "Dramatic stock market reversal signals more volatility ahead", "locations": [], "entities": {"persons": [{"name": "jim young", "sentiment": "none"}, {"name": "dan clifton", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "strategas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "chicago board options exchange", "sentiment": "none"}, {"name": "cboe", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After a mostly one-way trade higher for weeks, Tuesdays' dramatic stock market reversal signals the potential for more choppy trading ahead.\nThe Dow rocketed 283 points Tuesday, before erasing those gains and heading down 100 points. It later recovered and closed just 10 points lower at 25,792 after its most volatile day since Dec. 1 and on the first day it traded above 26,000.\nTraders blamed Washington for some of the selling as lawmakers appeared to be having difficulty agreeing to a spending resolution and on reports that former White House advisor Steve Bannon will testify in the Russia investigation.\nBut while the focus was on Washington, traders also looked at the morning market surge Tuesday as another sign that the market was getting too frothy and overbought.\n\"The healthiest thing would be some downward action for the next two or three sessions. Today you did have a somewhat bearish, outside reversal,\" said Scott Redler, partner with T3Live.com, who follows the market's short-term technicals.\nA reversal is when the market opens above a prior high and then closes below a prior low. \"That happened in some sectors like small-caps. ... You can't get too bearish if you're still above the 8- and 21-day moving average,\" Redler said.\nStrategist Laszlo Birinyi on Tuesday said he expects a possible six weeks of consolidation and sideways trade, but he is not bearish on stocks. \"Right now, the market is at the upper end of the trading range. It's 5 percent over its 50-day moving average, and those are areas where the market tends to digest, consolidate, take a breather but not go down,\" he said, as the market gyrated Tuesday.\nSteve Massocca, managing director at Wedbush Securities, said the market has clearly become fatigued after its sharp move higher. The S&P 500 is up 4 percent since the beginning of the year and crossed above 2,800 for the first time Tuesday before closing down 9 at 2,776. \"We've had a pretty significant move. It's quite natural that this would be exhausted at some point. … A potential government shutdown is a handy excuse,\" he said.\nBut a government shutdown Friday is not likely, said Dan Clifton, head of policy research for Strategas.\n\"My overall view on this is they're preparing a temporary stop-gap measure. I just don't think we're going to shut down, but we're trying to buy time until there could be a larger spending package. It was very much companies that were influenced by government spending that were selling off. The market is saying there is some risk of a government shutdown,\" Clifton said.\nMassocca said the market also took the report on Bannon as a negative. \"The stock market loves Donald Trump, so if Trump is going to get in trouble somehow, that's not good for the stock market,\" he said. \"The policies that are being implemented by this administration are incredibly business-friendly, and if that were in danger of changing that would be a problem for the market.\"\nAnalysts expect earnings season to be a positive for the market, and that's where the focus should turn as reports roll out in the next couple of weeks. Not only is the fourth quarter expected to be strong, but analysts anticipate positive comments from companies on how they will be affected by massive tax cuts.\nEarnings season is off to a strong start so far. Of the S&P 500 companies that had reported as of Friday, 69 percent have beaten earnings-per-share estimates while 85 percent have beaten revenue forecasts, according to FactSet.\nBank of America , Goldman Sachs, US Bancorp and Charles Schwab are among the financial companies reporting earnings Wednesday morning. Alcoa and Kinder Morgan also report after the closing bell.\nThere are a number of economic reports Wednesday, including the business leaders survey at 8:30 a.m. ET, industrial production at 9:15 a.m., the NAHB survey at 10 and the Treasury international capital flow data at 4 p.m. The Federal Reserve releases its beige book on the economy at 2 p.m.\nThe market is also keeping an eye on the Bank of Canada, which is expected to raise interest rates Wednesday.\n\"Our call is they hike tomorrow, and that they hike two more times this year,\" said Ben Randol, G-10 currency strategist with Bank of America Merrill Lynch.\nThe U.S. dollar was lower Wednesday, and the dollar index is now down 1.8 percent year to date. Randol said the dollar has been trading on anticipation of other central bank tightening and that it should perk up.\n\"Our call was in the big, broad brush strokes to see a dollar rebound in the first half of the year, and then see that fade as central banks reprice,\" he said. Randol said the repatriation of cash by corporations could increase the demand for dollars and that could pressure the greenback higher.\nWATCH: Stocks to propel the Dow to 27,000 show chapters The stocks to propel the Dow to 27,000 19 Hours Ago | 03:24", "external_links": [], "published": "2018-01-17T02:06:00.000+02:00", "crawled": "2018-01-17T02:15:11.001+02:00", "highlightTitle": ""}