{"organizations": [], "uuid": "c57f968044dbb0e33e769e8c8f75c50526f277e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226585344&w=1200&r=LYNXMPEE0T0PZ", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-autos-selfdriving-nuro/california-start-up-nuro-unveils-autonomous-delivery-van-raises-92-million-idINKBN1FJ1E7", "country": "US", "domain_rank": 408, "title": "California start-up Nuro unveils autonomous delivery van, raises $92 million", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:08:00.000+02:00", "replies_count": 0, "uuid": "c57f968044dbb0e33e769e8c8f75c50526f277e3"}, "author": "", "url": "https://in.reuters.com/article/us-autos-selfdriving-nuro/california-start-up-nuro-unveils-autonomous-delivery-van-raises-92-million-idINKBN1FJ1E7", "ord_in_thread": 0, "title": "California start-up Nuro unveils autonomous delivery van, raises $92 million", "locations": [], "entities": {"persons": [{"name": "nuro", "sentiment": "negative"}, {"name": "dave ferguson", "sentiment": "none"}, {"name": "jiajun zhu", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 11:08 AM / Updated 9 hours ago California start-up Nuro unveils autonomous delivery van, raises $92 million Reuters Staff 3 Min Read \nSAN FRANCISCO (Reuters) - Silicon Valley start-up Nuro said on Tuesday it raised $92 million to launch a self-driving delivery vehicle, joining automakers, shippers and a host of little-known companies developing autonomous vehicles for local commerce. \nThe company, co-founded by two former engineers from Google’s self-driving car project, Dave Ferguson and Jiajun Zhu, opted to bypass the high-profile race for self-driving taxis to focus on goods delivery, which it says is easier to solve and will be quicker to market. \nAt about half the width of a traditional passenger sedan, Nuro’s vehicle, shaped like a tiny minivan, takes up less room on the road than traditional cars. The company says this makes it safer on roads when interacting with pedestrians picking up their purchases. \nCompartments built into its sides can hold about 10 shopping bags and can be configured to accommodate custom inserts such as lockers, heating or cooling elements or even a dry-cleaning rack. \nThe result of 18 months of development, the vehicle will operate in limited service by the end of this year, Ferguson said. The company is currently in talks with both big and small retailers, as well as with potential partners who could build the vehicle. The self-driving delivery vehicle from Silicon Valley startup Nuro, intended to be used for local commerce, is shown in this photo taken in San Francisco, California, U.S., January 24, 2018 and provided January 29, 2018. Courtesy of Nuro/Handout via REUTERS \nSo-called last mile delivery services, which bring goods directly to your door - or at least sidewalk - are also in the crosshairs of established global automakers Ford Motor Co and Toyota Motor Corp as well as shipping companies like DHL [DHL.UL] and startups from Udelv to Starship Technologies. \nThe Series A funding - completed midway through 2017 but not disclosed until Tuesday - was led by private equity firm Banyan Capital and Greylock Partners, a venture firm, Nuro said. \nFerguson said such vehicles could be a “powerful tool” for local businesses such as convenience stores or shoe repair shops to get goods more quickly into the hands of their customers, who now demand even faster service and more convenience. \nAs the vehicles are not intended to be used on freeways, they can use shorter-range radar and lidar sensors than an autonomous vehicle driving at high speeds, Ferguson said. \nMost of the focus thus far in self-driving technology has been on shuttling passengers without a driver, but analysts believe it will be nearly a decade before those autonomous vehicles roll out commercially beyond small-scale tests. Reporting By Alexandria Sage; Editing by Peter Henderson and Cynthia Osterman", "external_links": [], "published": "2018-01-30T13:08:00.000+02:00", "crawled": "2018-01-30T15:25:52.025+02:00", "highlightTitle": ""}