{"organizations": [], "uuid": "adc9008448bc56f1af8d4244a5eebbd61df6db26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/01/104314361-GettyImages-641932726.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/amplify-etfs-ceo-thinks-blockchain-will-transform-investment-leaders.html", "country": "US", "domain_rank": 767, "title": "Amplify ETFs CEO thinks blockchain will transform investment leaders", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-01-17T02:13:00.000+02:00", "replies_count": 0, "uuid": "adc9008448bc56f1af8d4244a5eebbd61df6db26"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/16/amplify-etfs-ceo-thinks-blockchain-will-transform-investment-leaders.html", "ord_in_thread": 0, "title": "Amplify ETFs CEO thinks blockchain will transform investment leaders", "locations": [], "entities": {"persons": [{"name": "christian mago", "sentiment": "negative"}, {"name": "christian magoon", "sentiment": "none"}, {"name": "magoon", "sentiment": "none"}, {"name": "citigro", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "blok", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amplify ETFs CEO thinks blockchain will transform investment leaders Amplify ETFs CEO Christian Magoon believes blockchain will transform those companies that invest in it. He determines which holdings to include in his two blockchain ETFs, by assessing investment and research as leading indicators of who is going to win the race to monetize blockchain. 19 Hours Ago | 04:45 \nAmplify ETFs CEO Christian Magoon thinks investing in blockchain now will bring returns as big as those from today's FAANG companies. He's so confident about the transformative power of the technology, that most of the holdings in Amplify's blockchain ETF aren't really blockchain companies at all. \n\"We think the blockchain technology is going the transform the leaders in investment and research into this technology,\" Magoon said Tuesday on CNBC's \"Fast Money. \"We are trying to skate where the puck is going to be in the future.\" \nAmplify Investments on Wednesday will launch two exchange-traded funds (ETFs) that invest in companies betting on blockchain. Top holdings in the actively managed ETF, BLOK, include Citigroup , Overstock , IBM , Square and Nvidia , among others. \nAlthough these companies are known for much more than their investment in blockchain technology, Magoon believes that may one day change. \n\"We are looking at investment and research as leading indicators of who is going to win that disruptive race, much like investing in the early days of internet technology would have led you to companies like Amazon ,\" he said. \nMagoon isn't ignoring smaller blockchain-forward companies, but he said he would prefer a diversified investment strategy. \n\"We have taken an active approach to adjust the investment strategy and the universe of companies as the industry matures. We think this is a better idea than buying maybe a privately offered security that's working on blockchain or making a bet on one or two companies. \nMagoon also said Amplify is being particularly diligent to avoid the fraudulent pitfalls so prevalent in blockchain and cryptocurrency investment today. \n\"We have qualification standards. And then there is a portfolio management team that is looking at the news, and looking at the company business plan as it relates to blockchain so we don't get caught in those traps,\" Magoon said. \nAmplify will launch its blockchain ETFs Wednesday. Chloe Aiello News Associate for CNBC.com Related Securities", "external_links": [], "published": "2018-01-17T02:13:00.000+02:00", "crawled": "2018-01-17T02:34:32.018+02:00", "highlightTitle": ""}