{"organizations": [], "uuid": "8ef37611d9479806ff2cddb0cc42472feab9aa51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/21/101693058-480270741.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/oil-markets-focus-on-tighter-supplies-healthy-demand.html", "country": "US", "domain_rank": 767, "title": "Oil markets focus on tighter supplies, healthy demand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-17T04:48:00.000+02:00", "replies_count": 0, "uuid": "8ef37611d9479806ff2cddb0cc42472feab9aa51"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/oil-markets-focus-on-tighter-supplies-healthy-demand.html", "ord_in_thread": 0, "title": "Oil markets focus on tighter supplies, healthy demand", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices ended higher on Wednesday ahead of the release of U.S. petroleum data that was expected to show a ninth straight weekly drawdown in crude inventories.\nBrent futures settled 23 cents higher at $69.38 a barrel while U.S. West Texas Intermediate crude gained 24 cents to $63.97 per barrel.\nBoth contracts climbed to their highest levels since December 2014 this week with Brent reaching $70.37 on Monday and WTI up to $64.89 on Tuesday.\nU.S. crude inventories were estimated to have fallen 3.5 million barrels in the week ended Jan. 12, according to a Reuters poll.\nThe American Petroleum Institute (API) report will be released at 4:30 p.m. ET, followed by U.S. Energy Information Administration (EIA) data on Thursday at 11 a.m. ET. Both were delayed by a day due to the U.S. Martin Luther King Jr. Day holiday.\nTighter markets have lifted both crude benchmarks about 13 percent above levels in early December, helped by production curbs by OPEC and Russia, as well as by healthy demand growth. Several analysts this week raised their expectation for 2018 prices on the back of the rally.\nIn a note on Tuesday, Morgan Stanley said it now sees Brent hitting $75 a barrel by the third quarter of 2018, while U.S. crude could hit $70 a barrel. The firm expected flows from hedge funds to keep prices elevated - even though it saw prices retreating later in the year.\nMoney managers have raised bullish positions in WTI and Brent crude futures and options to a record, according to the U.S. Commodity Futures Trading Commission and the Intercontinental Exchange.\nNorbert Ruecker, head of commodity research at Swiss bank Julius Baer, also said that \"hedge fund expectations for further rising prices have reached excessive levels,\" threatening prices.\nThe Organization of the Petroleum Exporting Countries and Russia have been curbing production since January 2017; the cuts are set to last through 2018.\nThe curbs have coincided with strong demand and solid economic growth, tightening the market.\nElsewhere, threats by Nigerian militants on Wednesday to attack offshore oil facilities within days were supportive of prices.\nMarkets may come under pressure from rising U.S. production, analysts say.\nOn Tuesday, the EIA said it expected U.S. oil output to increase in February, with production from shale rising by 111,000 barrels per day (bpd) to 6.55 million bpd.\nU.S. crude output is expected to soon break 10 million bpd, challenging top producers Russia and Saudi Arabia.", "external_links": [], "published": "2018-01-17T04:48:00.000+02:00", "crawled": "2018-01-17T05:11:24.002+02:00", "highlightTitle": ""}