{"organizations": [], "uuid": "cb82e333cffdac00a37f952baa1734bb84b4d4ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-banks-one-thing-not-to-worry-about-idUSL8N1PB58R", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Banks: one thing not to worry about (for now)", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:34:00.000+02:00", "replies_count": 0, "uuid": "cb82e333cffdac00a37f952baa1734bb84b4d4ee"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-banks-one-thing-not-to-worry-about-idUSL8N1PB58R", "ord_in_thread": 0, "title": "LIVE MARKETS-Banks: one thing not to worry about (for now)", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European stocks rise * Cyclicals underperform after rally * UK inflation down from November peak * DAX shrugs off stronger euro Jan 16 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Julien Ponthus. Reach him on Messenger to share your thoughts on market moves: julien.ponthus.thomsonreuters.com@reuters.net BANKS: ONE THING NOT TO WORRY ABOUT (FOR NOW) (1533 GMT) For those investors betting on the \"rotation-to-banks\" trade designed to reap the harvest of monetary normalisation, S&P just issued a reassuring call. The likes of Facebook, Amazon or Apple are not set to \"uberize\" the banking industry, at least not yet, the rating agency wrote. \"In the short term, we don't expect competition from tech titans to have an immediate impact on the banks that we rate,\" it said, arguing that regulation will prevent them to \"compete meaningfully with banks over customer deposits\". So far, no major hurdle seems in the way of European banks. Their index has risen 5.4 percent so far this year, nicely above the 2.5 percent of the STOXX 600. (Julien Ponthus) BREXIT-CHANGE YOUR HEART, LOOK AROUND YOU (1435 GMT) One thing quite clear from the UK inflation data this morning is that any kind of hard forecast, be it for sterling, inflation, rates and by extension the FTSE, is next to impossible without more visibility on Brexit divorce talks. And despite a growing feeling of optimism that can be sensed in the pound, visibility is scarce. After Brexit hardliner Nigel Farage said on Sunday that the 2016 referendum decision risked being overturned, EU leaders have repeated that the UK would be welcomed back into the fold if a \"change of heart\" occurred. Berenberg senior UK economist Kallum Pickering told us however that despite these new developments, he's sticking to his guns and believes it is most unlikely Brexit can be reversed through a second referendum. \"I put a 5 percent chance on that\", he said. Here's our story and here's European Council President Donald Tusk's tweet: (Julien Ponthus) ALL ABOARD THE EQUITY EXPRESS (1422 GMT) It looks like equities and cyclicals are fast becoming the flavour of the day with BAML's January fund manager survey revealing that investors have raised their stock allocations to two-year highs and cut cash positions to five-year lows. Likewise private bank Coutts also voiced a preference for equities in its investment outlook for 2018: \"With company earnings in the major markets likely to continue rising and no sign of U.S. recession on the horizon, we continue to have confidence in equities, with a bias towards those regions where we see the growth cycle persisting for longer, like Europe and Japan.\" (Kit Rees) STRONG EURO? KEIN PROBLEM! (1329 GMT) The DAX index remains comfortably close to the all-time high it hit in November, up 1 percent, seemingly unperturbed by the rising euro. But shouldn't the stronger currency be a headwind for the heavily export-oriented German benchmark index? DZ Bank chief investment strategist Christian Kahler in Frankfurt doesn't believe so and says corporate Germany should be able to weather the appreciation, despite possible hits to competitiveness. \"German companies are known for their strong export trade. Based on our analyses, the share of sales of the German HDAX companies invoiced in USD was 28% (the HDAX comprises the companies included in the DAX, MDAX and TecDAX indices). This exposes them to increased risks through changes in exchange rates. However, 23% of the costs are also incurred on a USD basis, which puts the approach into perspective,\" he says. He adds that factors such as natural hedging in the form of local production capacity and borrowing in USD could also mitigate the rise in the single currency, while the broader strong economic backdrop is also likely to help. To be sure, not everyone sees the glass half full. Deutsche Bank, for example, said yesterday continued EUR strength could boost its long-standing recommendation of underweight Europe relative to U.S. equities. (Danilo Masoni) NORWEGIAN FUND'S NUCLEAR WEAPON BAN LEAVES BAE UNSCRATCHED (1228 GMT) Shares in BAE Systems didn't suffer much from the decision of Norway's sovereign fund this morning to exclude the British group from its portfolio, citing its policy regarding firms involved in the production of nuclear weapons. As you can see on this chart, the fund's statement around 0900 GMT triggered a spike in volumes but didn't prevent BAE from ticking slightly higher. BAE shares later edged down to their initial levels. At the beginning of 2017 the fund held 1.47 percent of BAE. Here's a link to the statement of Norway's sovereign fund, which has excluded other corporations for the same reason but also on other grounds such as \"risk of severe environmental damage\" or \"serious or systematic violations of human rights\". goo.gl/32GNrw (Julien Ponthus and Terje Solsvik) CYCLICAL RALLY: A SIGN OF THINGS TO COME? (1132 GMT) Cyclicals may be underperforming today but have done great so far this year. So how long is this latest rally in European cyclicals going to go on for? UBS' European equity strategists think that the cyclical outperformance we've seen at the beginning of 2018 could be a sign of things to come: \"With the recent rise in yields, cyclicals and especially the Banks have again gained support. We believe this year might carry on largely as it started: with cyclicals leading the way.\" (Kit Rees) SOME BIOTECH \"FEEL-GOOD\" FROM SAN FRANCISCO (1110 GMT) While the European Healthcare index has been quite an underperformer since the beginning of the year, analysts from Jefferies posted an upbeat note after meeting the management of over 30 European biotechs during a conference in San Francisco. \"Overall the tone was notably upbeat\", they said noting exciting clinical results in the pipeline, satisfactory funding and, cherry on the cake, M&A activity such as Novo's bid for Ablynx . So far however, as you can see from the snapshot below, few sectors (travel and leisure , personal and household goods, food and beverages and real estate ) have fared worst: (Julien Ponthus) EURO PARITY? WRONG PREDICTION! (1043 GMT) A number of investors had predicted the euro to remain weak throughout 2017 only to be wrong footed by its rapid and seemingly unstoppable surge that started last summer. While the jury is still out on whether this could stop gains in euro zone equities, predictions on the single currency are being revisited. Natixis, which had forecast the euro heading towards parity against the dollar by end-2017, admits it got it wrong and in a note today it formulates a new forecast for 2018: \"No question of parity, but rather of just when the EUR/USD's ascent will peter out. The euro has been under the spotlight since the start of the year. It could be the factor that scuppers the mood of optimism that has carried out over from 2017... a strong euro would end up affecting the economic recovery in the eurozone\". They conclude however: \"we do not see the EUR/USD as having much more upside potential.\" In this two-year chart you can see how euro zone stocks have risen despite the stronger currency. (Danilo Masoni) UK STOCKS TICK HIGHER AFTER INFLATION SLOWS (1014 GMT) UK inflation has dipped slightly after six months o", "external_links": [], "published": "2018-01-16T17:34:00.000+02:00", "crawled": "2018-01-16T18:02:31.000+02:00", "highlightTitle": ""}