{"organizations": [], "uuid": "235628e1bdce6fb590457247367cb58b883a69d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223422895&w=1200&r=LYNXMPEE0I1JJ", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mexico-oil/mexicos-energy-opening-faces-test-in-deepwater-oil-auction-idUSKBN1F82G5", "country": "US", "domain_rank": 408, "title": "Mexico's energy opening faces test in deepwater oil auction", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.899, "site_type": "news", "published": "2018-01-20T03:30:00.000+02:00", "replies_count": 0, "uuid": "235628e1bdce6fb590457247367cb58b883a69d0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mexico-oil/mexicos-energy-opening-faces-test-in-deepwater-oil-auction-idUSKBN1F82G5", "ord_in_thread": 0, "title": "Mexico's energy opening faces test in deepwater oil auction", "locations": [], "entities": {"persons": [{"name": "andres manuel lopez obrador", "sentiment": "none"}, {"name": "enrique pena nieto", "sentiment": "none"}], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bp plc", "sentiment": "none"}, {"name": "china offshore oil corp", "sentiment": "none"}, {"name": "exxon mobil corp", "sentiment": "none"}, {"name": "pemex", "sentiment": "none"}, {"name": "royal dutch shell plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - An auction of deepwater oil and gas fields in Mexico this month may prove the last major opportunity for President Enrique Pena Nieto’s government to capitalize on its opening of the energy sector, the central plank of its economic agenda.\nThe Jan. 31 tender of licenses to explore and drill in 29 blocks in the Gulf of Mexico is the biggest chunk of oil and gas wealth on offer since the completion of a 2013-14 legislative overhaul that ended state oil firm Pemex’s decades-long monopoly.\nMany of the biggest global oil firms have registered to take part, including Exxon Mobil Corp ( XOM.N ), Royal Dutch Shell Plc ( RDSa.L ), BP Plc ( BP.L ), Total SA ( TOTF.PA ) and China Offshore Oil Corp.\nThe blocks that Mexico is offering could attract billions of dollars in investment from companies that have long coveted access to the deep waters on Mexico’s side of the Gulf.\nLooming over the auction, however, is a July presidential election in which the frontrunner, leftist Andres Manuel Lopez Obrador, has attacked the energy reform and vowed to review contracts awarded to companies under Pena Nieto.\nAnother element of political risk for companies to consider is the potential for disruption to business if U.S. President Donald Trump makes good on threats to ditch the North American Free Trade Agreement (NAFTA).\nEnergy Minister Pedro Joaquin Coldwell, seeking to temper expectations, said investors may also be influenced by Trump’s corporate tax cuts and an increase in exploration and production opportunities in other parts of the world.\nThe Trump administration has vowed to open up nearly all U.S. offshore waters to oil and gas drilling, while auctions in Brazil and Argentina and new projects in nearby Guyana stake further claims to the capital Mexico is seeking to lure.\n“In that context, we estimate that if we assign seven lots - seven blocks at a minimum - from there onward the auction could be highly successful,” Joaquin Coldwell told Reuters.\nRising commodity prices and the relatively rare opportunity for global players to gain access to large, untapped fields, have spurred hopes for lively interest. The last deepwater round in Mexico in December 2016 saw eight of 10 blocks awarded.\n“You have every ingredient you need for an active sale,” said Tim Duncan, president and chief executive officer of Talos Energy, a U.S. company that won contracts in previous Mexican rounds but is not bidding this time around.\nUNEXPLORED Little drilling or exploration has been done in Mexico’s deep waters because Pemex lacks the specialist technology needed, as well as the funds. The state energy firm focuses on oilfields in shallow water.\nInternational oil firms are familiar with the geology of the region because it is similar to what is under the Gulf’s U.S. waters. The fields on offer are concentrated in three areas, including the prolific Perdido Fold Belt.\nGlobal oil majors have pumped billions of barrels of crude over decades of operation from the U.S. side, and Mexican waters are thought to hold similarly rich reserves of oil and gas.\nThe auction is the eighth group of fields put on the block since an inaugural Mexico tender in July 2015, which fell flat as crude prices were in the midst of a protracted slide.\nMexico plans another shallow water oil and gas auction in late March, but that is not expected to yield the same scale of investment as the deepwater round.\nELECTION RISK Pena Nieto saw opening up production, exploration and retail of oil and gas as the key to boosting lackluster economic growth to five percent a year or above.\nMore than 2,000 gas stations across Mexico that were once Pemex-only have begun pumping fuel under international brand names, and tens of billions of dollars in investment have been pledged to tap extensive oil and gas reserves.\nHowever, that investment will take years to raise output. Growth is stuck at around 2 percent, and the government has failed to reverse a steady decline in crude production.\nAfter peaking at around 3.4 million barrels per day (bpd) in 2004, oil output is now below 1.9 million bpd - a contrast to solid growth in production in recent years in Brazil, Latin America’s top oil producer.\nBill Richardson, a former U.S. energy secretary, said a successful auction would hand Pena Nieto a political victory as well as lift foreign investment.\n“If this auction is done properly, then it could be a good windfall for Mexico’s energy economy,” he told Reuters.\nPena Nieto is barred by law from seeking a second term, and the possibility of a victory by leftist Lopez Obrador in July’s election has freighted the energy opening with risk.\nThe 64-year-old Lopez Obrador has hinted at a softer stance on the overhaul, encouraging the hope that he would at least not renege on any existing contracts.\nIf oil companies believe Mexico may be less open after July, it could even spur bidding for contracts on Jan. 31, said Duncan at Talos Energy.\nAdditional reporting by David Alire Garcia; Editing by Daniel Flynn and Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T03:30:00.000+02:00", "crawled": "2018-01-19T22:37:20.070+02:00", "highlightTitle": ""}