{"organizations": [], "uuid": "114b15772d9e637690ea55e88e107a8a3102ec4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220762210&w=1200&r=LYNXMPEE090EC", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-malaysia-airlines-mh370/malaysia-signs-50-million-deal-with-u-s-firm-to-find-missing-mh370-idUSKBN1EZ0OA", "country": "US", "domain_rank": 408, "title": "Malaysia signs $50-million deal with U.S. firm to find missing MH370", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T10:09:00.000+02:00", "replies_count": 0, "uuid": "114b15772d9e637690ea55e88e107a8a3102ec4f"}, "author": "", "url": "https://www.reuters.com/article/us-malaysia-airlines-mh370/malaysia-signs-50-million-deal-with-u-s-firm-to-find-missing-mh370-idUSKBN1EZ0OA", "ord_in_thread": 0, "title": "Malaysia signs $50-million deal with U.S. firm to find missing MH370", "locations": [], "entities": {"persons": [{"name": "liow tiong lai", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "ocean infinity", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "malaysia airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Reuters) - Malaysia signed a deal on Wednesday to pay a U.S. seabed exploration firm up to $70 million if it finds the missing Malaysia Airlines aircraft MH370 within 90 days of embarking on a new search in the Southern Indian ocean.\nThe disappearance of the aircraft en route from Kuala Lumpur to Beijing in March 2014 with 239 people aboard ranks among the world’s greatest aviation mysteries.\nAustralia, China and Malaysia ended a fruitless A$200-million ($157 million) search of a 120,000 sq. km area in January last year, despite investigators urging the search be extended to a 25,000-square-km area further to the north.\nMalaysian Transport Minister Liow Tiong Lai said a Houston-based private firm, Ocean Infinity, would search for MH370 in that 25,000-sq-km priority area on a “no-cure, no-fee” basis, meaning it will only get paid if it finds the plane.\n“As we speak, the vessel, Seabed Constructor, is on her way to the search area, taking advantage of favorable weather conditions in the South Indian ocean,” Liow told a news conference.\nThe search will begin on Jan. 17, said Ocean Infinity Chief Executive Oliver Plunkett, who attended the signing event.\nOcean Infinity will be paid $20 million if the plane is found within 5,000 sq km, $30 million if it is found within 10,000 square km and $50 million if it is found within an area of 25,000 square km. Beyond that area, Ocean Infinity will receive $70 million, Liow said.\nIts priority is to locate the wreckage or the flight and cockpit recorders, and present credible evidence to confirm their location within 90 days, Liow added.\n“They cannot take forever or drag it on for another six months or a year.”\nMalaysia's Transport Minister Liow Tiong Lai speaks during a news conference after the MH370 search operations signing ceremony between Malaysia's government and Ocean Infinity, in Putrajaya, Malaysia January 10, 2018. REUTERS/Lai Seng Sin ‘UNIQUE SOLUTION’\nOcean Infinity’s vessel carries eight autonomous underwater vehicles that will scour the seabed with scanning equipment for information to be sent back for analysis.\nIt has 65 crew, including two government representatives drawn from the Malaysian navy.\nCivil Aviation Malaysia's Director General Azharuddin Abdul Rahman and Ocean Infinity's CEO Oliver Plunkett sign documents, witnessed by Malaysia's Transport Minister Liow Tiong Lai, during the MH370 search operations signing ceremony between Malaysia's government and Ocean Infinity, in Putrajaya, Malaysia January 10, 2018. REUTERS/Lai Seng Sin The ship could complete the search within three or four weeks, and cover up to 60,000 square km in 90 days, or four times faster than earlier efforts, Plunkett told Reuters.\n“It was a unique problem that required a unique solution... We looked at it and said, ‘Let’s do something different than what other people would do,’ and that’s the essence of our business.”\nOcean Infinity’s core business is in the oil and gas industry, as well as subsea exploration services for tasks such as underwater cabling and seabed mapping, he said.\nThe company’s shareholders would bear the upfront costs of the search, Plunkett added.\nDebris from MH370 could provide clues to events on board before the crash. There have been competing theories that the aircraft suffered mechanical failure or was intentionally flown off course.\nInvestigators believe someone may have deliberately switched off the plane’s transponder before diverting it thousands of miles out over the Indian Ocean.\nAt least three pieces of debris collected from sites on Indian Ocean islands and along Africa’s east coast have been confirmed as being from the missing plane.\nReporting by Rozanna Latiff; Writing by Praveen Menon; Editing by Jamie Freed and Clarence Fernandez\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-10T10:09:00.000+02:00", "crawled": "2018-01-10T10:26:37.017+02:00", "highlightTitle": ""}