{"organizations": [], "uuid": "ec86fdc832fdef1e1460a9c1d1b1effc450b6bc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-slavery-rohingya/trafficked-to-india-rohingya-look-for-place-to-call-home-idUSKBN1EU0JB", "country": "US", "domain_rank": 408, "title": "Trafficked to India, Rohingya look for place to call home", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-05T14:43:00.000+02:00", "replies_count": 0, "uuid": "ec86fdc832fdef1e1460a9c1d1b1effc450b6bc3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-slavery-rohingya/trafficked-to-india-rohingya-look-for-place-to-call-home-idUSKBN1EU0JB", "ord_in_thread": 0, "title": "Trafficked to India, Rohingya look for place to call home", "locations": [], "entities": {"persons": [{"name": "rohingya", "sentiment": "negative"}, {"name": "rahman", "sentiment": "none"}, {"name": "abdul rahman", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "mathura", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}, {"name": "mewat", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NUH, India (Thomson Reuters Foundation) - Sold for $130 to work as a rag picker in the northern Indian town of Mathura, Rohingya refugee Abdul Rahman lived in a tenement of stitched together polythene bags and pined for his home and the lush farmland he owned in Myanmar’s Rakhine state.\nWhen he was rescued, Rahman moved to a Rohingya settlement that he thought was the closest he could get to home, along with seven other families of rescued bonded workers who were also trafficked from a refugee camp in Bangladesh and sold in India.\n“But I have no place to stay here. In Mathura, I had a roof over my head and the employer gave us food to eat,” Rahman, 45, a father of four who spoke longingly of his home in Myanmar, told the Thomson Reuters Foundation.\n“The agent had promised me a good life in India. I believed him. I was not scared when I crossed over to India,” he said squatting on the floor at the settlement in Mewat, about 100 km (62 miles) south of New Delhi.\nWhile the United Nations (U.N.) has warned that refugee camps in Bangladesh are fertile territory for human traffickers, cases of enslavement in India have only started to emerge recently with the rescue of Rohingya bonded workers.\nIndia banned bonded labor in 1976, but it remains widespread with millions working in fields, brick kilns, brothels or as domestics to pay off debts.\nUnlike Indians, who can claim cash compensation, land and housing from the government after being rescued from bondage, campaigners fear pursuing Rohingya cases as most of them entered India illegally and could face action.\nIn a fast-growing refugee crisis, almost 870,000 Rohingya have fled to Bangladesh from Myanmar, including about 660,000 who arrived after Aug. 25, when Rohingya militants attacked security posts and the army launched a counter-offensive.\nTheir influx into India started years earlier, with close to 40,000 Rohingya Muslims living in the country after fleeing persecution in Buddhist-majority Myanmar over the last decade.\nSOLD When Rahman was rescued after four years of bondage, he moved to Mewat, which has the third largest Rohingya population in India, dating back to 2013. The settlement he lives in is one of seven in the town and houses 120 families in 90 shanties.\nMewat is popular with the Rohingya because locals have given them land, said Nirmal Gorana, convener of the National Campaign Committee for Eradication of Bonded Labour, who helped rescue 13 enslaved Rohingya workers last month.\n“When we asked them where they wanted to go after their rescue, they said they wanted to be closer to their community,” Gorana said.\nMewat’s proximity to New Delhi is a major draw as many travel to the city and its outskirts for work.\n“Every two months, more people come in,” said Noor Alam, who heads the Rohingya settlement in Mewat.\n“There is land to build more tenements, but then you need bamboo, plastic, ropes, cardboard - that costs nearly 7,000 rupees. But they don’t have money.”\nRahman was sold, along with three other trafficked Rohingya, for 25,000 rupees ($394) in Mathura. His employer deducted the money from his wages, leaving him penniless when he was rescued.\nAnother rescued Rohingya, Sadiq Hussain, 22, had not earned enough to pay back the 25,000 rupees his employer gave him when he started work almost four years earlier.\n“I still owed him 5,000 rupees when I was rescued,” he said.\nHussain did not have a job or a roof over his head and feared he could not find work because his identity card, issued by the U.N. refugee agency (UNHCR), was with the authorities.\nThe refugee card is the only proof of identity that many stateless Rohingya have to show prospective employers.\nTERRORIST For Rohingya Muslims, their identity is a major hurdle to securing work as India is seeking legal clearance to deport them citing ‘security threat’ and links to Pakistan-based militant groups.\nRohingya refugees in India are very poor, have limited education and skills and work in low-paid, informal jobs where they are sometimes harassed and exploited, said UNHCR policy associate Ipshita Sengupta.\nDil Mohammed, a nattily dressed man in his early 20s, was one of the few Rohingya who found a regular job in a car factory in the northern city of Jammu, earning about 11,000 rupees a month. But he was asked to leave for “security reasons”.\n“I raised my hands and said I wasn’t a terrorist, just a worker,” said Mohammed, who carries UNHCR’s refugee identity card wherever he goes, has learnt to speak Hindi and hopes to land an interpreter’s job.\nBut what he shares with other Rohingya refugees is the dream to return to Myanmar, one day.\n“We have no identity to claim any social benefits in India. We cannot demand citizens’ rights here. We can do that only in our homeland,” he said.\nReporting by Roli Srivastava @Rolionaroll; Editing by Katy Migiro. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T14:43:00.000+02:00", "crawled": "2018-01-05T09:49:20.005+02:00", "highlightTitle": ""}