{"organizations": [], "uuid": "8f81f1d2c7d45ce1760bb9748f46c5716a89634d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221520911&w=1200&r=LYNXMPEE0B1E2", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-goldman-sachs-classaction/goldman-thwarts-fraud-class-action-tied-to-abacus-cdo-u-s-appeals-court-idUKKBN1F12BH", "country": "US", "domain_rank": 408, "title": "Goldman thwarts fraud class action tied to Abacus CDO: U.S. appeals court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:55:00.000+02:00", "replies_count": 0, "uuid": "8f81f1d2c7d45ce1760bb9748f46c5716a89634d"}, "author": "", "url": "https://uk.reuters.com/article/us-goldman-sachs-classaction/goldman-thwarts-fraud-class-action-tied-to-abacus-cdo-u-s-appeals-court-idUKKBN1F12BH", "ord_in_thread": 0, "title": "Goldman thwarts fraud class action tied to Abacus CDO: U.S. appeals court", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "goldman", "sentiment": "negative"}, {"name": "abacus", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "reuters tv united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs group inc", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "2nd u.s. circuit court of appeals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump denies offensive language on immigration Trump denies offensive language on immigration Trump denies offensive language on immigration Reuters TV United States January 12, 2018 / 6:31 PM / a few seconds ago Goldman thwarts fraud class action tied to Abacus CDO: U.S. appeals court Jonathan Stempel 3 Min Read \nNEW YORK (Reuters) - A U.S. appeals court said a shareholder lawsuit accusing Goldman Sachs Group Inc ( GS.N ) of fraudulently claiming to put client interests before its own when creating risky subprime securities before the financial crisis, including a collateralized debt obligation known as Abacus, cannot proceed as a class action. FILE PHOTO - A Goldman Sachs sign is seen above the floor of the New York Stock Exchange shortly after the opening bell in the Manhattan borough of New York, U.S. on January 24, 2014. REUTERS/Lucas Jackson/File Photo \nThe 2nd U.S. Circuit Court of Appeals in Manhattan said on Friday a lower court judge imposed too high a burden on the Wall Street bank to show that its alleged conflicts of interest and misleading statements had no impact on its stock price. \nWhile the 3-0 decision permits shareholders to again seek class certification, it may now be easier for Goldman to convince U.S. District Judge Paul Crotty, who had certified a class action in September 2015, not to let the plaintiffs sue as a group. \nThomas Dubbs, a lawyer for the shareholders, said he was “confident” a class action would again be certified. Goldman had no immediate comment. \nShareholders from February 2007 to June 2010 claimed to lose more than $13 billion because Goldman had in regulatory filings and public comments overstated its ability to manage conflicts. \nThey said Goldman did this while concealing short positions that the bank or hedge fund manager John Paulson made in four subprime mortgage CDOs: Abacus 2007 AC-1, Anderson Mezzanine Funding 2007-1, Hudson Mezzanine Funding 2006-1, and Timberwolf. \nShareholders sued after news about federal enforcement activity hurt Goldman’s stock, including when the Securities and Exchange Commission brought civil fraud charges in April 2010 against Goldman and vice president Fabrice Tourre over Abacus. \nIn certifying a class action, Crotty had said Goldman “failed to conclusively sever th[e] link” between its statements and its stock price. \nBut in Friday’s decision, Circuit Judge Richard Wesley, citing a more recent ruling involving Barclays Plc ( BARC.L ), said Goldman had only to show it more likely than not that its alleged misrepresentations did not affect the stock. \nWesley also said Crotty should have let Goldman present evidence of 34 dates prior to 2010 when news reports of its alleged conflicts did not hurt its stock price. \nAbsent any impact, shareholder claims could “completely collapse,” Wesley said. \nThe SEC has estimated that Paulson made about $1 billion by betting against Abacus. \nGoldman settled with the SEC for $550 million in July 2010, without admitting wrongdoing. A federal jury found Tourre liable in August 2013, and a judge later ordered him to pay more than $856,000, including a fine. \nThe case is Arkansas Teachers Retirement System et al v Goldman Sachs Group Inc et al, 2nd U.S. Circuit Court of Appeals, No. 16-250. Reporting by Jonathan Stempel in New York; Editing by Tom Brown", "external_links": [], "published": "2018-01-12T19:55:00.000+02:00", "crawled": "2018-01-12T20:44:09.000+02:00", "highlightTitle": ""}