{"organizations": [], "uuid": "a334b28e8299f9b71b309e1e7ed5751137e28fc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224878216&w=1200&r=LYNXMPEE0N1S8", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl/riveting-super-bowl-can-make-nfl-troubles-disappear-idUSKBN1FD2HR", "country": "US", "domain_rank": 408, "title": "Riveting Super Bowl can make NFL troubles disappear", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:31:00.000+02:00", "replies_count": 0, "uuid": "a334b28e8299f9b71b309e1e7ed5751137e28fc8"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl/riveting-super-bowl-can-make-nfl-troubles-disappear-idUSKBN1FD2HR", "ord_in_thread": 0, "title": "Riveting Super Bowl can make NFL troubles disappear", "locations": [], "entities": {"persons": [{"name": "steve", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "roger goodell", "sentiment": "none"}, {"name": "keating", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "nfl", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - It has been a bruising season for the NFL but nothing can make troubles disappear faster than a good party and the league will be hoping as much when it tosses its annual Super Bowl bash with the New England Patriots and Philadelphia Eagles clashing in Minneapolis.\nThe Super Bowl is the biggest shindig in North American sports and, just like New Year‘s, offers the perfect opportunity for the NFL to put any troubles behind and send fans, sponsors and officials smiling into the offseason.\nThere is no shortage of things the NFL would like to see in the rearview mirror, particularly a feud between U.S. President Donald Trump and the league over players protesting racism by kneeling during the national anthem.\nAn agitated Trump scorned any player who protests as a “son of a bitch” who should face suspension. NFL Commissioner Roger Goodell praised the athletes as political activists.\n”We live in a society that’s pretty fractured and when you appeal to a large audience ... those kinds of issues get a tremendous focus,“ Goodell said in a speech to the Economic Club of New York on Tuesday. ”Even though we may disagree with the form of protest it forced us to listen.\n“We really took the time to understand them. I think we could use a little more of that in our society.”\nTrump’s Twitter storms directed at the NFL were not the only cloud hanging over the NFL.\nA slide in TV ratings, renewed debate over concussions, the prescribing and use of painkillers, domestic abuse and sexual harassment allegations all combined to drag the spotlight away from the field.\nThe Super Bowl, however, is one of those rare events that some experts say has the capacity cover up a lot of warts while solving none of the problems.\n”There is nothing in North America in the same stratosphere as the Super Bowl, in terms of who it reaches, how many people get involved,“ Norm O‘Reilly, a business professor and chair of Ohio University’s sports administration department told Reuters. ”It is the mega event of mega events.\n”All we deal with before any Olympic Games is all the negative like in Rio; it’s a terrible place to go and then the second the opening ceremonies start everybody forgets.\n”It’s magic.\n“A magical Super Bowl clearly has the ability to make a lot of people forget about some of these things.”\nThis year it will fall on the Patriots and Eagles to provide the Super Bowl magic when they clash on Feb. 4.\nGood vibes, however, could vanish in an instant if someone kneels during the anthem or if the league’s concussion protocol comes under questioning.\nBut with quarterback Tom Brady and the defending champion Patriots headlining the NFL’s biggest game of the year, interest is already trending upwards.\nLove them or hate them, and there is very little gray area when it comes to the Patriots, New England bring cache and name brand recognition to the Super Bowl providing some engagement for the tens of millions of casual fans who are otherwise just interested in the party.\nThe Eagles, with quarterback Nick Foles thrust into the starting job last month after an injury to Carson Wentz, will assume the underdog role against a Patriots team seeking their third Vince Lombardi Trophy in four seasons.\nFive-times Super Bowl champion Brady is arguably the biggest name in U.S. sport and perhaps the best known American sportsman globally.\nBill Belichick, the taciturn Patriots head coach who treats news conferences as if he were testifying in front of grand jury, is the mastermind behind the operation owned by billionaire Robert Kraft, who rubs shoulders with Trump and Russian President Vladimir Putin.\nThe three pillars of the Patriots empire will be the focus of a Super Bowl soap opera with ESPN having recently run a report that suggested a rift between Brady, Belichick and Kraft.\nThat juicy storyline and others will all be grist for the Super Bowl mill that will be churning with more than 5,000 credentialed media.\nWhile a nailbiting finish would spark a ratings jump, an estimated 150 million Americans and worldwide television audience are expected to will tune in on Feb. 4.\nA culture touchstone in the U.S. the Super Bowl has matured into a global event, a Bacchanalian feast of pizza, beer and gridiron that will all be consumed from London to Tokyo.\n”We’ve done research on these events and asked the question does it matter where the Olympic Games are and it doesn‘t,“ said O‘Reilly. ”The Super Bowl is in that boat, it is so big and people love it.\n“You go to a Super Bowl party even before you know who is playing.”\nEditing by Frank Pingue in Toronto and Rory Carroll in Los Angeles\n ", "external_links": [], "published": "2018-01-24T19:31:00.000+02:00", "crawled": "2018-01-24T19:38:29.001+02:00", "highlightTitle": ""}