{"organizations": [], "uuid": "0bc857bd97612351271d3750ff45dc17d6d02285", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-hallmark-lighting-strengthens-global-sales-team-with-key-hires.html", "country": "US", "domain_rank": 767, "title": "Hallmark Lighting Strengthens Global Sales Team with Key Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:00:00.000+02:00", "replies_count": 0, "uuid": "0bc857bd97612351271d3750ff45dc17d6d02285"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-hallmark-lighting-strengthens-global-sales-team-with-key-hires.html", "ord_in_thread": 0, "title": "Hallmark Lighting Strengthens Global Sales Team with Key Hires", "locations": [], "entities": {"persons": [{"name": "livingston", "sentiment": "none"}, {"name": "leslie livingston", "sentiment": "none"}, {"name": "stephanie weston", "sentiment": "none"}], "locations": [{"name": "chatsworth", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hallmark lighting", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHATSWORTH, Calif., Jan. 24, 2018 /PRNewswire/ -- Hallmark Lighting , a leading provider of customized, high-end lighting solutions, primarily to the hospitality industry, today announced the hiring of Leslie Livingston as Vice President of International Sales. Livingston, who has deep experience in the hospitality industry, will lead the firm's expanded outreach to global markets. Livingston is the latest in a series of senior hires at the firm in recent months that also include Stephanie Weston, Vice President of Sales, who is responsible for the U.S. market.\nIn recent years, Hallmark Lighting has enjoyed growing demand driven by increasing recognition of its innovative lighting solutions, its highly competitive pricing and the superior craftsmanship provided by trained artisans in the U.S. Today, 98 percent of four- and five-star hotels use Hallmark Lighting products. Nearly all – 95 percent – of the top 100 designers and procurement firms work with Hallmark Lighting. The Lumin Collection by Hallmark Lighting, introduced yesterday, is expected to dramatically expand the company's reach by offering superior-quality stock products in addition to the company's customized lighting solutions.\n\"We have been aggressively investing in Hallmark Lighting's and Luminance's businesses, improving operations and recruiting talent at all levels,\" said Ron Cozean, executive chairman of both Hallmark Lighting and its sister company, Luminance and an operating executive at Resilience Capital Partners , which owns Hallmark Lighting and Luminance. \"We believe in investing patiently, finding companies that – with the right operating improvements, the right investments and the right talent – can compete on a world-class level. I'm confident that Leslie Livingston and Stephanie Weston can help Hallmark Lighting win new sales in a competitive marketplace.\"\nPrior to joining Hallmark Lighting, Livingston held senior positions with Global Views, a wholesale purveyor of furniture, decorative accessories and lighting. She most recently served as Director of Sales for the firm's Hospitality Division, where she increased international sales 34 percent in 2017. She previously served in increasingly important roles in the same division as National Sales Manager, Regional Sales Manager and Hospitality Sales Manager.\nEarlier, Livingston gained expertise in the hospitality industry as Director of Concierge Services for the W Dallas Victory Hotel and Residences. She also served as Director of Guest Services for the Ritz-Carlton Boston. Livingston is an alumna of the University of Colorado at Boulder, from which she earned a B.A. degree in political science.\nLivingston's hiring is the latest in a series of senior hires Hallmark Lighting has made in recent months. Among the others:\nStephanie Weston joined the team as Vice President of Sales. She has more than a decade of hospitality sales experience, creating strategic alliances to effectively align and support key revenue growth initiatives. Before joining Hallmark Lighting, Stephanie served as Global Project Sales Consultant for the German sanitary fittings manufacturer Hansgrohe SE. Stephanie holds a B.S. degree in Business Finance and an MBA from Wilmington University. Jeff Wierzba has been appointed Director of Model Room & Domestic Support, bringing more than 20 years of custom lighting sales experience, including responsibility for hospitality sales and marketing at Troy CSL Lighting. He holds a B.S. degree in Business Management and Economics from the University of Wisconsin. Camilo Acosta has been named Hallmark Lighting's new Operations Manager, overseeing the company's operations team on multiple levels. He has a quarter-century of lighting and manufacturing experience with companies such as Architecture Works and Interglobal, Inc. His experience includes working with Brad Senet, who founded Hallmark Lighting in 1978.\n\"Among Hallmark Lighting's top priorities is the acquisition of talent to take advantage of the increased demand and new market opportunities we are seeing,\" said Cozean. \"Our hiring of Leslie Livingston as Vice President of International Sales complements the hiring of Stephanie Weston as Vice President of Sales with responsibility for the U.S. market. Leslie and Stephanie will help us take advantage of market opportunities and show our commitment to building a team that will enable us to expand both globally and domestically.\"\nResilience Capital Partners, a Cleveland-based private equity firm that manages in excess of $625 million, acquired Hallmark Lighting and Luminance in 2016.\nAbout Hallmark Lighting\nBased in Chatsworth, California, Hallmark Lighting provides the absolute best in custom lighting and architectural appointments, customized, high-end lighting solutions, primarily to the hospitality industry. Having been on the forefront of custom lighting for more than 40 years, Hallmark combines experience to offer an unsurpassed commitment to product quality, customer service and ultimate client satisfaction. We understand the demands that design and purchasing firms face in meeting, and exceeding, their clients' expectations and welcome the opportunity to enhance our innovative design, diversified product offering and creative solutions. For more information, visit us online at www.hallmarklighting.com .\nAbout Luminance\nCommerce, California-headquartered Luminance is a designer and distributor of lighting solutions, fixtures, hardware and electrical components, ceiling fans, plumbing parts, light bulbs and LED bulbs. Founded in 1951 and formerly known as American De Rosa Lamparts, Luminance offers not only a unique collection of residential and commercial lighting solutions in flawless finishes but also unparalleled quality and world-class service. In addition to its Commerce headquarters, the company has facilities in Texas, New York and Illinois as well as China. Luminance provides a large line of stock products to residential and commercial clients while its sister company, Hallmark Lighting, supplies customized, high-end lighting solutions, primarily to the hospitality industry. For more information, visit us online at www.luminance.us.com .\nAbout Resilience Capital Partners\nHeadquartered in Cleveland, Ohio, Resilience Capital Partners invests in niche-oriented manufacturing, value-added distribution and business service companies with sustainable market positions and a clear path to cash flow improvement. Resilience Capital Partners targets platform businesses with $25 million to $250 million in revenues across a broad range of industries where it can improve a company's operations, competitive positioning and profitability. Resilience manages in excess of $625 million for its global investor base that includes pension funds, insurance companies, foundations and endowments, fund of funds and family offices. For more information, please visit www.resiliencecapital.com .\nContact:\nCaryn Brownell\nThe Hubbell Group, Inc.\n781-878-8882\ncbrownell@hubbellgroup.com\nView original content: http://www.prnewswire.com/news-releases/hallmark-lighting-strengthens-global-sales-team-with-key-hires-300587511.html\nSOURCE Hallmark Lighting", "external_links": ["http://www.luminance.us.com/", "http://www.hallmarklighting.com/", "http://www.prnewswire.com/news-releases/hallmark-lighting-strengthens-global-sales-team-with-key-hires-300587511.html", "http://www.resiliencecapital.com/"], "published": "2018-01-24T18:00:00.000+02:00", "crawled": "2018-01-24T19:28:11.001+02:00", "highlightTitle": ""}