{"organizations": [], "uuid": "844da3c5983cebe2c34a1341a4d2b36fc625a9b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 102, "shares": 102, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218924241&w=1200&r=LYNXMPEE0200L", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-eye-all-time-top-on-global-growth-cheer-idUSKBN1ES00N", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia shares eye all-time top on global growth cheer", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T02:33:00.000+02:00", "replies_count": 0, "uuid": "844da3c5983cebe2c34a1341a4d2b36fc625a9b7"}, "author": "", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-eye-all-time-top-on-global-growth-cheer-idUSKBN1ES00N", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia shares eye all-time top on global growth cheer", "locations": [], "entities": {"persons": [{"name": "wayne cole", "sentiment": "positive"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - World shares smashed records on Wednesday as Wall Street opened up and European stocks advanced on investor optimism in the new year, while the dollar rallied against a basket of key currencies.\nMSCI’s gauge of stocks .MIWD PUS, which tracks shares in 47 countries, gained 0.38 percent. In 2017, the index’s best year since 2009, it set scores of record highs and rose by one-fifth in value.\nU.S. equities also climbed to fresh highs, with the benchmark S&P 500 breaching the 2,700-mark for the first time on Wednesday. The Nasdaq Composite and the Dow Jones Industrial Average also broke records, propelled by tech stocks.\nThe Dow Jones Industrial Average .DJI rose 51.23 points, or 0.21 percent, to 24,875.24, the S&P 500 .SPX gained 11.82 points, or 0.44 percent, to 2,707.63 and the Nasdaq Composite .IXIC added 48.79 points, or 0.7 percent, to 7,055.69.\nTuesday, the first day of trading in 2018, saw a strong start for the indices, with the S&P and the Nasdaq hitting record closing highs.\n“We had a strong start and we are likely to see a follow through in the near-term,” said Scott Brown, chief economist at Raymond James in St. Petersburg, Florida.\nThe pan-European STOXX 600 index was up 0.52 percent while MSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS closed 0.46 percent higher as manufacturing surveys pointed to a strong start for the European economy.\nEmerging market stocks rose 0.57 percent, and Japan's Nikkei .N225 lost 0.08 percent.\nDOLLAR REBOUNDS The dollar index .DXY rose 0.24 percent, snapping a three-week losing streak, after stronger-than-forecast U.S. manufacturing and construction data.\nThe Japanese yen weakened 0.05 percent versus the greenback at 112.35 per dollar, while Sterling GBP= was last trading at $1.3518, down 0.50 percent on the day.\nSlideshow (2 Images) The euro was EUR= down 0.26 percent to $1.2026.\nU.S. Treasury yields trimmed their earlier fall on Wednesday after an upbeat report on U.S. manufacturing from the Institute for Supply Management.\nInvestors are also awaiting the release later on Wednesday of minutes from last month’s Federal Reserve meeting. During the meeting, Fed policy makers decided to raise short-term interest rates for a third time in 2017.\nBenchmark 10-year notes US10YT=RR last rose 5/32 in price to yield 2.4489 percent, from 2.465 percent late on Tuesday.\nThe 30-year bond US30YT=RR last rose 10/32 in price to yield 2.7949 percent, from 2.81 percent late on Tuesday.\nHawkish comments from two European Central Bank officials sent yields higher on Tuesday, with the 10-year German Bund yield DE10YT=RR hitting a two-month peak and the five-year U.S. yield US5YT=RR reaching its highest level since April 2011.\nSome investors said Tuesday’s yield rise was in part a reversal of the drop linked to typical year-end buying.\n“A majority of yesterday’s move was a move back of what happened over the year-end holiday,” said Jason Celente, senior portfolio manager at Insight Investment in New York.\nElsewhere, spot gold XAU= reached its highest since mid-September on Wednesday, before edging back to $1,316.36 per ounce.\nOil prices hit fresh two-and-a-half year highs as strong output in the United States and Russia balanced tensions from a sixth day of unrest in OPEC member Iran.\nU.S. crude CLcv1 rose 1.79 percent to $61.45 per barrel and Brent LCOcv1 was last at $67.54, up 1.46 percent on the day.\nReporting by Stephanie Kelly; Additional reporting by Abhinav Ramnarayan and Oleg Vukmanovic in London, Sruthi Shankar in Bengaluru, Richard Leong and Gertrude Chavez-Dreyfuss in New York, and Henning Gloystein in Singapore; Editing by Nick Zieminski\n ", "external_links": [], "published": "2018-01-03T02:33:00.000+02:00", "crawled": "2018-01-03T02:46:24.004+02:00", "highlightTitle": ""}