{"organizations": [], "uuid": "0eca30ed1aa876701a3d240b3fdc9171cf2b24ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/12/the-associated-press-a-look-at-facebooks-changes-over-the-years-in-what-you-see.html", "country": "US", "domain_rank": 767, "title": "A look at Facebook's changes over the years in what you see", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:22:00.000+02:00", "replies_count": 0, "uuid": "0eca30ed1aa876701a3d240b3fdc9171cf2b24ba"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/the-associated-press-a-look-at-facebooks-changes-over-the-years-in-what-you-see.html", "ord_in_thread": 0, "title": "A look at Facebook's changes over the years in what you see", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook is once again tweaking what you see to focus more on personal connections and take the spotlight off brands and news articles.\nFacebook says it will highlight posts you are most likely to engage with and make time spent on social media more \"meaningful.\" That means cutting back on items that Facebook users tend to passively consume, including video.\nTo try to keep you glued to Facebook, it regularly updates the formula that decides what posts you see. With the latest update, the company says it's focusing on what Facebook is for — connecting with people you know.\nHere's a look at some of the ways the company has changed the posts appearing in users' customized news feeds, which launched in 2006, as well as some of the factors it uses in deciding what makes up those feeds.\nMAKING FACEBOOK \"MEANINGFUL\"\nLast June, CEO Mark Zuckerberg said Facebook would tweak its formulas to try to boost membership in \"meaningful\" groups. Whenever someone spends at least 30 minutes a week in a group, Facebook classifies it as \"meaningful.\" The company estimates that 130 million of its users are in such groups. It wants to increase that to more than a billion by 2022.\nDOWN WITH CLICKBAIT?\nFacebook tweaked its news feed in 2014 to clamp down on \"clickbait,\" posts with grabby headlines like \"you won't believe what happened next\" yet ultimately disappoint.\nMore clicks mean the posts would move higher in people's news feeds, even if people don't really want to see them. How does Facebook decide what's clickbait? For one, it knows how much time you spend reading an article. A quick click generally means you're not really interested in the post that was shared.\nFacebook's push worked. You're much less likely to see clickbait these days.\nYOUR PERSONAL \"NEWSPAPER\"\nIn 2013, Zuckerberg said he wanted the news feed to look more like a digital newspaper, filled with information tailored to each user. The company gave you more ways to decide what you want or don't want to see.\nLater, the company expanded these tools to let you choose the friends and brands whose posts you want to see first. That means a news hound can choose to highlight news articles, for instance. You can also unfollow a specific friend's posts, while still staying connected on Facebook; you can decide to follow that person again later.\nADS ARE SEPARATE\nThe changes won't affect how often you see advertisements, or as Facebook calls them, \"sponsored posts.\"\nHowever, you can tell Facebook not to show a particular ad again, and Facebook will stop showing you that and will show something else instead. Over time, Facebook will tailor the ads it shows you based on such feedback.\nDATA RULES\nIt's in Facebook's best interest to show its more than 1 billion daily users stuff that will keep them interested — and keep them coming back. To that end, the company says it surveys tens of thousands of users each day to get a more complete picture of what people want to see.", "external_links": [], "published": "2018-01-12T19:22:00.000+02:00", "crawled": "2018-01-13T09:01:07.010+02:00", "highlightTitle": ""}