{"organizations": [], "uuid": "8c7d8a89b46be49ec070bbd3e592356e4c5544bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/07/103287436-RTX79NP.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/29/saudi-aramco-ipo-stalled-by-indecision-over-where-to-list-shares.html", "country": "US", "domain_rank": 767, "title": "Saudi Aramco IPO stalled by indecision over where to list shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:47:00.000+02:00", "replies_count": 0, "uuid": "8c7d8a89b46be49ec070bbd3e592356e4c5544bb"}, "author": "Tom DiChristopher", "url": "https://www.cnbc.com/2018/01/29/saudi-aramco-ipo-stalled-by-indecision-over-where-to-list-shares.html", "ord_in_thread": 0, "title": "Saudi Aramco IPO stalled by indecision over where to list shares", "locations": [], "entities": {"persons": [{"name": "amin nasser", "sentiment": "none"}, {"name": "mohammed bin salman", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "saudi aramco ipo", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Indecision over where to list shares of the world's largest energy company are reportedly playing a major role in holding up what is expected to be the biggest-ever initial public offering.\nSaudi Aramco, currently a private company owned by the Saudi government, is aiming for an IPO that could raise about $100 billion and attract a valuation in the range of $1 trillion to $2 trillion this year. But the process has dragged on as key aspects of the share sale remain unsettled.\nThe IPO is the centerpiece of Saudi Arabia 's plan to diversify its oil-dependent economy. It also stands to create a huge windfall for the army of bankers and lawyers involved in the offering.\n\"It's about evaluating all the information that is being passed to the government in terms of different markets that we have in terms of listed venues, whether it is in the UK, or New York or Hong Kong or other markets\" -Amin Nasser, Saudi Aramco president and CEO However, Saudi officials and outside advisors have warned Crown Prince Mohammed bin Salman that a listing on the New York Stock Exchange, which the powerful royal prefers, would open Aramco to legal threats from shareholders and 9/11 victims, The Wall Street Journal reported on Sunday.\nFamily members of those killed in the World Trade Center attack have long sought to press a legal case against Saudi officials, alleging they shielded some of the attackers.\nThe officials warning on an NYSE listing include Saudi Energy Minister and Aramco Chairman Khalid al-Falih, people familiar with the matter tell the Journal. Falih and other senior officials prefer a listing in London, where they see less legal risk, according to the paper.\nSaudi Aramco declined to comment on the Journal report.\nshow chapters Saudi Aramco is ready to go public, says CEO      1:35 PM ET Wed, 24 Jan 2018 | 01:48 Aramco President and CEO Amin Nasser told CNBC last week that the company is ready to list in 2018 , but it is waiting for its sole shareholder — the Saudi government — to make a decision about the listing venue.\n\"It's about evaluating all the information that is being passed to the government in terms of different markets that we have in terms of listed venues, whether it is in the U.K., or New York or Hong Kong or other markets,\" Nasser said.\nThe chances that Aramco will list this year are growing more remote, some of the Journal's sources say, though some told the paper a 2018 IPO is still possible if Salman makes up his mind soon.\nThe NYSE is at the top of Salman's list because it comes with access to a huge pool of investors, carries international prestige and could bolster relations with the Trump administration, according to the Journal.\nPresident Donald Trump told the Saudis he would appreciate them choosing the NYSE in a November tweet.\n@realDonaldTrump: Would very much appreciate Saudi Arabia doing their IPO of Aramco with the New York Stock Exchange. Important to the United States! \nOther options include listing Aramco solely on Saudi Arabia's Tadawul stock exchange, along with an investment from one of several countries' sovereign wealth funds. However, the Journal notes that this would be difficult given the Tadawul's total market capitalization is just $451 billion, as little as one-half to one-quarter the size of Aramco's estimated valuation.\nIn a November interview with CNBC, Nasser batted down rumors that Aramco is seeking an investment from China or another nation in lieu of listing on a foreign exchange.\nshow chapters Saudi Aramco's massive IPO is 'on track' for next year, CEO says      7:46 AM ET Mon, 23 Oct 2017 | 03:33 One \"last resort\" option under consideration involves creating a subsidiary that would hold some of Aramco's upstream and downstream assets, businesses that include exploring for and producing fossil fuels and refining them into fuel and petrochemicals, respectively. That subsidiary would then be listed, protecting the larger company from lawsuits, one person told the Journal.\nInvestment banks tell the Journal the delays risk sparking an exodus of experts from the project. Bankers, lawyers and consultants are growing concerned about their career opportunities and bonuses while shepherding the Aramco IPO to completion.\nSaudi Aramco recently invited additional banks including Goldman Sachs to the kingdom to pitch for a role in the IPO, Reuters reported earlier this month.\nRead the full story here .", "external_links": ["https://www.wsj.com/articles/aramco-ipo-stalled-by-indecision-over-where-to-list-1517158800", "https://twitter.com/realDonaldTrump/status/926793510723796993"], "published": "2018-01-29T18:47:00.000+02:00", "crawled": "2018-01-29T17:52:54.005+02:00", "highlightTitle": ""}