{"organizations": [], "uuid": "f4a0e2159851d5a62f5b67288554d2ebe9c31d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-gsi-technology-inc-reports-third-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "GSI Technology, Inc. Reports Third-Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:05:00.000+02:00", "replies_count": 0, "uuid": "f4a0e2159851d5a62f5b67288554d2ebe9c31d94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-gsi-technology-inc-reports-third-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "GSI Technology, Inc. Reports Third-Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "gsi technology, inc", "sentiment": "neutral"}, {"name": "gsi technology, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 25, 2018 (GLOBE NEWSWIRE) -- GSI Technology, Inc. (NASDAQ:GSIT) today reported financial results for its third fiscal quarter ended December 31, 2017.\nThe Company reported a net loss of $(1.5 million), or $(0.07) per basic and diluted share, on net revenues of $11.1 million for the third quarter of fiscal 2018, compared to net income of $348,000, or $0.02 per basic and diluted share, on net revenues of $11.5 million for the third quarter of fiscal 2017 and a net loss of $(1.7 million), or $(0.08) per basic and diluted share, on net revenues of $9.6 million for the second quarter of fiscal 2018, ended September 30, 2017. Gross margin was 51.0% compared to 56.6% in the prior year period and 50.4% in the second quarter of fiscal 2018.\nTotal operating expenses in the third quarter of fiscal 2018 were $6.7 million, compared to $6.3 million in the third quarter of fiscal 2017 and $6.7 million in the preceding quarter. Research and development expenses were $4.2 million, compared to $3.8 million in the prior year period and $4.2 million in the preceding quarter. Selling, general and administrative expenses were comparable year-over-year at $2.5 million compared to $2.4 million in the quarter ended December 31, 2016 and $2.5 million in the preceding quarter.\nLee-Lean Shu, Chairman and Chief Executive Officer, noted, \"Our net revenues came in above the range of guidance that we provided earlier in the third quarter while our gross margin came in below the range of guidance due to product mix. As in prior quarters, during the third quarter we continued to see slowness in our primary telecommunications and networking markets. However, we remain excited about our product development and marketing efforts for our newest market segments, our high performance SigmaQuad radiation-hardened SRAM products targeted at aerospace and defense applications and our patented in-place associative computing technology, or 'APU'. We remain on schedule to complete the design of our initial APU product this quarter, and we have packaged parts of our SigmaQuad radiation hardened SRAM product and expect shipments of our MIL-PRS-38535 Class V equivalent product in calendar 2018.”\n“We recently presented at Stanford University as part of their EE Computer Systems Colloquium (EE380) and at the Global Artificial Intelligence Conference, detailing how our APU helps enable Natural Language Processing (NLP), Machine Learning, and Few-Shot Learning. We also presented an ODSC West Webinar and provided training to multiple organizations in the aerospace & defense sector.\"\nIn the third quarter of fiscal 2018, sales to Nokia (Alcatel-Lucent) were $3.9 million, or 34.7% of net revenues compared to $2.8 million, or 29.0% of net revenues, in the prior quarter and $4.5 million, or 39.5% of net revenues, in the same period a year ago. Direct and indirect sales to Cisco Systems were $565,000 or 5.1% of net revenues, compared to $506,000 or 5.2% of net revenues, in the prior quarter, and $1.1 million, or 9.8% of net revenues, in the same period a year ago. Military/defense sales were 20.7% of shipments compared to 24.4% of shipments in the prior quarter and 15.9% of shipments in the comparable period a year ago. SigmaQuad sales were 54.5% of shipments compared to 39.4% in the prior quarter and 54.2% in the third quarter of fiscal 2017.\nThird-quarter fiscal 2018 operating loss was $(1.0 million), compared to an operating loss of $(1.8 million) in the prior quarter and operating income of $234,000 a year ago. Third-quarter fiscal 2018 net loss included interest and other income of $99,000 and a tax provision of $590,000, compared to $61,000 in interest and other income and a tax benefit of $53,000 a year ago; in the preceding quarter, net loss included interest and other income of $103,000 and a tax provision of $49,000.\nTotal third-quarter pre-tax stock-based compensation expense was $535,000 compared to $508,000 in the prior quarter and $429,000 in the comparable quarter a year ago.\nAt December 31, 2017, the Company had $56.8 million in cash, cash equivalents and short-term investments, $8.2 million in long-term investments, $63.7 million in working capital, no debt, and stockholders' equity of $85.5 million.\nOutlook for Fourth Quarter of Fiscal 2018\nFor the fourth-quarter of fiscal 2018, we currently expect net revenues to be in the range of $10.0 million to $11.0 million, with gross margin in a range of 53% to 55%.\nConference Call\nGSI Technology will review its financial results for the quarter ended December 31, 2017 and discuss its current business outlook during a conference call at 1:30 p.m. Pacific (4:30 p.m. Eastern) today, January 25, 2018. To participate in the teleconference, please call toll-free 866-676-1141 approximately 10 minutes prior to the above start time and provide Conference ID 3698266. You may also listen to the teleconference live via the Internet at www.gsitechnology.com . For those unable to attend, our web site will host an archive of the call.\nAbout GSI Technology\nFounded in 1995, GSI Technology, Inc. is a provider of high performance semiconductor memory solutions to networking, industrial, medical, aerospace and military customers. The company is headquartered in Sunnyvale, California and has sales offices in the Americas, Europe and Asia. For more information, please visit www.gsitechnology.com .\nForward-Looking Statements\nThe statements contained in this press release that are not purely historical are forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding GSI Technology’s expectations, beliefs, intentions, or strategies regarding the future. All forward-looking statements included in this press release are based upon information available to GSI Technology as of the date hereof, and GSI Technology assumes no obligation to update any such forward-looking statements. Forward-looking statements involve a variety of risks and uncertainties, which could cause actual results to those projected. These risks include those associated with the normal quarterly closing process. Examples of other risks that could affect our current expectations regarding future revenues and gross margins include those associated with fluctuations in GSI Technology’s operating results; GSI Technology’s historical dependence on sales to a limited number of customers and fluctuations in the mix of customers and products in any period; the rapidly evolving markets for GSI Technology’s products and uncertainty regarding the development of these markets; the need to develop and introduce new products to offset the historical decline in the average unit selling price of GSI Technology’s products; the challenges of rapid growth followed by periods of contraction; and intensive competition; and delays or unanticipated costs that may be encountered in the development of new products based on our in-place associative computing technology and the establishment of new markets and customer relationships for the sale of such products. Further information regarding these and other risks relating to GSI Technology’s business is contained in the Company’s filings Commission, including those factors discussed under the caption “Risk Factors” in such filings.\nCONTACT :\nGSI Technology, Inc.\nMr. Douglas M. Schirle, CFO\n408-331-9802\nHayden IR\nMr. Dave Fore or Mr. Brett Maas\n206-395-2711\nGSI TECHNOLOGY, INC. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (in thousands, except per share data) (Unaudited) Three Months Ended Nine Months Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Net revenues $ 11,118 $ 9,647 $ 11,484 $ 31,452 $ 37,788 Cost of goods sold 5,443 4,789 4,989 15,315 17,228 Gross profit 5,675 4,858 6,495 16,137 20,560 Operating expenses: Research & development 4,231 4,160 3,813 12,726 11,594 Selling, general and administrative 2,481 2,492 2,448 7,771 7,963 Total operating expenses 6,712 6,652 6,261 20,497 19,557 Operating income (loss) (1,037 ) (1,794 ) 234 (4,360 ) 1,003 Interest and other income (expense), net 99 103 61 300 295 Income (loss) before income taxes (938 ) (1,691 ) 295 (4,060 ) 1,298 Provision (benefit) for income taxes 590 49 (53 ) 720 64 Net income (loss) $ (1,528 ) $ (1,740 ) $ 348 $ (4,780 ) $ 1,234 Net income (loss) per share, basic $ (0.07 ) $ (0.08 ) $ 0.02 $ (0.23 ) $ 0.06 Net income (loss) per share, diluted $ (0.07 ) $ (0.08 ) $ 0.02 $ (0.23 ) $ 0.06 Weighted-average shares used in computing per share amounts: Basic 21,165 21,037 20,300 21,003 20,707 Diluted 21,165 21,037 21,097 21,003 21,239 Stock-based compensation included in the Condensed Consolidated Statements of Operations: Three Months Ended Nine Months Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Cost of goods sold $ 73 $ 66 $ 78 $ 186 $ 209 Research & development 292 284 251 843 712 Selling, general and administrative 170 158 100 492 438 $ 535 $ 508 $ 429 $ 1,521 $ 1,359 Litigation related expenses included in the Condensed Consolidated Statements of Operations: Three Months Ended Nine Months Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Selling, general and administrative $ 77 $ 1 $ 43 $ 131 $ 97\nGSI TECHNOLOGY, INC. CONDENSED CONSOLIDATED BALANCE SHEETS (in thousands) (Unaudited) Dec. 31, 2017 March 31, 2017 Cash and cash equivalents $39,740 $ 33,736 Short-term investments 17,030 16,199 Accounts receivable 5,545 6,349 Inventory 6,795 9,211 Other current assets 2,073 2,777 Net property and equipment 7,667 7,689 Long-term investments 8,199 12,898 Other assets 12,274 13,736 Total assets $99,323 $ 102,595 Current liabilities $7,520 $ 10,474 Long-term liabilities 6,339 5,677 Stockholders' equity 85,464 86,444 Total liabilities and stockholders' equity $99,323 $ 102,595\nSource:GSI Technology, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=5MbSK1FP6IpX46jHH5ud7HubQg0ZNNEKESvXV0KmQtsaBCI0YFGrCYUSr6WpdWB5D3RnbI1McMEDjfQXnVu8kuOQBkNP7Upze6n1_DLcoYE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0d33557b-8ce1-45b5-b5cb-46a355e1f533", "https://www.globenewswire.com/Tracker?data=5MbSK1FP6IpX46jHH5ud7HubQg0ZNNEKESvXV0KmQttpl-UNtNUybSDNxGGpofpLED6qr0HvcgjsEMigeGpHntrbo89S_LN1Jrn_lcmOkfg="], "published": "2018-01-26T00:05:00.000+02:00", "crawled": "2018-01-26T02:54:52.014+02:00", "highlightTitle": ""}