{"organizations": [], "uuid": "606df4115c879466d883706d48d28be1715738cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-petiq-inc-completes-strategic-acquisition-of-vip-petcare.html", "country": "US", "domain_rank": 767, "title": "PetIQ, Inc. Completes Strategic Acquisition of VIP Petcare", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-18T01:06:00.000+02:00", "replies_count": 0, "uuid": "606df4115c879466d883706d48d28be1715738cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-petiq-inc-completes-strategic-acquisition-of-vip-petcare.html", "ord_in_thread": 0, "title": "PetIQ, Inc. Completes Strategic Acquisition of VIP Petcare", "locations": [], "entities": {"persons": [], "locations": [{"name": "idaho", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "east west bank", "sentiment": "none"}], "organizations": [{"name": "inc", "sentiment": "negative"}, {"name": "ares capital management llc", "sentiment": "none"}, {"name": "vip petcare holdings, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAGLE, Idaho, Jan. 17, 2018 (GLOBE NEWSWIRE) -- PetIQ, Inc. (“PetIQ” or the “Company”) (NASDAQ:PETQ), a leading pet medication and wellness company, announced that effective today it has completed the acquisition of Community Veterinary Clinics, LLC d/b/a VIP Petcare (“VIP”), a leading operator and provider of nationwide veterinary clinics and veterinarian services within major U.S. retailers. VIP is now a wholly-owned subsidiary of PetIQ.\nAs part of the transaction, PetIQ paid $100 million in cash, $30 million of promissory notes issued to VIP Petcare Holdings, Inc. (the “Seller”) and approximately $90 million in equity interests. Of the $30 million in promissory notes paid to the Seller, $20 million is payable contingent upon the achievement of certain performance-based financial targets over the next two calendar years. PetIQ financed the cash portion of this transaction with $25 million of existing cash on hand and $75 million of new debt with financing from East West Bank and Ares Capital Management LLC.\n“We are excited to take this tremendous step forward to build upon our existing veterinarian products growth strategy with the acquisition of VIP and its national footprint in the veterinarian services and products industry to create a larger and more diversified pet health and wellness company,” said Cord Christensen, PetIQ’s Chairman and Chief Executive Officer. “We are pleased to welcome Will Santana to our Board of Directors and our senior executive team, and the entire VIP team to the PetIQ family, and look forward to significantly expanding our addressable market, further diversifying and strengthening our national retail customer base to further fuel our continued sales and profit growth.”\nJefferies LLC served as financial advisor and Winston & Strawn LLP served as legal counsel to PetIQ. TM Capital Corp. served as financial advisor and Carle Mackie Power & Ross LLP served as legal counsel to VIP.\nAbout PetIQ\nPetIQ is a rapidly growing pet health and wellness company, with a mission to make pet lives better by educating pet parents on the importance of regular veterinary care and veterinary-recommended pet products and services. PetIQ has given consumers convenient access and affordable choices to a broad portfolio of pet health and wellness products across a network of leading national retail stores in mass, club, grocery, pharmacy, and e-commerce channels. VIP Petcare is a wholly-owned subsidiary of PetIQ and through a nationwide network of community clinics and wellness centers, VIP extends the availability of high value pet preventive and wellness veterinary services to all pet owners. The veterinary services and products VIP offers include diagnostic tests, vaccinations, prescription medications, microchipping and a wellness checks. PetIQ and VIP Petcare believe that pets are an important part of the family and deserve the best pet care we can give them. For more information, visit www.PetIQ.com .\nForward Looking Statements\nThis press release contains forward-looking statements that involve risks and uncertainties, such as statements about our plans, objectives, expectations, assumptions or future events, including the potential benefits and synergies of the acquisition. In some cases, you can identify forward-looking statements by terminology such as “anticipate,” “estimate,” “plan,” “project,” “continuing,” “ongoing,” “expect,” “believe,” “intend,” “may,” “will,” “should,” “could” and similar expressions. Forward-looking statements involve estimates, assumptions, known and unknown risks, uncertainties and other factors that could cause actual results to differ materially from any future results, performances, or achievements expressed or implied by the forward-looking statements. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved. Forward-looking statements are based on information available at the time those statements are made or management's good faith belief as of that time with respect to future events, and are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward-looking statements. Important factors that could cause such differences include, but are not limited to, our dependency on a limited number of customers; our ability to implement our growth strategy effectively; our ability to achieve or sustain profitability; competition from veterinarians and others in our industry; failure of the Fairness to Pet Owners Act of 2017 to become law; reputational damage to our brands; economic trends and spending on pets; the effectiveness of our marketing and trade promotion programs; recalls or withdrawals of our products or product liability claims; our ability to manage our manufacturing and supply chain effectively; disruptions in our manufacturing and distribution chains; our ability to successfully grow our business through acquisitions; our ability to introduce new products and improve existing products; our failure to protect our intellectual property; costs associated with governmental regulation; risks related to our international operations; our ability to keep and retain key employees; and the risks set forth under the “Risk Factors” section of the final prospectus for PetIQ, Inc., dated July 20, 2017, and filed with the SEC on July 21, 2017.\nAdditional risks and uncertainties not currently known to us or that we currently deem to be immaterial also may materially adversely affect our business, financial condition or operating results. The forward-looking statements speak only as of the date on which they are made, and, except as required by law, we undertake no obligation to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events. In addition, we cannot assess the impact of each factor on our business or the extent to which any factor, or combination of factors, including the VIP Petcare transaction and its potential impact, may cause actual results to differ materially from those contained in any forward-looking statements. Consequently, you should not place undue reliance on forward-looking statements.\nCONTACT\nInvestor Relations Contact:\nICR\nKatie Turner\n646-277-1228\nkatie.turner@icrinc.com\nMedia Relations Contact:\nCory Ziskind\nICR\n646-277-1232\ncory.ziskind@icrinc.com\nSource:PetIQ, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8ada3f5f-4a64-41ad-9b76-23f29afed756"], "published": "2018-01-18T01:06:00.000+02:00", "crawled": "2018-01-18T03:21:47.031+02:00", "highlightTitle": ""}