{"organizations": [], "uuid": "37934d4404d56d9fc57f7f7aee9fccae9409f012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 209}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/wyndham-buys-la-quinta-why.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/wyndham-stock-la-quinta-buy/", "country": "US", "domain_rank": 1196, "title": "Wyndham Buys La Quinta for $1.95 Billion: Here's Why | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.156, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "37934d4404d56d9fc57f7f7aee9fccae9409f012"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/18/wyndham-stock-la-quinta-buy/", "ord_in_thread": 0, "title": "Wyndham Buys La Quinta for $1.95 Billion: Here's Why | Fortune", "locations": [], "entities": {"persons": [{"name": "wyndha", "sentiment": "negative"}, {"name": "suntru", "sentiment": "none"}], "locations": [], "organizations": [{"name": "wyndham buys la quinta", "sentiment": "negative"}, {"name": "la quinta", "sentiment": "none"}, {"name": "priceline", "sentiment": "none"}, {"name": "wyndham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 \nIt’s been an ongoing trend for hotels recently—consolidation. \nOn Thursday, Wyndham said it would purchase La Quinta’s franchise and management business for roughly $1.95 billion, including $715 million for assumed debt. Notably, the deal is dependent on La Quinta, a mid-scale hotelier, completing the spinoff of its real estate assets into a real estate investment trust, or REIT, dubbed CorePoint Lodging. Wyndham has also set aside about $240 million for taxes on that spinoff. \nThe deal comes as travelers gravitate towards cheaper options on Airbnb or book their hotel rooms via sites like Priceline (shaving away a cut of hoteliers’ profits). Hotels are also banding together and ridding themselves of real estate to stay competitive. \nThe idea is that by consolidating, companies can combine their resources and cut the overlap. Wyndham, for example, is expecting $55 to $70 million in annual cost savings and revenue boosts resulting from the deal by the end of 2019. \nThe deal also points to an increased focus for hoteliers on their loyalty rewards programs , says SunTrust analyst Patrick Scholes. This is a trend that had its first big bang with Marriott agreeing to buy Starwood for $13.6 billion in 2016. The strategy posits that a larger pool of members will result in more word-of-mouth referrals—accelerating the rate at which hotels can add new members to their programs. \n“It goes along the theme that bigger is better,” said Scholes. “Part of that is the ever-increasing emphasis of customer loyalty programs.” \nAccording to Stifel, following the acquisition, Wyndham Hotels will have some 9,239 locations and 807,600 rooms—making it the largest in the world by number of hotels, and third largest by rooms. La Quinta will also marry its rewards program of 13 million members with that of Wyndham’s, which has 53 million. \nWhat has also likely made La Quinta considerably more attractive in Wyndham’s eyes is the spinoff of its real estate division. Roughly 50% of La Quinta’s inns and hotels are owned by the company itself, making it something of a laggard in an industry where many hoteliers have focused on being more of a franchisor or management company. \n“The spinoff will reduce La Quinta’s business risk by shifting the high-fixed costs associated with owning hotels to CorePoint,” Moodys analyst Peter Trombetta wrote in a recent note. \nLa Quinta is expected to receive 5% of management fees and a 5% royalty rate on revenue from franchised properties in the Corepoint portfolio following the spinoff. \nWyndham, meanwhile, is also in the midst of its own transformation, with the company consolidating its timeshare business and spinning off its hotel sector , where La Quinta will eventually rest, into a separate pure-play hotel firm. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-20T17:58:50.011+02:00", "highlightTitle": ""}