{"organizations": [], "uuid": "84f7e4e9c7033f473a91cc59496cc634a7a391f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223168721&w=1200&r=LYNXMPEE0H261", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-fed-mester/feds-mester-says-further-rate-hikes-in-2018-2019-appropriate-idUSKBN1F73AS", "country": "US", "domain_rank": 408, "title": "Fed's Mester sees three or four rate hikes in 2018 and 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T07:09:00.000+02:00", "replies_count": 0, "uuid": "84f7e4e9c7033f473a91cc59496cc634a7a391f8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-fed-mester/feds-mester-says-further-rate-hikes-in-2018-2019-appropriate-idUSKBN1F73AS", "ord_in_thread": 0, "title": "Fed's Mester sees three or four rate hikes in 2018 and 2019", "locations": [], "entities": {"persons": [{"name": "mester", "sentiment": "negative"}, {"name": "loretta mester", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "negative"}, {"name": "council for economic education", "sentiment": "none"}, {"name": "cleveland federal reserve bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The U.S. Federal Reserve should raise interest rates three to four times in both 2018 and 2019, Cleveland Federal Reserve Bank President Loretta Mester said on Thursday, a pace that is a bit faster than many of her fellow policymakers prefer.\nFueled both by consumer and business spending, the economy should grow at about a 2.5 percent pace this year, though the recently passed tax cuts could drive growth even faster and will continue to provide a lift to the economy next year as well, Mester said.\nUnemployment, now at 4.1 percent, will sink below 4 percent by the end of the year, and inflation, now below the Fed’s 2 percent target, will return to goal within a year or two, she forecast.\n“If the economy evolves as I anticipate, I believe further increases in interest rates will be appropriate this year and next year, at a pace similar to last year’s,” Mester said in a speech to the Council for Economic Education in New York. Responding to a question after her speech, Mester said “three to four” rate hikes in each year reflects her thinking.\nThe rate increases will be gradual enough to allow inflation to reach the Fed’s 2 percent goal, while keeping risks from building in the financial system that could lead to overheating, she said.\nThe Fed increased interest rates by 0.75 percentage point over the course of 2017, to a range of 1.25 percent to 1.5 percent. Policymakers expect to raise their target range another 0.75 percentage point this year and 0.5 percentage point next year, based on the median forecast in the Fed’s latest projections, released in December.\nMester’s comments on Thursday suggest she envisions rates as much as 0.75 percentage point higher than her colleagues do by the end of 2019.\nMester, who has a vote this year on monetary policy under a rotating system, said Thursday that the Trump administration’s tax cuts will likely boost economic growth by a quarter to a half of a percentage point both this year and next, but it could be more. She said she estimates long-run U.S. growth potential at about 2 percent a year, faster than the 1.8 percent seen by most of her colleagues.\nFed policymakers next meet Jan. 30-31 but are expected to put off any rate hike until their March meeting.\nReporting by Ann Saphir; Editing by Leslie Adler\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T07:09:00.000+02:00", "crawled": "2018-01-19T12:32:02.013+02:00", "highlightTitle": ""}