{"organizations": [], "uuid": "65745a1193ed6229694becd841a93b9475910b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-ares-capital-corporation-prices-public-offering-of-600-point-0-million-4-point-250-percent-notes-due-2025.html", "country": "US", "domain_rank": 767, "title": "Ares Capital Corporation Prices Public Offering of $600.0 Million 4.250% Notes Due 2025", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:20:00.000+02:00", "replies_count": 0, "uuid": "65745a1193ed6229694becd841a93b9475910b85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-ares-capital-corporation-prices-public-offering-of-600-point-0-million-4-point-250-percent-notes-due-2025.html", "ord_in_thread": 0, "title": "Ares Capital Corporation Prices Public Offering of $600.0 Million 4.250% Notes Due 2025", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Ares Capital Corporation (Nasdaq:ARCC) announced that it has priced an underwritten public offering of $600.0 million in aggregate principal amount of 4.250% notes due 2025. The notes will mature on March 1, 2025 and may be redeemed in whole or in part at Ares Capital’s option at any time at par plus a “make-whole” premium, if applicable.\nBofA Merrill Lynch, Wells Fargo Securities, SunTrust Robinson Humphrey, BMO Capital Markets, J.P. Morgan and SMBC Nikko are acting as joint book-running managers for this offering. Barclays, Citigroup, Goldman Sachs & Co. LLC, Mizuho Securities, Morgan Stanley and RBC Capital Markets are acting as joint lead managers for this offering. Credit Suisse, MUFG, Santander, US Bancorp, BNY Mellon Capital Markets, LLC, Capital One Securities, Comerica Securities, HSBC Securities (USA) Inc., ICBC Standard Bank, JMP Securities and Keefe, Bruyette & Woods are acting as co-managers for this offering. The offering is expected to close on January 11, 2018, subject to customary closing conditions.\nAres Capital expects to use the net proceeds of this offering to repay certain outstanding indebtedness under its debt facilities. Ares Capital may reborrow under its debt facilities for general corporate purposes, which include investing in portfolio companies in accordance with its investment objective.\nInvestors are advised to carefully consider the investment objective, risks, charges and expenses of Ares Capital before investing. The pricing term sheet dated January 8, 2018, the preliminary prospectus supplement dated January 8, 2018 and the accompanying prospectus dated August 4, 2017, each of which have been filed with the Securities and Exchange Commission, contain this and other information about Ares Capital and should be read carefully before investing.\nThe information in the pricing term sheet, the preliminary prospectus supplement, the accompanying prospectus and this press release is not complete and may be changed. The pricing term sheet, the preliminary prospectus supplement, the accompanying prospectus and this press release are not offers to sell any securities of Ares Capital and are not soliciting an offer to buy such securities in any jurisdiction where such offer and sale is not permitted.\nThe offering may be made only by means of a preliminary prospectus supplement and an accompanying prospectus, copies of which may be obtained from Merrill Lynch, Pierce, Fenner & Smith Incorporated, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte NC 28255-0001, Attn: Prospectus Department, or email dg.prospectus_requests@baml.com ; Wells Fargo Securities, LLC, Attention: WFS Customer Service, 608 2nd Avenue South, Suite 1000, Minneapolis, MN 55402, Attn: WFS Customer Service, or by calling (800) 645-3751, or by email: wfscustomerservice@wellsfargo.com ; or SunTrust Robinson Humphrey, Inc., 303 Peachtree Street, Atlanta, GA 30308, Attn: Prospectus Department, or STRHdocs@SunTrust.com , or telephone: (800) 685-4786.\nABOUT ARES CAPITAL CORPORATION\nAres Capital is a leading specialty finance company that provides one-stop debt and equity financing solutions to U.S. middle market companies and power generation projects. Ares Capital originates and invests in senior secured loans, mezzanine debt and, to a lesser extent, equity investments through its national direct origination platform. Ares Capital’s investment objective is to generate both current income and capital appreciation through debt and equity investments primarily in private companies. Ares Capital has elected to be regulated as a business development company (“BDC”) and as of September 30, 2017, was the largest BDC by total assets and market capitalization. Ares Capital is externally managed by a subsidiary of Ares Management, L.P. (NYSE:ARES), a publicly traded, leading global alternative asset manager.\nFORWARD-LOOKING STATEMENTS\nStatements included herein may constitute “forward-looking statements,” which relate to future events or Ares Capital’s future performance or financial condition. These statements are not guarantees of future performance, condition or results and involve a number of risks and uncertainties. Actual results and conditions may differ materially from those in the forward-looking statements as a result of a number of factors, including those described from time to time in Ares Capital’s filings with the Securities and Exchange Commission. Ares Capital undertakes no duty to update any forward-looking statements made herein.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006890/en/\nInvestor Relations\nAres Capital Corporation\nCarl G. Drake\nJohn Stilmar\n888-818-5298\nSource: Ares Capital Corporation", "external_links": ["http://www.businesswire.com/news/home/20180108006890/en/"], "published": "2018-01-09T01:20:00.000+02:00", "crawled": "2018-01-09T09:37:05.656+02:00", "highlightTitle": ""}