{"organizations": [], "uuid": "9897bdf335850b5aa6011b6bb308fb3bd5ecedb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-edf-nuclearpower-reactors/edf-proposes-shutting-down-some-french-reactors-from-2029-onwards-idUSKBN1FJ1QQ", "country": "US", "domain_rank": 408, "title": "EDF proposes shutting down some French reactors from 2029", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.65, "site_type": "news", "published": "2018-01-30T21:04:00.000+02:00", "replies_count": 0, "uuid": "9897bdf335850b5aa6011b6bb308fb3bd5ecedb0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-edf-nuclearpower-reactors/edf-proposes-shutting-down-some-french-reactors-from-2029-onwards-idUSKBN1FJ1QQ", "ord_in_thread": 0, "title": "EDF proposes shutting down some French reactors from 2029", "locations": [], "entities": {"persons": [{"name": "philippe sasseigne", "sentiment": "none"}, {"name": "emmanuel", "sentiment": "none"}, {"name": "nicolas hulot", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "edf", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - French utility EDF wants to keep most of its nuclear reactors running until at least 2029, a plan that could delay the government’s goal of reducing the share of atomic power in the country’s energy generation.\nPhilippe Sasseigne, EDF’s head of nuclear generation, said on Tuesday the state-controlled company wanted to keep most of its reactors running until they are 50 years old, before embarking on a gradual shutdown from 2029.\nThe position could set EDF on a collision course with Energy and Environment Minister Nicolas Hulot, who wants to get on with reducing the share of nuclear power in France’s electricity generation and has organized a public debate on energy policy.\nThe government is talking to the nuclear industry, energy specialists and renewable energy activists, with the first draft of its “multi-annual energy plan” (PPE) for the periods 2019 to 2023 and 2024 and 2028 due by the end of June.\nThe previous socialist government had pledged to reduce the share of nuclear in power generation to 50 percent by 2025, from 75 percent today, but President Emmanuel Macron’s centrist government has pushed back that target by a decade.\nSasseigne said EDF was contributing to the PPE discussions, adding its nuclear reactors were important to France’s energy transition.\nThe government has decided that EDF, which operates France’s 58 nuclear reactors, must halt its Fessenheim nuclear plant once its new Flamanville 3 nuclear reactor comes online, but has not targeted other individual reactors for closure.\n“We have as objective to keep our other reactors running until the age of 50, which will take us to the first shut-down from 2029. From 2029 to 2035, a number of reactors will be halted at the 50-year mark,” Sasseigne said.\nHe added it would make sense to for the company to continue running the reactors because it had started upgrade works on some already.\n“If we have to shutdown in 2024 - 2025, we have to ask ourselves whether it is necessary to carry out these costly upgrades,” Sasseigne said, adding France would also have to come up with an immediate solution to meet its energy needs.\n“If we have to respect the target of 50 percent nuclear by 2025, I think we’ll have to buy a huge quantity of candles,” he told reporters.\nFrance will decide by the end of this year how many nuclear reactors it wants to close, the energy minister said on Monday.\nRenewables energy advocates have accused the government of hampering discussions about how to reduce the country’s reliance on nuclear energy by limiting debate about more radical alternatives.\n($1 = 0.8033 euros)\nReporting by Bate Felix; Editing by Sudip Kar-Gupta and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T21:04:00.000+02:00", "crawled": "2018-01-31T16:31:15.022+02:00", "highlightTitle": ""}