{"organizations": [], "uuid": "a28a8b5a49c0ec0fe5e0addd421574c5f5d4d4fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-livestock/livestock-weather-cash-prices-rally-cme-live-cattle-futures-idUSL2N1PH1VA", "country": "US", "domain_rank": 408, "title": "LIVESTOCK-Weather, cash prices rally CME live cattle futures", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.187, "site_type": "news", "published": "2018-01-23T06:01:00.000+02:00", "replies_count": 0, "uuid": "a28a8b5a49c0ec0fe5e0addd421574c5f5d4d4fc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-livestock/livestock-weather-cash-prices-rally-cme-live-cattle-futures-idUSL2N1PH1VA", "ord_in_thread": 0, "title": "LIVESTOCK-Weather, cash prices rally CME live cattle futures", "locations": [], "entities": {"persons": [{"name": "don roose", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "u.s. plains", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "chicago mercantile exchange", "sentiment": "negative"}, {"name": "cme", "sentiment": "negative"}, {"name": "u.s. commodities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Theopolis Waters CHICAGO, Jan 22 (Reuters) - Chicago Mercantile Exchange live cattle futures turned higher on Monday, spurred by last Friday's strong cash prices and the start this week of another round of wintry weather in parts of the northern U.S. Plains, traders said. February live cattle finished 1.650 cents per pound at 123.550 cents. April ended up 1.250 cents at 123.975 cents. Drifting snow in feedlots make it difficult to sort cattle and load them onto trucks that face treacherous travel on their way to packing plants. Cattle typically do not gain weight as quickly in cold weather as they consume feed to generate body heat - which limits livestock supplies to packers when they need them. \"It’s all about the weather. Usually when we get a snowstorm we worry about the transportation, setting back the rate of gains and it all adds up to a push higher (in futures),\" said U.S. Commodities president Don Roose. Packers late last week paid roughly $123 per cwt for market-ready, or cash, cattle in the U.S. Plains that a week earlier brought mostly $120. Whether packers will bid up for cattle this week remains to be seen after soft wholesale beef demand and last week's higher cash returns shaved their margins, analysts and traders said. Live cattle futures gains lifted most CME feeder cattle contracts, except January that slipped ahead of its expiration on Thursday. January feeder cattle closed down 0.050 cent per pound at 147.900 cents. Most actively-traded March ended up 0.225 cent at 145.825 cents, and April finished 0.400 cent higher at 146.475 cents. HOG FUTURES CLOSE WEAKER Technical selling and slumping cash prices prior to Monday afternoon pressured CME lean hogs for a second straight session, traders said. Processors in the Western Corn Belt struggled to get supplies as blizzard-like conditions in the region backed up hogs on farms, a trader said. Those animals will eventually have to come to market, resulting in a short-term supply glut later, he said. Grocers bought pork to avoid potential shortages following recent weather-related disruptions at packing plants, traders and analysts said. They added that some processors purchased hams for Easter holiday demand while others put fresh pork bellies into freezers for later use. February hogs settled down 0.275 cent per pound at 71.800 cents. April ended 0.375 cent lower at 75.125 cents and below the 20-day moving average of 75.401 cents. (Reporting by Theopolis Waters; Editing by Susan Thomas)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T06:01:00.000+02:00", "crawled": "2018-01-23T18:18:05.003+02:00", "highlightTitle": ""}