{"organizations": [], "uuid": "7e3484919041628d573b64609ea36dc59d2ad89b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 47}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225055513&w=1200&r=LYNXMPEE0O09N", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-clariant-m-a-sabic/activist-investors-sell-clariant-stake-to-saudis-sabic-idUSKBN1FE0LG", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Activist White Tale sells Clariant stake to Saudi's SABIC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:08:00.000+02:00", "replies_count": 0, "uuid": "7e3484919041628d573b64609ea36dc59d2ad89b"}, "author": "", "url": "https://www.reuters.com/article/us-clariant-m-a-sabic/activist-investors-sell-clariant-stake-to-saudis-sabic-idUSKBN1FE0LG", "ord_in_thread": 0, "title": "UPDATE 1-Activist White Tale sells Clariant stake to Saudi's SABIC", "locations": [], "entities": {"persons": [{"name": "yousef al-benyan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "clariant", "sentiment": "negative"}, {"name": "sabic", "sentiment": "negative"}, {"name": "sabic reuters staff", "sentiment": "none"}, {"name": "saudi basic industries corp", "sentiment": "none"}, {"name": "white tale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "clariant ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH/KHOBAR, Saudi Arabia (Reuters) - Saudi Basic Industries Corp (SABIC) bought a 25 percent stake in Clariant, ending the Swiss speciality chemical group’s fight with activist investors but raising further questions about its future.\nU.S. activists David Winter, David Millstone and hedge fund investor Keith Meister on Thursday announced they had unloaded their stake to SABIC, a surprise given their previous insistence they were long-term Clariant investors.\nSABIC, the world’s number four chemical firm, said it had no current plans to launch a full takeover of Clariant. However, the move stoked uncertainty about Clariant as Saudi Arabia seeks to diversify its economy and reduce its reliance on oil.\n“The story likely isn’t over,” Bank Vontobel analysts said in a note to investors. “This step makes strategic sense for SABIC.”\nSABIC is 70 percent owned by Saudi Arabia’s sovereign wealth fund, Public Investment Fund.\nThe activists last year blocked Clariant’s $20 billion merger with U.S. peer Huntsman, saying it undervalued the Swiss company and did not make strategic sense.\nThe Swiss had also snubbed their demands for an independent strategic review and three seats on its board.\nClariant shares had risen by nearly a third since their then 7.2 percent investment became public in July. The stock slid more than 9 percent in European trading.\nSABIC did not say how much it paid, but the stake is worth around $2.4 billion based on market capitalization. SABIC’s shares were up 1.4 percent, outperforming the benchmark index which was up 0.4 percent.\nGAINING FOOTHOLD Middle Eastern energy players have been eager to expand into more advanced downstream chemicals operations like the catalysts that Clariant produces to help speed up processes at chemicals plants.\nState oil company Saudi Aramco in 2015 bought half the synthetic rubber business of Germany’s Lanxess for around 1.2 billion euros.\n“Clariant AG is complementary to SABIC’s existing specialties business and is well in line with SABIC’s strategy of opening up new growth opportunities in specialty chemicals,” SABIC CEO Yousef al-Benyan said in a statement.\nAl-Benyan had told Reuters in November that SABIC planned to spend $3-10 billion on acquisitions and was looking at two producers of speciality plastics with operations in Europe, the Middle East and China.\nSome analysts do not expect SABIC to stop now. It could seek to convince the second-biggest shareholder group, a family linked to Germany’s Sued-Chemie that Clariant bought in 2011, to sell out.\n“SABIC is not known to be satisfied with minority stakes,” said Baader Helvea analyst Markus Mayer. “As a consequence, I think they’ll try to get the Sued-Chemie families’ 14 percent holding and then make an offer for the rest.”\nSwiss stock exchange rules require those holding more than a third of a company to make an offer for the remainder.\nEXISTING TIES Clariant signaled it was relieved the activist fight was over, saying it was told in advance by “chemical industry peer and partner SABIC” that it had bought the 24.99 percent stake.\nThe Saudi chemical maker had approached the investors over their stake in the past few weeks, a person familiar with details of the discussions said.\nSABIC is already a customer, and the pair have a New Jersey-based partnership that licenses chemical process technology to clients including Huntsman and Akzo Nobel.\n“Clariant intends to engage with SABIC over the coming weeks in order to discuss the new situation and explore possible ways to create value,” the Swiss company said.\nAnalysts said commodity chemicals maker SABIC’s push to diversify fits Clariant’s business, which includes higher-margin catalysts, de-icers for aeroplanes, wildfire retardants and ingredients for shampoo.\n“Clariant will give them the foothold in (the) specialty chemical business,” said Nitin Garg, an analyst at investment bank SICO Bahrain.\nWinter, the scion of a New York real estate family, called the sale a success. He and Millstone began amassing their Clariant stake in 2016.\nBefore selling, their 40 North fund held about 17.5 percent of Clariant, while Meister’s Corvex had 7.6 percent.\n“We are confident that this transaction allows Clariant AG to continue its path to becoming a global specialty chemicals leader,” Winter said.\nHSBC and Credit Suisse advised SABIC, two sources familiar with the matter said. HSBC and Credit Suisse declined comment.\nAdditional reporting by Michael Shields and Oliver Hirt in Zurich, Ludwig Burger in Frankfurt and Saeed Azhar in Dubai, editing by Keith Weir\n ", "external_links": [], "published": "2018-01-25T09:08:00.000+02:00", "crawled": "2018-01-25T09:24:15.004+02:00", "highlightTitle": ""}