{"organizations": [], "uuid": "58d16299fe71daa23b3629abb1a924e7e10acfcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220277944&w=1200&r=LYNXMPEE070VT", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-nuclear-salehi/iran-warns-it-might-reconsider-its-cooperation-with-u-n-nuclear-watchdog-idUSKBN1EX1CL", "country": "US", "domain_rank": 408, "title": "Iran warns it might reconsider its cooperation with U.N. nuclear watchdog", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:06:00.000+02:00", "replies_count": 0, "uuid": "58d16299fe71daa23b3629abb1a924e7e10acfcc"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear-salehi/iran-warns-it-might-reconsider-its-cooperation-with-u-n-nuclear-watchdog-idUSKBN1EX1CL", "ord_in_thread": 0, "title": "Iran warns it might reconsider its cooperation with U.N. nuclear watchdog", "locations": [], "entities": {"persons": [{"name": "yukiya amano", "sentiment": "none"}, {"name": "bozorgmehr sharafedin", "sentiment": "none"}, {"name": "ali akbar salehi", "sentiment": "none"}, {"name": "robin pomeroy", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "jcpoa", "sentiment": "none"}, {"name": "islamic republic of iran", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "iaea", "sentiment": "none"}, {"name": "international atomic energy agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fars", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Iran said on Monday it might reconsider its cooperation with the U.N. nuclear watchdog if the United States failed to respect its commitments in the nuclear deal Tehran struck with world powers in 2015. \nU.S. President Donald Trump must decide by mid-January whether to continue waiving U.S. sanctions on Iran’s oil exports under the terms of the nuclear pact that eased economic pressure on Tehran in exchange for limits on its nuclear program. \nIn October, Trump refused to certify that Iran was complying with the deal, also known by its acronym JCPOA, even though the International Atomic Energy Agency (IAEA) said it was. \n“If the United States does not meet its commitment in the JCPOA, the Islamic Republic of Iran would take decisions that might affect its current cooperation with the International Atomic Energy Agency (IAEA),” Iran’s nuclear chief, Ali Akbar Salehi, was quoted as telling IAEA Director General Yukiya Amano in a phone call. \nThe IAEA is an international organization that seeks to promote the peaceful use of nuclear energy, and is scrutinizing Iran’s compliance with the agreement. \nSupporters of the deal insist that strong international monitoring will prevent Iran from developing nuclear bombs. Iran has denied that it is seeking nuclear weapons. \nIranian foreign ministry spokesman Bahram Qasemi said on Monday that Tehran “would not prejudge the decision that America would take on January 13,” but said it was ready for all possible outcomes and “all options were on the table”. \nDeputy foreign minister Abbas Araghchi said world powers should be ready for a possible U.S. withdrawal from the deal. \n“The international community might come to this conclusion that the United States will withdraw from the JCPOA in the next few days,” Araghchi was quoted as saying by the state news agency IRNA. \n“The international community must be ready for this development,” Araghchi added, warning that such a decision would affect stability in the region. \nTrump is weighing whether the pact serves U.S. security interests, while the other world powers that negotiated it - France, Germany, Britain, Russia and China - still strongly support it. \nU.S. Defense Secretary Jim Mattis said in September that the United States should consider staying in the Iran deal unless it were proven that Tehran was not abiding by the agreement or that it was not in the U.S. national interest to do so. \nReporting by Bozorgmehr Sharafedin; Editing by Robin Pomeroy, William Maclean\n ", "external_links": [], "published": "2018-01-08T16:06:00.000+02:00", "crawled": "2018-01-08T16:21:40.017+02:00", "highlightTitle": ""}