{"organizations": [], "uuid": "89d328e369dcb92ca93b11140a1b1642ab9b8b33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 118, "shares": 118, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/07/103921211-RTX2JL74.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15838459/device/rss/rss.html", "section_title": "Mad Money with Jim Cramer", "url": "https://www.cnbc.com/2018/01/04/cramer-the-us-china-trade-war-could-explode-in-2018.html", "country": "US", "domain_rank": 767, "title": "Cramer: The US-China 'trade war' could explode in 2018", "performance_score": 1, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-05T02:57:00.000+02:00", "replies_count": 0, "uuid": "89d328e369dcb92ca93b11140a1b1642ab9b8b33"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/04/cramer-the-us-china-trade-war-could-explode-in-2018.html", "ord_in_thread": 0, "title": "Cramer: The US-China 'trade war' could explode in 2018", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. department of commerce", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "commerce department", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With the U.S. Department of Commerce on the cusp of deciding whether to place tariffs on steel and aluminum imports, CNBC's Jim Cramer wanted investors to be prepared for the fallout.\n\"We're at a major crossroads when it comes to trade policy in this country, and I think you need to seriously consider the protectionist course of action before you decide to buy international stocks with foreign exposure,\" the \" Mad Money \" host said.\nCramer expected President Donald Trump to move quickly if the Commerce Department, led by Secretary Wilbur Ross , recommends tariffs for purposes of national security.\nChinese \" steel dumping ,\" or the practice of keeping costs artificially low to stymie competition, has become a central concern of Trump's trade policy.\nIf the dumping continues, U.S. steel producers could fall under serious pressure or even shut down because they can't compete, raising the issue to one of national security, Cramer said.\n\"I think there's a good chance that Commerce, run by Wilbur Ross, a tough, no-nonsense guy , will recommend that Section 232 of the Trade Expansion Act should be used to ban those imports, or at least slap some very heavy tariffs on them,\" the \"Mad Money\" host said.\nEnabling Section 232 of the Trade Expansion Act would not only give the United States a better grasp on its strained , yet symbiotic trade relationship with China .\nIt could also bring Democrats and Republicans into rare agreement, the \"Mad Money\" host said.\n\" Both sides of the aisle want to protect this industry — the Democrats from the point of view of labor, the Republicans from the point of view of capital,\" Cramer said. \"President Trump could triangulate this issue and actually do something bipartisan.\"\nBut using Section 232 to uproot trade with China will likely cause a windfall in the stock market, Cramer said. Big industrial stocks with overseas exposure like Caterpillar , United Technologies , General Motors and the perpetually struggling General Electric would sell off, he said.\nStill, Cramer predicted that China would agree to these demands. Why, he wondered, would China sacrifice trade with the United States to produce low-quality metal that pollutes its already smoggy air?\nMoreover, shares of Nucor , a U.S.-based steel producer and a major proponent of Section 232 , have been climbing in the face of the company's weak earnings , suggesting that the move could be more imminent than many market-watchers expect, Cramer said.\n\"I want to steel you ... for the oncoming barrage of stories about how we're in a trade war with China ,\" the \"Mad Money\" host said. \"Breaking news: we've been in one for years. If Wilbur Ross does what I think he will do, the only difference will be that we'll actually finally be fighting back. So be ready; it will happen smack in the middle of earnings season and it definitely isn't baked into the stock market, but it could be your next big buying opportunity.\"\nWATCH: Cramer's take on US-China trade relations show chapters Cramer: The US-China 'trade war' could explode in 2018 20 Hours Ago | 04:46 Disclosure: Cramer's charitable trust owns shares of General Electric and Nucor.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": ["http://instagram.com/jimcramer", "https://twitter.com/MadMoneyOnCNBC", "https://vine.co/u/984542302087651328", "https://www.warren.senate.gov/?p=press_release&id=2002", "https://www.bloomberg.com/news/articles/2017-06-27/nucor-ready-to-pick-up-slack-from-reduced-steel-imports-ceo", "https://twitter.com/jimcramer", "https://www.facebook.com/madmoney?ref=aymt_homepage_panel"], "published": "2018-01-05T02:57:00.000+02:00", "crawled": "2018-01-05T02:02:42.021+02:00", "highlightTitle": ""}