{"organizations": [], "uuid": "baa481396c7b1078cce1e0cb3241042a05e2b6ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226275322&w=1200&r=LYNXMPEE0S0RL", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-cftc-arrests/u-s-authorities-due-to-make-arrests-in-futures-spoofing-probe-sources-idUSKBN1FI19J", "country": "US", "domain_rank": 408, "title": "U.S. authorities due to make arrests in futures 'spoofing' probe -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:25:00.000+02:00", "replies_count": 0, "uuid": "baa481396c7b1078cce1e0cb3241042a05e2b6ee"}, "author": "", "url": "https://www.reuters.com/article/us-usa-cftc-arrests/u-s-authorities-due-to-make-arrests-in-futures-spoofing-probe-sources-idUSKBN1FI19J", "ord_in_thread": 0, "title": "U.S. authorities due to make arrests in futures 'spoofing' probe -sources", "locations": [], "entities": {"persons": [{"name": "michelle", "sentiment": "none"}, {"name": "spo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:33 AM / Updated 17 minutes ago U.S. authorities charge three banks, eight individuals in futures' spoofing' probe Michelle Price 4 Min Read \nWASHINGTON (Reuters) - The U.S. Justice Department and the country’s derivatives regulator said on Monday they had filed civil and criminal charges against three European banks, which paid $46.6 million to settle the cases, and eight individuals for alleged manipulation in U.S. futures and commodities market. \nUBS, Deutsche Bank and HSBC and former traders at the banks, as well as individuals at other firms, were charged following a large-scale multi-agency probe including the Commodity Futures Trading Commission (CFTC) into so-called “spoofing” in metals and equities futures. \nDeutsche Bank and UBS have agreed to pay $30 million and $15 million respectively to settle the civil charges in the case, while HSBC will pay $1.6 million to settle the charges, the CFTC said. \nAll three banks received reduced penalties from the CFTC for providing significant assistance in the investigations. UBS self-reported the alleged misconduct by its traders to the regulator, the CFTC said. \nThe imminent charges were reported earlier by Reuters. \nA spokesman for UBS did not immediately provide comment. \nA spokesman for HSBC said the bank was pleased to have resolved the matter. \nA Deutsche Bank spokesman said the bank “has provided substantial and proactive cooperation with the government’s investigation and has enhanced controls and surveillance to help ensure that the underlying conduct does not occur in the future.” FILE PHOTO: Logos of Deutsche Bank AG are seen in Tokyo July 16, 2014. REUTERS/Toru Hanai/File Photo \nThe case was the first time the Justice Department and the CFTC had worked together to bring both criminal and civil charges against multiple companies and individuals. \nSpoofing, which is a criminal offense under the 2010 Dodd- Frank financial reform law, involves placing bids to buy or offers to sell futures contracts with the intent to cancel them before execution. By creating an illusion of demand, spoofers can influence prices to benefit their market positions. \n“Spoofing is a particularly pernicious example of bad actors seeking to manipulate the market through the abuse of technology,” James McDonald, the CFTC’s head of enforcement, said in a statement on Monday. \n“These cases should send a strong signal that we at the CFTC are committed to identifying individuals responsible for unlawful activity and holding them accountable.” \nReuters first reported the multi-agency probe on Friday. \nIn August, a U.S. appeals court upheld the conviction of former New Jersey-based high-speed trader Michael Coscia who was the first individual to be criminally prosecuted for spoofing. \nThe bank investigations have been going on for more than a year, but the CFTC has pursued the charges against the traders as part of a more recent effort led by McDonald to hold individual employees accountable for corporate wrongdoing, two people with knowledge of the investigation told Reuters on Monday. \nMcDonald, a former prosecutor in the Southern District of New York who was appointed to the CFTC role in March, has said he aims to achieve that by encouraging companies and staff to report their own wrongdoing and cooperate with investigators, in return for more lenient penalties. Reporting by Michelle Price; Editing by Peter Cooney and Frances Kerry", "external_links": [], "published": "2018-01-29T13:25:00.000+02:00", "crawled": "2018-01-29T13:46:57.024+02:00", "highlightTitle": ""}