{"organizations": [], "uuid": "88139dceef953afee102a18a58b6f6c853ea1ce1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-sun-pacific-holding-corp-signs-letter-of-intent-to-purchase-60-acres-of-land-to-build-a-solar-and-wind-farm-with-blockchain.html", "country": "US", "domain_rank": 767, "title": "Sun Pacific Holding Corp. signs Letter of Intent to Purchase 60 acres of land to build a Solar and Wind Farm with Blockchain Technology to Manage the Grid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "88139dceef953afee102a18a58b6f6c853ea1ce1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-sun-pacific-holding-corp-signs-letter-of-intent-to-purchase-60-acres-of-land-to-build-a-solar-and-wind-farm-with-blockchain.html", "ord_in_thread": 0, "title": "Sun Pacific Holding Corp. signs Letter of Intent to Purchase 60 acres of land to build a Solar and Wind Farm with Blockchain Technology to Manage the Grid", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "grid manalapan", "sentiment": "none"}, {"name": "sun pacific", "sentiment": "none"}], "organizations": [{"name": "letter of intent", "sentiment": "neutral"}, {"name": "sun pacific holding corp.", "sentiment": "neutral"}, {"name": "blockchain technology", "sentiment": "none"}, {"name": "sun pacific holding", "sentiment": "none"}, {"name": "national mechanical group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANALAPAN, N.J., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Sun Pacific Holding Corp. (OTCQB: SNPW) is pleased to announce that it has signed a binding Letter of Intent (“LOI”) to acquire a 60-acre parcel of land. This acquisition will be acquired in the wholly owned subsidiary,\nNational Mechanical Group. Sun Pacific is executing on its plan to own, build and manage its alternative energy business segment.\nNational Mechanical Group will build the facility on the 60 acre parcel. Combining both solar power and wind turbines will optimize the alternative energy output of the land. In addition Sun Pacific Holding will utilize the same Blockchain Technology used in cryptocurrency transactions to increase the levels of efficiency. The alternative energy project can provide power to over thousands of homes. Using photovoltaic solar panels and high efficiency wind turbines and the added benefit of management by Blockchain Technology, the energy distribution will be streamlined to the benefit of both the consumer and the company. While crypto Blockchain Technology is relatively new to the energy industry it is already being utilized to streamline the process by matching energy distribution and pricing with demand in real time saving both time and costs.\n“We are pleased to have this agreement to acquire this prime parcel of land to develop solar and wind power” says Mr. Nicholas B Campanella CEO and Chairman. “This acquisition will be an all-stock equity acquisition and adds to our expanding geographic footprint and overall strategy in the state of Rhode Island. With the recent energy initiative by National Grid and the state of Rhode Island green energy initiative, an effort which significantly broadens Rhode Island’s program, we want to be firmly established in the state and solidify our advantage in one of the largest markets in the United States.”\nRenewable Energy Growth Program (REG Program)\nThe Renewable Energy Growth Program (REG Program) will support the development of 160 MW of distributed generation projects in Rhode Island between 2015 and 2019. Eligible technologies include wind, solar, hydropower, and anaerobic digestion.\nAbout Sun Pacific Holding Corp.\nSun Pacific Holding Corp. (OTCQB: SNPW) uses management's knowledge and experience to serve its customers and now its shareholders through quality service and equipment, working to keep customers satisfied, and by doing our part in protecting the environment with smart green technology. For more information, visit www.sunpacificholding.com .\nSafe Harbor and Forward-Looking Statements\nThis news release contains statements that involve expectations, plans or intentions (such as those relating to future expansion or financial results) and other factors discussed from time to time in the Company's OTC Markets filings. These statements are forward-looking and are subject to risks and uncertainties, so actual results may vary materially. You can identify these forward-looking statements by words such as \"may,\" \"should,\" \"expect,\" \"anticipate,\" \"believe,\" \"estimate,\" \"intend,\" \"plan\" and other similar expressions. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of certain factors not within the control of the company. The company cautions readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. The company disclaims any obligation subsequently to revise any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nIR Contact Sun Pacific Holding Corp 215 Gordons Corner Road Manalapan, NJ 07726 Phone: +1 (888) 845-0242 Gabe Rodriguez Email: ir@sunpacificholding.com Website: www.sunpacificholding.com\nSource:Sun Pacific Holding Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=I8mbc7DibwduY65H9ctzR2SAClUgrEqJcgVxZ8Rbnk3-_GAT-OGPvdjkRxje5SjUdp8CrxA_aaxXhffJbEKDzV0ojXpfhsi4SCX9G9asKoGRQI4Oybyb3iK2XMXdcGHe", "https://www.globenewswire.com/Tracker?data=dvgYymcKzHswcEKe94AIwmgbiSIsd8MRIKY1lPO8y_6SJBtOlDWAGx4vy7acQqon0Xxetu7zfP-7ivzzhJKO-UsbvUTveze5T8yXlR7Y-I4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5933e47a-8338-459c-93d1-d71dc87171d1", "https://www.globenewswire.com/Tracker?data=sOBeZkv99Mz-jWpp3T5iUzt8eYmSF2dWqumdqYY2eXrIn05rF9T51gle5mHxFHZsxgiOD_mTAkmvOLxsq0M1xWnp4oFPQnCUWenBPJSiX44=", "https://www.globenewswire.com/Tracker?data=I8mbc7DibwduY65H9ctzR2Q-ib6FgfVrM18V4TcEzfTZsytRfGO0Ft1W6OibhBfSXxM7eNy_MIHGQNyRAzcFOgzVHsb4p0Kdo7XebVoUCPLdm73h5FhuV_89_3sbYd5c"], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:41:08.008+02:00", "highlightTitle": ""}