{"organizations": [], "uuid": "acba0e800083d1e2686d0ad136e4f38784c41d3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226772761&w=1200&r=LYNXMPEE0U022", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/uk-global-forex/dollar-steadies-ahead-of-fed-decision-on-track-for-monthly-loss-idUSKBN1FK05N", "country": "US", "domain_rank": 408, "title": "Dollar steadies ahead of Fed decision, on track for monthly loss", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T09:20:00.000+02:00", "replies_count": 0, "uuid": "acba0e800083d1e2686d0ad136e4f38784c41d3f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-global-forex/dollar-steadies-ahead-of-fed-decision-on-track-for-monthly-loss-idUSKBN1FK05N", "ord_in_thread": 0, "title": "Dollar steadies ahead of Fed decision, on track for monthly loss", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:20 AM / in 2 hours Dollar falls ahead of Fed announcement; euro strengthens Stephanie Kelly 3 Min Read \nNEW YORK (Reuters) - The U.S. dollar was lower on Wednesday ahead of a Federal Reserve policy announcement that was widely expected to leave interest rates unchanged but nod to the strengthening economy, while the euro rose on firm underlying euro zone inflation data. \nAgainst a basket of six currencies, the greenback was down 0.35 percent to 88.846 at 10:23 a.m. ET (1524 GMT), putting it on track to fall nearly 3.5 percent in January, its biggest monthly drop since March 2016. \nThe Fed ends a two-day meeting on monetary policy later on Wednesday. Analysts do not expect any dramatic changes in policy just days before incoming chairman Jerome Powell takes the helm. \n“(The meeting) is very unlikely to create anything, but, if anything, there’s a bit of asymmetric risk to the more hawkish side,” said Richard Scalone, co-head of FX at TJM Brokerage in Boca Raton, Florida. \nIf that were the happen the dollar, which has been steadying after falling dramatically last week, would correct even more, he said. “But I think that would be short-term because, like many, I think longer-term the dollar is more probable to go down than up.” \nTraders are also looking ahead to the U.S. government’s job report on Friday that will include data on nonfarm payrolls and average hourly earnings. \nThe ADP Research Institute said on Wednesday that U.S. private employers added 234,000 workers in January, more than the 185,000 forecast among analysts polled by Reuters. The data did not significantly impact the dollar after it was released. \nMeanwhile, U.S. President Donald Trump’s first State of the Union address on Tuesday night failed to offer any comfort to dollar bulls. \nTrump called on the U.S. Congress to pass legislation to ensure at least $1.5 trillion in new infrastructure spending and urged lawmakers to work toward bipartisan compromises, but he pushed a hard line on immigration. EURO MOVES \nThe euro last climbed 0.49 percent to $1.2461 on Wednesday and was on track for its biggest monthly rise in nearly two years as firm underlying euro zone inflation data for January kept expectations alive for a swift withdrawal of the central bank’s stimulus policies. \nUnderlying inflation, excluding food and energy, - a key measure studied to gauge price pressures in the 19-bloc zone - accelerated to 1.2 percent in January from 1.1 percent a month earlier but broader price gauges slowed. \nThe yen slipped briefly after the Bank of Japan increased its buying of medium-term Japanese government bonds in a move seen as a warning shot against further rises in bond yields. \nThe Japanese yen last weakened 0.13 percent versus the greenback at 108.91 per dollar. \nSterling was last trading at $1.4179, up 0.24 percent on the day. Reporting by Stephanie Kelly; Additional reporting by Saikat Chatterjee; Editing by Andrea Ricci", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T09:20:00.000+02:00", "crawled": "2018-01-31T04:25:38.021+02:00", "highlightTitle": ""}