{"organizations": [], "uuid": "f1588a9d3087a962d6bc788fa9ebc88b6abdf344", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-un-settlements/more-than-200-companies-have-israeli-settlement-ties-u-n-idUSKBN1FK1UO", "country": "US", "domain_rank": 408, "title": "More than 200 companies have Israeli settlement ties: U.N.", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:10:00.000+02:00", "replies_count": 0, "uuid": "f1588a9d3087a962d6bc788fa9ebc88b6abdf344"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-un-settlements/more-than-200-companies-have-israeli-settlement-ties-u-n-idUSKBN1FK1UO", "ord_in_thread": 0, "title": "More than 200 companies have Israeli settlement ties: U.N.", "locations": [], "entities": {"persons": [{"name": "stephanie nebehay", "sentiment": "none"}, {"name": "peter graff", "sentiment": "none"}], "locations": [{"name": "west bank", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "u.n. reuters", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:11 PM / in an hour Israel rejects U.N. report on companies linked to settlements Stephanie Nebehay 4 Min Read \nGENEVA (Reuters) - The United Nations human rights office said on Wednesday it had identified 206 companies doing business linked to unlawful Israeli settlements in the West Bank and it urged them to avoid any complicity in “pervasive” violations against Palestinians. \nIsrael fears that companies listed on any U.N. “blacklist” could be targeted for boycotts or divestment aimed at stepping up pressure over its settlements, which most countries and the world body view as illegal. \n“Businesses play a central role in furthering the establishment, maintenance and expansion of Israeli settlements,” the U.N. report said. \n“In doing so, they are contributing to Israel’s confiscation of land, facilitate the transfer of its population into the Occupied Palestinian Territory and are involved in the exploitation of Palestine’s natural resources,” it said. \nThe majority of the companies, or 143, are domiciled in Israel or the settlements, followed by 22 in the United States, it said. The remainder are based in 19 other countries, including Germany, the Netherlands, France and Britain. \nThe U.N. report did not name the companies and said that its database was not yet complete. \nIsrael’s ambassador Aviva Raz Shechter said her government was still studying the report, launched by a resolution of the U.N. Human Rights Council in March 2016, but rejected the concept as “fundamentally illegitimate”. \n“It is outside the competence and the authority of the Human Rights Council to deal with blacklisting ... This is part of the bias to try to delegitimise Israel,” Raz Shechter told Reuters. \nIsrael did not want to see the U.N. human rights office at the “forefront of a BDS (Boycott, Divestment, Sanction)” movement, she said. \nRaz Shechter declined to discuss any of the Israeli companies or say whether some were state-owned, adding: “Companies are not engaged in any unlawful activities.” \nThe report said that the work in producing the U.N. database “does not purport to constitute a judicial process of any kind”. \nBut businesses operating in the occupied territories have a corporate responsibility to carry out due diligence and consider “whether it is possible to engage in such an environment in a manner that respects human rights”, it said. \nThe office’s mandate was to identify businesses involved in the construction of settlements, surveillance, services including transport, and banking and financial operations such as loans for housing. \nViolations associated with the settlements are “pervasive and devastating, reaching every facet of Palestinian life,” the report said. It cited restrictions on freedom of religion, movement and education and lack of access to land, water and jobs. \nIsrael’s main ally, the United States, says the 47-member Council is stacked with opponents of Israel. U.S. ambassador Nikki Haley told the Council last June that it was reviewing its participation given the forum’s “chronic anti-Israel bias”. \nThe report is to be debated at the U.N. Human Rights Council session of Feb 26-March 23. Reporting by Stephanie Nebehay; Editing by Richard Balmforth and Catherine Evans", "external_links": [], "published": "2018-01-31T15:10:00.000+02:00", "crawled": "2018-01-31T15:18:21.039+02:00", "highlightTitle": ""}