{"organizations": [], "uuid": "6d1131d1a8df45be1c65a6896a461cd7ec9604aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-koss-corp-releases-second-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Koss Corp. Releases Second Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-31T01:15:00.000+02:00", "replies_count": 0, "uuid": "6d1131d1a8df45be1c65a6896a461cd7ec9604aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-koss-corp-releases-second-quarter-results.html", "ord_in_thread": 0, "title": "Koss Corp. Releases Second Quarter Results", "locations": [], "entities": {"persons": [{"name": "michael j. koss", "sentiment": "none"}, {"name": "koss", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "koss corporation", "sentiment": "negative"}, {"name": "koss corp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Koss Corporation (NASDAQ:KOSS), the U.S. based high-fidelity headphone company, has reported its second quarter results for the quarter ended December 31, 2017.\nSales for the second quarter were $5,883,877, which is a 12.02% decrease from sales of $6,687,797 for the same three month period one year ago. The three month net loss was $2,937,721, compared to net income of $140,112 for the second quarter last year. Diluted and basic loss per common share for the quarter was $0.40 compared to income per common share of $0.02 for the three month period one year ago.\n\"With the reduced corporate tax rate in the new tax law, we recorded a significant tax expense to write down deferred tax assets to their future expected value at the new tax rate in addition to increasing the valuation allowance for deferred taxes,\" Michael J. Koss Chairman and CEO said today. \"This tax expense was approximately $3 million even though we had income before taxes for both the December quarter and the first six months.\"\nKoss also explained that sales were off for the quarter primarily due to a decline in sales to OEM accounts and a large order to South America last year that was not repeated this year. Sales to Europe were up with increased sales into Scandinavia. Mass market sales in the US were higher with better product placement than a year ago.\nSales for the six months ended December 31, 2017, decreased 8.3% from $13,036,503 in the same period last year to $11,950,507 in the current year. The six month net loss was $2,920,221 compared to net income of $224,323 for the same period last year. Diluted and basic loss income was $0.40 for the six months ended December 31, 2017 compared to income per common share of $0.03 for the same six month period one year ago.\n\"Sales to OEM customers in Asia accounted for a large portion of the decline in sales for the first six months compared to last year.\" Koss continued, \"Sales in the US were up slightly due to increased sales in the mass market.\"\nKoss Corporation markets a complete line of high-fidelity headphones, wireless Bluetooth® speakers, computer headsets, telecommunications headsets, active noise canceling headphones, wireless headphones, and compact disc recordings of American Symphony Orchestras on the Koss Classics® label.\nThis press release contains . These statements relate to future events or our future financial performance. In some cases, you can identify by terminology such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"may,\" \"will,\" \"should,\" \"forecasts,\" \"predicts,\" \"potential,\" \"continue,\" or the negative of such terms and other comparable terminology. These statements are based on currently available operating, financial and competitive information and are subject to various risks and uncertainties. Actual events or results may differ materially. In evaluating , you should specifically consider various factors that may cause actual results to vary from those contained in the , such as general economic conditions, in particular, consumer demand for the Company's and its customers' products, competitive and technological developments, foreign currency fluctuations, and costs of operations. Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the and are cautioned not to place undue reliance on such . The made herein are only made as of the date of this press release and the Company undertakes no obligation to publicly update such to reflect subsequent events or circumstances or new information. In addition, such uncertainties and other operational matters are discussed further in the Company's quarterly and annual filings with the Securities and Exchange Commission.\nKOSS CORPORATION\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME\n(Unaudited)\nThree Months Ended Six Months Ended December 31 December 31 2017 2016 2017 2016 Net sales $ 5,883,877 $ 6,687,797 $ 11,950,507 $ 13,036,503 Cost of goods sold 3,997,922 4,481,086 8,390,598 8,887,533 Gross profit 1,885,955 2,206,711 3,559,909 4,148,970 Selling, general and administrative expenses 1,800,304 1,987,391 3,448,010 3,763,162 Unauthorized transaction related (recoveries) costs, net (1,771 ) (3,404 ) (16,180 ) 34,096 Interest expense 2,526 118 5,218 964 Income before income tax provision 84,896 222,606 122,861 350,748 Income tax provision 3,022,617 82,494 3,043,082 126,425 Net (loss) income $ (2,937,721 ) $ 140,112 $ (2,920,221 ) $ 224,323 (Loss) income per common share: Basic $ (0.40 ) $ 0.02 $ (0.40 ) $ 0.03 Diluted $ (0.40 ) $ 0.02 $ (0.40 ) $ 0.03 CONTACT:\nMichael J. Koss\nChairman & CEO\n(414) 964-5000\nmjkoss@koss.com\nSource:Koss Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a44882e9-7518-45e7-bdab-5b1290130c9d"], "published": "2018-01-31T01:15:00.000+02:00", "crawled": "2018-01-31T02:15:12.003+02:00", "highlightTitle": ""}