{"organizations": [], "uuid": "5b4421dbf4fa7f2eb70fbad10e1e6c4b5ff0514e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-nuclear-decision/trump-to-extend-sanctions-relief-for-iran-under-nuclear-deal-bloomberg-reporter-idUSKBN1F108F", "country": "US", "domain_rank": 408, "title": "Trump to extend sanctions relief for Iran under nuclear deal: Bloomberg reporter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T05:02:00.000+02:00", "replies_count": 0, "uuid": "5b4421dbf4fa7f2eb70fbad10e1e6c4b5ff0514e"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear-decision/trump-to-extend-sanctions-relief-for-iran-under-nuclear-deal-bloomberg-reporter-idUSKBN1F108F", "ord_in_thread": 0, "title": "Trump to extend sanctions relief for Iran under nuclear deal: Bloomberg reporter", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "frida", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:02 AM / Updated 2 minutes ago Trump issues ultimatum to 'fix' Iran nuclear deal Steve Holland 6 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump on Friday gave the Iran nuclear deal a final reprieve but warned European allies and Congress they had to work with him to “fix the terrible flaws” of the pact or face U.S. withdrawal. \nTrump said he would waive nuclear sanctions against Iran but only as a “last chance” and would not do so again. The ultimatum puts pressure on Europeans - key backers and parties to the 2015 international agreement – to satisfy Trump, who has called the deal “the worst ever.” \nA senior administration official said Trump wants the deal strengthened with a follow-on agreement in 120 days or the United States will unilaterally withdraw from the international pact. \nIranian Foreign Minister Mohammad Javad Zarif responded on Twitter that the deal was not renegotiable and that Trump’s stance “amounts to desperate attempts to undermine a solid multilateral agreement.” \nTrump, who has criticized the deal sharply both as a presidential candidate and since taking office, had privately chafed at having to once again waive sanctions on a country he sees as a rising threat in the Middle East. \n“This is a last chance,” Trump said in a statement. “In the absence of such an agreement, the United States will not again waive sanctions in order to stay in the Iran nuclear deal. And if at any time I judge that such an agreement is not within reach, I will withdraw from the deal immediately.” \nWhile Trump approved the sanctions waiver, the Treasury Department announced new, targeted sanctions against 14 Iranian entities and people. \nTrump had lengthy discussions on Thursday with Secretary of State Rex Tillerson, national security adviser H.R. McMaster and others about the deal, which was reached during the presidency of Democrat Barack Obama. \nTrump now will work with European partners on a follow-on agreement that enshrines certain triggers that the Iranian regime cannot exceed related to ballistic missiles, said a senior administration officials who briefed reporters on the decision. \nOne official said Trump would be open to remaining in a modified deal if it was made permanent. \n“I hereby call on key European countries to join with the United States in fixing significant flaws in the deal, countering Iranian aggression, and supporting the Iranian people,” Trump said in the statement. “If other nations fail to act during this time, I will terminate our deal with Iran.” SEVERAL CONDITIONS \nThe president laid out several conditions for a fix to the deal that would keep the United States in. Iran must allow “immediate inspections at all sites requested by international inspectors,” he said, and that provisions preventing Iran from possessing a nuclear weapon must not expire. Trump said U.S. law must tie long-range missile and nuclear weapons programs together, making any missile testing by Iran subject to “severe sanctions.” FILE PHOTO: Iran's national flags are seen on a square in Tehran February 10, 2012, a day before the anniversary of the Islamic Revolution. REUTERS/Morteza Nikoubazl/File Photo \nTrump wants the U.S. Congress to modify a law that reviews U.S. participation in the nuclear deal to include “trigger points” that if violated would lead to the United States reimposing its sanctions, the official said. \nThis would not entail negotiations with Iran, the official said, but rather would be the result of talks between the United States and its European allies. Work already has begun on this front, the official said. \nTrump has argued behind the scenes that the nuclear deal makes the United States look weak, a senior U.S. official said. The argument for staying in, the official said, was to allow time to toughen the terms of the agreements. \nA decision to withhold a waiver would have effectively ended the deal between Iran, the United States, China, France, Russia, Britain, Germany and the European Union. Those countries would have been unlikely to join the United States in reimposing sanctions. \nTwo senior Trump administration officials told Reuters on Wednesday that the president, a Republican, had privately expressed reluctance to heed the advice of top advisers recommending he not reimpose the suspended sanctions. U.S. President Donald Trump addresses a joint news conference with Norwegian Prime Minister Erna Solberg in the East Room of the White House in Washington, U.S., January 10, 2018. REUTERS/Jonathan Ernst \nHailed by Obama as key to stopping Iran from building a nuclear bomb, the deal lifted economic sanctions in exchange for Tehran limiting its nuclear program but Trump has argued that Obama negotiated a bad deal. PRESSURE FROM EUROPE \nBritain, France and Germany called on Trump on Thursday to uphold the pact. \nIran says its nuclear program is only for peaceful purposes and that it will stick to the accord as long as the other signatories respect it but will “shred” the deal if Washington pulls out. \nThe U.S. Congress requires the president to decide periodically whether to certify Iran’s compliance with the deal and issue a waiver to allow U.S sanctions to remain suspended. \nTrump in October chose not to certify compliance and warned he might ultimately terminate the accord. He accused Iran of “not living up to the spirit” of the agreement even though the International Atomic Energy Agency says Tehran is complying. \nHard-liners on Iran in the U.S. Congress have called for the reimposition of the suspended sanctions and an end to the nuclear deal, while some liberal Democrats want to pass legislation that would make it harder for Trump to pull Washington out without congressional consent. \nTrump and his top advisers have been negotiating with U.S. lawmakers on Capitol Hill to try to change sanctions legislation so that he does not face a deadline on whether to recertify Iranian compliance with the nuclear deal every 90 days. \nSenate Foreign Relations Committee Chairman Bob Corker has been working on amending a U.S. law to include trigger points that if crossed by Iran would automatically bring back U.S. sanctions. Additional reporting by Jeff Mason, Doina Chiacu and David Alexander; Editing by Yara Bayoumy and Bill Trott", "external_links": [], "published": "2018-01-12T05:02:00.000+02:00", "crawled": "2018-01-12T05:28:47.006+02:00", "highlightTitle": ""}