{"organizations": [], "uuid": "b1a73b3ecc36048f6c4028156d775826500e270e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220256526&w=1200&r=LYNXMPEE070PT", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/eurozone-sentiment/euro-zone-confidence-at-multi-year-high-but-inflation-expectations-fall-idINKBN1EX14E", "country": "US", "domain_rank": 408, "title": "Euro zone confidence at multi-year high, but inflation expectations fall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:35:00.000+02:00", "replies_count": 0, "uuid": "b1a73b3ecc36048f6c4028156d775826500e270e"}, "author": "", "url": "https://in.reuters.com/article/eurozone-sentiment/euro-zone-confidence-at-multi-year-high-but-inflation-expectations-fall-idINKBN1EX14E", "ord_in_thread": 0, "title": "Euro zone confidence at multi-year high, but inflation expectations fall", "locations": [], "entities": {"persons": [{"name": "reuters/peter nicholls", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Economic sentiment in the euro zone rose more than expected in December and the business climate indicator hit new highs, European Commission data showed on Monday, underlining robust economic growth in the single currency area.\nProtesters wave the EU and Union flags outside the Palace of Westminster, London, Britain, December 20, 2017. REUTERS/Peter Nicholls The Commission’s economic sentiment indicator rose to 116.0 points in December from 114.6 in November and well above the 114.8 point expectation in a Reuters poll.\nIt was the highest value of the indicator since October 2000. The record was the 119.0 set in May 2000.\nSeparately, the Commission’s business climate indicator, which points to the phase of the business cycle, reached the highest value since measurements began in 1985, hitting 1.66, up from 1.49 in November.\nSentiment in the 19 countries sharing the euro was buoyed by a rise in optimism across all sectors -- in industry, services, retail trade, construction as well as services.\nBut the upbeat mood, while pushing up producer price expectations among manufacturers, has failed to increase consumer inflation expectations which are key to boost inflation to the European Central Bank target of below, but close to 2 percent. Inflation eased to 1.4 percent last month from 1.5 percent in November.\nThe monthly Commission survey showed that consumers’ inflation expectation for the next 12 months fell to a four-month low o f13.6 points in December from 16.0 in November.\nThe slow price growth, which comes despite the euro zone’s strongest economic growth in a decade, may vindicate the ECB’s decision to keep its monetary policy easy despite growing pressure from Germany and other richer euro zone countries.\nThe ECB has said it would continue buying bonds at least until September and keep low interest rates “well past” then to raise inflation to its two percent target even though policymakers from the Netherlands, Germany and other northern countries have voiced their worries about an overly easy policy while economic growth is strong.\nCapital Economics said in a note that, while there might be upside risks to its already above-consensus forecast of 2.3 percent economic growth this year in the euro zone, this would probably not prompt the ECB to adopt its dovish stance.\nReporting By Jan Strupczewski; editing by Philip Blenkinsop\n ", "external_links": [], "published": "2018-01-08T14:35:00.000+02:00", "crawled": "2018-01-08T15:13:09.000+02:00", "highlightTitle": ""}