{"organizations": [], "uuid": "47020e101bf24995037db8bdd0e635a154159a1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-dr-john-mendlein-joins-moderna-as-president-corporate-and-product-strategy.html", "country": "US", "domain_rank": 767, "title": "Dr. John Mendlein Joins Moderna as President, Corporate and Product Strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "47020e101bf24995037db8bdd0e635a154159a1c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-dr-john-mendlein-joins-moderna-as-president-corporate-and-product-strategy.html", "ord_in_thread": 0, "title": "Dr. John Mendlein Joins Moderna as President, Corporate and Product Strategy", "locations": [], "entities": {"persons": [{"name": "john mendlein joins moderna", "sentiment": "negative"}, {"name": "mendlein", "sentiment": "none"}, {"name": "john mendlein", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "stéphane bancel", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "product strategy biotechnology industry veteran to lead company", "sentiment": "negative"}, {"name": "moderna therapeutics", "sentiment": "none"}, {"name": "moderna", "sentiment": "none"}, {"name": "moderna’s executive committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Biotechnology Industry Veteran to Lead Company’s Strategic Growth Initiatives and Help Drive Advancement of mRNA Drug Candidates\nCAMBRIDGE, Mass.--(BUSINESS WIRE)-- Moderna Therapeutics, a clinical stage biotechnology company pioneering messenger RNA (mRNA) therapeutics and vaccines to create a new generation of transformative medicines for patients, today announced that John Mendlein, Ph.D., a current board member and the former CEO of multiple biotechnology companies, has joined Moderna as President, Corporate and Product Strategy. In this role, Dr. Mendlein will be responsible for corporate strategy, product advancement and strategy, partnering and product protection. He will serve on Moderna’s Executive Committee and report to Chief Executive Officer Stéphane Bancel. He will also continue to serve on Moderna’s Board of Directors where he has been a member since 2012.\n“I have had the privilege of working closely with John for almost six years and I am delighted to now bring him into our company where he will contribute to our mission with a unique set of capabilities and experiences, including his scientific expertise and his insights from having run several successful biotech companies,” said Stéphane Bancel, Chief Executive Officer. “We will benefit from his deep product and platform experience ranging from platform development, to the successful transition of product candidates into the clinic, to product and platform protection. John will be a great addition to our executive team, and I am thankful that he decided to deploy his many talents during this important time in the evolution of our organization.”\n“Moderna represents a rare and vast opportunity to change the lives of patients and medicine from vaccines to immuno-oncology to rare diseases to newly emerging areas of its mRNA product engine,” said Dr. Mendlein. “Over the past six years, under Stéphane’s leadership, I witnessed as a board member one of the most remarkable enterprise transformations as the team here took a captivating idea from our Chairman Dr. Noubar Afeyan, applied world-class science, and created an unrivaled product engine that generates high-impact product opportunities for patients at a scale and speed not previously achieved by our industry. The implications of Moderna’s ability to program life with mRNA are both profound and impactful. I feel very lucky and privileged to join the Moderna team at this exciting time and to work with Stéphane and the team to benefit patients and shareholders alike.”\nDr. Mendlein has helped start and lead numerous innovative life sciences companies. He is Vice Chairman of the Board and a founder of Fate Therapeutics, Inc., and holds board positions with Editas Medicine, Inc., and Axcella Health, Inc. He also serves on the Biotechnology Industry Organization (“BIO”) emerging companies board. Dr. Mendlein previously served as the Chief Executive Officer of aTyr Pharma, and Fate Therapeutics, as well as Adnexus Therapeutics, Inc., (acquired by BMS). Before that, he served as Chairman and Chief Executive Officer of Affinium Pharmaceuticals, Ltd. (acquired by Debiopharm Group), and as a board member, General Counsel and Chief Knowledge Officer at Aurora Bioscience Corporation (acquired by Vertex Pharmaceuticals).\nDr. Mendlein holds a Ph.D. in physiology and biophysics from the University of California, Los Angeles, a J.D. from the University of California, Hastings College of the Law, and a B.S. in biology from the University of Miami. Dr. Mendlein is the co-author or co-inventor of over 210 publications and published patents.\nAbout Moderna Therapeutics\nModerna pioneers the discovery and development of messenger RNA (mRNA) therapeutics and vaccines, an entirely new class of medicines that directs the body’s cells to produce intracellular or secreted proteins that can have a therapeutic or preventive benefit for both patients and healthy individuals. With its breakthrough platform, Moderna is creating mRNA medicines for a wide range of diseases and conditions, in many cases by addressing currently undruggable targets or underserved areas of medical need. Moderna is developing its innovative mRNA medicines for infectious diseases, immuno-oncology, rare diseases, and cardiovascular diseases, through solely controlled programs and collaborations with strategic partners.\nHeadquartered in Cambridge, Mass., privately held Moderna currently has strategic relationships with AstraZeneca, Plc. (AZ), Merck, Inc (MRK) and Vertex Pharmaceuticals (VRTX), as well as the Defense Advanced Research Projects Agency (DARPA), an agency of the U.S. Department of Defense; the Biomedical Advanced Research and Development Authority (BARDA), a division of the Office of the Assistant Secretary for Preparedness and Response (ASPR) within the U.S. Department of Health and Human Services (HHS); and the Bill & Melinda Gates Foundation. In 2017 Moderna was ranked a top biopharma industry employer by", "external_links": [], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T17:07:54.014+02:00", "highlightTitle": ""}