{"organizations": [], "uuid": "2e084147df40ba964f11c59e84300654178861bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-conestoga-capital-advisors-names-clewett-president-and-expands-client-service-team.html", "country": "US", "domain_rank": 767, "title": "Conestoga Capital Advisors Names Clewett President and Expands Client Service Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-09T16:48:00.000+02:00", "replies_count": 0, "uuid": "2e084147df40ba964f11c59e84300654178861bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-conestoga-capital-advisors-names-clewett-president-and-expands-client-service-team.html", "ord_in_thread": 0, "title": "Conestoga Capital Advisors Names Clewett President and Expands Client Service Team", "locations": [], "entities": {"persons": [{"name": "mark clewett", "sentiment": "negative"}, {"name": "duane d'orazio", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "robert mitchell", "sentiment": "none"}, {"name": "nancy romito", "sentiment": "none"}, {"name": "joe monahan", "sentiment": "none"}], "locations": [{"name": "expands client service team wayne", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "conestoga capital advisors", "sentiment": "negative"}, {"name": "client service", "sentiment": "none"}, {"name": "conestoga's board of managers", "sentiment": "none"}, {"name": "delaware investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WAYNE, Pa., Jan. Conestoga Capital Advisors, LLC has named Mark Clewett as President and announced the addition of Nancy Romito as a Client Service Officer. Both are intended to enhance the firm's dedication to excellent client service.\nNaming Mark as President formalizes a role that he has played for years, leading the firm's communications with current and prospective clients. Mark joined Conestoga in 2006 as Director of Institutional Sales and Client Service and became a Managing Partner of the firm in 2007. Management of the firm remains with Conestoga's Board of Managers: Robert Mitchell, Duane D'Orazio, Joe Monahan and Mark Clewett.\nRobert Mitchell, Co-Founder and Managing Partner/Portfolio Manager, stated, \"Mark has played a key role in our firm's growth over the past decade. He has done a fantastic job representing our firm and our investment strategies to new and existing clients.\"\nPrior to joining Conestoga, Mark was Senior Vice President of Consultant Relations for Delaware Investments, overseeing institutional consultant relationships, as well as developing new business opportunities and servicing clients. Mark received a Bachelor of Science degree in Finance from the Pennsylvania State University and has earned the right to use the Chartered Financial Analyst® designation.\n\"We are very proud of the growth our firm has realized since its inception and, more importantly, of the high-quality service we have been able to provide our clients,\" said Mark Clewett. \"We look forward to building upon the firm's solid foundation as we continue to deliver servicing programs tailored to the needs of each client, consultant and advisor.\"\nNancy Romito joined Conestoga after nearly 20 years with Kalmar Investments, where she was a Partner and a Client Services Director. During her tenure, she made important contributions to Kalmar's service of both clients and institutional consultants for the firm's Small and SMid cap strategies. Previously, Nancy supported the sales efforts for both Wilmington Trust and PNC Bank. After graduating from West Chester University with a Bachelor of Science degree in Business, she subsequently attended Widener University where she obtained her MBA concentrating in Finance.\nNancy joins a client services team that includes Jeffrey Riggs, Institutional Sales and Client Service Officer, and Michelle Czerpak, Client Service Coordinator.\n\"We are pleased to welcome Nancy to Conestoga. Her considerable experience strengthens our client service team and reinforces our dedication to providing top-notch service,\" said Mark Clewett.\nNancy Romito added, \"I am looking forward to working with the Conestoga team to enhance the firm's servicing capabilities to meet the needs of Conestoga's clients.\"\nAbout Conestoga Capital Advisors, LLC\nHeadquartered in Wayne, PA, Conestoga Capital Advisors, an independent investment advisory firm, manages over $2.7 billion in Small, SMid and Mid Cap growth company portfolios for both institutional and individual investors as of December 31, 2017. Since its founding in 2001, Conestoga has offered investment management services focused on high quality, conservative growth companies. The firm strives for capital appreciation through their consistently applied investment discipline, fundamental research and a patient, long-term approach.\nView original content: http://www.prnewswire.com/news-releases/conestoga-capital-advisors-names-clewett-president-and-expands-client-service-team-300579923.html\nSOURCE Conestoga Capital Advisors, LLC", "external_links": ["http://www.prnewswire.com/news-releases/conestoga-capital-advisors-names-clewett-president-and-expands-client-service-team-300579923.html", "http://www.conestogacapital.com/homepage/"], "published": "2018-01-09T16:48:00.000+02:00", "crawled": "2018-01-09T18:48:31.003+02:00", "highlightTitle": ""}