{"organizations": [], "uuid": "d7fc0fdd9960239506f87669c2fe92d6602c6a1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221236084&w=1200&r=LYNXMPEE0A1RQ", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-monsanto-brazil-dicamba/monsanto-looking-to-sell-dicamba-resistant-gm-soy-seed-in-brazil-idUSKBN1F02SO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Monsanto looking to sell dicamba-resistant GM soy seed in Brazil", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:30:00.000+02:00", "replies_count": 0, "uuid": "d7fc0fdd9960239506f87669c2fe92d6602c6a1f"}, "author": "", "url": "https://www.reuters.com/article/us-monsanto-brazil-dicamba/monsanto-looking-to-sell-dicamba-resistant-gm-soy-seed-in-brazil-idUSKBN1F02SO", "ord_in_thread": 0, "title": "UPDATE 1-Monsanto looking to sell dicamba-resistant GM soy seed in Brazil", "locations": [], "entities": {"persons": [{"name": "roberto samora", "sentiment": "none"}, {"name": "marcelo teixeira", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "mato grosso", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "gm", "sentiment": "negative"}, {"name": "xtend", "sentiment": "none"}, {"name": "monsanto gm", "sentiment": "none"}, {"name": "min read  sao paulo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:33 PM / in 31 minutes Monsanto looking to sell dicamba-resistant GM soy seed in Brazil Marcelo Teixeira , Roberto Samora 3 Min Read \nSAO PAULO (Reuters) - The Brazilian unit of seed and agrochemicals maker Monsanto on Thursday said it will run field tests with genetically modified soy seed INTACTA2 XTEND in Brazil in the 2019-20 crop, looking to launch the variety commercially the following year. \nINTACTA2 XTEND seeds have been engineered to resist some weed killers, including those containing a chemical called dicamba. The use of dicamba-based products caused controversy in the United States last year with accusations that the product drifted and damaged neighboring crops. \nMonsanto said in a statement it will present the new product to Brazilian farmers next week at a fair in Mato Grosso do Sul, in the heart of Brazil’s center-west grain belt. \n“This new technology will boost weed control, particularly of some weed varieties that are resistant to glyphosate,” the company said. \nEarlier generations of Monsanto GM soy seeds contained glyphosate genes, which made them resistant to weed killers based on that chemical. But some weed varieties became resistant to herbicides containing glyphosate, prompting the company to look for new materials. \nBrazilian regulators approved late in 2016 a request from Monsanto to sell the dicamba-resistant seeds, but the company had declined to release plans to market the product in the country until now. \nBrazil is the second-largest soybean producer after the United States and produced a record crop of 114.1 million tonnes last year. It is the world’s top exporter of the oilseed. \nThe United States faced a weed-killer crisis last year caused by new formulations of dicamba-based herbicides, which farmers and weed experts say harmed crops because they evaporate and drift away from where they are applied. \nMonsanto and BASF say the herbicides are safe when properly applied. The manufacturers need to convince U.S. regulators, though, after farmers flooded state agriculture departments with complaints about crop damage associated with the products. \nNationwide, 3.6 million acres of U.S. soybeans, or about 4 percent of plantings, suffered damage associated with dicamba in 2017, according to data from the University of Missouri. \nDicamba-based herbicides will carry tighter usage instructions this year in the United States, and the U.S. Environmental Protection Agency could block sales if complaints persist. Additional reporting by Tom Polansek in Chicago; Editing by Bill Trott", "external_links": [], "published": "2018-01-11T22:30:00.000+02:00", "crawled": "2018-01-11T22:46:59.008+02:00", "highlightTitle": ""}