{"organizations": [], "uuid": "b9f21e0196a7c3e567b9d4f467f7ca792963a5fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-skyline-medical-announces-pricing-of-firm-commitment-public-offering-of-common-stock-and-warrants.html", "country": "US", "domain_rank": 767, "title": "Skyline Medical Announces Pricing of Firm Commitment Public Offering of Common Stock and Warrants", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:35:00.000+02:00", "replies_count": 0, "uuid": "b9f21e0196a7c3e567b9d4f467f7ca792963a5fa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-skyline-medical-announces-pricing-of-firm-commitment-public-offering-of-common-stock-and-warrants.html", "ord_in_thread": 0, "title": "Skyline Medical Announces Pricing of Firm Commitment Public Offering of Common Stock and Warrants", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "skyline medical inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 05, 2018 (GLOBE NEWSWIRE) -- Skyline Medical Inc. (NASDAQ:SKLN) (“Skyline” or “the Company”), producer of the FDA-approved STREAMWAY® System for automated, direct-to-drain medical fluid disposal, today announced the pricing of a firm commitment underwritten public offering of 2,900,000 Units at an offering price of $0.95 per Unit, with each Unit consisting of one share of the Company’s Common Stock and 0.3 of a Series E Warrant, with each whole Series E Warrant purchasing one share of our common stock at an exercise price of $1.00 per whole share. To the extent that the purchase of Units would cause the beneficial ownership of a purchaser in the offering, together with its affiliates and certain related parties, to exceed 4.99% of the Company’s outstanding Common Stock, a number of shares of the Company’s Series D Preferred Stock (Preferred Stock), which is initially convertible on a 1-for-1 basis into Common Stock, will be issued in lieu of shares of Common Stock. The shares of Common Stock, Preferred Stock, and Series E Warrants are immediately separable and will be issued separately.\nDawson James Securities, Inc. is acting as the sole underwriter for the offering.\nGross proceeds to the Company from the offering will be approximately $2,755,000 before deducting underwriting discounts and commissions and other estimated offering expenses payable by the Company. The Company has granted the underwriter a 45-day option to purchase an additional (i) up to 290,000 additional shares of Common Stock at the public offering price per Unit less the price per Series E Warrant included in the Units and less the underwriting discount and/or (ii) additional Series E Warrants to purchase up to 87,000 additional shares of Common Stock at a purchase price of $0.001 per Series E Warrant to cover over-allotments, if any. The Company intends to use the net proceeds from this offering for working capital and general corporate purposes. The offering is expected to close on January 9, 2018, subject to customary closing conditions.\nThe Common Stock is listed on The NASDAQ Capital Market under the symbol \"SKLN.\" There is no trading market for the offered Series D Preferred Stock or Series E Warrants and the Company does not expect a market to develop. In addition, the Company does not intend to apply for listing of the Series D Preferred Stock or Series E Warrants on any national securities exchange.\nThe offering was made by the Company pursuant to a shelf registration statement on Form S-3 declared effective by the Securities and Exchange Commission (\"SEC\") on October 4, 2016. The securities may be offered only by means of a written prospectus forming a part of the effective registration statement. A final prospectus supplement and accompanying prospectus related to the offering will be filed with the SEC and available on the SEC's website located at http://www.sec.gov . Copies of the complete final prospectus supplement and the accompanying base prospectus related to the offering may be obtained from Dawson James Securities, Inc., Attention: Prospectus Department, 1 North Federal Highway, 5th Floor, Boca Raton, FL 33432, or from mmaclaren@dawsonjames.com , or by calling toll free at 866.928.0928.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Skyline Medical\nSkyline Medical produces a fully automated, patented, FDA-cleared waste fluid disposal system that virtually eliminates staff exposure to blood, irrigation fluid and other potentially infectious fluids found in the healthcare environment. Antiquated manual fluid handling methods that require hand carrying and emptying filled fluid canisters present an exposure risk and potential liability. Skyline Medical's STREAMWAY System fully automates the collection, measurement and disposal of waste fluids and is designed to: 1) reduce overhead costs to hospitals and surgical centers; 2) improve compliance with OSHA and other regulatory agency safety guidelines; 3) improve efficiency in the operating room, and radiology and endoscopy departments, thereby leading to greater profitability; and 4) provide greater environmental stewardship by helping to eliminate the approximately 50 million potentially disease-infected canisters that go into landfills each year in the U.S. For additional information, please visit www.skylinemedical.com .\nForward-looking Statements\nCertain of the matters discussed in this announcement contain forward-looking statements that involve material risks to and uncertainties in the Company's business that may cause actual results to differ materially from those anticipated by the statements made herein. Such risks and uncertainties include risks related to the proposed joint ventures, including the need to negotiate the definitive agreements for the joint ventures; possible failure to realize anticipated benefits of the joint ventures; and costs of providing funding to the joint ventures. Other risks and uncertainties relating to the Company include, among other things, current negative operating cash flows and a need for additional funding to finance our operating plan; the terms of any further financing, which may be highly dilutive and may include onerous terms; unexpected costs and operating deficits, and lower than expected sales and revenues; uncertain willingness and ability of customers to adopt new technologies and other factors that may affect further market acceptance, if our product is not accepted by our potential customers, it is unlikely that we will ever become profitable; adverse economic conditions; adverse results of any legal proceedings; the volatility of our operating results and financial condition; inability to attract or retain qualified senior management personnel, including sales and marketing personnel; our ability to establish and maintain the proprietary nature of our technology through the patent process, as well as our ability to possibly license from others patents and patent applications necessary to develop products; the Company's ability to implement its long range business plan for various applications of its technology; the Company's ability to enter into agreements with any necessary marketing and/or distribution partners and with any strategic or joint venture partners; the impact of competition, the obtaining and maintenance of any necessary regulatory clearances applicable to applications of the Company's technology; and management of growth and other risks and uncertainties that may be detailed from time to time in the Company's reports filed with the Securities and Exchange Commission, which are available for review at www.sec.gov . This is not a solicitation to buy or sell securities and does not purport to be an analysis of the Company's financial position. See the Company's most recent Annual Report on Form 10-K, and subsequent reports and other filings at www.sec.gov .\nContacts:\nSkyline Medical\nCarl Schwartz, Chief Executive Officer\n(651) 389-4800\ncschwartz@skylinemedical.com\nInvestors\nKCSA Strategic Communications\nElizabeth Barker\n(212) 896-1203\nskln@kcsa.com\nSource:Skyline Medical Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/50df622d-fd44-4093-a46f-dfb1236eccca", "https://www.globenewswire.com/Tracker?data=L6dCx9pxt6OTje-2LphOked4IbqVwGid1QSJTHXqmcry1gnLJtQZF9nHdGh-JPSFrozW1RCNt7DwTosOFBTAZBJ3_-aKHoh-P59JOsB-nqUyNxmA152eEqvu0ko5yFwoSxBPaO3OUzzoxUXrM-tFwbDk_Na3WF4QCJvL3WbT4VvY0KE_IbJgSumYNdq1C6cQLBnoyNtvMoBNkHiVrQwqMTjQC6LyFzFix3VJDNBw5GM=", "https://www.globenewswire.com/Tracker?data=L6dCx9pxt6OTje-2LphOkUNpH_or-XYJv541PWTVgW9C34ZXoNBh1nMb9YxjOVps7exgdc7SV-gHeyTF9xfrlloI4RkPRlI8lZIpGHcqz-Spfco-Ygt4IgONfexNLa0qMBcRH9NwK3SIQUeH3qlP8pVZ5odC1a9BbfXbdIja4sRZCUiSpg-cuG9u4sEI4_M-TxZ1VaPugoH5MRurf7wENHn9T-tj7gZr6Dp6p_0rrV4=", "https://www.globenewswire.com/Tracker?data=FUtEaDtDz-L9cZ2Fk-Agy2CAg3f9LFe9Y_wFxgNDAxjzlTRtnHHlTkgrS-hX0qm_TOXbQnIz7wPPH71OYQY3Goceqc3AZ7yWeSzTAInl3JKzUDdalDZoxnL_S3gcpb-S3OKar6718PhEx-PIvO2nwKv3J0ZI1dslglDwb4KuqWiOTC7pt2kyazDLSRCMYYnpPZNxmoWpgcnxaKkd3EsvJtypYxXncSBOIW_09nN5msCfq0zwNYt7Dvpn-inmOAxsfPsvZuDfnQqDNX-Y1_pk9g==", "https://www.globenewswire.com/Tracker?data=QOFymcFBJvbeb4u1STXedn-gYp3LO-tnkbY1c1XbL1NTOp3pBme_p18XK_8xFqzIc0IVeC0rWtDhfOgbYmcYEw==", "https://www.globenewswire.com/Tracker?data=G_a0_4XYgIFqpSO4GMzVBQWTM5ycUJrjCONp-YcTtWLtX29-83_ojyy1dwhfW5R0ehwApN0DgshYI7jDESHMzezEyRB_cipaZoVhPb318oGYpZpVErKEX16cJayDLEYW"], "published": "2018-01-05T17:35:00.000+02:00", "crawled": "2018-01-05T20:20:59.022+02:00", "highlightTitle": ""}