{"organizations": [], "uuid": "7c2b7b44bafa5f9185d556eb20f378a8b7584c78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/30/104248906-GettyImages-477583064.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/fitbit-invests-in-sano-diabetes-tech-start-up-to-catch-apple.html", "country": "US", "domain_rank": 767, "title": "Fitbit invests in Sano, diabetes tech start-up, to catch Apple", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:14:00.000+02:00", "replies_count": 0, "uuid": "7c2b7b44bafa5f9185d556eb20f378a8b7584c78"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/05/fitbit-invests-in-sano-diabetes-tech-start-up-to-catch-apple.html", "ord_in_thread": 0, "title": "Fitbit invests in Sano, diabetes tech start-up, to catch Apple", "locations": [], "entities": {"persons": [{"name": "james park", "sentiment": "none"}, {"name": "steve jobs", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}, {"name": "sano", "sentiment": "none"}, {"name": "fitbit", "sentiment": "none"}], "locations": [{"name": "sano", "sentiment": "none"}], "organizations": [{"name": "apple fitbit", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fitbit has made its first-ever start-up investment, putting more than $6 million into an enterprise called Sano, which is developing a coin-sized patch that tracks blood sugar levels to help control diabetes.\nBuilding blood-sugar tracking into a future device could dramatically increase the market for Fitbit devices since more than 100 million Americans are now living with diabetes or pre-diabetes, according to the Centers for Disease Control and Prevention. Fitbit has recently suffered declining sales: It sold 3.6 million devices in the quarter ended Sept. 30 , down from 5.3 million a year earlier.\nApple is known to have a research team working on a noninvasive glucose reader, as CNBC first reported in April . The New York Times in December reported that the project was authorized by late Apple CEO Steve Jobs while embroiled in a personal battle with diabetes, and current CEO Tim Cook has been seen testing a personal glucose monitor.\nThe Apple Watch is Fitbit's most formidable competitor.\n'Looking beyond the device' Fitbit CEO James Park confirmed the Sano deal this week to CNBC. The investment is part of a larger financing round that Sano expects to close in coming months.\n\"This fits into our strategy of looking beyond the device and thinking more about (health) solutions,\" said Park. \"I think the complete solution comes in the form of having some monitoring solution that is coupled with a display, and a wearable that can give you the interventions at the right moment,\" he said.\nFitbit already has partnerships with wearable device makers Medtronic and Dexcom that involve integrating blood sugar data with its consumer hardware. Park declined to say whether a future version of Fitbit's wearable devices will include built-in glucose tracking.\nSano's approach isn't noninvasive like Apple's might be because it involves using tiny needles.\nBut Sano CEO Ashwin Pushpala said it's a less painful option than the current alternatives, which include Abbott's popular FreeStyle Libre, because its device doesn't penetrate as deeply into the skin. It's also a cheaper option that needs to be changed more regularly, he said.\nSano's device won't be ready to hit the market for about a year and is likely intended for people with either Type 1 or Type 2 diabetes, said Pushpala. It might also be used by those who are pre-diabetic, or simply curious about how food and exercise affect their blood sugar.\nBiosensor experts are still debating whether noninvasive approaches for tracking glucose, as Apple is planning, will ever be sufficiently reliable and accurate.\nPharma giants like Johnson & Johnson have unsuccessfully tried to bring this \"holy grail\" to market.\nAlphabet' s Verily is also working on hardware and software diabetics. It is teaming with Dexcom to develop a continuous glucose monitor for people with Type 2 diabetes, and it has a joint venture with Sanofi also targeted to people with the disease. In 2014, its own research team unveiled a prototype for a blood-sugar tracking contact lens.", "external_links": [], "published": "2018-01-05T16:14:00.000+02:00", "crawled": "2018-01-05T16:24:24.051+02:00", "highlightTitle": ""}