{"organizations": [], "uuid": "42e216e5161862e4d253233e2df82dd08d714b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223425623&w=1200&r=LYNXMPEE0I1K1", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-court-immigration/u-s-supreme-court-to-decide-legality-of-trump-travel-ban-idINKBN1F82HI", "country": "US", "domain_rank": 408, "title": "U.S. Supreme Court to decide legality of Trump travel ban", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:40:00.000+02:00", "replies_count": 0, "uuid": "42e216e5161862e4d253233e2df82dd08d714b25"}, "author": "", "url": "https://in.reuters.com/article/usa-court-immigration/u-s-supreme-court-to-decide-legality-of-trump-travel-ban-idINKBN1F82HI", "ord_in_thread": 0, "title": "U.S. Supreme Court to decide legality of Trump travel ban", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "lawrence hurley", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "chad", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "muslim-majority", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Supreme Court on Friday set up a major showdown over presidential powers, agreeing to decide the legality of President Donald Trump’s latest travel ban targeting people from six Muslim-majority countries.\nThe conservative-majority court is due to hear arguments in April and issue a ruling by the end of June on whether the policy violates federal immigration law or the U.S. Constitution’s prohibition on religious discrimination. Trump’s policy, announced in September, blocks entry into the United States of most people from Chad, Iran, Libya, Somalia, Syria and Yemen.\nThe legal fight involves the third version of a contentious policy Trump first sought to implement a week after taking office in January 2017.\nThe Supreme Court on Dec. 4 signalled it was likely to uphold the ban when, on a 7-2 vote, it let it go into full effect while legal challenges by the state of Hawaii and others continued. Lower courts had partially blocked the ban.\nThe Republican president has said the policy is needed to protect the United States from terrorism by Islamic militants.\nThose challenging the travel ban have argued that it was motivated by Trump’s enmity towards Muslims, pressing that point in court with some success by citing statements he made as a candidate and as president.\nAs a candidate, Trump promised “a total and complete shutdown of Muslims entering the United States.” As president, he has rescinded protections for hundreds of thousands of immigrants who were brought into the country illegally as children, sought to ramp up deportations and pursued new measures restricting legal immigration.\nIn November, he shared on Twitter anti-Muslim videos posted by a far-right British political figure.\n“We have always known this case would ultimately be decided by the United States Supreme Court. This will be an important day for justice and the rule of law. We look forward to the court hearing the case,” said Hawaii Attorney General Douglas Chin, a Democrat.\nTrump’s ban also covered people from North Korea and certain government officials from Venezuela, but lower courts had already allowed those provisions to go into effect.\n‘THE NATION‘S INTEREST’\nThe case represents a high-profile test of presidential powers. In court papers, U.S. Solicitor General Noel Francisco, arguing for the Trump administration, said the president has “broad authority to suspend or restrict the entry of aliens outside the United States when he deems it in the nation’s interest.”\nThe latest ban was introduced on Sept. 24 after what Francisco called an “extensive, worldwide review” to determine which foreign governments provide information required by the United States to vet those seeking entry. The countries on the list are those that do not share that information or present “other heightened risk factors,” Francisco said.\nHawaii’s lead lawyer Neal Katyal said in court papers that the president has only limited authority to exclude entry of people from other countries.\nUnder a U.S. law called the Immigration and Nationality Act, a president can restrict entry only of those deemed a potential threat or in certain emergency situations. The law also prohibits discrimination on the basis of nationality.\nThe law does not “surrender to the president a boundless authority to set the rules of entry and override the immigration laws at will,” Katyal said in court papers.\nAfter the current ban was announced, courts in Seattle and Maryland ruled it was unlawful, prompting the administration to appeal. Before the Supreme Court’s December order, the lower courts also had allowed the ban to go into effect for those with no close relatives in the United States or “formal, documented” relationships with U.S.-based entities such as universities and resettlement agencies.\nIn the Hawaii challenge, the San Francisco-based 9th U.S. Circuit Court of Appeals ruled in December that Trump’s ban violated federal immigration law. It did not decide whether the ban violated the Constitution.\nThe American Civil Liberties Union pursued a separate legal challenge filed in Maryland that is now before the Virginia-based 4th U.S. Circuit Court of Appeals.\nReporting by Lawrence Hurley; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-19T21:40:00.000+02:00", "crawled": "2018-01-19T22:03:09.009+02:00", "highlightTitle": ""}